{
  "avg_user_score": 4.3,
  "metascore": 40,
  "mixed_rating_frequency": 172,
  "movie_name": "Jupiter Ascending",
  "negative_rating_frequency": 272,
  "positive_rating_frequency": 180,
  "pro_critic_reviews": [
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2015
      },
      "score": 85,
      "summary": "Who cares if the story is occasionally impenetrable or if some gags land with a thud when the thrills and the eye candy keep coming at such a breathless pace? Jupiter Ascending doesn’t break the new ground that the Wachowskis have managed in the past...but the film never slacks in its efforts to wow us."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2015
      },
      "score": 83,
      "summary": "Fast, frequently teetering on the cusp of the ridiculous, and eye-poppingly pretty, Jupiter Ascending is a wicked slice of entertainment, and a heck of an antidote to the typical February box-office blahs."
    },
    {
      "critic": "Richard Edwards",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2015
      },
      "score": 80,
      "summary": "Both visually and in the action stakes, Jupiter Ascending could give pretty much any space movie a run for its money."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "A film very much of its moment, in ways both good and bad. But the important thing is that its virtues are extraordinary, while its flaws are easy to forget because they’re so common."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "It is, in other words, just a few musical numbers and a whiff of marijuana smoke short of being the Thomas Pynchon book of big-budget, effects-driven movie sci-fi."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 70,
      "summary": "The movie's a fascinating mess, grand and gaudy, often hilarious."
    },
    {
      "critic": "Brad Wheeler",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "A beautiful muddle."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "Jupiter Ascending feels like a truncated, Cliffs Notes version of something that might have worked a lot better as a mini-series. Two hours is too short for this tale and the end result suffers greatly because of that restriction."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 60,
      "summary": "It’s all very chaotic and entertaining, like a bizarre cult sci-fi TV show that somehow survived a threat of mid-season cancellation."
    },
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2015
      },
      "score": 60,
      "summary": "This is one mad mess from start to finish... But the sheer ambition is impossible to ignore, and the sense of fun is infectious: you may fear for your sanity during Jupiter Ascending, but you’ll come out smiling."
    },
    {
      "critic": "Joe McGovern",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 58,
      "summary": "Jupiter Ascending’s early cleverness dries up quickly, especially when Kunis is offscreen, leaving us with just another incoherent sci-fi spectacle."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "It has the kind of jumbled, pseudo-spectacular, overdecorated digital design that the eye and mind can’t really take in. Individual shots can be gorgeous, but there are just too damn many of them, and the overall experience is the visual equivalent of eating an entire wedding cake."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "As for Kunis, she gets to wear some out-of-this-world couture, and gets to make her entrance at a marriage ceremony on a floating dais, kind of like Katy Perry at the Super Bowl."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "I enjoyed this movie more than the last two films from the Wachowskis, the interminable \"Cloud Atlas\" and \"Speed Racer.\" On the other hand, \"The Matrix\" it's not."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "With its nods to the original “Star Trek” and David Lynch’s proto-steampunk hallucination “Dune,” it seduces the eye with filigreed flourishes even as the mind reels from some of the mildewy storytelling."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "Jupiter Ascending is best during its purely visual moments, of which there are many... All of which makes it a shame that the only sense the Wachowskis can count on is their visual one."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "An instant candidate for the so-bad-it’s-sort-of-great hall of fame, Jupiter Ascending is totally bonkers, a sort of black-velvet-Elvis mash-up of “Star Wars’’ and every other sci-fi/fantasy movie of the past half-century right up to “The Hunger Games.”"
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "The movie doesn't really work, but the jet boots would be the envy of Iron Man, and they allow our hero, unwisely named Caine Wise, to speedskate through the air, leaving pretty little trails of light over downtown Chicago."
    },
    {
      "critic": "Chris Klimek",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "Though it strives mightily to compete in every category, it’s not as funny as Guardians, as awe-inspiring as Interstellar, as thrilling as Edge Of Tomorrow, or as provocative as Under The Skin."
    },
    {
      "critic": "Matt Zoller Seitz",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "It's blandly, often listlessly bad, check-the-blockbuster-boxes bad, just-out-of-film-school-and-shopping-a-tentpole-screenplay bad."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "Cinema-goers desperately need a fresh, unusual and franchise-free blockbuster to rally behind, but Jupiter Ascending isn’t it."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "The Wachowskis never lack for ambition. It's in the execution where they run into trouble."
    },
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "Like too much filmed space opera, this is wonderfully imaginative when it comes to costume, art direction, special effects, spaceships and incidental alien creatures but stuck with old-hat character types and a resolutely unspecial storyline. It’s frequently entertaining, but as much for its terrible moments as its inspired touches."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "Even with all its familiar action tropes, less-than-fresh special effects and loopy plotting, the most depressing element in the Wachowski siblings' latest sci-fi mash is that, as they conceive it, human society has been around for more than a billion years but is still presided over by a rivalrous British-style royal family that treacherously behaves as if it were the 1550s."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "While the Wachowskis have always put their greatest emphasis on aesthetics, they allow the visual impulse to get the best of them here, investing so much attention in creating unique fashions, technology, architecture and design that they’ve blinded themselves to the huge logical gaps in their own story."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 38,
      "summary": "Dazzling to behold yet puny of imagination, the movie takes the “Star Wars” formula — hero myths nicked from Joseph Campbell, cutting-edge visual effects, comic-strip dialogue, goofy-looking aliens — and reduces it to generic Big Box shelf product."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 38,
      "summary": "The sci-fi film's reported $175 million budget must have gone largely into loopy production design, wild costumes, outlandish hairstyles and colorful make-up. It certainly didn't go into developing a coherent script or coaching believable performances."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 38,
      "summary": "The film is ntermittently inventive in its visual and physical effects, but its politics are unthinking and obvious, a cheap anti-authoritarian tantrum imbedded in an intergalactic action-melodrama."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 38,
      "summary": "Channing Tatum is a lot of things, but he’s not a stoic Superman like the role he plays here, which is made more laughable by prosthetic pointy ears."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2015
      },
      "score": 38,
      "summary": "An excruciatingly empty chunk of eye candy that spends over two hours trying to convince us they’re not ripping off “Dune.”"
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 37,
      "summary": "It seems that Andy and Lana Wachowski have never lost that childlike ability to dream. But they also haven’t mastered the grown-up power to rein it in. The story they tell in Jupiter Ascending could probably occupy an entire television season. There’s way too much here for one movie to hold."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 30,
      "summary": "While the totality of Jupiter Ascending is just too much for its own massive narrative heft to support, kudos to the Wachowskis for beating back against mainstream Hollywood by casting actors of all races and genders in key roles, something they’ve been doing since their 1996 debut \"Bound.\""
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 25,
      "summary": "The most frustrating thing about the movie (as with “Cloud Atlas”) is that it could’ve been memorable, had the Wachowskis turned their vision over to more talented storytellers."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 25,
      "summary": "This kind of pandering FX padding, unnurtured by humor or heart, is what shifts Jupiter Ascending from a shambles to a fiasco. In an effort to win back audiences by lowering their standards and their daring, the Wachowskis wind up where you never expected to find them creatively: on the ropes."
    },
    {
      "critic": "Jeff Baker",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 25,
      "summary": "The creators of Jupiter Ascending spent $175 million on special effects and 25 cents on a story. Audiences do not get their money's worth."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 25,
      "summary": "Sadly, Jupiter Ascending turns out to be the exact opposite: the worst movie the Wachowskis have ever made."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 20,
      "summary": "Talk about lost in space. The whacked-out outer-space melodrama Jupiter Ascending has embedded in its genes the DNA of “Barbarella” and “Flash Gordon,” some dust from “Dune” and even a bit of Michael Jackson’s Disneyland short “Captain Eo.”"
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 16,
      "summary": "There is an emptiness that lingers around Jupiter Ascending. From the lack of original thought in its conception to the expensive excess in its execution, the directors' usual bag of tricks can't manage to fill the void."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "summary": "Heaping derision on such a woeful debut may be tantamount to shooting fossils in a tar pit. Yet this lumbering industrial enterprise, which was written and directed by the Wachowski siblings, Andy and Lana, is bad enough to be granted landmark status."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "summary": "There’s no defending Jupiter Ascending. There’s no explaining Jupiter Ascending. There’s no way Jupiter Ascending isn’t making an appearance on my list of the Worst Films of 2015."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Not totally bad, but I was expecting for better. This is not very original movie, I reminded me of Thor, and some says it is similar to Guardians of the Galaxy (I didn't watch Guardians).",
      "total_reactions": 3,
      "user": "LadyJesse"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2015
      },
      "score": 9,
      "text": "This movie was great fun. Lots of amazing visuals. Great stunts and action. Funny dialogue - I especially loved the Terry Gilliam \"Brazil\" scene. The plot is ridiculous which was extra entertaining. it has a real Fifth Element vibe - sort of camp and zany and over-the-top - but with a larger budget and much better visual effects. I'm looking forward to the sequel!",
      "total_reactions": 3,
      "user": "nhand42"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "great movie.. have watched 3 times and could watch again.  Some are giving this poor ratings but I'd love to see a part 2. The movie started off fast and kept moving on from there.",
      "total_reactions": 1,
      "user": "tieman123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "To the Wachowski's - Don't let these reviews detract you from continuing your work.  This movie I believe is more of a a revelation masked in an action sci-fi film. This was the best movie since the Matrix.  Even my mother of 65 loved it,  my wife and friends.  As usual so many truths that are are currently hidden to us are meant to be revealed here in a way the general population can digest.  The problem is the population isn't ready for this material yet.   Therefore you see the negative ratings.  Everything from the symbolism of the bees down to the decadence of the ruling elite.  The underlying premise of this movie is closer to reality than most understand.",
      "total_reactions": 8,
      "user": "R_LEE_ERMEY"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "I enjoyed this film.  I felt that the storyline and universe was epic - reminiscent of Frank Herbert's Dune.    There was plenty of action, an interesting storyline and sneaky pop culture references that were amusing.  It felt as though it had been heavily cut, however, and could have easily filled another hour or so.",
      "total_reactions": 8,
      "user": "Teylanna334"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Like it so much I went twice, good sci fi film. Enjoyed the chemistry and humour. Eddy was good at being a bad boy for a change. The second viewing was able to understand more of the film that I missed the first time round. Worth a visit to a big screen to get the full effect.",
      "total_reactions": 8,
      "user": "Lorna"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "This was a fun movie.  There has been a lot said about the movie itself, and they are right.  It is not cinema masterpiece.  What it is, is a fun, sci-fi action movie.  That is it.  Don't expect more.  I would love to see more of this world.  What we saw was very intriguing.  Though, this flopped so badly, I doubt we will see more of that world.",
      "total_reactions": 7,
      "user": "Rifter"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "I love the movie, and I want to watch it again. It has a very interesting storyline and effective actor's play, the visual are very impressive. Some people just could not understand the idea of story, therefore just ignore these critics.",
      "total_reactions": 7,
      "user": "NorthFlo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "Finally saw Jupiter Ascending, and As usually, I wonder where the bad reviews come from. The movie is definitly not \"Good Will Hunting\" or \"Inception\", but it doesnt pretend to be either. In my opinion, it has some strong Luc Besson influences, and I would compare to \"The 5th element\". Its loud, its crazy, its fantasy, its wild. And it doesnt take itself too serious. After watching its grandeur with sets, spaceships and costumes, I knew I want the Wachowskis to do DUNE.",
      "total_reactions": 5,
      "user": "Emme"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "Few movies are visualy as spectacular as Jupiter Ascending. The action scenes are awesome, the universe is beautifuly crafted and the plot is simple, but effective. Ok, Mila Kunis is not the best choice for a protagonist and could use some more acting skills, but overall, the movie is great.",
      "total_reactions": 5,
      "user": "Soujirop"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "My girlfriend and I really loved this movie. We watched it last night and we were thoroughly entertained throughout the whole movie. Critics have once again proved that their opinions are worthless to me. The plot moved along well and held my attention completely. It wasn't difficult to follow. The movie is also a visual feast and contains some incredible action scenes. The acting was good. There was even some philosophic depth to the movie that I appreciated and enjoyed.",
      "total_reactions": 5,
      "user": "SaberEdge"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "I really don't understand all thats bad reviews, this movie, even if you are not a fan of a hardcore sci-fi, must be a A+ just for be PURE CINEMA; incredible landscapes, a great and original universe, incredible action scenes, What people are looking for a epic sci-fi opera? I just don't understand.",
      "total_reactions": 9,
      "user": "fideru"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "A visually beautiful film that easily rivals any other space/sci-fi flick that I can think of. Those who claim the story is confusing didn't pay attention (I thought it was quite simple . . . ) and if you go into the film expecting anything but a fun and engaging action-packed gorgeous space opera then you probably will be disappointed, but honestly I very much enjoyed it. I can't point out any negative aspect of the film.",
      "total_reactions": 12,
      "user": "zeroteque"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Jupiter Ascending is intriguing, enriching and holds a world of it's own, amazingly detailed backdrops and eye candy visuals leave even the simplest of audiences excited. The interesting story comes together well, with the occasional plot hole. However the films biggest downfall is the main leads that never really feel like the fit the genre. Jupiter is a entertaining movie that cry's for a sequel that we may never see.",
      "total_reactions": 8,
      "user": "busbfran"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "The headache inducing action sequences and their clumsiness rival anything Michael Bay has done. The movie made absolutely no sense and i can see their entire budget went to visuals and costumes and none to any professional writers. Channing Tatum looks stupid, Mila Kunis is a miscast and Eddie Redmayne is embarrassing",
      "total_reactions": 7,
      "user": "csw12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "I usually get incredibly bored watching most movies. I am happy to say I really fell in love with the characters and I would watch this again in theaters. Its hard to believe all the negative reviews.",
      "total_reactions": 7,
      "user": "lzpie21"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "Over the top to the extreme, an extended visual orgasm, complete with a Royal Wedding and giant flying lizard people. Yep, that sums up \"Jupiter Ascending\". This movie was not made for the masses.",
      "total_reactions": 7,
      "user": "Daniel-Critic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "After all the bad reviews I was pleasantly surprised with one of the most visually dazzling films I can remember.  Best use of 3-D ever!  Derivative?  Maybe.  But everything they stole the did better than the source.  Except for Eddie Redmayne (who chewed, swallowed and regurgitated the scenery) the acting was quite solid.  The basic story was simple and familiar, making it fairly easy to follow.  The real star of the show was the world-building, turning something apparently heinous into morally ambiguous, which no doubt confused and frightened a lot of moviegoers, especially critics.  See it!  It's worth every penny of your IMAX 3-D premium ticket!",
      "total_reactions": 7,
      "user": "TheLensman"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "This was so much better than the critics are letting on.  Its not a perfect movie by any means,  but its a ton of fun and the visuals are amazing! It has a nice passing and actions sequences are fantastic!",
      "total_reactions": 12,
      "user": "JfreakinD"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "This is a true space opera, in the same vein as Battlestar Galactica and the like. The CG makes the entire movie gorgeous. Mila Kunis shows that she really is a solid actress...and Channing Tatum isn't bad to look at :D The weirdest performance was that of Eddie Redmayne; it's haunting, even overly dramatic, but it's hard to forget. The story is predictable, but it's still a highly entertaining movie. The ending leaves room for some interesting sequels.",
      "total_reactions": 9,
      "user": "docoflove1974"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Great Space based sci-fi movie, very dynamic and immerses you in a different -unique- universe... if you let yourself  to be \"taken\" by the story and avoid holding to some details, it is an exceptional movie, with great visuals, acting and effects.",
      "total_reactions": 6,
      "user": "joslat"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2015
      },
      "score": 3,
      "text": "Such wonderfully imagined concepts have never been so disappointingly unrealised. Some of the cinematography is sublime, but there are many moments which are poorly executed, and the same goes for the world building and costuming.  The performances are forced and clunky, the dialogue is awful, the storyline is full of lofty ideas that are barely explored, and the entire film lacks depth, with a resolution that is thoroughly unsatisfying. A terrible let down on almost every front. 2.31/10",
      "total_reactions": 6,
      "user": "Jess_Hill"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "This movie was actually rather good - better than the recent Star Wars/Star Trek claptrap or interstellar, not as great as Ex Machina, but a nice retelling of the Cinderella Story. Great sets and graphics, an ok soundtrack, very decent writing and good performances throughout. I can't understand the negative ratings all over, I'd have been happy to have seen it in a theater.",
      "total_reactions": 3,
      "user": "norse"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "Okay I enjoyed this movie, the actors did a good job in their assigned roles and the special effects were great, BUT if aliens started shooting up a city on earth there is no way aliens could cover it up, be real it would be on every news channel worldwide so writers you stuffed up on that point. ALso why would aliens 90,000 years ahead of us breed humans for the elixir of life, rubbish they would make it in a testtube. AND this supergalactic empire then turns to a hitchhikers guide segment about red tape admin...HUH. The subplot with his best mate was a wasted space he should have been commanding the starship not living on a bee farm. But I liked the small amount of tension between the leads however she is supposed to be a queen wheres her battle fleet, what she queen of a territory and no army, no sense but if you put aside logic and just have action and CGI then its pretty good.",
      "total_reactions": 3,
      "user": "dougaussie"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "Personally it felt like a modern day Dune. There is an extremely rich universe hinted at in the story, would it expanded on. Watch this without any preconceptions.",
      "total_reactions": 3,
      "user": "Telimakar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "The plot reaches the breaking point at an early stage of it's developments upon the curve of runtime which leaves the supposedly unknown coming scenes pretty much expected. Which takes the film quickly down the curve of 'runtime'.",
      "total_reactions": 3,
      "user": "Anwar-Mkayed"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "All I can say is, after I watched the movie, I felt bad at all the money they must have spent in making this.  With all that money, they could have made a fantastic movie that could have been epic.",
      "total_reactions": 3,
      "user": "reijiro"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2015
      },
      "score": 0,
      "text": "I don't usually review movies but I registered here just so I could review this. This is possibly the worst movie I have ever seen. Struggled through about two thirds of it but it's totally unengaging. The main character, Jupiter Jones appeared to be played by a cardboard cutout with no character or acting ability. This movie is visually cluttered and badly scripted. Reasonable basic premise and storyline, but then it's nicked from an old science fiction story, as most of these kind of movies are. I had my misgivings from the start when I saw it was by the creators of the Matrix, yet another reworking of an old science fiction idea padded out with yawn inducing visual and action sequences.",
      "total_reactions": 3,
      "user": "stuntbaby"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "I think if you go to theater open minded,There is potential that you will love the movie.Graphic effects were excellent.The story will really suck you in to the world which is really Interesting.I really loved it and would recommend you to watch it with an open mind and i Certainly hope you are going to love the movie",
      "total_reactions": 17,
      "user": "Sapra6"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Its not the Matrix for sure but it ain't half bad either. It seems that when a movie has the critical herd against it  then people wont admit to liking it even if they do. The plot is no more ropey than Guardians of the Galaxy which was a critical success. Visually on the big screen ,its beautiful. The actors are all very competent fulfilling their roles. Character nuance isn't the objective here. Baddies are bad and Goodies are good. A homage to Terry Gilliam is included and underneath it all there is possibly a subliminal 1 percenter question re the future of genetics..or maybe I imagined that.",
      "total_reactions": 8,
      "user": "JamesIrish68"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "The visuals knocked my socks off.  Incredible!!  The plot was alittle weak but the visual effects were riveting.",
      "total_reactions": 13,
      "user": "stephensmother"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "Definitely not the clusterf--k so many people are claiming it is.  But certainly no masterpiece either.",
      "total_reactions": 5,
      "user": "BigDegs29"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "I disagree with all the negative critic reviews this film seems to be attracting.  It thought it was a lot of fun with, visually spectacular set pieces, an interesting central idea, a universe that seems fully-realized and thought-out, a strong female lead, and good acting.  Only real complaint was that the chemistry could have been stronger between the leads.",
      "total_reactions": 5,
      "user": "nacthenud"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "I am amazed at the negativity surrounding this movie.  Granted it is a sci-fi picture which turns off a lot of professional movie critics, but seriously, its a sci-fi space opera, and its not supposed to have enormous depth of character, or a profound story line.  Its for fun, entertainment.  I found Jupiter Ascending fun and entertaining.  As mentioned in other reviews, the visual is on overload...from the world building to the fashions.  The story is very fast moving, and in this, I wish they had spent a little more time crafting the plot and having more emotion in the acting, particularly concerning \"harvesting\" or how long should society extend life past a normal 90 years.  It would have been fun to explore more of the world, but maybe this would be better for a game, than a movie.  There's something elegant about the movie.  Maybe its the way the bees react to royalty and the elegantly crafted and thought out world building.  This is probably not a movie for everyone, but it is a fun, fun movie to watch....and then to wonder about the creative energies that went into thinking all that stuff up...",
      "total_reactions": 5,
      "user": "Zowieink"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Do you wonder what the Fifth Element would be like if it were shot today? Hallelujah, at last I do not have to choose between a film that portrays a kick-butt on-screen relationship, and good fight sequences. Mind-blowing fight choreography, battleships, dynastic politics, reincarnation, and lots of eye candy concealing a nugget of pure space gold. Female characters...talking to each other like friends?? A female protagonist who is her own person? Female hero story ... that is... fun? Thank you Wachowski siblings, managin that is a greater feat than teaching Keanu Reeves jujitsu via internet.  I implore you, dear reader, see this future cult classic in the theater while you can.",
      "total_reactions": 5,
      "user": "nerdygirl"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "The first half hour boring but the end makes it. The idea for the base story was new und makes is interesting. Fantastic outfits and I was full flashed by the CGI and visual!",
      "total_reactions": 12,
      "user": "Wurstwasser"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Good flick, very entertaining. Quick pace, good acting, amazing visuals, will go see it again and will purchase when digitally released. Can't understand why it's getting blasted. It almost seems as though they're trying to persuade people not to see it in hopes it will fail. Wonder who the Wachowskis pissed off.",
      "total_reactions": 12,
      "user": "rheign"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "The Wachowski brothers are the most creative visual artist in Hollywood. And they are also great storytellers. Maybe they not excel in all of their casting choices, but still, Jupiter Ascending is one of those films that will keep go on to achieve cult status.",
      "total_reactions": 7,
      "user": "Orw"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "Obviously awful reviews were the deterrent. I went in expecting poor pacing, a shallow story, & terrible writing yet a plethora of relevant characters, good world-building, and a landscape inviting future adventures had successfully been established; as well as the pluses eclipsing the negatives. I enjoyed some of the tech & templates coming straight out of the RPG Shadowrun w/ a less campy Flash Gordon but less serious than the Matrix execution. The identity of the movie made a bumpy ride, but it always recovered. I whole-heartedly recommend Jupiter Ascending & believe a lot of lazy or cowardly bloggers/reviewers passed on forgivable negatives like wildfire. Frame of mind is always crucial going into a movie. I think going in w/ a purpose, to enjoy a space opera, expecting the worst will allow you to enjoy Jupiter to the fullest. The mistakes made with this one should pave the way for an even better sequel, which I look forward to.",
      "total_reactions": 7,
      "user": "Vangerdahast"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "In these reviews, I notice two main groups of people - the ones who like a story, and the ones who like the eye candy. If you only like movies that tell a good story, you shouldn't even bother going - the story is pretty simplistic. The special effects, however, were spectacular. I also definitely liked some of the things they ended up doing with the Sci-Fi and how they introduced Jupiter to the greater universe. I also enjoyed how they explained a great deal of the 'aliens' being human while still including alien races. Despite the story being somewhat simplistic, the universe has great potential for expansion though I'm not sure another movie would be a good medium for it. I'd read the book though. In all fairness, despite the former, the movie and the action scenes got a bit tedious at times, but that's not hard to work around.",
      "total_reactions": 7,
      "user": "Wirespeed"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "Jupiter Ascending is one of the most entertaining movies I've seen for a long while.",
      "total_reactions": 16,
      "user": "andoarias"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "This is a revolutionary scenario and universe which is quite profound, rich, but didn't turn out on the screen because of too many cut scenes. There is an introductory aspect to the movie that feels rushed and confusing, which seems to the the reflection of the state of confusion that the main character is put through. More interesting is the fact that this movie explores the theme of the origin of our species as other movie did recently, such as Prometheus, the notion that we may not be the only intelligent society in the universe. The fundamentals themes remain those of the Wachowskis, very close to the Matrix and Cloud Atlas, a quest for freedom of choice, the fight for the release from slavery, exploitation of the body and mind of Mankind to keep them in an altered state which is the result of a manipulation scheme based on the power of lies and ignorance and the moral consequence that comes from the awakening from those lies. Requires intelligence and attention from viewers that can miss the point. This is not just an action movie with lots of CG...",
      "total_reactions": 9,
      "user": "phch22777"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "Final Fantasy, the Movie, this is it.  This has three times the filmmaking talent, skill and panache of Guardians of he Galaxy, three times as good.  The plots are very comparable in emotional affect, not in storyline.  If you liked the original Star Wars or Guardians... you'll find that style of moviemaking updated and done better here.",
      "total_reactions": 11,
      "user": "HealingToolbox1"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "\"Jupiter Ascending\" 10 Scale Rating: 3.0 (Awful) ...",
      "total_reactions": 11,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "Not that it would matter much: but possible spoilers about a real spoiler. I wanted to love this movie. I did not love this movie. In fact, my 3 rating is high, due to my love for the genre and the Wachowskis. I did love Speed Racer and the Matrix, and I've enjoyed the Wachowskis other movies if not loved. Jupiter Ascending let me down in so many ways. The first half of the movie I found great. Whenever we were on Earth I was pleased. Smiling in my seat. Wowed by the special effects. When we leave Earth it all fell apart. The acting was all very well done, even Tatums. I don't care how well the digital effects are, they just do not move me in anyway. While on earth the gravity boots, the makeup, the digital effects mixed in real-world areas or sets all fantastic. The planet Jupiter was good. The rest just felt so awkward and emotionless. Maybe because we have seen this before, for many years, starting with the oft besmirched star wars. Putting the search for realistic eyes in a digital world aside the story is a complete and utter failure after we leave earth. As if they ran out of story and decided to just repeat what they did on earth in space. More of Kunis character Jupiter falling and being saved by gravity boots. Lots more. This isn't the creative repetition as with the matrix that lets us see the computer world of the matrix is being created on the fly, no this is we have completely run out of time or ideas. Have these movie directors learned nothing from the past? we could have stayed on Earth and armed Jupiter's excellent Russian family and had them fighting with slapstick humor and it would have been a hit. they could have wrote in a story about humans that know of the plot but are helping it along for the love of money. Instead we get repeated extremely lifeless set pieces that we have already seen at the beginning of this movie. So instead, we have another grand missed opportunity. And that is a shame, because no one can do this like the Wachowskis, and every failure will stop more space operas from hitting the big screen. Tisk tisk Wachowski brothers. And tisk tisk to all of your friends who obviously know nothing, or are too afraid to say anything about the course of your creations to you. The moral of the story is you don't need to own galaxies and cleaning up poop ain't so bad as long as you have a wolf-man with flying boots? Did you know you were making such a bad movie so you tried to force feed us an ideal that would let us cope?  Signed: devoted but bewildered fan. I hope you make enough to get another chance. Only because you owe us fans now, you owe us big time.",
      "total_reactions": 14,
      "user": "RealPeople"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Incredible!  From the cast to the story to the special effects to the cinematography to the costumes to the action!  It was epic and I enjoyed every minute of it.  There are very few films that can completely transport you into another world and fascinate you with every element being thrown at you.  This is one of those movies.  I can't wait for the sequel!",
      "total_reactions": 8,
      "user": "Wheelhorse01"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "A fun thrill-ride with gorgeous design, if you're a person who's okay letting imagination run wild. Is it perfect? No. But what movie is?  Did it deserve such bad reviews and derision? No. Just sit back, stop over-analyzing and enjoy it.  I have to do it with every other movie as well.",
      "total_reactions": 8,
      "user": "FullMetalHalo"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "I thought this was a very good movie. A bit slow on the action at times but it wasn't overly dramatic like the Superman movies. As I read these other lists of high metacritic scores I realize that people nowadays prefer the emotional baggage of the more dramatic movies. This one and many others like it that I would watch again get low scores but the mellodramatic or dramatic movies get high ratings. Makes you wonder just who is voting on these shows.",
      "total_reactions": 8,
      "user": "BlueTiger"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "This goofy, likely unintentional, homage to Flash Gordon and the naive science fiction of the 30's is huge fun, not to be taken too seriously. One of the better popcorn movies you'll ever see. The story IS coherent and easy to follow, if . . . . well fun  . . .  naive. I can't imagine anyone free from preconceptions that won't have a lot of fun with this.",
      "total_reactions": 6,
      "user": "genuinerealist"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2015
      },
      "score": 0,
      "text": "piece of **** acting...piece of garbage...piece of banana peel...piece of junk...piece of did i already say that it is a piece of ****................",
      "total_reactions": 4,
      "user": "DeathSlade"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "The movie was worth the wait. The effects are stunning, the premise is compelling and I shed a few tears at the beginning.  The only thing I didn't like was the CGI aliens, they should have stuck with the cool cyberpunk look they had with the bounty hunter trio.",
      "total_reactions": 4,
      "user": "LadyDraon"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "This movie was graphically delicious.  With that said, this is a predictable yawn, sadly.",
      "total_reactions": 4,
      "user": "Gnilleps"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2015
      },
      "score": 0,
      "text": "it took me several days to finish this film because I kept getting bored. What more do you need to know about it? I can't remember being this disappointed by a film. From Cloud Atlas to this claptrap??",
      "total_reactions": 2,
      "user": "lilkillpappy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "If you enjoy slamming your hand in a door, like many in our so skewed culture, then . . . THIS MOVIE IS NOT FOR YOU! That's correct, this movie is actually enjoyable, while still exuding thoughtfulness and depth. Incredibly good movie! A must own in fact!",
      "total_reactions": 2,
      "user": "DarthPreamp"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2015
      },
      "score": 4,
      "text": "Flashy visuals and snazzy action can't save this film. That's because we are left with an underdeveloped plot and a lack of compelling characters. There's a world worth exploring here and what little lore is discussed will make any sci-fi fan dive right in. Especially when they get a look at all of these cool alien races and different fractions. I truly found myself dying to know how they all connected together and interacted with one another. Unfortunately this universe goes unexplored and under-explained while the film focuses on it's own self-contained plot taking place in this fascinating galaxy.",
      "total_reactions": 2,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2015
      },
      "score": 3,
      "text": "A visual feast for your eye but leaves your brain dead. The movie started promisingly but halfway through ends up in a mess. The story just does not hold up and the conclusion wasn't satisfying at all. It looks like none of the actors are really interested; just collecting the paycheck. Watching this movie is a complete waste of time.",
      "total_reactions": 2,
      "user": "Isotopesam"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2015
      },
      "score": 3,
      "text": "This is a really bad one. The story does not engage you at any point, you know what is to happen since it is so predictable, and there is no special acting, score or unique special effects to save it. Nothing. There are a few moments when the characters interact with each other on Earth that are actually a little bit more interesting than all the crap displayed when the effects kick off. Slightly entertaining with some snacks or a few drinks.",
      "total_reactions": 2,
      "user": "sanyrub"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2015
      },
      "score": 4,
      "text": "I managed to sit through almost 100 minutes of this 127 minute long trash called Jupiter Ascending. Ridiculous scripting added with mediocre acting made this movie painful to the eyes and ears..... It would have been netter if this wasnt made. *SPOILERS* : Earth- a real estate property owned by some aliens, and they harvesting humans as if some crops, Whats the deal with that. Anyway its not worth spending your 2 hours on this.",
      "total_reactions": 2,
      "user": "ravikrishhnan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "Very good idea, poor poor execution. This is a movie that was designed for theaters. Hugely impressive visuals and a fun romp through space. Unfortunately, the Wachowskis introduce a hugely interesting universe and then make the politics one dimnessonally simplistic and highly predictable. Moreover, at the end, our hero is simply happy to fly around on levitation boots and ignore all the suffering in the galaxy.",
      "total_reactions": 2,
      "user": "FordPrefect"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2015
      },
      "score": 0,
      "text": "Seriously worst film I have ever seen. Thought about giving it 1 star for the pretty effects but sorry the crappy story and acting actually makes it a minus 10.",
      "total_reactions": 2,
      "user": "rlwright34"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "Not as dumb (or long) as Cloud Atlas but still dumb. I would feel like an idiot describing this movie so others can do that. This film was more like a Disney movie for kids. Stay away!!!!!!!!!!!!!!!",
      "total_reactions": 2,
      "user": "ozymandias79"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "Interstellar..  Watch that instead and thank me later. Poor choice of cast in this left me not caring what happened.  Poorly acted,  outside of the predictable action scenes there was nothing to see here.  Move along.",
      "total_reactions": 2,
      "user": "mboner1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "Despite it's effort,the film falls flat,the plot is just clumsily written.The plot make no sense to me and just felt stupid.The film has a great visual but the characters are just also plain bland.The Film is just frustrating.",
      "total_reactions": 2,
      "user": "JohnKristofer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "The visuals are gorgeous, and make the movie worth seeing.  Unfortunately, the plot really drags, largely because of the main character's uselessness.  Jupiter Jones is kind, sweet, pretty, and utterly gullible.  (Think Twilight's Bella Swan with a delusion of toughness, and without the romantic interest in a creepy stalker.)  I'm normally fine with a character needing to be rescued by the love interest, but most two-hour movies confine it to happening once or twice.  Use the trope more often than that, and it gets both annoying and boring.",
      "total_reactions": 2,
      "user": "alianoraree"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2015
      },
      "score": 0,
      "text": "Completely unrealistic plot on the most base level: unappealing Mila Kunis discovers that she owns the earth and is given planetary powers. She was working as a poor maid cleaning toilets until that became known to her. After a lot of adventure and saving the earth, she decides to go back to scrubbing toilets (literally) for a living as a maid. The sci if stuff is fun, but the basic plot is ludicrously unbelievable. A similar plot would be: a maid wins a billion dollars in the powerball but decides to throw all the money away and scrub toilets for a living instead. Yeah right.",
      "total_reactions": 2,
      "user": "RickBell"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2015
      },
      "score": 0,
      "text": "Bravo, Mr. Wachowski. You too, you unfortunate wife-of-his. You've made yet another terrible sci-fi CGI-fest, devoid of fun, likable characters, or any good lines in the script. I will say to your credit that there are some charming parts, and the cast is pretty solid. But why on Earth, for the main villain, would you reduce Eddie frickin' Redmayne, an Academy award winner, to an awkwardly-dressed brat who screams half his lines and whispers the other half!? And Mila's character is **** too, so it's not like she gets a free pass. She does nothing throughout the film other than get saved, try to get close to Mr. Wolf-eared Tatum, and clean toilets. She makes Princess Peach look like Ellen Ripley! All the other characters in this film are either left without personality or ridiculous to the point of hilarity. The lines in this movie puts the stupidity of Batman and Robin to shame. \"I love dogs.\"? Really? M. Night Shyamalan is cringing at that line! Even Patrick Star can't help but cry at the sound of hearing that! Overall, it's a poorly-executed, poorly-acted, and boring attempt at cashing in on what made Star Wars so great. Too bad Mr. and Mrs. Wachowski. Maybe next movie.",
      "total_reactions": 2,
      "user": "Cooligan46"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 2,
      "text": "Move was just awful. I had really wanted to like this move but it was just BAD. It's a really shame because the visuals are amazing the possibility for a scfi epic are there., Mila Kunis looks amazing in it but acted like she was still Jackie from that 70s show. They tried so hard to get the teen crowd that they dumb ed it down so much nothing is there any longer. Channing Tatum is not my favorite actor by any means but he was decent in this and he wasn't the problem, but he looked more like a Elf then a Wolf.",
      "total_reactions": 25,
      "user": "gpatton71"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "While the movie gets an \"A\" for visual effects, the overall picture was bad. George Clooney once said that he felt the most important part of the movie is the dialogue. This movie is the posture child for the reason is why he is right. The villains all same the same old threats worded in exactly the same way. \"Don't fail me again.\" whispers Eddie Redmayne to his henchmen...ppplleeaasee. The acting is standard, but don't blame the acting on this one. This one dies because of bad dialogue, editing and the inability to connect with the characters. I wanted to walk out 3/4 of the way through because I honestly did not care what happened at the end. The only thing that kept me in my seat was I invested the money and time to see this stinker so I felt obligated to stick it through. I think congrats are in order the director for making  the latest version of Battlefield:Earth, only in 3D. Save your money.",
      "total_reactions": 17,
      "user": "greihing"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "Battlefield Earth for a new generation!  Wanted to leave the cinema after the first five minutes.  **** overblown CGI  effects, unintentionally hilarious performances, camp costumes and dire dialogue make this film an absolute chore to get through.  More fantasy/kids movie than proper sci fi - avoid this one like the plague!",
      "total_reactions": 7,
      "user": "MKUltraman"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "Despite its visual grace better experienced in IMAX 3D, the Wachowski siblings directs a colossal mess in Jupiter Ascending, which serves as both candy for the eye... and candy for the brain.",
      "total_reactions": 7,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Jupiter Ascending was the most FUN I have had at a movie in years.",
      "total_reactions": 7,
      "user": "luxkayden"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "Take a little of Cinderella, first seen cleaning toilets, add her prince or even better put in some DC Comics Superman who can’t fly--well he lost his wings--but does have floating boots that light up and help him skate all over the planetary system. Be sure to have a Lois Lane/Superman flying scene. Oh yes give this guy some pointed ears like Spock fro Star Trek and make sure he leads battle after battle after battle after battle from Star Wars",
      "total_reactions": 12,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "The career of the Wachowski siblings plays out like the Matrix trilogy they directed. It started spectacularly and ever since has taken a downward spiral upto this new colossal mess as Jupiter Ascending, the first blockbuster special-effects-extravaganza film of 2015, is one beautiful blunder.",
      "total_reactions": 12,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "What a f*freaking piece of dog crap this movie was, oh my God. This movie officially kills what career the Wachowski’s had and wastes a great cast including Mila Kunis, Channing Tatum, Sean Bean and Oscar nominee Eddie Redmayne. We are treated to a Star Wars prequel trilogy knock off featuring as interesting dialogue as The Phantom Menace did and the same poorly written romantic dialogue from Attack of the Clones, this movie sucks.",
      "total_reactions": 10,
      "user": "Movi3R3vi3wer"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "The Wachowskis have given us some of the best – and worst – sci-fi of the last decade or so. While they are definitely not the visionary filmmakers they were hailed when \"The Matrix\" was released, they still have a knack for creating beautiful, intriguing worlds and masterful works of imagination. Unfortunately, the universe they brought to life in \"Jupiter Ascending\" is as dull and lifeless as it is gorgeous to look at.",
      "total_reactions": 13,
      "user": "Sithbot"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "An embarrassment of riches!!!",
      "total_reactions": 16,
      "user": "Damion"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "Jupiter's Ascending is a movie that is lush and gorgeous, but fails on it's story potential. The movie kicks off with Jupiter Jones, played by Mila Kunis in a stunning role, who washes toilets for a living, when she finds out that she is a heiress on another planet, a place her cousins are killing each other to take. And then we get introduced to the most cliched cousin/villain of all time, Balem Abrasax, played by Eddie Redmayne. But, Balem wants Jupiter dead, so he hires minions to kill her, however, Jupiter's bodyguard- Caine, played by Channing Tatum, who is half wolf and half human, won't let that happen. This is the kind of stuff JA lacks. The story is mind boggling, it's like putting Enemy and The Matrix together. The Wachowaskis, direct with passion, you can see that they have taken their movies to a whole new level. And that shows, because this movie looked MIND BLOWING. Jupiter's Ascending is a major technical feast, that has some good acting and satisfying action sequences, but all that could have been better, if they could have found a well story to put them in.",
      "total_reactions": 8,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "Really very stunning. Easy to follow, the plot and story are NOT hard to follow. The FX are incredible. I was indeed on the edge of my seat most f the movie.",
      "total_reactions": 11,
      "user": "DWofYVR"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "I came in with low expectations after having read reviews.  I've never seen a film that put so much effort into special effects, and so little effort into the story.  There was actually some interesting dialogue here and there, but was for the most part camp and unimaginative.  While I found the film entertaining, I was left thinking that the producers were simply too lazy to put together a good story, and didn't think enough of us as the audience to care.",
      "total_reactions": 6,
      "user": "donnelbr"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "Since their big hits, the Wachowskis have tried all kinds of promising spectacles, but none have approached the breakthrough status of their \"Matrix\" trilogy. In this one, a woman named Jupiter (Mila Kunis) isn't very happy with her mundane existence, until she's whisked off to another galaxy by a hunky alien (Channing Tatum). She enters a universe where her genetic signature promises amazing things. Sounds cool enough, but the visuals offer nothing that a high-end videogame doesn’t. There are no dazzling new EFX or wondrous concepts, just a lot of hectic, noisy chases and impending-doom drama. It feels like the filmmakers have attempted to assemble a blockbuster by delivering all of the genre's staples, but have ended up with a bland and unexciting derivative.",
      "total_reactions": 6,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "CRAP! CRAP! AND MORE CRAP!!! America is so starved of ideas for movies is just not funny anymore! Ok lets see what we can mix here for style oh - roman mixed with 1920's egyptian with a bit of trash modern try hard and space theme LOL, and then you shove it down our throats and make us pay money!! No wonder people aren't going to the movies anymore. Save your money folks",
      "total_reactions": 6,
      "user": "thankgodforkiwi"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "What should you find in a blockbuster? Well in my opinion you should look at visuals and plot. This movie recieves 10 and 6 respectively. But it is a definite must see and this is why. Critics will ban it for it's plot problems but if you're not taking notes like them and enjoying the movie, you'll be so blown off that you won't see those problems. Just a clue at how the wachowskis excelled at building this fictional universe: You could spin off entire TV series out of and it could potentially turn out like a stargate franchise",
      "total_reactions": 6,
      "user": "Lagaffe"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "If ambition was a gauge of quality then this would be top of the heap, for there is ambition to spare in this new sci fi epic from the Wachowski's. The story of a young toilet cleaner who finds out that she actually \"owns\" the earth this is bonkers, with a capital B! Very little of it makes sense but that really isn't the point. This is a ride, expecting you to climb aboard and hang on for dear life and go with every daft plot twist and turn it throws at you. In any other movie Redmayne's performance would be classed as OTT, camp or just plain bad, but in the context of the world the film creates it all seems to make perfect sense. OK, it's no Guardians Of The Galaxy, but on the plus side, it's not John Carter either!!",
      "total_reactions": 3,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "excellent! seen it three times. watching it again, now. so excuse me...",
      "total_reactions": 3,
      "user": "qev"
    },
    {
      "neg_reactions": 21,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "I wait for this movie since a year and a half, the premise of being a masterpiece. I saw it in IMAX 3D to maximize the experience and I'm not disappointed. This is a great movie, with a good storie, a lot of actions' scenes and specials' effects never seen before, original and graphically beautiful.",
      "total_reactions": 31,
      "user": "bubuche"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "You are at risk of insanity or terminal tedium! Do not go to see the film \"Jupiter Ascending\".  Whatever anyone says this is the most banal, badly scripted film I have ever seen.  You may loose the will to live if you sit through more than 45 minutes of this unadulterated bilge.  Any film where a master of the universe (even if he is currently up for an Oscar in \"The Theory of Everything\") comes up with the line \"My mother never cleaned a toilet in her entire life\" and a dinosaur says \"ooh you hurt me.....\" is beyond parody.",
      "total_reactions": 19,
      "user": "scribbler"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "Remember the Matrix? Great movie. It was completely original. It had many layers and worked well at each one. Well this movie is completely original. Undoubtedly. But it only sorta works on one layer. And even that is iffy. Any deeper meaning is either missing or completely botched. Visually the CG is spectacular. Mila Kunis is a fine leading lady. Sean Bean even has a small part. (Small spoiler, he lives) But the big problem is the plot, and somewhat the dialogue. Many times during this movie I thought. How can something be so smart and so stupid at the same time? Like the gigantic space station which reacts violently with whatever is outside it as soon as it gets a tiny leak. I'm watching amazing space ships travel to exotic words with bizarre aliens. And a disproportionate amount of screen-time is dedicated to Mila Kunis scrubbing toilets. What the heck? Maybe this movie would have worked better as a mini-series, so each of the stories they obviously wanted to tell could be given enough time and told well. And you know what? Maybe then I'd skip the sappy love story episode, and the hard luck immigrant story and enjoy a Sci-Fi political story reminiscent of dune.",
      "total_reactions": 13,
      "user": "Gamed2long"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "All you need to know is that there is a wolf-man Channing Tatum clumsily floating around Chicago with his gravity roller-skates. Did he just grind that fire-escape railing? Oh yes, he did.",
      "total_reactions": 7,
      "user": "ryeca"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "Jupiter Ascending is a good - looking speculate featuring incredible visuals and likable leads. However, the movie fails to chronicle its incredible premise and rather becomes a tedious misfire from The Wachowskis.",
      "total_reactions": 7,
      "user": "HaithamB"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "Beautiful but tedious.",
      "total_reactions": 7,
      "user": "tvnewsguido"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "I loved this movie! I can't remember being this blown away since I saw",
      "total_reactions": 11,
      "user": "scubeesnax"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "This movie was a giant, floating turd in the punchbowl of my otherwise wonderful day off. I got a nap this morning. Ate sushi for lunch. Had some wonderful physical relations with my wife. And was hoping that my day would only get better by watching this movie. Well, fate is a cruel bastard, and after spending no less than $7 on a matinee ticket, I soon found myself giggling at the ridiculous fish-lipped villain and his whispery ways. The movie was so incredibly predictable that during the times that I closed my eyes for an unnecessarily long blink, I used my psychic powers to tell me what would happen next. They threw in some scenes of things breaking for no reason other than to add obstacles for Mila to jump and dodge.",
      "total_reactions": 8,
      "user": "GimpyTreat"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "If you want old school classic science fiction, with modern special effects, look no further.  This is a great film with many thought provoking themes.  Chief among them are the ideas that a vastly superior technological culture works behind the scenes to control society, and that we are just like cattle to them,  ripe for exploitation.",
      "total_reactions": 4,
      "user": "SevenThunders"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "this film is one overlong mess that throws tons of plots at you but goes Absloutly Nowhere with any of them. it feels like this films universe needs to be expanded but theres no comics, video games or short films to expand on the mythos so as a result it comes off as incomplete. the characters are not great especially Mila Kunis character who does absolutely nothing and expects Channing Tatum to come rescue her and the dialogue is insipid. Eddie Redmayne gives the least subtle performance of his career and the 3D was only really worth it in the last 30 minutes and even then it highlighted how much the film is relying on CGI. i will say i enjoyed Sean Bean's performance but his usefulness is very sporadic and i really think the Wachowskis should have only directed this film and handed over the screenplay to another writer because they haven't been on form for a while. as the film stands it's just bad and i really don't want a sequel to be made",
      "total_reactions": 4,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "The Wachowski siblings has always gone huge in their production but this time slightly creative with their own original concept for a science fiction action flick. Aiming to be ambitious, it seems to be the prequel of the fifth story of Cloud Atlas, combining the elements of reincarnation, breeding, creating new lives as motive source and harvesting with their usual cinematography styles, but it turns out to be a bit complex for squeezing these daring ideas into a rushing two hours in which a number of unnecessarily silly parts should have been replaced to develop the whole universe in details. It has the nostalgic moments thanks to the amazing reconstruction of certain Cloud Atlas scores by Michael Giacchino, the performances from the cast however is a bit mixed - nothing surprise from Tatum and Kunis thanks to the cheesy dialogues, but Eddie Redmayne as the main antagonist role looks promising though with limited screen time. Overall, this new version of Star Wars space universe is still an enjoying formulaic blockbuster with its intense actions and eye popping visual effects even if the directors themselves ended up confused and misfiring ambitious at the wrong directions.",
      "total_reactions": 4,
      "user": "michael1208"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "The first thing you see in this movie is an awesome opening scene, cool special effects, nice and fast action, and intriguing characters, so you think “wow, this film is going to be awesome!”, and then it moves forward and you realize how wrong you were before. Jupiter Ascending is just a long run time full of extremely long and boring conversations that no one cares about. There are barely some action scenes. It has some cool stuff, the “flying” shoes, beautiful protagonist, some excellent CGI (for the most part) and good acting (mainly by Eddie Redmayne), but it is almost entirely just long and boring. The movie’s protagonist is yet another female character who can’t do the things by herself and need always a male character by her side (in this case, Chaning Tatum).",
      "total_reactions": 4,
      "user": "Dokalu"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "I saw a 4DX showing of this film and thought it was AMAZING! I'd give the film an 8 as I enjoyed the story and the film as a whole much better than I was expecting, and an extra 2 points for the 4DX effects - 3D, wind, water, moving seats, smoke and smells. I thought it would be gimmicky but it was fantastic fun and really added something to the film.",
      "total_reactions": 5,
      "user": "djnicey"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "Terrible movie!!!  Beautiful visuals (which is why I gave it a 3) but such a stupid story, and ridiculously naive behavior by our heroine - who does nothing smart with her new found power throughout the entire movie!  (All she does is wonder where her boyfriend is.  Ughhhhhhhhhh.)  Maybe the story will appeal to pre-teens but any adult will find this story simplistic, ridiculous and lame.  A space-age Cinderella story with a twist:  she happily goes back to cleaning toilets at the end!  Oh, but she has her booooooooofriend, so I guess all is well with the universe.  OMG - SO LAME!!!  I can barely believe they did the Matrix series after seeing that horrible movie!",
      "total_reactions": 5,
      "user": "Raygirl"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "This gets my minimum rating for a Wachowski movie.  5 points for visuals and general goofiness, 0 points for everything else.  Word to the wise - this movie is EXCEPTIONALLY stupid.  Probably on par with Lucy, but in outer space.  So if you think Lucy was a thoughtful movie, then this one is for you.  Otherwise...",
      "total_reactions": 5,
      "user": "ScrawnyPunk"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 2,
      "text": "It would be proof that the best visual effects and production value money can buy don't make a good movie except that even the visuals are nothing so great we haven't all seen before ad nauseum.  Creatively it's all tired recycled elements adding up to one hell of an excruciating bore with dire little skill in story-telling.",
      "total_reactions": 5,
      "user": "AxeT"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "Once again I fell prey of an incredibly well done trailer. When I saw the trailer for this movie I was enthralled by the spaceship's designs and eye Candy flying stunts over Chicago but the moment the movie started it tanked awfully. I couldn't believe the simplicity of the script and the way the characters were presented. Mixing elements such as the grandeur of ancient Space civilizations with cartoon-like depiction of bureaucracy gave me ulcers. The non existant explanation about the future of Jupiter's remaining \"kindred\" made me believe this was gonna be a trilogy. If this is not the case then this is one of the worst movie scripts ever! I was literally in shock when the movie was over. I walked  out of the cinema convincing myself this was nothing but the first part in a three part saga!",
      "total_reactions": 5,
      "user": "Andrew-X"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "Who could have thought that the Wachowski siblings could come up with an movie even worse than matrix 3?",
      "total_reactions": 5,
      "user": "moviestalker"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "Bias upfront: Loved Matrix, Hated 2 and 3, Love Sci-fi.  Went in with low expectations and they were met.  There is no original thought anywhere in this chaotic mess.  Even the 'special effects' were not very special.  Action scenes were overly long and not all that exciting.  Characters, that were very shallow to begin with, were never developed either.  Sad, considering I was looking forward to this since it was announced.  M. Night Shyamalan you have met your match for Directors/Writers who should just stop.",
      "total_reactions": 6,
      "user": "XerSMMack"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "I was looking forward to this movie really bad but was hardly dissapointed throughout the movie. The ONLY positive thing about this movie are the special effects but thats where it ends. The storytelling was really awful and it was the first time in my life I wanted my money back after a movie. I felt betrayed and made fun of. How can they even allow this kind of BS. Gosh, it makes me angry.",
      "total_reactions": 6,
      "user": "Mugikun"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "Fight scenes too long, over exaggerated explosions, some good moments but mostly corny/cliché with bad puns and dry humour. Channing Tatum looked extremely gormless throughout the movie as if he hadn't slept for several days. Designs for set/ships etc looked like Asgard on steroids, costumes were alright at times yet could have been taken form the Hunger Games/Divergent. Soundtrack was trying too hard to be Howard Shore at times and was quite bland and lacked intensity at key points. CGI was probably done on Google Sketchup. The main antagonist was really **** annoying and needed a drink of water and anger management. Story line made relatively no sense and was hard to follow and could have been changed halfway through the actual filming. Sean Bean really likes bees. Unnecessary giant lizards.",
      "total_reactions": 6,
      "user": "mostfilmsarebad"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "The critics were right about this movie.  It failed on every level.  Poor dialogue, poor story telling, dull music, boring fighting action scenes, boring action sequences and dull characters.  I struggled to get to the end and the only entertainment I got from this film was joking about how bad it was with my friends.   It was a complete waste of money and I wouldn't recommend anyone to watch this film.",
      "total_reactions": 8,
      "user": "subs2"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "I gave it one point for the special effects.  But I am very sorry that such DGI effects talent went to a movie that didn´t deserve the effort.  I am struggling to find some redeeming feature in this film, but I am am very sorry to report that I can´t find anything at all.  Despite all its special effects, I am sorry to say that it is one of the weakest film I remember seeing.  And I am a science fiction fan, who enjoys almost all science fiction movies.  Not this one.",
      "total_reactions": 4,
      "user": "jlua"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "I didn't get a chance to see Jupiter Ascending and I couldn't even to pay IMAX tickets lately. My take on Jupiter Ascending is that it didn't live up the hype and delaying a supposed summer release just killed any chances of taking the box office crown. And it probably seems that The Wachowskis have fallen off their empire from bomb after bomb. I won't take away the cast in this choice of filmmaking, I have to give credit for adding Channing Tatum, Mila Kunis, and soon-to-be Oscar favorite, Eddie Redmayne for putting an excellent job on their performance. As for the rest, I felt that the film is overhyped at some point. The story and nature of the film is confusing and the dialogue was nowhere near perfection. I hoped Andy and Lana Wachowski should be able to make up a whole new idea instead of making poor timing over marketing issues. Like say reboot the whole Matrix Trilogy thing and besides, if you want to get your fanbase back to where it belongs, don't let the past fooled you and try again. I don't wanna hate on Jupiter Ascending because the CGI effects are amazing, very well crafted. Along with a dazzling blush of fantastic visuals and a beautiful look of sci-fi apple pie. Unfortunately, I really hate it when a film I was so dying to see in 2014 just cost my wallet and it's just a shame why this film falls flat. I suggest for myself see this movie first and then wait for a rental. Better luck next movie, Wachowskis. At least you've did your best. Sadly, Jupiter Ascending is the weakest in your film library.",
      "total_reactions": 6,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "An interesting failure from the Watchowski's, Jupiter Ascending has great art design and superb world building, but nowhere to go. It's too brisk and serious, when it should have been fun, with less exposition.  Like their previous efforts, it will probably be recognized as a cult classic in the future.",
      "total_reactions": 4,
      "user": "dharma"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "It's hard to take a movie like this seriously when it starts by giving Melina Kunis too many scenes with a toilet brush. Also all those aliens are just so white I thought it was produced by MIchael Moore for a minute. You see this is what happens when people have too much money and time to throw at a project. It makes me want to show them what happened to M Night Shamalwatever when he made too many stinkers. This suffers from the same problem that many book adaptions have where you take 20 hours of material and squeeze it into a 2 hour movie. Only this time there was no book or good ideas to go with it. Whatever,,. Next!",
      "total_reactions": 4,
      "user": "analogkid280"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "There is no defending this film, it was BAD. I usually like Warchowski's films, even the bad ones, but this movie is an expensive waste of talent. While watching this mess all I could think to myself was all the starving people in the world and a hundred million dollars was wasted on this movie.",
      "total_reactions": 4,
      "user": "irmdog"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "In a previous decade this movie would have been great. The story was well thought out in the first half (through the first kidnapping) but fell flat after that (to the second kidnapping).",
      "total_reactions": 4,
      "user": "Bshop"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "You will never be so bored to watch $176 million burn, nor for less reason. How does the bad guy die? I didn't see that bit: partway through the action climax I pitched my 3D glasses at the screen and walked. 2 points for the art team, who did a great job with the brief 'just go nuts'.",
      "total_reactions": 2,
      "user": "caveatscoti"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "JUPITER ASCENDING couldn't be more banal, useless, and dull. But it is colorful. It's amazing how these 2 filmmakers can drain the live out of anything, even such personable leads. But again. lots of color.",
      "total_reactions": 6,
      "user": "LowbrowCinema"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "One of the worst movies of 2014-2015. Poor story, poor acting, only giving it a one for the gorgeous special effects. 90% of the movie was CGI, but the CGI was good. About the plot, it was repetitive, made little sense, and it looked like it was written by a 10 year old boy after it played Final Fantasy all day.",
      "total_reactions": 6,
      "user": "Wafflemanguy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "Definitely underwhelming, was expecting something explosive after all the hype it got. It has amazing graphics and everything, but ultimately the story is a bit boring and there's too much noise and long unnecessary battleship shooting and action scenes. Slightly below average movie for sure",
      "total_reactions": 1,
      "user": "zouz123"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "Jupiter Ascending? More like \"Jupiter Descending\". In a world where The Matrix and Star Wars exist, you would think that directors/writers Wachowskis could come up with something creative and original, but this bewilderedly scripted mess of a movie just comes off as plain generic and clichéd. And once again, the audience interprets the movie as \"entertaining\" rather than \"good\". How sad. Yes, the movie is pretty to look at, but it doesn't have much in terms of plot or originality (as I said before).",
      "total_reactions": 3,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "This movie was surprisingly horrible. I can understand now why it was delayed 2 years in releasing. Though, I would think after 2 years they would have done much better at trying to improve it. The best thing about JA was the trailer. I gave it a 1 rather than a zero, as the special effects were very good.",
      "total_reactions": 4,
      "user": "amohammed1975"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "well i like scifi movies but this one was barely okay.  special effects where great went they happened but what else can i saw i will not be getting the dvd.  this was one of those that i wish it would hurry up and get over.",
      "total_reactions": 4,
      "user": "SHORTFINGER"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "When I saw the trailer for Jupiter Ascending I thought there was a possibility that this could be a revolutionary action film. All the effects were really cool and it is a movie that is just very appealing to your eyes. However this movie becomes an even worse version of Star Wars The Phantom Menace. It becomes a Sci-Fi film that becomes way too political and who really cares about politics or at least in a movie in this genre. Channing Tatum and Mila Kunis both do alright in this movie, they aren't terrible although they were both definitely brought in as a cash grab because they are two of the most popular and attractive people in the business right now. The real dud performer in this movie is Oscar winner Eddie Redmayne. Redmayne has one of the stupidest and most annoying voices ever in film and he looked so stupid that every time he was in frame I became annoyed. Sadly there is a lot of great visual effects that take a back seat to poor writing and that's why Jupiter Ascending will be quickly forgotten.",
      "total_reactions": 1,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "Went to see \"Jupiter Ascending\" last night and my review would be \"Hmmmmmm..... Still can't work out if I liked it\".",
      "total_reactions": 5,
      "user": "SoDT"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 2,
      "text": "this movie was a sad attempt to refresh the old theme of the movie Dune. Poor story plot due to trying to put a trilogy premise condensed into 2 wasted hours. the ending was completely horrible and did not even remotely fit the plot of the movie",
      "total_reactions": 4,
      "user": "dwhalen1000"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "If you're into visual effects, than Jupiter Ascending might be the film for you (though, I thought the visuals were meh). However, if you like detailed story, plots, and characters that develop and go somewhere, Jupiter Ascending is guaranteed to disappoint. Don't get me wrong, Jupiter Ascending had me laughing (thus entertained), but for all the wrong reasons. Science fiction and fantasy require suspension of belief, but for Jupiter Ascending I recommend you throw you belief out the window and bury it six feet under.",
      "total_reactions": 4,
      "user": "Luv_Bad_Movies"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "I was greatly anticipating a new Wachowski movie and went into the theater ready to love it. Unfortunately, what they spent on flashy digital graphics they should have spent on a script doctor. The acting (with the exception of Mila Kunis) is so-so at best... but we can't really blame the cast with such a flimsy plot and script to work with. The movie is a pretense to pandering \"fan-service\"- randomly thrown together things from other genres to try and please multiple audiences. This movie was genuinely terrible and a waste of my money. Refund, please.",
      "total_reactions": 4,
      "user": "Facts"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "Here is my tip to Directors...Please don't make something seem big and cool like Jupiter when I can barely get past the beginning changing scene with Kunis and her girlfriend....and then you did a close up of Smitten Kunis and i was like......show me an futuristic structure...never watched anymore after that",
      "total_reactions": 3,
      "user": "CameraBounceGod"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2015
      },
      "score": 1,
      "text": "This movie was actually painful to watch, and I kicked myself for not leaving early. They blew their $$ on special effects, and forgot to invest in a plot of any substance. I'm an avid science fiction fan, but I could not give this one a passing score. Anyone who gave this a positive score must have been high, drunk, or both (which actually would have bumped my score up by one).",
      "total_reactions": 3,
      "user": "KentuckyCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "This story 'borrowed' from everything to make something so recycled, the plot lines are almost meaningless, spliced together from almost anything else, including the Matrix - in this one humans are materials used to 'recharge the batteries' (cell regeneration) of the rich... seriously. A Princess right out of Cinderella is helped by a Werewolf and a wise old man (who are actually Fallen Angels) navigate various fantasy worlds dressed up in Science Fiction leading to the 'final showdown' with a Dragon (like alien) in a Dungeon like environment which looks like Mount Doom relocated to Star Wars Rise of the Sith. A world dictated by computer game logic and (I'll be generous and say) whimsical nods to the Audience about the power of... I'm guessing Free Will or maybe the abolition of the class system, for they barely touch on the fact these 'genetically superior' (read Magic) humans (No, not X-Men) go round growing and whipping out entire civilisations (a-la The Wraith in Stargate Atlantis) as well as 'making' a whole bunch of other people to do their will (kind of like the programmes in The Matrix... wait its the same writers/directors isn't it) All the while Mila Kunis (who has no chemistry with the Werewolf) changes outfits. If you haven't seen Harry Potter, Lord of the Rings, Star Trek, Star Wars, The Adventures of the Galaxy Rangers, Doctor Who, Stargate (any of them), The Hunger Games, The Matrix, any historical drama, period piece or fantasy, fairy tail or (insert something here) you'll properly think the story is quite innovative.",
      "total_reactions": 1,
      "user": "Cinimaseat"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2015
      },
      "score": 3,
      "text": "This is one of those movies made for watching just once. It numbs you with effects, great sound, great visuals. But the most you watch it, the most you hate it. Probably will be a cult movie in 30 years.",
      "total_reactions": 2,
      "user": "The_hamur"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2016
      },
      "score": 1,
      "text": "I heard someone say this movie \"ain't half bad.\" Well, it ain't half good either. Aside from some eye candy- the effects and the actors, [spoiler alert] this show blows.",
      "total_reactions": 0,
      "user": "psychomuse"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "Jupiter Ascending was much better than I anticipated. The acting and cast does a solid job, with Eddie Redmayne continuing to establish himself as a premier actor in Hollywood. The effects were adequate, though not necessarily up to par with the best of modern science-fiction/fantasy films. Honestly, the biggest drawbacks of the films were that the \"strangeness\" of the world presented to you (and the universe itself) doesn't feel sufficiently developed, the plot feels a tad bit cliche, and the plot seems to force the romance element on the audience around the halfway point in the film without every developing it previously. Negatives aside, however, and it was still a fairly enjoyable film with some potential.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2015
      },
      "score": 2,
      "text": "Sorry, 15-mins in and I can't endure any more. What is wrong with the W'skis?! The Matrix trilogy was it for them?! When you're crafting a two-hour epic like \"Jupiter Ascending\" you better write the hell out of the first 10 or 15 minutes to ensure the audience has a reason to pay attention further - Screenwriting 101 people! Instead, we get a bunch of pregnant scenery, birthing on a steamship, action scenes that make no sense, girls talking of true love, and Mila Kunis not even trying to modulate her voice to anything other than \"Meg\" from \"Family Guy\"! With those types of disaster markings in the first 15-mins, why, why, would I watch for another 2-hrs?! This surely must've been written for pre-teen girls, gee thanks, W'skis. Fail fast and fail often works in software development, not film-making.",
      "total_reactions": 0,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2015
      },
      "score": 2,
      "text": "The visuals can't cover up how atrocious this movie is. It is so stupid and ludicrous. Above of all though, it is incomprehensible. I feel embarrassed for everyone involved, especially for the people on screen, because the acting is horrible.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2015
      },
      "score": 3,
      "text": "Jupiter Ascending has some of the most beautiful space sequences in any film I have ever seen. Tragically, it is like that hot girl who can barely string together a coherent sentence. It gets a 3 for the beauty, but everything else is irreparably bad. The CGI orgy on the screen every five seconds made it look like a Michael Bay film and the subject matter reminded me of Star Wars if they removed everything that made those films good. The dialogue is cringeworthy throughout and absolutely brain dead moronic. The acting is somehow worse than the dialogue with Eddie Redmayne truly stealing the show. Wow was he horrific. He was the conductor of this massive train crash and he went full speed ahead on that crazy train. What may be the worst feature of the film is that it is two hours yet feels like it was ten hours. It was never truly slow, but just dragged on and on and never seemed to end. An incredibly stupid film that should have been killed humanely before it ever had $175 million spent on its production, Jupiter Ascending is impressively bad.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "Five stars even though this movie came out silly.  Star 1:  Anti-capitalist theme.  Hey, I'm a commie and not even afraid to say so.  I enjoy two things in movies above all others: transcending our ultimate human physical limit, which is death, and transcending our ultimate human psychological limit, which is selfish greed.  Star 2: I want those skates.  I want a lot of the technology in this movie, in fact.  Star 3:  I enjoyed almost all of the make-up and costuming effects.  Star 4:  This movie could have been solid as a year long series or even a mini-series but that would have made the special effects impossibly expensive.  Sadly, the characters and plot just didn't have time to develop in a believable way as a film.  Star 5:  I played The Secret World, which referenced the bee mythology, so I had a vague idea of where they were going with that.  Again, sadly, no time to realize the potential there.",
      "total_reactions": 0,
      "user": "Corvin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "Some amazing special effects and an interesting vision of 'the future' as it were. However the story is awful. Splicing humans with wolves and honey bees? Really?",
      "total_reactions": 0,
      "user": "0s1r1s"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2015
      },
      "score": 4,
      "text": "I honestly don't know what has happened to the Wachowskis. This movie is both an utter blunder and beautiful at once. A glorious mess.",
      "total_reactions": 0,
      "user": "Rox22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "One liner, somewhat richer, but only a decent entertainer.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2015
      },
      "score": 2,
      "text": "Boring, so boring. First a few things, Mila Kunis can't act, visuals can't make up for lack of an interesting story, a person talking softly to make them seem like more of a bad guy doesn't work. This movie was tough to get through, I nodded off at parts especially when they were talking so softly it's like they were being nice enough to talk soft so you could fall asleep easier. Also with all the info Jupiter is given about her life she doesn't seem to reACT the way you'd expect an everyday person would. If you're a big Channing Tatum fan he's shirtless at some parts, but he's just as bad an actor as Kunis. The only thing this movie has going for it is it's visuals and even they aren't  that great. If you like these two \"actors\" pick another movie with them in it. Jupiter Ascending should be descending into a bargain bin near you.",
      "total_reactions": 0,
      "user": "GundamMars"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "As much as I wanted to love the movie as a chance for Mila Kunis to take center stage and as a Wachowski callback I simply did not find the movie engaging.  The plot was a bit muddled, the romance seemed extremely forced and there just weren't any really likable characters.  Mila Kunis' character, Jupiter Jones, is the protagonist but I never found myself rooting for her.  She was wishy washy at best and so lovestruck by the end that it seemed she had no character whatsoever but what was forced on her by the shoe horned romance.",
      "total_reactions": 0,
      "user": "SeveredWing"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "Film immaginifico e visivamente molto bello, come da buone abitudini dei fratelli Wachowski.",
      "total_reactions": 0,
      "user": "neldot"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "Jupiter Ascending is the pure definition of a **** film where nobody feel any interest to the plot. Jupiter Descending is the **** of 2015. That felt so good.",
      "total_reactions": 0,
      "user": "TheApplegnome"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2015
      },
      "score": 1,
      "text": "This was almost completely awful, save for a decent action scene towards the end. The casting is off: Mila Kunis seems bored trying to bring life to this dreck, while Channing Tatum is some awful futuristic elf-angel thing. The plot doesn't make sense, either. Jupiter is the \"chosen one\", but does nothing relatively close to what a saviour should be doing. Instead, she and Tatum fly around and do some random space junk I can hardly remember. Stay away from this junk as if your life depends on it, and don't feed any more of the Wachowskis' awful garbage.",
      "total_reactions": 0,
      "user": "TimeOfTheChimps"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "Cinema-goers need a fresh movie from the makers of  the 'Matrix' films, but this movie isn't for them they don't need to see the Wachowskis new blockbuster \"Jupiter Ascending.\" If \"Guardians of The Galaxy\" were here they would of saved Jupiter Ascending's cheesy dialogue and it's unnecessary soap opera, we might of had a great film (almost). Jupiter Jones (Mila Kunis) was born under the signs that predicated her future greatness, but in reality she cleans people's houses and cleans toilets also wants endless breaks. Every single morning when her alarm clock goes off at  4:54, in the morning she says \"I hate my life\" before she spends her day scrubbing the toilets. Jupiter  doesn't know that she holds mankind's future in her hands she does not realize it yet. Caine (Channing Tatum) a genetically engineered hunter with the DNA of half-wolf and half-man, who arrives on earth to locate Jupiter, making her aware that destiny awaits her: Jupiter's genetic signature marks her next in line, extraordinary inheritance that could alter her the balance of the cosmos. The coolest scene ever in Jupiter Ascending which Caine has super cool boots my favorite scene. There are three heirs to the Abrasax industries dynasty, Kalique (Tuppence Middleton) tries to befriend Jupiter because Jupiter she has the key to an eternal life for Kalique; Titus (Douglas Booth) who wants Jupiter to marry him, so that he could kill her and take her inheritance away from Jupiter. Balem (Eddie Redmayne) wants Jupiter dead dead dead and now. The villain in this movie isn't really all that important or strong also the greatest in movie history, Eddie Redmayne who's a talented actor could give such a terrible performance he sounds like a British woman. Channing Tatum was missed cast and so was Kunis, obviously better actors could of have been in this B-movie. Mediocre movies have copied of the Wachowskis \"Matrix\" films, well this is a mediocre movie! Well even the makers of \"Matrix\" are copying of it, their also copying off of \"Star Wars\" and \"The Wizard of Oz\". If there's one thing The Wachowskis can achieve in their sc-fi blockbusters is create beauteous special effects and the art of an action scene. The score by Michael Giacchino is perfect and is elegant. Grade B-",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2016
      },
      "score": 0,
      "text": "OK, I knew this was gonna be a bad movie, but all I need to say is Channing Tatum is playing a rollerskating dog-man with a gun that barks when it fires.... enjoy!",
      "total_reactions": 0,
      "user": "ason313"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "The movie is not bad at all but the music is really, REALLY TOOOOOOOOOOOOOOOOOOOOO LOUD, damn u must watch this movie with the remote control to turn up and down the voume",
      "total_reactions": 0,
      "user": "steddye"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "I loved it. Until I read the other reviews I didn't even make the Cinderella connection but yes! It was visually amazing, the story was lovely, there were funny scene, I was pleasantly surprised as I had fallen victim to the negative reviews that had painted it as trash and \"don't bother watching\". I mean, come on, the girl kicked butt while never messing her make up, Mr. Wise got his wings back, and they got to fly together. I was so pleasantly surprised, I'm with the other guy, I wished I had seen it at the theater.  I really had fun watching it, and it even had a fun lovely ending.",
      "total_reactions": 0,
      "user": "retirdsecretary"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 4,
      "text": "2/5★A visually striking mess of a movie better enjoyed with the sound off. A cross between Star Trek, a bad young adult fantasy novel, and with a bunch of references to other, better films, Jupiter Ascending's convoluted plot offers Channing Tatum in makeup, anti-capitalism and some really cool special effects. There is so much going on the screen the viewer is distracted from the fact that the dialogue is cringe worthy, the leads have no chemistry and a lot of money was spent on something that brings shame and embarrassment to anyone who was involved.",
      "total_reactions": 0,
      "user": "reellm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2015
      },
      "score": 6,
      "text": "Eye popping visual effects and stunning production design highlight this otherwise far too complicated story that isn't boring, just slightly tedious. The Wachowski's seem to have become very self indulgent in their writing and directing even though I have liked some of their other films such as \"Cloud Atlas\" and \"The Matrix\".",
      "total_reactions": 0,
      "user": "WJS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2015
      },
      "score": 3,
      "text": "Not sure what exactly the Wachowski's were trying to achieve with this movie.",
      "total_reactions": 0,
      "user": "MCRR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2015
      },
      "score": 6,
      "text": "We avoided this at the box office, because of the low ratings it was getting.  Much to the norm, the movie wasn't as bad as the ratings led you to believe!  The action and story line was decent, mind you not something like Interstellar, but still watchable and enjoyable.  I like Mila Kunis the more I see her in movies and thought she did a bang up job with the script making the movie better and bearable.  I gave it a 6, but thought about a higher score, because of the special effects and action.  Again the story was above average and I would recommend it to those of you that enjoy the science fiction genre, my advice is ignore the reviews and go on ahead and take the plunge for the special effects and thrill ride!",
      "total_reactions": 0,
      "user": "horizonbts"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "It's weird... because at the same time that visually Jupiter Ascending is amazing, the story have huge gaps on it.",
      "total_reactions": 0,
      "user": "Thigo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "Jupiter Ascending probably has one of the funniest scene so far in 2015 and that is the scene where a captain of this ship who's in a war battle and the captain says \"Full speed a head\", and it pans down to this elephant man like creature and it makes the funniest noise ever and of cause I laughed my head off.",
      "total_reactions": 0,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "Jupiter Ascending has an original concept when it comes to story, but it wastes the talents of Channing Tatum and Mila Kunis on a boring movie like this. However, a female hero in a sci-fi movie has to be groundbreaking and there should be (better) more movies with females as the heroes. My sister liked its campiness as well.",
      "total_reactions": 0,
      "user": "jerrynielsen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2016
      },
      "score": 8,
      "text": "It is movies like this that make you say \"wow, people really do have some imagination\". And that is what sci-fi should be. Yeah somethings could have been better bla bla but still, it is a huge effort and thus it is entitled to be given an effort to watch.",
      "total_reactions": 0,
      "user": "akino3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 1,
      "text": "Such a shame, a damn shame. While the whole back-story of the Abrasax family, their business, the alien culture, rulers of space part was COMPLETELY ignored, we at least got to see Sean Bean not die. Considering the horrible character he was handed, he did what he could. That could be said about all the actors who were literally lost in the plot and could not establish a connection with the other characters. I don't blame the actors though, truly, they did what they could, but there was no substance, no story line, no anything besides visual effects. This movie had the potential to be amazing, a possible franchise but nothing of value was even hinted at. The origins of humanity (which is not Earth), the royal families in space, the type of businesses, Jupiter's past and inheritance, the Abrasax kids and the rivals in the industry.....nothing, nothing related to that.....Sweet lord, this could have been amazing. Not to mention, that the dialogue was mediocre, the technology they presented was brushed off with no insight and Tatum is some kind of human-doggy with the emotional range of a pissed off Edward Cullen. While, of course, Mila Kunis is there to be pretty, not breaking a sweat at the fact that she discovered in a matter of hours that she owns half the universe, her identity is uncommon, she jumps off of buildings, gets used very fast with talking lizards and alien tech. By no means would she freak out about, well, anything. Her job is to look pretty in alien couture and hit on Tatum's canine charms. God this was a mess. oh yeah....there was a faint hint of incest too.",
      "total_reactions": 0,
      "user": "andra"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2015
      },
      "score": 2,
      "text": "Lo han vuelto hacer, se han superado, no se como demonios lo hacen, pero han conseguido hacer otra montaña de MIERDA, mas apestosa, mas pútrida y mas retrasada que su anterior bodrio El Atlas de las Nubes, haciendo que su carrera esté tan hundida, que Shyamalan a su lado es Steven Spielberg, porque encima la película se ha pegado un brutal hostión en la taquilla no lleva ni 20 millones recaudado y ha costado unos 200 millones.",
      "total_reactions": 0,
      "user": "Barbudez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2016
      },
      "score": 3,
      "text": "A young immigrant domestic cleaner’s life on Earth is shattered when she is discovered as the heir apparent to a dynasty of intergalactic landowners and planet harvesters, only to be pursued by the tyrannical head of the family whom she is determined to fight with the help of a genetically engineered super-soldier.",
      "total_reactions": 0,
      "user": "FilmPhonic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2015
      },
      "score": 1,
      "text": "n a word - nonsense. The heroine of a fool, a lot of actors who practically do not emit emotion , one actor who overdid it and finally - Ball freaks. Of the benefits of some special effects .",
      "total_reactions": 0,
      "user": "Ddshcnick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2015
      },
      "score": 3,
      "text": "Even 'Bit' from Tron showed more emotions than any single character in this movie. As a Sci-Fi fan I really was looking forward to this movie. And was then ending up fast-forwarding while watching, since after the 4th abduction from yet another (un-introduced) party I could not take it anymore. Why should I care, what is the story? The lone Lycantrop for rescue story is just absurd, I never got the impression he is different than any other soldier, they should have send Jason Bourne instead. Finally, just because our main character, the queen, is cleaning toilets this does not make her a good person, sorry! Good persons are defined by actions they take during the movie, and there was none of it, she just was captured a zillion times and then decided not to slaughter all humans on earth. I get more emotional if my hairdresser tells me from her family weekend, the immersion level for this movie is really zero.",
      "total_reactions": 0,
      "user": "jackjunior"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2015
      },
      "score": 1,
      "text": "I really expected more from the Wachowskis, moreso now that I've seen their Netflix series, Sense8, both of which came out in 2015. There is one good thing about this movie: the sfx, which raise the fx bar ever higher. Stunning is not even the right word for it. I enjoyed seeing Mila Kunis  in a starring role, but not...here. Even as a pure action movie, it fails. As sci-fi, it is derivative to the point of almost being as funny as some of the characters (and not in a good way). I am a Wachowskis' fan but just don't get that they did this big box kind of movie...after the brilliant and subtle Cloud Atlas?  Only gave it a generous 1 for the fx.",
      "total_reactions": 0,
      "user": "Caramia"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "Are there any directors working today that are currently more ambitious than the Wachowski siblings? On this basis, perhaps not, as the directors' latest flick has all the initiative as their last flick, Cloud Atlas, though not quite the same handsome payoff. Beautiful, wildly entertaining, and balls-off-the-walls crazy, Ascending has all the potential to become a cult classic.",
      "total_reactions": 0,
      "user": "EdgarReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2015
      },
      "score": 3,
      "text": "Well, the Wachowski's prove one more that The Matrix was their ONLY GOOD FILM! Seriously, this movie is utter swill. Most of the movie is just people talking. And its not that having a lot of talking in a film makes it bad, but this was promised to be a summer blockbuster, not a drab borefest. Not worth the price of admission.",
      "total_reactions": 0,
      "user": "BoogeeFilmGuy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "I bought the DVD version, and it somehow failed some of my expectations (base from the success of Matrix). I appreciate how the Wachowskis, made a female savior. Jupiter Jones is  feisty-quirky-cute version of an alien Queen.",
      "total_reactions": 0,
      "user": "randomthoughts3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2015
      },
      "score": 4,
      "text": "Jupiter Ascending movie was a very acceptable , for the good of this are the visual effects , costumes and sets, and the bad of this were the plot and script that was absurd , and disadvantages.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "It’s a good movie, especially if you're up for a space epic and your expectations are low, Jupiter Ascending delivers for a while, then uses big battles to coast to an ending.",
      "total_reactions": 0,
      "user": "alexa417"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2015
      },
      "score": 5,
      "text": "Wow, this film is bad! The acting is terrible, the costumes are quite ridiculous and there are multiple dumb things in the plot. They had thousands of ideas, it's quite original in fact , but it's so badly executed, it could have been very interesting, but as a whole it's ruined. Also the main character is extremely stupid, she never realizes when someone lies to her, manipulates her, she is in constant need of saving etc. The script is horrible as well.",
      "total_reactions": 0,
      "user": "FilmQueen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2015
      },
      "score": 6,
      "text": "For some reason this movie reminded me of Dune. The graphics are stunning but I gave this movie a 6 because of the storyline which was a tad confusing at times. However, it is quite entertaining just for the \"space\" images. Some action sequences are ridiculous such as the one where one of the characters is hanging onto the outside of one of the spaceships as it hurtles through space.",
      "total_reactions": 0,
      "user": "neilhodgkinson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2015
      },
      "score": 3,
      "text": "Dear Jupiter Ascending, I am writing to you to drop my average film score. Do you remember when we met? It was in a lonely place, an alone-in-a-cold-dark-room-at-3am place, Google results on scifi action film I hadn’t seen showing 0. I tried to respect your ambition, but you kept talking about how The Chronicles of Riddick was really cool, but how you wanted to be more than that. Oh? Do you remember how The Chronicles of Riddick looked in the mirror and was like “oh **** too far” and then turned itself back into Pitch Black? Can you do that for me, Jupiter Ascending? Can you use one of your plotholes to go back in time to that night and change yourself into Pitch Black for me? No? You still have ambition? Fine, you want to make the world a better place then instead take all of that money you spent to make yourself and give Channing Tatum a temp job going around being charming and giving out hugs. Can you imagine that world? Channing Tatum charm and hugs for everyone and no Jupiter Ascending. Holy **** That. World. No you were not my worst, but you did ooze viscous mediocrity the whole time. It took three showers and an episode of Firefly to get me right. Dear Jupiter Ascending, please do not make a sequel to yourself unless it is Jupiter Recanting: Pitch Black 3, or Jupiter Is Sorry About Before Presents: Magic Mike World Tour.",
      "total_reactions": 0,
      "user": "StatlerWaldorf"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2015
      },
      "score": 7,
      "text": "It's simply movie hooey, but if you're up for a space epic and your expectations are low, Jupiter Ascending delivers for a while, then uses big battles to coast to an ending.",
      "total_reactions": 0,
      "user": "katharris417"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2016
      },
      "score": 3,
      "text": "My score for this movie is between a 3 and a 4. I decide to choose what I choose and stick with a 3 for now. There's obviously no way Jupiter Ascending can be this successful in movies or ever will be mentioned in any list of great movies.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2016
      },
      "score": 10,
      "text": "I don't usually write reviews for movies but after finally seeing this one I enjoyed it so much that I decided to. As someone who loves sci-fi movies I have practically seen it all but  I truly enjoyed the unique sci-fi elements that Jupiter Ascending had to offer. While many other sci-fi movies explore the nearly infinite possibilities of space and time too this one brought to viewers several important lessons that tie into those infinite possibilities.",
      "total_reactions": 0,
      "user": "millia"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2016
      },
      "score": 1,
      "text": "Lo han vuelto hacer, se han superado, no se como demonios lo hacen, pero han conseguido hacer otra montaña de MIERDA, mas apestosa, mas pútrida y mas retrasada que su anterior bodrio El Atlas de las Nubes, haciendo que su carrera esté tan hundida, que Shyamalan a su lado es Steven Spielberg, porque encima la película se ha pegado un brutal hostión en la taquilla no lleva ni 20 millones recaudado y ha costado unos 200 millones.",
      "total_reactions": 0,
      "user": "AngusBarbudez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2016
      },
      "score": 4,
      "text": "If I were around 12 or 13 years old, this would have probably been a movie I just loved. Secret princess and flying shoes and space-magic and pretty dresses? Hell yes, sign me up. I don't mean that as a criticism either. Silly, mindless, over the top, fantasy/scifi can be fun and appealing. I think a lot of the glaring problems would have still been apparent but I could have probably overlooked them with a little more ease back then.",
      "total_reactions": 0,
      "user": "ScarlettMi"
    }
  ]
}