{
  "mc_avg_user_score": 6.3,
  "mc_metascore": 33,
  "mc_mixed_rating_frequency": 52,
  "mc_movie_name": "Just Go with It",
  "mc_negative_rating_frequency": 42,
  "mc_positive_rating_frequency": 119,
  "mc_pro_critic_reviews": [
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "A very funny romantic comedy that nicely combines Adam Sandler's acerbic sweetness with Aniston's down-to-earth warmth."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 70,
      "summary": "The predicable, overlong romantic farce has enough sass and sex appeal to appease fans of stars Adam Sandler and Jennifer Aniston."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 63,
      "summary": "For added heehaws, the normally dependable Nick Swardson comes along to act the ass and delve into some of Sandler's more nuanced scatological humor."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 60,
      "summary": "A loose but fairly snappy remake of the 1969 charmer \"Cactus Flower.\""
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 60,
      "summary": "Just Go with It provides not only the title of the film but a one-step instruction for how best to enjoy it."
    },
    {
      "critic": "Stephen Cole",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "The Super Bowl MVP is awarded a trip to Disneyland. Maybe in the future, he should be awarded a part in an Adam Sandler movie. There is no bigger male fantasy land."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "There is some cheap homophobia at the end, and a lot of the kind of misogyny that treats the existence of nonthin, nonrich, nonwhite women as a joke in itself."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "Sandler, shambling and smirky, delivers another of those one-take performances of his - likable and lazy, forever on the verge of cracking himself up."
    },
    {
      "critic": "Andrew Schenker",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "As in many a Sandler picture, Just Go With It is a tale of both escalating lies that finally give way to truth and of childish behavior eventually corrected strung along by lowbrow jokes that hit and miss in roughly even number."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "If you're a Sandler film buff, the comedy is classic Sandler and will probably satisfy. Still, the best thing about the movie remains Aniston - she is reason enough to just go with it."
    },
    {
      "critic": "Pam Grady",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "The positives have an edge over the negatives, but it probably doesn't matter either way. It is an Adam Sandler movie."
    },
    {
      "critic": "Michelle Orange",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 45,
      "summary": "Just Go With It attempts to merge farce and romantic comedy with the Sandler sensibility, and the result is a story that evades where it should engage and a whiplash tone that dispirits when it should delight."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2011
      },
      "score": 42,
      "summary": "A fumbling comedy directed by Dennis Dugan that could have benefitted from surgical reconstruction. How about some liposuction to siphon off all those lame jokes?"
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 42,
      "summary": "A comedy as lazy as Sandler's previous boondoggles."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 40,
      "summary": "Kidman is the only refreshing thing in the movie. Otherwise, Just Go With It is an exercise in stagnation."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 40,
      "summary": "Sandler's puppy-dog persona is just about ready to be put down. From its title on, this is entertainment for extremely lazy audiences."
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 40,
      "summary": "Manages to misfire in two seemingly incompatible directions. A puerile kiddie-comedy without the anarchic energy, and a schmaltzy romantic comedy without the sweetness."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 40,
      "summary": "A witless rom-com that is only marginally watchable."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 38,
      "summary": "Akin to watching a bad sit-com that never ends."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 38,
      "summary": "It's a rarely amusing movie overwhelmed by grating kids, unfunny sidekicks, half-hearted Sandler funny voices and a co-star who seems more fearful of smiling with each passing year."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 38,
      "summary": "Seeing her (Kidman) in junk like this is a bit like watching the Queen of England eat a Taco Bell chalupa."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 30,
      "summary": "An Adam Sandler comedy, which means it bears only a superficial relationship to the customary conventions of moviemaking, and also that there's no use getting all worked up about that."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 25,
      "summary": "An egregiously unfunny enterprise."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 25,
      "summary": "It's the perfect Valentine's date night movie, but only with someone you hate."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 25,
      "summary": "A bummer - slack rather than loose, tired rather than fun."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 25,
      "summary": "Aniston and Sandler, however, play characters too awful to deserve anyone better than each other. But what did we do to deserve them?"
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 25,
      "summary": "Offers only one point of interest beyond the breasts of its second female lead: Aniston's barely disguised disdain for her material."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 25,
      "summary": "The people in this movie are dumber than a box of Tinkertoys."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 12,
      "summary": "You know you're in trouble when you're suffering a comedy shutout and the pinch-hitters you send in are Kidman and Dave Matthews."
    },
    {
      "critic": "Scott Tobias",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "summary": "The shame of it is, all this ridiculousness might have worked under surer hands. After all, farces are supposed to be a little silly, and the audience, for lack of a better phrase, can be trained to just go with it. The trick? Don't treat us like a bunch of Palmers."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "summary": "A comedy so noxious it seems the product of deliberate malignity. Surely the sour, vapid, miserable world of this movie can't reflect any real human being's notion of what love or humor or good storytelling is-not even a Hollywood screenwriter's."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "There really are not enough funny moments in this film to warrant a high score but it isn't as bad as the critics are trying to suggest. Not one of Sandler's best but he still manages to pull it off rather well. I wasn't sold on Brooklyn Decker's acting credentials and found Nick Swardson as well as the two children rather annoying.",
      "total_reactions": 2,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "This film isn't funny. It's not dark, comical, interesting, impressive or groundbreaking. Not that it should be any of those things. It's supposed to be a comedy. Adam Sandler hasn't always been impressive to me, but for God's sake at least try. It's not the worst movie out there, and if you wanna watch this, then fine. It's just not a good piece of movie by any means. It's not like it has to be funny all the time. If you like it, fine, but it's stupid. And not the good kind!",
      "total_reactions": 2,
      "user": "JawsLaxerDrama"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2011
      },
      "score": 3,
      "text": "I overall did not get a great many laughs out of this movie. I laughed maybe a total of about 5 times throughout this whole film. But i guess that I'm just not a big fan of Dennis Dugan anymore. His best film was Happy Gilmore and since then the only good movies he has made were Big Daddy and Zohan.",
      "total_reactions": 1,
      "user": "boxenford92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2011
      },
      "score": 1,
      "text": "Terrible film, with a horrible, grating kid with a fake English accent in it. Jennifer Anniston is fairly likeable I guess (thats the \"1\" in '1 out of 10). Sandler dials it in, everyone else is either annoying, unfunny or both. Avoid.",
      "total_reactions": 1,
      "user": "bannjaxx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2011
      },
      "score": 1,
      "text": "Just saw this movie last night...it was awful.  I couldn't even finish it.  The greatest comedic actors of all time could be in a movie but unless the writing is good, it doesn't work.  Sometimes Hollywood takes a couple of popular actors, such as Adam Sandler and Jennifer Aniston, and knows the public will pay to see it, even if the script is awful, like this one.  I saw Hall Pass a couple of nights ago and that was the funniest movie of all time compared to this one.  save your money.",
      "total_reactions": 1,
      "user": "sknorton0722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2011
      },
      "score": 3,
      "text": "Just Go with It was an ok film. There were one or two scenes in the film that were funny. The problem with the film is it really not funny at all. The story is just boring and alot of scenes just dont make sense. I would only see this if you really want to but i wouldnt watch it again.",
      "total_reactions": 1,
      "user": "Edward9630"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2011
      },
      "score": 0,
      "text": "This movie, is so, frustratingly bad. It's so filled with flaws, with such cheap attempts at laughs, so cliche that I could have walked out. A waste of time. Why does Adam Sandler choose these movies? Is it intentional? This is the worst movie of the year. Though I haven't seen \"Jack And Jill\" which most critics call inexplicable. Who's the star of that movie again? Oh right.",
      "total_reactions": 1,
      "user": "zizzoT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 2,
      "text": "“Just Go with It” is another step down for Adam Sandler’s career. It starts inside the lethargic world of Sandler and ends within the tired formula of the romantic-comedy genre. It’s a long, slow slide from crudeness to mediocrity. The morons that are the film’s characters are appalling upon the moment of their introduction. Unfunny and mentally incompetent, these people roam around the movie’s dead plot until it’s time for them to learn their life lesson while somehow finding a way to remain stupid.",
      "total_reactions": 1,
      "user": "AutiTakahashi"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "I have no idea what's up with these critics.  Sandler movies are damned funny!  Sure, the pacing is off sometimes, but I laughed my ass off throughout this film. Decker is awesome (yes, she can act), Anniston rocks as usual (and looks amazing...), and the cameos are twisted.  Totally worth seeing. Loved seeing pretty much the whole cast of Grandma's boy back in action. There's a little something for everybody - seriously.",
      "total_reactions": 15,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "I usually agree with you guys here at MetaCritic but I must say that I completely disagree with you guys this time!!!! I mean come one guys, you gave this movie a \"skip it,\" It at the very least deserves a \"maybe\"!!! But personally I rate it a, \" SEE IT\"!!! I totally depend on you guys when I decide to go see a new release on the weekends... Which I partake in every weekend!! This weekend I was hesitant to go see anything because what was left for me to see was only the new releases and I already seen \"Eagle\" & forget about \"the roommate\"...  my point is that I almost missed this commendable, mirthful and charming film!! I have seen every single Sandler movie he has ever been apart of since the early 90's and I admit there has been many flops but since his own production company he has done nothing but make us laugh, while taking care of his boys, as well as bring back the times when movies taught us something about life... and that alone is honorable and worth while to go see his productions!!! Open your horizon Metacritic!!! Just because it didn't make a blockbuster doesn't mean it is a \"skip it\"!!!!",
      "total_reactions": 4,
      "user": "Dstoneking"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "I highly recommend this movie among films of this genre, I don't know why some of critics  didn't like it. I like Jennifer Aniston a lot, and I like all her movies, she is a very talented actress with a very charming face. she is very adorable in the whole world especially in Europe, she is the actress no. 1 in Europe and Middle east.",
      "total_reactions": 7,
      "user": "MeeMo"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "I thoroughly enjoyed this entire movie!!  The gags are hillarious and I thought the women looked fantastic.  Another feel good movie from Adam Sandler!",
      "total_reactions": 6,
      "user": "Goose"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 2,
      "text": "In Hawaii, Danny Maccabee meets his own kind, a pig, no doubt, meant to accost him, but the charging wild boar instead attacks Eddie(Nick Swardson), Danny's cousin, while he and the rest of the hiking party gets away. It would've served Danny right had the pig reached this lying sociopath, but the deserving target escapes, just like how he escapes the bigger picture that the film as a systematic whole circumvents. Adam Sandler plays a womanizer, a Beverly Hills plastic surgeon who wears a prop wedding ring in order to sleep with duped women, gullible enough to buy his sob stories about an abusive wife. In Gene Saks' \"Cactus Flower\", the 1969 film adapted from the Abe Burrows' Broadway play, Walter Matthau plays the same sort of cad, a dentist who avoids commitment by employing the same ruse as Danny, until, like the fellow medical professional, he meets the right woman(played by Goldie Hawn), in which case, the fake life that he set out for himself, suddenly becomes an inconvenience. Whereas \"Just Go With It\" takes great pains to account for Danny's boorish behavior, the Saks film(written by Billy Wilder stalwart L.A.L. Diamond) makes no apologies about Julian's duplicity, nor claims on the dentist being a particularly nice guy. At the outset, Toni attempts suicide, because unlike its callow remake, \"Cactus Flower\" has the decency to acknowledge the ramifications that come with lying, the falsehoods which Julian perpetuates to simplify his love life. In \"Just Go With It\", an extended prologue shows how Danny's bride-to-be had broken the big-nosed Jew's heart on their wedding day, so when he sets in motion to bamboozle Palmer into thinking that a divorce to Katherine(his assistant at the practice) is imminent, we're supposed to root for him, because as the film plainly states, he's an underdog getting even with the female race entire. Adding insult to injury, Palmer, as she's written, is the stereotypical dumb blonde, a schoolteacher who never questions the preposterous scenarios that Danny and his co-conspirators throw at her; most galling of all, the explanations behind his fake daughter's **** accent, followed closely by the ludicrous occupation that Katherine's fake boyfriend invents, complete with a worse Swedish accent. Since Palmer(played by Brooklyn Decker) is a ten, so blatantly more attractive than the loser she gets saddled with, the filmmaker takes the statuesque blonde down a peg, making her out to be more foolish with every lie that strings this woman's heart along, all in the name of farce, as if physical beauty itself warranted punishment. \"Just Go With It\" treats her like an adulteress, a sex bomb who sleeps with married men on the beach, but far from being a femme fatale, the woman teaches for a living, and sure enough, her hard-rocking bod belies a maternal and nurturing carriage. It's open season on the babe because there's the presumption that somebody who looks like a Sports Illustrated swimsuit model, can't possibly have any feelings like normal people. Similar to \"Cactus Flower\", the patriarchal bent glares brightest throughout the final act, in which Danny never faces any consequences for his elaborate deceptions, since Palmer, with her infinite hotness, just moves on to the next man after the plastic surgeon chooses his assistant. In essence, the film lets Danny off the hook without having to offer Palmer a well-deserved apology. Had she truly loved him, \"Just Go With It\" would have a harder time covering up Danny's misogyny. The film \"Just Go With It\" most reminds me of is Neal LaBute's \"In the Company of Men\".",
      "total_reactions": 3,
      "user": "Shiira"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 1,
      "text": "**** just like other recent Sandler movies. Oh and Jennifer Anniston's in it too, makes it ten times more ****ty. The funny parts aren't funny, Sandler is losing it, he really is and it's damn sad. Only reason why I'm giving it a 1 is because they popcorn I ate during the movie was perfectly buttery and I love popcorn that has a perfect amount of popcorn in it. So yeah, ****ty movie. Don't waste your time.",
      "total_reactions": 3,
      "user": "BrendanL"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 1,
      "text": "Definitely time to inject some new blood in Hollywood romantic comedies. Sandler was always hit or miss for me, and in this movie he's mean and not funny. I liked Aniston in friends, but most of her movie roles are alike. I think she's better suited for a sitcom. Decker is beautiful, and a smart way for producers to lure in unsuspecting men to a terrible movie. My advice to guys is to just google her pictures and save yourself the time and money to see this. I was hoping for much better.",
      "total_reactions": 3,
      "user": "pdx9"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "I think the critics just like to be negative of any Sandler or Aniston film.  Thought Jennifer Aniston did a great job and Nicole Kidman was surprisingly funny as well. I laughed the entire time. Fun movie highly recommend it!",
      "total_reactions": 11,
      "user": "fraline"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "I watched this movie today because i needed some escapism from my stressful life. I have been disapointed with the last couple of films from Adan even though i am a big fan, i am not the biggest fan of Jennifer however.",
      "total_reactions": 5,
      "user": "shaun1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Thought it was so funny!  Was not sure if it was going to be a romantic comedy or just a straight gross-fest comedy.  It was both.  We spent most of the movie laughing. Really good!",
      "total_reactions": 5,
      "user": "qqfan"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "loved the movie! great had me laughing! adam and jen work great together!!!! will watch again! idk about the critics reviews like they must be boring people the movie had so much comedy and jokes and it was absolutely what i expected it to be!",
      "total_reactions": 5,
      "user": "aguirre61788"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "This movie was really fun and charming. Is it the deepest movie ever produced? No. But it is a good date movie, it had me, my fiance, and our friend laughing throughout, and left us with a good feeling as we left the theater. I'll probably buy it too, for when I need a fun movie to watch.",
      "total_reactions": 5,
      "user": "pandabearabq"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2011
      },
      "score": 3,
      "text": "It is quite stupid and has way too many gross out gags to even be considered good. But you laugh every once in a while even though you feel wrong doing it. I give this movie 29%.",
      "total_reactions": 8,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2011
      },
      "score": 3,
      "text": "There are exactly two good things about this film. The first is that the sound track is made up of almost all Police songs. The second good thing is the children who play Jennifer Aniston's children.",
      "total_reactions": 6,
      "user": "DC19"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "WOW what a great movie, its very interesting I will watch it again and again, aniston looks very beautiful as always, and sandler really cute, great move recommended to all.",
      "total_reactions": 6,
      "user": "Moha"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Alright, so I went into this movie with so-so expectations. It seemed like it had some laughs, but it would drag a lot. Well I'm pleasantly surprised to say that this movie was actually very funny! Sandler and Aniston (who was hot by the way) work perfectly off each other. Brooklyn Decker, for her first performance ever in a movie, was pretty good. She did what she had to do (you know, look hot while walking in slow motion). The kids are OK, not good, nor bad. But the one actor who steals the show is Nick Swardson. He is absolutely hilarious in this movie! Everything he does is comedy gold. I hope to see him in many movies in the future. The movie is funny, but it does suffer from some pacing issues. Some scenes I felt just dragged and should have ended faster than they did. But that is only a minor gripe. Also, this movie is extremely predictable (like most rom-coms today) but that is to be expected. Come on, if you can't tell how it's gonna end from the first 20 minutes, you need to get out more. Just saying. So overall, Just Go with It is very funny, is acted well, and despite a few minor problems takes the cake for best comedy of the year(so far).",
      "total_reactions": 4,
      "user": "sh831994"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Why are the critic's reviews way out in left field? I went to see it - I laughed over and over at their antics - I will go see it again - I will buy the video - and I highly recommend it!  The movie had beautiful scenery, waterfalls, beautiful women, multiple plots, lies, laughter, sneakey little munchkins who were like children from corn, and multiple lies upon lies.  This may be a chick flick but guys do things like they did in the movie.  It was so funny in parts it was hilarious.  If you're over 50 and male - make sure you don't have a pacemaker.  There is a waterfall scene with bikinis that normal men would die for.  There was a 20 year age difference between Jennifer and the \"S-I\" model and both were smoking throughout the movie but when Jennifer undressed in only her bikini at the waterfall - it was as if my heart stopped.  She was absolutely BEAUTIFUL.  On the day the movie was released, Jennifer celebrated her 42nd birthday.  So Jen was 42 and the model was 22 but if the opportunity ever presented itself for a meet & greet, I would select Jen 13 months of the year because she was that beautiful.   If you are over 50 and female - make sure you're wearing an adult diaper because you will laugh so hard you'll wet your britches.  This is a great movie for marrieds, great for dates, great for just the girls, great for just the guys, and great for laughing.  This movie was well worth the price of the ticket and my time.  Sandler was terrifffffic with his one liners and how he can keep a straight face - under some conditions is beyond me. Aniston and Sandler made a great pair in this movie making this a much better one for both.  Nicole Kidman surprized me in this.  Instead of being straight laced and dignified she was loose as a goose - and hilarious.  Adam's friend the \"Sheep doctor\" needs to be nominated for derrainged acting ability.  Everyone did a fantastic job - but the one thing I wish to stress is that I have never seen Jennifer look like a FOX as in this movie.  One scene in a white dress coming up the stairs on a scale of 1-10 with 10 being the highest - she was an 11.  Why she has never been selected for more roles in Hollywood is beyond me with her clean complexion and acting ability.  The critics need to get a grip and rethink their own evaluation criteria.  They have peoples careers at stake and from the sound of things I get the impression that their decisions don't match the publics.  This movie is fantastic and most highly recommended for all and, as a matter of fact, I enjoyed this movie so much that I may eveh get 20+ copies of it this coming holiday season and give it away as Christmas gifts to relatives and friends.  Again, most highly recommended and Jennifer and Sandler were terriffic!",
      "total_reactions": 4,
      "user": "JoeNavy30"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "It was wonderful to see Jennifer Aniston acting at the same high comedic level that she had while doing Friends.  Both she and Adam Sandler show a more mature deftness to their roles which is very refreshing and funny. Most critics don't like the movie because they don't understand relationships very well.  You don't need a gun or fast car to be in love; a couple of funny kids are dangerous enough!  While the supporting cast was great, the real surprise was Nicole Kidman.  After all those heavy horror/angst movies she has done lately, it was great to see her comedic side. The most fun was to be in a theater full of people laughing loud and long at all the great jokes and bits.  Truly the best time we have had in a long while at the movies!  Go see it and then buy the DVD.  Don't miss this great movie just because the clueless critics and Bart (who rates all his movies \"0\").",
      "total_reactions": 4,
      "user": "JacksonB"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "THIS IS PURE GARBAGE IT IS HORRIBLE PURE DOGS**T DON'T WATCH THE MOVIE AHHHHHHHHHHHHHHHHHHHHH    THIS SUCKS .............................................",
      "total_reactions": 4,
      "user": "IamTHEbeaN"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2011
      },
      "score": 4,
      "text": "\"Just Go with It\" was not as horrible as I thought it'd be, but it surely was not good either. While only passable, it does manage to keep one entertained for most of the film. Romantic comedies such as these are almost always pretty atrocious and annoying, but this one does have a bit of charm to it. Predictable as can be, with typecast performances (especially by Sandler) it does not offer much new. Aniston shines only at the very beginning of the charade when she is playing the \"bad ex,\" very similar to her role in \"Horrible Bosses,\" which she delivered excellently. The children actors are somewhat annoying, to be honest, while Nicole Kidman is rather entertaining, though not quite as good as she was touted to be. The generic storyline and predictability are numbingly boring at times and rather thin dialogue does provide for a sense that this truly is yet just another romantic comedy with nothing new or revelatory to offer. That being said, it is better than many I have seen before, which does ultimately not say much about how good or bad it is. Judge for yourself - but it won't be all that great.",
      "total_reactions": 2,
      "user": "smijatov"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "What an awful rom-com.  Did any of the people who wrote positive reviews even see this movie.  Every rom-com Jennifer Anniston has been in over the last few years has been terrible, and this is no exception.",
      "total_reactions": 12,
      "user": "Bart"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2011
      },
      "score": 4,
      "text": "Far more entertaining than other rom-coms released in recent years. However, Just Go With It is predictable, uninspiring, and doesn't really hide Sandler's noticeable typecasting.",
      "total_reactions": 6,
      "user": "KendylKlownfish"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "A unsurprisingly funny movie, I found myself laughing out loud throughout the entire thing, the shocking part is that it's actually really sweet and romantic at times, the chemistry between Sandler and Aniston is totally believable, the best part about it is how the characters just act like regular people around each other, they say things that normal people would say to one another, sure there are some pacing issues here and there, but for the most part it's an incredibly well written funny romantic comedy that I highly recommend you watching.",
      "total_reactions": 3,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "For those that say no guy would choose Jennifer Aniston over Brooklyn Decker, as we walked out of the movie, my husband (who is a very normal 30 something man) turned to me and said \"That is a no-brainer . . . Jennifer Aniston WITHOUT A DOUBT!\".  Jennifer is awesome - I love her and enjoyed the movie.  It was not a great movie by any means, but it was really funny and we did not regret spending the money or time on it.  I am tired of the far-fetched movies that don't make sense, but at least this one KEPT ME LAUGHING!!",
      "total_reactions": 3,
      "user": "marcomom"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "i agree with LamontRaymond.  when i go to the movies i want to be entertained.  i laughed my ass off at this movie, and i left feeling good.  with adam sandler and jennifer aniston its hard not to leave feeling good.",
      "total_reactions": 3,
      "user": "mjnp06"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "I love this movie! not stop laughing in the theater when I went to see it! is very funny. You laugh because you take even more confidence with the actors.",
      "total_reactions": 3,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 2,
      "text": "What is it with Jen?  In every movie, she acts like the good lost puppy; has a hang dog face, who's always the other woman that gets taken for granted; but magically, triumphs in the end.  Are you telling me that any man on physical appearance alone would choose Jen over Brooklyn? C'mon, please!  If you believe that then I have a BRIDGE I want to sell to sell you.  But that's exactly what this lame movie is about.  Adam Sandler doesn't even have one funny line to say.  This movie is so bad that I was longing for Rob Schneider screaming out his usual Adam Sandler movie \"YOU CAN DO IT\"  but he never appeared on camera.  Avoid!",
      "total_reactions": 4,
      "user": "fantasy"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Just Go With It , is yes stupid humor , dumb jokes and well (not) so good performances , but is also hilarious , with great chemistry between the two leads , It comes on strong , but ends with BIG laughs so Go with it\" .. B+",
      "total_reactions": 4,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "I no like Adam Sandler, he is the bad. Not the funny. The movie is. Overall, no to the movie. It is not god. That is what I think after I seen it in theaters. Thanks.",
      "total_reactions": 9,
      "user": "VFStein"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "A predictable movie that doesn't really bring anything new.  However I have to say that this was much more entertaining than I thought it would be.  There were a lot of funny moments and the characters were enjoyable.  If you're a guy and your girl wants to see a chick flick this is a good option.",
      "total_reactions": 1,
      "user": "canadianrugby"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "Yes, there may have been too many unneccessary sexual references in this movie, but ignoring that, the movie was very funny overall.",
      "total_reactions": 1,
      "user": "gm101"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "It's a pretty damn good movie! Probably one of Adam Sandlers best films in the past 5 years. I'd love to write a full review, but all of the true movie lovers who actually give this film the score that it deserves (around 8-10) sum it up very well. I personally give this film an 8, but a 10's pretty necessary to bring the movies review up from a pitiful misleading score.",
      "total_reactions": 1,
      "user": "chrisking8613"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2011
      },
      "score": 9,
      "text": "While reading the criticism about this movie i was sceptic about going to see it. But afterwards, i'm so glad i went. It wasn't a artistic movie, it was basically kind of dull, accept for some moment's when you where thinking. But the brilliant humor made everything else seem less important. The humor in it was brilliant, i laughed through the whole movie. It was a really positive surprise. And today it's so hard to make a movie that is truly funny, so let alone the fact that it makes you laugh through the entire movie makes it worth a score well above average.",
      "total_reactions": 1,
      "user": "Eddie0"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "DO NOT TRUST THE CRITIC REVIEWS THEY BLOW!",
      "total_reactions": 1,
      "user": "MrRiggs"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "I wouldnâ",
      "total_reactions": 1,
      "user": "hesaidshesaidfm"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "I think that it was great to finally see Jennifer and Adam working together. There was clear definate chemistry which helped their on-screen relationship work well together. It was very cute and very entertaining from beginning to end. Had a fun storyline, Nicole kidman with that bubbly character was a fun touch and Jennifer looked amazing more then ever. I enjoyed it alot and would definately recommend it, for couples, night out with the girls, with the family, it is just alot of fun for everyone.",
      "total_reactions": 3,
      "user": "sammy24"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2011
      },
      "score": 6,
      "text": "It's not good by any stretch of the imagination but there are a few really funny scenes. And Brooklyn Decker was hot enough to bump my rating up by two or three points. Not great but it's a decent enough flick to see with a girlfriend and/or boyfriend",
      "total_reactions": 1,
      "user": "cdk222"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "After watching Sandler miss the mark in his last few movies I was refreshed to see something that made me laugh frequently throughout the movie. Its a funny, silly Sandler movie that lives up to that with some good romance chucked in.",
      "total_reactions": 2,
      "user": "Remies"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "I just want to say this is the best movie I have ever seen!  Jennifer and Adam did an amazing job together and they would make a great couple.  I have seen the movie in theatres 5 times and i can't wait till it comes on DVD.  I loved this movie so much it had the best songs and hawaii  is absolutely amazing...  Great job to everyone who made this movie.  Best movie best actors just amazing all around.",
      "total_reactions": 1,
      "user": "skibratz"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "Awful movie,its a copy of a indian movie \"maine pyar kyu kiya\"i already hate that indian movie and they made copy of that movie,i like adam sandler and jannifer aniston,man this is the worst movie of them",
      "total_reactions": 2,
      "user": "hunny"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "Jennifer Aniston rocks the romantic comedies and Adam Sandler is the best comedian right now in Hollywood...it was an amazing combination! \"Just go with it\" apart from the amazing actors it had a well-written script and overall it was a good comedy to enjoy with your friends on a Saturday night. Nowadays, not many comedies are released and \"Just go with it\" was a funny moment among the sad and dark movies that are regarded serious and mature. It's a fresh movie that talks to mostly young ages so maybe that's why the critics didn't like it.",
      "total_reactions": 1,
      "user": "SteveCross"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "I did not want to see this movie at all. But i was glad i did, Sandler and cast was funny the entire movie. I loved everything about the move, just that it would slow up for a little while then pick up. Overall this is a great movie night movie. Funny great plot and the cast is awesome.",
      "total_reactions": 1,
      "user": "DrMovie"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "See past the horrible physical comedy and predictable story line and you will find a few laughs hidden within. It's nothing more then the simple romantic comedy but there are reasons we still enjoy them and this film doesn't miss out on those opportunities. However the plot is ignored entirely.",
      "total_reactions": 1,
      "user": "filmtrashreview"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "I loved this movie!!!! I laughed through every minute!!!! I love Adam Sandler and Jennifer Aniston!!!! This movie is the best movie I have seen all year!!!!",
      "total_reactions": 1,
      "user": "PinkFloyd4ever"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2011
      },
      "score": 7,
      "text": "A lot of people giving this movie a bad name. First, it is Adam Sandler. You know what to expect from him. It is light hearted and entertaining. If you are looking for an Oscar winner this is not the movie for you. This movie is very silly so be prepared.",
      "total_reactions": 1,
      "user": "buckwheat"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "This is probably not a 10, but it is a very good movie.  This is where the critics really fall down.  There is nothing ground breaking here, nothing new, it is all predictable.  However, it is very good at what it does.  Surprisingly, The chemistry between Anniston and Sandler is really, really good.  The acting is actually superb.  They play it low key, but this movie is easy to watch, full of smiles and laughs, and a great joy.",
      "total_reactions": 2,
      "user": "foundationcitiz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "This movie made me laugh for real. I didn't think i was going to watch an excellent movie after i read some of the critics but it turns out this movie was very hilarious and made me crack up on some scenes. (Especially that dude who tries to talk like a german) The story was pretty original for me. I've never thought lies can be more fun than this.",
      "total_reactions": 1,
      "user": "julian_zizzle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "The user reviews are more predictable if you think about it because its the critics job to watch films whereas its our choice to see these films and i think this film is really good. I went to see it with my friend and it was really good and really funny. I am now going to buy it on DVD because i want to watch it again. I dont think this film has any bad points and itss a people pleaser.",
      "total_reactions": 1,
      "user": "hollyvictoria19"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "'Just Go with It ' just like i thought it would be . it was not only funny it was sandlar funny with Jennifer and the hottest Brooklyn ! Smart , Funny and Sexy this movie had it all plus surprising Nicole made it all in all. the 2 kid was also surprisingly funny and so good ! its not like typical Rom-Com . it was way more funnier then other Rom-Com ! and it was Hawaii so its obvious that hoe the scenes are .",
      "total_reactions": 1,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "The best Adam sandler movie that I saw! and I am not a fan of his movies. It was watchable, funny at times. and the story being very predictable it was intresting to watch. The characters were well written. a veyr big suprise!",
      "total_reactions": 1,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "You might say that this is Adam Sandler's best true performance when it comes to all seriousness. It wasn't as funny as I thought it would be but it has a better story than most of Sandler's films, you got to admit.",
      "total_reactions": 1,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "Just Go With It is actually a really good movie with plenty of laughs. Adam Sandler has struggled as he's transitioned to more family oriented films to keep his edgy and outlandish style but this is proof that he's still got it. Jennifer Aniston has one of her best roles ever where she isn't completely intolerable. While both of the stars are outstanding, the biggest laughs come from Nick Swardson. He is so ridiculous and out there that he can pull off the craziest of roles. Also, unlike most comedy movies, this film isn't full of annoying moments that never seem to end. Then you throw in the beautiful Brooklyn Decker, who actually is a decent enough actress, and you have yourself a movie worth watching.",
      "total_reactions": 1,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "Although a predictable movie with the usual romance film cliche,  just go with it features a great relaxed comedy with moments that do manage to make you laugh. As usual in an Adam Sandler movie the film does feature the odd tiresome joke that threatens to sink the film into the zone of ''what else is on'' Adam Sandler is with his usual performance, jumping back into a familiar territory much like...pretty much all of his films on either side of his Funny People. Nick Swardson takes on Rob Schneider's usual role of the unfunny other guy...still unfunny no matter the actor. The films greatest asset is young Bailee Madison who plays Jennifer Aniston's daughter to great comical effect, with the best character and lines including a great little line in which she calls Brooklyn Decker a ''w***e''. Worth watching if you want a few quick laughs and if you want to sit back and relax.",
      "total_reactions": 1,
      "user": "HidekiNara"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "This movie was a huge suprise to me. Most of Adam Sandler movies are nonsense. But this movie had a tone that seem quite sweet with some serious parts that worked pretty good. Adam Sandler's best movie since Bid Daddy.",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "It seems like Adam Sandler has been on a spiral heading into the toilet, and even though this movie is pretty stupid, I still found the characters very likable and fun to watch. I loved seeing Nicole Kidman in there being the total opposite of anything I've ever seen her in.",
      "total_reactions": 1,
      "user": "Trev29"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "My wife and kids love this movie. This is one of Adam Sandlers best movies. I have to wonder about the people who give this movie a bad review.The number of good reviews say's something about that group.Same people that thought Titanic was just a stupid movie about boats.LOL!! The actor who play's Sandlers cousin Eddie is great and one of the best parts of the movie!!. I thought Dave Mathews and Nicole Kidman were funny also.The actress that play's Palmer was sweet and very nice.The whole cast was funny. The two kids that play Aniston's children mainly Kiki Dee, were very good. The whole movie was good. Like any movie, there may be a slow section here and there.This movie had us laughing pretty much through the whole movie.We watch it quite a bit. If you were born with a laugh track or a family oriented person, you will love this movie. If you are a unhappy person inside or your one of those people that contradict everything, you will hate it. This is a fun, funny, see it movie!!!!!!!!!!!!!",
      "total_reactions": 1,
      "user": "Riffs101"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "A very funny movie Adam Sandler and Jennifer Aniston did terrific in their roles. The children Bailee Madison and Griffin Gluck were also great. I loved it from start to finish you should definitely watch if your looking for a fun movie.",
      "total_reactions": 1,
      "user": "Night_Hawk_2012"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2012
      },
      "score": 7,
      "text": "Not the worst Adam Sandler movie ever, he still has great comedic timing and a brand of humor between him and his buddy entourage that is funny, just not as original as back in the day.",
      "total_reactions": 1,
      "user": "Arcturus_Rann"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "obviously the movie doesn't deserve an oscar. it wasn't meant to be a great film. it's an adam sandler movie, a light, funny romantic comedy. i don't get why people judge it so harshly! the chemistry between sandler and anniston was really cute, and i actually cried in some of the love scenes towards the end and i don't usually cry in movies like this one. some of the plot was a little silly, but all in all, it was a fun movie to watch. i also love how in some of the sandler movies you can tell that he's laughing at the jokes. it's so cute. i find him so sexy, which all my friends make fun of me for, you just have to love him though. :)",
      "total_reactions": 1,
      "user": "adamsandlerlove"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "A cheese ball romantic comedy that is completely formulaic and predictable from the very beginning, but will make you smile at its sweetness nevertheless.",
      "total_reactions": 1,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2012
      },
      "score": 4,
      "text": "The first time I saw this film I liked it, I enjoyed the humor and really liked the cast. I just saw the film a second time, and still feel the same way about the film; I must admit that I am lowering my rating a bit, but I still thoroughly enjoyed this film. The title \"Just Go With It\" is the perfect way to describe this film. To enjoy this film you must go along with the fact that it's completely unbelievable, ridiculous, over-the-top, and exhausting. But all the while there is a humor and charm that holds this film together that allows for a really fun time. The cast is great! Sandler is funny, Aniston is great, Nick Swardson is funny, Brooklyn Decker is hot, Nicole Kidman is fun, and young Bailee Madison is so good! I had a great time with this film, there is genuine humor and the cast is really nice.",
      "total_reactions": 1,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "\"Just Go with It\" has major problems with its lack of wit and exhausted repeated jokes, but thankfully, Aniston's performance is able to boost up the comedy in the film; adding to an amount that ranks higher than many other films that try the same formula of comedy as of this film With Sandler's and Aniston's connection being believable, \"Just Go with It\" manages to hit the mark for several adults and teens to enjoy. Despite the issues with telling a story without the sidetrack and silly moments that were unnecessary, \"Just Go with It\" is enjoyable enough to be recommended to adults, and older teens.",
      "total_reactions": 1,
      "user": "jeff_reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2014
      },
      "score": 0,
      "text": "This movie is a chore to sit through. The attempts at humour make me cringe and the whole vacation part of the film just seems like an excuse for the actors and crew to go on vacation. Adam Sandler still feels like he's playing the same character he plays in all his other movies so to say his performance is getting stale would be an understatement. The only reason I don't regret watching this movie is that when someone says they've seen the worst movie ever, I can say \"you clearly haven't seen Just Go With It\"",
      "total_reactions": 0,
      "user": "spi280"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 5,
      "text": "One of Adam Sandler's less-painful flicks in recent memory. Jennifer Aniston is fine, fresh and fierce... and with a zany, crazed Nicole Kidman, I actually enjoyed myself.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "Once again, Sandler proves to be unfunny and somehow irritatingly smug in this heavily arrogant and even exasperating \"comedy\". Jennifer Aniston and all the other women are stereotypical film women; clueless about relationships, not relatable and, in generable, plain **** It's an unoriginal romantic comedy, with cheesy writing, and bad acting, even from Aniston.",
      "total_reactions": 0,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2014
      },
      "score": 0,
      "text": "Now this is a really typical Adam Sandler's movie. During his enire acting career so far, we have seen lots of ridiculous \"works-of-art\" like this film from Mr.Sandler, but this time everything reaches it's bottom. EVERYTHING. Acting, Dialogue, Direction, Screeplay and Plot. All go straight to the dogs as if nothing better were strong enough to hold them. Poor Aniston for taking a role in this Sh*t ! ! !",
      "total_reactions": 0,
      "user": "PvtJackson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "from the creators that brought grown ups and benchwarmers  and guess who's in a denis dugan film always adam sandler who always has everyone laughing to there feet in this movie i like adam sandler sandler mobies i didnt get 5 laughs or 10 laughs this far . but great movie",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "Sandler proves in the trailer that The kid put his face on his pee pee even though  face and pee pee are not different names for the same thing...Proves that ugliness can be tamed........hard to understand the sneeze scene....hard to understand when Sandler isn't being funny with the beard joke.......Its never a good sign when it seems to take all day to watch a movie....hate when movies don't take into account how hot and bright tropical places really are.....i feel like the sun simply just doesn't look good to people anymore....i feel like someone my age (23) shouldn't be watching and television is now for people the little boys age....I don't like to feel this...and then they have him swim again...hope its over....not bad nicole kidman is still a witch to me even though i never saw that....I have to watch Doubt now and the two should cancel each other out...just like eternal sunshine on a spotless mind was supposed to cancel out the Help.......The hard part now is canceling out all of the canceling out work I've been doing......also ill have to cancel out the joke of smelling nicole kidman with something.....i feel like all the hot women should just be confident in front of me and bash me like a rat.... so that i die...I didn't like the hula contest....i didn't die..but i didn't feel that either of them deserved to win the competition...its like no one even saw me up there...-JRA",
      "total_reactions": 0,
      "user": "CameraBounceGod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "this story is copied from a Bollywood block-blaster  \"Maine Pyaar Kyun kiya\" (2005). Starring Bollywood superstar Salman Khan, former Miss Universe Susmita Sen and Katrina Kaif. as I have seen both movies this is better version.",
      "total_reactions": 0,
      "user": "rex997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2016
      },
      "score": 6,
      "text": "It has his good parts, but it is a movie of sandler and is going to see mediocre comedy, so it is not advisable do not see her, you will spend hours of your life",
      "total_reactions": 0,
      "user": "2016"
    }
  ]
}