{
  "mc_avg_user_score": 1.6,
  "mc_metascore": 52,
  "mc_mixed_rating_frequency": 20,
  "mc_movie_name": "Justin Bieber: Never Say Never",
  "mc_negative_rating_frequency": 390,
  "mc_positive_rating_frequency": 68,
  "mc_pro_critic_reviews": [
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 83,
      "summary": "If this is what it sounds like when a new millennium goes pop, I'll take it."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 80,
      "summary": "This sensationally engineered promo film makes Justin Bieber look like a true force of nature."
    },
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "On stage variously with Boyz II Men, Jaden Smith, Miley Cyrus, and Ludacris, Bieber carries himself like a squeaky-clean homeboy with an angelic voice. On him, swagger looks sweet."
    },
    {
      "critic": "Michael Rechtshaffen",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 70,
      "summary": "It generally succeeds, too, thanks to a visually energetic approach by director Jon Chu that keeps all the obligatory backstage/onstage bits moving fluidly."
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 70,
      "summary": "As much a legitimate documentary as it is a 3D concert film and teen girl squeal-delivery device, the film possesses surprising moments of candor on the toil of teenage superstardom."
    },
    {
      "critic": "David Malitz",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 63,
      "summary": "It's a fluffy, mildly inspiring, celebration of the hero leading up to his big moment."
    },
    {
      "critic": "James Adams",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 63,
      "summary": "Equal parts biopic, concert film and pep rally, the movie's 105 minutes do a good job of conveying the pleasures of pop, courtesy of the very real talents of Justin Bieber."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 63,
      "summary": "The movie usefully, carefully, and cogently argues that Bieber is more than his hair. He is his hoodies. He is his pop-hooks. He is his many handlers."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 60,
      "summary": "Bieber's world - at least as edited for mass consumption - is a refreshingly wholesome universe, where a young superstar is good-natured and grateful, says grace before every meal, and spends all his free time on the tour bus tweeting. He also likes to hug, a lot."
    },
    {
      "critic": "Mike Hale",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 60,
      "summary": "Everyone involved in \"Never Say Never\" is working overtime to prove that he is, as one of them puts it, \"just a regular kid who had a dream,\" while everything about the movie screams the opposite."
    },
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 60,
      "summary": "The film is a really entertaining look at the Bieber phenomenon; the music in Never Say Never is great and Bieber proves himself to be the real thing as a musician and performer."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 60,
      "summary": "Chu does his best to humanize his subject, showing him surrounded by devoted friends and family, and wringing much drama from an on-the-road vocal-cord strain."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "It's definitely not hard to understand what the little girls see in Bieber, and this film delivers the goods. This one's for the fans, not the movie buffs."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "What we do see is mom, dad, Braun, Usher, vocal coach Mama Jan Smith and the burgeoning Team Bieber claiming they only want the best for the boy as he goes through a punishing 84-date concert tour. Group hug."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "Never works as a gum-snapper concert movie and does provide a glimpse into instant stardom in the Twitter generation."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "It's a disappointment to see the teen pop star hop in a tour bus. This is a boy who should be traveling across rainbows on the back of a unicorn."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "Strictly as a piece of filmmaking, Never Say Never is a bit of a mess."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "3D or not, the film about the mop-topped Canadian - who turns 17 March 1 - doesn't let us get very close to \"the talent.\""
    },
    {
      "critic": "Simon Crook",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 40,
      "summary": "Squeaky clean fun for the youngsters in the family. Everyone else hide."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 38,
      "summary": "The film slowly builds up to Justin's first appearance at Madison Square Garden, where his show sold out in 22 minutes."
    },
    {
      "critic": "Genevieve Koski",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 33,
      "summary": "The film's premise-that Bieber achieved his superstardom through years of hard work overcoming towering obstacles-is so ludicrously flawed that everything built upon it borders on self-parody."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2011
      },
      "score": 20,
      "summary": "It is draggily paced and lacks felicity of form; the 3-D is a rip-off and the songs are pap, save a snippet of Etta James singing \"At Last\" while Bieber's glossy fringe sways in slow-motion."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 22,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2012
      },
      "score": 0,
      "text": "Worst movie I've EVER watched. Seriously pay me $500 and I won't watch this garbage. Its about a 16 year old kid (he's 18 now but he was 16 in the movie) with no talent that makes songs that makes me want to tear my ears apart. This movie was scarier then a horror movie with bieber's singing. I'm glad the user rating is 1.6 it gives me hope in the human race.",
      "total_reactions": 22,
      "user": "makemesick35"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 19,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2011
      },
      "score": 0,
      "text": "This film is a complete and utter disgust to all who were dragged here by there daughters or girlfriends aged 5 to 16 because of their hormone induced crush to this mediocre pile of excrement that is Justin Bieber. this is the reason people commit suicide. it is all that Justin Bieber is, mediocre, cheesy, unwatchable, and a disgrace to the human race as a whole.",
      "total_reactions": 21,
      "user": "humanjuggernaut"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 17,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2011
      },
      "score": 2,
      "text": "This is a movie?Even gram' could do it better...",
      "total_reactions": 19,
      "user": "spartan-117"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 34,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "You would need topay me to sit through this again. There's no point to this movie, in fact it was probably made so that Justin Bieber and his people could make more money.",
      "total_reactions": 39,
      "user": "GarethCritic"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 22,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "absolute rubbish this brat destroys modern music like no one else",
      "total_reactions": 26,
      "user": "coldplaz"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 47,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 1,
      "text": "I have a question for the makers of this movie: \"Why?\" Why would people go to see this movie? I took my young niece to go see this movie for her birthday and she enjoyed it mildly from what I understand. But bored me and the other older people in the theater. I suppose this is where our society is, that we have to make  a \"documentary\" (and I use that term loosely), about an overly sub par musician.",
      "total_reactions": 56,
      "user": "Amcope"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 19,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "My girlfriend promised me an extra 'special' valentine treat if I took her to this film.  Well, no matter what she does for me, it was not worth it.  It should be titled \"I Want To Make More Money, And I am So Great\".  Biggest piece of crap I have seen ever!",
      "total_reactions": 23,
      "user": "Bart"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 22,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "Worst movie ever! It shouldn't even be a movie, just a documentary on tv or something. This kid is really becoming sellout. Oh and the story......wait, is there one?",
      "total_reactions": 27,
      "user": "Chizzbo"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 16,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "The worst movie i have seen in my entire life.",
      "total_reactions": 20,
      "user": "Daniel_93"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 19,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "Justin Bieber is just another one of those celebrities that go down the pipe like Lindsay Lohan. Justin is currently cheating on two girls  so I'm NOT a big fan. He just disgusts me.",
      "total_reactions": 24,
      "user": "dumbuldore"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 19,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "His story is not that impressive. He just got lucky. This is not a rags to riches story, It's just some kid who got found by Usher on youtube. Now, had this kid been homeless and then he got found, it'd be a bit more impressive. I guess the question is why is this story worth telling. It isn't but the people involved knew they'd make a lot, especially if it was in 3-D. Bieber is not that talented. Auto-tune does wonders (just look at this years half time show) and his songs are pretty damn awful. This movie should have just been a concert movie, it still would have sucked, but it would have been shorter.",
      "total_reactions": 24,
      "user": "Schmit93"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 31,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2011
      },
      "score": 2,
      "text": "Worst then i thought..i dont know why they creating such a nosence kind of movies.west of my time.i suggest you to do not see this movie or u would weste your money and time,",
      "total_reactions": 40,
      "user": "Moviemaniak"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 25,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "Haha. According to this score, the movie sucks. Thank you users, you've saved me from a terrible movie, no matter how much my cousin (12) wants to see it with me, I will say no. Thank you. I wish this movie was under a 39. Justin just wants more money than he wants and apparently, it failed. Hold it, girls think we are jealous of her? hahahahha, how can anyone be jealous of a no-talent youtube found leech? I certainly don't. Also, I just love the girls that go, \"OMG!!! BEST MOVIE EVAR!!! I LOVE him!!!!! I want to KISS HIM!!!\" Now that I was forced to see the damn movie, I would give it a -100. Wait, no 100? Dangit, Seriously, who the hell wants to see this? Y'know who? 5-17 year old girls who can't listen to REAL music in the almost ruined music industry. It's idiots like him that are helping ruin the once good music industry. Before we know it, everyone is going to be like, \"Who is Justin Beaver?\" I can tell you right now, a world with \"Beaver Fever\" will be the best world in the whole damn universe. Terrible movie, watch him getting his head hit with a water bottle on Youtube. You won't regret it.",
      "total_reactions": 33,
      "user": "xXAnthonyXx"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 18,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "Movie about 16 year old (girl ?). There's some lines that you shouldn't cross. I don't know what the point was to create such a movie,even if you can call that a movie.",
      "total_reactions": 24,
      "user": "Zari"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "text": "This movie is GODAWFUL. And it is terrifying to actually know people LIKE this movie. Apparently some people still need to work out Justin Bieber. Because nearly everyone who rated positive might have been his fans trying hard to actually give a good review without watching it, worse, it's 3-D.",
      "total_reactions": 2,
      "user": "Annoymous1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2013
      },
      "score": 1,
      "text": "My daughter wanted this for Christmas. Reluctantly, I bought it for her. It's trash. I know what you're thinking, 30 something who grew up in the 90s. You listened to grunge, your opinion is invalid? Nay! even the worst techno bands of the 90s and 00 make Justin Bieber look bad!",
      "total_reactions": 1,
      "user": "BillySpandex"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "Why do things like this even go to the theater? Makes no sense to me! It`s kind of like the Jackass movie, only difference is that might be worth watching for free. To want to see this, is to be a Jackass I suppose lol",
      "total_reactions": 1,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "text": "I didn't watch this movie,but I can tell this movie is NOT space! It is about meth addicted 16 year old homo kid and his personal life. Avoid this movie if you are not CANCER. If you are MOLODEC,do not watch this movie because IT IS SIMPLY NOT SPACE!",
      "total_reactions": 1,
      "user": "KosmosProstoR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "Justin Bieber and this movie suck! Bieber has awful music and he is terrible. This movie is awful even with the story. They've also got Miley Cyrus who sucks too. This is a piece of garbage and avoid this at all costs unless you are one of those Beliebers. Worst documentary ever.",
      "total_reactions": 1,
      "user": "Mariofan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2016
      },
      "score": 0,
      "text": "The only reason I watched this movie was because I was.literally dared fifty bucks to watch this hunk of garbage. I was lucky to even survive this fan girl movie. In fact the only people who will probably like this mocie are the people who love his music. This movie is the worst movie I have ever seen, it will kill you.",
      "total_reactions": 1,
      "user": "gameguardian21"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "Would I pay to watch this movie?No.But I really wanted to write a review about it so I borrowed it from my niece.I tried to watch and it was really hard for me because this movie is STRICTLY for Justin Bieber fans.People have to understand that this is some sort of biography and backstage footage of an artist.I may not like him or his music but this is a movie review so my vote based on what I saw is 3/10.There were only a few parts that I liked.All the others just kept reminding me that I would never pay for that.On the other hand IF I was a true fan it would be most likely an 8/10 simply because it would be more enjoyable to me.",
      "total_reactions": 7,
      "user": "LeonidasPeplis"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 0,
      "text": "...I'm sorry, who exactly is Justin B.? Why does he have a biographical film about him? He is one of the least influential or important \"artist\" out there, right along the lines of Katy Perry and Kesha.",
      "total_reactions": 6,
      "user": "Polonaise77"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "Justin Bieber is nothing more than a hack on the pop music industry and an arrogant jerk in general. Tired of seeing the media promote and advertise this jerk. I had to suffer through watching the movie (was forced to go) about this kid. Don't understand why a movie was made about him when the time, film, money resources could be used for something better, entertaining and makes sense. While pop music may not fade, the people eventually do until the next kid comes around.  Bieber is so \"famous\" because so many preteen people have this inane fantasy that he actually cares about them. All he cares about is the money, all the \"industry\" cares about is the money and the set that likes him has spending power.  The movie was made to cash in quick. But these things are mostly cyclical, and he'll fade away soon enough. Sadly, people like us get to be inundated with this garbage until the ride is over.  The only major fans he attracts are preteen people, who tend to be a very shallow audience and are easily impressionable to like whoever the pop star is.  The major problem is he will be not simply fade in their shallow minds, he will be replaced with another boy or boy band to annoy those of use with 6th grade and higher educations.  He's just another recyclable commodity like most of this teeny, pop idols. be replaced by another \"farmed\" individual that meets the current needs of the music industry today. People are attracted to these individuals(Can I really call them that though? Especially when they don't write their own music or lyrics...) Save your money and time on an actual movie.",
      "total_reactions": 18,
      "user": "EverettLamb"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "It was single handedly the worse movie I have ever seen in my life. I cannot believe how boring it was, and how it over glorified himself.. it made him seem so haughty.",
      "total_reactions": 18,
      "user": "Girlygirl24"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "Justin Bieber most annoying person on earth. Would have been more exciting if Ellen Page was dressed up as him singing and dancing dull nonsense. Hype over nothing.",
      "total_reactions": 17,
      "user": "Dorrbecker"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "Please Justin Bieber, stop this crap. If you are listening to this review (which you are probably not, just counting the dollars you just made) don't make a pathetic movie to attract your tween fans who will just drool over you. Seriously, when your voice goes, you go.",
      "total_reactions": 16,
      "user": "Setman428"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2011
      },
      "score": 0,
      "text": "A cinematic abortion. This is a very poor documentary that will not be recorded throughout any form of history and nobody will remember it for years to come. It's something you see once, hate it, and it will never be good. You should fancy this **** up as much as possible, but at the end of the day, it's just a bad documentary for a bad singer supported by a poor fanbase. Awful.",
      "total_reactions": 4,
      "user": "TheCriticCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2011
      },
      "score": 0,
      "text": "I actually fell asleep and I wasn't even tired watching this film, it was like torture, they must repeat this film in hell all the time along with his stupid songs, he's like 6 years old, why did they make a movie about him? I feel like an idiot for actually bothering to take my young cousin (9 yrs) even she hated it !",
      "total_reactions": 4,
      "user": "CensingSpirit"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2011
      },
      "score": 0,
      "text": "Imagine that an elephant was **** in your mouth after eating jalapenos, while your flesh was being ripped off by a man-eating lion, and your testicles were getting ripped off with a handsaw, while on fire, in a bath of hydrochloric acid. This is how it feels like watching this movie.",
      "total_reactions": 4,
      "user": "ElementalChaos"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2011
      },
      "score": 0,
      "text": "WORLD WORST MOViE EVER. I SAY NeVER WATCH IT EVER JUSTIN BIEBER IS A DISGRACE TO THE MEANING NEVER SAY NEVER. SO DONT BUY ITS DVD OR YOU WILL REGRET IT AND WANT A REFUND.",
      "total_reactions": 4,
      "user": "jmmastercrictic"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "If you are reading this, please do not waste your life watching this movie! I took my daughter to see it and it was just awful, she got bored and ended up begging me to leave.",
      "total_reactions": 15,
      "user": "scubasteve"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "I've got to be honest, this is the by far the worst movie i've ever seen. I have no idea why they thought it'd be a good idea to make a movie on a kid who barely has a career but, then again, maybe the box office will prove me wrong.  However, i know what won't prove me wrong: the ratings... because i KNOW i am not the only person who absolutely hated this movie.",
      "total_reactions": 15,
      "user": "hamish"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "Bad movie is bad. Why would anyone make something like this? I absolutely hate it! Justin Bieber is milking as much money as possible before he is toppled by haters.",
      "total_reactions": 18,
      "user": "Sepoquro"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "To call this film a documentary is like calling True Grit a comedy, or the Kingâ",
      "total_reactions": 13,
      "user": "Wingnut"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "What a horrible idea for a movie. This kid hasn't had a hard life. He doesn't need a movie about him. The only reason it exists is for retarded teenage girls to waste money on. He has no talent and will be forgotten in a few years. Idiots like this ruin the music industry with their talentless garbage.",
      "total_reactions": 16,
      "user": "StevenM"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "True. There's no reason to make a movie about a boy who gained fame because of the hair. Moreover, this part should appear in the movie, right? And he thinks he's awesome.",
      "total_reactions": 16,
      "user": "mdallag"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "I dont see why anyone would like this movie. It doesnt make any sense. The story of this guy is nothing special. Why should I (or anyone else) like this? I mean, the story of my life is better than this kid's. Same goes for my neighbour, my pregnant girlfriend, my half-wit step sister, my kindergarten teacher, my maid's maid, the kid who pees on my doorway everynight  etc etc. I mean why dont they produce a movie about these people? It would still beat this movie by far. Do the producers hate the audience and people in general. Do they have some kind of hatred towards humanity. Are they angry that man went to the moon, that america has a black president, that elvis is dead? Did god send them to punish us for our sins? Or do they have nothing better to do? To be honest, if i had a chance to reverse time and undo my regrets, not watching this movie would be at the top. I would rather go to jail than watch this ****. I would eat my beef raw than watch this ****. I would kiss a guy's ass(literally) than humiliate my self esteem by watching this. Hell, if i had to choose between this movie and a soaking my face in a pile of horse s**t on a plate, i would choose the tasty looking dish on the right.",
      "total_reactions": 16,
      "user": "verminator"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2011
      },
      "score": 2,
      "text": "How Is This Even Good????",
      "total_reactions": 16,
      "user": "RogerSmith97"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "When i was going to see this movie i expected a documentation about a young teenie star. But what i got was an anthem of a little boy who would like to be the new Elvis. I dont know why someone reallys produces movies like that. Worst movie i have ever seen!",
      "total_reactions": 15,
      "user": "Nemanes"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "Justin Bieber. Thats all you need to know.",
      "total_reactions": 15,
      "user": "GhostSniper"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "True Justin Beiber is an artist, but he's is as much of an artist as me farting into someone's face and lighting it with a fart, he has absolutely no talent whatsowever and sings like he has a whistle stuck in his neck. Absolutely annoying Disney channel music. I am absolutely ashamed he's Canadian, he gives my country Canada a bad name and sells his girly androgynous image to the pleasure of the American pigs, who exploit him for money!",
      "total_reactions": 12,
      "user": "kentMOsabe"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2011
      },
      "score": 0,
      "text": "this movie is a discrage to cinema,it is about the most annoying person ever whith an annoying voice charts his rise to becomeing the most hated man on the internet.watch at your peril",
      "total_reactions": 3,
      "user": "ps3nerd"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 0,
      "text": "Puto niÃ±ato de mierda. Da muchisimo asco, tal vez con el tiempo acabe medio moribundo, hebrio y con una jeringuilla en la frente.",
      "total_reactions": 3,
      "user": "alicantinista"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 0,
      "text": "Worst movie ever made. It's a story about a homosexual kid who never hit puberty and makes the worst songs ever (possibly causing hearing AIDS). Useless movie. Never watch this crap, it's full of nonsense - more importantly, why would anyone even want to see this movie? No-one cares about his life. He should die.",
      "total_reactions": 3,
      "user": "iAGR"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2013
      },
      "score": 3,
      "text": "look, if youre a fan of justin bieber, then fine, my 8 year old sister loves justin bieber, and she doesnt even like the movie. i already knew that this movie was nothing less than a documentary. so i treated this movie like a documentary, and the movie even does a poor job at doing that. there are some times where the movie talks about justin bieber's life, you know, like a GOOD DOCUMENTARY but those times are thrown out the window because in the majority of the movie, justin bieber spends all his free time on the tour bus tweeting. He also likes to hug...... a lot. So, the movie MIGHT be squeaky clean fun for devoted fans of justin bieber. Everyone else hide and dont look back.",
      "total_reactions": 3,
      "user": "dipto"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "This movie is just terrible. I dont just hate it because I dont like Justin Bieber, I hate it because it is a piece of **** movie. Justin Bieber hasn't gone through a hard life, he is a **** millionaire and people thought it would be a good movie to make about him. He is not special in any way. His music is plain and dull and supports conformity.  Overall I think whoever made this movie or thought about making this movie should blow there **** brains out.",
      "total_reactions": 17,
      "user": "MatthewXploder"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2011
      },
      "score": 1,
      "text": "The worst movie of the year, enough said. No, I haven't seen all the movies this year for obvious reasons, but I don't know why I should like this film, when the producers don't like it either. See you at the Razzie Awards, Justin!",
      "total_reactions": 22,
      "user": "TheCoolFrench"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "Ok i dont know y some people gave dis thing (note : i am not calling dis a movie)a positive comment but when i saw(someone dared me) dis at d starting i felt like killing myself and till d end d feeling just got worse.",
      "total_reactions": 11,
      "user": "DarkSavalour"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "Justin Beiber is stupid and why would watch this travesty of some dumb documentary of his life. Why would anybody would know where he came from or how he came to be.",
      "total_reactions": 13,
      "user": "jAbMaN"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "If someone were to pay me twenty dollars to view this movie again, I wouldn't do it. Do you know why? It was terrible. Absolutely, without a doubt, terrible. There was awful music, and the premise about following a young Canadian girl on her quest to glory was sub par at best. Do not recommend.",
      "total_reactions": 13,
      "user": "Twibb"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "A documentary about a sixteen-year-old? What had he done? Sang some songs and dated Selina Gomez? The entire movie is the kid rubbing all of his \"talent\" and money in the viewers face, then doing a show at the Garden that - surprise, surprise - gets sold out almost immediately. I thought the movie would've at least shown his rise to stardom from rock bottom, hence the title, but it was almost the exact opposite of that. If I knew the title was going to be that misleading I wouldn't of gone to see this stupid film. All it does is make you feel bad about your life, which is not nearly as good as Justin Bieber's. The title should be changed to \"Justin Bieber: You'll Never Be As Rich As Me\". At least it would've been accurately titled if that were the case.",
      "total_reactions": 13,
      "user": "SolArcher"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "This movie and any product associated with it, or Justin Bieber is the single handed reason why American entertainment is slowing descending into hell.",
      "total_reactions": 13,
      "user": "PictureShow"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "Completely horrible. I took my sister to go see it as a favor and greatly regret doing so. Only semi-reedeming quality was trying to figure out whether the titular character was in faft male or female. Ending gave an Inception-like answer to my question, still very unsure.",
      "total_reactions": 13,
      "user": "etk"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2011
      },
      "score": 1,
      "text": "to be honest, why hasn't this movie got reviews less than mixed?, despite all the oh! you guys are jealous of him, in fact im not, this is despicable, just another stupid docu which anyone can make, i literally walked out of the door... meh crap review",
      "total_reactions": 15,
      "user": "Chrono"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "i havent even seen this but im sure that its the Ga@#st movie ever made.   Id rather watch dora the explorer thant this beiber  crap.",
      "total_reactions": 10,
      "user": "Slammyj"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "rather than pay the money to watch this piece of **** i would spend that money to have a donkey **** in my mouth for the next 14.5 hours **** this movie and justin bieber",
      "total_reactions": 10,
      "user": "nubman77"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "Only people that should see this movie are kids that dont know any better, horrible, dont know how a movie like this is made, terrible, just terrible.",
      "total_reactions": 10,
      "user": "MrRiggs"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2011
      },
      "score": 0,
      "text": "Valentines Day: A day when couple lovingly embrace in happiness. This years Valentines Day was the day I was assaulted by a torture on the ears and of nausea. Why? I was dragged to see the Justin Beiber movie Let's get this straight: If you don't like Justin Beiber, theres a 95% chance you'll hate this film. If you're affected by Beiber fever, you'll lap this up like a cat with milk. As you can tell by the opening paragraph, I am not a fan. I don't have anything against Justin Beiber, its great he's come so far from performing on Youtube, but I am in no way a fan of his music, his voice just feels so autotuned. This film utterly feels pointless, it tells you the Beiber story, which you could read on Wikipedia for less money, but the film has an additional selling point: 3D! So basically, if you're too lazy to read Justin Beibers story, you can shell out money and watch it with the addition of interviews with annoying fans (\"I think about him 99% of my life\" says one fan), Baby Beibers footage and baby photos, highlights (I say that loosely) from his Madison Square Garden gig and Miley Cyrus IN 3D! Please, heed my warning. I suffered so you couldn't. Avoid",
      "total_reactions": 5,
      "user": "roddersj04"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "Justin Bieber now is just a marketing tool for people to make even more money. Anything that has anything to do with Justin Bieber will be a huge sellout no matter how rubbish it may be. This movie is no exception to this, it is basically an easy way for the company to make money.",
      "total_reactions": 5,
      "user": "Mikester7"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 2,
      "text": "Oh heavens no!! Who would actually like this, honestly!!",
      "total_reactions": 5,
      "user": "miramax123"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2011
      },
      "score": 0,
      "text": "had to see this with my niece who likes this crap.  fortunately she had enough of it and we walked into tangled which was like watching a great movie like the hurt locker as compared to something as horrible as batman and robin, yeah the one with alicia silverstone in it as batgirl. terrible justin bieber.  just plain awful.",
      "total_reactions": 5,
      "user": "Hardkore01"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "What the Hell is this? Why? While he does have fans (Screaming 11-year old girls), what is the point? This is the sort of film that makes you want to gas yourself in a car. Someone kill me now.",
      "total_reactions": 12,
      "user": "GrandmasterFlo"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "this is horrible. no efense to any of the beiber fans or i shall say beaver again no efense. i think jb has no talent and his movie wasnt good at all horrible",
      "total_reactions": 9,
      "user": "taywah09"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "This film was really a peace of utter garbage. To everyone: PLEASE don't go and see this s**t. The facts for the movie: Critics all around the world have been payed off that is why it is still on a 52% average. Metacritic user score at the moment 1.3 but I doubt it will increase more like decrease. Finally IMDB user score 1.1 HAHAHAHA. Where I live in Hungary there a soap opera which is so bad that every time I see it I puke my TV. And even that has a 2.6 average on IMDB :D",
      "total_reactions": 11,
      "user": "victor1103"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "Worst. Movie. Ever. Completely pointless - a total bore. This movie is the worst steaming pile of blank that blanking hollywood has ever blanked out. I am amazed..",
      "total_reactions": 11,
      "user": "ressurrectin"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 1,
      "text": "A movie about a very rich boy who looks like a girl and have no talent at all. Thank me, I just saved your money.",
      "total_reactions": 13,
      "user": "LonardoRaider"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "Justin who? I heard that film would be the shortest film ever made in the history of cinema. I am seriously considering to talk to my lawyer to get my money back.",
      "total_reactions": 13,
      "user": "simonlondon"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "Gosh, the overwhelming dislike! Justin Bieber is certainly the target of hate to the people, but \"Justin Bieber: Never Say Never\" is a movie that actually presents how hard he works to become a star (not to mention the dumbass staff members who say they want to help Justin and give him tons of **** to do).",
      "total_reactions": 16,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "Something is just so generic about all this. At best this should had been a made for T.V. special on the Disney Channel or Nickelodeon. But its real easy to sell hype to these kids now days.  I'm just waiting for the reality show to start... I know it's on the works LOL",
      "total_reactions": 6,
      "user": "jctejada"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2011
      },
      "score": 0,
      "text": "\"CRAP'' UTTER CRAP! LITTLE SISTER LIKES IT, BUT THEN AGAIN SHE IS 7 YEARS OLD. When she reaches 8 then things will change!",
      "total_reactions": 6,
      "user": "Saix7"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "I am surprised about this movie it is actually a really entertaining film. Although it is actually really far from inspirational. The film shows why he is so popular. I give this movie 71%.",
      "total_reactions": 6,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2011
      },
      "score": 0,
      "text": "Hey guys lets make a movie about a kid who had no trouble getting famous and pretend like he went through hardships and told he would never make it.",
      "total_reactions": 4,
      "user": "Sandwich_Lord"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2011
      },
      "score": 0,
      "text": "Was dragged to this, and I have to say the worst hour and half of my life. Anyone who says this movie is good is kidding themselves. It didn't contain a ounce of anything close to good.",
      "total_reactions": 4,
      "user": "zcohen17"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2011
      },
      "score": 0,
      "text": "The concept of this movie; annoying brat Justin Bieber sings songs and talks about his less-than-notable life story. The only appeal this movie has is to young fangirls. In short: It sucks.",
      "total_reactions": 4,
      "user": "GeneralBlob"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2011
      },
      "score": 0,
      "text": "Justin Bieber is the reason Al Qaeda hates America.  This douche bag is making Canada and America look bad.  I don't know why any person would want to see this trans-sexual looking wanna be.  When Michael Jackson died, so did pop. This is the only film I would review without watching.  Seriously, the lines at my theater were shorter than the ones on Charlie Sheen's coffee table.  Come on, a 1.6? This movie is overrated.  There are 2 kinds of people that go into theaters to watch this film: 5-10 year old kids and 40-60 year old pedophiles.  If  \"Never Say Never\" was a smell, it would smell like a rotten egg that had fallen out of a dead chicken's ass and farted into a sulfur pit.  NEVER SEE \"NEVER\".",
      "total_reactions": 2,
      "user": "Bosniak"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 0,
      "text": "Worst film. Ever. Not enjoyable. Not worth watching. A waste of time. Unless someone caught a very serious case of Bieber Fever. What would you expect? The movie is obviously going to be terrible since it's based on a artist who can't play any instruments or sing properly.",
      "total_reactions": 2,
      "user": "DeadshotCRYSIS"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2011
      },
      "score": 0,
      "text": "It's great to see that lots of 'Beliebers' were ecastic by the release of this movie, but seriously, is there a moral in it? Nothing. The 1 point I give is that it may be inspirational for people to post videos on Youtube by revealing what could happen eventually if you can be discovered by a major recording label.",
      "total_reactions": 2,
      "user": "Yoshipie"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2011
      },
      "score": 0,
      "text": "What a **** of a movie. This is just ridiculous. Documentaries are suppose to educate you and give you a new perspective on something. The only thing that this movie made me want to do is **** on justin bieber cds. literally **** on them. Im just gonna fill up some more space now so i can post this. pokpokwpoakmponaopsgjopajkls;6nkl;ansgawtasg",
      "total_reactions": 2,
      "user": "SexyLeper"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "This need be a joke, a terrible joke, this documentary of Justin Bieber is terrible, like his music, why do that? he know about all the people that hate he? This documentary is awful, terrible and poor.",
      "total_reactions": 2,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2012
      },
      "score": 0,
      "text": "This guy doesn't deserve to live. Bad music artist and then this? Sigh... I have no reason to live. Waste of money as I said for Twilight these fangirls CONTINUE TO S-U-C-K on that dick.",
      "total_reactions": 2,
      "user": "FriezaTr0LLz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2012
      },
      "score": 0,
      "text": "what was justin bieber thinking ? is he so great now that he made a documentary on his success ?",
      "total_reactions": 2,
      "user": "moviebuff_420"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2012
      },
      "score": 0,
      "text": "i hate this movie......................................................................................................................................",
      "total_reactions": 2,
      "user": "moviefan11"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2012
      },
      "score": 0,
      "text": "Kill it! Kill it now! Kill it before it lays eggs! Shoot it! Nowwwww do it! Please! Do it!    Y U No kill him?!",
      "total_reactions": 2,
      "user": "harrylolman"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2011
      },
      "score": 0,
      "text": "Forced to watch this movie... Hated it and was so boring it's not even funny.. Why does this little **** get a movie 1 year after his career starts and it took MJ after he died to get one.. Justin Bieber is lame and is going to be tomorrow's yesterday...",
      "total_reactions": 3,
      "user": "L0stR3negade"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2011
      },
      "score": 0,
      "text": "Horrible. If you want to watch a movie about a pre teen girl-er, boy, on his quest to spread christianity and purity all while acting like a hippocritical brat, then this move is for you. Other than that, steer clear.",
      "total_reactions": 3,
      "user": "Burning_Lettuce"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2011
      },
      "score": 0,
      "text": "This movie made me want to gouge my eyes out. I would much rather burn in an eternal fire than put my soul through the agony and torment of this movie. I cannot believe that there are critics and people out there who actually enjoy this torturous bag of horse %^$#. Everyone who enjoys this movie does not deserve to be on planet earth and should be launched into outer space to protect the rest of us from your stupidity. Don't worry, Justin Bieber will be on the launch with you, and you can all stew in your stupidity for years and years.",
      "total_reactions": 3,
      "user": "Awesomeandsexy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2011
      },
      "score": 0,
      "text": "This dumb movie is trying to help a nooby singer get more money. I hate Justin Bieber...Please, I would rather sit through a Green Day movie then this nooby movie. Why would people want to see this? By the way, thank you world, for the 207 negative reviews (make that 208).",
      "total_reactions": 3,
      "user": "oscarthedon"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2011
      },
      "score": 0,
      "text": "DUMB COMMERCIAL RIP-OFF, he already has a nail polish, celebrity girlfriend, millions of 6 year olds who will follow his every command. Why a movie? He's already been enough of a help to Usher and the Canadian economy. This is only gonna say to us all that he's no more than a stupid licencing bastard. This is why we hate boy bands, not for their music, but their way of getting themselves into our faces even when we do not want them.",
      "total_reactions": 3,
      "user": "IcanDoItBetter"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "I wasn't a fan of Justin before watching this movie and would even make jokes about him so when my friend made me watch this is wasnt best pleased. However, the story of his life is so inspiring and interesting. I never knew that he lived in poverty and how hard he really had it to make it to the top. He didnt go looking for fame, fame found him through his raw talent. The film begins telling the story of his early life and builds up to the moment he plays his sold out madison square garden concert. I find him to be a real charming down to earth humble kid (who happens to now be 18). His new album 'Believe' is one of the best albums ive bought in a long time and I will now proudly say at 22 years of age, I am a fan. The kid has never done anything wrong, only followed his dream which is protrayed well throught the movie.",
      "total_reactions": 3,
      "user": "LanaEllithorn"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2012
      },
      "score": 0,
      "text": "Wow, is this even a movie ? A female friend of mine, not gf..she's an adult to be precise..took me to the theatre by force. I took a jacket to sleep there, as it gets pretty cold. I couldn't even do that due to utter useless chants and shouting from young girls. Even my friend was a bit ashamed. Why ? Just why ?? How the heck the critics kept it over 50 ! Aren't they human beings ?!",
      "total_reactions": 3,
      "user": "dunhill1410"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2015
      },
      "score": 10,
      "text": "It all started when I was 7 years old. My parents gave me a CD player and a copy of Justin Bieber - Baby for christmas. I fell in love with it the moment I booted up the CD player. The composition, the arrangement, the talent! It overwhelmed my young mind. I listened it for hours on end, memorizing each sentence, each modulation, each note of the melody, every single drum beat. It was the only thing I did, I stopped going outside and playing with my friends, for Justin Bieber was the only friend I needed. Eventually I became unsatisfied, I needed a new Justin Bieber single to fuel my addiction. My prayers were answered with the release of Never say Never. My parents refused to buy it for me. They believed I was too obsessed with the first one and knew that buying the latest one would only make my obsession worse. This devestated me. I NEEDED that single, I felt like an alcoholic going through withdrawl. I lost all of my spirit, I had trouble sleeping at night, and sometimes I would experience hallucinations where Justin was in the room with me. I begged my parents every day, but they wouldn't budge. I felt I had lost the will to live. Thankfully, I got the single. I aquired it the same way every kid got something that they wanted but their parents wouldn't buy for them, Grandma. I was overjoyed, finally I could experience the masterpiece that is known as Justin Bieber - Never say Never. This time he was accompanied by Jaden Smith! I was delighted. I listened to this single, and memorised it like I had the original. By now I had lost contact with society, I didn't talk to anybody at school, I had no friends, and I never left the house. This didn't bother me though, in fact I preferred it that way. Just as I started to get bored of that single, Boyfriend came out. My obsession had hit an all-time high, I was amazed at the quality of that single. We now had Justin Bieber, Lucardis and Jaden Smith. They were my friends, or \"The Gang\" as I called them. My parents were scared of me now. If they tried to take the music away from me, I would throw a tantrum and break things until they gave it back. No amount of reasoning, counseling, or Native American rituals could change me, because by now Justin Bieber had was not just an obsession, but a lifestyle. I lived and breathed Justin Bieber. But then came the dark days, no Justin Bieber singles were coming out. RBMG labels had stopped supporting Justin Bieber, and had launched Korean PSY. I didn't have his single Gangnam Style, but that didn't matter. No new Justin Bieber singles were coming out. There were rumors, but the only one that ever turned out to be true was All That Matters. I saw it as an abomination, how could RBMG do this to Justin Bieber? After several years I had just about given up. I would often times cry myself to sleep, believing that RBMG had given up on the teenage idol that I had come to adore. I wrote my own stories about Bieber, fanfictions about him having a relationship with Jaden Smith, but they weren't enough. But then it happened. I was at the grocery store with my mother, when I saw it: A magazine with a picture of a new model of DVD player plastered right on the cover. I begged my mom to buy it for me, and she did, relieved that I wanted something that wasn't Justin Bieber related, or so she thought. I read the articles about the upcoming DVD player, and then I saw what I have been wanting to see for years, a new Justin Bieber item was in the works, and it was full-lenght MOVIE too! My life had a purpose again. When the day finally came, I was there. I was the first in line, I had convinced poor old Grandma to buy it for me, and I made sure I got a copy of Justin Bieber - Never say Never. If the singles on the CD's amazed me, Never say Never left me speechless. The imagery was such good quality, the story so deep, the music blew me away. This was the way Justin Bieber was meant to be. It rekindled the fire that had laid dormant in me that is Justin Bieber. I wrote more fanfiction, I made my own fancharacters and I even shipped them. Then I realized something, Justin Bieber wasn't just a teen idol on TV, He was a part of me. I became one with Justin Bieber. If you want to be like me and know what truly matters in life, I fully recommend listening to Justin Bieber. Justin Bieber is more than just a teen idol pop star, Justin Bieber is a way of life.",
      "total_reactions": 3,
      "user": "Cantavanda"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "We enjoyed watching this movie. He is very talented, not only at singing but he plays multiple instruments and is really good at many different sports. This movie is not just for the girls. It's a very inspirational movie the whole family enjoyed!!",
      "total_reactions": 16,
      "user": "hatchfamily"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "I took my 12 year old daughter to see this. I actually enjoyed watching this movie. I am assuming most of the negative comments left are from close minded people who really haven't even watched this movie. INSPIRING",
      "total_reactions": 16,
      "user": "joe1970"
    },
    {
      "neg_reactions": 25,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "this absolutely sucked, my faith in God are gone as I think, \"why dear jesus would you put me through such a painful film?\" How should I go about getting my money back?",
      "total_reactions": 35,
      "user": "peoplescritic"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2011
      },
      "score": 5,
      "text": "first off id like to say i got dragged to this movie kicking and screaming because my little cousin had a hissy fit about the movie we were going to see and i whent into it with a closed mind since i just like almost every other guy out there hates JB. although now that i have actually seen the movie it was not as bad as everyone says it is those bashing it are ppl that have not even seen the movie or sat through it and were doin somthing other than watching the movie. i mean this kid is talented i dont like his style of singing but millions of ppl around the world do so he isnt a terrible singer and he can also play a whole crap load of instruments and he thaught himself to play most of them. honestly im a little jelous of the guy because he can pick up and play almost any instrument, he has made millions off his music, he has almost every girl i know falling in love with him and finally he is dating Selena Gomez. i dont think i could sit through watching this movie again but it is not as bad as everyone says ppl bashing it are either jelous of him or have not bothered seeing the movie because it was defenatly not as bad as i thought it would be.",
      "total_reactions": 15,
      "user": "Inuit_Dude"
    },
    {
      "neg_reactions": 17,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Vu en avant-premiÃ¨re. Le film ne montre pas la vie de Justin Bieber mais son asension fulgurante jusqu'au succÃ¨s. Ce n'est certes pas le film du siÃ¨cle mais il contentera les fans & les personnes qui souhaitent en savoir un peu plus. Les autres personnes peuvent s'abstenir.  Petit bÃ©mol, la 3D qui n'apporte pas grand chose tout comme aux autres films d'ailleurs.",
      "total_reactions": 23,
      "user": "clotilde"
    },
    {
      "neg_reactions": 24,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Enjoyed watching this movie with the whole family. I am suprised at the very low rating. We thought it was very interesting to see how far this kid has come in the last couple years. He sold out Madison Gardens in 22 minutes.",
      "total_reactions": 32,
      "user": "suzan1"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "This is the reason i hate my generation it's people like justin bieber who go around and keep ruining music and movies and othere entertainment. Can we just go back to the days where he had to deadl with more important things like politics, war and other **** other than Justin Bieber",
      "total_reactions": 4,
      "user": "RonaldOVOXO"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "I had to say I'd never heard of this chap before watching this movie, but he quickly moved up to be in my top 10 actors of all time. Amazing piece of acting from this young and upcoming actor. Remember the name 'Justin Biebar'. He is sure to soon become a huge hit and I'm sure it won't be long until this amazingly talented actor becomes a household name, maybe even a cameo on Eastenders could be on the cards. This kid is going places.",
      "total_reactions": 4,
      "user": "ImNotPaid4This"
    },
    {
      "neg_reactions": 28,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "The movie was entertaining and it was interesting learning that Bieber has been playing the drums, guitars, and singing since he was a toddler.  He's a musical prodigy even if his music is just pop.",
      "total_reactions": 36,
      "user": "sfjcg"
    },
    {
      "neg_reactions": 18,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2011
      },
      "score": 6,
      "text": "Guys, guys, GUYS! Stop hating on this kid, he didn't do anything to deserve all this unnecessary hate. I don't like Justin Bieber, but I don't hate him either. There is no reason to hate him.",
      "total_reactions": 23,
      "user": "maksago"
    },
    {
      "neg_reactions": 23,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Im almost positive that sooo many people either love or hate justin that they rated this without even seeing the movie . not being a big justin beiber fan i decided to give the movie a try and it was GREAT ! i recomend to all !",
      "total_reactions": 29,
      "user": "McCakes"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Music brings joy.  This film shows a remarkably gifted toddler with a pronounced gift for music-making, who pursues his passion for musical performance with determination, passion, grit and optimism.  In the process, he becomes a pied piper to mostly young girls, who fawn over his boyish charm and impossibly cute hair.  But at bottom, he is a real musician, and a damned good one.  The skillfully edited film shows the magnitude of joy that music can bring, even when accompanied by pop boy band production values.  I don't much like pop music, and I really don't like young pop stars who are highly produced and thrust into media by the entertainment industry.  But I loved this movie, and came away really liking and admiring Justin Bieber.",
      "total_reactions": 10,
      "user": "loudlong"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "Sorry to disappoint all of you but unless you are a tween girl, you're not going to get this. On the other hand, my 9 year old daughter and all of her friends loved it. As a parent, I was happy to have her watch this movie -- it's clean, inspirational & has a good message for kids.  Those of you (most) who hated it probably shouldn't have bothered watching it in the first place. In fact, I wonder if any of the very low scores even watched it and aren't just trying to get the user score down. That would be a shame.",
      "total_reactions": 5,
      "user": "STH"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "Every teenage girl in the theater sat anxiously as â",
      "total_reactions": 5,
      "user": "josiebass"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "So, the movie was good, but haters have taken over, and, fair play to them! The movie was good, great actually, I like Justin, I think he is a good influence, but give it 2 years tops and we will see JB falling out of nightclubbs and divorcing his 6th wife while cheating on his 7th girlfriend with his 4th best-friend! The movie is entertaining, I will give it that!",
      "total_reactions": 5,
      "user": "MsMia"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "I think this is an Amazing movie. I dont know what all those haters problems are... I think most documentaries are EXTREMELY boring but not this one. My mom, dad, and 11 year old brother HATED Justin Bieber, but after I forced them to watch it, they were converted. I dont care what ANYONE says, this is a OUTSTANDING movie. The fact he was raised by a single mother in a small town only hanging on by a dream, then making it to where he is now is VERY unlikely. It wasnt just luck. It was Hope, Determination, and Talent.",
      "total_reactions": 5,
      "user": "Sillybear995"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "This movie is entertaining, and it does show you what is possible if you Never give up, but you cannot get through 7 seconds of the movie without one of Justin's relatives saying how great he is! He will make loads of the movie, that is why he made it, and if he does...fair play, the movie has it's good parts, but, go see something else instead......",
      "total_reactions": 11,
      "user": "MovieMadness"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "He's Justin Bieber. Alright.. he's famous these days, he's like every teens idol. They would watch this movie even though it's not a really good movie. It's a story of his life. ok i get it. this film must have made a lot of money from the teens..",
      "total_reactions": 6,
      "user": "vinza98"
    },
    {
      "neg_reactions": 33,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "I went with my 12 yr old daughter, her friend & mom to see \"Never Say Never\" premier. We did enjoy the movie. It not only showed Justin's rise to stardom but his mother's sacrfices she made to make sure, as a single young mother, he was brought up with values and respect. His grandparents were normal, very much like my daughters, in the respect they kept him grounded. He had to clean his room before he could go out with his friends-didn't matter that he was JUSTIN BEIBER. His grandfather brought me to tears, talking of letting them go, Justin & his mom, to Atlanta to do recordings & start his singing career. I did wonder what Justin's father's intentions really were, never around in any pictures while he was growing up past a few months old...all the credit should go to his mom, grandparents & his crew who loves & adores him. I do wish it would have stayed with him in it's entirety of his songs but his journey thus far was portrayed very nicely. Loved the hair wisp & the part about texting.",
      "total_reactions": 39,
      "user": "Oakleys4UT"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "Got exactly what I expected, a good story about a kid who came from nothing and now is a star.  Kid has real talent and isn't just another pop singer. Interesting how social media can now make just about anyone a star.",
      "total_reactions": 8,
      "user": "dlynch18"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "I have not seen this film and i dont intend to, not because i dont like Justin Bieber, im 23 and his music is not really my thing lol.",
      "total_reactions": 10,
      "user": "RezzaDee"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2011
      },
      "score": 6,
      "text": "It's not really \"theatrical material\" -- it doesn't give audiences anything an E channel doc couldn't except 3-D. But overall, it's mildly appealing and tells the story of a star in the making that \"never says never\".",
      "total_reactions": 3,
      "user": "ohaiKendyl"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2011
      },
      "score": 6,
      "text": "While this movie was interesting and at times funny, I think that this should have been a straight to DVD thing and JB should have avoided the whole 3D Movie thing, because this one, while it will make him a few bucks, will not go down in the history books!",
      "total_reactions": 4,
      "user": "ThatsLife"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "Hilarious to read the user reviews, as it is pretty obvious that someone spent a lot of time creating user accounts over and over. Okay, I am no JB fan, but rented the movie out of curiosity and must say that I was pretty impressed...Just very interesting to follow the short journey to mega stardom created through and by social networking. And dude does have a lot of talent. And is kind of special.",
      "total_reactions": 2,
      "user": "GrandMiraMouth"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 0,
      "text": "The guy has now arrived in the music world, don't has a story to tell and makes a movie just to take money from their virgins and alienated fans. This is the price we pay for a capitalist world.",
      "total_reactions": 1,
      "user": "AnalyDewa"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "This movie is amazin,so inspirational,incredibile and teachfull",
      "total_reactions": 1,
      "user": "Jazzy12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "I'm not a hater. I think it's okay if you like Justin's music and/or personality. Personally i dislike his personality and i'm not a fan of his music. But it's early in his career, we don't want a 'documentary' about his life when hes only around 20 years old. I would understand it if he was 61 and the documentary was a flashback on his life. But this was only made so that he could get money off it.",
      "total_reactions": 1,
      "user": "Scumbag_"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "I love this movie. It has excellent pacing and the main character delivers heart pounding moments delivered with lines reminiscent to the original Star Wars. Any male will enjoy this.",
      "total_reactions": 1,
      "user": "Rem"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "Esta pelicula salio un desastre de un personaje que ademas no me cae muy bien esta pelicula no tiene perdo pesima enserio, no tengo mas que decir otra mas del monton de peliculas absurdas.",
      "total_reactions": 1,
      "user": "Jmsbpp"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "mi primo es el usuario JMSBPP le quiere hacer un polvazo a justin pero no es un simple polvazo quintuple  sino que tambien cree que justin es de chocolate y se lo quiere comer a mordiscos, dice que justin es un tigre en la cama.",
      "total_reactions": 1,
      "user": "JUANPANB"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "text": "Beiber is GAY!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!.John Chu is gay if he chose beiber to be his mentor and do a documentary about him . What is wrong with directors and there movie  topics these days . Asians!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "total_reactions": 1,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2016
      },
      "score": 2,
      "text": "Never Say Never may provide entertaining viewing for fans of Justin Bieber himself, but as a musical documentary it is dull, uninteresting and feels overly manufactured.",
      "total_reactions": 0,
      "user": "BrandonB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "text": "Review deleted.    .",
      "total_reactions": 0,
      "user": "AtTheMovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2016
      },
      "score": 2,
      "text": "Never Say Never may provide entertaining viewing for fans of Justin Bieber himself, but as a musical documentary it is dull, uninteresting and feels overly manufactured.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2013
      },
      "score": 1,
      "text": "Justin Bieber is a deformed product of \"our\" culture, which is getting dumber and dumber with every day. Little dumb girls worship this guy, who never achived anything in his life that will not be forgotten after a few years. This is the culture of masses. God help us all, because I see dark ages coming...",
      "total_reactions": 0,
      "user": "oliver1h"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "Pretty bad, for sure people are NOT interested, to know the story of a 14 or 16 years old famous teen, that will disappear with time, seconds are REALLY REALLY counting now!",
      "total_reactions": 0,
      "user": "HaithamBayazeed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "I have not seen the movie, but that's Justin Bieber, the music sucks, the movie too! I will never see! When your kids are bad, this is my opinion on them! Oh no! It would be really great torture!",
      "total_reactions": 0,
      "user": "huntibor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "text": "This movie would be a great torturous method of an interrogation to be used on suspected terrorists that's plotting terrorist activities in our country. I'm 100% positive that this would get them to start talking after forcing them to watch a few seconds of this movie strapped down on a chair.",
      "total_reactions": 0,
      "user": "LordRaijin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "If your thinking about watching this movie you may as well commit grievous bodily harm instead of watching this movie. (Honestly this movie is not worth being a movie, it;s not even worth being a documentary on TV, it may just make the part of 3 minute YouTube video, and a terrible one at that!)",
      "total_reactions": 0,
      "user": "Eternal409"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 0,
      "text": "Oh my god, this isn't a movie it's a disaster. I watched it out of curiosity hoping that it won't be as bad as everyone says but... No, it is awful, the whole thing that it's about is stupid and the only reason it has THAT low rating  which should be lower imo  is because his only \"true\" fans are too young and too ignorant.",
      "total_reactions": 0,
      "user": "pitas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Oh gee, what a surprise, people that don't like Justin Bieber for whatever reason, also didnt like the movie, and then tried to give it the worst rating possible. Who saw that coming? If you're not a fan of Bieber, then don't watch the movie. This is for fans of Bieber, you're clearly not the intended demographic. I mean, this isn't a difficult concept. But of course, people that love Bieber will watch and love this, regardless of how many haters it has.",
      "total_reactions": 0,
      "user": "Counterpart"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2013
      },
      "score": 1,
      "text": "This movie sets a new record for Movies That Hit Rock Bottom. It is a disgrace to any man, woman, or child who is associated in any way with this film. To all you JB fans out there, I'm sorry but you are brainwashed by the hair. It is shiny and soft, but way over-gelled. Take it from me, burn all copies of this movie. It should never be seen again.",
      "total_reactions": 0,
      "user": "AlekhyaDas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "justin, justin,justin man did the people hated you. What was it. Was it your songs? No your songs are decent (even if they have the most simple lyrics i have ever heard) was it the fact that you got everything by showing no talent what so ever? No i mean yes but there is another reason: You are the most egotistical pice of **** that humanity has ever saw. and for that sole reason this movie sucks balls",
      "total_reactions": 0,
      "user": "prossnip42"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "I can't even believe this exist.  It's just some kinda commentary of him, though I've never liked Justin Bieber, his songs are horrible! Like this movie. There is lack of a story, there is NO STORY whatsoever. Why is it a movie? It shouldn't be a movie. That's just... piece of garbage. I am a brony by the way.",
      "total_reactions": 0,
      "user": "Gore66"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "This movie is only 2x better than the poopy game E.T. Atari 2600 and Ninjabread man for the Wii. Do not watch this crap unless you are one of his crappy fans. Absolute s***. I am sooooooo glad I've never seen this before. It is a pile of garbage with dog poo! Maybe JB deserves to go to Bootcamp because this kid can't even do 1 push up. I can do at least 3 or 4 perfect chin touch push ups. They also have Miley Cyrus who frigging sucks too! Worst pile of dog poop.",
      "total_reactions": 0,
      "user": "Beastprogamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "Note: I am not judging justin bieber himself. I am judgeing the movie.",
      "total_reactions": 0,
      "user": "freemik27"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2015
      },
      "score": 1,
      "text": "GUYS, I CAN'T. Why is this considerated as a movie? Total trash. Why people waste their money watching this... just because you're popular doesn't mean you can make a film of your life. Pathetic.",
      "total_reactions": 0,
      "user": "diegonelli"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2016
      },
      "score": 5,
      "text": "This is not a very good movie, but not a terrible one either. It is disappointing that Justin Bieber hopped onto the tour bus. And the singing, well, pretty annoying.",
      "total_reactions": 0,
      "user": "SamHalls2016"
    }
  ]
}