{
  "mc_avg_user_score": 7.9,
  "mc_metascore": 24,
  "mc_mixed_rating_frequency": 2,
  "mc_movie_name": "Just Before I Go",
  "mc_negative_rating_frequency": 2,
  "mc_positive_rating_frequency": 23,
  "mc_pro_critic_reviews": [
    {
      "critic": "Gary Goldstein",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 70,
      "summary": "Anchored by a nicely understated performance by Seann William Scott, Just Before I Go effectively juggles a wealth of genuine, at times profound, emotion with quite a bit of nutty-raunchy humor."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2015
      },
      "score": 40,
      "summary": "The film falters when it ham-fistedly attempts to detour into sensitive drama."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2015
      },
      "score": 38,
      "summary": "Just Before I Go is a “Garden State” retread in which filthy jokes gradually cede ground to sentimental slush."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 20,
      "summary": "Just Before I Go, the directorial debut of Courteney Cox, lurches along a wobbly line between salacious comic nastiness and nauseating sentimentality. The two strains are so poorly integrated that the screenplay (by David Flebotte) feels like pieces from two different projects mashed together with little oversight."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 20,
      "summary": "The former “Friends” star clearly wanted something special, but sadly the result is ... this."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "summary": "Dull and tamped down throughout, Scott convinces well enough as a guy who wants be put out of his misery, and there isn’t an actor here who doesn’t look ready to join him."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "What a beautiful movie. This is indeed silly comedy but there are emotions and pain deeply embedded in it.",
      "total_reactions": 1,
      "user": "SpiRo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "Surprisingly good, funny with a nice mix of sentimentality. Surprising because the \"critics\" trashed it. The user scores are considerably higher (see Rotten Tomatoes) because it's fun and entertaining. Isn't that what we want in a movie?",
      "total_reactions": 1,
      "user": "MurrayT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2015
      },
      "score": 5,
      "text": "Courtney Cox steps into the director chair for Just Before I Go. This film boasts a pretty good cast headlined by the typecast breaking Sean William Scott. He seemed to be branching out a little bit in goon in order to break away from the Stifler persona he has become known for, but it is this movie where he shows that he is a legitimate actor with something to offer. The rest of the cast is pretty good as well. Oliva Thirlby was good in this movie as well and was sadly underused despite being fairly likeable. I thought the movie was surprisingly funny as well. The downfalls of this film are its overreliance on quirkiness at the first and then breaking off into an unnecessary drama in the third act which loses the tone. Its sadly pretty clichéd for a film that seems to be embracing being offbeat.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "From knowing of Seann William Scott almost exclusively from his role in the American Pie films, I was expecting this to be filled with the same type of humour and craziness. To my surprise, this film was noting like that.",
      "total_reactions": 0,
      "user": "Jumpy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "This film take my feelings so deeply, not only about gays, about the life and such a big game of, William Scott! Maybe in soon time i will re-watch It. such great, funny and dramatically movie.",
      "total_reactions": 0,
      "user": "Zakkari"
    }
  ]
}