{
  "mc_avg_user_score": 8.6,
  "mc_metascore": 66,
  "mc_mixed_rating_frequency": 75,
  "mc_movie_name": "Kick-Ass",
  "mc_negative_rating_frequency": 46,
  "mc_positive_rating_frequency": 962,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "Kick- Ass offers an unforgettable performance from Chloe Moretz, gore, action and humor and the whole movie just bathes in profanity I give this movie 86%.",
      "total_reactions": 5,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "Kick-Ass is very funny and interesting movie ! I like it very much and I give to it 10 from 10 ! I am loking forward for second part!",
      "total_reactions": 4,
      "user": "paulgreen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "Movie was awesome. A few great moments; Cage burning up for example. Hit Girl definitely stole the show though, she was too good. Her acting was solid.",
      "total_reactions": 3,
      "user": "pulptik"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "Kick-Ass is without question the best of the recent trend of postmodern superhero films. It's not mercilessly bleak like Watchmen, not depraved like Super and it's certainly not for kids like Sky High. A lot of the film's quality hinges on a truly great cast. Aaron Johnson makes a great loveable loser Dave Lizewski who decides to become the titular, wet-suited hero, Mark Strong adds another great despicable villain, the powerful gangster Frank D'Amico to his repertoire and Christopher Mintz-Plasse is great as always playing Frank's lonely son and (disturbingly willing) heir to the D'Amico criminal empire, who masquerades as a new hero Red Mist to contact Kick-Ass under the pretence of friendship. The real highlights of the film are the dream pairing of a moustachioed Nicholas Cage doing his best Adam West impression and a hilariously filthy-mouthed Chloe Grace Moretz playing the vengeful father/daughter hero team of Big Daddy and Hit Girl. Let's be honest, Mr Cage has had some stinkers in his career, but when he gets it right, he really gets it right - he has the opportunity to show his undeniable talent for both comedy and pathos here, and the character arc of Damon and Mindy Macready is certainly the most rewarding and entertaining of the whole film. There are a few instances where the story runs out of steam, and Matthew Vaughn's Brit-dominated cast of villains do occasionally slip out of their American tough-guy accents, but a wealth of affectionate digs at comic book lore, Jane Goldman's delightfully sweary script, some gloriously violent action and Matthew Vaughn's accomplished direction more than make up for it. Kick-Ass is an immensely enjoyable viewing experience, that will please comic fans, comedy fans and fans of terrifying murderous tweens alike. I just hope the inevitable sequel doesn't lose any of its charm, inventiveness and especially its sense of fun.",
      "total_reactions": 2,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "Holy **** **** does this movie rule. The first time, it felt a little of the edge and all over the place. But as I rewatched it, I absolutely acknowledged its awesomeness. I knew what I was getting myself into, but holy **** It's better than any action movie from last year. Or any comedy. It's breath-taking. captivating, stunning, hilarious, beautifully perverse and all around fantastic. What Matthew Vaughn did to the superhero genre was take it, **** it and out plopped the greatest action movie of 2010. The acting is supreme - I'll never find a hitgirl beter than Chloe Grace Moretz -, the editing, jaw droppingly terrific, the directing and writing, pants-****tingly great. It's ****ing perfect. I can't really find any faults or problems with it. IT IS ****ING AMAZING!!!!!!!!!!!!!!!!!!!!!! I love you Matthew Vaughn. In a non gay/platonic way.",
      "total_reactions": 1,
      "user": "Justinavery7074"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2011
      },
      "score": 4,
      "text": "Kick-Ass, despite all its grandiose, action, pop songs, violence, swearing, humor, and commentary, ends up to a film that simply wants to be cool and doesn't know when to stop. Eventually, all this effort and need to be important kills any sense of wonder, and the final product comes up as rather tame. The violence never has any punch because it is so forced (without the creative wit of some like Quentin Tarantino, it comes across as shock), and the comedy is too wink-and-a-nod to entertain.",
      "total_reactions": 1,
      "user": "J-Shap"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "I'm just going to write a short review as I'm watching it at the moment for the third time today. This film is realistic as in it could happen. It is so funny. Everytime I watch it I laugh louder. The soundtrack is the best ever in the film and I listen to whilst playing MW3 multiplayer. Nicholas Cage and Chloe Moretz should have got an oscar for this spectacular performance.",
      "total_reactions": 1,
      "user": "TarintinoCodFan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "In my opinion this is the greatest movie ever made. The actors are so easy to fall in love with, and i think that is one of the most important aspects of this movie. The music in this is phenomenal and to me remains the greatest score ever. I would just like to thank Matthew Vaughn for the brilliant directing, Danny Elfmen, Henry Jackman, John Murphy, Marius De Vries and IIan Eshkeri for the mindblowingly amazing music they created. And last but certainly not least i would like to thank Aaron Johnson, Christopher Mintz-Plasse, Mark Strong, Nicolas Cage and Chloe Moretz, you did what knowone predicted and that's act like nothing before. Thankyou for making this dream a reality",
      "total_reactions": 1,
      "user": "KICK-ASSfanboy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "What can I say about this movies that was not already said ?",
      "total_reactions": 1,
      "user": "fabien7474"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "Kick Ass is awesome. Period. No questions asked. This film brings life to people that love superheroes in a cool way, I mean look at the action scenes! They are damn good! Kick Ass is a really well done movie and I really can't wait for the next part. Kick ass has those Hollywood elements that director Matthew Vaughn has put together, with cool weapons and jetpacks! The story or plot about Dave Liwinzki has been put together real good and the characters like Mindy and Big Daddy are the major elements for the movie to thrive. The film has emotions, action and lots of it, gore and man a lot of gore, and superheroes saving the city from ruthless drug crime lords. If you haven't seen or finished the movie, watch the climax.",
      "total_reactions": 1,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "Kick Ass is not a superhero, but just a normal college kid hoping to become a bad ass hero! He thinks he's a pretty big deal after his video went viral, but then he meets Hit Girl and Big Daddy, the real superheroes. The movie is very well filmed, with even yet colorful detail and an interesting story.",
      "total_reactions": 1,
      "user": "Duskspark"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "Succeeds at everything it attempts to do and gives their target audience exactly what they're looking for. Chloe Grace Moretz steals the show but the performances are all around good. A very fun film that will probably go down as a cult classic.",
      "total_reactions": 1,
      "user": "CheapSeats"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "Like all good action films kick-ass contains strong gory violence and outrageous comedy. Kick ass explodes to life with amazing special effects and hilarious scenes that will keep you entertained for the 117  mins of run time. Kick-ass kicks spiderman and superman in the ass. literally. You will have never scene a superhero film like this. This movie is definitely worth watching, and if you like superheroes, action, strong violence and comedy moments that will surely make you laugh, It is about time you see a movie that kicks ass. Kick-ass is the film4u.",
      "total_reactions": 1,
      "user": "benjithebest"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "Kick-Ass is my favorite movie of all time, tied with Donnie Darko. Kick-Ass is truly amazing, and I love every second of it. The idea is unique, and is executed beautifully. The movie is hilarious, serious, sad, action-packed, brilliant and mesmerizing. Kick-Ass truly kicked MY ass, and there's really nothing more to say. If you have not seen this movie, then you really f*cking need to. 10/10",
      "total_reactions": 1,
      "user": "Lelandskell"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "Now, what \"Kick Ass\" presents to us is the new era of superheroes; it screws the old, classical heroes like \"Batman\", \"Spiderman\", and \"Superman\", and delivers addictive violence and superheroes that actually have a normal story with a normal goal. The movie is stunning and powerful. However, it is Chloe Moretz, the girl who was Hit Girl, that bloodied up the screen for the craving audience. This film certainly DOES kick ass!",
      "total_reactions": 11,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "\"Kick Ass , As far as Action films go , is amazing , stunning , and will keep you entertained for its 2hr run time , which sometimes maybe hard to do , Aaron Johnson leads a all star cast , with lots of action , fun and Excitement this is the one movie that lives up to its TITLE!.\" A",
      "total_reactions": 15,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "I'm not ashamed to admit this is one of my favorite movies of all time. The entire premise is ridiculous, but the movie takes itself so seriously that it feels like an actual attempt to make a super hero movie.",
      "total_reactions": 5,
      "user": "theycallmespike"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "Kick Ass is actually a great movie.  Many will love it, since it might be \"the goriest superhero movie\" I can understand that the whole base of it, is stupid, but refreshingly entertaining",
      "total_reactions": 6,
      "user": "Ransack"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "I reward it a \"The Best Action Movie In 2010\"",
      "total_reactions": 6,
      "user": "WWABTT123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "An imaginative reboot of the superhero story with some cool visuals. I hate superhero stories at this point but this ranks in the top four of all time on my list, behind The Dark Knight, Iron Man and Spiderman 2, although this may be better than S2. Chloe Moretz is a very cool young actress.",
      "total_reactions": 3,
      "user": "JUIKER"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "I can't quite agree with most of the tut-tutting critics. I admit that several things in the film made me raise an eyebrow, and it did make me think, because I've never seen stuff like an 11-year old girl swearing like a truck driver and killing people in brutally violent ways in a film. Ultimately I think the ones crying \"for shame!\" are over-reacting  just a tad. The film does puts its toes to the line, but for me it doesn't quite cross it. And let's face it, it's a funny, clever idea, extremely well executed. It doesn't make the mistake of many such films by diving into the action immediately before we've gotten to know the characters. People are oblivious to the fact that it makes it more exciting if we care about what happens to them, if it's not just frenetic mindless action. Vaughn takes his time and his pacing is impeccable, just the right amount of build-up to the climactic scenes, and he deftly makes these scenes emotional as well as exciting. The cast is pretty much great, with the possible exception of Mark Strong, who is not quite loathesome enough to be the arch-villain. Every critic and every \"user\", however, has agreed on one thing: this film contains a star in the making. Chloe Grace Moretz is astoundingly assured and inspired at 11 years old. Never seen a child actor this compelling EVER, not Anna Paquin, not Natalie Portman, not Jodie Foster. She steals every scene she's in and steals the movie. See it just for her.  Also, great music.",
      "total_reactions": 3,
      "user": "Acewrite09"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Holy **** this movie is **** amazing. It starts out kinda ****ty and mediocre and then it just suddenly cranks the awesomeness to 11. An amazing story that comes up with a truly unique answer to the question, why aren't their any superheroes?",
      "total_reactions": 8,
      "user": "phildog"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "wow this movie was just awsome . it was a unexpected suprise . i really didnt think it was gona be that good .i original wanted to see it because it had the guy who played Mclovin in super bad in it . i thought it would be funny with him as a super hero .after seeing it though i quikly relised that the star of the show was not him or even kick ass him self . it was the little girl mindy AKA Hit Girl . i mean i hate kids and despise them but this was one kid i liked her acting. her lines where even better and her action was fantasticaly enjoyable to wach . the plotof this film was really enjoyable as well . it pretty much asks the question what if super heroes where real in are world what would they be like . the film feels original and is well acted by all except nicholas cage who is spotty at best . seems like cage was only in this for the money and pretty much just phoned his performance in . all in all the this movie will probubly be the best movie of the year . i really dont think i'll see any thing better then this .",
      "total_reactions": 2,
      "user": "ArkonBlade"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "Both the favorable and unfavorable reviews miss the moral question at the center of Vaughn's film:  why are we bystanders?  Kick-Ass' world is riotous, self-deprecating, and awesome; but it is the exact opposite of irresponsible.  Rather, it unmasks an adult world in which police officers operate on both sides of crime, citizens are voyeurs into one another's suffering, and we all wonder who is going to change it.  By now, it is clear that neither adults nor teenagers are willing to risk their routines for their neighbors.  At least teenagers still fantasize about doing something.  So the obvious answer is a little girl who, with some sidekick mockery from Nic Cage, makes Batman look like a man dressed up like a bat.  To echo other reviewers, Hitgirl is the new standard of awesome.  But, until Kick-Ass' moment of transformation, she is also the last human willing to offer an embodied answer to injustice.  That Vaughn hides this seriousness in such absolutely brilliant awesomeness might confuse some, but it should not be misinterpreted as a statement of \"coolness\" or teenage hormonal self-gratification.  It's saying much more than that.  Why hold the fact that it's also cool against it?",
      "total_reactions": 2,
      "user": "sebastian"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Kick-Ass is possibly one of the best films so far this year. It's brilliant - funny, violent and just so damn cool. Matthew Vaughn took a risk making this film and I can guarantee it's paid off. The film is packed full of comic book references and homages to film like Batman, Kill Bill and Scarface. The title character is played Aaron Johnson, who justifies his place on the screen. I thought his American accent (he's British) was very natural and he brings this 'loser' character to life. But don't think he's the star, it's actually his smaller companion played by Chloe Grace Moretz - the merciless and skilled fighter Hit Girl. She was effective, outstanding and gives one of the best performances by a child actor that I've seen in a while. She'll be remembered for quite some time. Other standouts performances include Nicolas Cage's performance as Hit Girl's father Big Daddy who was reminiscent of Adam West's Batman and Mark Strong's drug lord mobster Frank D'Amico actually was pretty funny. Matthew Vaughn's third film is nothing short of a miracle because some superhero movies are pretty awful now, I definitely think this will be a cult film from now on.",
      "total_reactions": 2,
      "user": "shlugalug"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "I give this a 10, i have watched this movie so many times now and i believe it is one of my favorites, as a huge fan of Chloe Grace Moretz, ill defend her on her behalf, People are saying this is terrible kid is cussing and killing people and got beat up from an older man, what people need to realize is that this is only a movie and its not actually happening, There were many great moment like when Cage was burning and Hit-Girl had to save him, and much more please go watch it and buy it on Blu-Ray",
      "total_reactions": 2,
      "user": "GrahamWDiffee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "The most eye opening and attention demanding movie I've ever seen, it expertly combines Action, Comedy and even a bit of romance, a fantastic, fun movie",
      "total_reactions": 2,
      "user": "Exogenesis"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "This movie was great on so many levels. Not only was the story intriguing and exciting. The acting was great. The character development was fantastic. The  use of comic pages to tell the story gave you a real feeling of fantasy in reality. Some other great things about the movie were the fight chreoography which was much better than one would expect for a movie like this. The amazing musical score and soundtrack. As well as a bunch of very comedic scenes. This movie hits you with all the tools and If could remake it I wouldn't change a thing. Would highly recommend this movie to anyone.",
      "total_reactions": 2,
      "user": "The_DirtyRabbit"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "Ok, let me start out by saying this was obviously a cult movie, but, according to the 270+ positive ratings for Metacritic, and the four- star ratings by the magazines that saw this movie. That being said, this is pretty fake at most action parts, which downed my happiness on how good the movie was to that first point. Now, that being said, this is a very good cult movie, even better than From Paris With Love, and that movie was **** sweet. This is a movie that is for sure, one of the movies in my top 20.",
      "total_reactions": 3,
      "user": "CoDFather"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "first thing man up!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "total_reactions": 3,
      "user": "myopinion"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2011
      },
      "score": 5,
      "text": "This is a very trivial movie. An unhappy story with superheroes, where the main character is a fake hero, but a 11 years girl kills dozens of men. Nicolas Cage performance is bad, as in the most of his recent movies (too bad... he use to be a good actor). I don't have anything with the scenario, but the writers are very, very, very not inspired.",
      "total_reactions": 4,
      "user": "ovi_bz"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "Kick-Ass is one of those films where either you like it or not. This movie really divides people. The movie got a lot of buzz around its release because an 11 year old girl cusses rather graphically and performs gratuitous violence in the movie.  Kick-Ass is a critic's wet dream it's the kind of movie you can bash or praise. Sadly I fall in the category of only liking it halfway so I will give it a mixed review and a mixed rating. The movie has at least three plots, the first consisting of Dave Lizewski (Aaron Johnson) a normal high school kid who likes to read comic books with his friends. One day he thinks to himself why a real person doesn't stands up and becomes a real superhero. He goes and buys a suit from eBay and decides to fight crime. The next one is involving Frank D'Amico (Mark Strong) a ruthless, psychotic gangster who son who is played by Christopher Mintz-Plasse, who blames Kick-Ass for stealing his drugs and killing his men. The last one which caused the buzz, is of Hit Girl played by Chloe Grace Moretz and her father Big Daddy played by Nicolas Cage. That's when the movie hits a down low. Hit Girl is an 11 year old girl who's been brain washed by her father to kill as much bad guys as possible. She cusses like an adult and has very cool ways to kill people.  This movie made a mistake that it should have made clear. Hit Girl's innocence as a little kid. It ignores it completely and just makes her an engine of violence. There is a scene where her birthday comes and she asks for a puppy and Big Daddy looks at her weird. She says she's joking and wants a butterfly knife. Instead of a birthday cake or decorations it's talk about weapons and killing people. No matter how ruthless or mean a young child is that kid still has innocence. The kid can cry and be happy ask for nice things. Kick-Ass ignores that and in the process offends people. There's an emotional scene in the movie that I could not enjoy because of all the ruthless violence. The movie exploits her innocence just to make more scenes of violence and action. I might be exaggerating but I wonder why the hell MPAA didn't give it NC-17 rating. (SPOLIER) Here's something to think about this girl gets brutally beaten by a grown man. I'm a father and don't think I'm crazy I imagined my daughter in that situation.  You're probably saying but just don't think it's your daughter. How I'm I suppose to do that when in this world there's enough sickos who actually like doing that to 11 year old girls. Here's food for your mind how de we know as movie goers that a pedophile likes what happens to Hit Girl in the movie. She's wearing a purple wing with a purple clothes to top all of she has a purple skirt. How do we know if a sick f@#k is sitting in the audience saying yeah that's what she gets? The worst part of it all it's a damn shame this movie fell to that because there all a lot of things that I was entertained with. I laughed at the jokes and liked Dave Lizewskie/Kick-Ass side of his story about wanting to help people. The movie was going to get three stars from me but I can't shake the feeling of seeing (SPOLIER) Red Mist shoot Hit Girl several times in the chest with no remorse, an 11 YEAR OLD GIRL. That's just my opinion though.  The movie had potential but fails. My favorite critic Roger Ebert called it morally reprehensible. I find it morally reprehensible half way. Maybe I'll rent the DVD and see it again, it might change my opinion.  NOTE: Quentin Tarantino use anime to express pedophilia in telling the story of O-Ren Ishii in Kill Bill Volume1 why couldn't director Matthew Vaughn did that for Hit Girl's action scenes.",
      "total_reactions": 6,
      "user": "thelordoffilm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Kick-Ass is a beautifully well done superhero film of the year with lots of laughs and gushes with lots of blood. I love the cast,especially the new actor who played Kick-Ass character was very good and he could be the new star for the 2010's. I love Nicholas Cage playing bad ass superhero who crosses between Batman and Nightowl. The young girl who plays the Hit-Girl and I give this girl for credit for doing some action scenes and beats the s*** all over those bad guys. It has lots of dark humor and seriously scenes between being a superhero it's a real thing or not? But I enjoy this movie and really love it for my best 2010 films on my list.",
      "total_reactions": 1,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "'Kick-Ass' is a seriously bloody, action-packed, fun-loving, imaginative, and above all, ridiculously hilarious piece of work. The levels of outrageousness and the action sequences are the film's most hooking elements.",
      "total_reactions": 1,
      "user": "GavGav96"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "Unless you think people getting graphically killed is hilarious, and enjoy watching every woman in the movie extremely degraded then I would not recommend Kick-Ass.  If I was with anybody other than my best friend I would have got up and walked out, especially if I was with my brother, because how humiliating would it be to sit there and watch some guy jerk off to his teacher acting like she was out of a porn video.  Watching an eleven year old sociopath murder people and the crowd laughing is not my idea of a good time.  Not to mention it was homophobic. The teacher, the gang woman, the girlfriend and her friend, and the bad guys wife. I think thatâ",
      "total_reactions": 6,
      "user": "femasculine"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "Extremely clever take on the superhero genre. The movie is very fast-paced, and will you keep you entertained during the entire run time. Features some of the most incredible action scenes you'll see in any movie this year. Despite the young age of the actors in the film, this is definitely not a kids movie. The film depicts a much more realistic take on vigilante justice while remaining fun and exciting throughout.",
      "total_reactions": 1,
      "user": "AJackson729"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Love the film, imaginative, action-packed, and funny. Love Chloe Moretz acting as HIt-Girl, she was phenomenal. It's entertaining. Good soundtrack too.",
      "total_reactions": 1,
      "user": "Comasi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2011
      },
      "score": 6,
      "text": "A good action movie, very meh in every other category. The gore is really all over the place, being ridiculous in some scenes (microwave scene, car crusher scene), and average in others. And for a movie that tries to act realistic most of the time, it pulls a lot of unbelievable twists. I mean, it's mainly just because it's being hypocritical. Overall, I enjoyed it, but it's definitely not for everyone.",
      "total_reactions": 1,
      "user": "KarthXLR"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "Hugely entertaining, thanks mainly to the ass-kicking character 'Hit Girl', played by Chloe Moretz. This is Quentin Tarantino meets the superhero genre and is funny, gory and action-packed! Controversial? Definitely. Best film of the year so far? Maybe.",
      "total_reactions": 1,
      "user": "Judddy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "Kick Ass, what a great film it consists of 4 Superish Heroes, Kick Ass, Red Mist, Hit Girl and Big Daddy.",
      "total_reactions": 1,
      "user": "MartyJ"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "A fun, overly stylized film, but absolutely did not live up to the fanboy hype. Aaron Johnson was cute and charming, and I enjoyed most of the story, but it ultimately did not leave that much of an impression on me.",
      "total_reactions": 1,
      "user": "Tony"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "Watchmen meets Super Bad and Spy Kids. The film confuses, at first it seems like a movie for children, but suddenly scenes come up they shouldn't be watching, however that's what makes it unique.",
      "total_reactions": 1,
      "user": "Asaldivi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "Dave is a loser with a nerdy comicy brain. No one knew him at his school and his friends are just a bunch of losers. One day he saw a guy being beat up by a bunch of thugs and decided to jump in a help with his superhero costume. The video was captured and became an internet phenomenon. Everyone tried to figure out who was this guy and named his Kick-Ass. Kick-Ass became a pop icon just in days. After hearing about Kick-Ass, hitmen Big Daddy & Hit Girl decided to go after him to join him with their group. Going through lots of violence and profanity, Kick-Ass finally got that these two don't kid around. They kill mercilessly, they enjoy taking lives, and they cuss like a bunch of New Yorkers. Kick-Ass is a refreshingly new film that adds to the comic-action-films genre. Kudos to strong performances from crazyass Nicolas Cage and the fouled-mouth Chloe Moretz.",
      "total_reactions": 1,
      "user": "OscarPicks2010"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2011
      },
      "score": 1,
      "text": "This movie starts off well enough, geeky kid gets crumpled up trying to play superhero, establishes this is the \"Real World\" we're supposed to be talking about, but then it goes downhill when super-human reflexes, shooting, and agility come in with \"Hit girl\" and Batm... \"Big daddy\". These two have some of the most uninspired character designs I've seen in a long time. They look like garbage that would come out of a super hero MMORPG's character creator. Batman clone and anime schoolgirl. This trash is not clever at all. I don't know about the comic this was based on, nor do I care. Had the movie stayed true to the 'real world' ruleset it establishes in the beginning, it may have been better, but it quickly descended into horrifyingly bad when a little girl was zipping around DODGING BULLETS and performing ridiculous kills that would be over the top and showy in any medium. What little attempts at humor present in this movie are vastly overshadowed by how disturbing the father daughter duo's relationship is. The man brainwashes and trains his little girl to be an evil, remorseless killer and somehow these people are supposed to be heros? Final Verdict: This movie is intellectually insulting, shallow, and fails to keep with the rules it sets within itself. Don't waste your time with this one.",
      "total_reactions": 1,
      "user": "R7critical"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Aptly titled Kick-Ass is an excellent comic book adaptation that proves that there is no stagnation in a superhero genre whatsoever. Based on Mark Millar's violent tale Kick-Ass is directed by Matthew Vaughn, the filmmaker who happens to have a real knack for both action movies (Layer Cake) and teen fantasies (Stardust). It's more than evident in Kick-Ass and although the film has some problems with selecting the proper tone: it verges between campy comedy, dramatic piece and action spectacle, this is a gripping ride from start to finish.Vaughn's direction is nothing less than clever and kinetic. By employing video game techniques inspired by Shoot 'Em Up and Crank movies, Vaughn really excels at showing highly-stylized bloody violence on screen. As for the script, the main concept of an ordinary teenager who chooses to become a superhero is downright effective evoking loads of laughs and our sympathy. Aaron Johnson's cool, unrestrained performance also helps a great deal.The film revitalizes the genre by undermining its rules. The characters involved have no special powers, most of them, no necessary backstory and no turning point that resulted in them becoming superheroes, much like in Watchmen. Despite this, the movie establishes its own pantheon of heroes and the director knows that there's nothing more fascinating than the battle between good and evil shown in a vivid, exciting fashion.What's controversial about the film is the extensive use of pitch-black humor including the character of 11-year-old Mindy McReady aka Hit-Girl who has been trained from the early years to become a killing machine by her loving father aka Big Daddy. The whole subplot may be immoral for some who don't understand this kind of cinema, yet it's surprisingly plausible due to a tongue-in-cheek writing and acting talents of Chloe Moretz and Nicolas Cage who are as subversive in their respective parts as you can get. Last but not least, the artist formerly known as McLovin' channels a wannabe villain named Red Mist. You may be actually surprised by how smart he is in his plotting.Overall, Kick-Ass is a refreshingly funny and wickedly entertaining spectacle that warrants the whole franchise of masked teenagers to come. 9/10 (A-)",
      "total_reactions": 1,
      "user": "GregFisher"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2011
      },
      "score": 9,
      "text": "This was one of my most anticipated movie of 2010, and it delivered on almost every front, it's about an average comic book nerd who decides to become a super hero, and because it's real life he gets his ass kicked, it's a great movie with humor and action, the reason it's so appealing is because it's real life, the only flaw is at the end is that it gets unrealistic, which hurts the movie, but this is still one I can highly recommend.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "I found it utterly original and audacious.  It left me feeling giddy and a little ashamed.  Very funny and intelligent.  And I liked it despite the inclusion of Nicolas Cage in the cast.",
      "total_reactions": 1,
      "user": "adverb"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "When you were child, have you ever wanted to be a superhero? I thought all the kids who were born in 80s and up ever thought about that, at least once. Thiz movie was very confident since the beginning, they advertise it rapidly and the posters were very intriguing too. It is about Dave (Aaron Johnson), unpopular and nerdy boy at school who wants to be a superhero even without super power. He tried to save the world with alter-ego named kick-ass, on the contrary he got his ass kicked. Meanwhile, Big Daddy (Nicolas Cage) and her eleven-year-old daughter named Hit-Girl (ChloÃ« Grace Moretz) who has been the real superheroes were fighting the crime againts drug dealer mob, Frank D Amico (Mark strong). Frank attempted to put his son, Chris (Christopher Mintz-Plasse) as undercover superhero named Red Mist, his intentions was to trap Kick-Ass. Mark Strong once again succesfully brought an interesting villain character. Recently, He had been bad guy for ROCKNROLLA (2008), THE YOUNG VICTORIA (2009), SHERLOCK HOLMES (2009), ROBIN HOOD (2010) and upcoming GREEN LANTERN (2011) and previously many more. He could deliver different bad guy characters with his aura and I admired him for that. I officially gave him Bad Guy of The Year award (if I could). Other casts, Johnson was standard and Cage performance was just what we needed. It is ChloÃ« Grace Moretz who surprised us with believeable and easy-going performance. Outside of her Hit-Girl fight scene which was awesome (we knew probably substituted by stunt double) but she was also good in drama. The Director is Matthew Vaughn who directed STARDUST (2004) and respectable LAYER CAKE (2007). Actually on thiz movie, the conversation was rude (considered it as family movie) and the fight scene was bloody brutal, but we have to admit the story was original and effectively hilarious. The movie was brave enough to challenge the mainstream and it worked well in some moments. In my point of view, when we dare enough to laugh on ourself for our own stupidity or feebleness, that is the time we showed the big heart of us.",
      "total_reactions": 1,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "Being based on the comic book of the same name, the movie \"Kick-Ass\" respects the traditions of the comic book superhero genre by consciously getting inspiration from Spiderman and Batman. However, it transcends simple imitation by far. The production of the movie is awesome. Above all mentionable is the film's magnificent use of music. First off, in terms of the script, the movie does a wonderful job in criticizing the perceived lack of responsibility to people passing and watching a crime happen without doing anything against it. If many people start helping in bad situations that are not too dangerous, and if children are already being raised to intervene, everyone could contribute to a more secure society. This would also lessen the chance of getting mugged at some point in your life. On the other hand morally controversial, is the glorification of the revenge murdering committed by two of the protagonists who are less than more on the side of the righteous heroes. Even a woman that was not a threat but tried to flee was stabbed to death. Revenge killing is not a necessary evil for a good cause (as would be a killing in self defense). Therefore, they are hardly any different than some villain who kills for power. Rather than portraying the revenge in a neutral way or actually suggesting that revenge is morally bad, the cinematic glorification of it makes the movie less likable. Nevertheless, \"Kick-Ass\" is totally worth watching.",
      "total_reactions": 1,
      "user": "juliankleiss"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "This is one of the most enjoyable superhero movies of the last few years, with a decent storyline that is true to the original comic style. The killing scenes are quite impressive, but the story of Big Daddy and Hit Girl became a little too sappy to compliment the remainder of the film.",
      "total_reactions": 1,
      "user": "alleyt1989"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "Just another example of how great violent superhero movies can be. Great action scenes, memorable characters, a truly unique world, all helps create an experience like no other.",
      "total_reactions": 1,
      "user": "XxKingLeonidas"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "Entertaining deconstruction of the superhero trope. If you're easily offended by profanity, gratuitous violence, and the thought of children not being good and perfect little angels, don't watch this film (or go outside). Otherwise, be sure to give this one a try.",
      "total_reactions": 1,
      "user": "Anezay"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "There's no doubting it, this movie is pretty funny. It kept me laughing for a while, but after a short time it does seem to get quite boring.",
      "total_reactions": 1,
      "user": "CursedKnight187"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "I LOVE THIS MOVIE SO MUCH    IT WAS FUNNY AND VIOLENT.   IT WILL ENTERTAIN YOU.   IT KICKED ASS.   10 out of 10  it was a great action movie.   it was kinda like the comic book",
      "total_reactions": 2,
      "user": "lovemusic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "Finally something new. Kick-Ass is meant for everybody! Whether you're young or old, you will enjoy this movie. The actors did a really good job and the question whether being a super-hero in our today's society would be any good is answered.",
      "total_reactions": 1,
      "user": "ZiggyStardust"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2011
      },
      "score": 4,
      "text": "I was disappointed, to be honest. The film has few good moments, and I personally couldn't follow the plot due to a simple lack of interest in the characters.",
      "total_reactions": 1,
      "user": "alexandergreen"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2011
      },
      "score": 1,
      "text": "Generally terrible movie. Amalgam of weird geek sense of humor, action and... This movie left me untouched and it wasted my two hour of my precious life!",
      "total_reactions": 1,
      "user": "Vladasin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2013
      },
      "score": 2,
      "text": "The character Kick-Ass didn't do remotely anything memorable and epic. They also really  up the movie by shoving some irrelevant love relationship upon him. This movie is utterly horrible. Aaron Taylor-Johnson is boring to watch, Chloë Grace Moretz  can't act and Nicolas Cage is the rotten cherry that tops this movie. They wasted Mark Strong and the only commendable performance was Christopher Mintz-Plasse playing Red Mist. Other than that, this movie made me want to \"Kick-My-Own-Ass\".",
      "total_reactions": 1,
      "user": "ReviewGuyX"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "This film has fantastic fight scenes, great characters and cinematography. This film has quite a few funny scenes, but some jokes in this film aren't funny...but just plain cruel.",
      "total_reactions": 1,
      "user": "FPSSucks"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2014
      },
      "score": 0,
      "text": "its gay because im gay and nic cage is bae. also i got stuck at the one part where i'm supposed to touch my gf but i cant get past it cause i love RAGING BONERS IN MY UTERUS. 0/10 FLOPPY COCKS",
      "total_reactions": 2,
      "user": "imgayilovedick"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "We have entered the world of post-modern superheroes, where the concept of someone with special powers doing battle against the forces of evil seems quaint, almost boring. Batman is The Dark Knight. Superman is on hiatus because the most interesting thing about him is the John Williams theme. And Spider-Man is in the process of being rebooted because no one could figure out where to take the character. Yet, despite the trials and tribulations of some of the best-known comic book heroes, the genre is insanely popular, and that popularity gives rise to projects like Kick-Ass, which mock and embrace the conventions with equal zeal. Kick-Ass is part hard-core action flick, part parody, and part comedy. Done poorly, this sort of thing can be painful. Done well, as is the case here, it's a blast. It offers a \"have your cake and eat it, too\" experience - you can enjoy the exploits of a superhero while at the same time showing your hipness by laughing at some of the sillier clichés. There are so many self-referential layers in this material that it's almost dizzying to contemplate them all.",
      "total_reactions": 1,
      "user": "Cinemassacre94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "Funny, bloody, and even strangely powerful in places, 'Kick Ass' is fun entertainment of the highest order. You'll have a blast if you leave political correctness at the door.",
      "total_reactions": 0,
      "user": "aabender002"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Kick-Ass    The past decade has offered many successful comic adaptations, which not only nail the feel of the comic, but also entertain fans and audiences alike. In 2008 we were given The Dark Knight which is undoubtedly the most successful comic adaptation of all time, but the newest adaptation Kick-Ass could very well be held to The Dark Knightâ",
      "total_reactions": 0,
      "user": "Pheonixdbf"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "I must first say that it is a really well made film with some excellent stunt work. I thought the music chosen for the score was really great as well. Excellent performances from all of the leading cast, Aaron Johnson as Dave Lizewski/Kick-Ass, Nicolas Cage as Damon Macready/Big Daddy is excellent, Chloe Moretz as Mindy Macready/Hit-Girl (also superb), Mark Strong as Frank D",
      "total_reactions": 0,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "Kick-Ass is a very funny, very violent and very original super hero flick. The action sequences are exceptionally well directed; exciting, grotesque and laugh-out-loud funny all at the same time. This is a great film, stuffed full of memorable moments and characters.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "Kick-Ass is, for sure, a fine homage to super heroes. Besides entering on a cliche universe, however peculiar, from the characters (special abilities, graphic violence, good humor, and really versus evilness), the film brings a curious narrative which accosts the contrast between existentialism and the consequences of being a 'demigod'. The production, inspired in the graphic novel by John Romita Jr. and Mark Millar, is really well directed by the Britain and the debutant Matthew Vaughn. Apart from the cool balconies of metalanguage and creativity in conducting cameras, Vaughn brings a clever script that prints a breathtaking pace balancing drama, action (with inventive scenes and quality) and comedy in good measure. Telling more details about the heroes in \"Kick-Ass\" would be such a immorality. The amazing true story about the 'alter egos' work as well as the stories of famous 'vigilantes' on crime. Kick it Hit-Girl!",
      "total_reactions": 0,
      "user": "jimmytancredi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "It's a good movie.  Just don't take it too seriously.  Lots of hardcore violence that i didn't expect and some very memorable characters.  Kids, don't take advice on girls from a guy that looks like a hobbit.  Enjoy.",
      "total_reactions": 0,
      "user": "movie__man"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "After watching this movie the second time, I can easily say that this is one of my favorite Superhero films, and then watching it the third time, I absolutely loved it even more! I found out how awesome the action scenes were and how the characters did a perfect job. I really didn't think this movie can be that dark and funny at the same time. Just can't see how some people would hate it. Well, I guess if you took your child to this movie thinking it will be for kids, but who would think of that with the title Kick-Ass. What Im really surprised about is how Nicholas cage did in this movie, playing Big Daddy. It wasn't one of his same old acting, but it was something most of us was waiting for. Of course, Hit Girl, played by Cloe Moretz, was my favorite character. She did the most awesome moves when fighting. Aaron Johnson might have been a new face to all of you, if you haven't seen Nowhere Boy, which you have to see. Aaron played the main character, Kick-Ass, who's got sick and tired of getting picked on. So he becomes a superhero, and becomes really famous. Then somehow everything turns out wrong, when a part of gang gets taken down by kick-Ass, Hit girl, and Big Daddy. The last two action scenes is so awesome and intense that I almost peed myself. Kick-Ass and Red Mist are probably the ones that make this movie have hilarious parts. I also discovered that this had songs from Danny Boyle's \"28 days later\" and \"Sunshine\" during the fight scenes that really made it's mark. I will definitely love this film, and the characters, and I think I just found a new favorite director, Mathew Vahn, who directed \"Stardust\" ( who would've guessed that), and produced \"Lock Stock and Two Smoking Barrels\". This movie is not the average superhero movie, but is definitely one of my favorites.",
      "total_reactions": 0,
      "user": "RichBlack"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "In my opinion, this movie was much better than I expected it to be. The story is pretty interesting, along with the action throughout the whole movie. This movie is a good movie that I think everyone would enjoy.",
      "total_reactions": 0,
      "user": "bighead6000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "The 21st century has seen a revival in the superhero genre of films, and few are as unique and as brilliant as Kick-Ass. Created in the writing rooms of Marvel, the transition to cinema has been almost entirely successful, and has catapulted this excellent comic into the mainstream. An outstanding aspect of the film is the casting, in particular bringing all of our attention to ChloÃ« Moretz in the controversial role of Hit Girl. Others performed admirably too; Cage turned in a decent performance; Aaron Johnson played the eponymous role well; and comedy was provided from all angles in the form of Dave Lizewski's buddies, Marty and Todd. The real brilliance of the film though is routed in the realistic nature of the setting and characters, with the plot showing fantastic uniqueness. Kick-Ass has succeeded in being a great film, good fun to watch and yet at the same time making the audience feel emotionally invested in the characters. The action sequences are worth a special mention, in particular those involving the character Hit Girl, because of the way in which they are shot. Matthew Vaughn has pulled out all the stops in creating visually stunning fight sequences, and coupled with a well chosen soundtrack, he has created some of the best action sequences in recent times. None of this compromises the emotional integrity of the film, and for that the film creators deserve great credit given how gory the comic was. A great film, a kick-ass film.",
      "total_reactions": 0,
      "user": "papamurrth"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "It's unfair to say that films that are this inappropriate are highlighted as 'not for children'. Well, duh, of course not, but just because this film is violent and full of profanity, does that make it any less better than other films that are considered more appropriate? This is pure entertainment and the jokes were never few and far between - it felt funny, fresh and original. Yeah, so, the beginning had little fire-power to it, but that didn't matter. The songs rocked and there were some extremely colourful characters - Strong certainly had a field day playing Frank D'Amico. On that note, it was brilliant to see some well-known and likeable actors playing them, although it's the first time that I've seen Cage excel at his acting! The costumes were certainly colourful too - especially Christopher, who could not look better in that epic Red Mist outfit! Action-packed, beautifully paced, side-splitting tear-inducing falling-off-sofa humoured solid gold entertainment, and, despite what the critics think (Average review score of 66? Please, show yourself to the door this instant), this film really knows how to Kick-Ass!",
      "total_reactions": 0,
      "user": "EssenceOfSugar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "Word of advice, don't follow the trailer on this one, because Kick-Ass is further away than the dumbed down superhero comedy that the trailer indicated.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Its not for all kids, but the plot of Kick-Ass teaches people not to hesitate and stand up to bullies and criminals, makes a difference in fighting crime, teamwork is well-structured into the story than other superhero films, and delivers non-stop comic action and laughs.",
      "total_reactions": 0,
      "user": "Jedi_Jettson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "Kick-Ass is one of the best \"superhero\" movies ever. I put quotes around the word \"superhero\" because it is not your traditional superhero film. The entire concept behind it is very unique and refreshing, the characters are not archetypal at all, the acting is good enough, and the style is very in-your-face. Granted, that in-your-face, overly graphic and profane style will certainly rub many people the wrong way. This is not a film for everyone. The only weak element of the film, and it's also part of its strength, is the ridiculousness of certain scenes and action sequences. I can't know it for that because the fact that it doesn't take itself too seriously is also part of its appeal but there are times when aggravation occurs. Overall, this is a great movie that, while everyone won't enjoy, those that do will certainly love it.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "It wasn't what I expected. I thought it would be a fun mix of comedy and action, but it wasn't. It started out pretty good, but then it just went way over the top, filled with clique violence and often used catch phrases. It was predictable, all be it entertaining. If you were like me however, expecting anything more than just another shoot 'em up, blow 'em up, action film, you're gonna be disappointed.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "This movie was not what I expected it to be. It was better, bloodier, a little less funny, and definitely more stylish than I could have hoped for.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "Within the genre, this is quite spectacular, lots of fun, and more emotionally engaging than any fun superhero movie has the right to be. If you're in doubts about what superhero movie to see next, take me recommendation. And no, it's NOT for kids.",
      "total_reactions": 0,
      "user": "mrnice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Una pelicula con superheroes e intentos de superheroes muy divertida, la traduccion al español es fenomenal (Mexico), me parecio muy comica y original, me hizo llorar de la risa, la musica muy acorde a los momentos cumbre de la pelicula, que mas se puede pedir el reparto de 10, saludos....",
      "total_reactions": 0,
      "user": "sjbn002"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "Kick-Ass is an amazing film, however, you can't get upset by people dying. If you do, you will be crying throughout the entire film. A little girl swearing can't offend you either.",
      "total_reactions": 0,
      "user": "Horsemad7009"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "It's crude and violent, but it's great. How many comic book movies can you think of that offers you ridiculously hilarious content and a compelling story and action at the same time?",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2016
      },
      "score": 7,
      "text": "I typically detest films like Kick-Ass. Yet, here I am. I actually quite enjoyed Kick-Ass. It is funny, thrilling, and thoroughly entertaining. It is truly infectiously fun. Chloe Grace Moretz certainly steals the show as the 11-year old assassin Hit Girl who kicks major ass. Aaron Taylor-Johnson is also solid in the lead role and does a fine job, though Moretz certainly hints at her future potential as a great actress in this role. Fun, well paced, and actually quite well written, Kick-Ass may be a little skin deep and may indulge in gratuitous violence and silly, over-the-top moments a little too often, but it is hard to resist its charms. Plus, who does not appreciate a film with Nicolas Cage that can actually be labelled as \"good\"? Overall, Kick-Ass is just as silly and dumb as you may think, but it works thanks to stylish direction from Matthew Vaughn and a unique approach to the superhero genre.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "Matthew Vaughn produces a great film here with a very young cast. Obviously Vaughn has been involved in many British films and I feel as if they (as well as his upbringing in the UK) have greatly influenced the way he portrays comedic moments within an action film. All-in-all, this was a very enjoyable film which I would happily watch again and again.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "This is a great movie, its fun entertaining and has a whole Lota violent's, Honestly the best superhero movie ive seen in a long time, it was just a great film, not the best movie of all time but still one bad-ass  movie i definitely recommend siting down and watching it.",
      "total_reactions": 0,
      "user": "ReubenIsAGod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "Kick-Ass",
      "total_reactions": 0,
      "user": "axelkoch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "It's crude and vulgar, the idea is unoriginal, but never, ever, has a superhero movie been as hilarious as this one. The jokes used in this movie are incredibly funny, and the title gives you a sense of how good this movie will be.",
      "total_reactions": 0,
      "user": "Freakazoid1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "If you had ever wondered why the superheroes never lost their patience against the bad guys and did not resort to killing them, watch this movie and maybe you'll be put off the idea forever. The only thing that sets this movie apart from other superhero movies is the shocking level of violence perpetrated by a kid. The title character is just there for laughs and to get his ass handed to him on more than one occasion. The movie shines because of Hit-Girl and her daddy Big Daddy, who violently kill criminals to keep them off the streets. But BD has a secret vendetta that he pursues ruthlessly. I liked the movie only because it showed a different version of the superhero concept, and that was refreshing. Just watch the movie by turning a blind eye to the blood and gore, if you can. The cutting of body parts and killings are presented in a humorous way yet very graphic, so be advised.",
      "total_reactions": 0,
      "user": "Swati"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "So good! A great film. Unlike anything I've ever seen before. This comic book movie is wonderfully directed by Matthew Vaughn who can do no wrong. Chloe Moretz as Mindy/Hit Girl is unforgettable. Classic film!",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "This is a highly entertaining film and right up my alley as I love a good superhero movie, but its almost a parody of them and more realistic also. Taylor-Johnson shines as Kick-Ass but it's Moretz who I feel steals the show as young Hit Girl. It's probably more violent than you would think but also has a nice little dash of Comedy also, blending a few genres together in a way that really works. Overall a very enjoyable film and I can not wait for the sequel!",
      "total_reactions": 0,
      "user": "survivorfan989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Hilarious and graphic, Kick-Ass is a solid tribute to a graphic novel/comic loved by many. Hope they don't screw up with the sequel coming later this summer.",
      "total_reactions": 0,
      "user": "SimpleMethod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Kick Ass is genius! It has violence, humour, profanity, awesome music, exciting action and best of all everyone's favorite 11 year old Chloe Moretz. Who plays the vulgar and extremely deadly Hit Girl. This is definitely the best superhero movie I have ever seen and makes Iron Man look like Scooby Doo. You can count me in as a Kick Ass super nerd! I can't wait for the sequel (which comes out in 1 day).",
      "total_reactions": 0,
      "user": "python2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "A very vulgar and bloody film, but I really liked it.  A very cool story in the era of the superhero movie in which it is pretty much a spoof.  Overall this is a very fun film. A-",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "this movie was so breath taking... and I little bit cringe worthy when I first saw it but if you watch it for the second and third time it just gets better and better! Even better with friends! I thought the costumes were amazing, they really outlined the characters. The acting wasn't bad but I thought hit-girl absolutely stole the whole show, as of my final note I think this is one of Nicholas Cage's greatest roles despite all the  he has come out with in the past. I cannot wait for Jim Carrey in the new movie, I hope it gets even better reviews than this one got.",
      "total_reactions": 0,
      "user": "guitarmaniac005"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "This movie is a great way to know what it would be like if superheros were real.The story is great,the action's good and it is also fuuny.I can't wait for the sequel!",
      "total_reactions": 0,
      "user": "ICEExMagic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Loved it! Aaron is so gorgeous. Chloe is such a cool kick ass kid. Even though i slightly dislike Cage, he was OK in this. Even had my favorite Peters:) Funny, fight pitched.",
      "total_reactions": 0,
      "user": "30la"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Finally a funny full of action movie which will make you think about it all the time. Chloe is Fu**ng great. The best actress for that role and I'm really looking forward for the sequel. Hope it's great like this one. A great action film",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "Having myself, dad & sister read the book, It was one of those rare instances where we \"all\" couldn't wait to go see a comic book movie, For what probably is one of comics most strongest indie projects to come along in quite some time, and the fact the principle storyline only tends to sway apart in each different form of media, Kick-Ass magically works well on film, to an extent where this comic needed to be made into a film.",
      "total_reactions": 0,
      "user": "George-roots"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "Kick-Ass is a delightful combination of action and comedy. It is funny, entertaining, and really doesn't hold back with the violence. The action scenes are relatively original too.",
      "total_reactions": 0,
      "user": "Elucidate"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "Its crass, parodying styled humor may appeal to some more than others, but its relentless action scenes, and its embracing of normality performing the extraordinary storyline is just clever enough to make this film work.",
      "total_reactions": 0,
      "user": "SuperheroMovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "Directer Matthew Vaughn brings was the great super hero movie Kick-Ass a movie based in real life with real people no they don't have superpowers but that doesn't stop them. Now at the time i didn't really know anything about Vaughn he had only done two movies (Stardust,Layer Cake) though i haven't seen those movies maybe i should take to time to watch them because both this and his X-Men: First Class film are great.",
      "total_reactions": 0,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Very satisfying pulpy superhero action flick, with a great cast and a great premise. It basically is satirical to the whole drama, and it works. Kick-Ass is also intelligent, knowing when to make the next joke, the next kill, etc. The way it moves from scene to scene is actually a lot better than one might expect from a movie of this nature.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2014
      },
      "score": 5,
      "text": "Now, Kick-Ass IS a good movie. When Dave earns the ability to take a hit better, it's realistic and that's what makes it more likeable. But there's too much Hit Girl and not enough of the main character. If Chloe's character wasn't in this, it would've been kinda lame. But I actually liked a lot of the action scenes. The thing is, it slows down too much in the middle. If there were more action scenes, it would've turned out better. Still, watch this movie. You'll probably like it.",
      "total_reactions": 0,
      "user": "InverseCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "A strong and brazen hero flick that actually is more ground breaking than some superhero movies previously seen. Matthew Vaughn directs this film wonderfully.",
      "total_reactions": 0,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "A twist on the old 'high school geek turned superhero', with Christopher Mintz-Plasse, killer fighting and a few laughs for good measure. Doesn't muck around with drama and makes for an entertaining watch.",
      "total_reactions": 0,
      "user": "KaptainHutchino"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "I'm from Brazil, and I loved the movie and the story was really cool, I believe the low scores in other reviews is because people can not differentiate reality from the movies, this is real life people understand unfortunately the Big Daddy had to die if not the film also does not make sense they always win. Understand something good does not always win and this film shows the real life, I'm sorry if there was an error in grammar, because I'm not from your country.",
      "total_reactions": 0,
      "user": "elderpat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2014
      },
      "score": 8,
      "text": "Sure the movie is cliché but, he's still enjoyable.Great performances by Chloe Grace Moretz and Nicolas Cage and great fight scenes are probably the best elements of the movie.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "I love this movie it feels like a love letter to Comic fans everywere. Aaron Taylor johnson is great as Kick-Ass, Nicholas Cage is in one of his best roles to date, Mark Strong and Christopher Mintz-Plasse are on top form as villains and why Chloë Grace Moretz wasn't up for best supporting actress for her iconic role as Hit Girl i'll never understand. couple with great action, plot and characters and you have an awesome movie",
      "total_reactions": 0,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2015
      },
      "score": 9,
      "text": "Kick-Ass es tan bizarra, violenta y divertida que es sin duda alguna una de las películas de super héroes mas divertidas que eh visto. La trama es sencilla pero funciona y las secuencias de acción son exageradas pero increíblemente divertidas. Todo el elenco hace un trabajo increíble y único (Chloe Grace Moretz es excelente) totalmente recomendable.",
      "total_reactions": 0,
      "user": "JohnMasterL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "Such a great super hero film brought to life with tons of action and amazing combat scenes. Each moment you watch will make you feel different emotions such as excitement, shock and sadness.",
      "total_reactions": 0,
      "user": "sonic4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "The point in Kick-Ass is something that it's sequel didn't have.... it's something that actually works for me.... and the true entertaining part in it is the entire movie itself.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    }
  ]
}