{
  "mc_avg_user_score": 7.1,
  "mc_metascore": 41,
  "mc_mixed_rating_frequency": 140,
  "mc_movie_name": "Kick-Ass 2",
  "mc_negative_rating_frequency": 64,
  "mc_positive_rating_frequency": 424,
  "mc_pro_critic_reviews": [
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 70,
      "summary": "The film delivers almost exactly what fans of the first installment are hoping for."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 70,
      "summary": "The most welcome change is the tone. Wadlow has decided he's making a straight-up comedy, and he demonstrates a knack for it."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 67,
      "summary": "It's rambunctiously amusing but the laughs clot in your throat. There's a meaner streak this time to Kick-Ass and Hit Girl's exploits, or maybe Carrey's sensitivity is justified. Either way, the third act of Kick-Ass 2 is a visceral beatdown."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 63,
      "summary": "I do get a chuckle out of movies with wildly inappropriate behavior, rude language and ultramayhem, especially when they involve children, but Kick-Ass 2 sometimes felt like being trapped in a room with the funniest guy in seventh grade."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 63,
      "summary": "Tone isn't the movie's sole problem. There's something off-putting about Christopher Mitz-Plasse as the chief bad guy."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "Kick-Ass 2, a movie that, for all its predictable sequel-ness, manages to conjure up pretty much the same dark magic that the earlier film did, albeit with more troubling results. Believe it or not, Kick-Ass 2 is even more of a provocation than the first Kick-Ass."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "As diverting as this action-packed caper often is, it feels not just weightless but emotionally and morally stunted whenever it veers into grown-up dramatic territory."
    },
    {
      "critic": "Owen Williams",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "A more modest success than the first \"Kick-Ass,\" but still of-a-piece with its scurrilous predecessor. Nobody flies a jet-pack up a skyscraper this time, but Kick-Ass 2 still has its share of over-the-top action, and the sweary laughs are just about intact."
    },
    {
      "critic": "Matt Risley",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "A fun if sporadically schizoid return to one of the brighter, brasher comic-bookers of recent years."
    },
    {
      "critic": "Cath Clarke",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "The best thing about ‘Kick-Ass’ was Moretz, and Hit-Girl still gets the best lines. Like the first film, Kick-Ass 2 pulls the reality of teen life into its fantasy."
    },
    {
      "critic": "William Goss",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 56,
      "summary": "Faithful to the superficial thrills and flaws of the original."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Moretz, who is 16 now, can't manufacture the same that's-so-wrong jolt she managed the first time around. Back then, it was hilariously taboo to see a little girl spout arias of profanity. Now, she's just another teenager swearing. Like the rest of the film, what was once shocking now just elicits a shrug."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Like its own protagonists, Kick-Ass 2 can’t decide what it wants to be when it grows up: a vessel for unhinged vengeance and destruction or a meta-critique of those same impulses. In going for both, it winds up being neither."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Kick-Ass 2 has a mean-spirited vigilante streak the first film lacked (it seemed more concerned with justice, in its way), as well as a fatigue. It’s still funny, particularly when Hit Girl spews profanity and wields weapons. It’s just not as good."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "A weird mix of the refreshing and the dispiriting, Kick-Ass 2 is appealing in its brutal honesty and repellent in its honest brutality."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "To stand out in a crowded marketplace, a sequel can’t just kick ass — it has to blow minds."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "What seemed edgy and brash in Kick-Ass is now routine and old-hat. The first movie was a brash satire on formulaic comic-book movies — exactly the sort of picture the sequel turns out to be."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Even with its edges sanded down, Kick-Ass 2 is unmistakably Millaresque — a juvenile comedy of excess, in which skewering adolescent power fantasies looks an awful lot like indulging in them."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Kick-Ass 2 returns with the original’s rollicking sense of vulgarity and bodily trauma fully intact, but the story has more plot lines to string together than absolutely necessary."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Kick-Ass 2 is a lesser version of what it appears to be, an uncertain jumble rather than a true exploration of outrage, violence and identity."
    },
    {
      "critic": "Gabe Toro",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "The crime isn’t that Kick-Ass 2 is vulgar (which it is), but that it’s for so little gain."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "That makes Kick Ass 2 more sour than sweet, a movie that jokes about comic book fanboys but stops short of mocking them the way the first film did."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "The meta-satire hits you over the head until not just your Spidey sense is tingling."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "A messy, confused, over-the-top mixture of brutality and sick comedy, puckishness and ugliness, self-awareness and tone-deafness."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "Your ass is constantly braced in readiness and hope, but it remains un-kicked."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 38,
      "summary": "Kick-Ass 2 is an uninspired retread. All too often it plays like a Comic-Con gone insane, with costumed do-gooders taking on costumed criminals in gratuitously vicious battles."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 38,
      "summary": "Kick-Ass is a prime example of a movie that never should have bothered with a sequel. Not only is its successor played-out, but it revels in carnage while lacking the visual style and gleeful humor of the original."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 38,
      "summary": "In the annals of sequeldom, Kick-Ass 2 has to be one of the lamest follow-ups ever."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 38,
      "summary": "It's no better, no worse and essentially no different from the jocular, clodhopping brutality of the first one."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 25,
      "summary": "Kick-Ass 2 is a special kind of crap: the kind smart people make for audiences they think are stupid."
    },
    {
      "critic": "Stephen Whitty",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 25,
      "summary": "If it works at all, fitfully, it's because of the precociously talented and in-control Moretz, who carries the film on her own small shoulders."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 25,
      "summary": "The film doubles down on the love-hate relationship with ultra-violence that typified its predecessor, but A History of Violence this is not."
    },
    {
      "critic": "Adam Nayman",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 12,
      "summary": "Arriving at the tail end of blockbuster season, this cheaply produced sequel to the surprise 2011 hit arrives in plenty of time to claim the title of the year’s most unpleasant movie."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "summary": "The writer and director, Jeff Wadlow, can’t obscure the movie’s misogyny, and he also has a tough time staging a scene and selling a joke. His worst offense is that he has no understanding of the power, gravity and terrible beauty of violent imagery, which means he has no grasp of cinema."
    },
    {
      "critic": "Ali Arikan",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "summary": "One of the year's worst films."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 17,
      "pos_reactions": 26,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "This movie is AMAZING!The story is great,the characters are funny and in some points very serious.If you want to have a movie that has  ll in one package,watch this movie.",
      "total_reactions": 43,
      "user": "LTR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2015
      },
      "score": 6,
      "text": "\"Kick Ass 2\" is a watered-down version of its original film, as the quality of both the script and choreography seems to have stepped down a notch; but for some reason it still manages to be a enjoyable action-comedy film to watch.",
      "total_reactions": 2,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2013
      },
      "score": 4,
      "text": "I absolutely loved the first Kick-Ass, but this sequel fell so flat for me. The wonderful color grading, style, and edgy material are gone this time around, and replaced with bad pacing, a horrible script, and over the top acting. I'm not saying the first one had Academy award winning performances or anything like that, but it seemed so more cliche and superhero like this time around, and I wasn't really feeling it. Jim Carry shines every time he is on the screen, and makes an amazing follow up to Nicolas Cages best performance in decades, but he probably only has 30 minutes of screen-time total. Which is a shame. And while I love Chloe Grace in almost everything she has been in, this was her weakest performance, partly due to the horrible sub plot with a bunch of air-head blonde cheerleaders. To be honest, I don't want to see this ever again.",
      "total_reactions": 2,
      "user": "Tobehonest7323"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2013
      },
      "score": 4,
      "text": "I was disappointed in this movie. Maybe I had it coming, I let down my guard and thought that this might be one of the rare instances a sequel does a film good. This film shouldn't be called Kick-Ass 2, it should be called Hit Girl. The entire movie revolves around her and maybe that's not such a bad thing.",
      "total_reactions": 1,
      "user": "themankymoo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "This was a good squeal, not as good or hard hitting then the first one, and im kinda pissed about the ending of the movie with Mindy and Dave kissing, really didn't seem necessary because i believed that the relationship between Mindy and Dave seemed more like a brother sister thing, in fact that is what i kinda wanted it to be, also i didn't like the fact that they kept the Dog Decapitation out of the film for i believe that moment in the comic book was hard hitting, overall Kick Ass 2 is a great squeal not as good as the first yet still accomplices and has the same feel as the original movie.",
      "total_reactions": 1,
      "user": "ReubenIsAGod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "Kick-Ass 2 may be disappointing to some, but it was never going to be as good as the first movie. Never at any point was I bored and even if some scenes were cheesy (and one disgusting) it's still a very good film. Mainly because of the brilliant cast especially Christopher Mintz Plasse as The Mother F*cker.",
      "total_reactions": 1,
      "user": "python2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "Although it doesn't quite match up to the original Kick Ass, this sequel still keeps an excellent mix of action, bloody violence, and humour. What needs to be realised is that Kick Ass 2 is meant to be a fun movie more than a drama, although some of the lines are quite inexcusable...",
      "total_reactions": 1,
      "user": "Elucidate"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "While it was hard to ignore some of the cheesy lines, this movie managed to capture my attention the whole way. What a great cast. It was an all-round hilarious movie.",
      "total_reactions": 1,
      "user": "film_bug"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "Just as good as the first film to be honest. Although this film feels a little rushed with some characters being hard to get attached to, I personally really like this film.",
      "total_reactions": 1,
      "user": "sonic4president"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "If you enjoyed the first film then don't hesitate to see this one. It is filled with the same profanity and hyper violence as the original. The humor is still there even if it's even darker than the original and there are a few scenes that can be seen to be in bad taste if you take the movie too seriously. Overall it's a worthy sequel that has fantastic performances from the majority of actors with Jim Carrey and Christopher Mintz-Plasse standing out in particular. If you liked the first film then there is no reason why you wouldn't enjoy this one to so give it a try!",
      "total_reactions": 14,
      "user": "ninja_dolphin"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Don't listen to the critics! The movie is very entertaining and all around just AWESOME! It had the whole theater laughing and every character is great in the story...... Oh and the fight scenes. THEY ARE KICK ASS",
      "total_reactions": 8,
      "user": "Lohesh"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Kick Ass 2 is wonderful, the characters are fun and even the villains are fun  The story is beautiful and very edible, and the battles are very fabulous and enjoy more than 100% and the final battle  100% recommended",
      "total_reactions": 7,
      "user": "LeonSKennedy"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Kick-ass 2 is it good? yes it absolutely is one of the movies that i have been waiting for since the beginning of 2013 and if you are a fan of kick-ass 1 then you are going to enjoy this movie. The movie still keeps the cursing and bloody gore from the first one which is great and the story is equal level to being good as kick ass 1, i saw some earlier reviews from critics and i just didn't read them because i know they were wrong and i was correct the movie is great and if you are not planning to see it this summer then you are missing out. anyway do not listen to what the critics are saying my faith and trust in critics died when the hobbit got a low meta score rate and so did man of steel so 42 meta score at the moment is not right it does not deserve that in my opinion it deserves at least 61 meta score in all honesty and i would give it 9/10 i am taking off the 1 more point to make it 10/10 because i didn't like how they changed it from the novel but that is just me the movie was great and if you haven't seen it i advise paying your £7.50 and going to see a movie of the summer that is not one to miss, do not listen to what the critics are saying. so my final point if you like action and superheroes and blood and more action and a kick ass story then kick ass 2 is the movie for you.",
      "total_reactions": 12,
      "user": "TheDrunkCamel"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "\"this is one of those movies with which you have to see it yourself to see why the critics are just being stupid.\"-adrenilinmatt",
      "total_reactions": 9,
      "user": "cadeus"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "A darker, more serious story than that of the original but that is definately a good thing. While still retaining the comedic writing within the characters like the original, this film has brutal action scenes and shows a more mature kick-ass and hit girl. The acting is fantastic all around, even Jim Carrey actually acts in a unique role from anything he has done before! This movie is a work of art and after seeing reviews before I saw it at the premier showing, I was worried. Definately see this movie, it is a perfect follow up to the first one!",
      "total_reactions": 6,
      "user": "groosenater"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "Kick Ass 2 is riddled with problems. The core of these problems is director Jeff Wadlow, who clearly does not know how to shoot an action sequence. All the action in this movie looks bad and is filmed with shaky cam, compared to the smooth originals of the first. Overall just an utter disappointment.",
      "total_reactions": 6,
      "user": "SimpleMethod"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "(This review has very minor spoilers, and will notify you when such moments occur.) Please, do NOT listen to these snobby condescending critics, thinking they're hot s**t for ripping apart a fim that others loved. I know it's their opinions, but Jesus are they over criticising aspects of the movie. And don't say \"they're criticising the film because they're critics.\" I'm not talking about in general, I'm talking about aspects. Some critics say that \"You should do ANYTHING apart from seeing this film.\" Are you kidding me? I can see why some people might not like this film, but why the f**k would doing a puzzle beat watching this film? Are you seriously that brain dead? Anyway, onto what was good in this film. Every character worked superbly in Kick Ass 2. The big name actors  Jim Carrey, Christopher Mintz Plasse, Aaron Taylor- Johnson and Chloë Grace Moretz.) do an AMAZING job playing their characters, the score is as awesome as it was with the first one, the action is thrilling, and all scenes stand out as a significant, and memorable moment. Some things that have changed, are such as: the much more hilarious sections, the graphic and somewhat disturbing take on it's comic book counter part and the range of superheroes. (SPOILER WARNING AHEAD) Some things that I didn't like, were the: faceless emotions when a character was killed off, and the sad excuse of relationship endings, just so Dave could have dirty (maybe unprotected) sex with night  Probably my biggest hatred with the film was the climax with Mindy's conflict between the popular high school girls. This scene was very stupid, but it only lasted a few seconds, but man was it just flat out STUPID.",
      "total_reactions": 6,
      "user": "Sammydidds123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "After the movie, i went home and watched the first part for the 10-th time, so, it's a great sequel of a great film. Can't wait for Kick-Ass 3, hope to see it soon",
      "total_reactions": 3,
      "user": "ArtemJr"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "Kick-Ass 2 was definitely a film for the fans, if you aren't familiar with the Kick-Ass series then this movie wouldn't be for you. Having said that I am a fan of the comics and this movie was awesome. The fight scenes were crazy and Hit-Girl always runs the show. I hate that the critic scores are low but I honestly kind of figured they would be and I see why they made it so low, to a film's core this film wouldn't be looked at as a masterpiece, and they couldn't exactly retain the same shock factor the first one had because Hit-Girl was only 11 or 12 years old in it. But all things aside this was a pretty entertaining film and I think most people would really enjoy it.",
      "total_reactions": 8,
      "user": "a7xfan"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "This movie was spectacular. I had adrenaline pumping through me from the fights. The story itself was great too, this is without a doubt one of the best movies I have every seen. Its way better than its predecessor.",
      "total_reactions": 20,
      "user": "GingerLord"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "Jeff Wadlow decided to take a different approach than the first Kick-Ass, and he made a terrible mistake. The dialog in this movie  an absolute disaster, plot is stupid, action & acting is alright. There are couple of funny joke, which isn't enough. Also unnecessary violance all over the place. So, it's a huge disappointment",
      "total_reactions": 10,
      "user": "PStakhiv"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2013
      },
      "score": 3,
      "text": "I love Kick-Ass it was vulgar, violent, and original with a good director in Matthew Vaughn.  Unfortunately this is a bad sequel that is terribly paced with to much shaky cam and some really awful scenes involving vomit and the potential raping of a woman.  A big disappointment. D+",
      "total_reactions": 5,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "Kick-Ass 2...Sucked Ass. Kick-Ass 2 has a whole new creative team from the first film! And you can tell...The film tries to emulate what made the first movie so good but fails in almost every aspect. I can't say that I down right hate the movie. Of course there many things about the movie that I liked but a lot more that I hated. The thing that bothered me the most was the whole \"mean girls\" story arch with Hit-Girl, it just didn't work and didn't fit in. It's almost like the creative team glanced at the first movie and said that was Kick-Ass. From what I saw they just don't understand what made the first movie so good. But I will be optimistic and hope that they boot Jeff Wadlow from the directors chair and get somebody who can actually make a movie for Kick-Ass 3. Jeff Wadlow is a hack-fraud...",
      "total_reactions": 5,
      "user": "anon1235"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Guys, this is one of those movies with which you have to see it yourself to see why the critics are just being stupid. It happened with man of steel earlier in the year. The user scores where far better than the critic scores. This is because we seem to know more what to look for in a movie these days. My faith in critics has died. I only ever judge a movie after I see it for myself. And kick ass 2 is fantastic. Of course, it was never quite gunna be the movie the original kick ass was, but it left me with the same grin on my face and uplifted feeling in my gut. Go see this movie. It is better than you think. I guarantee it.",
      "total_reactions": 17,
      "user": "adrenilinmatt"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "I honestly have no idea what the critics are talking about. This movie was my favorite film of the year. I will never trust a critic again. All through the movie I was laughing and enjoying it. Aside from a few forced scenes, it was flawless and I liked it just as much as the first one. If you liked the first movie, SEE THIS. It was on par with the first if not better. SEE IT!",
      "total_reactions": 12,
      "user": "Kimo303"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "Overall, Kick-Ass 2 is a “good” but not “great” followup to Vaughn’s surprisingly smart, stylish and witty original. The sequel will be more enjoyable for those fans wanting to revisit the world and characters for another romp through a twisted version of the DC and Marvel comic book universes  but beyond that, all you’re getting is a standard action film with a B-movie feel. If it wasn’t Kick-Ass or Hit-Girl headlining, there would likely be little excitement and even less payoff from the Kick-Ass 2 experience.",
      "total_reactions": 13,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "his film is a have to see. The critics are being utter retards. Watch it and decide for yourself. It definitely recaptures the feel of the first film and just is the perfect sequel.",
      "total_reactions": 14,
      "user": "fungifeet"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "Ok, it's not Shakespeare. But who are we kidding? Did you see the first one? Did you like it? If yes, watch this movie, you'll like it too. No? Then don't watch it, because it has pretty much the same vibe as the first.  If you liked the first and not this one, I'd be fairly surprised.",
      "total_reactions": 8,
      "user": "SpcSamRI"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "If you were a fan of the comicbook series, be aware of the fact that the violence is not as prevalent in the film translation, also there's a mildly awkward love story between two characters.",
      "total_reactions": 4,
      "user": "Dufflad"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "KICK ASS 2  Review. (spoilers)  by  megafish",
      "total_reactions": 4,
      "user": "bloodhoof"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "This is a great movie, I like it so much, you people have to see this one. Is nothing wrong with this movie, is no the best movie of the year but is excting.",
      "total_reactions": 4,
      "user": "Luisdark27"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "This Movie is not Overrated its Underrated.. I mean how many movies do you get which have a perfect blend f humor, action, murder, superhero  I think you Get it.",
      "total_reactions": 4,
      "user": "prakharrai"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2013
      },
      "score": 5,
      "text": "As a fan of the first Kick Ass movie I have to say I was a bit disappointed with Kick Ass 2. It seemed more of a \"Teen Drama\" then the real superhero movie the first one was. Instead of most of the movie being spent on action it's spent dealing with Hit Girl trying to fit into High School. Its just not the sequel I hoped for, and a huge let down for me.",
      "total_reactions": 4,
      "user": "KinkInspector"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "Not a perfect movie by any means, but it was still good.  Pros: Kickass and Hit Girl were both just as good, if not better than the first movie; action was good, Christopher Mintz-Plasse was great as MF.  Cons: iffy script issues (like Taylor  suddenly knows who Kickass is and is then suiting up  only \"main villain\" to get any real screen time was Mother Russia (the other villains got next to no screen time, let alone any lines).  Despite the cons, the movie turned out much better than I feared. If you like the first Kickass, there is no doubt you will enjoy this one.",
      "total_reactions": 2,
      "user": "Junghova"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "This movie was pretty good, but it showed unnecessary violence. A Russian she-male lawnmows a guys head off. That's pretty violent. Lots of cussing. It's not that funny, either.",
      "total_reactions": 2,
      "user": "BWETMatangi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "No where near as original as the first. This movie suffered from not knowing what it wanted to be. A mindless fun action movie? Or a meaningful movie with a cast that people cared about. It failed at the latter.",
      "total_reactions": 2,
      "user": "DBurnsee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "I think that they could have left out some of the parts dealing with Hit-Girl and trying to be normal but other than that, it was an excellent film. I absolutely loved it and I will probably watch it a million times more when it comes out on DVD/Blu Ray. I went and say it with a bunch of my friend and we all loved it.",
      "total_reactions": 2,
      "user": "Gergonius1888"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "ACTION: 8/10  Unsurprisingly violent and well filmed",
      "total_reactions": 2,
      "user": "mikehoboman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "La primera entrega de Kick-Ass fue muy entretenida, uno de esos proyectos que se quedan contigo y te sientes identificado por su alta gama de personajes cómicos y además es muy divertida. A todas esas personas que han sentido lo mismo que yo les digo: Ni se les ocurra ver esta segunda parte porque quedarán muy decepcionados. Está bien; lo grotesco, la violencia intensa, los personajes graciosos, los diálogos que daban risa, directamente, todo a la basura, ésta vez Kick-Ass no pudo justificar su contenido, estoy consiente que, ni siquiera Hit Girl podría salvar esta película de su atroz destino. Una decepción",
      "total_reactions": 2,
      "user": "Fedelca"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "I enjoyed this movie, but I was also disappointed in it. It was good, acting was great, effects good, story okay, but it just didn't meet the magic of the first one. Where the first one was a completely unexpected anti-hero story, this actually turned out to be mostly cliche and lacking in originality. It felt like what the first Kick Ass would have been had a producer gotten hold of the script before it went to production. Unfortunately, I think that is what happened here.",
      "total_reactions": 9,
      "user": "Rtheom"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "Kick-Ass 2, even though not as good as the original was still a thoroughly enjoyable experience. I was worried that perhaps without Mathew Vaughn in the directing chair it wouldn't feel like a Kick-Ass movie. I'm glad to say I was wrong, Jeff Waldow did a very good job in creating this highly anticipated sequel. I thoroughly enjoyed seeing the delicate side to Hit-Girl and her going through the vulnerable side at being a teenager. Moretz gives another fantastic performance, in this series just as she gives a great performance in all her movies. Aaron Taylor-Johnson slips back into his role easily as does Christopher Mintz-Plasse who is hilarious in this film as well. Carrey is almost unrecognizable in this production which is good because I feel he was no longer playing yet another version of himself as he has been doing lately but I real character who you actually feel for. All in all this was a great follow up to Kick-Ass, I wouldn't mind if they made enough, but then I'd be satisfied with this ending.",
      "total_reactions": 9,
      "user": "McLaughlinViews"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "For anyone who loved the first one, this a great follow up, filled with action, suspense, and drama. Kick ass is kicks even more ass than the first one, and even has friends to help out. This movie is amazing, the finale was incredible. It was the most fun I've has at a movie in quite some time. FULL PRICE!",
      "total_reactions": 9,
      "user": "jfranz"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "This is a movie where I truly disagree with the critics. This movies is fun and exciting, it's not great but it's still a fun movie. Overall, it you're a fan of the first Kick-A** movie, then for sure you'll love this one. Be sure to check out my YouTube channel \"TheMovieManLife\" for all things movies.",
      "total_reactions": 7,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "Most movie goers are leery of sequels, and with good reason.    Hollywood tries to take the easy route when a movie becomes a hit especially these comic book hero types, and while it attempts to recreate the freshness and wit of the original, Kick Ass 2 just doesn't get it done.",
      "total_reactions": 7,
      "user": "shpostal"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "the night before i went to see kickass 2 I was seriously getting concerned looking at the reviews being so low, so naturally i walked in a little sceptical. walking out though i realised critic reviews aren't as reliable as they may seem...",
      "total_reactions": 7,
      "user": "dwrlewis"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "It is always painful and disappointing inside to see something potent and original dissolve away into the Hollywood formula. Clearly there is that pressure on Kick-Ass in the sequel. The question is, how has the ‘something more’ in the original fared? Something more than entertainment through the standard sugar high. Remember how touching was big daddy’s love for little kick girl when he would say “Child, your inventiveness is so wonderful.” Remember that hilarious beginning scene with the superhero we thought was our protagonist turning out to be just someone else who was mentally ill? The sequel is starting to dissolve around the edges. Gory fight scenes are less and less realistic and actually begin to get boring (except for kick girl’s!). What is doing well in the sequel is the comedic quality of the dialogue, the funny lines, and most of all the mystique of kick girl. What is it with her costume anyway? It is such a perfect vision. Kick girl is such a wonderful vision of a classic archetype. She represents anima in an early developmental but extremely potent state. Given this, it is no wonder she has propelled to such stardom especially with boys and even men. But even as a child, she is not FOR children. It is unfortunate in a way that her potency is rooted so entirely in violence. Theoretically it could have been based on many things. In it’s current incarnation it defines the Kick-Ass brand however, and isolates away this potency into an unrealistic basis which only Kick Girl can really own. Quite a brilliant form of ‘copyright’ actually.",
      "total_reactions": 10,
      "user": "jstubbs"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "I loved the first one, it was way better than I ever would've imagined.  This one however lived up to how crummy I thought the first one would be.  I'm not much for reviews and long winded opinions so I'll simply say that it was a poorly written and uninspired movie that failed to carry any of the genuine humanity established in the first episode.  Disappointing.",
      "total_reactions": 5,
      "user": "A7sus4"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "This movie was fantastic! I was a huge fan of the first Kick-Ass movie and when I first heard the rumors of Kick-Ass 2 Balls To the Wall I was excited. The acting was great especially from The  Kick-Ass himself seems like a better hero than he ever was before and Hit Girl is still a bad ass. Jim Carreys performance was great but he wasn't in the movie enough. I'd say he had twenty minutes of screen time which was a big disappointment. A big problem with this movie is that they entered so many new characters but they never had any character progression. But even with that you don't even notice it.",
      "total_reactions": 5,
      "user": "GFC"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "A very entertaining movie, that holds up well after the first one.  It delivers all of the same things we love about the first one and a few new things as well.  Very good movie.",
      "total_reactions": 5,
      "user": "rushmaster"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "Do you think it's funny if a guy is a silly costume who is about to start a gang rape of a woman can't get his dick hard, so they just beat the living  out of her instead? Then you might enjoy this movie. The director doesn't have what it takes to put the violence into proper context or to deliver it with a point. No, this is like a 13-year-old who has just discovered swear words and is now telling people on Xbox Live how he will rape them for headshotting him in Call of Duty.",
      "total_reactions": 8,
      "user": "Svampriket_se"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "Do not listen to critics! Competitors studios are clearly paying critics to attack the Kick-Ass franchise.",
      "total_reactions": 9,
      "user": "chojin999"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "It's a waste of time for making this sequel way too far. Kick-Ass only deserves a good superhero movie with the good purpose is that the protagonist must face his issues of being a superhero. In this bad purpose of Kick-Ass 2, the protagonist is coming back as a bad superhero with bad attitude, no heart, still fighting with bad guys, acting a like sick jerk, cheating with your true love, and being selfish. It must be so hard that the creators didn't know how they didn't make a strong point of what purpose did Kick-Ass ended. Do they forgotten?",
      "total_reactions": 6,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "The attack of the hollywood sequel strikes again. Not sure if it was blind luck the first time around but I have watched the original a dozen times. One of my favorite movies. Kick Ass 2 is an absolute failure from beginning to end. How they could sully the spirit of the first film with such a pathetic follow up is beyond me. The person who wrote this movie should never get work again.  Not sure what all these glowing reviews are about. Starting to wonder if these are paid shill reviews. Noone could have possibly liked the movie that much.",
      "total_reactions": 3,
      "user": "Birdsht"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "I give it a 7.5 out of 10. If you are into mindless action and witty humor, this is just the right movie for you. But, if you grew up watching \"Schindler's List\" and often tend to look too much into details, then leave.",
      "total_reactions": 3,
      "user": "Munich"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "There are often times where a critics review can prove invaluable and times where the review bears no relation to the movie, the latter is very much the case with Kick Ass 2.",
      "total_reactions": 3,
      "user": "Horsey007"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "Kick-Ass 2 might be worth the 9 bucks to see. It's an occasionally enjoyable ~2 hours. This being said, it falls so flat as anything other than a slightly more \"adult\" run-of-the-mill superhero film. I know that comparing a movie to written source material is unfair, but what is lost in the transition from comic to screen is astounding. Gone is the gruesome, horrifying critic of superhero worship and the glorification of violence. This movie, rather, is a checklist of hero movie cliches, poorly filmed action sequences \"bad-ass\" one liners, and the complete lack of emotional depth from any source save perhaps Chloe Moretz's performance as Hit Girl/Mindy. What little lethality is on display is completely lost in the final scene, wherein a clash between two masked armies in a warehouse comes off more as a West Side Story dance fight than the logical conclusion of 90 minutes of gunfights, stabbings, and brutal beatings.",
      "total_reactions": 3,
      "user": "Riatsala"
    },
    {
      "neg_reactions": 18,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "I looked up my review of the original and was more disappointed that I remembered. This sequel amplifies the serious side to the detriment of surprise and warped comedy. The titular character (nerdy cute and super cut Aaron Taylor-Johnson) is back as a human \"superhero,\" who's in a moral dilemna with his purple-haired partner (Chloë Grace Moretz). Should they give up their vigilante crime fighting or amp it up? The drama takes even more prominence to the detriment of the action. There's almost none of the original's fun and the fights are flashy, but cruelly violent. This film isn't sure what it wants to be, so it's a leaden dud. NOTE: Stay thru the credits for one more bad gag.",
      "total_reactions": 26,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "I love the first Kick Ass, and even though this sequel wasn't as good, Kick Ass 2 was still a very entertaining movie. I would say the biggest downfall was that the director completely missed the heart of the original. However, the action was great, and the humor just as good. I really liked all the new characters in this film, because each was unique and brought a different perspective on vigilante super heroism. Of course, Hit Girl was the best part, but I would disagree with many that she was the only good part. If you are a fan of the first, I guarantee that you'll like this one.",
      "total_reactions": 7,
      "user": "jlplatten"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "This movie was better then expected. I expected this movie to have more bad words in it but in the movie they tried to stop saying those words in the movie The transitions we're like comic transitions. The only bad part about this movie would have to be the violence. There was a lot more violence then the first movie.",
      "total_reactions": 7,
      "user": "Lagamedog"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "There are so many things I'd like to say about this movie that I'm finding it difficult to choose what to begin this review with. Let's start saying that Kick-Ass is my favourite movie ever. A precious jewel of wit and originality, like no other movies. So I was truly worried, I feared that this sequel would disappoint me.",
      "total_reactions": 7,
      "user": "alikhan"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "One of the worst sequels of the past decade.Absolutely atrocious. Jeff Wadlow doesn't do anything even half as well as Matthew Vaughn. Anyone who actually enjoyed this \"film\" doesn't know anything about quality cinema.",
      "total_reactions": 4,
      "user": "RandallAudrain"
    },
    {
      "neg_reactions": 22,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "Probably the year's second worst film other than GI Joe. The movie is filled with a stupid plot and even stupider dialogue, with every line trying to be a cheesy one liner. Cliche action scenes that are thrown in for no reason whatsoever make this a great movie for geeks with low attention spans. Obviously the audience will like this movie, as the audience never has any idea what the hell they are talking about. They want a movie that has no regard for realism, a movie where they can shut there brains off and zone out like a drunk 5 year old, and don't care about any sort of consistency. Bottom line, do yourself a favor and do not see this movie, and if you do see it, don't even trick yourself into liking it. You risk insulting your intelligence.",
      "total_reactions": 29,
      "user": "TimeisCereal"
    },
    {
      "neg_reactions": 27,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "Worst, non-superhero EVER!!! Movie about annoying teenagers doing bad,bad tricks, and trying to act like adults, the girls is pretty hot tought (I´m 15 lol), still it´s dreadful movie",
      "total_reactions": 33,
      "user": "BlondishMist"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "This movie was amazing best movie ive seen all year what are these critics thinking saying that its one of the worst movies this movie was amazing Just as amazing as the first one",
      "total_reactions": 12,
      "user": "Kickass"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "I really liked the first one. It was fresh and great seeing an R rated superhero film. But this time around it feels almost derivative. It's still fun watching everyone kick the crap out of each other, but the pacing and forced plot points take a lot away. Still enjoyable, just nowhere near as good as the first time around.",
      "total_reactions": 11,
      "user": "tropicAces"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "Fun popcorn film.  Not necessarily as good as the first Kick Ass, but that was a hella-good movie and hard to equal.",
      "total_reactions": 1,
      "user": "BUTCHYPIE"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "Like many sequels in the movie world this is just missing that special something that made the first so excellent. What I liked so much about the first movie is that it was a teenager trying to be a superhero in the real world. This sequel takes the first movie's real world and males it feel more like a comic book world. Due to that I feel it loses something.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "I'll start by saying I enjoyed this one more than the first and I was a big fan of the first. The story isn't as strong as the first, but it's also not bad. The action and humor is even better which wasn't to be expected. Kickass 2 is pure entertainment. If you enjoyed the first then you will love this one. Give it a shot, you won't be disappointed, the critics are wrong on this one (like usual) so don't pay any attention to them. 7.5/10",
      "total_reactions": 1,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "no reason why critics should be bashing it this hard. just another man of steel.  critics are seriously just stupid and bitter these days, you cant trust them anymore. just watch it for yourself so you can see what these idiots are talking about.",
      "total_reactions": 2,
      "user": "cypheonu"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Kick-Ass 2 is an action film of 2013 directed by Jeff Wadlow (Never Back Down) with Chloe Grace Moretz, Aaron Taylor-Johnson, Christopher Mintz-Plasse and Jim Carrey.",
      "total_reactions": 2,
      "user": "Mad_Hatter91"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "Kick-Ass 2 is a very good movie but it fails to capture the essence of the first film. The first movie was successful for two main reasons. For one, the brutality and in-your-face factor was incredibly high and created a certain \"shock and awe\" that left a lasting impression on the audience. The second was the film's refreshing take on the superhero concept. Both of these elements were either lost or severely diminished in this sequel. To cover the shock and awe, it just didn't have it. There were nowhere near as many scenes that made your peel away and get engaged at the same time. I think a big reason for this was the diminished role of Hit Girl. That's not to say that Chloe Grace Moretz' character, Mindy Macready, doesn't get appropriate screen time. If anything, the opposite is true. At times it almost felt as though she was the main character and the driving force of the film. The problem is that Mindy Macready, though Moretz is a fantastic young actress, is not refreshing or profane enough to deliver the effect Hit Girl does. As for the superhero perspective, while the first film felt refreshing, this film almost felt \"spoofy\" at times. In both cases, I think the directorial and screenplay change from the first film are at fault. Jeff Wadlow clearly had a different vision than many fans, including myself. One last negative, I hated the break in continuity from the movies by changing two characters, albeit they are fairly minor. Detective Marcus Williams (the black cop and friend of Big Daddy who becomes Mindy's care-taker at the end of the first film) and Todd (the less-important friend of Dave) are both played by different actors and neither feels right. Overall though, I hope it doesn't sound like I didn't enjoy this film. Moretz was amazing and Aaron Taylor-Johnson and Christopher Mintz-Plasse both do adequate jobs in the more tradition protagonist and antagonist roles, respectively. The action was really cool and the plot had tons of potential and largely lived up to it with the exception of the aforementioned flaws, in my opinion. If you loved the first film, you'll still probably enjoy this one quite a bit. If you found the first movie offensive, that feeling will not change here.",
      "total_reactions": 1,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "I thought the first Kick ass film was good.",
      "total_reactions": 2,
      "user": "Beast73"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "I've noticed that in most cases, critics give poor scores to movies/games deserving good scores and they give good scores to movies/games deserving poor scores. Basically, whatever the critics say, expect the opposite. Kickass 2 was a brilliant successor to Kickass. It was the \"good\" wanna-be's vs the \"bad\" wanna-be's which is exactly what I was hoping it would be. The only thing that threw me off was the disappearance of Kickass' girlfriend. She was never really mentioned in this film.",
      "total_reactions": 1,
      "user": "Rakkul"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "the movie is funny as hell, I never see so people laughing every second, me and my friends laughed all the movie, the movie  isn't an improvement from the first one in story sure. but the so many funny part,",
      "total_reactions": 1,
      "user": "idohaker"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "It never quite reaches the level of emotional weight that its predecessor did, but \"Kick-Ass 2\" is still a worthy addition to a lovably irreverent franchise filled with perpetually characters.",
      "total_reactions": 1,
      "user": "Compi24"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "A film in the category \"Unnecessary continuations\".",
      "total_reactions": 1,
      "user": "Nobilis1984"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "After watching \"Kick-Ass 2\", you begin to realize how much this franchise is making it's own rules, deviating from source material isn't necessary uncommon traits in superhero flicks, but for as silly as this franchise gets I'm still having a very fun time.",
      "total_reactions": 5,
      "user": "George-roots"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "The first Kick-Ass told the story of what will happen if you choose to put on a costume and fight crime, it was a realistic version of a superhero story and those were the reasons why I loved the first Kick-Ass. So I was really excited for the sequel, the movie was really good but don't expect it to be better than it's predecessor. The shows that Kick-Ass and Hit-Girl have started a revolution, there were a lot of superheroes popping out and some of those heroes, are joining the team that was formed by Jim Carrey's character. Kick-Ass joins his team and they started to clean the streets but unfortunately Christopher-Mintz-Plasse is still pissed at Kick-ass for what he did to his dad and decides to create his own army. Aaron Johnson is still good at playing his character and he was also good with the dramatic scenes. Jim Carrey was good as well even though he didn't like this movie but he should be proud of himself for playing an awesome character. Christoper-Mintz-Plasse was also good on playing the villain, but the one that always steals the show like with the first movie is Chloe Moretz. She was really good on the dramatic and action sequences and she always steals the show in every scene that she's in. The action scenes were good but some overused shakey cam and I still don't know why they used that thing. The movie was a bit rushed and that's why some dramatic scenes didn't work for me. Kick-Ass 2 was still a good movie but not better than the first one, I am going to give Kick-Ass 2 a 9/10.",
      "total_reactions": 1,
      "user": "jetstar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "This is critically a bad film... that's because critics are just a bunch of stuck-up w*****s who can't handle a little crudeness.  Yes this film is crude, but for a film entitled Kick-ass, what do you expect.",
      "total_reactions": 1,
      "user": "That-guy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "I would have to say that I loved the original Kick-Ass and I thoroughly enjoyed the sequel.  I thought it was very well done.  I just miss Nicolas Cage.  He was such a lunatic and way better then the new leader of the pack.",
      "total_reactions": 1,
      "user": "Babaloo2U"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "Unlike films such as Iron Man 3, this film doesn't try to be something that it isn't, and I applaud the filmmakers for being unapologetic for the story they told. This movie is a hell of a lot of fun and builds firmly upon the spirit of its predecessor. Loved it, and really hope we get the chance to see Kick Ass 3.",
      "total_reactions": 1,
      "user": "LMIjdnicholas"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2016
      },
      "score": 5,
      "text": "About midway through Kick-Ass 2, the sequel to 2010’s normal-guy-becomes-a-crime-fighter fantasy, a budding archrival corners the new girlfriend of his costumed nemesis. “You’re done banging superheroes, baby,” he sneers at the terrified teen. “It’s time to see what evil dick tastes like.” That line, pulled verbatim from Mark Millar’s Kick-Ass comic-book series, tells the uninitiated everything they need to know about the franchise’s controversy-courting mastermind. A savvy huckster provocateur, blessed with Jerry Bruckheimer’s blockbuster instincts and Bret Easton Ellis’ gift for pissing people off, Millar has conquered the cape-and-cowl industry by putting \"edgy,\" attention-grabbing spins on superhero mythos. This second adaptation of his flagship title pulls back a little on the showy repugnance of its source material; the unsavory scene described above, for example, ends with a performance-anxiety joke instead of a rape. Yet even with its edges sanded down, Kick-Ass 2 is unmistakably Millaresque—a juvenile comedy of excess, in which skewering adolescent power fantasies looks an awful lot like indulging in them.",
      "total_reactions": 1,
      "user": "Cinemassacre94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2013
      },
      "score": 5,
      "text": "Every aspect of the film is a bit more extreme than you expect it to be, but that's exactly what it's going for.  I simply don't think it's much better than the first film, which didn't particularly thrill me.",
      "total_reactions": 0,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "Kick-Ass 2 is a fun, throwaway sequel. Is it as good as the original film? No. But there is still a whole bunch of fun stuff on offer here. Christopher Mintz-Plasse in particular is a riot as the main super-villain. A fun yet slightly inferior sequel.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "I’d not heard great things about Kick-Ass 2 prior to watching but for me it delivered pretty much what you’d expect from a sequel, namely much of the same thing. Of course that means it doesn't have the originality of the first movie, and overall it is not as entertaining or funny, but it provided a decent hour and a half of entertainment.",
      "total_reactions": 0,
      "user": "drlowdon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2013
      },
      "score": 5,
      "text": "Kick Ass was a risque superhero movie that pushed boundaries and created controversy. Kick Ass 2 tones it down and by doing so loses some of the flair that made the original as great as it was. When Dave Lisewski (Aaron Taylor Johnson) returns to his alter ego Kick Ass, he joins a new league of heroes including Colonel Stars and Stripes (Jim Carrey) and Night  (Liddy Booth). Meanwhile Hit Girl (Chloe Grace Moretz) tries to fit in during high school while fighting her desire to suit back up. Kick Ass 2 is a very different monster with a similar filming approach to the first one but the characters are different, the writing isn't as sharp and Hit Girl isn't quite as impressive as she was 4 years ago. The new characters pale in comparison as Carrey's Stars and Stripes is more of a cameo than a supporting role and Night  while amusing plays almost exactly the same role as Lyndsy Fonseca's from the first film (she does return for a blink and you will miss it cameo but its not the same). While not dire, Director Jeff Wadlow's idea of this world is Kick Ass Lite with toned down violence as to appear sanitized, insults that sound rude but cannot compare to the controversial and ballsy ones of the first. It's all half measures as to be safe enough to sell the film to a younger audience who probably shouldn't be seeing it. Ultimately its story is good and the film does take a few risks that really shock but its all a little late as the heart and soul of Kick Ass has been ripped out thanks to the directors odd decision.",
      "total_reactions": 0,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Not sure why the critics bash this movie so much. Of course it lacked the awesome surprise element of the first movie, but it was a consequential evolution of the story line, hit girl was still awesome, and I was greatly entertained!",
      "total_reactions": 0,
      "user": "CharlieBrown8"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2013
      },
      "score": 3,
      "text": "Half-ass 2 should be the name of this horrible sequel. A huge fan of Kick-Ass I went in with the lowest expectations possible off the crappy trailer. The only thing worth seeing this for is Jim Carey. His very limited screen time was the only thing that kept my interest. Steer clear of this one.",
      "total_reactions": 0,
      "user": "cFRESHlechner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "A highly solid sequel that tops the original in every way and form. The action is satisfying, the humour is timed well, the plot flows well and the violence hit the sweet spot between strong and sadistic. High recommended even if you didn't really have a thing for the first movie. Brilliant.",
      "total_reactions": 0,
      "user": "aznassassin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "I was expecting more of a comedy (based on previews) and what I got was actually a really violent movie with a pretty weak story. Obviously they try to be \"stupid\" with the story as if it supposed to be part of the comedy act but it really isn't funny at all... I did laugh a few times but overall was weak. The characters are decent enough but the movie falls flat. I say pass until it's done with theaters.",
      "total_reactions": 0,
      "user": "theoffice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "It's not quite as good as the first, but it still offers us plenty of crude humor and violent action. The thing is they don't really combine the two elements together as well as its predecessor.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "In a continued exploration of ultra violence and cartoon emotion, Kick Ass 2 leaps into action without a full sense of self awareness. Never fear, though. It manages to find itself in the second half. There's not much in the way of surprise, but you if the first film did it for you, this one has the same elements in spades.",
      "total_reactions": 0,
      "user": "MB1097"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "The movie is pretty average in the first half, all of that predictable stuff about teenage life, promises, giving up and so on. But later it becomes better and better. Overall not as good as the first one though. There are some new cool characters like Mother Russia or Colonel Stars and Straps. Don't know what else to say, just slightly worse than the original.",
      "total_reactions": 0,
      "user": "StaticSpine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "Tanta expectativa em volta desse filme que fiquei decepcionado com o resultado, o primeiro foi interessante esse aqui  uma humilhação para obra original.",
      "total_reactions": 0,
      "user": "Iky009"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "For a movie called kick ass, it is pretty average. The reason why it is average is because very large sections of the movie are taken up by trivial teenage/family/friend issues and it is kind of slow and boring. In addition, this kind of leads to a lack of action scenes and it does not necessarily help define the villains in the film either. What I liked about the movie were the scenes involving the justice forever team and Jim Carrey added a lot to that as well. In conclusion, there are things to like about this movie, but there are too many unnecessary slow parts (no action) and it is why it is difficult to say that this movie is kick ass.",
      "total_reactions": 0,
      "user": "njkk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "While the violence that made the first movie so memorable is there, the charm is clearly lacking. Big Daddy is replaced with another engaging character, Colonel Stars and Stripes, who is underutilized. Hit-Girl is grown up and looks good. Kick-Ass himself has worked out and it shows. But the positives end here. The main villain is sort of funny but is not very compelling. The plot goes nowhere. The fight scenes are good but not up to the level of the first movie. The movie lacked direction. There was no overarching story that bound all the pieces together. It was a mess.",
      "total_reactions": 0,
      "user": "Swati"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "I'm a big fan of the first Kick-Ass and to say that this was an improvement on that one is quite big! More Action, more characters and more entertaining; everything was improved and the end result was one very impressive sequel! The young talents of both Aaron & Chloë are amazing and they lead this film, but its also the characters that make the film what it is. It's also still quite violent for a film that seems aimed at teenagers. Overall highly impressive and well worth checking out!",
      "total_reactions": 0,
      "user": "survivorfan989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2014
      },
      "score": 1,
      "text": "The first one was awesome and funny while still acting seriously, it was really unique in terms of its premise, script and soundtrack and the fact that some of the stuff managed to shock so many people, it had great acting and really awesome action scenes, even if it had a low budget it rarely showed it. You go from that to Kick Ass 2 where it borrows from everything other movie, there is not as much gore, the acting of almost everyone was laughable - talking to you Christopher Mintz Plasse, the soundtrack was pretty lame compared to the first movie, the action sequences were average at best (mostly just boring full shots of everyone with a lot of camera shake added for \"intensity\"), the fact that the writing is so stupid and all over the place, any new characters added seemed to turn into stereotypes (Brooke and co' turn into the typical Queen Bees to the point of ridiculousness), and the characters from the first movie get completely changed (for the worst) Dave goes from a typical comic book nerd to a knobjock douchebag, Mindy has completely softened in terms of viciousness (say goodbye to the sadistic little girl from the 1st movie), Katie, the really nice supporting girlfriend suddenly does a face heel turn and turns into a psychotic **** and Todd (who was recast) goes from the quiet kind of dumb guy to an extremely stupid, perverted creep. And I would like to add that with the exact same budget of the first movie, the second one felt like B grade direct to dvd flick all the way through. Lazy, lazy, LAZY film making.",
      "total_reactions": 0,
      "user": "Stabs_with_Pudz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "Amazing,brutal humor,one moment i was laughing on floor and oder i was almost crying, awsome script, perfect villians (esspecialy mother russia) i hope there will be kick-ass 3",
      "total_reactions": 0,
      "user": "kobenator24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "The original Kick-Ass was new, funny and original.  Kick-Ass 2 is the same old stuff from the first one.  Boring and to be honest, not that funny. It seems as if the writers ran out of material and just decided to kill everyone.  It's predictable and a waste of time.",
      "total_reactions": 0,
      "user": "TheRyanMcNeil"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2014
      },
      "score": 6,
      "text": "I absolutely loved the original Kick-Ass. It was witty, brutal, humorous, and the best movies of that year. When I heard Kick-Ass 2 was going to be released, I was jumping with joy, and my expectations were high. Unfortunately, they were far from met. The second movie was filled to the brim with annoying crude humour, awful dialogue, mediocre action scenes, and cliche scenarios. Now I admit I was somewhat entertained throughout the movie, and as far as mindless action movies go, this is far from the worst. Just don't expect anything better than a mindless action movie, and certainly don't expect a movie even close to it's brilliant predecessor.",
      "total_reactions": 0,
      "user": "BobCat51"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "Not even going to pretend the pretentious so-called 'critic reviews' are worth even a small particle of my attention. They suck huge monkey balls, and that's just that. This movie is by far one of the greatest movies I've seen the entire year, comes real close to the first. Which leads me to think, if you liked the first, you'll love the second. Go for it.",
      "total_reactions": 0,
      "user": "Gamer147"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "This is as real as a superhero movie can get, this is freaking awesome and I can't wait to see hit-girl and kick ass in part 3. It's time to end the series on a high note.",
      "total_reactions": 0,
      "user": "solecookie18"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "I really dug the first film and was excited for this one.  Despite hearing some bad talk about it and seeing Jim Carrey disown the film due to his own morals and ethics, I have to say I thought this movie was just as slick, cool and entertaining as the first one.  It was nice to see new faces added to the world of “Kick-Ass” and it was nice seeing Aaron Taylor-Johnson get to be a bigger presence in the story (let’s face it, Hit-Girl stole the first movie).  I also really dug the evolution of the characters of Kick-Ass and Hit-Girl and the hyper-violent fight and action scenes are just expected from this franchise but just as entertaining as they were the last time around.  While the story got a lot darker than it did in the last movie (of course, the comic gets even darker), I still thought “Kick-Ass 2” was a great sequel to an already cool movie.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "Kick-Ass 2 is an insane, fun ride, even if it doesn't compare to the original, this one lacking shock value. The performances are decent, the stand-out being Chloe Grace Moretz who is one of the best young actresses working in the industry today, and the story is fun. It's easy to have a great time at Kick-Ass 2.",
      "total_reactions": 0,
      "user": "CheapSeats"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2014
      },
      "score": 3,
      "text": "unoriginal sad redo of the same tricks of a already over done concept . Super fans ya'll need to learn to be objective just because you like it doesn't mean it's a good movie . My favorite movies are Godzilla movies and they are not filmed or acted good .",
      "total_reactions": 0,
      "user": "dyshpo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2013
      },
      "score": 4,
      "text": "Despite some brutal action scenes, this film is generally barren of the ironic twists that made the first film successful, and relies on more gag humor this time around, and a rehashed script that's been pulled off more effectively in the past.",
      "total_reactions": 0,
      "user": "SuperheroMovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "The movie was hilarious, Had really good action and was surprisingly also very emotional. The plot was very... different compared to the first movie  But the acting was great and the movie was a blast to watch.",
      "total_reactions": 0,
      "user": "shrey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "Sadly I had high hopes for this movie but after hearing that Matthew Vaughn was leaving and having Jeff Wadlow replace him i knew that the film was going to be lacking from the first installment and i was right. Story was weak but that's not really what this movie is about. The fight scenes is what we came to watch and with that this movie does deliver. Jim Carrey was great he did an awesome job i don't get why he tried to distance himself from this movie sure it's violent but at least it's better then anything he has been in a couple years. Again Chloe Moretz was the best part of this movie she is just so amazing. If you loved her in Kick-Ass then you are going to love her in this sure she isn't in her costume the whole time but if was cool seeing her in high school acting like a somewhat normal kid.",
      "total_reactions": 0,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "I loved this movie it was so funny and had cool action fights a adore this movie it rocked i think it was a good squeal witch was just as good or better",
      "total_reactions": 0,
      "user": "Jacethegamerman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2013
      },
      "score": 4,
      "text": "The first film is far superior to this one. On this one they dropped the ball big time.",
      "total_reactions": 0,
      "user": "JeradPlimco"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "Although I'm a huge fan of all things Mark Millar, I went in to the show with fairly low expectations. Which was probably for the best. Kick-Ass 2 does a much better job at following the comic books than the first film did and at the same time filling in the plot holes the first created. The parts that were left out are understandably so, i.e. the rape of Kick-Ass's \"girlfriend.\" Overall I was fairly surprised with the movie as a whole and would recommend seeing it if you enjoyed the first one. If the first one didn't float your boat don't expect this one to.",
      "total_reactions": 0,
      "user": "Th33nd1sN1gh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Kick-Ass 2 was such a fantastic movie, watched it five times already and going to see it again tomorrow, it was so good that I can't stay away, some things were very unexpected and such a great ending. The fights were so intense that my heart was beating so fast, I'm not a very action person but this was just on another level, it wasn't constantly fighting, there was a story behind it and that is what I love. There was some funny parts, sad parts and just breathtaking parts, it was constantly leaving me on the edge as I just didn't know what to expect. There was scenes where I felt like shouting at the screen but then it took me by surprise. Such a brilliant film, cannot wait for it to be released on dvd as will be watching time and time again.",
      "total_reactions": 0,
      "user": "SophieGLouise"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2013
      },
      "score": 5,
      "text": "The sequel was never going to be as good as the original, but I didn't expected to be this flimsy and quite frankly embarrassing at times. Far too many inspirational speeches etc. and not enough genuinely cool moments, the kind that covered Kick-Ass 1 like a very welcome rash. A poor return to the series that has its moments, more bad than good, unfortunately.",
      "total_reactions": 0,
      "user": "zzirGrif"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2013
      },
      "score": 4,
      "text": "Awash in a summer of sequels and comic book movies comes Kick-Ass 2, sequel to the well received cult classic of three years ago. But where Man of Steel or The Wolverine take themselves seriously Kick-Ass offers something of a deconstruction of the superhero genre, whilst fulfilling every comic book fan's fantasy of donning a costume and taking to the streets.",
      "total_reactions": 0,
      "user": "Jack_Sunshine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "I really don't understand where the critics are coming from with this one. How on earth did 1Direction (or however the hell you spell it) get a better score than this movie. That is just so unreal. Sure there were a couple flaws here and there and like ONE thing that I didn't particular feel was executed the right way. But the story was a good adaptation, and I love the improvising aspects of taking the artistic liberty to deal with Hit Girl/Mindy's obviously matured person. The fight scenes  shut up, Angry Joe!  were good. I had no complaints and actually enjoyed that they looked more realistic than the first one that was more artistically choreographed. I had no complaints and thought that this movie was made very smartly, considering what they had to adapt from. Thumbs up on my end.",
      "total_reactions": 0,
      "user": "BloatedNani"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Recently saw this in the Cinema, had high expectations as the first one was brilliant, it was good, but not as good as its predecessor. a positive point is that it doesn't take itself too seriously, very fun and a good laugh, worth a watch.",
      "total_reactions": 0,
      "user": "callummorris"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "Very odd to see such a low critic rating for such an amazing movie.  Rarely do movies make you feel, laugh, sit on the edge of your seat, and make you want to re-watch it seven or eight more times.  It's even debatable that this one is better than the original.  It is certainly more funny, and more action packed, what critics didn't like is the lack of innovation.  I thought they already innovated enough with the first one to carry over to this sequel and still make it great.  Can't wait for the third.",
      "total_reactions": 0,
      "user": "Phenominaljard"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "a piece of advice for you, avoid the critics on this one. the typical movie critic will probably see 1 or 2 movies per week. now, i don't know about you, but watching the same mediocre stuff after a while will get boring. watching someone getting eaten by a shark or be disemboweled from the insides of a car by a lawnmower engine become cliches. Kick-Ass 2 is a movie for the fans purely. do not go into this movie expecting the next dark knight rises or man of steel, because it isn't. it isn't deep, it isn't complicated, and it isn't a masterpiece. and that's all the reason better to watch it and love it. the main problem with super hero movies now a days is that having the main protagonist cracking a smile is the equivalent of shooting yourself in the knee. in a world filled with dark, grit, modern, and deep, it's good to see kick-ass 2 be what it wants to be. is it gory? yes. is it morally questionable? yes. but is it these things because that's what is popular or that's what is making money? no. Kick-Ass 2 does what it wants with no restrictions. is it vulgar, bloody, gory, sick, twisted, vile, and radical. 110% radical. if you are the type of movie viewer that you can't stand it when they don't get the backgrounds of \"captain stupendous\"'s backstory right, you should not view this movie. if you are a fan of cult classic action, gratuitous violence, and fun, then you are welcome to a great movie",
      "total_reactions": 0,
      "user": "PulpNonFiction"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2013
      },
      "score": 3,
      "text": "La vibra del universo de la primera parte de esta aventura se perdió y se convirtió en una cuestión muy comercial y genérica.  Por tal razón, es que al mismo tiempo le reconozco al director y escritor su conocimiento en cuanto al fluido del mercado de esta industria.  Y es que lo comercial a la mayoría de las personas le agrada, pero hay que entender que es un acto poco original.",
      "total_reactions": 0,
      "user": "Joselo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "Es una película totalmente destacable, llena de risas, malas palabras y momentos de inspiración. Tiene esos puntos de inflexión que a uno casi lo hacen llorar. Recomendada 100%",
      "total_reactions": 0,
      "user": "hugomarin69"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "why is this got so many low rating on both rotten tomatoes and metacritic it's entertaining from start to finish the only problem is the shaky cam and the one liners ain't as good as the processor but other then that just a really entertaining summer film",
      "total_reactions": 0,
      "user": "ilovemovie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "It is still a little short but the plot is still spectacular, if it had been different would be better chelates counted first, Kick-Ass, it shows that what worked was more of Violence Movie",
      "total_reactions": 0,
      "user": "TheKingBirdMx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "good movie. its funny and violent and the story is cool. It is not as good as the first one but it is still really good. if you liked kick ass 1 you will probably like kick ass 2",
      "total_reactions": 0,
      "user": "jacobmmmccc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "I'm so torn about this. I loved the first one. But Kick Ass 2 wasn't as good as its predecessor. What  annoyed me so much about Kick Ass 2 was the incredibly blatant and cringey product placement of that annoying Union J boy band. Ugh!",
      "total_reactions": 0,
      "user": "maisie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "Kick-Ass 2. The sequel to my favorite movie, Kick-Ass. Although Kick-Ass is tied with Donnie Darko. Anyways, Kick-Ass2, I expected some great things from this movie, because of how good the first movie was, but, Matthew Vaughn did not return to direct, but, he was a producer. This was a bit concerning, as I noticed that the new director was none other then Jeff Wadlow, who directed Never Back Down and Cry Wolf, both of which were pretty bad. There were more positives than negatives in this movie. I liked how they developed the relationship between Dave and Mindy, plus the introduction of 'The Motherf*cker' and 'Coronel Stars and Stripes' was pretty cool. Although this movie seemed a bit dumbed down, and much like 2 Fast 2 Furious, it feels as if they tried to do too much at once. Developing many characters and side events in a fairly short amount of time, leaving you out of breath trying to analyze everything that is happening. The main problem with this movie is that much of the comedy was replaced with profane and unnecessary violence, that takes away from the original vibe of the first movie. This seems to have been done for shock value, when really it is just gratuitous and unsettling, it is kind of a buzz kill actually. In the end, this movie was a decent sequel, that fell short from the original, but was still enjoyable, 7/10.",
      "total_reactions": 0,
      "user": "Lelandskell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "Never trusted critics, never will. Why you may ask? They are wrong on almost every aspect of what a fun movie should be, I left the theatre extremely satisfied of how awesome this truly was, a great sequel that most can't accomplish but this definitely did the job right. Characters, story, action, revenge it was all there. Only small gripe *SPOILERS* Jim Carrey a.k.a (Colonial Stars & Stripes) who was an ex mob enforcer, died a little too fast in the film even though he had such a badass role it's really a shame. Yea shaky cam these days needs to die off completely, example: (Alex cross) Please don't witness the action sequences, you won't know what the hell is going on it's just all over the place, If you know what i'm talking about then you know what I mean. But here It's great, the fight choreography was done very well there's really nothing more you can ask for, I still kinda wish the movie didn't pace as fast and instead focused a little more on character development and emotion throughout like the first since they pretty much nailed that aspect. Overall I love this movie to death even with it's short, small problems because it didn't take away the experience for me, it actually grew the more I saw it. It had it's serious/funny moments and it blended out really well, It's sort of a Dark Knight of the Kick Ass Movies if you think about it. I'll be buying this on Blu-ray first day, It will have tons of special features, also ones exclusively on Blu-ray with extended scenes, an alternative opening, and 2 hours behind the scenes like the first movie had! Bottom Line........ HIGHLY RECOMMENDED :D 10/10",
      "total_reactions": 0,
      "user": "Dfre"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "This film is decent and entertaining. The main flaw is the message that these characters are real heroes and not in a comic book and yet the action, dialogue and characters seem right out of a cartoon.",
      "total_reactions": 0,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "I think the movie loses the point on whether it wants to be serious or humorous. But even though it mixes a bit of both together, it still works and the movie is still very enjoyable.",
      "total_reactions": 0,
      "user": "arvintaylor138"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "Actually better than Kick-Ass, more heroes, more baddies! Also the plot is superb and funny! I swear I got the package witth this film! Second best sequel of 2013 (one is Despicable Me 2) 10/10",
      "total_reactions": 0,
      "user": "deadappl3critic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "I think some people don't know the style of Kick  Ass and think that the movie it's so action, action and action, but in Kick  Ass 2 you have a \"bonus\" of the first Kick-Ass, it's a very good continuation, the movie continue the story very well, but in Kick-Ass style, ahh, one thing that is important, Chloe Moretz ;D",
      "total_reactions": 0,
      "user": "Paulo_Jorge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2013
      },
      "score": 6,
      "text": "Kicks nearly as much ass as it's predecessor, but isn't quite as original. What makes it worth the watch is what made the first one good, great fight scenes and dark humor.",
      "total_reactions": 0,
      "user": "KaptainHutchino"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "Awesome movie!! The action sequences are very well directed plus the story was amazing. All in all the movie was really a treat. I hope they come up with a sequel.",
      "total_reactions": 0,
      "user": "kk90"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "Kick-Ass 2 packs a serious punch it is filled to the brim with action brings back childhood dreams of one day being a superhero with just a little bit more violence then a child would imagine. Anyway if you like batman type superheros watch this movie. Unfortunately the script writers attempt at humor falls short of what you would from a movie titled Kick-Ass.",
      "total_reactions": 0,
      "user": "Ilovethemmovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2014
      },
      "score": 5,
      "text": "This movie, while certainly not bad, is nowhere near as good as the comic or the original.",
      "total_reactions": 0,
      "user": "Hunnoycombe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2014
      },
      "score": 4,
      "text": "A light-hearted comedic romp into the pseudo-super-hero genre that quickly descends into torture-porn at an alarming rate. Anybody who is this desensitised to violence to find this funny should take a serious look at their life and make changes.",
      "total_reactions": 0,
      "user": "xolve"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "Kick-Ass 2 was an alright film, although it was so incredibly bizarre for a superhero film. I'd say it was just a parody, if there wasn't a comic it was based on.",
      "total_reactions": 0,
      "user": "chw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2015
      },
      "score": 8,
      "text": "It may be not as funny as the other one but,it was way more violent and action packed than the first.Overall, the movie was not as good as the first but, it's still a solid sequel.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2014
      },
      "score": 6,
      "text": "Not as good as the first one but still a bit entertaining. Some good action and violent scenes, but not nearly as many as in the first movie. Could have been way funnier than it was. It had Jim Carrey in it who is really funny so they could have added many more jokes and it would have made the movie great.",
      "total_reactions": 0,
      "user": "Viper8787"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "Like many, I was not convinced of the commercial gimmick to make a sequel to Kick-Ass , given that the director had been entrusted to Jeff Wadlow ( director of the abomination of Never Back Down ) and that the original was already a perfect movie , without the need for any sequel.",
      "total_reactions": 0,
      "user": "JekSpacey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "First of all I think the critics were way too harsh on this movie, I loved this movie and it's a worthy sequel to the first.  Funny characters, great plot and the action was awesome.  I give this move a 8 out of 10 and the first is a 9 for me.",
      "total_reactions": 0,
      "user": "MovieGuyJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "This movie clearly shows, that those \"critics\" on the left are clueless what the real moviefan wants to see.",
      "total_reactions": 0,
      "user": "Esteran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Kick Ass 2 is just as good as the first film. Its a super hero movie that is slightly different from all the comic book movies out there. Kick Ass is full of some great young actors. I would've liked to have seen more of Jim Carey but he didn't appear to show much interest in this movie. There are a few twists scattered all over in this movie and it may not exactly work out the way you expect it. Kick Ass is just as good as any Marvel film.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "Bakwas movie! Only reason it made 100cr+ quickly is because it was released in Eid. Salman needs to sign better films, he deserves far more better films than this 100 cr flop movies.",
      "total_reactions": 0,
      "user": "samirshah"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "I really don't get why this film gets as much hate as it does. to me it was same great Kick-Ass style story that I enjoyed the first time. granted it's not as great as the first one and there was room for improvement but the action sequences and villains were good and i actually can tolerate Jim Carey for the short amount of time he's on screen",
      "total_reactions": 0,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "Summary: Kick-Ass 2 is not as genuine as its predecessor, but it's still entertaining, violent and funny. 61/100 [C+]",
      "total_reactions": 0,
      "user": "GuillermoBM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2015
      },
      "score": 4,
      "text": "Kick-Ass 2 es decepcionante, aburrida y un mal chiste. Todo el humor negro, todo lo bizarro, todo lo violento y todos los personajes son arruinados en esta segunda parte, se siente como si fueran 2 películas en una, primero esta Kick-Ass (una trama aburrida y absurda) y después esta Hit Girl (intenta ser una chica normal, y las situaciones son ridículas) las escenas de acción son mas violentas pero la coreografía y la edición son un desastre. Kick Ass 2 me decepciono, tiene uno que otro momento interesante (Como la escena del coche) pero solo eso, una película que prometía mucho y solo nos dejo decepción y mal sabor de boca.",
      "total_reactions": 0,
      "user": "JohnMasterL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "\"Kick-Ass 2\" 10 Scale Rating: 4.0 (Bad) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "I have mixed feelings about \"Kick-Ass 2\". The film doesn't hold up as well as its predecessor, for example. The action is OK I guess, but the plot is just really weird. Maybe the story isn't the problem: the execution is. The humor is again, really weird: you don't know whether to laugh or look away in disgrace. The cast is pretty fine, but some of the many, many new characters are just unnecessary and/or boring. Or stupider. \"Kick-Ass 2\" is not the kind of movie you hate, more like the movie you just don't watch.",
      "total_reactions": 0,
      "user": "UltimateBub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Kick ass 2 is an exceptional film I never really understood the critical backlash it has a lot of fun with the concept of a kid in high school becoming a super hero, kick ass 2 provided really likable characters and some very funny moments, the action was also competently choreographed and filmed extremely well.",
      "total_reactions": 0,
      "user": "TheDude-"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "It was a good movie, with a lot of action, some jokes and tons of violence. Not as good as the first and kinda silly (the adrenaline stuff), but was good enough.",
      "total_reactions": 0,
      "user": "Elmerz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2015
      },
      "score": 3,
      "text": "This movie, while an entertaining piece of mind candy, is inferior to the first Kick ass movie. While Aaron Taylor Johnson, Chloe Grace Moretz and the rest of a good cast try valiantly to make this movie go, no actor in the world could overcome the dialogue given them.",
      "total_reactions": 0,
      "user": "Cantandres"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2016
      },
      "score": 5,
      "text": "Ok.. because the first Kick-Ass was great enough, we didn't need a sequel to this. It's just a rehash from the first movie blending in camouflage so you wouldn't even notice it every single second.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2016
      },
      "score": 10,
      "text": "the first film was good and then the second one just made it the best film ever it has an excellent story line and it brings in more people who were excellent and chloe grace moretz playing hit girl her role in the film is just good because she has a sense of humor witch is funny and one of the funniest parts of the film is when she is at school and zaps those girls to make them throw up and poo them self. so chloe grace moretz once again you have made an excellent film.",
      "total_reactions": 0,
      "user": "zachary99"
    }
  ]
}