{
  "mc_avg_user_score": 5.8,
  "mc_metascore": 44,
  "mc_mixed_rating_frequency": 53,
  "mc_movie_name": "Killer Elite",
  "mc_negative_rating_frequency": 17,
  "mc_positive_rating_frequency": 42,
  "mc_pro_critic_reviews": [
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2011
      },
      "score": 80,
      "summary": "A macho, adrenaline-fix suspenser that plays like the bigscreen equivalent of those pulpy spy novels that once clogged grocery-store checkouts."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "This is actually a pretty good thriller, based more on character and plot than on action for its own sake. The need to construct killings that look like accidents adds to the interest."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2011
      },
      "score": 70,
      "summary": "This muscular thriller--led by Jason Statham, Clive Owen and Robert De Niro--strives to be a genuinely good film, but unwilling to let go of proven formulas, it falls short."
    },
    {
      "critic": "Rob Humanick",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2011
      },
      "score": 63,
      "summary": "Killer Elite is pleasurable enough, but with a steadier hand, it could've been one for the books."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2011
      },
      "score": 63,
      "summary": "A snarly Euro-thriller with crust under its fingernails and bad breath. It doesn't care if you like it, which is why I kind of do."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 63,
      "summary": "Despite having a perfect cast for a title like Killer Elite, Gary McKendry's feature debut comes across as little more than a generic Jason Statham movie with two high-profile guest stars."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 63,
      "summary": "Best of all, the filmmakers took the time to give these hard men just the right things to say - not catchphrases, just lines that smell of blood and gunpowder every time Statham, Owen or DeNiro utter them."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2011
      },
      "score": 60,
      "summary": "It's a generically enjoyable action film with a bit of hardboiled based-on-a-true-story-ness about it, and since it's set in the '80s and feels like an '80s movie, it seems a lot like something you must have seen years ago."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 60,
      "summary": "If you're willing to accept Killer Elite as a shoot-'em-up action movie with good actors taking the spots of the usual lunk heads (but spouting the usual nonsense), you'll be pleased with the film."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2011
      },
      "score": 58,
      "summary": "De Niro, in what amounts to an extended cameo, is radically miscast. That's still no excuse for his nonperformance, which is beyond lackluster."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 55,
      "summary": "The picture, the debut feature of Irish director Gary McKendry, is rote and joyless, an exercise in disposability."
    },
    {
      "critic": "James Adams",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Killer Elite's major problem: motion at the expense of emotion."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Loaded with careening car chases and rooftop runs, glass-shattering shootouts and exploding fireballs, Killer Elite offers more than enough to keep action junkies happy."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Killer Elite is based on a true story and about a half-dozen Jason Statham movies."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "The script is a mess. It's an object lesson in taking a nonfiction book (\"The Feather Men,\" about a cadre of ex-British Special Air Service operatives) and making a hash of it."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Killer Elite is too formulaic to overcome a been-there, done-that feel."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Killer Elite pretends to be fact-based and true to its 1980s period. Just know it's all baloney."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "There's nothing here for the viewer to do, no kinks to work out, no double-crossings to anticipate, not even a half-hearted flail at figuring out how Danny ticks."
    },
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "A few good stunts, some tolerable brooding and one nice, if silly desert chase. But not essential."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "When Robert De Niro, Clive Owen and Jason Statham unite for an action thriller, we should be able to expect something special. Or at least memorable. Instead, Killer Elite gives us ordinary."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "Killer Elite is distinguished by one no-mercy, eye-gouging, testicle-punching brawl, and one whoppingly indifferent screenplay."
    },
    {
      "critic": "David Fear",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "A few awesome firefights does not an action film make, and even De Niro's Ronin-esque interlude can't shake the feeling that the thrill, like the '80s, is gone."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 38,
      "summary": "I've got another portmanteau word for the movie: unbelievaballistic."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 33,
      "summary": "This clumsy action movie feels too generic to be real. The film attempts to add an element of sophisticated sociopolitical commentary to the typical Jason Statham head-busting shoot-'em-up, but only ends up draining it of visceral thrills."
    },
    {
      "critic": "Sara Maria Vizcarrondo",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 30,
      "summary": "We all have to make jokes around the water cooler, and if enough people bother to see Killer Elite, its silly nonsense could make for a great comedy routine by Greg from IT."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 30,
      "summary": "Pure punishment, this rote action flick from Australia."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 25,
      "summary": "Director-co-writer Gary McKendry seems to know a thing or two about hard-fisted fight scenes, but he muddies up the visuals with obligatory spasms of shaky-cam."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 25,
      "summary": "Killing looks ridiculously easy in this dispensable exploitation picture, directed for maximum impact of head-cracking pain by ad-trained Irish director Gary McKendry in his first feature."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 20,
      "summary": "Whatever the case, Mr. Owen and Mr. Statham (who provides a nice duet with a chair) make a prettily matched pair amid the pileup of sub-Bourne action set pieces, sad laughs and clichés."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "\"Killer Elite\" is a movie with the \"Punch First Think Later\" action formula that we all know. It's fun to see action veterans De Niro, Staham, and Owen jumping into the screen shooting and fighting each other, but their all kinda....outdated. You would watch it with your friends or yourself for manliness. If it is neither reason, just rent it. R) 4.7",
      "total_reactions": 2,
      "user": "AKoreanCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "I've seen better action movies than '' Killer Elite '', but it's still kinda good. I didn't wanted it to be average, I was hoping for more. Jason Statham, with Clive Owen and Robert De Niro was an exacting trio to watch. The acting from all the actors was perfect. The problems is that the characters weren't developed at all. I mean sure, it's an action movie, but it would have been better to know at least something about them. Also, there was really a lot of things going one. The movie is 105 minutes long, but you feel like it's 125 minutes long, just because of the huge amount of scenes. I don't care when some people say that Jason Statham is always playing in these types of movies. He's perfect for these type of roles. I don't remember once being bored watching one of his movies (okay, expect for '' Blitz ''). Why do you think he's constantly winning these roles ? Because he can bring something cool out of an assassin, a spy, whatever. He can pull it off. Nobody can mess with him, and oh yeah, and he's a complete bad ass. Plus, I really liked the 80 's mustaches, they were cool. Anyway, it's an average movie, but enjoyable at the same time.",
      "total_reactions": 1,
      "user": "scrieciu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "Killer Elite is just another benign thriller that doesn't let us in on its reason for existence. What really perplexes me, is why big names like DeNiro, Statham, and Owen chose to participate in this swill.",
      "total_reactions": 1,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2011
      },
      "score": 1,
      "text": "Jason Staham, lo crei, escuche el nombre de Clive Owen y pense solo es un error en la carrera de un actor en subida pero escuche el nombre de Robert de Niro, puede que sea de sus peores peliculas y esque Deniro ha tenido talento para que sus ultimas peliculas sean malas en todos los sentidos posibles. \"Killer Elite\" una farsa barata de una pelicula de espÃ",
      "total_reactions": 4,
      "user": "AdrianLuna"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "\"Killer Elite\" was fun and has a good cast, with very satisfying performances. Although it's not quite what you would call \"original\" in its story line area, (not that every movie we see has to be completely \"original\") Killer Elite keeps your attention.",
      "total_reactions": 3,
      "user": "xXRenTyrellXx"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "I do not know how anyone, and I really enjoyed the film.",
      "total_reactions": 3,
      "user": "LoveIsHell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "It's better that I thought it would be, but a criminal waste of DeNiro.  And the fact that it's supposedly based on a true story makes it overly complicated and overly long - at least it FEELS long.  Statham is Statham - nothing new to see here.  It's great seeing Yvonne Strahovsky (\"Chuck\") on the big screen, but she's also underutilized.",
      "total_reactions": 0,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2011
      },
      "score": 4,
      "text": "Bottom line: Despite, Statham, Deniro and Clive Owen, movie is bland, tasteless and formulaic story with decent visuals and old fashioned action sequences. I give C",
      "total_reactions": 0,
      "user": "sreekiran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "I felt it was a film that was trying to be too clever for its own good; what with bluffs and double bluffs going on left right and centre, you really didn",
      "total_reactions": 0,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "If your looking to scratch that action movie itch this is a great choice, it's got your gunfights, fight scenes, and explosions ready to entertain. Unlike others of it's kind it surprisingly great plot behind it that's only sweetened by the fact that it's based on a true story and has a main character who doesn't want to kill, but is forced into it by means out of his control, and honestly it's really refreshing to see a movie like this where the main character avoids pulling the trigger as much as possible. It's a great movie that has a few issues holding it back from being amazing like a romance that just feels unnecessary, and the occasional lackluster moment, but the lackluster moments are few and far between, and it's not the most unnecessary romance ever (Captain America still wins award in my opinion) but it still just seems like it's kinda just in the movie for the sake of having it. All in all if your looking for a great action flick with a great plot this is one of your best choices.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "Killer Elite is a fun action movie. It has some excellent 80's period detailing and sees Jason statham and Clive Owen go toe-to-toe in some brutal action sequences. It's not high art but it is good fun. The only real dull spot here is Robert DeNiro. The legendary actor seems out of place here and just seems... old.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "A good solid action flick. Paced well with an interesting sub plot the only thing it missed was a decent script to drive the relationships between Statham, Owen and De Niro. Shame - could have been a great.",
      "total_reactions": 0,
      "user": "hockerz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "The Killer Elite is saddled with a vague and forgettable title but at least it sounds more lethal than the book it is based on by Sir Ranulph Fiennes, â",
      "total_reactions": 0,
      "user": "CitizenCharlie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2011
      },
      "score": 6,
      "text": "A+ for fight scenes and action.",
      "total_reactions": 0,
      "user": "gleenobly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "Now this is a Jason Statham movie. Fun mindless action all throughout, and if you didnt go see this movie to see Mr. bada$$ Statham kick some Clive Owen a$$, and a whole lot of other unfortunate guys, well then no need to give your negativity, because thats what this movie was made for, to keep action fans happy. I loved this movie, definitely not the best action movie but towards the top of my list of Statham movies, but this movie was just pure mindless fun. A decent but pretty interesting story, which is apparently based upon real events. It keeps you entertained thats for sure, Robert Deniro was awesome and very funny at times. This is the most bada$$ ive ever seen Clive Owen, he was very good, and obviously Statham was Statham. If you love Jasons movies, or you just like a pure fun, action packed movie then go see this now. If your expecting to see the schindlers list, well then youre dumb (not to be mean but its true) Explosive from start to finish, must-see for all of my fellow action buffs. 7/10",
      "total_reactions": 0,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2011
      },
      "score": 0,
      "text": "Good lord this was a terrible movie. The dialog was pointless and full of cliche lines, fight scenes were hard to follow (in particular, the hospital fight was very choppy and filmed too close), the love interest was worthless and just slowed things down, and the plot turns on a killer getting a conscience.",
      "total_reactions": 0,
      "user": "suppressingfire"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "Killer Elite is a tough guy movie with some decent action and violence, but disappointing once everything comes to an end. The premise seems interesting and is supposedly based on a true story, but the story comes off as jumbled and pointless on the big screen. Directing his first feature film, Gary McKendry seems to not be able to handle the material and has a hard time presenting it to the audience. The movie he has created lacks any form of emotion or depth. Also, it doesnâ",
      "total_reactions": 0,
      "user": "Sir_Brandon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "\"Show me a beautiful woman, and I'll show you a bloke who's sick of her s**t.\"    Davies, Killer Elite",
      "total_reactions": 0,
      "user": "FilmDilettante"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "awesome movie, could be better and not original. (although they say its based on a true story).",
      "total_reactions": 0,
      "user": "kindzadza"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2011
      },
      "score": 3,
      "text": "Absurd, completely bollocks and boring. Those were the three things in my head when the credits rolled (BTW the best part of the movie, IMHO).",
      "total_reactions": 0,
      "user": "B3ckett"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "You would be foolish to go into a Jason Statham movie and expect more than..... well a Jason Statham movie but I think as far as his movies go this one was on the higher end of the scale. I found the plot interesting but it did feel long, with a running time of just under 2 hours, by the end it felt more like 3.",
      "total_reactions": 0,
      "user": "lgnburris"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2014
      },
      "score": 8,
      "text": "Every Jason Statham movie is better than the last, as he continues to cement his reputation as the action star of Generation X. Since it's domination of the late 80s, Action movies have really suffered due to a lack of decent story lines and an infestation of stars, who landed these roles, simply due to their size, but Statham is changing all that, as evident by his latest film, Killer Elite. Based on the novel, The Feather Men by Ranulph Fiennes, Killer Elite covers the events, following a British covert op in the early 80s. The British Navy Seals (The S.A.S.) secretly forced out oil rich land owners in the Middle East, by whatever means necessary, in order to steal their land. Five years later, on his death bed, one sheik is seeking revenge for the death of 3 of his sons. To do this, the sheik has hired an elite team of underground hit men to take out the men suspected of killing his children, not an easy task when you consider that all the targets are highly trained former military operatives. Jason Statham stars as Danny Bryce, the team leader who is forced out of retirement, to take on the hardest job of his career. As has become common place, Statham is terrific and really carries the story on his back. Killer Elite is a someone complicated plot, with a first time director, but thanks to Statham's experience, you'll think these guys have been working together for year. As his reputation has continued to grow, bigger and bigger stars want to work with Statham, and any time you can add names like Robert De Niro and Clive Owen to a film, it only enhances it and boosts it's potential audience. Aside from just the amazing action sequences and covert maneuvers, the story adds real life drama to the film, by including shady government cover ups, double agents, and even police involvement in the events, making for the rarest of rare in the Action genre, a film with a deep and compelling plot. That's what really makes this film so good, it's not just about the chases, explosions, and killing, there is a real story here, that is unpredictable and very well written. Killer Elite may not top Parker as Statham's best movie, but it's pretty close. If you enjoy a fast-paced, edge of your seat movie, with a lot of interesting characters and a deep plot, than you won't want to miss this film.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2012
      },
      "score": 5,
      "text": "\"An all-star cast brings to life the true story of Billy Beane, a former jock turned general manager who uses unconventional methods to bring the best players to the Oakland A's, a major league baseball team struggling against financial hardship.\"",
      "total_reactions": 0,
      "user": "allmovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "Jason Statham delivers another outstanding performance as the top action star. Some of the stunts are fantastic. The story is deep enough to keep you hooked, but I was disapointed that Robert De Nero's involvement surroumnts to a cameo and his involvement in the film was very limited. A decent action film from top to bottom/",
      "total_reactions": 0,
      "user": "clarkd28"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "Jason Statham once again plays a noble assassin, a killer with a conscience. He (Danny) refuses to kill his nemesis Spike, played by Clive Owen, for no good reason, even though Spike make it's clear he'll pursue Danny. Heck, he even gives Spike millions of dollars to help him start over, weird. Danny has a demure, girl-next-door girlfriend which detracts more from the story than adds an element of vulnerability to it. DeNiro just phones in his performance, he's old, fat, and lazy but his name is still a draw apparently. Overall, it's a decent enough experience. I got this free via Dish's Blockbuster @Home program so the price was right. Don't spend more than 99Â¢ to rent though.",
      "total_reactions": 0,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2012
      },
      "score": 6,
      "text": "Was looking forward to this film considering the cast, I mean how many Deniro films are not good. Well, I consider this one among his worst choices. The story is mundane but props itself up with good action. Although Stratham's role is the same one he plays in everyone of his films, viewing this once is quite enough.",
      "total_reactions": 0,
      "user": "geedup"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "Killer Elite is a bad movie. It is a pulpy, cheesy, bloody action thriller, that bores rather than thrill. The story, set in the vivid streets of Oman and England, the movie switches places quickly. The spy suspense, is just people saying smart stuff, to make them look smart. The truth is, this film is not smart. It is a dumbed down version of Bourne meets The A Team. The story is even worse, a guy who hires Jason Statham to kill guys who killed his three sons, so Jason can get his friend- Robert De Niro. I didn't even get their names, because all the characters muttered swears and British slangs throuought. There is little action to cheer about, there is guns and blood, and sometimes it doesn't even make sense. Clive Owen looks worse than ever in his role about a guy who wants to chase down the guy who works with Jason Statham. It is confusing, it's a movie you should not watch or care about, it is on Netflix and DVD. But some stores have hidden it, so nobody even looks at this turd.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2013
      },
      "score": 3,
      "text": "I decided to watch this film because of Clive Owen and De Niro. I blocked Staham from the equation. Unfortunately I couldn't block his horrible performance. He plays the same role in every film. I've come to the realization that if its not an Expendables film he's no good. I've never been more bored in the theaters than i was while watching this film. It's horrible.",
      "total_reactions": 0,
      "user": "WayneThomas412"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "Great acting,great action but very poor story. 4/10 is the real rating for \"Killer Elite\". The movie is unfinished and i hope they're going to make a second one, because... okay i won't use a spoiler. Just watch it",
      "total_reactions": 0,
      "user": "SEROJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2013
      },
      "score": 3,
      "text": "A typical statham actioner which outstays its welcome by a considerable margin. The plot becomes messier and more confused the longer the film runs and it is actually quite sad to see the type of film Robert DeNiro is now relegated to playing in. Clive Owen seems to be taking the whole thing seriously and it is left to Statham himself to provide any semblance of entertainment from the tiresome proceedings.",
      "total_reactions": 0,
      "user": "oakridge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "In German:",
      "total_reactions": 0,
      "user": "Nobilis1984"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "Good action scenes and good actors are not enough to make a good movie and the movie is only about this.The script is just a mess and the dialogues are just ****",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2015
      },
      "score": 4,
      "text": "According to the book and the marketing of this film it's all based on a true story, I honestly don’t really care because that was not a selling point for me, what attracted me to the film is the cast. I know Jason Statham doesn’t have the best track record when it comes to the quality of the movies he stars in but when add Dominic Purcell, Clive Owen, and the great Robert De Niro, to me it’s worth the shot.",
      "total_reactions": 0,
      "user": "wornoutspines"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2015
      },
      "score": 9,
      "text": "With a smart script... With great actors Statham,De Niro and Owen are impeccable,in this action,crime thriller of 80's... Good scenes of actions great fights between STatham and OWen.",
      "total_reactions": 0,
      "user": "raciocinio"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "very goooooooooooooooooooooooooooooooooooooooooooooooooooooooood one.................................. Owen Statham DeNiro are perfects here.....................",
      "total_reactions": 0,
      "user": "sicrano"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2015
      },
      "score": 4,
      "text": "\" Killer Elite \" was a very acceptable film but excel in the work of the division , failed to entertain us , but I have to give another opinion , let alone in his own defense.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2016
      },
      "score": 9,
      "text": "....................................................................................................................................................................................A close to perfect",
      "total_reactions": 0,
      "user": "Zaynhewsonjavad"
    }
  ]
}