{
  "mc_avg_user_score": 5.4,
  "mc_metascore": 25,
  "mc_mixed_rating_frequency": 12,
  "mc_movie_name": "Killing Season",
  "mc_negative_rating_frequency": 20,
  "mc_positive_rating_frequency": 21,
  "mc_pro_critic_reviews": [
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2013
      },
      "score": 75,
      "summary": "Killing Season is like the Saturday morning cartoon version of a terrible movie: still bad, but at least colorful enough to go down easy."
    },
    {
      "critic": "Gabe Toro",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2013
      },
      "score": 42,
      "summary": "Director Mark Steven Johnson can’t seem to balance a tone here, which is a pity because for the most part he stands back and lets the two stars go at each other."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2013
      },
      "score": 42,
      "summary": "With casting this unconvincing, no one is watching to get a lesson in the horrors of war."
    },
    {
      "critic": "David DeWitt",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2013
      },
      "score": 30,
      "summary": "It’s not worthless, but it’s not good. As a genre film, it’s too ambitious; as an art film, it’s too obvious."
    },
    {
      "critic": "Andrew Schenker",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2013
      },
      "score": 25,
      "summary": "Mark Steven Johnson's Killing Season is a hard movie to take seriously, which is particularly unfortunate since it deals with such weighty issues as genocide, the ethical compromises that everyone makes in combat, and the lingering effects of wartime decisions on participants years down the line."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2013
      },
      "score": 20,
      "summary": "The pretentious, preposterous, dueling-dialect flameout called Killing Season has to stand as one of the biggest missed opportunities in iconic matchups."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2013
      },
      "score": 20,
      "summary": "Travolta, who was more believable as a middle-aged housewife in “Hairspray” than he is as a former Serbian commando, has the accent down pat. But his Boris-and-Natasha-style syntax seems to represent Killing Season best. Just imagine that voice saying: Dees ees very seelly movie. Catch on cable TV, please."
    },
    {
      "critic": "Peter Sobczynski",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2014
      },
      "score": 12,
      "summary": "Cheaply made, dramatically inept and staggeringly dull despite a running time that only clocks in at maybe 80 minutes tops before the end credits begin, it is so devoid of passion, energy and intelligence that it makes one wonder why those responsible even bothered to make it in the first place."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2013
      },
      "score": 12,
      "summary": "De Niro mostly looks miserable and very tired (a document glimpsed on-screen hilariously claims his character was born in 1970) and prattles on endlessly about forgetting the past."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "A battle of awful accents coupled with slapdash cat and mouse intrigue, \"Killing Season\" is a thriller whose approach grows increasingly mundane, and renders itself completely forgettable. \"Killing Season\" is directed by Mark Steven Johnson \"Ghost Rider\" (2007), and the movie stars two cinematic legends, Robert De Niro and John Travolta, who star together on-screen for the first time ever. What could be an ultimate showdown of two acting titans with a storyline that closely follows \"The Most Dangerous Game,\" unfolds into abysmal exercise of nonsense, and thoroughly disappoints given its potential.",
      "total_reactions": 1,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "the plot summary goes like this",
      "total_reactions": 3,
      "user": "asdasd33a"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2014
      },
      "score": 4,
      "text": "The Killing Season was one of those movies that you're not quite sure how it gets made. Who comes up with the idea of having John Travolta play a Serbian and have a battle with Robert De Niro? Honestly, it actually wasn't that bad of an idea but it was just such a slow movie that it made it difficult to watch at times. If this film was any longer I might've fallen asleep. Some of the plot points were a little weak also and Johnny T's accent, while not bad, isn't good enough to make you forget it's John Travolta. Overall, not a terrible movie but pretty mediocre in general.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2013
      },
      "score": 5,
      "text": "I'm not sure how to put this in words but it felt like there were too many times when one of the characters managed to escape certain death only because of stupidity on the other guys part.  I was really hoping for a good game of cat mouse where they actually outsmart eachother, instead the cat just keeps releasing the mouse and tables are turned every time.  Definitely not going to get any Oscar nominations, but worth a watch if you are bored.  Just pirate it, even though I was disappointed I didn't feel like I was cheated out of 90 minutes.",
      "total_reactions": 0,
      "user": "Basilone"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "I liked the story and felt it could have been great...except if it wasn't for how awful John Travolta was.  The bad Serbian accent and his phoned-in performance single-handedly makes the film an accidental comedy.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "\"Killing Season\" 10 Scale Rating: 3.0 (Awful) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 2,
      "text": "John Travolta plays the role of Vengeful Ex-Soldier who was shot during the Bosnian War in a war crime by some bad Americans shooting bad Serbian war criminals.  Specifically it’s suggested he may have been shot by Robert De Niro who plays Colonel Benjamin Something.  Now 18 years later, Vengeful Ex-Soldier has bought some American military personnel files off a bloke in a pub.  One of the files is on Colonel Benjamin Something.  “I have been waiting 18 years to do a revenge film with De Niro” says Vengeful Ex-Soldier to the bloke in the pub, who seems to be losing interest.",
      "total_reactions": 0,
      "user": "ponderflix"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "If you've always wanted to see Robert De Niro forced to thread a steel rod through an open wound and then strung upside down by John Travolta, this is the movie for you.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "I came away with a different view of what was being said. Being a combat veteran (vietnam) I saw how the character isolated from family & friends espespecially at the end. Sadly I seen a lot of myself. The average person would have a hard time understanding that.",
      "total_reactions": 0,
      "user": "cb1502101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2016
      },
      "score": 10,
      "text": "Killing Season is a movie that thrills and leaves you thinking. It is timely because the tension echoes many of the current situations going on in society. In their own right each of the two in the movie have their reasons (and justifications) for their points and places. In the end (sorry, no spoiler here) the stark realization of the view from the other side really brings home the powerful moral of this movie. De Niro is his usual amazing self and Travolta delivers a nearly convincing eastern bloc persona. Well worth seeing.",
      "total_reactions": 0,
      "user": "JohnTravolta321"
    }
  ]
}