{
  "mc_avg_user_score": 6.7,
  "mc_metascore": 62,
  "mc_mixed_rating_frequency": 36,
  "mc_movie_name": "Killer Joe",
  "mc_negative_rating_frequency": 13,
  "mc_positive_rating_frequency": 78,
  "mc_pro_critic_reviews": [
    {
      "critic": "Adam Nayman",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2012
      },
      "score": 100,
      "summary": "Credit goes to the actors (especially Gershon) for giving almost as good as they get in seriously demanding roles, and to Friedkin for having what it takes – guts, chops and a refreshing lack of artistic caution – to bring things thundering home."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2012
      },
      "score": 100,
      "summary": "It's McConaughey who is the real revelation: All Grim Reaper strut and cutthroat stare, he savors each of Letts's vividly ghoulish lines."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2012
      },
      "score": 90,
      "summary": "A hideously funny tabloid noir."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2012
      },
      "score": 83,
      "summary": "With an eye for gritty, shameless fun, Friedkin unleashes the play's guilty pleasure center. Friedkin holds nothing back, but it's Letts' rambunctious plotting that enables the director to chart a path to the wild climax."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2012
      },
      "score": 83,
      "summary": "This is not some nostalgia-soaked throwback to the noir of old, but a rude, shit-kicking thriller that co-opts - and merrily defiles - a classic like \"Double Indemnity.\" Whatever its shortcomings, at least they're never failures of nerve."
    },
    {
      "critic": "Oliver Lyttelton",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2012
      },
      "score": 83,
      "summary": "It won't change the face of cinema history, and it won't win any awards (it's too downright dirty for that), but it's furiously entertaining, and a very strong piece of drama from a director who hasn't much luck in the last thirty-odd years."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 80,
      "summary": "An unflinchingly ugly -- but downright mesmerizing -- tale that plumbs the depths of human immorality and, along the way, offers a dash of subtle commentary on just how far we, as a 312 million-member nuclear family, might have lost our way."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2012
      },
      "score": 80,
      "summary": "This is a movie that's just out there, beyond our normal experience in a theater. You may walk away impressed or offended by Killer Joe, but Friedkin and McConaughey make sure you won't walk away indifferent."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2012
      },
      "score": 80,
      "summary": "By far the film's deadliest weapon is McConaughey. The way the actor leans into threats, dropping his voice, wrapping eloquence in sinister tones, is skin-crawling. The muscles in his neck literally seem to tense one by one. And if the eyes are the window to the soul, you really don't want to peer for long into his. It is not an easy performance to watch, but it is unforgettable."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2012
      },
      "score": 80,
      "summary": "As splashy as Killer Joe is, it's also, beat by beat, meticulously orchestrated, with no shortcuts to the carnage. When it comes to mapping psychoses, Letts and Friedkin are diabolically single-minded cartographers."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2012
      },
      "score": 80,
      "summary": "Friedkin's still got it - the \"it\" being his ability to infuse every frame of the film with powerful ambiguity and doubt, and also his ability to attract terrific actors and propel them in unexpected directions."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2012
      },
      "score": 80,
      "summary": "McConaughey's fans might be shocked to see him in this role - more likely, they'd skip the opportunity - but they ought to give his performance a shot. The dimpled demon lover proves he can be just as seductive playing Texas's creepiest, craziest cop."
    },
    {
      "critic": "Neil Young",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2012
      },
      "score": 80,
      "summary": "A likeably unpleasant slice of adults-only Texas noir, which aims at the funnybone as much as the jugular."
    },
    {
      "critic": "Matt Mueller",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2012
      },
      "score": 80,
      "summary": "Friedkin's unflinching trailer-park noir features ugly characters, game performances, degradation and the obscene abuse of a chicken drumstick. Highly recommended, then."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2012
      },
      "score": 78,
      "summary": "It's ostensibly a Southern-fried comedy of terrors, but what little humor the film evinces almost immediately lodges in your windpipe like an errant bit of K-Fried-C gristle."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2012
      },
      "score": 75,
      "summary": "Killer Joe is twisted pulp, and the actors chew on it bravely, boldly, and with varying degrees of success."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2012
      },
      "score": 75,
      "summary": "A gleeful and unapologetic descent into delicious decadence, Killer Joe is proud of what it is and never tries to be something it isn't."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2012
      },
      "score": 75,
      "summary": "The hardest thing to describe is tone, but it's the thing that most sets Killer Joe apart and makes it one of the most interesting and satisfying movies of the year so far."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2012
      },
      "score": 75,
      "summary": "One hell of a movie. It left me speechless. I can't say I loved it. I can't say I hated it. It is expertly directed, flawlessly cast and written with merciless black humor by Tracy Letts."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2012
      },
      "score": 75,
      "summary": "Even when the film goes too far over the top to be saved, McConaughey mesmerizes."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2012
      },
      "score": 75,
      "summary": "It thrills in seeing dumb people getting their due in hyper-stylized displays of violence, and yet it never feels contemptuous of them."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2012
      },
      "score": 70,
      "summary": "The family that slays together pays together in Killer Joe, a nasty little Texas noir that transfers Tracy Letts' 1993 play from page to screen with generally gripping results before devolving into an over-the-top splatterfest."
    },
    {
      "critic": "Michelle Orange",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2012
      },
      "score": 65,
      "summary": "In its own way and to its own detriment, William Friedkin's splattery, southern gothic return to the screen seeks to amuse as well as shake and stir."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 63,
      "summary": "Killer Joe is one of the most repugnant parodies of small-town stupidity that you will ever see, and Friedkin amplifies the shrill obscenities with blaring cartoon and kung-fu footage from his art director's fever dreams."
    },
    {
      "critic": "Ian Nathan",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2012
      },
      "score": 60,
      "summary": "Family dysfunction to make Jeremy Kyle blush, but thanks to McConaughey's oily power and Friedkin's unflinching purpose it's a compelling beast."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2012
      },
      "score": 60,
      "summary": "It is up to McConaughey's crooked cop to carry the picture: a sleek, loungingly casual loner whose hunger for violence, like his hunger for fried chicken, is finally and horribly gratified."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 50,
      "summary": "You end up feeling sorry for all the actors forced to humiliate themselves, except for McConaughey, whose portrayal of sadistic, manipulative evil is mesmerizing, in part because it was so unexpected. He continues to surprise. Friedkin, sadly, continues to coast."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2012
      },
      "score": 50,
      "summary": "The bone-crunchingly violent film has luridly entertaining moments. But by its resolution, this sleazy Southern Gothic nightmare has simply gone off the rails."
    },
    {
      "critic": "Read full review",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2012
      },
      "score": 50,
      "summary": "Even if you like your movies sick and black, as many people do, it's hard to miss the irony: in the very act of trying to intensify his Southern tale, Friedkin dilutes the impact."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2012
      },
      "score": 50,
      "summary": "Mr. Friedkin, a director with a talent for kinetic screen violence, never finds his groove with Killer Joe, which lurches from realism to corn-pone absurdism and exploitation-cinema surrealism."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2012
      },
      "score": 50,
      "summary": "Killer Joe throws down a dare by expecting its audience to be the cool connoisseurs of the story's \"comic\" outrageousness, then rubbing viewers' faces in close-up scenes of brutality that reasonable people ought not to be able to watch. That up-close experience, however effectively done, is a movie specialty that's its own kind of mean."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2012
      },
      "score": 50,
      "summary": "When this sick, ludicrous cocktail of sex, violence and mayhem was first unveiled a year ago at the Toronto International Film Festival, one wag aptly described it as \"the ghost of Tennessee Williams meets the spirit of Quentin Tarantino.\""
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2012
      },
      "score": 40,
      "summary": "The pleasure of watching McConaughey strut, preen, and menace his way through this Southern-fried black comedy (at least I think it's a comedy) isn't quite enough to save Killer Joe. The whole movie has something tonally off about it, not to mention a theatricality that works against it in a way Bug's didn't."
    },
    {
      "critic": "Sara Maria Vizcarrondo",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2012
      },
      "score": 40,
      "summary": "Killer Joe isn't as outlandish in premise as it is in execution, which is saying something."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2012
      },
      "score": 38,
      "summary": "The action and dialogue find the same squalid level in time for the climactic scene, the cruel humiliation of a central character. That's when sensitive viewers should do what the bloody-minded Joe could never imagine: Walk away from the mess he has made."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2012
      },
      "score": 20,
      "summary": "What's most notable about this aggressively cynical project is how much talent it wastes."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2012
      },
      "score": 12,
      "summary": "A sleazy and pointless film about sleazy and pointless people, Killer Joe reminds us that what Quentin Tarantino does isn't easy."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2012
      },
      "score": 0,
      "summary": "Killer Joe is, at bottom - and I mean bottom - ugly and vile, not to mention dumb and clumsy."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "This is real film noir--not the private eye low key lighting kind but a real dip in the nasty stew of human greed and concupiscence.  Hence, not for everyone.  The actors are wonderful at revealing how naivete can turn amoral and good manners mask perversity and violence--and all regarded as part of the human comedy..  The cast is pitch perfect.  A special cheer for McConaughey and for Gina Gershon and Emile Hirsch.",
      "total_reactions": 6,
      "user": "amboy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "It's by far the best B-movie, film noir, grindhouse-style film I've seen in a long time.  It doesn't take itself too seriously, and it's funny as hell. McConaughey is terrific - it's almost an extension of his role on Magic Mike - an egotistical control freak.  But Thomas Haden Church steals the show with his deadpan style of humor.  Great fun.",
      "total_reactions": 2,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "Perhaps the greatest quality of Killer Joe is that it never pretends to be anything more than a wickedly deranged and entertaining piece of trash.  Freed from the obligation to make any sort of artistic statement, Friedkin delivers the goods and coaxes stellar performances from his cast;  particularly McConaughey and Church.  It's definitely not for everyone, but it never tries to be.",
      "total_reactions": 2,
      "user": "BKM"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "Matthew McConaughey completely steals the show in Killer Joe, where he plays a detective who also works as a hired gun. McConaughey has moved himself away from the typical \"pretty boy\" roles he usually takes on and instead portrays a cold, ruthless killer with a contrasting strange taste for fine etiquette. Definitely the performance of the year thus far.",
      "total_reactions": 2,
      "user": "Notorious"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 4,
      "text": "I do not see how any one saw this movie as an under rated gem. I saw it as a cheap gimmick that insulted my intelligence. Trashy humor is nothing new so if you are going to do it you had better do it well. They don't! Excessive violence is nothing new so if you are going to do it, you had better do it well. They don't. Thomas Hayden Church was funny but McConaughey looked liked a fool in his role.  Morgernstern's review nailed this film. Read it and I agree entirely.",
      "total_reactions": 3,
      "user": "JamesL"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2012
      },
      "score": 0,
      "text": "This movie is a complete waste of time.  If you are into trashy dumb movies with over the top violence and stupidity you will probably like this movie.  The ending is beyond ignorant.",
      "total_reactions": 3,
      "user": "Frekoid"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "Marshal Will Kane, in High Noon, gives Helen Ramirez, a Mexican prostitute, advance warning about the gun-slinging menace heading their way. Frank Miller is returning home, and that can only spell trouble for the denizens of this New Mexico outback, especially Helen, since both men were the whore's intimates. Just because the marshal found himself a respectable girl, the former Amy Fowler, it doesn't mean Kane, gentleman that he is, would forget about a past lover. Gary Cooper stood for law and order; his character was an honorable man, a good man. It's what moviegoers expected in 1952. Sure, there was an audience that championed low-lives, the deceitful men and women who populated the dark shadows of film noir, but it's doubtful if those same vicarious thrill-seekers could handle Lou Ford, the anti-hero protagonist in Jim Thompson's The Killer Inside Me, a roman noir about the deputy sheriff of a two bit Texas town who had a hankering for kinky sex and murdering women with his bare hands. Also released in '52, The Killer Inside Me can be read as a degenerate inverse of High Noon, since not only does Lou kill the whore, but his fiance, as well. Due to the brute force and exceptional cruelty inherent in the violence, it's understandable as to why The Killer Inside Me never made it to the screen, even during the heyday of the crime film. Thompson writes: \"I backed her against the wall, slugging, and it was like pounding a pumpkin.\" The Hayes Production Code, with its strictures put on violent and sexual content, in effect, rendered such an image practically unfilmable, or rather, because of the times, the filmmaker wouldn't be able to carry out the pulp writer's diseased outlook on humanity with any real integrity. Arguably, Michael Winterbottom, afforded with the luxury of celluloidal frankness in the way of visceral thrills, delves into Thompson's imagination with such vivid precision, it borders on unconscionable depravity. His serious grindhouse approach to violence is hard to stomach. When Lou Ford carves up Joyce Lakeland's face, she ends up with malleable skin, bloodied, a surface disfigured by bareknuckle punches. She becomes the smashed pumpkin that Thompson implied. Even worse, in the film noir sense, it's an unjustified murder, because Joyce is no femme fatale. She loves Lou: doesn't even smoke. In Killer Joe, Sharla gets it pretty bad, too, but unlike Joyce, the trailer trash housewife is a femme fatale, the kind who lets another man do her bidding in order to collect on an insurance policy's capital sum(a la Barbara Stanwyck). Schematically speaking, as it pertains to genre, the money hungry waitress gets what she deserves. Returning home with a bucket of chicken from KFC, Sharla asks Joe, \"What do you like, light or dark meat?\" \"Leg,\" he answers. Not a drumstick, a leg. The word choice is important. The filmmaker applies the \"graphic imperative\"(in short, what goes on after the screen fades to black) to the classic film noir, through the self-conscious updating of the Billy Wilder film, in which the causation of blood, and especially, sex, would have been left to the moviegoer's imagination. Whereas the police detective sexualizes the drumstick by forcing Sharla to perform oral sex on a deep-fried phallic object, Walter Neff, insurance salesman, does the same to Phyllis Dietrichson's leg, **** it(\"and the way that anklet cut into her leg.\"), as the oil tycoon's wife climbs down \"that silly staircase.\" Double Indemnity gets around the unrealistic likelihood of their relationship being a chaste one by making Neff a fallible narrator. He dictates a whitewashing memo into the claims manager's dictaphone, rife with obvious gaps. \"So we just sat there,\" Neff says, but after Phyllis leaves his apartment, he straightens out the bunched-up rug with his shoe, evidence of lovemaking on the floor. With her stepdaughter, whom Neff admits to seeing \"three or four times a week,\" an improper affair is suggested, telling Keyes  that \"one night we went up into the hills behind the Hollywood Bowl,\" a secluded place where sex is a potentiality. In Killer Joe, the titular character uses Dottie, an underage girl, as a retainer, when her brother can't scrounge up the money. Not for nothing is Walter's special friend named Lola(read: Lolita), and the filmmaker knows it, since here, Joe wants to run away with the virgin, and more disturbingly, so does Chris, thereby forming a bizarre love triangle. \"Straight down the middle,\" is how Walter and Phyllis describe their murder plot, and perhaps, not coincidentally, the siblings, in Killer Joe, walk down a train track, the place where Mr. Dietrichson's cold body ends up. Dottie, is both, a good and bad girl, the heroine and the femme fatale. Although she has a hand in her mother's murder, the girl is also a victim of child abuse. When Dottie shoots Chris, the girl inhabits both roles simultaneously.",
      "total_reactions": 3,
      "user": "Shiira"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "If you are turned off by violence realistically portrayed (no computer-generated antics here), stay away.  None of it is gratuitous, all are essential -- and it is strong stuff.  The movie builds in intensity relentlessly, all the way through, maintaining a reality within its milieu, and left us almost breathless as the final encounter builds and builds.  Every character is believable while the story line goes deeper and deeper into their desperation, arrogance, cowardice, greed, love, infidelity, stupidity, and sadistic domination.   \"Love Story\" it ain't.  But it is a gem of what it set out to be.",
      "total_reactions": 2,
      "user": "NeverLift"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "Killer Joe is definitely an underrated gem for 2012. given an NC-17 will probably ruin any hopes of a good theatrical run but this film is on the fast track to be a cult classic. The direction that William Friedkin drives this film is slow and dirty. The Gallows Humor found in this film is hilarious and the violence is electrifying. Saying Killer Joe is just a regular noir film is a downright insult to the cast and crew.",
      "total_reactions": 2,
      "user": "pauloh110"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "This is the work of a seasoned, masterful Director leading a cast through a \" black as coal\" script - and it works perfectly. Matthew McConaughey leads a terrific cast, all of whom commit to everything in the script.  Kudos to the entire cast for taking this risk. This is a modern day film noir classic, just be prepared for a film that doesn't flinch.",
      "total_reactions": 2,
      "user": "Johnrieber"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "I am a 23-year-old man and this movie is going to give me nightmares. I don't think I've ever seen a more disturbing movie. The only character that's actually likeable in the entire film is \"Ansel\". I can't think of anything else to say except this movie is both good and extremely unsettling.",
      "total_reactions": 1,
      "user": "amartish"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 3,
      "text": "Killer Joe disappointed me due to a weak story and weaker characters. Matthew McConaughey was decent as usual (I tend to appreciate the characters/acting he brings to a film). However, the frustratingly unlikable supporting cast and overly offensive story elements did not work for me. For those planning on watching this movie, be aware there a moments in the film (at least in the unrated version) that come off as \"lets shock the audience by adding something completely pointless and disgusting\". I give it a 3 instead of a 0 because Matthew McConaughey, the camera work, the sound, and the editing were not the worst I've seen in a movie (although I'm having trouble remembering a movie I have liked less).",
      "total_reactions": 2,
      "user": "krnology"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "This film shows everyone how good Matthew McConaughey is when he's in the right role.   Sure there are a few disturbing things in this film, but I kind of dug it anyway.",
      "total_reactions": 2,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "Because it’s based on a play the action does all seem to occur in one place; predominantly the Smith family trailer. I didn’t find this too distracting but I did find it a little claustrophobic at times. All of the performances were truly excellent but I have to say the critics were right; Matthew McConaughey really does stand out in this one. There are some really violent scenes in this one so I definitely wouldn’t recommend it for younger viewers; the 18 Certificate is definitely more than a guideline here. I really liked the underlying dark humour throughout; it gave the narrative a little more interest. Over all, an interesting watch with some nice touches; it doesn’t have any particularly stunning effects but it’s a well crafted character-driven piece. Well worth a look if you get the chance.",
      "total_reactions": 0,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2012
      },
      "score": 6,
      "text": "This ambitious film tries to be trashy noir, but ends up mostly garbage. A trailer park family (Emile Hirsch, Gina Gershon, Thomas Haden Church) conspires to kill their estranged matriarch for her money and hire a pro (Matthew McConaughey) to do the job. Turns out he's real twisted and when things inevitably go awry, he twists even more. There are two problems: the script isn't smart or sassy enough for the genre and most of the cast isn't believable. The exception is McConaughey, who's savoring every bit of scenery in that mobile home. The assured hand of director William Friedkin keeps the film competently watchable, but the script gets in the way.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "I'm surprised at how much I enjoyed this movie considering how dark, brutal, and sometimes down-right disgusting it can be. More impressive is how it can make you laugh. It's a look at the darker, greedier side of people and how simple ignorance can cost us greatly. The cast is fantastic, Matthew McConaughey, Juno Temple, and Thomas Haden Church give the best performances I've seen from them yet, and let's be honest Emile Hirsch was born to give fantastic performances like this one. It's a great movie, the only complaint I have is that the ending was kind of a cliff hanger. It's perfectly acceptable, but it really felt like there should have been a few more minutes before the credits rolled. In the end it's a great and graphic movie that you should check out. Just be sure you can handle brutal movies, or this one will mess you up.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "An ultimately disappointing film, that tries to be Blue Velvet, without the cutting edge.  Sure it keeps you interested, but it goes nowhere and ends inconclusively.  If this movie was a vending machine, I'd be banging the sides, trying to get my money back.",
      "total_reactions": 0,
      "user": "DTDunn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "Vile, twisted, disgusting, disturbing, perverted, over the top, and violent, Killer Joe is actually a really good film. Now, it is entirely twisted, but the pitch black comedic moments lighten things up a bit. The sexual scenes are also a little much for my taste and at times this one was basically pornographic. However, Matthew McConaughey is so good in this one it hurts. Joe Cooper, his character, is easily one of the best villains I have seen in a long time, maybe the best I have seen since Hannibal Lecter. Twisted, sadistic, and entirely crazy, McConaughey's Cooper commands the screen and incites terror the first time you see him and even more so as you see just how insane and sadistic he truly is. Nobody is really safe from his wrath, not even the viewer, as by the end, it feels like he has even taken a piece of you. This one is violent and a tough watch, so it is not for everybody without question, but if this one does not leave you speechless at the end, I do not know what will. Very well made film here with a phenomenal, Oscar worthy turn from Matthew McConaughey.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "Even when Killer Joe goes over the top, and it does, way over the top, McConaughey and the rest of the cast create a fiery energy that keeps you on your toes.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "this film marked the beginning of the McConaissance and with good reason: mcconaughey is perfection.  smartest guy in the room, charming, and cold. brilliant and gutsy career choice. thomas haden church is also perfection. two great texas boys. i'm not a grindhouse fan, but the black humor. gorgeous cinematography, and friedkin's direction made this B-movie modern noir. had to watch some with one eye closed, but, hey, i had been warned. to think a director in his mid-70s made this film and wouldn't compromise makes me admire william friedkin all the more.",
      "total_reactions": 0,
      "user": "ariel84"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "Killer Joe is Chiller Joe.  This is the last word in dysfunctional families.  The movie is by turns comic and horrifying, with no wrong notes struck and a happy ending to end all happy endings.  We really do need to let Texas secede if they care to.",
      "total_reactions": 0,
      "user": "BobbyLip"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "As described by many, Killer Joe is a neo-noir set in Texas. For lovers of noir, it is a welcomed occurrence, because the genre is not popular. However, it definitely carries things very far. It breaks censorship's boundaries unimaginable in the 40's and pushes the limit very far even for 2012.",
      "total_reactions": 0,
      "user": "dierregi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2013
      },
      "score": 5,
      "text": "Posted on 5/19/13 09:42 AM",
      "total_reactions": 0,
      "user": "TomBeltran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 3,
      "text": "\"Killer Joe\" tries to be a funny and gritty black comedy, and while the writing can be clever, the supporting cast give such mediocre performances that almost none of the line delivery works. In addition to that, the third act of the film just becomes a tasteless and vile exercise whose sole purpose is to be as gross as possible just for the sake of being gross. Cup that with the half-assed ending, and all you really have in the end is a sleepy Oliver Stone knock-off that fails to be entertainingly any level despite the fact that McConaughey captures his role well.",
      "total_reactions": 0,
      "user": "NFW"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "An uncompromising film that allows Friedkin to showcase all the tricks he has acquired throughout his extensive career. With clever casting lead by the flawless McConaughey, Killer Joe is a dark and twisted story that draws the viewer into the sordid truth of human morality. A film that does not try strive for artistic perfection at the expense of entertainment. A refreshing blend of experience and youth allows this film to stand out from the crowd and is certainly worth a watch. A must see for all KFC enthusiasts.",
      "total_reactions": 0,
      "user": "BadAids"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "Dark, Funny, and true to It's story line, Killer Joe is a enjoyable cinematic experience for any fans of mystery movies with brutality. The only question is--- Would Colonel Sanders be proud?",
      "total_reactions": 0,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "A comedy as black as Beelzebub's soul. Brutality, sexual violence - not a film for the faint of heart or easily shocked. William Friedkin shows he hasn't mellowed in old age. Matthew McConaughey gives a brilliant performance as a cop who moonlights as a hit man and exploits with glee a family whose stupidity is matched only by their greed. This is Tennessee Williams on steroids.",
      "total_reactions": 0,
      "user": "Eilidh2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "Wtf? Did anyone notice Matt M. (K.J.)'s badge number was 714. ...the same number that Jack Webb had in Dragnet....  The same number that was written on a quaalude ....  WTF ?",
      "total_reactions": 0,
      "user": "Doc4kids"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2015
      },
      "score": 5,
      "text": "Despite all the great actors chewing up the scenery here, this film proves to be a lurid tale that descends into violence. Although William Friedkin used to be one of the great directors in Hollywood (think \"The Exorcist\" and the \"French Connection\", just to name a couple), I don't think that he really hits the mark here at all. It seems to lack any sense of humor (except for Thomas Haden Church, who also hits the comic mark).",
      "total_reactions": 0,
      "user": "WJS"
    }
  ]
}