{
  "mc_avg_user_score": 6.6,
  "mc_metascore": 48,
  "mc_mixed_rating_frequency": 1,
  "mc_movie_name": "Kiss of the Damned",
  "mc_negative_rating_frequency": 1,
  "mc_positive_rating_frequency": 6,
  "mc_pro_critic_reviews": [
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "If Kiss of the Damned has one thing, it's an identifiable groove, one that is sustained and very, very infectious."
    },
    {
      "critic": "Leslie Felperin",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 70,
      "summary": "Saucily thumbing its nose at the insipid teen love of the \"Twilight\" franchise, Kiss reimagines its bloodsuckers as horny, supercilious Eurotrash with addiction issues, sucking the life blood from naive American thrill-seekers."
    },
    {
      "critic": "Noel Murray",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2013
      },
      "score": 67,
      "summary": "Like a lot of the retro-horror films that have popped up on the art-house and festival circuits over the past several years, Xan Cassavetes’ Kiss Of The Damned is more about mood and texture than plot."
    },
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 63,
      "summary": "The characters' high-minded, if unsophisticated, patter clashes with the film's ironic-chic style, and it never manages to move beyond the late-night palaver of earnest, if naive, college freshmen."
    },
    {
      "critic": "Farran Smith Nehme",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2013
      },
      "score": 63,
      "summary": "The sex is the main thing that makes Kiss of the Damned worthwhile."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2013
      },
      "score": 60,
      "summary": "The confident, female-driven sensuality of Kiss of the Damned anchors this handsome nonsense."
    },
    {
      "critic": "Eric Hynes",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2013
      },
      "score": 60,
      "summary": "Cassavetes adopts a grammar that occasionally slides into parody but mostly comes across as committed style. Kiss of the Damned contributes little new to the genre save a taste for alluringly tactile sex scenes and an avoidance of gore."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2013
      },
      "score": 50,
      "summary": "Xan Cassavetes cops to nothing more significant than being more keen on Vampyros Lesbos than anyone else from her clan of famous cinephiles."
    },
    {
      "critic": "Neil Young",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "Paying slavish homage to culty genre predecessors from the sixties, seventies and eighties, this steamy tale of a hunky screenwriter, his ethereal blood-sucking paramour and her bad-girl sister can't quite decide whether to be seductively stylish or knowingly cheesy."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2013
      },
      "score": 30,
      "summary": "More focused on philosophy then feeding, “Kiss” marries a mash-up of undead clichés (I know, let’s have another lingering shot of the moon!) to hilariously stilted conversations."
    },
    {
      "critic": "Andrew Schenker",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2013
      },
      "score": 30,
      "summary": "Cassavetes puts over this simple, poorly acted story with moody lighting, self-consciously \"beautiful\" gore, and an annoying penchant for impressionistic quick-cut flashbacks, all of which get in the way of rather than enhance the supposed fun."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2013
      },
      "score": 25,
      "summary": "Well photographed, lurid enough to cause concern for the teen market it aims to captivate, and with enough blood to refurbish an abattoir, Kiss of the Damned creates an eerie, foreboding anxiety that comes uneasily close to terror. Too bad they seem to be making it up as they go along."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "Filmed well Kiss of the Damned plays like The Roommate meet vampires.  This film becomes rather boring with a love story about as believable as Twilight.  There is not much to this film the acting is ok by some and poor from others.  I was expecting a romantic/erotic horror film that can be well made especially with vampires unfortunately we get a forced romance mixed with decent, but standard vampire kills. D",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "\"Kiss of the Damned\" 10 Scale Rating: 5.5 (Mediocre) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "“Kiss Of The Damned” carries us back to the golden age of vampire tales when we held a romantic and dark desire for the creature of the night. This film is what I would imagine reading one of those supernatural themed Harlequin-eque romance novels would be like. The director explored the more passionate side of daily life and love affair between a vulnerable but strong woman and a man desperate to love her in every way. It was down right gothic and sweet. The film didn’t bother getting too graphic or soft-core with the heightened sexuality of the relationships depicted in the movie but it was adult enough to be sheer supernatural eye candy. This movie is a great date movie for that vampire loving partner or person you want to kick it with. The story was compelling in true dramatic style that expresses the lives we expect vampires to enjoy. Just note that this is not a “horror” movie nor do I believe the director ever intended it to be one.",
      "total_reactions": 0,
      "user": "A_So_Horror_Fan"
    }
  ]
}