{
  "mc_avg_user_score": 6.0,
  "mc_metascore": 34,
  "mc_mixed_rating_frequency": 1,
  "mc_movie_name": "Knife Fight",
  "mc_negative_rating_frequency": 1,
  "mc_positive_rating_frequency": 3,
  "mc_pro_critic_reviews": [
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2013
      },
      "score": 88,
      "summary": "As a bare-knuckle assault on the corruption that has come to define the creeping rot of American politics, Knife Fight is neither as satirical as Barry Levinson's \"Wag the Dog\" nor as incisive and wrenching as George Clooney's \"The Ides of March,\" but it's a noble, shocking and inspired film worthy of attention."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 67,
      "summary": "It pales beside the best down-and-dirty political movies (ranging from \"The Candidate\" to \"The Manchurian Candidate\") because, finally, it lacks the courage of its own lowdown convictions."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "It's a forgettable series of bullet points barely strung together by charismatic performances."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 45,
      "summary": "Playing like a mashup of tropes from far superior small- and large-screen entertainments (Scandal, House of Lies, Ides of March), this clunky feature from Bill Guttentag is satire at its most soft-bellied and toadying."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2013
      },
      "score": 40,
      "summary": "Aims to be a cutting-edge portrait of cutthroat political machinations. But it's a mostly toothless affair that, like so many of our current political figures, proves alienating."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2013
      },
      "score": 40,
      "summary": "Throughout, Knife Fight feels like TV, like a half-season of some promising cable show stuffed into a 98-minute film that never really builds or surprises."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 38,
      "summary": "You'd hope a political-insider indie reuniting \"West Wing\" stars Rob Lowe and Richard Schiff, and informed by the experiences of an actual former spin doctor, would be a small delight. You would be wrong."
    },
    {
      "critic": "Gabe Toro",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 33,
      "summary": "For those of you who felt \"Ides Of March\" was entirely too cerebral and challenging, here comes the dunderheaded Knife Fight. A political satire that treads no new ground, this name-heavy comedy wastes an engaging central performance by Rob Lowe."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 30,
      "summary": "The tone of Knife Fight is mean until the movie flips a switch and turns pious and mawkish as Paul tries to make amends for past sins. Whether playing it sleazy or noble, Mr. Lowe brings little emotional weight to his role."
    },
    {
      "critic": "Gary Goldstein",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 30,
      "summary": "The underwhelming, would-be political satire Knife Fight plays more like a failed network TV pilot than the savvy feature it clearly set out to be. Think: Aaron Sorkin-lite, uh, really, really lite."
    },
    {
      "critic": "John Barber",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 25,
      "summary": "Means and ends meet briefly, shrug and disappear under a torrent of self-flattering clichés."
    },
    {
      "critic": "Nick McCarthy",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2013
      },
      "score": 25,
      "summary": "Bill Guttentag exaggerates the absurd lengths advisors go to win an election and yet ultimately aggrandizes their behavior."
    },
    {
      "critic": "David Fear",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2013
      },
      "score": 20,
      "summary": "Thanks to his pitch-perfect portrayal of Parks and Recreation's Type A–personality-run-amuck boss, we're willing to forgive Rob Lowe for virtually anything. This pitiful excuse for a political satire, however, seriously tests that theory."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Though the acting isn't up to par, it's still better than most multi-million dollar movies you see in theaters these days. I watched this as being a fan of the band AFI (Davey Havok is Jimmy in this movie), and I can say that everyone did their part as good as they could. The story is really slow at the start (why it lost 2 points from perfection for me), I kind of started to daze off but it gets a tad bit funny and the story picks up towards the end.",
      "total_reactions": 0,
      "user": "Skydog"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "I only watched this because of the cast (Saffron Burrows, Jamie Chung, Jennifer Morrison, Julie Bowen, yes, I am indeed male, lol) but I was thoroughly entertained with the humour in this (mild mannered) Political Satire. Now I'm from the UK and I got all the in jokes so why are the critics kicking this decent movies teeth in?",
      "total_reactions": 0,
      "user": "NavQ"
    }
  ]
}