{
  "mc_avg_user_score": 7.6,
  "mc_metascore": 67,
  "mc_mixed_rating_frequency": 64,
  "mc_movie_name": "Kung Fu Panda 2",
  "mc_negative_rating_frequency": 20,
  "mc_positive_rating_frequency": 332,
  "mc_pro_critic_reviews": [
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2011
      },
      "score": 91,
      "summary": "Part two is even more gorgeous to behold, and deeper in substance."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2011
      },
      "score": 90,
      "summary": "It all moves along briskly, with a degree of visual grace and a solid feel for 3D."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2011
      },
      "score": 90,
      "summary": "Once again, the DreamWorks team demonstrates that humor is the primary weapon in its arsenal."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2011
      },
      "score": 88,
      "summary": "The animation is elegant, the story is much more involving than in the original, and there's boundless energy."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2011
      },
      "score": 83,
      "summary": "At times, Kung Fu Panda 2 suggests \"Bambi\" redone as an episode of Oprah. Yet it's a more-than-worthy sequel."
    },
    {
      "critic": "Angie Errigo",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2011
      },
      "score": 80,
      "summary": "A richer plot, life lessons and loving Chinese cultural references rendered by turns sweet, scary and charming, with yet more fantastical kung fu, make this an engaging winner. Stunning visuals make it real art as well."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2011
      },
      "score": 80,
      "summary": "Kung Fu Panda 2 plunks down squarely in the spot marked for \"chop-socky action with heart.\""
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2011
      },
      "score": 80,
      "summary": "The big action pieces, particularly the final face-off, are masterful both for their cleverness in bringing down the house and the detail jammed into every frame. Even composers Hans Zimmer, who's scored a zillion movies, and John Powell seem to be having more fun than usual."
    },
    {
      "critic": "Todd Gilchrist",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2011
      },
      "score": 80,
      "summary": "A fun and surprisingly affecting little adventure, Kung Fu Panda 2 ranks among the best films DreamWorks has ever done."
    },
    {
      "critic": "Kerry Lengel",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2011
      },
      "score": 80,
      "summary": "A precisely calibrated crowd-pleasing machine, balancing action, comedy and just the bare minimum of pathos."
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2011
      },
      "score": 80,
      "summary": "Jennifer Yuh Nelson's sequel delivers a bevy of superpowered set pieces that are dexterous and delirious, as well as tonally confident."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2011
      },
      "score": 75,
      "summary": "This is the most mature animated feature since \"Rango.\""
    },
    {
      "critic": "Michelle Orange",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2011
      },
      "score": 75,
      "summary": "Scenic, inventively playful, and successfully serious when it wants to be."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2011
      },
      "score": 75,
      "summary": "Black is clearly suited for the role of a modern-day Inspector Clouseau, a hero clown who can't help but save the day."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2011
      },
      "score": 75,
      "summary": "For a movie touting \"inner peace,\" this 3-D sequel sure goes in for its share of battle scenes, but for the most part they are excitingly conceived."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2011
      },
      "score": 75,
      "summary": "This well-executed sequel is sneaky. While it distracts us with Chinese backdrops and buffoonish humor, it sucker punches us with a message about belonging."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2011
      },
      "score": 75,
      "summary": "Director Jennifer Yuh Nelson, who oversaw the elegant title sequences from the first film, likewise gives Kung Fu Panda 2's series of flashbacks a different look, harking back to Chinese shadow puppetry and delicate watercolors. With its mix of vibrant CG and classical elements, the movie dazzles."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2011
      },
      "score": 75,
      "summary": "A sequel that delivers more heart than laughs, and is, if anything, more visually dazzling than the 2008 original film."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2011
      },
      "score": 70,
      "summary": "Hardly a scene goes by that isn't visually striking or kinetically thrilling, and all of it enhanced by 3-D."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2011
      },
      "score": 70,
      "summary": "The new Panda has a bright palette, an amiable vibe and enough vivacity to keep kids entertained and any accompanying moms from bolting for \"Bridesmaids.\""
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2011
      },
      "score": 70,
      "summary": "Accomplishes the depressingly familiar mathematical trick of being both more and less than its predecessor."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2011
      },
      "score": 67,
      "summary": "Kids are bound to get a kick out of these kung fu creatures."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2011
      },
      "score": 63,
      "summary": "It wouldn't be right to say that, half an hour after Kung Fu Panda 2 ended, I was starving for laughs again. In truth, I was starving pretty much all the way through."
    },
    {
      "critic": "Janice Page",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2011
      },
      "score": 63,
      "summary": "It's still Black's franchise, though. And part of the problem with this sequel is how little it lets its star just riff with silly abandon, as he did throughout the original."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2011
      },
      "score": 60,
      "summary": "For an animation studio that too often specializes in the frivolous and glib (begone, Shrek series!), the move to the dark side is refreshing."
    },
    {
      "critic": "Glenn Heath Jr.",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "Exquisite looking but substantially hollow."
    },
    {
      "critic": "Stephen Cole",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "There just isn't the same zingy rapport. Seth Rogen's praying mantis and Jackie Chan's monkey have no more than a dozen lines between them. Even Jack Black's Po is more subdued."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "And, yes, Kung Fu Panda 2 is a little darker and a little more intense than the first film, especially for very young viewers."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2011
      },
      "score": 42,
      "summary": "Kung Fu 2 does almost NOTHING to advance the story, to deepen the characters, or to charm, amuse or entertain."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2011
      },
      "score": 42,
      "summary": "The sequel remains visually beautiful and strikingly designed, but otherwise, it's a surprise in all the wrong ways."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2011
      },
      "score": 25,
      "summary": "A ghastly sequel to a charming animated film."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "ITs definitely not the best kids movie ever made, but its somewhere up there. I mean even for an adult its quite funny to watch with kids. It's debatable if first one is better, but i say they are both good.",
      "total_reactions": 5,
      "user": "kindzadza"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "best movie in current times. enjoyed a lot. neat narration and good direction. all together the best animated movie since 2 years. my vote for it 10/10. po rocks!!! all the best for the collections as it is going to be a blockbuster of the year",
      "total_reactions": 3,
      "user": "sreekiran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "Everything about this movie was wonderful, Dreamworks has been kicking some serious butt lately (disregard Shrek 4) This film was funny, action packed, and touching. I haven't been this impressed by a sequel in quite some time. The Oscars should create a voice acting category just for Gary Oldman's performance in this film.",
      "total_reactions": 2,
      "user": "ZacharyMatson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Pretty much everything about this film is the same in quality as the first film. The action sequences (of which there are many) are very well made, the script is pretty funny and the voice acting is pretty good for the most part. The one gripe I have with the film is that the plot is maybe not quite up to the first film's plot. But it is funnier, prettier and more action orientated than the first, which probably makes it the best of the two (even though they are both pretty much the same). What I say to Dreamworks is please don't mess up the third film, learn from your mistakes with Shrek 3, keep the standard up!",
      "total_reactions": 2,
      "user": "Happymonk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "we all know that \"Kung Fu Panda\" was a smash hit once it came out in 2008. and how could it not be? it was a great movie, filled with amazing animation; fantastic fight choreography; lovable/memorable characters; hilarious comedy, all that together in a great movie with a perfect pace. so, normally when a movie's a smash hit, we all know it's sequel time. when i first about \"Kung Fu Panda 2\" i was really excited. so i sat down, watched it and let me tell ya this: \"Kung Fu Panda 2\" is ever better than the first movie! it ups the jokes, it ups the characters, it ups the animation and it even ups the drama. i swear, some scenes in this movie actually made me and everybody in the cinema cry. whenever a sequel makes you cry, that's a really impressive step-up from the original. the story's not really fresh, but everything else was done perfectly! the characters are fantastic; the animation's even better; the comedy's hilarious; the drama's powerful and affecting; the voice acting's top notch; the script was smart and strong and this movie has Shen, a.k.a 1 of the greatest bad guys ever put in any movie! and Gary Oldman owned that role! overall, \"Kung Fu Panda 2\" tops and outdoes the original in every way. if you haven't seen it by now, then definitely see this movie.",
      "total_reactions": 2,
      "user": "NikoZguri1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "A fun addition to the first, as well as something completely different. The first was more of a comedy with action scenes, while the second is more of an action movie with comedic scenes. It's visually gorgeous, the 3D is great, and it'll waste an hour and a half. Kids will love it.",
      "total_reactions": 1,
      "user": "KarthXLR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "Hard ot believe - but better than the first one imo. Enjoy! The nemesis is much more interesting. The animation is better. The action sequences are great. I am going to see it again.",
      "total_reactions": 1,
      "user": "Hrodwulf"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "A very good movie, excellent use of 3d and traditional style animation for flashbacks. The humour was more frequent and on par with the original. There seemed to be more depth to the characters than before and this made the movie much better. It was good to hear more from the characters as well, in the first movie some of the characters hardly had much dialouge now this one has given them chance to speak out as it were.",
      "total_reactions": 1,
      "user": "NJLVFX87"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "WOW. The original Kung Fu Panda is the one standout Dreamworks animated movie in my mind. This expands on the original in a grand fashion. This film is a lot darker than the original, and stands out because of it.. This movie is this franchise's Empire Strikes Back. I can not wait to see where they take Po in the next installment.",
      "total_reactions": 1,
      "user": "Heaf"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "Bueno pues la pelicula es buena , tiene momentos graciosos, que  sacaran una risa.",
      "total_reactions": 1,
      "user": "HeReDiA97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "This is a sequel that is a lot better than the first. No other animated film has fit so much action into itself and still have a great story fit in. There is an even bigger lesson to be learned from Kung Fu Panda 2 compared to the original.",
      "total_reactions": 1,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "This is one of the few sequels that are better then the original. '' Kung Fu Panda 2 '' delivered a touching, brilliant and good story. I like the fact that it gets serious about Po's origins (without spoiling anything). There was a lot of fighting (even a little bit to violent) and the kung fu was bad-ass. The way the Furious five and our Dragon warrior fought was spectacular. I was looking forward to see if the villan (Shen)  would be as much as evil and hardcore, since Tai Lung (in the first movie) was the perfect bad guy. Again, he was a bad-ass villan, even better than Tai Lung. Also, this movie delivers a great message. Not only the kids will love this movie, the adults to. It's the perfect family movie.",
      "total_reactions": 11,
      "user": "scrieciu"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "Eh...There really isn't much to say about \"Kung Fu Panda 2\" compared to its prequel. I mean the action and comedies are great as well as the story, but everything sorta lacks of focus and consistency. Regardless of the cons, however, its still a great summer movie to watch with your kids.",
      "total_reactions": 8,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "Awesome Movie!.Touching history,with great action pieces and visuals over the top!.",
      "total_reactions": 3,
      "user": "efialtes76"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "These Movies sum up my notable and favorites. I think every reviewer should have this in their â",
      "total_reactions": 3,
      "user": "TrueCusp"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "Well, it's been three months since I last saw this sequel in cinemas before I saw Pixar's Cars 2 (I'm one of the few people who liked that movie). Let's just say I enjoyed the predecessor that had groundbreaking animation, an amazing voice cast, spectacular action scenes, hilarious comedy, and Hans Zimmer's and John Powell's beautiful music score. So, I like when Dreamworks Animation makes very successful that captures the magic of the original. That's why we get Kung Fu Panda 2, a satisfying sequel to an amazing movie even though it's not a masterpiece. It captures the magic of the first movie that makes it very entertaining to watch.",
      "total_reactions": 2,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "Luckily Kung Fu Panda 2 had some emotional depth so it wouldn't be just an okay film it actually ends up being a huge improvement. It adds to that with some great animation and fantastic action and a whole lot of humor.  I give this movie 93% of a good film.",
      "total_reactions": 7,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2011
      },
      "score": 3,
      "text": "The original Kung Fu Panda was one of the best. The cream of the crop, the best of the best. Does the sequel match it's predesessor? I went to see the movie in 2-d and was amazed. At the sheer dissapointment that is. The original was fun and funny. This wasn't. It attempts to be both funny and slightly more serious while targeting a younger audience. This completely ruins all the best aspects that it could have had. The plot is seriously underdeveloped from what it could have been. Plot: talk, fight, fight, fight, fight, fight, win. That is literally the entire plot. I give it a 3 out of 10",
      "total_reactions": 16,
      "user": "dude77ever"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2011
      },
      "score": 4,
      "text": "Only half as much fun as the first one - dont expect anything like the humour in KFP1. So many of the characters barely have any dialogue in it, just a lot of fight scenes",
      "total_reactions": 9,
      "user": "Srad"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "The original Kung Fu Panda was more sophisticated in its humor making it very enjoyable for adults as well as kids.  It was also funnier, and didn't have quite so many fight scenes.  The producers have fallen into the Hollywood trap of having as much action as possible.  It needed more quiet moments like in the first film.  Still, it was entertaining and looked great, although the 3D was not worth it.  The entire time I was wishing I was watching it in the bright 2D instead of the dull, dark 3D.  It will make the Blu-Ray all that more exciting to watch I suppose.  Overall good, but disappointing considering the first one was so great.",
      "total_reactions": 1,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2016
      },
      "score": 2,
      "text": "The problem with the film is that it isn't funny. Kung Fu Panda is meant to be funny, the first one had lose of jokes and great moments, where as in this one, there is a single good joke that made me laugh out loud, the story is serviceable and does its job to carry the film along. But it needed the funny jokes and good humor to hold the film up, but it just doesn't have them.",
      "total_reactions": 1,
      "user": "The1anonly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "Absolutely heartwarming. Jack Black's enthusiasm and thirst for life permeates the film.  More than anything, it's a fun movie with some truly touching moments.  For me to say that about an animated film is saying a lot, as it's not my genre of choice. It's right up there with the best of them.",
      "total_reactions": 0,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "An absolutely spectacular sequel. Kung Fu Panda 2 improves on everything the first one accomplished. The animation is nothing short of amazing, and the action scenes are much more dazzling. Additionally, the film is downright funny, even more so than the first. All this is well and good, but I what I enjoyed most about this sequel was its emotional resonance. The film journeys down some dark places, and explores Po's mysterious origins. It handles it very maturely, and the story is much more involving than the first. This is further proof that Dreamworks is perfectly capable of competing with Pixar. Kung Fu Panda 2 is a hit.",
      "total_reactions": 0,
      "user": "FrozenStar90"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "Tigress looks away, out of embarrassment and understanding, when she sees a miniaturized replica of herself, an action figure that the goose mistakenly believes his son had left behind while packing for Gongmen City. Knowing chuckles from her teammates break out. Just because a stark-raving mad **** with a genocidal streak is threatening to blow up all of China to kingdom come, it doesn't mean that the Furious Five can't poke fun at their exceedingly uptight friend, for levity's sake. True enough, Lord Shen means serious business. The cannon that he developed could be curtains for kung fu, but how can they not laugh at the appearance of the Tigress doll, and what it signifies to a panda bear who is old enough to breed, yet can't do anything about it, since he's the last of his species, purportedly? The Viper is also female, but even though interspecies love can and does occur with relative frequency, the tigress, with her mammalian(as opposed to reptilian) charms, probably wins by default. Mr. Ping, just like any parent of a teenager, is worried about his son's sex drive, so maybe it's actually a calculated move on the father's part to infantilize Po, therefore making him less attractive as a potential mating partner. In \"Kung Fu Panda\", the goose seems well-aware of his son's fantasy life. Sounding more like a henpecking mother than a father, the bird asks loudly, \"What are you doing up there?\" from the kitchen in their humble abode, when he hears suspicious noises emanating from the bear's room. The sound that piques his imagination is that of a prostrated panda with major weight issues, struggling to get up from the floor. From this most humbling of beginnings, things turn around real fast for this morbidly obese bear. Other than being a tribute to the \"wuxia\" genre, \"Kung Fu Panda\" may be the most inspirational movie about big people since \"Angus\". Later on in the first film, the battle of the bulge, a losing battle, the result of a gluttonous appetite, greatly undermines Po's ability to fulfill his destiny as the Dragon Warrior, as he eats Shi Fu out of house and home while training at the vaunted academy under his tutelage. Unfairly, the Furious Five take issue with the fact that their savior, the chosen one who will lead them into battle with Tai Lung, can't fight, let alone, get an unobstructed view of his toes. So prejudicial are their feelings toward Po's perceived weight problem, this insular group talks freely about their leader while he's within earshot, not realizing that to another panda bear, or a pack, Po is the right size. \"Kung Fu Panda 2\", however, delves into the backstory as to how a goose ended up raising a bear, and in the process, shows us that Po's ungainly weight problem is a matter of nurture, not nature. When Ping discovers the panda cub mixed-up with the radish delivery outside his noodle shop, the restauranter overfeeds Po, because, in all likelihood, he was fattening the bear up. The iconography is straight out of \"Hansel & Gretel\". As he eats, Po sits in a pot, the prelude to a date with the oven. In \"Kung Fu Panda\"(starring Jack Black, the David Carradine of \"yellow-voice\"), when Ping tells his son that the secret ingredient is \"nothing\", he's lying. The secret ingredient is animals. \"Broth runs deep in our veins,\" he says, meaning blood. Unbeknownst to Po, the goose makes him complicit to the enterprise of meat. It's as if Orwell wrote the script for \"Soylent Green\". Upon hearing this startling revelation, Po, in return, cracks the riddle of the sacred scroll, which enigmatically, turns out to be blank. Likewise, nothing. That is how the evil snow leopard interprets the document, reflecting as it does his own image of himself, which also denotes the attitude of the goose towards the furry creatures who inhabit the Valley of Peace, panda included. The sequel reminds us that Po belongs to the ethnography of animals, not bears, so he is fat, as defined by mainstream cultural norms. Lucky for this lowland community, the dragon warrior misinterprets his father, and fulfills his destiny. In the sequel, Ping adds tofu to the menu, whereas in the original film, he dismisses the very idea. Now that the goose uses Po's celebrity to promote the noodle shop, he can afford to go vegetarian. Po is still fat by non-panda bear standards, but the cachet of being the dragon warrior more than offsets those extra unsightly pounds. On the boat, on the heels of being humiliated in front of the tigress, the fairer Bengal finds Po struggling with inner peace, as he bangs his head against the mast. She tells him, \"The mast is not a worthy opponent,\" then offers him her open palm. \"I'm ready,\" the tigress says(read: romantic love is better than self-love). But a scared Po replies, \"I think I prefer the mast.\" After he takes down the ****, however, it's the tigress's turn to be shy. During some kung fu hugging, her body stiffens.",
      "total_reactions": 0,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "Kung Fu Panda 2 was pretty good and it's a lot of fun to watch. It's very decent, but it would be more better if the sequel will be much more hardcore and awesome at the same time, just like the first one. The 3D scenes could be fun and sometimes it's a little bit too much that it gets irritating with the fight scenes and the story, so we could take off our glasses and see it in 2D at least. I like those characters and they bring back more fighting styles since the last movie, but they updated just more. The story is cool and it tells that Po must fight the villain who will take over the world and destroy kung fu fighting ever. The animation is great and the sentimental moments gets me crying in the last scene, and the fighting scenes is very awesome. I enjoy to watch once again with those guys and it's not that too much like the original, but it's good.",
      "total_reactions": 0,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "While it has some tone issues and the narrative could be a bit more tight I’m willing to overlook that. Often we get lame, half-assed sequels. However, this film despite its issues is a good sequel that may/probably surpasses the original. It raises the stakes, gives us a better villain, and an epic movie. This franchise has two good films and hopefully the third one does just that (the ending implies that there is going to be sequel). If you liked the first one and are concerned that the sequel will suck don’t worry it doesn’t and even if you don’t like it as much as the first its still a good and enjoyable movie. This is one of the most epic, cinematic, and engaging films to ever come out of Dreamworks.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "Had lots of fun with the Panda and his posse this time around as well. It is funny, heartfelt and beautifully animated.  Already waiting for the next installment :-)",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "I loved the first Kung Fu Panda movie and loved this one too. It was funny but also serious at times too. I'm probably not in the intended demographic for the movie but I loved it all the same. A great one for the kids but also a film adults could quite possibly enjoy too.",
      "total_reactions": 0,
      "user": "JamesNWA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "I admit to being jaded with Hollywood's tendency to pump out sequels that amount to a pile of garbage for profit but was pleasantly surprised to find this a worthy follow up to the first Kung Fu Panda.  My wife tends to be even more critical of movies than I and still called this one \"fun to watch\".  We saw it in 3D and it made the action scenes even more entertaining.  All the elements that you enjoyed in the first Kung Fu Panda are here again and put to a new engrossing story line.  So sit back and enjoy the show.  I know I did.",
      "total_reactions": 0,
      "user": "vanion2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2011
      },
      "score": 7,
      "text": "Kung Fu Panda 2 is a good movie but I wouldn't call it better than the first. It has a lot more fighting and the story of Po gets more deep. All of this is positive but the movie has less funny moments, monments that grown ups can laugh too not only kids.",
      "total_reactions": 0,
      "user": "Punker29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "I think i enjoyed this more than the first part. The humor is at least as good. The visuals and animations are as dazzling as ever. The action sequences are pure awesomeness. The story is interesting and heartfelt in many parts.",
      "total_reactions": 0,
      "user": "adhamhany"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "The movie was good. I think it was better than the first one. It was funny, full of action, and had Jack Black was perfect for it. It showed Po's childhood and the ending was realy good. I cant wait for Kung Fu 3!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!1",
      "total_reactions": 0,
      "user": "cfh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2011
      },
      "score": 7,
      "text": "it's a fun, entertaining, feel good movie. not as great as classic pixar movies that pull at the heart strings, but i wouldn't hesitate  to recommend watching this movie to others.",
      "total_reactions": 0,
      "user": "sle0609"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "I came out of the theater with just as mixed feelings as I went into it with. While it definately wasn't as good as the first, it definitely held its own. Some stuff didn't work, or just felt like it had already been done to death in the first. This being said, it did have its share of laugh out loud moments. Additionally I really disapprove of their choice to make a third, as the strongly hint at the end of the movie. Not a good move.",
      "total_reactions": 0,
      "user": "jredekop"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "I can already feel your ire, dear reader, that I cast aside other film candy (GWTDT, Drive, The Help, War Horse) and instead give praise to a cartoon sequel. But I encourage you to withhold judgment until you see the film. Yes, the story may be a tad predictable, but such is the state of the modern kung-fu movie. And the delight of Kung-Fu Panda 2 (unlike its more cutesy,",
      "total_reactions": 0,
      "user": "NKOAS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "i think this movie was AWESOME...I can't say which part is better but what really surprised me was that this one wasn't a flop....like most sequels are these days...WELL DONE",
      "total_reactions": 0,
      "user": "SarcasticTruth"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "I got problem with the script. Not so awesome. Not so bad.  Not so funny. Eye-catching animation. Pretty good score. Darker. The only animation lives on this movie is Lord Shen, thanks to great Gary Oldman.",
      "total_reactions": 0,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "Dreamwork never fails to produce. Kung Fu panda 2 can be said to be an extremely succesful movie given its brilliantly written storyline. Throughout the film, the story flowed well accompanied by stunning action. One disappointment though is that the film lacks enough good comedy as many are eiter childish or cold.",
      "total_reactions": 0,
      "user": "moviecc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "No where near as good as the first. This animation is excellent however, and the action is entertaining. Unfortunately, a subdued musical score and a lame antagonist bogs this film down more than it should.",
      "total_reactions": 0,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "A+ for pandas.",
      "total_reactions": 0,
      "user": "gleenobly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "best movie in current times. enjoyed a lot. neat narration and good direction. all together the best animated movie since 2 years. my vote for it 9/10. po rocks!!! all the best for the collections as it is going to be a blockbuster of the year",
      "total_reactions": 0,
      "user": "KhangJim1998"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "Kung Fu Panda 2 is big, hearty and incredibly funny animation sequel. There's more at stake this time round with Po (Jack Black) and the Furious Five not only fighting to save China from the tyrannical Lord Shen (Gary Oldman), but we also delve into Po's mysterious past, and shed some light on why his father is a goose. The animation is still superb, and has clearly stepped up a level to deal with the more complex action set-pieces and a huge variety of beautifully rendered environments. Black seems to have found his ideal role in Po the panda, and the character remains endearing on his second outing. Angelina Jolie again impresses as the introverted Tigress, as does Hoffman's stoic Master Shifu (though his role is sadly reduced this time around). The all-star cast voicing the other members of the Furious Five (Jackie Chan, Lucy Liu, Seth Rogen and David Cross) thankfully have a little more to do than in the first film, Gary Oldman adds another great villain to his repertoire as resentful, power-hungry **** Lord Shen, and Michelle Yeoh has fun as an elderly goat soothsayer. James Hong is once again the best thing in the film as Po's dad Mr. Ping - his relationship with Po is tender and believable, and Hong manages to perfectly balance the elements of comedy and tragedy in his character. Though there's more scope for genuine drama in this film than in the first, it has lost a little of its charm in this second outing, and though it's only a couple of minutes longer than the first installment, it feels considerably more so as the plot does drag a little in places. While the exploration of Po's history is good for character development, it does at times cause the main story to lose momentum, a problem the first film, with it's much more linear plot, never suffered. I also feel the film's finale takes the whole \"inner peace\" message behind the story's martial arts elements a little too far, and the very final shot of the film is simply a narrative cop-out designed purely to set up a sequel. Even so. Kung Fu Panda 2 is a thoroughly respectable sequel that often equals and sometimes even surpasses the successes of its predecessor. It looks gorgeous, is fun and action-packed, with some good jokes and nice emotional kicks.",
      "total_reactions": 0,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "Gags and antics aside, this is a film about self-actualization. It succeeds at being stand-alone and is fun, fast-paced and instantly enjoyable. Watch this with your daddy.",
      "total_reactions": 0,
      "user": "itz_giological"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "I was really surprised by this.  Everything was very well done, from the humor to the beautiful animation. I just wanted to mention two highlights.  One is the villain.  The villain can make or break an action film, and here, the white **** Shen, is truly inspired.  He is stylish, funny, and a thematic foil to the hero, Po.  The other point is the emotional heart of the film between Po and his father.  Their scenes together walk the line between humor and heartbreak perfectly.  Well done to Dreamworks.",
      "total_reactions": 0,
      "user": "MonkeyKing"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "This was a great addition to the original Kung Fu Panda. Many questions to the first filmed are answered by this one! Also, more diverse and interesting characters were in this one, without rehashing old characters that aren't needed.",
      "total_reactions": 0,
      "user": "Zpwnancer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "Really good follow-up to the first movie.  Kids enjoyed this movie and great adult humor.  Definitely will see again in theater...must own DVD once released!",
      "total_reactions": 0,
      "user": "tony_t01"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "Good movie, but first was better. In the second film i don't feel that strange feeling that film is about me. But \"Kung Fu Panda 2\" has good humor, a lot of fighting, very impressionable Tigress. So I buy it, when it will be sold on DVD.",
      "total_reactions": 0,
      "user": "Lavreng"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "The film has some small funny moments but it's physical comedy and dulled down storyline are better left for the kids to watch on DVD night rather then good money waisted at a theater.",
      "total_reactions": 0,
      "user": "filmtrashreview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "This movie had less and cheesier comedy the first movie. The action and the story was much better than it though... Yet, it seemed to me, that one thing went on and on. So, overall, I like the first movie better.",
      "total_reactions": 0,
      "user": "NiteOwl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "To my surprise. I actually enjoyed watching the Jack Black Panda for the second time. The story could have been executed better but other than that, the movie was enjoyable. Good story, lots of kungfu fighting and hilarious moments is what Kung fu panda is all about. I recommend watching it with or without kids. 9/10",
      "total_reactions": 0,
      "user": "Acidosis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "Amazing movie! Everything about it was flawless. The only reason I give it a 9/10 is because it's the sequel to Kung Fu Panda, which was a 10. The movie's journey into the history of Po was brilliant, and there were so many laugh out loud moments. Overall, enjoyable cinematic for the whole family! Recommended for everyone.",
      "total_reactions": 0,
      "user": "PixmaKing"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "It's a nice movie for fun, I don't recommend 3D cause it's not really 3D but in the end, 3D is sort of important(i guess). It's very fun and sort of touching, sends nice messages for everyone. The characters are sooooo cute and i'm looking forward to lovely doveys in Kung Fu Panda 3 :). You should go watch it, it is those \"should watch but not super good or bad\" movies. It's not boring, but I took one mark off because it's... well... too normal.",
      "total_reactions": 0,
      "user": "Broken_Shirt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "A movie that proves Dreamworks is catching up with Pixar. The Spectacular, artsy animation goes along perfectly with the Strong story. This shows Dreamworks at their best and is a must-see for fans of animation.",
      "total_reactions": 0,
      "user": "fistobuizel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "Kung Fu Panda 2 is an incredible film. It has a great story, the humour in this film is hilarious, the characters are very well done and the visual are great. My only problem with this film is its a bit familiar to the first Kung Fu Panda film. Adults and children will enjoy this film. I would give this film full price!",
      "total_reactions": 0,
      "user": "Edward9630"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "Hes back and hes done it again !! Sometimes i wonder how **** Po's character would have been if Jack Black never got the gig .. Kung Fu panda 2 definitely is one badass movie . The visuals are impressive and the aesthetics were well balanced . Apart from the dynamic entourage of the Furious Five, Gary Oldman's Shen charater kept the audience rofling . The story was well set and Po's origins were cleverly built. Although the story had certain Rowling-style Self-fulfilling prophecy themes the adrenaline fueled action totally entertained the audience . Jack Black's one liners were legendary !!! Hope our favourite cuddly black and white warrior will return for yet another kickass movie next summer ...",
      "total_reactions": 0,
      "user": "Prvsh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "Pretty good movie. I was laughing the whole way through it. The animation and voice acting is of a high quality as well. This is one of the few movies that I can say that the sequel is better then the original. Its also one of the only Dreamwork's films that I didn't find stupid. One of the bad things was the storyline of Poh trying to find who his parents are.  Although its not a deal breaker, it defiantly takes away from the whole experience. There are some very impressive fight visuals and if you see it in 3D. These look amazing. All in all its a pretty good movie. I suggest seeing it if your looking for a light hearted laugh.",
      "total_reactions": 0,
      "user": "mikefish"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "Kung-Fu Panda 2 is brilliant. Probably the best release I have seen this year, even better than X-Men First Class. Great theme throughout the movie which makes it great for kids aged 8 and above. This is a movie worth buying when it comes out. The better choice by a million miles out of Cars 2 and Kung Fu Panda 2.",
      "total_reactions": 0,
      "user": "shimano6000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "Not as good as the first film but it was really interesting . It wasn't funny like other Animation films . They put much focus on the emotional and action part . The emotional parts remind me the film UP which won Oscar . I still think Kung Fu Panda will win Oscar but the first one deserved more . One character i really missed was Grand Master Oogway . I know he was dead but He could appear in flash back scene with some of his awesome Advices . the action scene was awesome but i dont like the city (Gongmen City) . It was too darker which is not for animation films . They could make the city really beautiful and natural . I hope next time they will think about it and yeah! i would love to see more sequels and soon . Overall Kung Fu Panda 2 is a good animation film ....At least it was way better then Shrek's 2nd & 3rd sequel .",
      "total_reactions": 0,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "Deze film was zo goed! We konden erom lachen en tranen laten! Gewoon zo mooi! Nog beter dan deel 1, echt super!! We kunnen niet wachten en hopen echt op een deel 3! We zijn 3 keer naar de bios geweest, en in 3D wat geweldig zeg!! Echt heel goed gedaan zeg! Maar waarom is er bijna geen speelgoed van kung fu panda? IK hoor zoveel kinderen die speelgoed willen van kung fu panda en noem maar op. Hoop echt dat dat er komt.",
      "total_reactions": 0,
      "user": "Joyce"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "Jack Black is back in the sequel to 2008's Kung Fu Panda, in Kung Fu Panda 2. KFP2 is considerably darker than the original in it's story, as Po finds out that he is adopted, and must defeat Lord Shen, the **** who killed his Panda parents and wishes to conquer China. KFP2 has all of the same characters from the original that survived, and the action scenes are still awesome.",
      "total_reactions": 0,
      "user": "cameronrules36"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "Finally got around to seeing Kung Fu Panda 2. And I gotta say... this was a great experience. Quite amazing that they managed to create a second film at least equal to the first one, which was a sensational animated film. Not prepared to say it's better than its predecessor, because it's still new and fresh in my mind and there's some afterglow lingering about. The first film had a few majestic shots that this one lacked, like that tranquil scene where Master Oogway ascends in a flurry of petals while Hans Zimmer and John Powell's powerful music swells. On the other hand, there are jaw dropping scenes in this one that you didn't find in the first entry. So yeah, all in all it feels about as good as the first.",
      "total_reactions": 0,
      "user": "Delta_Assault"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "Such a wonderful sequel. Very hilarious, dramatic, tense and heart-warming. It is very touching, and for viewers, it should be very easy to relate to Po. However, I found it a little disappointing that Master Shifu does not appear quite often. The last scene in the movie hints that there may be a 3rd movie, making Kung Fu Panda a trilogy. If this is the case, I cannot wait to see it.",
      "total_reactions": 0,
      "user": "Yoshipie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "Honestly im really amusing with this movie,,",
      "total_reactions": 0,
      "user": "Singgihsatch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "Strictly for the kids but if you are thinking about a film to see with your family, this may be it. It is wondrous to look at with suberb animation (what do they call this computer generated stuff any way? still CGI?). The story is old hat and has a long slow setup, which may cause the kids to fidget, but there is enough here to talk about after the film is over. Fight scenes look good, fast action, no blood or broken bones, and the good guys win, most of the time. Voice characterizations are exceptional for Mr Oldman, Mr Hoffman, and Mr Hong. Mr Black is his usual self. Overall a fun Saturday afternoon outing with the kids.",
      "total_reactions": 0,
      "user": "RobinsNest"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "\"Kung Fu Panda 2\" was very good. It deals with meaningful content of the search for self and inner potential building from the previous installment. It is strong in martial arts formula and does fulfill the requirement of meaning and actualization of power to surpass the first film without diminishing its potency. Not a Gigantic fan of the \"Kung Fu Panda\", however it seems to grow better and more enjoyable with time. This is the sign of a truly great film.",
      "total_reactions": 0,
      "user": "NERvOSA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "This movie was ok, it wasn't even close to be as good as the first, it was way too dark for me personally. Kung Fu Panda was so funny, This movie, I didn't laugh once. The most ridiculous thing was however, the **** as the villain, who ever came up with that has some issues...",
      "total_reactions": 0,
      "user": "HMW"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "This was a fun movie for kids and adults alike. Is is a great movie to watch with your kids.   I think that there is something in it for the whole family.",
      "total_reactions": 0,
      "user": "nomadcane"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "â",
      "total_reactions": 0,
      "user": "AwesomeReviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "I like Poâ",
      "total_reactions": 0,
      "user": "AutiTakahashi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "\"Kung Fu Panda 2\" is about the same as the original, if not, slightly better. The energy in this film is significantly higher than in the first. The animation, just like the first, is great with excellent CGI. If you loved the first, you won't be disappointed by this.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "While not as memorable as the first, the humour still sticks, the action still shines and the story goes deep. With characters you care for and relatable motivations, Kung Fu Panda 2 is proof that a sequel can be just as enjoyable as the original.",
      "total_reactions": 0,
      "user": "HazzaGalla"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "It's really the best movies i have ever senn. I think who give this movies a bad rating then he or she doesn't know anything about animation movies. .",
      "total_reactions": 0,
      "user": "hacmiu36"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "It's great sequel to the original by far! However, there are a few minor issues I had with the movie. The comedy was surprisingly not that funny at all, they felt like the same jokes from the first one, only less stupid than usual. Not only that, but it's VERY predictable. Just watching the beginning, I already knew what was going to happen next, even half-way through the movie I know already Po's going to beat this guy. Also, the movie felt short. Well, put those issues aside and you got a decent family film. Just wish they did more than this, and I don't mean by adding more comedy. Just put more focus on the plot, action, and more imagination. A simple story about the main character's past isn't really surprising to the audience 'cause it has already been done numerous times.",
      "total_reactions": 0,
      "user": "savagejoe444"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "\"Kung Fu Panda 2\" can reach the heights of its original, but the problem remains, that the original wasn't that great. With its humor still reaching, and its action still great, the \"Kung Fu Panda\" movies can fail at reaching levels much more, and doesn't give much more than just an action packed kids movie. Sure, \"Kung Fu Panda 2\" tries to add more heart into it, but it somehow feels out of place with all the action, and doesn't give a deep sentimental purpose. Unlike films like \"The Incredibles\", Dreamwork's struggles to perfectly click these together. Overall, don't get me wrong, it is good, but just, nothing better than its good (not great) original.",
      "total_reactions": 0,
      "user": "jeff_reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "My fist hungers for justice!",
      "total_reactions": 0,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Though not as original or playful than the first, the sequel matches up with its wit, comedic action, and pitch perfect voicing. The animation is the same as the first, but still, interesting to see. Those who loved the first should absolutely watch this.",
      "total_reactions": 0,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Just one of the best CGI movies ever. Great characters heartworming story, and Gary Oldman as a bad ass  Just go watch it if u never see it, and if u did go see it again. NOW!!!",
      "total_reactions": 0,
      "user": "Big"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "I love it when a movie has a sequel and the sequel isn't terrible. I was expecting a bad movie, but I was actually impressed. It had the same humor as the first one, plus an almost amazing story.",
      "total_reactions": 0,
      "user": "cag11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "Funny story, my sister and a few of my cousins actually went to the movies during May of 2011, which was when Kung Fu Panda 2 was released, but instead of seeing KFP2 (like 13 year old me should of been doing) we saw the subpar sequel: Hangover Part II. And I remember when I rented Kung Fu Panda 2 on DVD several months later I thought, \"Well... I'm not going the movies with my sister ever again...\" Harsh, but I really didn't like Hangover Part II back then being the immature **** I was (even at 17 I still don't like it), and missing out on the sequel to Kung Fu Panda really helped cement my opinion on Hangover II.",
      "total_reactions": 0,
      "user": "ThatCooperGuy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2016
      },
      "score": 10,
      "text": "How do you top a film as fantastic as \"Kung Fu Panda?\" I have no idea but somehow, DreamWorks has done it. \"Kung Fu Panda 2\" manages to provide a fleshed out story, great character development, an amazing villain, really funny jokes, tremendous action scenes and absolutely gorgeous visuals, making this one of the closest things to perfection that you can find in animation. There's no two ways about it, \"Kung Fu Panda 2\" has it all, and it easily stands as one of DreamWorks' best films. If you enjoyed the first film, you should ABSOLUTELY see this film! \"Kung Fu Panda 2\" is a brilliant animated film and a great time for the whole family.",
      "total_reactions": 0,
      "user": "FreedomFighters"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "Kung Fu Panda 2 es una película que supera a su entrega pasada, en donde hay más drama pero no se pierde la comedia que ofrecía el primer film de esta película de animación.",
      "total_reactions": 0,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "The latest installment of Kung Fu Panda series is not as good as its predecessor, but this summer flick tells a cool tale and brings new and likable characters.",
      "total_reactions": 0,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "Undeniable graphical quality and surely an irresistible piece for the younger audiences but I cannot help but feel that the opportunity for any serious character development and further depth into the story is overshadowed by the enormous amounts of clichés and potty humor.",
      "total_reactions": 0,
      "user": "cylian3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "It's just as good as the original in every way, awesome fight scenes, and a really nice backstory for Po. At the same time the characters are all the same as they were before and keeps up the quality of the original.",
      "total_reactions": 0,
      "user": "Delaforce828"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "I love this movie finally a sequel better than the original how often does that happen. the animation, action, acting,characters, comedy and story have some how gotten even better and new cast members like michelle yeoh are very welcome and gary Oldman plays on of the best villains in recent memory. as good as the original Kung Fu Panda movie is this was better and is in my opinion Jack Black's best movie ever",
      "total_reactions": 0,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "To Be honest this is certainly better than the original! It's a complete masterpiece.The characters are likeable and they're badass! Kung-Fu Panda 2 is a sequel worth watching!",
      "total_reactions": 0,
      "user": "JohnKristofer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Kung Fu Panda 2 is a solid animation blockbuster. Jack Black brings more energy and flavor to the sequel. Although the story may lack the ambiance the first installment had, it is bounded together by its countless humor (even going sentimental) and improved animation.",
      "total_reactions": 0,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2015
      },
      "score": 5,
      "text": "It's satisfying, nothing special. It lacks itself on multiple levels compared to original, but still enjoyable. Overall, just a time waster, a common film by Dream Works.",
      "total_reactions": 0,
      "user": "RonBurgundy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "Not as good as the first in terms of humor and heart. But it's action, and improved animation make it a worthy sequel. The voice acting is solid and it has likable characters as well as a solid storyline. The music is great and the new villain is cool and interesting( considering he is a peacock)",
      "total_reactions": 0,
      "user": "Kira45"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "Kung Fu Panda 2 shows that if you have very good writers and good ideas, can accomplish to make a double bright and fun sequel . They improved the action, improved the characters improved the comedy and they put drama for scenes where you drop tears. They made even more emotional , and that's what makes  Kung Fu Panda 2 awesome, make it better than the first one . For those who liked the first, surely they going to love this sequel and probably also the third.",
      "total_reactions": 0,
      "user": "CriticFer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "I liked the villain and the martial arts staid up par with the first movie, it just fell a little of with a few things but overall it is a good sequel. I am also expecting this kind of success to stay in the third movie.",
      "total_reactions": 0,
      "user": "Jollyjoe1000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2016
      },
      "score": 7,
      "text": "A fun addition to the first, as well as something completely different. The first was more of a comedy with action scenes, while the second is more of an action movie with comedic scenes. It's visually gorgeous, the 3D is great, and it'll waste an hour and a half. Kids will love it.",
      "total_reactions": 0,
      "user": "aadityamudhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "With Kung Fu Panda 3 coming in, it's only the best time to review the first two movies starting with the second because it's my choice. Kung Fu Panda 2 will successfully bring back the fans of the franchise for one last adventure.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2016
      },
      "score": 8,
      "text": "Kung Fu Panda 2 is gorgeously and deeply made, perhaps it's better than the original. With Po's past and a new storytelling Dreamworks has just managed the right chords to make satisfing and well made movies, sure after the disastrous Pixar's Cars 2. The final is just perfect and fits excellently to start a third part. Had \"The Adventures Of Tintin\" been not released in 2011, Kung Fu Panda 2 would have been the best animated movie of the year (80%)",
      "total_reactions": 0,
      "user": "DavidTejada"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2016
      },
      "score": 9,
      "text": "This is one of the sequels that gets it better than the original. Kung fu panda 2 makes things better with more developed characters, a funny and better villian, action, comedy, and a more emotional impact. Plus kung fu panda 2 has better moments, with the main character, po, facing one of his greatest challenges.",
      "total_reactions": 0,
      "user": "gameguardian21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2016
      },
      "score": 6,
      "text": "Kung Fu panda is one of the bests sequels ever, continuing totally efficient with the original film, but it's more violent and not-enough funny as the first one. But fans will easily be pleased with this new Kung Fu Panda.",
      "total_reactions": 0,
      "user": "Futuredirector"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "Sheer entertainment, energetic action sequences, an awesome villain, great voice acting, cool storyline, creativity and lavish animation is what makes Kung Fu Panda 2 a very good successor to the also great Kung Fu Panda.",
      "total_reactions": 0,
      "user": "CalibMcBolts"
    }
  ]
}