{
  "avg_user_score": 6.9,
  "metascore": 63,
  "mixed_rating_frequency": 16,
  "movie_name": "Laggies",
  "negative_rating_frequency": 1,
  "positive_rating_frequency": 26,
  "pro_critic_reviews": [
    {
      "critic": "Inkoo Kang",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2014
      },
      "score": 90,
      "summary": "Shelton's comedy isn't just smart, but cheerfully wise; not just funny, but cleverly and endlessly so."
    },
    {
      "critic": "Emma Myers",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2014
      },
      "score": 83,
      "summary": "Even if the film doesn't leave much to ponder past the closing credits, it's enjoyable while it's unfolding, doing justice to the strengths of Shelton's ever-expanding filmography."
    },
    {
      "critic": "James Rocchi",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2014
      },
      "score": 82,
      "summary": "Superbly written, handsomely made and full of terrific performances, Laggies is Shelton’s best film to date."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 80,
      "summary": "The director is increasingly adept at getting her actors to bask in emotions without any pretensions. It makes for easy watching. Seigel's breezy script makes the dialogue easy listening."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2014
      },
      "score": 75,
      "summary": "Laggies doesn't reinvent the wheel, but it puts an engaging spin on the old canard about high school being the best years of our lives."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2014
      },
      "score": 75,
      "summary": "For the most part, Laggies offers an engaging portal into the life of an appealingly confused 28-year old who doesn't have all the answers and isn't afraid to admit it. Coming-of-age stories, it seems, needn't be limited to teenagers."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2014
      },
      "score": 75,
      "summary": "So here’s the case of a movie that is, in every way, nothing special — except for the way it’s made and how it’s done."
    },
    {
      "critic": "Melissa Maerz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2014
      },
      "score": 75,
      "summary": "What saves Laggies is Knightley, who's all gangly limbs and pouty faces, schlepping around in pajamas, acting exactly like a teenager trapped in a grown-up world."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2014
      },
      "score": 75,
      "summary": "It's a gentle, amiable, sincere little movie, and we could use about a hundred more Lynn Sheltons in this business, making movies that feel this lived in, this true."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2014
      },
      "score": 70,
      "summary": "It's fun to watch the actors work. But you wish they had material a little stronger to work with. Laggies doesn't give it to them."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2014
      },
      "score": 70,
      "summary": "We basically know where Laggies is headed; the film is a soft, straight, easy pitch down the middle, story-wise. And it’s a light movie: You won’t get a particularly profound look at adults who act like kids from it."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2014
      },
      "score": 70,
      "summary": "Even though Laggies is clearly well-intentioned — and the anxieties it tussles with are completely believable — the film is awkward in ways that are sometimes charming and sometimes off-putting."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2014
      },
      "score": 70,
      "summary": "More structure and polish doesn't keep Lynn Shelton's latest from being recognizably hers."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2014
      },
      "score": 70,
      "summary": "If the narrative progression feels too tidy and circumscribed, Shelton’s talent for bringing out the best in her actors remains satisfyingly intact."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2014
      },
      "score": 67,
      "summary": "Despite its pleasant veneer, Laggies is a bit adrift itself. Winning performances keep us engaged – and a one-sequence appearance by Gretchen Mol as Annika’s mother who flew the coop is hauntingly complex."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2014
      },
      "score": 63,
      "summary": "There are enough indie clichés to blunt this movie’s edge."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2014
      },
      "score": 63,
      "summary": "Laggies possesses irrepressible cheer, optimism and an innate sense of ease that often go missing in angstier productions loosely organized under “Aging, fear of.” Unlike its sometimes annoyingly wishy-washy heroine, this is a movie that knows just where it’s going, and finds joy in the journey."
    },
    {
      "critic": "Steve Macfarlane",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 63,
      "summary": "To Keira Knightley's credit, she's all too willing to undercut her pretty-girl reputation by looking and acting a fool for Lynn Shelton's camera."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2014
      },
      "score": 63,
      "summary": "The best thing about the film – which is true of most of his roles – is Rockwell."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2014
      },
      "score": 63,
      "summary": "Moretz is as real as ever, and Knightley manages Megan’s transition from annoyingly naive to adorably confused. But for that she has help, and for that she and we should thank Rockwell. In this case, the actor most accomplished at playing slackers is the one who gets everybody — and the movie — to grow up."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2014
      },
      "score": 60,
      "summary": "Even when Laggies strains against its contrived conceit, his (Rockwell) chemistry with Knightley goes a long way in classing up the joint and making Shelton's film feel just deep enough to pass muster."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 60,
      "summary": "This is a nice movie. It’s frisky and cheerful, even when tears are on the way. But it isn’t a very good movie, mainly because, like its heroine, it’s reluctant to make up its mind about what it wants to be."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2014
      },
      "score": 60,
      "summary": "The unavoidable obstacle is that the perpetually elegant Knightley does not belong. Not at a prom, not furtively partying in a parent’s basement and not, alas, in this movie."
    },
    {
      "critic": "Amber Wilkinson",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2014
      },
      "score": 60,
      "summary": "The plot strong-arms the characters into increasingly contrived and overly familiar positions that leave you longing for the more relaxed vibe of Shelton's earlier films."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2014
      },
      "score": 58,
      "summary": "Laggies itself isn’t exactly slow – its pace is pleasantly meandering – and it’s far from aimless, although what it’s aiming for isn’t always clear."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 58,
      "summary": "Shelton, who used to make scrappy, wholly improvised indie gabfests, continues to sand down the rough edges of her style, so that each new movie feels a little less distinct — and a lot less transgressive — than the one before it."
    },
    {
      "critic": "Rodrigo Perez",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2014
      },
      "score": 58,
      "summary": "Its patchy tone, plot, characters and sympathies make for a film that’s difficult to wholeheartedly endorse."
    },
    {
      "critic": "Calvin Wilson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2014
      },
      "score": 50,
      "summary": "Laggies is the kind of indie film that gives the genre a bad name."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2014
      },
      "score": 50,
      "summary": "The best of Laggies, both in the writing and the playing, comes in the square-offs between Knightley and Rockwell."
    },
    {
      "critic": "Odie Henderson",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2014
      },
      "score": 50,
      "summary": "I cop to not being a fan of Lynn Shelton’s work. Her films fall apart in their third acts. Rather than simply crumble as they have in her prior work, the third act of Laggies implodes in grand fashion, spewing contrivances, bad clichés and an ending that is simply unforgivable."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2014
      },
      "score": 50,
      "summary": "The movie’s compromised tone, wavering between emo introspection and rom-com cuteness, is awkward in all the wrong ways."
    },
    {
      "critic": "Noel Murray",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2014
      },
      "score": 40,
      "summary": "As Laggies piles up one scene after another of Megan’s boyfriend and all her old high-school chums acting exaggeratedly square, the movie’s comic point of view becomes overpoweringly sour and predictable."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "LAGGIES perfectly symbolizes everything right and wrong with the current indie film scene. On the one hand, the film, like others including JUNO, THE KIDS ARE ALRIGHT, ENOUGH SAID, and FRANCES HA, capture the feel and sound of modern American life. They capture us now. The complexity, the selfishness, the difficulties, but mostly the sound and rhythm of urban America for a certain class. They even throw their protagonists so many obstacles that a person could just break down and die or worse, live a miserable life like a Cassavetes character. Unfortunately, and here's the rub, LAGGIES like the other films mentioned can't resist a Hollywood cliche or a happy Hollywood ending. It's shameful and feels like pandering, which is what it is. LAGGIES has so much going for it that the end with its tidy little bow kind of pissed me off.",
      "total_reactions": 2,
      "user": "LowbrowCinema"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "A deep, sensitive look at the struggles of early adulthood and the relationships made along that journey. Keira Knightley gives another remarkable performance as a young lady with inner confusion. Sam Rockwell and Chloe Grace Moretz ain't half bad either.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "Keira Knightley's performance is absolutely stunning! All of her reactions towards the situation are real and very sincere. You can touch it from the very first moment till the end. Although the plot is easily be predicted, this movie has great elements mixing together that make me badly miss my friends and high school life.",
      "total_reactions": 0,
      "user": "FEEDMYBRAIN"
    }
  ]
}