{
  "mc_avg_user_score": 4.9,
  "mc_metascore": 32,
  "mc_mixed_rating_frequency": 28,
  "mc_movie_name": "Land of the Lost",
  "mc_negative_rating_frequency": 63,
  "mc_positive_rating_frequency": 59,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "a funny film i thought . i do remember waching the original tv show as a kid but i was like 8 and that was 20+ years ago and really dont remember much of any thing about it. no im sure its not very accurate to the original tv show and i think if it was might have been kind of boring actaully but ferrel and mcbride give it a nice spice of commedy that if you dont like ferrels humor you probubly wont like this film. he is hit or miss with me but this one was a hit and i had some good laughs waching it.",
      "total_reactions": 1,
      "user": "ArkonBlade"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "I seriously don't know what's up with the critics. This is so funny and awesome.",
      "total_reactions": 1,
      "user": "MichaelD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2012
      },
      "score": 6,
      "text": "i enjoyed it, i was surprised that some people were so hard on this movie.  it's easy to watch and has some good funny material throughout.  will has done better movies but this one deserves a watch.",
      "total_reactions": 1,
      "user": "moviefan2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "I was expecting something awful when sitting down to give the movie a watch, but it turned out to be kind of entertaining and even a little funny. While not necessarily a good movie, it has impressive CGI for a comedy and has some a fair share of jokes that made me smile. It's an entertaining watch that should not be taken seriously at all during it's 90 minute running time.",
      "total_reactions": 1,
      "user": "Captain_Kirk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "This. Move. Was. Stupid.",
      "total_reactions": 1,
      "user": "InvdrShadowPony"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2011
      },
      "score": 3,
      "text": "There were several disappointing things about Land of the Lost.  One was it's lost potential with a cast that included Will Ferrel, Anna Friel, and Danny McBride.  Another was the lackluster special effects; whether intentional or unintentional the people in what looked like Halloween costumes.  Maybe the worst, it actually shows a flash of humor every once in a while... only to bury it once again under the aforementioned horrible special effects, awful acting, and nonexistent plot.",
      "total_reactions": 4,
      "user": "CRL"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Hey, I'm a Movie Lover so basically I love all movies, I'm not really a Will Ferell fan (The only movie I really liked of his was Stranger Than Fiction) But, this Land of the Lost, It wasn't awesome, and it wasn't bad either, it was cute, Like just something to watch when your bored or really high.........",
      "total_reactions": 3,
      "user": "DerHasherman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "Will Ferrel and Danny McBride are usually very funny people. This movie doesn't do a good job of showing that. There are some funny bits scattered throughout, but overall the majority of it isn't really funny. This makes for a very dull comedy. One that you're better off passing on.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2011
      },
      "score": 0,
      "text": "Cast SUCKS!!! I Hate The Stupid Plot.. Acting Was So Bad..",
      "total_reactions": 1,
      "user": "RogerSmith97"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2011
      },
      "score": 0,
      "text": "I didn't have high hopes for the movie to begin with, just to be entertained.  I was not prepared for the inappropriateness,  senseless crude language, the sexual innuendo,  and gay sexual references.  The worst part was the anti-Christian message when Will Ferrell was tripping on a narcotic plant and said something to the effect of \"I love you more than Jesus loved humanity as he hung on the cross.\"  If you are interested in anti-Christian, gay supporting, drug defaulting, crude movies, this one is for you.  Shame on you Will Ferrell!  You can do better than that!",
      "total_reactions": 1,
      "user": "cd1"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2011
      },
      "score": 3,
      "text": "First off all, the cacophony produced by the clash of not-so-talented actors with a not-so-interesting story and a not-so-organized script closely resembles that of a band of musically uncultured, tone-deaf octogenarians. Second of all, the jokes found in this movie are not only extremely contrived, but also not even funny. The jokes fall as flat as the rest of the movie. I might understand if you're in the mood for a nonsensical, satirical, farce, but even then, this movie might not satisfy your craving.",
      "total_reactions": 3,
      "user": "MovieMachine"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2012
      },
      "score": 1,
      "text": "To put this its stupid, bad acting, g*y actors, awful story, really your better of falling asleep. Land of the Lost 1.1/10",
      "total_reactions": 1,
      "user": "watithink123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2012
      },
      "score": 0,
      "text": "Illogical, unfunny and stupid. Watching this movie is simply a waste of time. I should have donated the money used for buying the ticket. This movie is so disappointing.",
      "total_reactions": 1,
      "user": "xahkdlys119"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "Land of the Lost is truly that.",
      "total_reactions": 1,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2016
      },
      "score": 1,
      "text": "This movie was so stupid and dumb, it wasn't enjoyable. It's like a ripoff of Jurassic Park and Star Wars mashed together. A complete and utter waste of time watching Will Ferrell act like an idiot (more so than he already does). Skip this one.",
      "total_reactions": 1,
      "user": "RickyReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2017
      },
      "score": 4,
      "text": "A baffling mistake of a film that's as embarrassing as it is tiresome. Aside from a few witty quips here and there, the mean-spirited humor and implausibility left me shaking my head more often than I ever laughed. Brad Silberling definitely deserves an ounce of credit for bringing this semi-whimsical world to life, but with bad CGI layered on top of all the neat practical work, the creativity at hand is a tad more difficult to appreciate. A lesser film amongst the filmographies of everyone involved, \"Land Of The Lost\" is an ultimately empty jaunt through time and space, with very little substance or true fun to be had.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2015
      },
      "score": 4,
      "text": "\"Land of the Lost\" came from adapting a book to film was not brilliant but , as the absurd script, and tangled failed to amaze to the world, the critics and the viewers.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    }
  ]
}