{
  "mc_avg_user_score": 6.9,
  "mc_metascore": 34,
  "mc_mixed_rating_frequency": 54,
  "mc_movie_name": "Law Abiding Citizen",
  "mc_negative_rating_frequency": 42,
  "mc_positive_rating_frequency": 182,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2010
      },
      "score": 4,
      "text": "Law Abiding Citizen has a very strong beginning. I found myself caring for \"Clyde\" (Gerrard Butler) and wanting to see how he would change the American justice system. The scene where Clyde is in court and argues with the judge is a great example of this - he uses the system itself to prove his argument, and shows that the law needs to be changed for true justice to be served.",
      "total_reactions": 3,
      "user": "BenS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2012
      },
      "score": 4,
      "text": "Law Abiding Citizen plays with some interesting themes and issues but it doesn't seem to have a clue what it wants to say. Is the justice system corrupt? Is serious reform needed? Are Clyde's (Gerard Butler) actions justified? The film never gets close to answering these questions as it fumbles from act to act. It's a shame really because the performances aren't bad, Butler plays light and dark well with Jamie Foxx actually being a perfect foil for him as the straight laced realist. They play well off each other and dialogue wise, the script is pretty good so some scenes are thoroughly entertaining at least aesthetically. The problem is that the final product is so remarkably empty you can't look back on the things you like and leave the viewing with a positive reaction. It's a film trying to make some kind of a point but all you really get is a dark, gritty thriller that is void of substance. It doesn't help that the last 40 minutes move the film from gritty, character drama to cliche filled farce with a final twist so remarkably stupid it just ruins it further.",
      "total_reactions": 2,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2012
      },
      "score": 3,
      "text": "Clyde (Gerard Butler) had a reason to kill the people who killed his family: REVENGE but why was he killing Police and FBI agents just to make Nick Rice (Jamie Foxx) mad? They didn't do much to Clyde and already got his revenge which was enough. And you know what would of been a better ending? Clyde could of committed suicide and admitted his reason.",
      "total_reactions": 2,
      "user": "Jedi_Jettson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2012
      },
      "score": 2,
      "text": "This movie disgusts me, if I am being honest. The violence was without meaning, and it seemed spliced in for the sake of satisfying a bloodthirsty crowd. It has its enjoyable moments, and for that I give it a 2, but it is recycled garbage.",
      "total_reactions": 2,
      "user": "Greatbeallo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "Meeeeeeeh...  It started very, very good, at first revenge was justified, but then it just became into a non-sense murdering. At the end of the film, all I wanted was the \"bad\" guy to win at least, not the moron lawyer, but neither that happened. It was totally anticlimactic... Seriously, if you want a good version for this movie, watch \"V for Vendetta\" and stay away from this.",
      "total_reactions": 2,
      "user": "sLm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "I think the critics really misunderstood this movie. Some compared it to the disgusting series \"Saw\" or \"Torture Porn\", they couldn't be more wrong, there is honestly not very much gore in the movie at all except for two quick scenes. Granted some disgusting things are implied throughout the movie to add to its emotion and intensity and it does succeed.",
      "total_reactions": 2,
      "user": "Buckwheatjones1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "This is what happens when the dig through John Grisham's garbage. It has a lot of inaccuracies with the federal law of the state of Philadelphia. Both Jamie Foxx and Gerard Butler are miscast and don't provide energy in their roles. Their characters are poorly developed and the other characters don't have much focus, and on some occasions stupid And the ending is a big 180 to a decent resolution.",
      "total_reactions": 1,
      "user": "Tetsuo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 0,
      "text": "bad writing, bad acting, bad everything. Gerard Butler should never try to pull off another American accent again...awful, just awful. Ridiculos premise, but lots of stuff blows up so it likely kept American audiences happy. When foreigners put down Americans for their cinematic stupidity, this movie is Exhibit A.",
      "total_reactions": 1,
      "user": "podaddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2012
      },
      "score": 4,
      "text": "Law Abiding Citizen has decent performances from its two leads Jamie Foxx, playing a dedicated prosecution lawyer and Gerard Butler as a man cheated by flawed American justice system who takes the law into his own hands as a murderous vigilante. It's technically competent throughout and with the addition of a serviceable script the film should be an intelligent and memorable thriller providing an insightful critique on law and morality. Somehow though, Law Abiding CItizen never rises above mediocrity, and is a largely forgettable affair. After an exciting initial setup, the narrative plods and becomes utterly ridiculous towards the final act, which is so over-the-top it wouldn't look out of place in a 70s disaster movie. Characterisation is also inconsistent, with Foxx's heavily moralistic and by-the-book lawyer conveniently able to bypass his long-held convictions when it suits the story. In addition, though he makes a decent enough anti-hero throughout, Butler does occasionally slip back into his natural Scottish dialect during the more intense and demanding scenes. Law Abiding Citizen only just manages to stay afloat thanks to director F. Gary Gray's craftsmenship and the talent of the lead performers. It falls utterly flat in other areas, however, because of misjudgements of tone, uneven pacing and a critical lack of commitment to the big ideas behind the film. The film is passable, but nothing more.",
      "total_reactions": 1,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2013
      },
      "score": 4,
      "text": "The potential was there and the movie definently had it's moment but overall, It not only failed to draw you in but the poor dialogue and acting by the cast (aside from Butler who was the only good one imo) sort of ruined it imo.",
      "total_reactions": 1,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "After years of intending to watch this film finally did I get a chance to.  After all the hype given to me by friends and family this film was a bit disappointing.  I guess if you're a logical thinker, or an analyzer of movies you can see through the plot fairly easily.  The ending was also rather troublesome, even though it had the potential to be great.",
      "total_reactions": 1,
      "user": "OnAnarchy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "Gerard Butler and Jamie Foxx play the lead roles in Law Abiding Citizen, a brutal thriller in which a father and husband (Butler) makes an example of the legal system that wronged him.",
      "total_reactions": 1,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "the people who have left these low reviews need to relax. this movie is very strong. first off gerard butler plays an awesome psycho. the whole plot and twist at the end is really awesome. I loved the way it was written and built up. this movie is a must see. everyone I have told to watch this movie has loved it. the acting is good and the twist is even better",
      "total_reactions": 1,
      "user": "joesaraho"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "Whilst Law Abiding Citizen is spectacularly ridiculous, it is incredibly enjoyable and thrilling - and has you on the very edge of your seat until the end.",
      "total_reactions": 1,
      "user": "sammurphy66"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "the movie start with a crack of intense but ends with unexpected disorder.So i didn't like this that much.if they ends with more explanation of the moment that would be better.",
      "total_reactions": 1,
      "user": "Awsaf"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2013
      },
      "score": 4,
      "text": "Movie started out very disturbingly. What a strong start for a thriller? Well, it was, yeah. Though, at some point it started to become a bad movie. The way it started to focus on just violence and nothing else was just nothing i was hoping from the story. This movie could have been done better.",
      "total_reactions": 1,
      "user": "ECantona"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "nice. and unexpected movie. Only the finish is expect-able and a bit disappointing.",
      "total_reactions": 1,
      "user": "JJHood"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2011
      },
      "score": 2,
      "text": "Its so generic, straight forward, and predictable that it ruins the movie. Jamie Foxx is a terrible lead as well, The rest of the cast was ok. Gerald Butler is good though and the only reason to watch the film. The action was ok as well but the entire script was just terrible. A lot of ruined potential here.",
      "total_reactions": 8,
      "user": "spadenx"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2011
      },
      "score": 2,
      "text": "I had to check to make sure it was the same movie by the end, because it wasn't nothing like the first half hour.",
      "total_reactions": 4,
      "user": "RustyShackle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "What started off so interesting ends so poorly. The acting is fine (I didnt really like Jamie Fox as the lead, Thought he was a poor fit) and the action was good. The story is so generic though that it just takes away from the overall value.",
      "total_reactions": 3,
      "user": "asylumspadez"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "The movie ends with a pretty cliche on top, but its the first 30 minutes of \"Law Abiding Citizen\" with the tension between Butler and Foxx that will entertain you.",
      "total_reactions": 8,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2010
      },
      "score": 2,
      "text": "This movie is what I imagine getting a colonoscopy is like. The acting was what you would expect from a middle school play, not a multi million dollar feature film. I would not recommend this to anyone.",
      "total_reactions": 5,
      "user": "ynot420"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2010
      },
      "score": 3,
      "text": "A poor man's \"Seven.\" Gerard Butler is so unappealing on screen, but combined with the personality-less Jamie Foxx, it doesn't matter how on-edge some of the scenes are. It still comes across like a B movie.",
      "total_reactions": 5,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "Awesome movie!  I do personally think the system sucks!  Too many stupid rules and regulations and loop holes!  Not too many people might want to admit it but I bet there are a ton of people who would love to have the brains and know how just like the Anti-Hero in this movie.  I can tell you that if anything ever happened to my family and the maximum wasn't done against the criminals, I have no doubt that revenge will be taken into my own hands!  It was really weird but I don't remember a time where I was rooting for a character of Gerard Butler's stature.  Yes, there are a couple of minor flaws but overall a really well done movie.",
      "total_reactions": 2,
      "user": "TheSHO"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "I just finished watching this movie and I don't understand what people are complaining about saying this movie is not that good. It is a very clever movie that has a very clear and loud message \"Everyone has to take responsibility for their actions.\" Nick played by Jamie Foxx was too concerned about his status and was focused on achieving a high conviction rate so cut deals for criminals that should be locked up for a very long time. Clyde was an innocent guy who lost his family and I can understand some people saying the good guy Clyde went way over the top to become the bad guy toward the end of the movie but I can understand why he went over the top because if you remember, Nick told Clyde at the beginning of the movie that he already finished the deal without even asking or considering Clyde's opinion. The guy lost his family and had his feet cut out from beneath him when Nick finished a deal. This is one of the best movies I've seen and it's very clever and has an important message. I'm from a different country, I wasn't born here in the United States, and I have read and witnessed about cases like these occuring often where justice is not correctly served and criminals escape day after day in my home country so maybe that's why I appreciate this movie more than others because to me, this movie is a partially a true story in some sense.",
      "total_reactions": 2,
      "user": "clmtigers15"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "CRITICS ARE STUPID!!! This movie was great! It shows how ridiculous our justice system is. Jamie Foxx and Gerard Butler do a great job, I thought Colm Meaney could have done a better job with his role but other then that it was an intense movie that was well made.",
      "total_reactions": 2,
      "user": "Gavin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Law Abiding Citizen is the ultimate tale of revenge. After his family is killed in a brutal home invasion, Clyde Shelton waits for the legal system to do its job, unfortunately for them, they fail him, and that's when he takes matters into his own hands. This was great, such a unique tale that really blurs the line. It's very hard to decide who's the good guy and who's the bad guy in this one. That's something that makes this film unique. Gerard Butler is amazing as Shelton. Having seen several of Butler's movies previously, I thought he was just your ordinary, so-so, action star until I saw this. He has chops in this movie and can really deliver that one line, similar to Bruce Willis in Die Hard. This movie is fast moving, action packed, and isn't the same old story. Definitely go see this one!",
      "total_reactions": 2,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Way underrated, deserves at least a 70 from critics, but they know nothing, listen to the user reviews.",
      "total_reactions": 4,
      "user": "ThomasF"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "This film is a good all-rounder and kept me intrigued until the end, it always amazes me how critics can score things so badly and one describing it as saw with a conscience could do with getting another job.",
      "total_reactions": 1,
      "user": "MartyJ"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "Law Abiding Citizen points out an imperfect justice system. In seemingly obvious cases of murder a judge might not care enough about justice and only obeys the law so as a killer can go free if there is a lack of physical evidence; lawyers might make deals with criminals just to put an easy end to a case; and if it gets really bad for those who work for this system they might try to find a way of how to take away the constitutional given civil rights of the person they feel threatened by. A very smart movie that gives you some food for thought about how law and justice might not always be the same. The first half of the movie is quite brutal and likely hard to watch for many viewers. The second half offers some surprise. Definitely worth watching.",
      "total_reactions": 1,
      "user": "juliankleiss"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "This movie was actually kind of fun. Is it a cliche oh heck yeah. But it does have some pretty inventive ways of killing off some people and some of the ways the villain is able to do the things that he does. The acting is also very solid with the exception of a certain mayor. Overall this is worth a watch.",
      "total_reactions": 1,
      "user": "moviegrabbag"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2015
      },
      "score": 10,
      "text": "Three words: critics are idiots. This film is incredibly well-made with top-notch acting and a nail-biting plot. See this film and you will not regret it.",
      "total_reactions": 1,
      "user": "Mcgillacuddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "Picture it you have a beautiful wife a loving and sweet daughter a great job that you love and every night you come home to your family knowing there will be a great dinner waiting for you so you can sit around the table and just share some quality time with the ones you love. It is essentially the American dream; the dream that all want and most get but what if one day that dream was taken away from you? What if some crooks from off the street broke into your home rob you and murdered the ones you love Now say that the police were able to find and capture the men who murdered your family there are about to be prosecuted for the heinous crime they have committed. The Executive A.D.A( Executive Assistant District Attorney) cuts a deal with one of the murders meaning one spends five years in jail and is free while the other is sent to death row. There is one person who shares this horrifying story and that person is Clyde Shelton (Gerard Butler). Two thugs looking to loot the place but instead one of them decided to take it a little further and rape and murder both his wife and daughter murdered his family. After one man is un-officially set free by a slick Executive A.D.A. and the other on death row Sheldon plots his revenge against all who have wronged him. The men who destroyed his life and the Justice system that let one of them get away.  F. Gary Gray and Kurt Wimmer's \"Law Abiding Citizen\" is one of those films that came out last year  slipped under the radar for me  I had heard things about it albeit nothing good. Most critics and audiences members turned there backs on \"Law Abiding Citizen\" in favor of worse movies. However, compared to other movies that came out around the same time, as Law Abiding Citizenâ",
      "total_reactions": 0,
      "user": "Lopez17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2014
      },
      "score": 5,
      "text": "I liked the actors. I liked the general plot, even if the ending was kinda dumb. Could have done without the gore sections. It was an alright movie to watch, but I don't think I'd bother to watch it again.",
      "total_reactions": 0,
      "user": "Lokathor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2013
      },
      "score": 3,
      "text": "Una lástima el final, termina significando q la corrupción de la justicia al final gana. Como un juez puede decir hago lo q quiero? que se creen? dioses? no creo q con la muerte, pero un cambio de sangre dentro de ese poder miserable es necesario. Uno tiene q pasar por un asesinato y después por la ley y ver lo sucia q es y como todo se compra, y como las vidas no valen nada, para poder ver q en esta película el principio es perfecto, tal cual como debería ser. El final desastroso. Solo lo liberan de la tristeza que es perder seres amados de la manera más violenta, sin q a nadie le importe. Solo somos un número.",
      "total_reactions": 0,
      "user": "Nsnc2003"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2016
      },
      "score": 2,
      "text": "This movie is a shallow self-indulgent mess that is bereft of any intellectual substance. Instead, its a revenge-fantasy with superficial basically non-existent criticism of a easily criticizable justice system.  If you watch movies on a regular basis  and like to think about them in different ways (also if you are mentally older than 16), this movie is going to be a pain in the ass to sit through for you.",
      "total_reactions": 0,
      "user": "kenje13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "I had really high expectations for Law Abiding Citizen after watching the first scene. It really started out strong and made me excited for what would happen next, but then it gets too ahead of itself. The first 40 minutes of the movie are the best and then the last hour sort of drags on. I enjoyed Jamie Foxx's role but I don't understand why he is so involved in the story when he is a lawyer. He shouldn't have anything to do with most of the events in the movie. I understand he is there in order to make the movie more intense but it sacrifices realism. He should have been a cop. Then ending was sort of good but semi-predictable. I didn't think that this movie is really bad I just found a lot of things flawed with it. I'm sure many people would still enjoy the film. Just don't think too hard about it.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "This movie was very interesting. Watching someone outsmart the authorities is always entertaining.",
      "total_reactions": 0,
      "user": "ForTheReview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2015
      },
      "score": 6,
      "text": "A movie that don't have a great final losse points. this movie is amazing Butler ever is amazing without doubt deserves a 10 but the final is so stupid and idiot that only because of final losse 4 points.",
      "total_reactions": 0,
      "user": "raciocinio"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "Interesting thriller with a severe tinge of violence and an adult theme. Well directed and scored, it's unfortunately let down by a poorly written script and (apart from Gerard Butler) a cast on auto-pilot.",
      "total_reactions": 0,
      "user": "YorkMan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "Let us be honest, this is just another \"vigilanti\" movie, this kind of movies which encourage not to believe in the law system and like in the wild western take action of your own..",
      "total_reactions": 0,
      "user": "TinoTrivino"
    }
  ]
}