{
  "mc_avg_user_score": 6.0,
  "mc_metascore": 33,
  "mc_mixed_rating_frequency": 16,
  "mc_movie_name": "Leap Year",
  "mc_negative_rating_frequency": 14,
  "mc_positive_rating_frequency": 34,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2010
      },
      "score": 1,
      "text": "My girlfriend made me see this with her, and it was awful. Extremely predictable, and just plain dumb. I'm tired of the movies with the two characters hate each other and within a few days are madly in love. STOP IT!!",
      "total_reactions": 0,
      "user": "dijavantewow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "You know what Leap Year is another generic entry into the romantic comedy genre and you know what I must confess that I enjoyed it. As we all know about in romantic comedies is that woman are very successful and they are hungry to get married and finding the right one. As well as trying to desperately doing some antics to achieve that goal. Leap Year follows that routine and you might be wondering why I haven't thrown it away yet. It's that damn Amy Adams she makes everything watch able. She can make a turd look good. Go ahead and photograph her with a turd next to it. I swear you'll say \"Oh that turd isn't that bad.\" The film opens up that Anna (Adams) is in a relationship with Jeremy (Adam Scott) who hasn't asked her to get married yet. Anna feeling disappointed abandons all hopes, but her father tells her about an old Irish tradition that once every leap year the woman proposes to the man. Of courses pack up the suitcases and get yourself into funny situations and you got yourself a movie. Then he meet the rough all around the edges-but charming-a#$hole Irish guy. I think I don't have to explain the plot anymore you kind of got the idea of where it's going.  The movie succeeds because of Adams and there's not much chemistry between Matthew Goode and her. It's a rehash of every other romantic comedy out there but it was funny, it wasn't offensive either. An other thing I liked was that the guy was just a plain looking guy not dreamboats, which they usually cast. Finally the girl chases after the guy at least it's something different.  It's tolerable if your girl wants to see it.",
      "total_reactions": 0,
      "user": "thelordoffilm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2011
      },
      "score": 1,
      "text": "Think of the dumbest Jennifer Aniston \"romantic comedy\" you've seen. This one is dumber. What a waste of the lovely Amy Adams -- with unfunny slapstick, a senseless plot and no chemistry at all between the leads. I wasn't expecting much, but thought that a little Irish scenery might at least make it somewhat enjoyable. I was wrong.",
      "total_reactions": 0,
      "user": "Lyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2010
      },
      "score": 4,
      "text": "Although predictable and a little dry, it does display Ireland's beautiful countryside and Adams and Goode are charming in their roles but deserve better.",
      "total_reactions": 0,
      "user": "Tony"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "This movie's premise has holes large enough to push an Irish pub through, but there are three elements that make it worthwhile: 1) Matthew Goode never overplays the part he's been dealt 2) The cliffs and countryside of Ireland make for magnificent viewing, and 3) Amy Adams' spirit has enough fizz to energize this tired chick flick and  render it quite enjoyable.",
      "total_reactions": 0,
      "user": "franclinolin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 4,
      "text": "While I'm okay with this film and Amy Adams is my favorite actress, I must admit that this is not one of her best films. It's okay at best, typical rom-com.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2015
      },
      "score": 9,
      "text": "Amy Adams is great as the hilarious 'con artist' Anna! She really made the movie lively and fun.  Slightly clichéd here and there, but with a striking message and the gorgeous backdrop of Ireland.  A very well-done romantic comedy!",
      "total_reactions": 0,
      "user": "kat267"
    }
  ]
}