{
  "mc_avg_user_score": 6.4,
  "mc_metascore": 39,
  "mc_mixed_rating_frequency": 2,
  "mc_movie_name": "Legendary",
  "mc_negative_rating_frequency": 2,
  "mc_positive_rating_frequency": 6,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "This movie is grate from start to finish, don't be put off by the low metacritic score!!! probably not for everybodys taste, but you wont no until you see it.",
      "total_reactions": 2,
      "user": "visevice"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2010
      },
      "score": 6,
      "text": "This movie was less action driven than I had hoped. I expected a classic struggle of good vs. evil but what I got was a tale of the struggles of everyday life. I enjoyed this movie simply because of the story. The characters family struggles were real and believable. This movie failed in terms of its acting and its script. I found it hard to care about  the son who was too cold and lacked the necessary passion for his role. John Cena was a pleasant surprise in that he may have been the best actor in this movie. If you enjoy inspirational movies especially pertaining to sports than I would recommend this movie, although if your not ready for a mainly dramatic movie you will be disappointed.",
      "total_reactions": 1,
      "user": "The_DirtyRabbit"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 0,
      "text": "To call it retarded would be an affront to retards.  A geek joining the wrestling squat because of unresolved dead father issues? A high school girl with IQ below 50 showing her breasts to classmates for $5? Seriously?  What world do the writers of this junk live in?",
      "total_reactions": 2,
      "user": "ReverendD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "liked this one. I will add it to my library.  good story  line, with some meaning in it.  was more of a chick flick type of movie. great for a rental..",
      "total_reactions": 0,
      "user": "shepardn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "Wow, I don't know why reviewers slammed this. Maybe because they don't know a good movie when they review it. I loved this movie. Don't leave because of the low metacritic score. This is a awesome movie. I'm 13, I usally play games, more but this movie got my attention. I loved this movie, forget the score, buy it.",
      "total_reactions": 0,
      "user": "xXAnthonyXx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "I'm not gonna lie, I greatly enjoyed this movie. I felt it had a good, \"sports movie\" story line kinda like 2003's Radio. Solid performances also and a surprising performance from captain stone-face John Cena",
      "total_reactions": 0,
      "user": "bfoore90"
    }
  ]
}