{
  "mc_avg_user_score": 4.4,
  "mc_metascore": 32,
  "mc_mixed_rating_frequency": 33,
  "mc_movie_name": "Legion",
  "mc_negative_rating_frequency": 93,
  "mc_positive_rating_frequency": 57,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 5,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "Something tells me I shouldn't like that movie. But I did. I found it entertaining, and Paul Bettany's character very good. Why God's angels cannot deal with machine gun fire, well, maybe he should have checked Earth out himself before sending down his executioners.",
      "total_reactions": 12,
      "user": "Nazgulero"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "this film is not well-written, artful, or subtle, but it is completely ridiculous, and violent, and that's why i like it, sometimes, you just need to turn off your brain and enjoy something simple, this is it.",
      "total_reactions": 2,
      "user": "DJohnson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "legion is incredibly entertaining, sure, it doesn't have much in the way of plot, character development, contemporary relevance, or incite into the universe, but as a crazy, simple supernatural shoot em up, it works absolutely fine - samarathenymph xoxo",
      "total_reactions": 2,
      "user": "samarathenymph"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "epic",
      "total_reactions": 2,
      "user": "wearetheothers"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 2,
      "text": "The movie is indisputably terrible. From the story plot line to the performances, \"Legion\" is very messed up. That's all I can say for this cinematic mess. Nothing good.",
      "total_reactions": 9,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "epic",
      "total_reactions": 6,
      "user": "TheEPICOne"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 4,
      "text": "I really want to say this I'm a geek for movies that has to do with sci-fi and horror and action, as well as the genre of fantasy. When a film gets released with these very good qualities, I'm your number one man at the movies ready to see it. So when I saw Legion's preview I was very giddy, but there's a problem. What I don't appreciate is that Hollywood thinks I'm a nerd and a geek so I'm going to watch a mediocre movie no matter what. Just because it has a glossy packaging doesn't mean it's good.  What's better to attract a sixteen year old boy to the movies? Oooo I know let's put a poster with the main character and lets have him have really big guns. Wait I have a better idea let's put angel wings behind him that should do the trick. Then the trailer will have cool explosions and really exciting one-liners. Damn this movie got me hooked I'm watching this. They pay $10.50 ticket, $21.00 if they have a date then another $20.00 for food; watching a bad movie not priceless. Well I'm 23 years old and I have seen my share of movies to uncover studios bulls@#t. Legion is a movie that tries to capture fan boys because of the cool images but the serving is really distasteful. It's another stupid attempt to make a franchise.  Legion's plot is a weird one with several holes in it but I'll get to that later. God has lost faith in mankind; he's basically tired of us. So in the bible he sent a flood like much of us has learned, so he decides to send mindless zombies who are possessed by angels. Yeah I said that I didn't stutter. You heard me say mindless zombies right because they're going to end up as target practice like we didn't know that was going to happen. So back to the plot, Michael who is an angel does not agree with God's descion. So he decides to come to earth and sacrifices his angel status and becomes human. You see I put \"angel status\" the movie never explains why he does that. He goes to diner full of misfits to protect a pregnant woman who bears the child to end the war. I have a number of questions on this, where is the father of the child no explanation and nobody bothers to ask. Why does God wants zombies to end the world, is he a big studio executive who wants to see action or God's a big George Romero fan wanted to use zombies.  I'm sorry but Legion being directed by a former special effects director I wasn't really convinced with the special effects. Now I know why George Romero and Danny Boyle can really make zombie movies there zombies transforms in the most disgusting and scariest ways. In Legion they transform like this. Their head shakes really rapidly like a bobble head and black contact lens and fake shark teeth. It looks pretty ridiculous. The acting, don't get me started on the acting Paul Bettany was the only shine of light in this movie and it's a pretty dark movie. Most of all the dialogue was dull as well. I do give credit where credits do. Gabriel and Michael in angel form looks pretty cool. Their action sequence was somewhat entertaining. There is good writing here as well the speech that Michael gives to Jeep and a very cool quote that Michael says in the end. \"You gave him what he wanted but I gave him what he needed\" That was pretty cool, as well as the grandma scene was pretty good too. That's four good things out of so many wrong things can't recommend this even to the low IQs.",
      "total_reactions": 3,
      "user": "thelordoffilm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2010
      },
      "score": 3,
      "text": "This film had potential with its profound themes of religion and redemption but wasted it with cheesy predictable dialogue and a muddled yet basic plot. Some bits made me smile from the sheer absurdity though: evil granny, zombie kid and machine gunning the Angel Gabriel while he swings a mace that rotates like a melon on a drill (no joke). Watch this movie only if you're with friends, drunk, and with another dvd on hand...",
      "total_reactions": 1,
      "user": "ste88883"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 0,
      "text": "The opening words of Legion were \"God is sick of all of the â",
      "total_reactions": 1,
      "user": "RyanGee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "The reason I give this a 5 is strictly because of certain scare moments that make you quiver. The graphics I thought were decent for this kind of movie but the storyline again is where it makes a difference. Every movie that doesn't do well in the ratings is because the movie either drags or moves to fast to understand anything. This movie didn't start to move until the middle and then it was just information thrown at you. In the end it was confusing to understand what Michael (Paul Bettany) was saying but it made sense after you think hard about it.",
      "total_reactions": 1,
      "user": "Ruler101"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "With this and the woeful \"Priest\" in the bag I have to wonder why Paul Bettany has bothered. This is a predictable, spot the plot religious horror. I didn't set my expectations too high but unfortunately this movie still came up short. I thought with Dennis Quaid and Charles S.Dutton there may be hope but unfortunately not although at least Duttons character had some purpose unlike the other cannon fodder.",
      "total_reactions": 1,
      "user": "rotku"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2012
      },
      "score": 2,
      "text": "Boring as, slow paced, uninteresting movie with 1-dimensional steretype characters. This film has so many plot holes and unexplained segments its impossible to concentrate on the plot without getting a headache. 1st of all, if god wanted the human race to be nullified why didn't he just, you know cause a massive catastrophic earthquake I mean that sounds pretty easy for god if you ask me. Boring boring borin only reason I rate it a 2/10 is because of Paul Bethany",
      "total_reactions": 1,
      "user": "LordOFlibertY"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2011
      },
      "score": 1,
      "text": "The action sequences were entertaining but everything else sucked. The entire plot didnt make any sense what so ever. The acting was terrible, Even though it was done by a rather experianced cast. There are a few (and I mean very few) actual enjoyable moments, Such as the arrival of Gabriel (which I really enjoyed). Still its rather trashy.",
      "total_reactions": 1,
      "user": "spadenx"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "What a waste of Paul Bettany's talent and Dennis Quaid's experience.  A stupid, stupid movie that insults anyone unfortunate enough to see it. That's all I can say!",
      "total_reactions": 1,
      "user": "Vorlargen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2010
      },
      "score": 2,
      "text": "This movie doesnot deserve to exist.  Overall terrible and not even in the campy B movie way.  No one deserves to  suffer through this tripe.  Horrible acting, action, and pacing abound and if that won't stop people from seeing this movie think of everything else a film could and should have and then picture a dying animal",
      "total_reactions": 0,
      "user": "theshermanator"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2010
      },
      "score": 2,
      "text": "SO CRAP!   the only good thing about this movie is the are one or two fairly good looking women in it.",
      "total_reactions": 0,
      "user": "surfiss"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2010
      },
      "score": 3,
      "text": "my god what a bad movie. Even though I liked Paul Bettany, and the teenage girl (she was hot), and Tyrese everyone else I hated. This movie was trying too hard. It had good parts, they were in the trailer. I admired the concept and the vision, just the execution was soo, bleh. It's overdramatic, not fun, boring, and it tries too hard. The two people i Hated survived. They dont leave the diner, its boring.",
      "total_reactions": 0,
      "user": "MetalMan95"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2011
      },
      "score": 3,
      "text": "I saw bettany in the reent movie Priest and thought he fit with the dark roles. This movie wasn't horror or thriller - it failed in both. The movie was a waste of time to sit through.",
      "total_reactions": 0,
      "user": "kingshahid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2010
      },
      "score": 0,
      "text": "Substandard mishmash of disjointed fragments of religious imagery and pseudo-apocalyptic gibberish. The shots themselves seemed amateurish, the characters were stock types, the dialogue trite, and the acting piss-poor. Even the special effects left much to be desired. The pace of the film was horrible, it simply dragged on, and on. Cardboard cut-outs of Paul Bettany and Dennis Quaid would have done a better job and cost director Scott Stewart less money that the real --yet paradoxically more cardboard-like-- actors.",
      "total_reactions": 0,
      "user": "spud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2011
      },
      "score": 0,
      "text": "I wanted to like this film, I really did but its just so awful. The acting ,even though done by an experianed cast, is pretty terrible. The story seems interesting at first until you relize just how stupid it really is. Its just plain awful.",
      "total_reactions": 0,
      "user": "asylumspadez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2010
      },
      "score": 2,
      "text": "The idea of angels rebelling against God to save humanity before it is collectively smited is a pretty good one, until the theme of \"unborn child will save everyone\" is introduced. Disappointing in the sense that Dennis Quaid is so hard-up that he has to make a crust by associating himself in a movie like this, having said that the film would be much worse off with him. Angels bickering with each other about saving the world? Believe it or not Kevin Smith does it better in the comedy Dogma, and the religious themes are explored with more gusto too.",
      "total_reactions": 0,
      "user": "Javed12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2011
      },
      "score": 1,
      "text": "A bland movie that forgot to take the trash out on trash day. The acting covered the spread but the action was very underwhelming. The only memorable moment is probably the climax but that isn't too surprising.",
      "total_reactions": 0,
      "user": "PurpleUrp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2011
      },
      "score": 0,
      "text": "Quite literally the worst movie I have ever seen. I'd end there, but I'm required to use one hundred fifty characters. To elaborate: even as a comicbook movie; even as a made-for-tv sci-fi channel movie made with 1990's made-for-tv movie inferior cinematic standards; this movie was so bad I was personally insulted by its very existence. I gagged in horror and dismay. I would have left the theater, but my outrage caused all the muscles in my body to contract at once leaving me paralyzed in the hell that was this one hundred minute migraine. Everyone who has ever seen this movie is the worse for it.",
      "total_reactions": 0,
      "user": "Redfordsto"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "Unlikely many people, I enjoyed LEGION. I thought it was quite entertaining, but it could have been better though.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2013
      },
      "score": 2,
      "text": "Poorly done. Bad special effects (that old woman in the diner was comical), a silly story, and a typical horror film trying to be atypical. How anyone could make it through this movie is miracle to me. Avoid this movie. There are worse films than this for sure but unless you just really want to waste time to waste time you should just watch something else.",
      "total_reactions": 0,
      "user": "moonman1994"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "epic",
      "total_reactions": 0,
      "user": "violentmilk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "epic",
      "total_reactions": 0,
      "user": "aliceanderson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "epic",
      "total_reactions": 0,
      "user": "emilypyre"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "epic",
      "total_reactions": 0,
      "user": "alliedcola"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "epic",
      "total_reactions": 0,
      "user": "fukdapolice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "epic",
      "total_reactions": 0,
      "user": "extrafizz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "highly enjoyable trash.",
      "total_reactions": 0,
      "user": "averyjerryguy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 1,
      "text": "A cool premise turned embarrassing failure.  The story and the script are just so bad it makes this film unwatchable.  Paul Bettany is the loan bright spot, but the light is very dim.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "what the  *bleep*? This film was awful! Dreadful! The script? My 7 year-old niece has more innovative lines in her 2nd grade essays! The characters? I could care less for any one of these people, and I use the term \"people\" loosely, since zombies seem to have more depth of character then them.  Let the demons get them! What? Not demons? Those ugly mutated zombies (no, not the main cast; the other ones that were actually suppose to be playing something like weird, ninja-zombies) where being possessed by angels? *facepalm*",
      "total_reactions": 0,
      "user": "ypomoni"
    }
  ]
}