{
  "mc_avg_user_score": 6.4,
  "mc_metascore": 30,
  "mc_mixed_rating_frequency": 41,
  "mc_movie_name": "Let's Be Cops",
  "mc_negative_rating_frequency": 25,
  "mc_positive_rating_frequency": 92,
  "mc_pro_critic_reviews": [
    {
      "critic": "William Goss",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2014
      },
      "score": 67,
      "summary": "The viable chemistry between these two leads keeps the ball in the air, even when the balls land elsewhere in strained homophobic gags."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 67,
      "summary": "At times, the movie seems to exist for no other purpose than to collide these two personalities together, privileging their antagonistic banter above all else. But isn’t that the basic point of all buddy comedies?"
    },
    {
      "critic": "Nick de Semlyen",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2014
      },
      "score": 60,
      "summary": "Some nice comic beats and a sinister Andy Garcia turn make this far more watchable that the fratty conceit might suggest."
    },
    {
      "critic": "Brittany Spanos",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "Though it charms, it's difficult to ignore how many times we've seen this story played out before."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "Let’s Be Cops has its moments, but it in no way distinguishes itself."
    },
    {
      "critic": "Joe Leydon",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "The mix of raucous buffoonery and violent mayhem isn’t exactly seamless, and the laugh-out-loud moments come with conspicuously less frequency during a third act that suggests a rough draft for “Bad Boys 3.”"
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 42,
      "summary": "The script by Luke Greenfield and Nicholas Thomas makes too many easy choices, and it simply doesn't work in terms of maintaing credible audience sympathy."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 40,
      "summary": "There are some laughs here, but not many. Johnson and Wayans have a pleasant enough chemistry, but the best parts of the movie are when Johnson gives Ryan an unhinged quality."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 40,
      "summary": "The movie relies too much on the same comic tension in each scene: Johnson is the gung-ho one, Wayans says no (a lot)."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 40,
      "summary": "With a combination of jokes that don't land and a constant flurry of exposition and plotting to keep these flimsy plates spinning, Let's Be Cops more often than not feels more like a court-ordered defensive-driving class than a rousing high-speed chase."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 40,
      "summary": "This alleged comedy takes a long time before it gets its first laugh in. The first half is a complete slog and the ending is insulting, but there are a few semi-arresting sketch comedy moments."
    },
    {
      "critic": "Kate Erbland",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 39,
      "summary": "The film is confusingly and sloppily put together, edited down to the point that the few genuine jokes of Let’s Be Cops are given precious little time to breathe, before zipping into the next sequence of increasingly irrational events."
    },
    {
      "critic": "Brian Tallerico",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 38,
      "summary": "Despite a premise rife with potential dark humor, there’s too little edge in Let’s Be Cops. Director/co-writer Luke Greenfield chose wacky over witty and the result is a film with no sense of danger, no reason to care and not enough laughs to make the sitcomish handling of a strong premise forgivable."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2014
      },
      "score": 38,
      "summary": "\"What's the worst that could happen?\" The answer to that is, you could end up in a summer comedy that's barely funny enough to warrant — ahem — release in the summer."
    },
    {
      "critic": "Andy Webster",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 30,
      "summary": "[A] disposable comedy."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 30,
      "summary": "The screenplay co-written by Nicholas Thomas and director Luke Greenfield fails to mine the potentially humorous premise for the necessary laughs, with nearly all of the gags falling thuddingly flat."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 25,
      "summary": "None of this is as riotously zany as it wants to be."
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 25,
      "summary": "Let's Be Cops is a fine example of what happens when filmmakers rely too heavily on the potential chemistry of the cast, rather than giving actors something decent on the page to work with."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2014
      },
      "score": 20,
      "summary": "From \"Police Academy\" to \"Hot Fuzz,\" there are satires to be made about undisciplined law enforcement; this will not join their ranks, try as it might."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 20,
      "summary": "Let’s Be Cops takes its premise in the dullest, most predictable direction imaginable, as a wacky mismatched-buddy-cop movie pitched to the lowest common denominator."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 12,
      "summary": "The only truly lethal weapons in the criminally unfunny action comedy Let’s Be Cops are the lame script, putrid direction and pair of sitcom stars mugging nonstop in frantic pursuit of laughs that have fled over the state line."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "summary": "Johnson and Wayans are both gifted comic performers but are given way too little to do in a film that wends its way from set piece to set piece, not with antic glee but desultory and-then-this-happens randomness."
    },
    {
      "critic": "Jason Clark",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "summary": "If Let's Be Cops were content to be simply an unfunny genre exercise, it would be easy to dismiss it and move on. But the sting of astoundingly ill-advised sexism and homophobia is harder to shake."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "The day this came out was a stressing day. We got 2 terrible movies with \"The Giver\" and \"The Expendables 3\" and this would probably not fare well with me either. But to my surprise \"Let's Be Cops\" turned out to be a fun romp that puts a unique spin on the old buddy cop formula. The chemistry of the two lead actors are actually really good and it carried the movie along with supporting roles from Andy Garcia who plays a crooked agent and Keegan-Michael Key who is hilarious as a Rastafarian drug trafficker.All and all this movie positively surprised me.",
      "total_reactions": 2,
      "user": "NotoriousFraud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "I see you are very small note about this film. Honestly thousand one I really liked. I mean I laughed a lot, the story is not very good, but still not make you bored.",
      "total_reactions": 2,
      "user": "Marick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "The critics are wrong yet again. It's a typical buddy cop movie but what's wrong with that? These two actors have great chemistry with each other and provide enough laughs to make this a must watch.",
      "total_reactions": 2,
      "user": "mikesurbroski89"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "This movie was such a great movie! it was just so funny, if your looking too get a laugh then this would be your movie! I think it also added suspension when you had mossi as the Russian mobster and his gang! just such a great great movie! I loved it, and I definatley recommend seeing it because its so good! and I also think they should definatley definatley make a second one !",
      "total_reactions": 2,
      "user": "danielle3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 9,
      "text": "This movie is really funny! it's no Oscar winner but you will have a good laugh. I liked that the main characters were not famous actors, it really left a blank canvas to create their own style.",
      "total_reactions": 1,
      "user": "CBZ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "I was skeptical about how good this movie would be judging from the trailers, but it turned out to be highly entertaining and amusing. While I do agree that the chemistry is a bit overrated and I actually wasn't that big a fan of the acting performances by the leads, I still think this is worth a look see for some good laughs.",
      "total_reactions": 1,
      "user": "Toffenuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2014
      },
      "score": 7,
      "text": "Thankfully for its amusing story line and charismatic leads, Let's Be Cops, whilst being a little generic in its gags, is a decent comedy that is sure to produce a few laughs.",
      "total_reactions": 1,
      "user": "sammurphy66"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "Most of the reviews for this movie are from pharmaceutical pill popping homosexuals, Ignore them. This movie is outrageously funny, with a touching end.",
      "total_reactions": 1,
      "user": "Miscreant1966"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "Lets be cops is a flawed comedy, but that does not mean It isnt any good. The movie not only has funny stuff, but some actually engaging performances, mainly from bad guys andy garcia and james d'arcy.",
      "total_reactions": 1,
      "user": "ryanneevman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "I'm one of the many people who think that comedies have been very bad these past years (epic movie, scary movie 4, etc.) but I believe that this one isn't half bad. This isn't a movie with just mindless comedy that doesn't even try, it actually has some good clever humor mixed in. That's the main problem with this movie though, comedy. There is certainly some very good moments in this movie, even memorable, but not many. A lot of the humor you see is actually pretty dull and might get you to chuckle but that's it. The other issue is SIDE character development. I say side because the main characters are pretty good, not the best by any means, but very good. The side characters though are very dull, including ones that I thought would be pretty interesting. The plot is sub-par with some interesting moments and twists. The biggest plus about this movie that might surprise some people is how they break up the funny moments with some very serious moments. It throws you off and when they bring up back a joke and makes it ten time funnier. I hope to see that practice in future movies and though this movies is a little ruff, it gives me hope that comedies still have a chance",
      "total_reactions": 1,
      "user": "That_one_guy123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "Clearly the funniest film of the year, witty, complex and not cheap. I laughed the whole time, & I have a feeling the critics didn't even watch the movie",
      "total_reactions": 1,
      "user": "alpinerim"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "Let's Be Cops is nothing more than a Cop Out with Jake Johnson. The film starts with Ryan played by Jake Johnson and Justin played by Damon Wayans Jr who just slack off all day long and do nothing. And then Justin has this girl that he wants to impress but couldn't because of some reasons. When Ryan and Justin get invited to a costume party, they decide to go as cops. And because of this people actually think that they are cops! This movie has a great story, and I think that director Luke Greenfield paid attention to the story a lot. The jokes are fresh! Nice to hear that a comedy in 2014 finally nailed that! But the screenplay and acting  is bad. The whole movie is shallow and slows down at the end. The climax is not satisfying. But despite having problems, Lets Be Cops is a funny movie though. It's fresh and original, a whole new type of comedy. If you will not bear a mediocre comedy, then it's best left on your not to watch list.",
      "total_reactions": 4,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "The critics have been taking this one WAY too seriously! This was actually a really funny buddy cop comedy that had its fair share of laughs. However, there's nothing too memorable in it to make it stand out with some of the other comedies this year. The best aspect of the film is the chemistry between Jake Johnson and Damon Wayans Jr.. They were quite funny together and they're really what made the film. Overall, while it may try a little too hard at times and it isn't the funniest comedy this year, it's certainly nowhere near as bad as the snobby critics have been making it out to be.",
      "total_reactions": 4,
      "user": "moviemitch96"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "These guys have great chemistry. Love them on new girl. And all I can say is this movie is worth seeing for the \"That's what you get!\" Sequence alone.  I'm not sure where some of these critics are coming from but it was certainly never supposed to be highbrow humor.",
      "total_reactions": 7,
      "user": "FleshWorld"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "I will admit that the plotline for this movie is a little stupid but I managed to look past it and I really did find the movie fairly funny. Its just another buddy cop comedy but it does run with the ball a little further. I really enjoyed Damon Wayans jr. I can't say the same about Jake Johnson. Despite that there are morethan a handful of good laughs in this movie and its well worth a watch in my opinion",
      "total_reactions": 5,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "The critics are sadly mistaken about this movie like no other movie I've ever seen. This movie deserves a strong 8 rating as a comedy. It has so many funny scenes in it and the overall comedy between the two main character is strong enough to land a 7 for this movie. I gave this movie a 10 for the simple fact of balancing what the critics are saying. They must have some personal issues with something in the movie because the movie is quite funny.",
      "total_reactions": 21,
      "user": "JohnnyScumbag"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "Most critics completely missed the boat on this one - it's a hilarious film, with great acting talent.  Johnson and Wayans have great chemistry, and my theater was roaring consistently throughout.  Sure, it gets a little plotty toward the end, but a score below 50 is really just a balk.  I'd put this is the same league as Bridesmaids, and MUCH funnier than the Hangover sequels.  It's good-natured and money in the bank for laughs.",
      "total_reactions": 15,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "I thought it was hysterical. Wayans and Johnson have awesome chemistry and if you go into it with the correct expectations, you'll get a lot of big laughs out of it.",
      "total_reactions": 6,
      "user": "SimpleMethod"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "Very much worth seeing if you want to laugh.  If you're looking for a great story or a drama element, well you're not going to find it here.  It's just gut level humor.",
      "total_reactions": 4,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "I love Jake Johnson in NEW GIRL and when I saw he was going to be in his first starring role, I knew I was going to be seeing this. And he didn't disappoint. He and Wayans have fantastic chemistry, and the theater was dying on more than one occasion. The film does slow down about 3/4 through (the premise can only last so long), but the jokes are still constant enough that it doesn't  get boring. In a summer of disappointing comedies (Tammy, Million Ways, Blended), LETS BE COPS is a good time.",
      "total_reactions": 2,
      "user": "tropicAces"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "This one gets a positive review but just barely... That is because it is not trying to be the greatest comedy of all time and it succeeds on that goal completely. Well, they are not as annoying as the co-stars of 2 broke girls and better than Expendables 3 so on that note it might  be worth your discounted ticket price. I mysteriously had trouble myself finding humor in 2 guys committing felony counts for 90 minutes and making a joke out of it, but that is just me. Other than that it has some great moments and does its job well. I am just not sure I like what that job was.",
      "total_reactions": 2,
      "user": "analogkid280"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "This is what 21 & 22 jump street only dream they could be.",
      "total_reactions": 2,
      "user": "hwextreme"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "Let's Be Cops has many hilarious moments, it sticks to its roots, its unoriginal and predictable and at times fails to execute the correct tone. However gather a group of friends for a Friday night and you will leave satisfied!",
      "total_reactions": 2,
      "user": "busbfran"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "Let's be cops is a original cop movie.There is real chemistry between all the cast and we can feel it.There is a lot of good jokes and not-so good but there is a lot of action to, so it's equitable.",
      "total_reactions": 2,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "The Critics are right on this one!",
      "total_reactions": 10,
      "user": "pedosupreme"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "Gooooooooooooooooooooooooooooood. See. Gooooooooooooooooooooooooooood",
      "total_reactions": 6,
      "user": "Masoud007"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "You know there's something wrong with a comedy when not even Rob Riggle merited a worthy chuckle. \"Let's Be Cops\" is a marginally entertaining, mostly dimwitted farce with an unflatteringly jarring final act.",
      "total_reactions": 1,
      "user": "Compi24"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2014
      },
      "score": 2,
      "text": "And we have another **** movie in a long line released this year. This one is about 2 guys who want to play cops. Where have I seen that before. I have no idea what is supposed to be funny here. Stupid and boring story, lame jokes, acting wasn't that good.",
      "total_reactions": 1,
      "user": "Tessara_Vejgan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2014
      },
      "score": 1,
      "text": "Unfunny & stupid. This movie is atrocious. 5.3 is a little high for this piece of crap, though I guess I can see a lot of people finding this **** stain funny.",
      "total_reactions": 1,
      "user": "PyongyangMayor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2015
      },
      "score": 3,
      "text": "Let’s Be Cops cop abuse premise is a good foundation for a film but it doesn’t lead anywhere good. The main characters like any sort of fun chemistry, which is partially due to the weak writing and the film at times takes itself way too seriously. When the film starts with The Backstreet Boys’ “I Want It That Way” I groaned knowing the whole film would be like this and it was having an overabundance of pop songs. If you want to see a great film about two dudes impersonating high authority figures watch The Road to El Dorado but skip this.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "Great chemistry between the two leads and a hilarious premise lead to one of the best comedies of the year. Not all jokes hit their mark and I wish there was a little bit more goofing around done before things start getting real, but I still enjoyed it.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "I'm not usually a fan of comedies but this movie was hilarious and ridiculous at the same time. I can't remember the last time I laughed this much during a comedy. The two leads also have terrific chemistry. The critics clearly have no idea of how to judge a comedy!",
      "total_reactions": 0,
      "user": "Dobby"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "Another buddy cop movie ( or wannabe buddy cop movie) similar to Ride Along which came out earlier this year the problem with Ride Along is the same for Let's Be Cops just not very funny.  D+",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "I enjoyed it. Was it hilarious...no. Was it good, yes. The movie is very odd in certain ways and somewhat predictable. Though its really funny at parts and has somewhat of a heart. It does have some odd parts with a funny part turning randomly serious and then back to funny again. Then there's parts where it seems like the actors know the joke isn't funny, so they awkwardly pause. There's a lot of jokes like this, but most of the very well done jokes are hilarious. Overall the movie isn't the best...its really just funny and the story is quite dumb at times. 6.8",
      "total_reactions": 0,
      "user": "bmaster4616"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2015
      },
      "score": 7,
      "text": "I thought this movie was garbage from the previews like 21 jump st, however I was pleasantly surprised and found this movie to be better then I thought it would be. So grab drink and have some laughs",
      "total_reactions": 0,
      "user": "BlackFox81"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2017
      },
      "score": 3,
      "text": "Let's be cops succeeds by its lead actors who were brilliant together and we're very fun to watch what this film lacks how ever is balance of the jokes and drama/ action leaving this movie simple but  not effective as it could of been",
      "total_reactions": 0,
      "user": "travellyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2016
      },
      "score": 7,
      "text": "Amusing - these two are funnier in this than they are in an entire season of New Girl. Drags a little bit in the middle, but an overall enjoyable comedy.",
      "total_reactions": 0,
      "user": "LewisDanny"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "What's funny in this buddy-cop flick is Johnson and  Wayans' chemistry and their humor, It's surprising how the film does not go that far with it's raunchiness and it's insults. But it's funny to their funny one-liners to fighting gangs. Since the talent from the cast but some how is it wasted? Nope. The film gave me plenty of chuckles. Writer-director Luke Greenfield ('The Girl Next Door) has a funny premise and that's what the film has but it does not go that far with the insults and humor. Grade C+",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "Let's Be Cops es una película de comedia que resulta divertida y, de hecho, también entretenida en su atmósfera.",
      "total_reactions": 0,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2014
      },
      "score": 4,
      "text": "I got a few solid laughs out of it, but it just dragged on a bit too long, was a bit too dull, and tried to be a bit too serious. I mean, rent it on Redbox, watch it, and forget it",
      "total_reactions": 0,
      "user": "Garfoodle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2014
      },
      "score": 5,
      "text": "It's not terrible.",
      "total_reactions": 0,
      "user": "tvnewsguido"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "Let's Be Cops is a fairly straight forward comedy, if you have seen a trailer you know the majority of the movie. Two guys dress up as cops and shenanigans follow. The acting isn't to bad but you like they rushed themselves from time to time. But it does make you laugh quite a few times at least. This comedy isn't something amazing but it gives you a few good laughs and isn't half bad for a weekend movie with friends or maybe family.",
      "total_reactions": 0,
      "user": "ToFewViews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "Let's Be Cops is a slow, unimaginative cop comedy that falls in line closer to Police Academy than the desired Beverly Hills Cop. What looked like a promising premise turned into a lengthy satire lacking in jokes or a decent story. The dialogue is repetitive, the cliches are repetitive and even the characters are reincarnations of both leads most famous roles. Everything is repetition and it gets boring quick.",
      "total_reactions": 0,
      "user": "TheFilmFanatic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "The critics are wrong again. This movie is pretty funny and is very similar to 22 jump street. Though it was not as good, I still enjoyed it and wanted to see it again. But it is cliched how the characters are just stupid.",
      "total_reactions": 0,
      "user": "MadMaxFuryRoad"
    }
  ]
}