{
  "mc_avg_user_score": 7.3,
  "mc_metascore": 58,
  "mc_mixed_rating_frequency": 5,
  "mc_movie_name": "Life in a Day",
  "mc_negative_rating_frequency": 1,
  "mc_positive_rating_frequency": 9,
  "mc_pro_critic_reviews": [
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 88,
      "summary": "Life in a Day is, without exaggeration, a profound achievement."
    },
    {
      "critic": "Staff (Not credited)",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2011
      },
      "score": 83,
      "summary": "It's our equivalent of that '80s art-film kaleidoscope \"Koyaanisqatsi.\""
    },
    {
      "critic": "Alison Willmore",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2011
      },
      "score": 80,
      "summary": "Life really sings when it's simply pulling together thematic montages - of waking up, food preparation or answers to the question \"What do you fear?\" - or letting a genuine moment unfold without comment."
    },
    {
      "critic": "Kirk Honeycutt",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2011
      },
      "score": 80,
      "summary": "Life in a Day is an experimental project driven by the Internet at its best, where connectivity among the planet's population has become a reality."
    },
    {
      "critic": "Helen O'Hara",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2011
      },
      "score": 80,
      "summary": "Moving and insightful. Not a classic by any means, but a fascinating glimpse of the way we live today."
    },
    {
      "critic": "G. Allen Johnson",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 75,
      "summary": "At once ambitious in its global reach and modest in its simplicity."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2011
      },
      "score": 75,
      "summary": "It's a pretty experiment with no apparent results, but plenty of marketability."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 70,
      "summary": "Life in a Day has an earthy and at times euphoric appeal. Helping on that front is the editing artistry of Walker (and an expansive team), the man in charge of all that splicing and dicing keeps things moving at an entertaining clip."
    },
    {
      "critic": "Noel Murray",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 67,
      "summary": "If nothing else, Life In A Day serves as a fine time capsule, recording some of what life was like on Earth in 2010."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2011
      },
      "score": 63,
      "summary": "Macdonald knows plenty about crafting something evocative from unscripted material."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 63,
      "summary": "It's the sort of big thought that makes a small point, which is precisely the problem with Life in a Day. A documentary that looks to give this notion visual form, it strives awfully hard for depth but, more often than not, comes off too shallow."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2011
      },
      "score": 60,
      "summary": "There are dull spots, as with any other day, yet \"Life\" aims to be, and occasionally is, like a YouTube-y \"Our Town,\" giving a sense of what it is to be alive on planet Earth."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 60,
      "summary": "Does the film add up to something more than a stunt? Maybe not. I was captivated by the several hours I recently saw of Christian Marclay's 24-hour-long \"The Clock,\" a video mashup in which thousands of clips from hundred of movies contain watches and clocks telling the same time that spectators can read on their wrists. Life in a Day doesn't aspire to such intricacy, but it's fascinating all the same, an electronic update of Alexander Pope's maxim that the proper study of mankind is man."
    },
    {
      "critic": "V.A. Musetto",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2011
      },
      "score": 50,
      "summary": "It's a clever concept that should play well on TV and the Internet. But as a big-screen movie, Life in a Day -- which lists brothers Tony and Ridley Scott as producers -- elicits a shrug and a question: Who cares?"
    },
    {
      "critic": "Mike Hale",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 40,
      "summary": "It's a hard movie to engage with or even sit through, despite the fact that much of the material is interesting in its own right. Oddly, but perhaps predictably, the problem is the resolutely conventional and soft-headed way in which that material has been assembled."
    },
    {
      "critic": "Nicolas Rapold",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2011
      },
      "score": 40,
      "summary": "The resulting object is less about the world than about itself, and feels like a hey-that's-neat 90-minute troll through the video-sharing website (which co-presents the project)."
    },
    {
      "critic": "Scott Tobias",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2011
      },
      "score": 35,
      "summary": "Produced in partnership with YouTube and distributed by National Geographic Films, the documentary Life in a Day is offspring with the worst genetic traits of both: narcissism on a global scale, speckled with pretty pictures. In a world without books or magazines, this is the movie people would watch in the waiting room at the dentist's office."
    },
    {
      "critic": "Andrew Schenker",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2011
      },
      "score": 12,
      "summary": "Only a few snippets escape the uncritical narcissism that the film celebrates and, despite their unimaginative employment, they stand as something of a rebuke to the film's dominant images."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "Youtube's \"Life in a Day\" has too much flaws; it spills in racism, self-deprivation, sexism, and death. Kevin Mcdonald here does a beautiful job in fusing these parts together but fails to cover up these cons. However, after watching this documentary I realized how many things happened in July 24th, 2010, and I'm happy with that.",
      "total_reactions": 1,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2011
      },
      "score": 6,
      "text": "The movie is decent. \"Life in Day\" is literally a 2010 July 24th time capsule. You can observe everything, all the beautiful sights and events, but that's the farthest reach the movie will take you. I would recommend this  film to artists, I guess?",
      "total_reactions": 3,
      "user": "AKoreanCritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "Life in a Day attempts the impossible - representing the experiences of the entire world on 24th July 2010. While this task could never be achieved to perfection, director Kevin MacDonald and his army of Youtube contributors manage to create a fascinating smorgasbord of the day-to-day experiences of people from all over the world. We witness a day in the life of a huge range of people, with vastly differing cultures, beliefs and levels of affluence. It must have been such a challenge for the filmmakers to choose what to put in the film from the thousands of clips submitted, and from these clips create a coherent narrative. There's no beating about the bush - yes, Life in a Day is an undeniably artificial creation, the clips used were chosen at the expense of others in order to put forward a particular message, a very subjective world view. That said, the film is extremely entertaining, sometimes emotional, and often profound. The majority of the film is made up of a compilation of clips of whatever aspect of the contributor's life they wished to film, presented either in chronological order (we begin with a set of clips from early morning, then waking up, breakfast, going to work etc) or organised along a particular theme/line of thought (there's sections covering everything from relationships to water). Where Life in a Day really stands out is in the three questions that were asked to the video uploaders - 1. What do you have in your pocket or handbag? 2. What do you love? and 3. What do you fear? The answers to these three seemingly simple questions, divided throughout the film, provide some of its most memorable moments. The answers are so varied, so individual, that they veer between the conventional, the unexpected and the shocking. While the film clearly couldn't represent everyone on the planet, you can't fault it for showing a huge variety of different opinions of the world. Life in a Day is nothing if not ambitious, and this huge undertaking has truly turned out to be something really special. By presenting snapshots of people's lives we are allowed to witness the beauty, the comedy and the tragedy of Planet Earth, and you are taken on a huge emotional rollercoaster while spectating. Simply put, it's the film event of a generation - there's really nothing else like it.",
      "total_reactions": 4,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "It is a rundown of the major human emotions, the singularity of each one and the variegated cultures. From  the conventional happiness, to the joy disguised as everyday life and also of the anguish, sorrow, and especially the incredible divergences in the world.",
      "total_reactions": 2,
      "user": "jimmytancredi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "Life In A Day has so many profound moments but overall it never really feels like a coherent piece of film. I know its hard with so many different voices, videos and ideas to work with to make everything come together but Life poses 3 major questions but then fails to go into enough detail to justify asking them. Despite the fact the choice of end video is incredibly thought provoking and emotional you end life in a day kind of empty. The questions asked are valid ones but the answers are so incredibly different that there can be no real comparison which is what a film like this should be doing. However it did do something amazing in trying to show a day in the life of the planet and the people who live on it. Its something that hasn't been tried before and its commendable, even inspiring, but the fact it only shows glimpses further emphasises the emptiness of the endeavour. I could argue that the film feels incredibly fake at times but the whole film is people taping themselves and making themselves look more interesting. Its the few videos where people have decided to be completely honest with the camera that provide the most engrossing moments of the film, the moments I would have liked to see more of because they forced you to think, forced you to evaluate the lives you are seeing and your own. The fact that these clever, heartfelt and honest moments are broken up by montages of day to day activities (although edited brilliantly) causes the film to lose focus and ultimately lose the viewer.",
      "total_reactions": 1,
      "user": "hoops2448"
    }
  ]
}