{
  "mc_avg_user_score": 7.5,
  "mc_metascore": 86,
  "mc_mixed_rating_frequency": 106,
  "mc_movie_name": "Lincoln",
  "mc_negative_rating_frequency": 63,
  "mc_positive_rating_frequency": 525,
  "mc_pro_critic_reviews": [
    {
      "critic": "Ian Nathan",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2013
      },
      "score": 100,
      "summary": "As unexpected as it is intelligent, thanks to virtuoso work from Spielberg and Kushner, Lincoln is landmark filmmaking, while Day-Lewis is so authentic he pulls off that stovepipe."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2012
      },
      "score": 100,
      "summary": "Spielberg has never made a more sophisticated and less sentimental picture. He and writer Tony Kushner craft it like a historical thriller."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2012
      },
      "score": 100,
      "summary": "What plays out is something like CSPAN 1865. That is, it's dense, talky stuff at times -- particularly at its start, as the film takes a good 15 minutes to gain traction -- but also highly rewarding and instructive."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2012
      },
      "score": 100,
      "summary": "Whatever moment of inspiration caused Spielberg to cast her (Sally Field) as Mary Todd Lincoln, it was sheer genius, because this is a role that demands bigness."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 100,
      "summary": "It blends cinematic Americana with something grubbier and more interesting than Americana, and it does not look, act or behave like the usual perception of a Spielberg epic. It is smaller and quieter than that."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 100,
      "summary": "The experience of watching Daniel Day-Lewis in this role is nothing less than thrilling. This is Lincoln. No need for a time machine, there he is."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 100,
      "summary": "Instead of a grand tableau vivant that lays out the great man and his great deeds like so many too-perfect pieces of waxed fruit, Spielberg brings the leader and viewers down to ground level."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 100,
      "summary": "Mr. Day-Lewis works famously, and phenomenally, from the inside out. The mystery at the core of his gorgeous performance, which is enhanced by Mr. Kushner's script, has to do with his masterly grasp of Lincoln's quicksilver spirit."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 100,
      "summary": "Go see this movie. Take your children, even though they may occasionally be confused or fidgety. Boredom and confusion are also part of democracy, after all. Lincoln is a rough and noble democratic masterpiece - an omen, perhaps, that movies for the people shall not perish from the earth."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 100,
      "summary": "Rarely has a film attended more carefully to the details of politics."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2012
      },
      "score": 100,
      "summary": "Defiantly intellectual, complex and true to the shifting winds of real-world governance, Lincoln is not the movie that this election season has earned-but one that a more perfect union can aspire to."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 100,
      "summary": "The movie is grand and immersive. It plugs us into the final months of Lincoln's presidency with a purity that makes us feel transported as though by time machine."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2012
      },
      "score": 90,
      "summary": "If it sounds like so much backroom politicking, it is. But it's exceptionally interesting, entertaining backroom politicking."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 90,
      "summary": "This is Day-Lewis' movie, and he does with the meditative inner stillness of his character a wonderful thing - he finds a type of heroism that runs counter to all of the usual showy movie signifiers of such a quality."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 90,
      "summary": "There is nothing bravura or overly emotional about Spielberg's direction here, but the impeccable filmmaking is no less impressive for being quiet and to the point."
    },
    {
      "critic": "Chris Packham",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 90,
      "summary": "This Lincoln, stunningly portrayed by Spielberg and Day-Lewis, is real and relatable and so, so cool."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2012
      },
      "score": 90,
      "summary": "Lincoln is too sharply focused to deserve the pejorative \"biopic\" label. It's splendid enough to make me wish Spielberg would make a \"prequel\" to this instead of another Indiana Jones picture."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2012
      },
      "score": 88,
      "summary": "Lincoln paints a powerful and compelling portrait of the man who has become an icon. We don't need to see more of his life to understand how rare a figure he was - this window is more than sufficient."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2012
      },
      "score": 88,
      "summary": "Never mind a few misguided casting choices; Lincoln is exceptionally good, elevated by a preternatural star turn, and by the energy and invention its director displays in telling a story that doesn't rely on action and special effects."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2012
      },
      "score": 88,
      "summary": "Lincoln is directed by Steven Spielberg but, to his great credit, few will mistake this for a Steven Spielberg film. Rather, it's a Tony Kushner film, the playwright who conjured up the wordy but intricately layered script; and it's a Daniel Day-Lewis film, the actor who so richly embodies the iconic title role."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 88,
      "summary": "Through this very specific look at a critical time in Lincoln's presidency, Kushner, Spielberg and Day-Lewis work together to present an honest look at America's most revered statesman. Kushner finds an artful way to weave in the texts of the Gettysburg Address and the 13th Amendment, as well as a creative way to present Lincoln's assassination."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 88,
      "summary": "It makes politics exciting again."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 88,
      "summary": "The result, glitches and all, is a great American movie."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2012
      },
      "score": 88,
      "summary": "Steven Spielberg's film may further the heroism so associated with its subject, and favor a liberal viewpoint that leers down at the Confederates, but it's no bleeding-heart glamorization."
    },
    {
      "critic": "Kate Stables",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2013
      },
      "score": 80,
      "summary": "Steeped in the bitter political divisions of the Civil War, Spielberg's thrilling film about hardwon freedoms is immersed in its own time, but speaks eloquently to ours."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2013
      },
      "score": 80,
      "summary": "Lincoln does sometimes get a little sappy around the edges. Though his project here is clearly one of conscious self-restraint, Spielberg can't resist the occasional opportunity for patriotic tear-jerking, usually signaled by a swell of John Williams' symphonic score. But in between, there are long stretches that are as quiet, contemplative, and austere as anything Spielberg has ever done."
    },
    {
      "critic": "Ian Buckwalter",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 80,
      "summary": "This Lincoln isn't an abstracted, infallible ideal, but rather a deeply conflicted, often lonely leader simply trying to do the right thing - even if that means few wrong things along on the way."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 80,
      "summary": "The history lesson in Steven Spielberg's austere, engrossing Lincoln is less about the revered President himself but his method for justice."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 80,
      "summary": "This high-IQ sermon is long but never lazy. Renouncing his tendency to make every movie take emotional flight, Spielberg sticks to the story as Kushner has artfully compressed it. Lincoln is brain food and, at another pivotal moment in American political history, an instructive feast."
    },
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 80,
      "summary": "This is not really a biopic of the great President as the title might indicate, but rather a fascinating, savvy look at the inner-workings of the political process and how things in the White House get - or don't get - done."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2012
      },
      "score": 80,
      "summary": "Tony Kushner's densely packed script has been directed by Spielberg in an efficient, unpretentious way that suggests Michael Curtiz at Warner Bros. in the 1940s, right down to the rogue's gallery of great character actors in a multitude of bewhiskered supporting roles backing up a first-rate leading performance by Daniel Day-Lewis."
    },
    {
      "critic": "Katey Rich",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2012
      },
      "score": 80,
      "summary": "If only modern American politics were remotely as entertaining."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "Spielberg manages to give us a Lincoln for our times, inspiringly heroic but demonstrably human."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "Lincoln is like a thoroughly researched poli-sci term paper come to life, with interesting personal material about the participants relegated to footnotes."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "Whenever Jones is on screen, the film's energy level kicks up several notches, an indication, I think, that Spielberg otherwise overdoses on directorial decorum."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "It's a must-see for Daniel Day-Lewis' charismatic, subtly shaded performance as Lincoln - and an even richer one by Tommy Lee Jones."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "At two and a half hours, Lincoln contains only a single battle scene in its opening seconds. The rest is pure talk, a keen dramatization of Doris Kearns Goodwin's tome \"Team of Rivals,\" that delivers an overview of Lincoln's crowning achievement in chunks of strategy talk."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "Lincoln is built around a magnetic Day-Lewis turn, and the film is a memorable, sometimes stirring look at how even the most righteous bill must struggle, and even cheat, to become a law. It demands a bigger stage than the one it's given here."
    },
    {
      "critic": "Read full review",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2012
      },
      "score": 70,
      "summary": "Lincoln, written by Tony Kushner, directed by Steven Spielberg, and derived in part from Doris Kearns Goodwin's \"Team of Rivals,\" is a curious beast. The title suggests a monolith, as if going to this movie were tantamount to visiting Mt. Rushmore, and the running time, of two and a half hours, prepares you for an epic. Yet the film is a cramped and ornery affair, with Spielberg going into lockdown mode even more thoroughly than he did in \"The Terminal.\""
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2012
      },
      "score": 70,
      "summary": "The result looks as much like a Natural History Museum diorama as it sounds: a respectful but waxy re-creation that feels somehow awe-inspiring yet chillingly lifeless to behold, the great exception being Jones' alternately blistering and sage turn as Stevens."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2012
      },
      "score": 67,
      "summary": "His (Spielberg) is an old-fashioned style of moviemaking that can produce soaring entertainment or, alternately, a fussed-over theatricality. Minute to minute, Lincoln moves between these extremes."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2012
      },
      "score": 50,
      "summary": "For his complex portrayal, Day-Lewis is likely to have roses thrown at his feet, but for the dreadful film in which he's enslaved, emancipated onlookers will reach for the grapes of wrath."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2012
      },
      "score": 50,
      "summary": "There's something deeply poetic about Lincoln making his way through a changed nation to meet his demise. Such poetry is nowhere to be found in Lincoln."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2012
      },
      "score": 50,
      "summary": "Lincoln is also a colossal bore. It is so pedantic, slow-moving, sanitized and sentimental that I kept pinching myself to stay awake - which, like the film itself, didn't always work."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Lincoln is one of the greatest biopics of all time.Steven spielberg has done an incredible job.this movie is grand.the cinematography is amazing.All the performances are astonishing.daniel day lewis delivers the performance of a lifetime.",
      "total_reactions": 2,
      "user": "papai"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "It's hard not to give this film the highest marks. Daniel Day-Lewis is amazing and so perfect. That's no surprise. What surprised me was the fact that so many other great performers were not overshadowed. Tommy Lee Jones nearly steals the show as Thaddeus Stevens, and Sally Field commands her role as Mary Todd Lincoln. Every character gets plenty of screen-time, all the while we are served up a buffet of the greatest portrayal of a US President in the history of cinema.",
      "total_reactions": 2,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "A riveting portrait of the last few days of the late president, 'Lincoln' is a highly-tuned piece of historical drama that works almost the same way as a blockbuster thriller, mostly thanks to Daniel Day-Lewis (who presents us with a typically masterful performance), Tony Kushners dense, historically accurate script, and Spielberg's willingness to hold off of sentiment and keep it realistic. In fact, this movie barely feels at all like a work from Steven Spielberg. It feels more like a Sidney Lumet courtroom drama, with occasional blips of Spielberg's touch feeding through. I would have to say that, thanks to this display of restraint, 'Lincoln' marks his best film since 1998's war masterpiece 'Saving Private Ryan'. The entire cast is put to great use, even those actors who might not seem like the right choice for a role that may demand a southern accent and donning a wig (James Spader I'm looking at you). While Daniel Day-Lewis captures with absolute clarity Lincoln's steady mannerisms and droll sense of humor, Tommy Lee Jones provides an antithesis as the spitfire, strongly-voiced abolitionist Stevens. Sally Field also makes a strong return to the screen as Mary Todd Lincoln, perfectly capturing the frantic melodramatic fits that the role requires, while also not submitting to a shallow interpretation of her vibrant character. The rest of the cast shines as well, giving the look of the film the sense of being thoroughly lived-in. While we may never be able to get a 100% valid look into the life of the great man, 'Lincoln' represents the most accurate and engaging exploration of his life ever transmitted to the silver screen and it stands as a hard-won tribute to his accomplishments as well.",
      "total_reactions": 2,
      "user": "TheDRauch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "With excellent acting by the entire cast, deep characters, and great dialogue, Spielberg and Kushner create a beautiful film that immerses the audience into the time period and reanimate these historical characters.  Through my personal passion for history and politics, I was able to recognize and appreciate the amount of detail they put into their work.  Daniel Day-Lewis once again immerses himself into a role and the result is breathtaking.  My favorite film of 2012, this movie is destined to be a classic.",
      "total_reactions": 2,
      "user": "bsykes91"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "It's clear throughout 'Lincoln' that the man himself was not a man of means, he didn't come from money nor did he have much of an educational background, he learned about life through living it, rising the ranks with popularity amongst the people he served, Daniel Day-Lewis delivers a dazzling and powerful performance as the 16th President of the United States, a man with countless stories and a calm and collective attitude that resonates throughout the film, a film that breathes a sombre breath, yet it accomplishes an impressive feat of pivotal speeches, interesting characters and a story intertwined with the politics that surrounds Lincoln and his family. We pick up out story in the closing month of Lincoln's fruitful life and as he attempts to push through 13th Amendment with the aid of Thaddeus Stevens (Tommy Lee Jones) and William Seward (David Strathairn) amongst others. The detail and careful consideration put into each political moment of this historic amendment is quite astonishing, an ensemble cast full the shoes of various figures in the life of Lincoln as he attempts to be the driving force in the abolishment of slavery in the United States, but the opportunity to break away the financial roots of the Confederacy also played a major factor in an attempt to end civil war. The film doesn't have the typical blockbuster and big-budget effect that director Steven Spielberg creates, but instead we have gatherings of important people in dark, candlelit rooms as they argue for themselves but also what truly matters, peace, there isn't epic portions of flying flags, but instead there are intensely flawed characters, never really sure of loyalty or allegiance, equality plays a major factor in the film, not just amongst the people, but for the President himself, who is often held accountable for his past as a man not coming from a privileged life, but it also fits well with a film that wants to show the real side, as Lincoln himself uses tactics, as any politician does, to sway voters, using negotiators (James Spader, John Hawkes and Blake Nelson) to change the minds of a few Democrats. The performances are the true heart and brilliance of the film, Daniel Day-Lewis captures the mannerisms of what we perceive to be the man in the top hat, a soft spoken individual but one who seems tired and endlessly in thought, often brought back down by his passionate and forthright wife, Mary Todd Lincoln (Sally Field), and his stubborn son Robert (Joseph Gordon-Levitt).",
      "total_reactions": 1,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "The real-life characters from the time then are brought back to life, and it feels like you are in the 19th century. However, a lot of the scenes dragged out too long and I found myself drifting away at the theater because I was so bored.",
      "total_reactions": 1,
      "user": "BVGNOfficial"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "My favorite movie of 2012.  Lincoln is exceptional film making by Steven Spielberg, with brilliant  performances by Daniel Day Lewis and Tommy Lee Jones.",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "The real masterpiece comes from Daniel Day-Lewis' climactic performance, as well as his dead on portrayal of our greatest president. Tommy Lee Jones as the cynical Thaddeus Stevens gives us a laugh with his sardonic humor. And Sally Field scores again as the emotionally traumatized Mary Todd. The story-line is brief considering their history altogether, but \"Lincoln\" is a gut-wrenching memoir of the 13th Amendment.",
      "total_reactions": 1,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Three things struck me about this excellent movie. First, at times I thought I was watching a play, not a flick. Lots of set pieces shot on sound stages. 90% dialogue, 10% action. Secondly, I found that dialogue to be self-consciously archaic, sometimes almost Shakespearian in syntax and dialect. (That always makes me wonder how close screenwriters and directors really come to the speech patterns that actually existed back in the day. Since we have no recordings from that era, movie makers must use diaries for clues and examples. That said, I suspect that a) the written word was different from the spoken and b) oratorical speech more different from conversational speech than it is today.)",
      "total_reactions": 8,
      "user": "nautico"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "Spielberg & Tony Kushner managed to to transfer us into the mind of Lincoln giving us a historical thriller that will soon become a \"Classic\".The film has the two \"battlefields\" of war and politics that keep us on the edge of our seats.As it goes for Daniel Day-Lewis(Lincoln) I have only one word: \"Breathtaking\".",
      "total_reactions": 8,
      "user": "LeonidasPeplis"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "First rate look at the personal side of real people written about so much as \"legend\" that you forget.  Is Rex Reed serious about this being a \"bore\"?  When is he going to retire and stop boring us?",
      "total_reactions": 7,
      "user": "KJJ"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "The latest from Spielberg examines the great president's last 4 months, when he struggled to pass the 13th Amendment to end slavery. Tony Kushner (\"Angels in America\") wrote the screenplay, so it's wordy and eloquent. In the title role, Daniel Day Lewis is simply amazing: creating a character who's not only imposing, but wise and down-to-earth. Sally Field and Tommy Lee Jones also turn in great performances and the entire cast is outstanding. Visually, it's attractive and full of period eloquence. Don't expect this to be a big hit, the seriousness of the subject and constant conversation renders it too inaccessible. It is a solid history lesson in a beautifully made and intelligent package.",
      "total_reactions": 6,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "If you are looking for action pass this by.  The movie is like watching a chess game.  Slow thinking, planning and timing",
      "total_reactions": 5,
      "user": "gfny"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "I was enthralled from the start.",
      "total_reactions": 7,
      "user": "scriptsmotion"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "they might as well give day-lewis the oscar now. he outdoes even himself here. a truly lived-in character right from the start. and kushner's script is unbelievable. bravo",
      "total_reactions": 7,
      "user": "kubr1ck"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "A joyous bundle of history and excellence. The movie plays out in a slow and slightly reserved fashion, rewarding those who pay close attention to the details of the well-versed dialogue. The acting on all fronts in spectacular, and it not only paints a detailed and acute description of one of the most important pieces of American history, but does well in honoring the great United States President and showing you a great depiction of his life and those around him. By the end, you'll feel your own sense of emotional accomplishment and maybe even feel smarter. Overall, a glorious film, and my personal movie of the year.",
      "total_reactions": 3,
      "user": "Leftyy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "This is a really solid movie.  The acting is superb, the story is interesting, and the writing is good.  However, it felt oddly short.  There were all these interesting characters, but not enough time to develop any of them completely.  It felt like it should have been a TV miniseries.  One other thing really stood out to me for some reason.  I'm not one to let profanity affect how much I like a movie (The Wire is one of my favorite TV shows), but this had more profanity than I would have expected from a movie set in the 1800s.  Even Lincoln said \"sh*t\" at one point.  It just really caught me off guard.  Other than that, this is a great movie that tells the story of Lincoln as you've probably never heard it told.",
      "total_reactions": 3,
      "user": "m_elders"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "A wonderful movie, it tells the part of the story that wasn't told- the struggles Lincoln had to deal with in his fight versus the Democrats and even within his own party.  It's a compelling drama, in the spirit of \"The King's Speech\" after watching this movie I admired Lincoln, and wished I had been around to hear one of his \"stories\"",
      "total_reactions": 3,
      "user": "UnclearImage"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "I can understand why on the surface alot of people may have found this movie to be boring. But when you give it a chance and look and enjoy the performances of all the leads , I found it anything but boring. Daniel Day Lewis is incredible and James Spader was surprisingly good too. I think it was a great choice not to include any real action sequences in the movie , as I feel they would have felt completely out of place and fo4ced in a movie like this. Overall I was glued from start to finish. Wonderful stuff.",
      "total_reactions": 3,
      "user": "noco71"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "My girlfriend fell asleep during this movie, but I sure didn't. It is dialogue heavy which I'm sure everybody has heard. The screenplay is excellent though, allowing for moments of subtlety where other movies would be afraid to bore the audience. The acting accompanying the screenplay works perfectly as every character seemed to be cast perfectly to suite their role. Great supporting roles in this movie go even further than Tommy Lee Jones and Sally Field. James Spader is a surprisingly hilarious addition to the cast and Joseph Gordon-Levitt brought added drama to the film. See it if you are slightly educated in Civil War history, and can enjoy a well-written film.",
      "total_reactions": 3,
      "user": "Jribs"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "Interesting movie.  It prompted me to read Ms. Goodwin's book.   There were several actors that I absolutely  loved seeing and they all did an amazing job.",
      "total_reactions": 3,
      "user": "Makaliah18"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2013
      },
      "score": 3,
      "text": "Lets get this Bill passed.. find someone to help pass this bill... hey bill will you help me pass this Bill.. wow what a waste of talent. actors were superb sets and direction was excellent. but give me a break the story should have focused much more on personal relationships and how without that bill there lives being affected by it. that would have made a more powerful movie...",
      "total_reactions": 3,
      "user": "BellinoP"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2013
      },
      "score": 2,
      "text": "Couldn't watch it all it was so dull. Ridiculous facial prosthetics. Watch \"Boy with a bike\" instead. This is not, as had expected, a biopic, it just focuses on one small piece of legistlation that they're trying to pass. An episode of the West Wing is more entertaining. DDL is good but the rest of the film ducks sonkey sicks.",
      "total_reactions": 3,
      "user": "adolfGarlic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2013
      },
      "score": 3,
      "text": "Yawn!!  I can certainly appreciate the artistic talents of the writers and the actors, but when I go to see a movie, I want to be entertained. If I wanted to learn the intricate details of how Lincoln was able to pass the 13th amendment, then I'd watch a documentary.  This movie stretched on for two and a half hours of mostly boring dialog.  Yeah, I can appreciate the acting, but this was not what I was expecting.  Very disappointing.",
      "total_reactions": 3,
      "user": "thom71gt"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2013
      },
      "score": 3,
      "text": "This movie was like watching C-SPAN from the 1800's.  It is EXTREMELY slow and stuffy.  Some of the vocabulary is like listening to Shakespeare, you kind of understand what they are saying but it still would be helpful to have a translator to make sure you know what is going on.   Abraham Lincoln and his rambling stories....... I wanted to shoot him myself by the end of the movie.  He is like that uncle that tells you a 15 minute story that has nothing to do with anything.  All that being said, there is great acting and I can see where it would be critically acclaimed.  If you are looking for a true look at politics in the 19th century, this movie is for you, but if you want action or anything resembling entertainment, pick a different movie.",
      "total_reactions": 3,
      "user": "hgtrainer74"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Oh, this is beautiful film-making. Spielberg takes you on a ride inside Lincoln's mind and his intimate conflicts, in such a pretty and touching way...",
      "total_reactions": 13,
      "user": "Darkjoker28"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "I must be in the minority, but I was very disappointed with \"Lincoln\".  I really enjoy history and biography, had read Goodwin's book and had heard almost unanimous praise for the movie.  However, I thought the film was tedious, the script very stilted, and the acting rather mundane.  If this had been a movie without the hype, the well known cast and director, and the subject, I am sure more of the critics would have panned it.  I kept looking at my watch and wondering when it was going to show all the great things that had been written about it.  A real disappointment.",
      "total_reactions": 25,
      "user": "evancuster"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Who is this R. Kurt Osenlund of Slant Magazine that writes, \"Steven Spielberg's LINCOLN film may further the heroism so associated with its subject, and favor a liberal viewpoint that leers down at the Confederates, but it's no bleeding-heart glamorization.\" ?  Who says conservatives were in favor of the Confederates? Lincoln was a conservative Republican, and most of the Confederates were Southern Democrats. People don't seem to realize that it's Republicans who were and still are the true \"liberals\": those in favor of liberty, freedom, and self-determinism (the right to life, liberty, and the pursuit of happiness) for all people. The movie is good, though. Just ignore Slant Magazine.",
      "total_reactions": 8,
      "user": "frozenpinky"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "The movie is saved by outstanding performances by the supporting cast, including some moments of humor by James Spader.  It's a good movie, but not the type of historical account that you'll return to like you would Schindler's List.  DDL is, of course, excellent, but the movie as a whole is essentially solid work.",
      "total_reactions": 4,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "Lincoln will likely appeal to political junkies above all others thanks to its complex and in-depth examination of the painstaking process of passing legislation through a gridlocked congress-which has eerie parallels to our current political climate.  But the remainder of viewers will have to be satisfied with an expertly crafted, albeit somewhat creaky, historical drama fueled by a career capping turn from Daniel Day-Lewis and an excellent supporting performance from Tommy Lee Jones.",
      "total_reactions": 2,
      "user": "BKM"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "When the lights came up after Spielberg's Lincoln the packed audience began exiting in an overly courteous and orderly manner. It was eerie. It felt like we were playing a formally dressed audience leaving an opera house after a beautiful ceremony. But it wasn't until I was walking up to my car that I remembered we had come for a movie. I remembered being excited about the movie. I remember 30 minutes of horrendous previews. I remember the opening credits and the low murmurings of the Chicago Symphony's brass section improvising Aaron Copland riffs. I remember Abraham Lincoln telling me to relax ... relax ... count backwards from ten ... then the feeling that I'm floating somewhere above the mid 19th Century. James Spader floats by eating crabs, and then David Strathairn in a Chinese robe. In the parking lot I have a faint feeling that I had just enjoyed myself. I think I ate a piece of hard candy",
      "total_reactions": 2,
      "user": "DQ_Slotkins"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "A drama movie laden with history and political theater. The pacing starts off a little slow but picks up nicely at the end. I will admit it was hard to understand all the references at times but the movie does a great job of keeping you engrossed in the time period. I highly suggest you read about the history of the 13th amendment to understand the film better as I think you'll get more enjoyment from it. I will watch this again for sure. Turned out to be pretty powerful.",
      "total_reactions": 2,
      "user": "theoffice"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "A superb movie with great acting by Daniel Day Lewis, this is a movie worth seeing. Even though at times the dialogue is pretty heavy, and seems to go on and on, the story is well told, and it's a movie you wouldn't be disappointed with.",
      "total_reactions": 2,
      "user": "TheMovieCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Steven Spielberg's movie made a huge impression in theators. With a blazing $85,846. The movie has such a great cast. This is what a biography film should be like.",
      "total_reactions": 2,
      "user": "dante_finn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Day-Lewis proves once again he is the best actor of his generation. Spielberg's touch and mastery are all over the film, yet a bit hard to follow at time with the onslaught of new characters and dialogue. Overall, a wonderful movie experience.",
      "total_reactions": 2,
      "user": "CBN"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Honestly one of the best movies I have seen in a long time! Spielberg did a wonderful job on this piece. The acting and the costumes to the filming locations were perfect. The chemistry between Daniel Day Lewis and Sally Fields was epic. A must see!!",
      "total_reactions": 2,
      "user": "natmazz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "I braced for a poor historical account with over-direction from Spielberg and over-acting by Daniel Day-Lewis. Spielberg masterfully manages Tony Kushner's dialogue-heavy script in a thrilling way I have not seen since \"All the President's Men.\" Kushner could have been preachy or melodramatic; his script is riveting. Best of all, Daniel Day-Lewis inhabits Lincoln the way Daniel Craig fits into a James Bond tux. This film is dazzling - a wonderful theater-going experience. Congrats to everyone involved with this production.",
      "total_reactions": 2,
      "user": "Speaking247"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "Daniel Day Lewis is a perfectly cut glittering diamond in this beautifully crafted setting.  Spielberg has renewed my trust in him, since this is easily the best film he's made since Saving Private Ryan.",
      "total_reactions": 2,
      "user": "storyhobbit"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "I like the movie. Maybe, because I am  too spoiled with action movies, this one seems slow, almost like a reading book. I found the structure to be interesting, - arguments over a passing 13 amendment has almost took entire movie, building the culmination bust in the end.  The characters were deep and passionate. Overall good movie.",
      "total_reactions": 2,
      "user": "natash"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Very, very well made, and great acting. Great movie. At some times, can seem melodramatic, but all in all, it's a great film. Daniel Day Lewis delivers Lincoln expertly.",
      "total_reactions": 2,
      "user": "nirishan9"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "On some level I can relate to comments about the slow pace of the movie, especially in the beginning. I agree that the pace was slower than I expected, but it was not too slow. It was perhaps the appropriate pace to gather in the facets that were needed to relate the urgency and polarization of that time. There are plenty of scenes to make the blood race, not because of battles or other action sequences, but because of the opposing views that were being spewed out with such venom. To see a president in the midst of such turmoil, apart from the battlefields of which we have all seen and read plenty of documentaries and dramatizations, was riveting. On this side of the historical time line, we can look back, knowing that the 13th Amendment was passed. Yet this movie was able to take me to a place where I experienced how impossible it seemed then, and to experience the relief, even more than triumph, that the feat was accomplished. The film's deft script and inspired acting showed what a delicate tightrope the President had to walk to make this happen and how very close it came to failing. Then the war would have ended, and the states remain united, but the slavery issue would have remained unresolved.",
      "total_reactions": 2,
      "user": "aldebaran937"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "Lincoln is an extraordinary picture that takes us into the world of politics as we have never seen it before, and Spielberg shows that he still is one of the greatest directors in the history of cinema, and that Daniel Day-Lewis is one of the finest actors of all-time.  Steven Spielberg has always been my favorite director, his films such as Schindler's List and E.T. The Extra-Terrestrial are one of the main reasons that I fell in love with movies in the first place.  He has been planning to make this movie for a very long time, and now that it",
      "total_reactions": 2,
      "user": "BreakingBrad"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "When you leave cinema after seeing this film you will be inspired by it. Yes it's that good. Now you probably want me to explain that. Firstly \"Lincoln\" was directed by Steven Spielberg. Whit that said you know what to expect, and he's not the only great name among the cast. It features Daniel Day-Lewis as Lincoln, Tommy Lee Jones, Joseph Gordon-Levitt  James Spader, and many more. The list is just full of experts. Script is well written, acting is top notch, and every scene fits perfectly.  I especially love speeches in this movie. They are well written and define personalities of characters. The thing i loved the most is Lincoln himself. In this film he's shown as a real person with problems and emotions, and they did tat brilliantly. Some people think that \"Lincoln\" is too slow. And maybe some scenes are dragged out a little, but they should be. Every word and shot in this film matters. It defines characters and it's important for plot. It's a political movie so some people might be bored. You'll need too bi in the mood for watching this film. With all that sad I cant find single objective fault, well i think i saw a bald cap on Tommy Lee Jones in one scene but i'm not even shore. If you like history, drama, politics or fun you will like \"Lincoln\"",
      "total_reactions": 2,
      "user": "RefinedIron"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "The big problem with Lincoln is that it's a performance, and not a movie. Daniel Day Lewis is excellent, as always, and looks and sounds just like the man himself, but the film is self-indulgent and pays attention too heavily to Lincoln's abolishing slavery, when there were many more interesting times in this man's life. Sally Field is wasted, in my opinion, having less than 15 minutes of screen-time. Tommy Lee Jones is great, but he too isn't given enough time to have an interesting story. I wanted to like this film more than I did.",
      "total_reactions": 2,
      "user": "MavisGary610"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "Director/producer Steven Steilberg has great movies made everyday .  his project on Lincoln is okay i guess",
      "total_reactions": 2,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "Not being American and familiar with the story I found this incomprehensible. It does not even seem to be a particularly momentus time in history. Its not as if the Americans were the first to ban slavery !!",
      "total_reactions": 2,
      "user": "johnnybegud"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "The ingenuity of the script in impeccable. Never has a film payed such careful attention to the details of politics. Yet even through all the detail, and all the material covered, Speilberg's Lincoln is compulsively watchable. The result is a great American movie.",
      "total_reactions": 9,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2012
      },
      "score": 3,
      "text": "If you look at many of the good reviews, you will see the problem, in my mind, with this movie.  It is a bit too slow, too monotone, and simply too stuffy.  There could have been so much more color and life.  I think we should have seen different perspectives, such as from the angle of a simple working person and from the angle of the south.  The movie leaves out Lincoln's great speeches, making only brief references.  The movie leaves out the assassination, and what we know about who did it and why.  The real death blow to the movie, for me, was the lack of vigor in why and what they were fighting for.  After all, huge numbers of americans died.  So, for me the movie was a dud.  I think a lot of people are caught up in the moment.  By the way, the supporting acting was GREAT, and I would give an award to Sally Fields.",
      "total_reactions": 20,
      "user": "foundationcitiz"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "This is Steven Spielberg's worst movie. It is boring, it has no action, it has no suspense, it has no story, it really has nothing. It was just one VERY long story of Lincoln's last few months, which are not very exciting at all. A History Channel documentary on Lincoln would have been 10 times better. Trust me, halfway through this movie, you will want to see Lincoln assassinated.",
      "total_reactions": 5,
      "user": "mrmonster"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "If you want a constant reminder of how Spielberg voted in the last election, then watch this movie. Otherwise, read a solid biography on Lincoln. Spielberg's movie making is about as subtle as a five year-old screaming for candy in your ear. Most of the movie feels wooden and plastic, if that is even possible. On the up side, it is a movie about Lincoln, so there is a fair amount of feel-good American jingoism.",
      "total_reactions": 5,
      "user": "Oroiael"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2012
      },
      "score": 1,
      "text": "In this movie Spielberg does to history what John Wilkes Booth did to Lincoln.  Everyone knows how Spielberg voted, but just in case you were wondering, see this film.  Slow and plodding at best, and for those who like history, it is a train wreck.  DDL does a great performance, but Spielberg's politically motivated style kills what could have been a good film, and does a great disservice to a great man.  While they got DDL spot on casting wise for Lincoln, did the casting people ever look at a picture of Mary Todd Lincoln?  Pass this movie by and take the time to read a good book on Lincoln, you will be better off.  Saying this movie is based on historical events is like saying Twilight is a documentary.",
      "total_reactions": 16,
      "user": "Bart"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2013
      },
      "score": 2,
      "text": "Lincoln is deprived of emotion, comedy, action and music that makes a film come alive. Even with a interesting time in our history the movie is a total bore with a pace unimaginably slow. It tries to come alive in the end but with a rushed ending the movie falls apart. A disgraceful film by Spielberg.",
      "total_reactions": 9,
      "user": "csw12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2013
      },
      "score": 2,
      "text": "I am very surprised to see such praise for this film.It is not only too long,but its turgid pace which drags relentlessly make it it appear even longer.Spielberg appears to have thrown away the magic template.",
      "total_reactions": 3,
      "user": "ScottishSchemie"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2013
      },
      "score": 1,
      "text": "I have to say this was an incredibly dull movie.   If you're not american, you'll be scratching your head in bafflement about why there was a need to create a whole movie about a bunch of senators trying to wrangle votes for a bill.  The sort of stuff you'd avoid on TV nowadays even if you're interested in politics.",
      "total_reactions": 3,
      "user": "zedzded"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "Lincoln is unquestionably one of Hollywood's top three films of 2013; Spielberg's direction and Day-Lewis' performance are more than just noteworthy. This is an effective and fairly displayed period piece that can only be criticized for it accurate display of a slower time and its artistry prevents any other negative honesty.",
      "total_reactions": 3,
      "user": "Wes_Brewer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2013
      },
      "score": 4,
      "text": "i don't normally criticize Steven Spielberg work but this one is actually boring.",
      "total_reactions": 3,
      "user": "ExKing"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "I am not an American and don't now much about their history. This was a huge disappointment. Tedious and long winding. If you don't care for the intricacies of politics, don't waste your time.",
      "total_reactions": 3,
      "user": "Nicozandberg"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "Daniel Day-Lewis IS Abraham Lincoln in Steven Spielberg",
      "total_reactions": 10,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2012
      },
      "score": 4,
      "text": "Too political and too talkative!  Stellar performances elevate this film and make it appear much better than it is.  It's typical Spielberg......history as he wants us to remember it.....all the characters are literally black or white.  Even the \"lobbyists\" are good despite devious methods used because they're on the right side.  Smacks of Spielberg's earlier work Amistad where he didn't acknowledge that slavery began with people being captured and sold by members of their own race.  The only real moments of connection are made in scenes with Sally Field and Lincoln's interactions with his older son.  The opening scene gives us a compass as to where we're headed....these \"real\" soldiers can remember the Gettysburg address word for word after hearing it once? reading it where? having time to memorize it when?  Even those of us who were around in the Kennedy years are forturnate to remember one, maybe two lines of a famous speech.  Spielberg needs to leave history alone if he's not really interested in giving us the true picture.",
      "total_reactions": 7,
      "user": "wvmoviefan"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2013
      },
      "score": 2,
      "text": "No academy award winning directors or actors could save this tediously long debacle of a film. This movie seemed longer than the Civil War. It is neither engaging, entertaining, or thought provoking. Completely overrated.",
      "total_reactions": 8,
      "user": "Trev29"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "I love movies, that, make you think and get you sucked into that world. This movie had none of that.",
      "total_reactions": 4,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "Not so great movie.i really thought  it was and awesome movie. turns out it really a shallow movie. but i must commend on the story of Abraham Lincoln. it was nice and appropriate story of putting down the axe and using the words and politics.  a lot of better movies out there.",
      "total_reactions": 4,
      "user": "Momon"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "There is no way this movie did not win 'Best Picture' at the Academy awards. Truly fascinating It kept me glued to the screen. Congratulations to everyone involved here to make such a masterpiece. Daniel Day Lewis is truly an exceptional actor.",
      "total_reactions": 5,
      "user": "Nazgulero"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2012
      },
      "score": 1,
      "text": "This film is a total bore. I had to force myself to sit in my seat for the length of this almost endless movie and left the theater with a pressure on my head. Steven Spielberg just can't handle heavy drama as was proven with \"Amistad,\" \"War Horse,\" and to some degree \"Munich.\". His pace is so slow in \"Lincoln\" that it's maddening. Even Daniel Day Lewis can't save this film. I don't believe that a docudrama has to be boring and slow in order to be a good one. It's the director's role to make his film come to life even if we know how it ends. This film is truly underwhelming. Tony Kushner's script is overpraised, as well as John Williams unimpressive score. There is so much talent in this film that just doesn't even come close to reaching its full potential. As I left the theater I said to a friend of mine, \"If you ever want to torture me, force me to sit through that film again.\"",
      "total_reactions": 6,
      "user": "bobbee"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "text": "If there was ever a movie that WASN'T what it said on the tin, this is it. It kicks off with yer man from My Left Foot, here with a funny hat and beard for whatever reason, sitting about drinking tea and telling stories. This goes on for quite a bit. Dunno what he was saying. I don't think the other characters were even listening. Half an hour in and still no sign of the vampires, so I fast forwarded a bit (don't ask me how I did this in the cinema). Watched another scene. Tommy Lee Jones out of off of US Marshals pops up with a silly wig. Still no action. Fast forwarded again and the end credits were rolling. Maybe I skipped past the vampire scenes. And this is supposed to win Oscars? Pfft...",
      "total_reactions": 16,
      "user": "SHANKROID"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "Daniel Day-Lewis does a fantastic mjob undeniably. However, I was bored with the repetition of dialogue, the length of the film, and the consistent dark lighting. It is great on performance and technical level for the most part but when it comes to other thing sit is far from good. I give this film 48%. Spieberg disappoints two years in a row for me.",
      "total_reactions": 2,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2012
      },
      "score": 4,
      "text": "I fell asleep three times the tone is so monotonous.Old Honest Abe was a wily fellow and in fact Old \"technically\" Honest Abe. Sally Field is believable and has some life in her performance. Speillie should have developed the Tommy Lee Jones \"surprise\" story throughout the script...this would have added tension and another layer of humanity. Same with the Bobby story...there's no real insight into that relationship. So instead there's just politics is like making sausage, only more boring. There was no point in ending with the \"Titanic sinking\" - that was pandering to our scant knowlege and  added nothing to the film.",
      "total_reactions": 1,
      "user": "Edeltraud"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "If you are a southern apologist who lives in the delusion they were fighting for anything other than slavery, you will hate this film. It puts the historical cards on the table and shows the south's refusal to give up on a war that was already lost because they would not agree to end slavery. Plain and simple, they were fighting for that reason and no other. If you prefer anachronistic dialogue,  with persons from history sounding like NYC cab drivers, you will hate this film. Kushner's script follows the best recollections of those who were present. With the forgivable exception of allowing the change of \"Now he belongs to the angels.\" to become the far better \"Now he belongs to the ages.\" If you want to see CGI recreations of Gettysburg and Antietam, you're in the wrong theater. This film is about Lincoln and his growing conviction that the war was never just about preserving the union. That his fate was to be the man who led this country to the end of slavery. Seen for what it is, that often the hand of God moves history with the least likely vessels, a prophet with a speech impediment, a carpenter's son born in poverty or that a man who had failed at nearly everything, whose family life was coming unhinged, should lead a reluctant, spiteful nation to end the babrbarism of slavery,  this film is a triumph.",
      "total_reactions": 1,
      "user": "DudefromTulsa"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "The history in this film was such an amazing view on the world in the civil war era. It really captured the struggle it took for Lincoln to get the slavery bill passed. This will probably go down as the greatest Lincoln film to ever be produced. Spielberg couldn't have picked a better Lincoln than Daniel Day Lewis. Lewis really let Lincoln consume him because he perfected the man that was Abraham Lincoln. What made me not give this movie a 9 was the ending. The ending was purely a let down. It would have been nice to see Lincoln get assassinated, and I know that sounds hateful in a way, but that is my only criticism. Many Lincoln movies have been made and they never show Lincoln getting shot in the back of the head. Capturing that part in the movie would have been pivotal in such an already great movie. Close the book! Show the assassination. I just hope this movie ends the infatuation of Abraham Lincoln. Nobody could have made this movie better than Stephen Spielberg.",
      "total_reactions": 1,
      "user": "ClayMerritt"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "Perfect acting, lavish dialogue, and a surprising amount of affecting images elevate \"Lincoln\" to the noble heights historical dramas can reach - a film that can both entertain and enlighten.",
      "total_reactions": 1,
      "user": "Compi24"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2013
      },
      "score": 3,
      "text": "I wish that Spielberg would have taken a more Hollywood approach with this film. First of all, I feel like I've seen recreations of Lincoln's life and death about a million times bellow the fluorescent lights that projected hours of ho-hum documentaries in History classes. This film, was no different. I believe that critics were so infatuated with praising this film under the telescope of intellectual scrutiny. I mean, come on, imagine if the Wall Street Journal gave this film a negative review. What \"reputable\" company would tear apart a film themed around abolition and the Civil War, directed by America's prodigious director, and centered around America's iconic President, Abraham Lincoln? >>Lincoln's death at the end (for people who are angry that I \"spoiled\" the movie, seriously?) was more of a refreshing release. >>Sally Field's portrayal as Mary Todd Lincoln was so abhorrently hard to watch. The potentially Oscar-winning performance COULD have came from Mr. and Mrs. Lincoln's grand argument about sending their son to war, but it was short lived and BORING since Daniel Day-Lewis was the only one pushing and trying to stimulate tense atmosphere (I can picture Steven Spielberg face palming big time). I almost laughed when Sally Field collapsed onto the ground...I thought the dress was going to eat her.",
      "total_reactions": 1,
      "user": "dollarsign"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2013
      },
      "score": 2,
      "text": "Spielberg does C-SPAN and, all things being equal, I'll take 3 hours of Brian Lamb over this schmaltzy, simplified hagiography any day. Wonderful performance by DDL, as usual, but the script should have been dispatched in a Ford's theater (where is belongs) with a very short run. What a waste of time, money and talent - sort of like the civil war - with so little to show for it. This movie was obviously created for the \"low information voter\" but even they deserve a better effort from the biggest director in Hollywood. Very disappointing and discouraging - I CAN NOT BELIEVE how many positive reviews this film has received.",
      "total_reactions": 2,
      "user": "KOTCB"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "Oh, what a movie. Spielberg is back to his old tricks to making good movies. Lincoln is a character study, as well as featuring an authentic, true performance by Daniel Day-Lewis hat seals us away and shows off his acting talents. He gets everything about Lincoln's disposition down to a tee, beard and all.",
      "total_reactions": 1,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "text": "The film should be retitled as \" Lincoln in Darkness\" since our eyes were crying out for a tiny big of light to see lincoln as Daniel Day Lewis's face was in half darkness throughout the film even though we were able to the other stars clearly. Day - Lewis's performance did nothing for me as he was actin in darkness to disguise his heavy make up though Sally Field has still got it. She was excellent. The film is so slow and uninteresting even the last half an hour of the film couldn't save it. We never see lincoln making a public speech in the entire film but Mr Spielberg puts a public speech scene soon after the Lincoln death scene. Give me a bucket because I will throw up.",
      "total_reactions": 4,
      "user": "Pelen23"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "I do not know what it is, but \"Lincoln\" just did not quite do it for me. I felt bored throughout, except of the actual voting (possibly because I am not American and know very little of this history, so I was not sure whether it passed or not), and kept on dozing off every once in a while. However, Lincoln is not all bad. The cast is superb, and Daniel Day-Lewis, yet again, performs his magic to quite an amazing result. Sally Field is also excellent, as are the supporting actors, led by Spader and Strathairn. Honestly, nothing bad can be said of the cast. The art design and costumes were very well done, as was the cinematography. Technically overall the film looks good. But the issue is with the script. It was just not so engaging. I am a sucker for drama, and a sucker for history (I got a degree in it!) but this was just not very entertainingly done. And mind you, I was thoroughly entertained and enjoyed \"The Hours,\" arguably one of the most depressing films in the past decade. \"Lincoln\" just does not do it for me. This may be my least favourite Spielberg film, which doesn't mean it's bad. It's a good film, just a bit boring.",
      "total_reactions": 0,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "\"Team of Rivals\" was totally engrossing, but somehow this excellent production does not quite capture the complex, conflicted personalities of Lincoln's cohorts. Daniel Day-Lewis is, of course, amazing, but his wit & wisdom here often match the overall preachy tone of the film. (Is DDL ever going to be sexy again, as he was in \"The Unbearable Lightness of Being\"???) It's fun to catch so many great character actors, though everyone in the movie has kind of a dark and gritty look -- like they just came back from working in an Appalachian coal mine.",
      "total_reactions": 0,
      "user": "Lyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "I really don't think anyone really needs any kind of lengthy review of this movie at this point.  You know what it's about, or at least you should.",
      "total_reactions": 0,
      "user": "DMWill"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "So overall I liked Lincoln and found it interesting. I liked the characters especially Daniel Day Lewis as Lincoln. I found the story somewhat interesting. Having said that a lot of my interest comes from my interest in history. I feel like if you aren’t into history or politics and you really don’t like dialogue heavy movies you really aren’t going ot get into this film. And even I am going to admit that yeah this film did not really hold my interest and that if it weren’t for the critical praise I’d give this film an eh rating. But because of critical praise and my interest in history I’m seeing this movie in a somewhat positive light. If you like history, you like politics, and you like Lincoln your probably like the movie Lincoln ok but just like it ok. Not as overrated as Argo but still kind of overrated.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "I'd give it a ten except I am not a Lincoln scholar and can't attest to the historical accuracy. I was moved. There hasn't been a movie about a floor fight in congress since Mr. Smith Goes to Washington that  is so engaging and compelling. And to top it off everyone knew how this one was going to end before they stepped into the theater and yet it was riveting. Being a political ideologue myself I left the movie feeling ashamed of myself for my personal intransigence. I have always believed political compromise was a sign of weakness. Shelby Foote in Ken Burns \"Civil War\" makes the statement that the \"genius of the American political system was for compromise and it utterly failed.\" Post election 2012 we are a divided country again but this time we had better learn to compromise for the good of the country and posterity.  The sky is not falling and this country has endured far darker days.",
      "total_reactions": 0,
      "user": "gunnyart"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "This is the best movie I have seen so far this year. It was entertaining, thoughtful, intellectual, and informative. When I got home, I looked up so many historical issues that the film brought to my attention. I really liked the acting as well and the fact that the characters were developed. It would have been so easy to have just resorted to battlefield scenes and blood to make your point. It was well timed as well since so many of the arguments were similar to what I had just heard in our election. Well worth the time and investment!",
      "total_reactions": 0,
      "user": "JamesL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "At first Daniel Day-Lewis's performance came across as a caricature, but after about 15 minutes he won me over completely.  A fascinating look at the political process of the time, some of which is still relevant today.  Well written and acted with great supporting roles, it never bored me.  They use some of the dialect of the time so I didn't always understand what was said, but it isn't hard to follow.  Tommy Lee Jones was great as usual.  I'm sure there will be lots of buzz at Oscar time.  The best Spielberg movie in a long time.",
      "total_reactions": 0,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "Not exactly a \"must-watch\" on the level of Schindler's list, but Spielberg manages to bring topical relevance to a historical subject, while making it an engaging view.  You can switch the topic and the characters, and it is still a powerful study of human behavior  what kind of man does it take to make a difficult decision, against all practical odds, with little-to-no support, while balancing \"right\" against \"expedience\" over the long term?  As with all Spielberg movies, it is well-written, well-filmed, and well-acted (with the exception of Sally Fields, whom I found to be over the top in a needless way).",
      "total_reactions": 0,
      "user": "ScrawnyPunk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Reminded me of Sorkin's West Wing, except better written and set in the Lincoln White House. As others have mentioned, this is an intimate look at Lincoln's struggle (indeed, our nations struggle) to get the 13th Amendment passed. Definitely a movie for political junkies and history buffs, with some stellar acting by Daniel Day Lewis and a great (and large!) cast of a supporting actors.  I didn't realize how long the film was--truly enjoyed it all the way through.",
      "total_reactions": 0,
      "user": "podunk411"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "Lincoln is a great historical  political film from Spielberg. Day-Lewis is absolutely perfect as Lincoln (when is he not perfect?) and the acting throughout is excellent. That said, there are a few niggles. The prime one being that Lincoln's death is not really gone into. I understand the artistic reasons for going in that direction, but it's still disappointing to be deprived of such a famous and dramatic moment in history. Otherwise, it's a great slice of film-making.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "Fairly useful and brute force historical depiction of the civil war. it shows how even back in the 1800s, the U.S. congress was all about back room deal-making, but at least then they weren't able to make a career out of being in congress. Though Steven Spielberg obviously has made some blockbusters, you still have to wonder with a topic like this; how much of the subtleties were created by the \"world according to Spielberg\"...? Its also a bit depressing to be so blatantly reminded that our country has not learned from history and in fact has gone backwards in terms of degrading and disrespecting the constitution. You can't walk out of Lincoln without feeling that this country used to have such promise and prosperity... and now it is so deeply bogged down with a bloated federal government, thousands of laws and taxes, and power-hungry career politicians that care only about their next election cycle...",
      "total_reactions": 0,
      "user": "David_H"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "Lincoln's kindness, quietness and generosity can translate to film in one and only one way if staying true to the man -  in a slow boring way.  Daniel Day Lewis did a fantastic job playing a non-flashy, quiet, almost emotionless \"character\".  I feel quite a few critics have overstated the \"thriller\" aspect of this film.  I felt none.  Day Lewis, Tommy Lee Jones and James Spader were top notch.  Good acting kept this movie afloat.  Like \"Titanic\", I knew the ending....but, unlike \"Titanic\"  this film did not have me leaving the theater surprised or energized by what I saw.",
      "total_reactions": 0,
      "user": "moviemonger"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "In my opinion, the script during the first half of this film reads like an entry in Wikipedia.  And the second half lacks soul.  In part, because the -much acclaimed- acting of Daniel Day-Lewis seems to me lacking in spirit;  it seemed to me that he has half asleep and bored.  I think that many of the glowing opinions may have more to do with the theme, than with the film.",
      "total_reactions": 0,
      "user": "jlua"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "Movie making at its finest. Daniel Day-Lewis' performance will be how a generation pictures the character of President Lincoln. What is compelling about this story is that it takes place in a moment in time rather than attempting to cover the entirety of the President's life. Instead, Spielberg captures the spirit of the President in his attempts to having a new constitutional amendment ratified. The script is well written, the acting is inspired, and the cinematography is near perfect.",
      "total_reactions": 0,
      "user": "Redfordsto"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "I thought the movie was good. the performances were good and the look of the film was spot on. It was a little confusing keeping track of who everyone was. I really liked Lewis as Lincoln. I want to see it again and I think I will get more out of it. overall 9/10.",
      "total_reactions": 0,
      "user": "cbolt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "I can understand why the critics might heap accolades upon this film but I have to say I was very disappointed. The film is like an average episode of \"The West Wing\". A cataclysmic event is happening but you never see it, the whole thing is like watching a drawn out town hall meeting. Characters are introduced without any explanation as to who they are or their influence on the story. The Civil War is merely \"Bad slaveowners versus noble crusaders\" when we know it was much more complex than that. You'd think the union army was comprised entirely out of black people. Day-Lewis is a subdued presence in the film though Sally Field puts in a strong performance. Overall the whole film felt like a made for Tv movie.",
      "total_reactions": 0,
      "user": "DukeJon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "\"Lincoln\" might get a little boring from some people with its long running time, but the film is a marvelous movie that benefits from a strong script by Tony Kushner and a oscar-deserved performance from Daniel Day Lewis.",
      "total_reactions": 0,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Trying to faithfully depict a larger (literally) figure than most can fail spectacularly, just ask Sasha Gervasi, the director of the recent  Lincoln starts as the civil war is coming to a close and Abraham Lincoln's (Daniel Day Lewis) window to pass the 14th amendment is quickly closing. Battling a hostile house of representatives as he tries to rally votes he must also cope with a grieving wife, a naive patriotic son and his own personal grief. Lincoln is completely unlike anything you would expect it to be much like the Lincoln displayed in the picture. This Lincoln is old, not due to his age but his responsibilities, he has aged quicker than most because of the events he himself has orchestrated yet he doesn't blame anyone, in fact he sees his choices not as choices at all but as necessities that have unfortunately taken what little was left of a man following the death of his son. However the film shows him as a man with a lot of fight still in him, a fight that is fast approaching. Director Steven Spielberg and writer Tony Kushner are clever to concentrate the film on Lincoln's last battle to emancipate the slaves as not only does it emphasize progress to a modern audience, especially when you consider that Lincoln's counterpart today is African American, but it also shows a man of great conviction, a man who stood out from the pack for all the right reasons and prevailed because people trusted in the man. The choice of Daniel Day Lewis was a perfect one with an early choice of Liam Neeson being in my opinion, way off base. There isn't a moment in the film where you don't believe he is Lincoln, that he isn't this great man. He completely encompasses the character. The film wouldn't be the film it is without the superb supporting cast it has, from a delightfully grumpy Tommy Lee Jones to a emotionally affecting Sally Field as Mary Todd. Even James Spader is a joy as he infuses the film with some much needed comedy instead of dropping his pants as he seems to do in most his movies. The only real weak link is Joseph Gordon Levitt who isn't so much a character but a plot point to be slotted into scenes where needed to serve a theme or a sub plot. It's not that he gives a bad performance, its just that he is ever so irrelevant. Overall its a near perfect Biopic of someone well worth doing a Biopic about. Not just a fine president but a rule breaker and a cheat, a flawed man who achieved greatness by merely expecting better from those around him and treating all he met as equals, a wonderful portrait of a man.",
      "total_reactions": 0,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "The best aspect of this film is that you see Lincoln the person and not Lincoln the hero. The acting was so superb that you forget you're watching actors. Also, had a great blend of political humor. Amazing film! The only reason I didn't give this movie a ten, was for the fact that it was a bit dialogue heavy, which made it hard to follow sometimes.",
      "total_reactions": 0,
      "user": "jlplatten"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "This movie succeeds where all films should but often don't: it wholly sucks you in to it's world and story with such finesse that you think you are actually there. The film achieves this in several key areas, firstly, the acting is truly fantastic from everyone involved, not enough credit goes to all the more minor roles in the film who truly transport us into their world. Second, it is beautifully shot and very well choreographed, especially considering it is a film in which people talk in rooms for over 2 hours, this is impressive. Third, the script is great, it is gripping, sometimes funny and it really sets the mood of the film as one not to be missed. All in all though, if what you want in a film is action, this film is not for you, if you're looking for drama, intrigue and suspense to entertain, this film is for you. An expertly crafted film from Spielberg that really puts you in the world of the characters, especially impressive considering the world of the film is history. If you like slow moving character films, great. If not, do yourself a favour and look elsewhere. Fantastic, 90/100.",
      "total_reactions": 0,
      "user": "Happymonk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Lincoln is one of Spielberg's better efforts in the last couple of years, a film designed to 'win' lots of Oscars.  Despite its slower pace, the film is buoyed completely by Daniel Day Lewis' mesmerizing performance as 'Honest Abe', one of the greatest US President of all time.  Ensemble casts are also excellent, with stand outs performance by Tommy Lee Jones and Sally Field.  A great portrait of this historical figure and while it is not the best film of the year, it is one of those films that both Critics and Audiences like.",
      "total_reactions": 0,
      "user": "dharma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "This film has the best Lincoln as perfectly portrayed by Daniel Day-Lewis. While the performances are trophy-worthy along with production design, the screenplay enjoys the benefit of the doubt. Nevertheless, this one deserves to join the roll of best history movies. Worth-watching.",
      "total_reactions": 0,
      "user": "aozeta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "Lincoln, from the title you would assume is a film about Lincoln, however you may be disappointed to find that its more to do with the passing of the 13th Amendment. This is a problem purely due to the fact that everyone knows what came to pass in history or even take a guess as to what happened making long scenes of politicians talking about the amendment and discussing racial issues and war with seemingly no progression all the more tiresome. However there is some saving grace in its monotonous dialogue which is the acting. The actors and actresses really bring out the roles they play most notably Daniel Day-Lewis but also Tommy Lee Jones and Sally Field. Their interactions and dialogue are easily the most interesting part in the story which leads back to Lincoln's main problem. There's a lack of balance between the parts about the 13th amendment and the life of Lincoln and his family which were very dramatic. Its a long film so both parts are attempted in depth making the story convoluted and sometimes difficult to follow. Though at least the visual style and lighting of scenes add at least some flavor to the scenes. It has a very gritty style suiting the era while also seeming fresh.",
      "total_reactions": 0,
      "user": "Calzo777"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "This was a very good movie. Daniel Day-Lewis does an incredible job as he portrays Abraham Lincoln and the rest of the impressive cast does just as well. Truthfully, this was a character and acting driven movie and it had to have been in order to work. The only real negatives to the film, in my opinion, were the length and the slightly misleading name. Regarding the length of the movie, don't get me wrong, I LOVE long films IF they're done well (Lord of the Rings, Braveheart, etc.). While this movie was done well, it easily could've been 15-20 minutes shorter without missing anything critical (which cannot necessarily be said by LOTR or Braveheart). The other thing I mentioned was the misleading name. Obviously Lincoln is still the protagonist but a more accurate title to the movie would've been \"The 13th Amendment\" because that's the entire focus of the film. Personally, I expected this film to be more like a condensed version of the John Adams mini-series and the title and previews are the reason why. Nonetheless, this was a good movie with fantastic acting and cinematography and I think most people would really enjoy it.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "This is one of Steven Spielberg's best films this year, and in my opinion the best so far this year. The movie does a great job capturing Lincoln's personality during a turbulent time in America's history. Furthermore, the acting by Daniel Day Lewis to Tommy Lee Jones was excellent. Daniel Day Lewis is a great actor, and he deserves another best actor nomination for his performance. I believe Tommy Lee Jones has given one of his best performances in a long time, and I hope he gets nominated for best supporting actor as he gave a great performance to the radical Republican Thaddeus Stevens. Finally the writing is incredible along with some excellent dry humor. I highly recommend everyone check this movie out.",
      "total_reactions": 0,
      "user": "panderson1988"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "Last year USA-born Meryl Streep won her third Oscar for the portrayal of Margaret Thatcher in THE IRON LADY (2011, 7/10), this year the academy will (seemingly) reciprocate a third Oscar to Brit Daniel Day-Lewis in his rendition of Abraham Lincoln. It",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "Lincoln presents the characters' conflicts without taking sides, but still manages to pull off a perfect historical film that, with the absolutely flawless performance of Daniel Day-Lewis, is sure to be an Oscar contender and remain one of the best films of 2012.",
      "total_reactions": 0,
      "user": "Critic2012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "A grand sweeping historical epic that illuminates the passing of the 13 th amendment. The story is, of course, political but like Lincoln, Stephen Spielberg tells stories of deep human significance laced with humor.  I wondered if the smallish Daniel Day Lewis could fully inhabit the great man the way that Raymond Massey did. He mostly succeeded but perhaps more importantly Day-Lewis gives Lincoln the soul that Massey attempted. This is due in significant part to the words-the great script- by Tony Kushner who brings the book by Doris Kearns Goodwin upon which the movie is based-to full life-and empathetic and plausible psychological insight into Mary Todd Lincoln (Sally Field) and her troubled marriage to the President. Hal Holbrook,  James Spader, David Strathairn and Tommy Lee Jones are excellent in support-as are the many, many unknown character actors in this film. Finally, as in all (?) Spielberg films the score is by John Williams and is excellent. The only reason I did not give this movie a 10 was the  calculated attempt at a tear-jerking ending needlessly followed by an extraneous 2 minute speech. A mere quibble.",
      "total_reactions": 0,
      "user": "jimboesq"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "Steven Spielberg can't go wrong. I've got to say I'm Latina, I already knew Lincolns story but this film is so meaningful and powerful that it made me realize the point of the whole historic event. Daniel Day-Lewis was Brilliant and Tommy Lee Jones was splendid. This movie is one of the Best movies i've seen in a while. Bravo Steven!",
      "total_reactions": 0,
      "user": "GabrielaRodB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "Through the direction of Steven Spielberg, Daniel Day-Lewis brings us on an incredible journey through the mind and intimacy of Abraham Lincoln. Lincoln is a focus on the person as well as the accomplishments.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Don't let the above plot put you off. Yes, its politics but it's so much more. It's a character study of the highest order. We get to see Lincoln's political machinations, frustrations with public office, as well as his personal strife behind the White House's doors. The narrative never feels dull or anything other than monumentous. I haven't seen any of the films featuring other nominees for Academy Best Actor but I just cannot imagine that any of the performances come close to Daniel Day-Lewis' as Lincoln. Just when you think the guy can't get any better (There Will Be Blood), he steps up to another level. His performance as Lincoln is simply wonderful. Patient, stoic, inspirational, determined, regretful, melancholy, Day-Lewis manages to capture everything.",
      "total_reactions": 0,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "This movie is deserved everything not just Best Actor. Spielberg beautifully directs and make deep research about Lincoln. Yeah this is still movie, not documentary, so you'll find some dramatize scenes. But it's okay.",
      "total_reactions": 0,
      "user": "dblaze889"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "It's a serious film, all right, and professional in every way--it's also a bit plodding and didactic.  Daniel Day Lewis again gives the kind of performance that wins awards, but as always he seems to be standing alongside the character--thinking about him, solving acting problems, but never jumping inside his skin.",
      "total_reactions": 0,
      "user": "amboy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "Not for the impatient; Lincoln triumphs as one of the finest movies in Steven Spielberg",
      "total_reactions": 0,
      "user": "lahaine2012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "I get so excited when a movie actually lives up to my expectations, and Lincoln does. I have been trying to temper them ever since I found out our greatest actor would be playing our most popular president in a movie written and directed by one of the greatest film makers ever. Thankfully this film lives up to every bit of the hype. First off this movie is absolutely gorgeous. The feel of the era comes through in every single frame. Spielberg captures the image we have of Lincoln as a man perfectly. There are so many shots that we get of Lincoln's profile or where he is walking out of a room and his presence is captured perfectly. This is also a perfectly written script. Again the language is written perfectly for the era and events that we are witnessing. Last but certainly not least the acting is superb across the board. Lewis is every bit of Lincoln that we expect him to be, he captures the image we have of Lincoln in every single scene. Maybe most amazing is that all the other actors never seem dwarfed by Lewis's presence. Whether this is from great casting, acting, or writing doesn't matter, all that matters is that it all works seamlessly. The only reason this movie doesn't get a perfect 10 from me is that there are a few scenes with the \"Spielberg cheese\". Thankfully they are very minimal, but they will take you out of the film for a moment or two. Otherwise this is a perfect movie, probably my favorite of the last two years.",
      "total_reactions": 0,
      "user": "seancriswell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "A fantastic movie. I cannot say enough good things. The acting was amazing, especially Daniel Day Lewis and Tommy Lee Jones. However, the entire cast is great. The soundtrack is fantastic and the cinematography is great too. This is one of the few movies I have seen that left me in tears. If you dont see this movie, you should never watch another movie again.",
      "total_reactions": 0,
      "user": "Welterweight426"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "Daniel Day-Lewis outperforms himself again this time as Lincoln. The film focuses heavily on Amendment 13 which gets rid of slavery but serves mainly as a device to end the war. There's endless political blabbering (well written mind you) concerning the passing of this amendment and the behind-the-scenes mechanics of it. You'll get some insight into Lincoln's personal life but unexpectedly he's portrayed as a man who kicks ass for goodness, a veritable saint. As much as I enjoyed this well made film I couldn't help but think that this was a product of the Americans obsession with their own culture and history, and for me as a European it just doesn't seem all that important. We know all how it turned out in the end, didn't we",
      "total_reactions": 0,
      "user": "Apemonkey666"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "It was an enjoyable historic drama.  I think the movie should have been called the \"13th Amendment\" considering that is really the only aspect of this movie.",
      "total_reactions": 0,
      "user": "jball359"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "Lincoln is exactly just the right amount of how I was expecting this film to be. I can't argue with people who keep on claiming what was really done at that time and what was not. The work of Tony Kushner and Steven Spielberg may base on the real events but it also incorporates a little bit of fiction because it is necessary to keep the film in the right direction. Screenplay is superb and so is the direction. The major plus points of this film are its brilliant photography, production design and breathtaking performances by a stellar cast especially Daniel Day-Lewis. That is one hell of an exceptional portrayal of one of the most important historical figures in the history of the United States of America, Abraham Lincoln. Day-Lewis totally stunned me with his performance and I really do want him to win all the major awards this season. Here's why people won't like this film. There is no action in this film whatsoever, and all of the scenes are based on the dialogues. In addition, the run-time of the film is 2 hours and 20 minutes which seems way more than it should be, in the case of a drama film (NOT if you love watching slow paced, dialogues oriented drama films).",
      "total_reactions": 0,
      "user": "theahsanhaseeb"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Such a historical time in US history is a hard story to tell on its own, much less the man in charge of the whole mess. I think Speilberg does a great job in creating the mood, distractions, oppositions, co-conspirators and even Lincoln's characters/values become a definition of the film. So many underrated actors play the politicians to perfection-Halbrook (playing Preston), Levitt playing Lincoln's son, Stuhlbarg as Yeaman...so many more. But Day-Lewis is the film as Lincoln, and (of all people) Sally Field as Ms. Lincoln.. Of course, 90% of the film is dialog-mostly related to the politics of the time/amendment-sometimes hard to follow. Only reason I didn't give this a \"10\" as it seems to be a bit too \"heroic\"  when this time was not \"heroic\" but rather tragic-which is conveyed thru the colors and tone of the film very well.",
      "total_reactions": 0,
      "user": "geedup"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "Being a US History major, I loved Lincoln. Anytime I get to see a movie about US History, I get really excited. And Lincoln did not let me down. While some (or many) would call this movie slow and boring, it was quite the opposite. I was thoroughly entertained by Daniel Day-Lewis (as always) and Spielberg delivered once again. The scenes in Congress were great because it seemed to mock today's government/congress and made political parties look absolutely ridiculous. Go watch this film if you have the time and want to watch a great acting performance by Day-Lewis.",
      "total_reactions": 0,
      "user": "jedijared182"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "The strength of this film lies in the golden script, and wonderful cast. Daniel Day Lewis brings a certain livelihood, and genuine charm to Lincoln that makes you disappointed in current politics. It brings the same love for a classic hero of American folklore, but at the intimate level, where you love the man, not just his words. I give the writers absolute credit for focusing on the messy way slavery was eliminated. Not in an epic battle of good and evil, but through messy politicking. Also, there is nothing quite like hearing congressmen dishing out insults in 1860's American speech. There is a certain distance in the film which prevents it from being this year's best, but nonetheless this is a rare, charming, gem that should not be passed up.",
      "total_reactions": 0,
      "user": "nickgreene11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "I find this a very hard movie to judge. It's lacking in any real drama or suspense, has a mostly plodding script and there is no real visual excitement  either from set design, set pieces or even camera work. Spielbergs work of lot (anything after Saving Private Ryan) has had a mostly sterile feel for me  very well executed but nothing special  and Lincoln falls into that as a film overall. Yes, Day Lewis is strangely captivating as Lincoln but only in some scenes where he gets to cut loss. The film seems to hold the Lincoln character on too high a pedestal. We only get glimpses into what may be a slightly more selfish side to him. When it comes to the messy side of politics, the film keeps Lincoln at very much an arms length approach. This may or may not be true, I'm no history buff but I would have thought it unlikely that any high ranking politician would be able to keep such a distance. The other characters really only work as plot points. There's no bad acting but its all so dull and, well, predictable (I know  odd for a true story). Granted, the film cant change what happened but the South are predictable drawn as out and out bad guys. General Ulysses is, like Lincoln, far too upstanding. There's no surprises anywhere and the film wont question any views you may have going in. Not that it has to but when the main flow of the film is, essentially, very dull lobbying it would be nice to have something else to keep the attention.",
      "total_reactions": 0,
      "user": "reddave2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "Damn, what a cast. I love films like this that have these huge casts and I keep seeing all these character actors who I recognize from other films or television shows. Daniel Day-Lewis was great (though I prefer him in Gangs of New York and There Will Be Blood, personally). Tommy Lee Jones, David Strathairn, and David Costabile, are also major bright spots. As a whole, this is an at times very interesting film about Lincoln himself, as well as everything he went through trying to get the 13th amendment passed. The performances, direction, and costume design, are all major pluses to this historical film. However, it felt a little long. Some of it could have been trimmed and the final product would have benefited from it. On top of that, Mary Todd Lincoln was almost exclusively portrayed as a total b****, while Robert Lincoln was almost exclusively shown as a wannabe soldier. Thus, I almost think Jospeh Gordon-Levitt's portion could be trimmed significantly, though his performance was fine. I also wish they either showed more elements of Mary Lincoln or trimmed her down and focused exclusively on Lincoln, his Cabinet, and the House. The ending is also poor, as it does not even show anything. While I am not a huge fan of gore, at least hearing a gunshot would have been an added plus. The way they did it felt as if they were purposely keeping us at a distance, which is annoying. The film can also be a little tedious at times and fails to hold your interest throughout the entire run time (largely thanks to the parts that add nothing much to the film as a whole). However, as a whole, the film is very well made and very well done from all parties and stands as a great look at history and is poignant even today, as though the issues are different, the divide between parties and the way votes work is all too similar.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Before you see this you have to know this isn't about Lincoln as much as it is about passing the 13th amendment. While it does drag (it's 2.5 hours) it's never boring and it's filled with plenty chuckles to carry it along. Day-Lewis IS Lincoln and is sure to win the Oscar. Much like Ledger and the Joker, I could not imagine anyone else in the role.",
      "total_reactions": 0,
      "user": "tropicAces"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "Having Steven Spielberg, the mastermind behind many of the films with the highest budget and the biggest scale in the last 40 years, direct an entirely dialogue-centred portrayal of Abraham Lincoln doesn’t seem like your first choice. However, it proved to be an excellent one, as Spielberg’s vogue attracted some of the most talented people currently in the business to his project, both in the acting and general filmmaking cast, and thereby obtained twelve much deserved Academy Award nominations. Lincoln is an excellent biographical film, informative due to the information it brings up about the real-life figures working as supporting characters in the film and entertaining with an immensely talented acting ensemble and an enthralling way of storytelling, even though we’re all familiar to the story.",
      "total_reactions": 0,
      "user": "axelkoch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "Lincoln was one of those movies that is very well done, it appears to capture the period with historical accuracy, the acting is very good, the story historically and socially significant.  But it was rather slow moving and not particularly compelling given the compelling subject matter, and I like both politics and history.",
      "total_reactions": 0,
      "user": "glemon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Very good movie! I watched the weekend after THanksgiving, and what a treat! It really captures some of Spielberg's best work in quite a while. The actors were all on point and I am happy that the movie did not focus on those moments in Lincoln's presidency that we all study in some length at school, i.e., the civil war, his election campaign, and the moment of his death, but rather, focused more on the pivotal act of his presidency, the process by which the Eman. Proc. came about, and the real person Lincoln was with his wit, compassion, and humility. This is a movie I will most definitely buy the first day it is out on Blu.",
      "total_reactions": 0,
      "user": "coreyg007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "\"Lincoln\" is a triumph. Here is a historical film that is heavy in dialogue, but never strays into idleness or melodrama. Intelligent and powerful filmmaking.",
      "total_reactions": 0,
      "user": "MouthofSauron"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "This movie is worth seeing for the acting alone. Daniel Day Lewis becomes Lincoln. Sally Field shows Mary Todd's humane rather than crazy side. Realizing all the historical facts the film's creators had to sort through and choose between, makes the movie even more amazing. Some might find it a tad slow, but it's worth every detail. The movie is a masterpiece. After seeing it is, one may become more aware of the spineless leadership our country has today.",
      "total_reactions": 0,
      "user": "poetreviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "With most biopics, the reason we are so interested in them is because they threaten to take their star down from his powerful placement in history, and show him as human rather than god. This year we get two hotly anticipated films which will attempt to do just that: **** and Lincoln. Both men have contributed so much in their respective fields that they are rarely seen in a bad light, nor are people ecstatic to see them portrayed as mere men. However, I can definitely say Lincoln attempts to show Abraham Lincoln as one of us, and not merely an icon placed upon an unreachable pedestal. With incredible acting on the part of everyone, but especially Sally Field and Daniel Day-Lewis, and writing by Tony Kushner that is both enticing and fitting for the period, Lincoln is a concrete example of how to make a biopic flourish while still being faithful and engrossing. Read the rest of the review at http://independentcinema.wordpress.com/2012/11/09/lincoln-scratches-his-beard-just-like-any-other-man/",
      "total_reactions": 0,
      "user": "Paganostaghetti"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "I mostly enjoyed this movie, however I did find some things which I disliked. For the first hour or something, you get a monotonous story, and a bit slow in pace. You get bombarded with tons of names of different people throughout history that is impossible to remember after some time, and I will admit I did feel bored multiple times through the first 1 and a half hours.",
      "total_reactions": 0,
      "user": "Djkotsios"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Era un film a rischio, ‘Lincoln’, così a rischio di scivolare nella retorica da farsi prendere con le molle malgrado il plauso generale. Sia la retorica statunitense in generale  la tendenza a stelle e strisce a lodarsi, e pure imbrodarsi,  conosciuta  sia quella di Spielberg in particolare, regista che ha tra i suoi non molti difetti proprio il calcare la mano in materia finendo a volte per perdere il controllo. Per evitare la trappola, il buon Steven e il suo sceneggiatore Tony Kushner scelgono di concentrare l’attenzione sugli ultimi mesi di vita del sedicesimo Presidente e sulla sua battaglia per il Tredicesimo Emendamento riguardante l’abolizione della schiavitù: l’antidoto  il racconto della politica politicante che può non essere bella da vedere, ma a volte  necessaria e, grazie a una regia che sfiora la perfezione, i suoi intrighi rendono appassionante una pellicola di oltre due ore e e mezza (con in più il regalo  almeno per me  che nell’immaginazione il ‘giovane mr. Lincoln’ continua a essere Henry Fonda). Con tali premesse, pare superflua la considerazione che ci troviamo davanti a un film di parola e non d’azione, a volte quasi teatrale nel suo svolgersi in gran parte in interni rifatti con cura e con una certa predilezione per le luci fioche (ma era proprio così buia la Casa Bianca?). La scrittura non accusa mai battute a vuoto, tanto che sono i dialoghi stessi a dare alla pellicola il suo ritmo, certo lento ma mai noioso. A Washington si incrociano politici che non vogliono perdere il seggio o aspirano a piccoli privilegi come il Clay Hawkins di Walton Goggins e trafficoni incaricati di ammorbidirli (il volutamente volgare Bilbo di James Spader), vecchi patriarchi che annusano il futuro (Hal Holbrook  Preston Blair) e uomini arroccati sulle loro posizioni capaci di giungere fino all’insulto personale, incarnati dal Fernando Wood di Lee Pace: fra tutti costoro, Lincoln procede sicuro (delle proprie idee) verso l’obbiettivo che si  prefissato, malgrado ci sia l’esigenza di cercare una pace con la Confederazione che vede l’emendamento come fumo negli occhi. Ad interpretarlo, uno splendido Daniel Day-Lewis che –oltre alla mimesi fisica   capace di rendere la decisione politica di un uomo ‘investito di un potere immenso’ e, allo stesso tempo, le sofferenze interiori di un padre che ha perso un figlio e vuole evitare la guerra all’altro (tanto da riuscire a imboscare al Quartier Generale lo scalpitante Robert  Joseph Gordon-Levitt  quando quest’ultimo veste infine la divisa). Ne esce un personaggio sfaccettato a cui la voce di Pierfrancesco Favino rende (o pare rendere, non avendo io sentito la versione originale) un buon servizio: altrettanto non si può dire del doppiaggio di Sally Field che, per il resto, riesce a essere credibile come moglio di Lincoln pur avendo dieci anni più di Day-Lewis. Un voto qui e uno là, il Presidente vince il braccio di ferro in una tesissima seduta alla Camera, giocata sui primi piani dei deputati e alternata alle immagini di Lincoln che aspetta la notizia giocando con il figlio più piccolo: la schiavitù  abolita  per la commozione di Thaddeus Stevens, un bravissimo Tommy Lee Jones, che vede realizzarsi il sogno di una vita e il cui ritorno a casa regala uno dei pochi sorrisi sereni del film  resta solo da fermare la guerra. Forse si poteva chiudere qui, in un momento di grande pathos, però la lenta cavalcata del Presidente sul campo di battaglia di Petersburg (che potrebbe essere Passchendaele, o Omaha Beach) consente a Spielberg di mettere ancora una volta per immagini l’orrore della guerra. Dopo il colpo di pistola di Booth (fuori scena), la retorica ritorna con le immagini del secondo discorso d’insediamento sul prato della Casa Bianca, ma la dose  quella giusta e la scena si rivela essere l’ultimo colpo d’ala grazie alle parole di Lincoln, ma anche per i volti di una folla in cui ogni singolo ha la sua personalità (peccato solo per quella anacronistica bandiera a cinquanta stelle…).",
      "total_reactions": 0,
      "user": "catcarlo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "This is defiantly an interesting movie. I enjoyed it very much because I am the type of person who can sit there and enjoy learning about something I only knew a little bit about. This is defiantly not the type of movie for people who will want to be at the edge of their seat the whole time. If you enjoy learning about history and see what it was like for these people, this is defiantly a great movie to go see, but if you want a movie that has people running around constantly and shooting each other, you will probably want to pass.",
      "total_reactions": 0,
      "user": "xFezziwig"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2013
      },
      "score": 4,
      "text": "Lincoln is basically a two and a half hour play and although Daniel Day Lewis was amazing as Lincoln it is difficult to watch at one sitting cause it gets boring. I believe that this is the reason that it wasn't the best picture of 2012. The movie basically about the passing of the 13 amendment.",
      "total_reactions": 0,
      "user": "DarthSidious63"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "Certamente foi um filme bem interessante, graças a genialidade de Steven Spielberg e a atuação hipnótica de Daniel Day-Lewis e de todo seu elenco que foi magnífico.",
      "total_reactions": 0,
      "user": "Iky009"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "I was very disappointed. Daniel Day-Lewis was his usual amazing self. And the acting as a whole was top notch. But other than that, I found Lincoln to be severely lacking. There was no portrayal of Abraham Lincoln the man. There was no examination of his heavily documented depression, his unstable marriage, his tumultuous family life, his suicidal thoughts, his emotions, his demons, his joys, his passions, his personality, his psyche or his existence as a human being. There was no portrait of life in America during the civil war. No representation of the state, it's people or the condition that it was in during this historic period. In fact, the war only appeared in the form of quick mentions here and there. It was, essentially, a play-by-play analysis for the political struggle to pass the 13th amendment. A play-by-play analysis which was rather hard to follow and frankly, quite boring at times. Overall, I was upset that this movie did not have more depth, did not have more wonder and did not have more life. It's worth a watch, but thoroughly unfulfilling.",
      "total_reactions": 0,
      "user": "YoursTruly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "I'm writing an example review for a school project. Sorry if you read this before I delete it. Well then again I hope metacritic allows me to delete this. Ok bye.",
      "total_reactions": 0,
      "user": "metacriticUserN"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "I thought that this movie was alright. I watched this movie with multiple history teachers, and they all agreed that there were very few inaccuracies. The assassination wasn't shown, and there was little portrayed outside of the senators bickering over the amendment. I thought that the best work was in Mrs. Lincoln, and her slight insanity.",
      "total_reactions": 0,
      "user": "Leprechaun_exe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Looking at Spielberg's history in cinema, it is relevant that making classics is simply in his blood. Whether his movies were about raw tension, the pureness of the heart or about the examination of the human spirit, none of them blend so perfectly together as Lincoln does. Not only does Lincoln inform the audience about what an immense challenge it was for the 16th president to abolish slavery, (which could easily be unappreciated just by reading it in a textbook), but it makes you feel as if you were one of the many Americans who idolized him during the 19th century. What Spielberg, Kushner and Day-Lewis do to make Abraham appear as a real inspirational figure is not by simply filming the events that gained him his historical recognition, but by letting the audience adore his charming personality first. The scenes where the Republicans and Democrats bicker over the future of the entire African-American population of the time are so intriguing that I felt relieved when arguments were won and angry when injustice was performed. We have Spielberg and Kushner to really thank for allowing us to become so emotionally involved. I would also like to congratulate Daniel Day-Lewis on winning his third Oscar. Lets face it, he was extraordinary and held the whole film together. It was so exciting just to watch everything he did on screen that he was the main reason I didn't want the movie to end. Credits to Field, Jones and Gordon-Levitt for making the experience all the more captivating. This is perhaps the most inspirational movie of the year which adds to Spielberg's list of never-ending triumphs as well as celebrating one of the most notable historical figures in American history.",
      "total_reactions": 0,
      "user": "CriticViewpoint"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "I expected more action than talk, but the dialogue was educating and fleshed out the characters. There were some light moments too, which made the viewing a bit easier. The film dealt more with the politics of the Civil War than the war itself. The acting, of course, couldn't have been better. A few actors from TV were cast. Lewis resembled my image of Lincoln hauntingly well. The movie became something special whenever he was on screen. I eagerly anticipated the ending but found it underwhelming. I think if they had included the viewpoint of the assassin, an established actor lacking for nothing who thought he had to do this as an instrument of God, and the accomplices whose culpability was questionable in one case, we would have had a bit of controversy and more material to chew on. But that's just me.",
      "total_reactions": 0,
      "user": "Swati"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "This movie was remarkable...Daniel Day Lewis never disappoints, especially this time out...I thought it was actually Abraham Lincoln I was watching in this movie, and not Daniel Day Lewis playing him--It was that good...The cast was remarkable as well...For those of you who have not seen this film, it covers the battle covering the 13th Amendment, which would abolish slavery, the final months of the Civil War and finishing up with Lincoln's death...Well told story, and would not be surprised to see Daniel Day Lewis, Steven Spielberg and this film to bring in not only a decent number of awards, but possibly winning Best Picture honors for this year.  Definitely a must see for not only military and Lincoln historians, but for those who are big Civil War buffs.",
      "total_reactions": 0,
      "user": "TheMilitia71"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "History has told us Lincoln is responsible for abolishing slavery, but it's the exasperating hardships and personal sacrifices that forever altered the landscape and direction of this country. Making the amendment battle the cornerstone of the story reveals Lincoln as a simple man, yet equally complex. As the civil war rages on, Lincoln struggles with the carnage on the battlefield, as well as the conflict within his own cabinet pertaining to the Thirteenth Amendment. Spielberg wisely focuses the last three months of Lincoln's life, and his own crisis of conscience between ending the war or slavery. If you're not entirely sure why Lincoln is universally regarded as one of the greatest U.S. presidents going into this movie, you'll have no doubts by the time it's over.",
      "total_reactions": 0,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "Lincoln is a really good film! Not a brilliant film, but it's extremely well done. Daniel Day-Lewis is terrific, he truly disappears into the role/character and gives a fantastic (Oscar worthy) performance. The screenplay by Tony Kushner is outstanding. Heavy on the politics, but moving and humorous at all the right moments; it will definitely be nominated for an Oscar. The film is rounded off by a perfect supporting cast, dotted with many well-known/renowned actors, and none of them disappoint. Tommy Lee Jones and Sally Field stand out. Overall, Lincoln is a great biopic about a great American figure. The film captures the conflict of the era, as well as the humanity of good ole' Abe. I think I like Spielberg's War Horse a little better, but this is a really good film, worthy of a lot of praise.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "Lincoln is a film of two halves. The first hour and a half is what the term 'worthy, but dull' was coined for. Tony Kushner's acclaimed screenplay seems to be all over the place and, not being an expert on the history, I was confused. However, something rather magical happens when the excellent Tommy Lee Jones takes to the floor of congress to vent his wrath with rivals over the passing of an amendment to abolish slavery. The film comes alive and subsequent proceedings are elevated to a much higher plane. This ensures that the final hour not only engages the brain, but becomes compelling drama. Director Steven Spielberg has dealt with the slavery issue before in both 'The Color Purple' and the extremely tedious 'Amistad' so he obviously has some fascination for the subject. One could, therefore, be forgiven for thinking that he would bring something new to the material. Unfortunately, he doesn't! As with 'Amistad' his direction is staid and unexciting for the most part despite some occasional arty looking set ups. Daniel Day Lewis, on the other hand, inhabits the character of Lincoln to perfection. Not once do you feel it is an actor portraying a character. This Chameleon like actor has pulled off another coup in a performance to rank alongside the very best in his already dazzling portfolio. The film's period detail is beautifully captured and photographed like a series of paintings and Spielberg has, at least, eschewed sentimentality. To this end, though, he is not aided by John Williams' pretty but predictable score, one which I seem to have heard many times before.",
      "total_reactions": 0,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "Day-Lewis is masterfully sublime as the humble, eminent Abraham Lincoln. However, Spielberg's direction is imperfectly showcased as a hokey, lackluster drama that is mind-fumbling and tedious but never an insipid moment with the two Oscar-caliber performances of Day-Lewis and Field.",
      "total_reactions": 0,
      "user": "HenryZambrano"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "This is a great movie for a second grader or an adult with second grade knowledge of american history.  It is a sterile, impotent picture.  The acting is great in parts but mostly mediocre.  Sitting in the theater you feel boredom as never before.  The first 5 minutes are the best of the entire film.  Never have I prayed for Lincoln to go to the Ford Theater until sitting through this epic POS (piece of ****",
      "total_reactions": 0,
      "user": "kurasanwich"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "A well made movie no doubt but not the best movie of the year. Daniel-Day Lewis is one of my favorite actors and his portrays Lincoln well. It was a good summary and can not live up to more then an historical documentary and does not rise to greatness.",
      "total_reactions": 0,
      "user": "Summersausage"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "I was anxious to see Spielberg's new masterpiece, especially since I heard it was the most nominated film this year (for the Oscars) and was particularly waiting to see what Lewis pulls out of the hat this time, being used to his powerful interpretations. I wouldn't say I wasted 2 and a half hours with it, but definitely wanted more from Lincoln who looked and acted as if he was on his dying bed from the beginning. A man of such character and  power deserved more. This Lincoln showed remorse more than pride, lacked the passion shared by most around him, almost looking like he was from a completely different picture. Tommy Lee Jones steals the thunder once more, raising the bar with every minute spent on screen. Only 7 of 10 for most likely 'the best motion picture' of the year.",
      "total_reactions": 0,
      "user": "My2centsthought"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "slow at most times, but the acting is fantastic and story is thought-provoking. Steven Spielberg really knows what he's doing, and this movie helps to prove it",
      "total_reactions": 0,
      "user": "MooseReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "If you want to know and learn how Abraham Lincoln abolished slavery once and for all, see this movie immediately. I seriously do not know why this movie is getting such bad reviews. The only reason I am giving this a nine instead of a ten is because it mainly focused on Lincoln talking back and forth with delegates and such. There was really no \"action\" involved in the movie. Daniel Day Lewis and Tommy Lee Jones both did an amazing job in the movie, as I figured they would. I saw one review on here that had a one, and it said \"this movie is a total bore\", the movie was not a bore. It was both suspenseful, and tense. There were some parts of the movie where I just didn't think things were going to work out. If you want to see a real movie about Lincoln, see this one. I highly recommend it.",
      "total_reactions": 0,
      "user": "FrostyReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "Although the film is a little slow at times, the acting is superb.  The beginning scene is one of the best as well as the telegraphers speaking to Lincoln. Anyone who calls this movie or acting mundane, i just don't get it.",
      "total_reactions": 0,
      "user": "Skydog"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "Storyline: President Lincoln, played brilliantly by Daniel Day-Lewis struggles to gain enough votes to allow the 13th Amendment to pass. Even knowing the outcome still didn't stop me from holding my breath at the end .",
      "total_reactions": 0,
      "user": "NavQ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "Lincoln",
      "total_reactions": 0,
      "user": "Mabel8103"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2014
      },
      "score": 8,
      "text": "A very solid movie all the way through.  It's well acted by an ensemble cast, involving, and directed with assurance.  I've heard people say that it drags, but in actuality it moves by very quickly for such a long movie.  In other words, it's very well paced in its storytelling.  Day Lewis makes a great Lincoln, and there's plenty of political intrigue.  Abe Lincoln might not have been as honest as his reputation has made him out to be, but he may have actually been a better person.",
      "total_reactions": 0,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "The best historical movie I've ever seen. It makes you care about our most important president in ways you would never think you would. It's funny, it's interesting, and of course, Daniel-Day Lewis is perfect as Abraham Lincoln.",
      "total_reactions": 0,
      "user": "123GAGE"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "Biggest missed opportunity: the film's second scene opens with Lincoln sitting atop some boxes in a railway station amid some black soldiers. Instead of Lincoln asking them about theirselves, they demonstrates their reverence for the President by citing the Gettysburg Address. Two or three black soldiers do this. Lincoln learns nothing and we learn nothing. The film as a whole was watchable but just once. Or if there's nothing better on. Maybe I;ll find it more compelling after seeing it again. Right now I rate it a miss. Amistad was way better it every way: better story, more informative, more suspenseful, more uplifting,",
      "total_reactions": 0,
      "user": "ms3333"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Lincoln simply put is a brilliant film. For a film that is 2 hours and 30 mins of talking and politics it makes a thoroughly engaging and thoroughly interesting story. It is an important story in American history and captures the issue and era magnificently. Daniel Day-Lewis would fully deserve the Oscar for his performance, it was flawless. He is also matched by an equally fantastic cast. Highly recommended.",
      "total_reactions": 0,
      "user": "tomboskett"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "I'm not really into biographies or historical films, however Lincoln just fascinated me. The movie was set at the apex of his career and the film really never got boring. The acting was amazing, the narrative was well told, and it was an extremely memorable movie.",
      "total_reactions": 0,
      "user": "shprea"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "Spielberg delivers a so-so biopic focusing on one particular moment in Lincoln's life. One doesn't quite understand the purpose of choosing this particular moment if then you don't follow on the social and political implications. Everybody already knew the history - it would have been interesting to focus on some other aspects. Daniel Day-Lewis impeccable as usual, this time the fault lies with the screenwriters and the director.",
      "total_reactions": 0,
      "user": "nicholasbert"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "In my opinion the best movie of 2012. Absolutely flawless. Daniel Day Lewis gave the greatest performance I have ever seen. Tommy Lee Jones best role since No Country For Old Men. Those who are saying this movie is too slow clearly doesn't appreciate history. It's as if you're getting a glimpse of Lincoln himself. Perhaps the closest we will ever be to the real man.",
      "total_reactions": 0,
      "user": "WayneThomas412"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "I pity those who find this film mundane or tedious because they were some how expecting a Michael Bay action turd.  Lincoln is a well written, expertly directed, and supremely acted masterpiece.  This film is about the 13th amendment and the politics/ horse trading that was required to enact one of the greatest pieces of legislation in the history of the world.  If this dramatic political drama can not hold ones attention I believe that shows what a sad state our generation is in.  This film is a fight for equality, a fight to up hold the fact that indeed \"all men are created equal in the eyes of the law\".",
      "total_reactions": 0,
      "user": "Archleach"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "I think it's safe to say that if \"Argo\" hadn't come out this year, this biopic of the beloved president Abraham Lincoln would for sure have won best picture. It's an american masterpiece filled with a great and powerful story along with fantastic actors that bring the characters back to life. The way this movie was shot took my breath away. I don't think I've seen such beautiful cinematography since \"Saving Private Ryan\". The fill of the movie is vibrate and alive. No matter if was from the war scenes or the tremendous acting, it keeps you on your toes. I've surprisingly heard people say that this movie tends to overact. Well let me just say that it does, but in the best way possible. This is the second best movie of 2012! I know that when I say it like that it makes it sound like I'm saying that the movies not good, but \"Argo\" (in my opinion) was still my favorite. But no matter what, you'll completely love this movie. Overall, it's a true american classic.",
      "total_reactions": 0,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "People really need to consider Hollywood and the contrast with history. Films are meant to capture the greatest of something, and I don't believe most people could name one film completely accurate to something historical. Daniel Day-Lewis did a fantastic job as usual, and Spielberg is always a favorite. Of course the film lacked historical accuracy, but I highly enjoyed it and the cast was magnificent. It's very hard to keep up with Daniel Day-Lewis and most of the cast did very well at it.",
      "total_reactions": 0,
      "user": "Joshthomas2014"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "Lincoln is a grenade filled with emotions. But, hopelessly, its not a Speilberg movie, I'd rather call it a Daniel-day Lewis' movie. To Speilberg,  sir, it seems like the perfect time to let go this war-mania of you.",
      "total_reactions": 0,
      "user": "ArkaMukherjee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "It's confusing and a little tiring, but satisfying and therefore the performance of its cast saves the film from any negative review, apart from a policy, the film runs smoothly and its soundtrack brings an air of sweetness, which helps in the important parts of the movie and this establishes the film as one of Spielberg's best, even if he goes out of style movie director.",
      "total_reactions": 0,
      "user": "Scorpion"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "A great movie that makes American history come alive, with wit, humor, and pathos. Excellent acting overall and especially from Daniel Day-Lewis, Sally Field, and Tommy Lee Jones. I am usually not a big fan of John Williams but his music here was superb. I also admired the art and production design and especially the cinematography by Janusz Kaminski, who is an artist. I've read other reviews that complain about the movie's pacing etc. but I think the editing and Spielberg's direction are perfect  I was enthralled from beginning to end. My only quibble with the film is that it depicts Connecticut congressmen voting against the 13th Amendment, which is simply not true. But in today's dysfunctional, even pathological political climate, this movie brings to life the most troubled period in U.S. history and manages to miraculously restore our faith in the U.S. political process.",
      "total_reactions": 0,
      "user": "Pucifer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "I expected that Lincoln would win the Academy Award for best film because of the excellent actors  and talented director  but when I saw the film frankly Ansdmt because the film seems to have been addressed to the Americans just where it was supposed to clarify a lot of other things unidentified and unknown to the non-Americans in the film despite the wonderful acting by  Daniel Day-Lewis and enthusiasm to show a  big justice",
      "total_reactions": 0,
      "user": "RAEDALSDI"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "Lincoln is flat out the best picture of 2012/ Daniel day Lewis is spectacular in capturing the essence of Lincoln, as he fights for passage of the amendment that will abolish slavery. Sally field give her best performance since  Forest Gump as the  Volatile Mary Lincoln. Steven Spielberg does a remarkable job in captivating the viewer, as he  shows how hard it us the get something past a  divided congress, A lesson for today's government. I went to see this movie with high school students in attendance and the were captivated. The didn't make sound throughout the showing of the movie. Yes the movie slow at times, but so is democracy.",
      "total_reactions": 0,
      "user": "lismis7000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "和这位伟人一样，本片很沉闷，当然也是一部拍得很美的电影，刘易斯的演技如火纯青，菲尔德和琼斯的演技也很不错，John Williams继续发挥其大神水准。",
      "total_reactions": 0,
      "user": "TerenceYibo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Even though I am more of a Confederate guy... I gotta say that the film Lincoln is a great film with great acting and a great inside look at Lincolns time as president.",
      "total_reactions": 0,
      "user": "Thorshammer7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "I do admit, it was okay, but it just wasn't what I was expecting. It was disappointing, fairly. It didn't seem to fit in with the whole History thing. But that's just me. It was slow, and some parts I did not understand. It had boring moments that I also fell asleep to. But other than that, it was an okay film.",
      "total_reactions": 0,
      "user": "cag11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "A tedious, stale script and poor rising action makes this movie a slow moving chore to watch. James Spader does a good job fitting his role, but it is not enough to save this sinking ship.",
      "total_reactions": 0,
      "user": "WheresTheBeef"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "As usual, Daniel Day-Lewis shined as he played the character of U.S most prominent president of all time, Abraham Lincoln; and Steven Spielberg, with his passion for making a movie to commemorate his favorite Head of State and powerful, brilliant direction, successfully delivered a classic biography about president Lincoln's struggle with both unflinching dissent from Democratic Party and disagreement inside his own cabinet during his quest for liberation of black people from slavery for good, while still having to deal with the Civil War reaching its' final moments with escalating casualties for Union army",
      "total_reactions": 0,
      "user": "PvtJackson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "Great performances, especially Daniel Day Lewis and Tommy Lee Jones, and fascinating subject matter. Unfortunately, at two and a half hours, the film is simply hard to get through.",
      "total_reactions": 0,
      "user": "alpo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "This movie truly amazed me. I had mixed feelings about how it was going to be. However, after watching it, I felt it was a true masterpiece. Daniel Day-Lewis once again exceeds my expectations of acting. Stephen Spielberg did an outstanding job making this film. It is such an important part of our history, and shows the struggle that Lincoln would have went through trying to free the slaves. History buffs will love this movie as I did. Very highly recommended.",
      "total_reactions": 0,
      "user": "FordFanatic19"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "Steven Spielberg loves to tell a story and that is what makes his movies so engrossing even when the subject matter appears a bit daunting, however Lincoln's pacing is an issue that only the die hard fans could possibly ignore. In terms of entertainment one must have a love of history, a love acting and love of politics if you do not have these then this film will score low on your entertainment measure. From a cinematic stand point it is something one could study and learn a lot from.",
      "total_reactions": 0,
      "user": "poewilson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "Tarihsel gerçekliğe lafım yok o dönemi iyi yansıtıyor oyuncu, yönetmen hatta müzikler çok iyi fakat bir filmi izlerken bu kadar sıkıldığımı az hatırlıyorum.",
      "total_reactions": 0,
      "user": "MrBlackTron"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "In a film like this the last thing you would want is for the film makers to be historically illiterate. Usually it takes a sharp eye to catch that but this film takes no time and right at the very start destroys your confidence in the film's accuracy by calling the north free. That put me on the edge and I couldn't just relax and enjoy the rest of the film.",
      "total_reactions": 0,
      "user": "AliceofX"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "'Lincoln' is Steven Spielberg's best historical movie since 'Schindler's List' (1993) and 'Saving Private Ryan' (1998). What he has made here is a great, important and poignant drama with Daniel Day-Lewis in one of his best performances to date, he gives us an in-depth look at a man who had to make difficult decisions to change America.",
      "total_reactions": 0,
      "user": "MrMovieBuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "I hate to think that Lincoln is going to belong in the good but not quite great basket,  but that's the best way of classifying it. Daniel-Day Lewis is excellent and Tommy Lee Jones exceeds expectations, as well. Overall, the good is really good and the bad really isn't all that bad. That said, I was fairly conscious of how long it was leaving me wishing for a little tighter editing. This develops from a few stalling points, but Lincoln never feels too long. I remember noticing how well it was shot as it looked and felt like 1865 at times. Lincoln is a nice experience due to its attention to detail and individual performances. This isn't a movie I anticipate watching over and over but there isn't much not to like. Lincoln won't change your life but it needs to be seen. Interesting and compelling.",
      "total_reactions": 0,
      "user": "Will_Earwood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2015
      },
      "score": 7,
      "text": "Lincoln is best viewed with modest expectations. The performance of Daniel Day Lewis lives up to the hype. It is a great performance in a great career. Unfortunately, the other elements of the film do not rise to that standard and it shows. I'd compare Lincoln to Raging Bull. In that film we have also have a great performance by the lead but also great supporting cast, script, directing and it makes for great film. If DDL had those elements around him I could see a classic film being made, but instead it is a good movie, a high three.",
      "total_reactions": 0,
      "user": "RobertBrogan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "This is a wonderful film, full of detail and behavior, and one that lifts broadened historical details into a poetic marriage of humanity and triumph.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2016
      },
      "score": 3,
      "text": "\"Como conseguir el oscar facilmente sin hacer mucho esfuerzo por Steven Spielberg\"",
      "total_reactions": 0,
      "user": "AngusBarbudez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2017
      },
      "score": 9,
      "text": "This does not relate the myth of young Abe Lincoln.  There are no stories of long walks thru the snow to get to the courthouse, or him splitting wood for a living, or whatever the heck.  No this jumps right into the politics of the Lincoln presidency, and focuses especially on the issue of the repeal of slavery, which was apparently a difficult political struggle despite the fact that the Civil War was raging all around.  This shows us Lincoln the master politician and negotiator. Lewis is brilliant as usual and some of the other actors are fine too, like Strathairn as Seward.  The look is gloomy, sombre, and astonishingly believable.  I felt like this is the closest to sitting down at a table with Abraham Lincoln as anyone could ever experience.  No doubt some fidgety viewers will have a hard time taking in the whole thing.",
      "total_reactions": 0,
      "user": "Trailesque"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2017
      },
      "score": 5,
      "text": "The Performance given by Daniel Day is obviously brillant, but it is not enough to save this rear miss by Spielberg, this movie is just mediocre, it should of been called \"the 13th Amendment\" because that is really what this is about, not Lincoln",
      "total_reactions": 0,
      "user": "Thigpen84"
    }
  ]
}