{
  "avg_user_score": 6.3,
  "metascore": 30,
  "mixed_rating_frequency": 8,
  "movie_name": "Little Boy",
  "negative_rating_frequency": 15,
  "positive_rating_frequency": 33,
  "pro_critic_reviews": [
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2015
      },
      "score": 75,
      "summary": "There is a lot to admire here. Writer-director Alejandro Monteverde (Bella) is not afraid to take his time letting you get to know the characters or moving things along, but the movie never seems ponderous."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 67,
      "summary": "In the end, this is a pleasant parable, brimming with Rockwellian visuals and homespun decency. Harder hearts will dismiss it as corny and manipulative, which it is. Sometimes there's nothing wrong with that."
    },
    {
      "critic": "Bill Zwecker",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 63,
      "summary": "While the lead actors deliver lovely performances, it’s a shame they have to work with material so ham-handed and overbearing."
    },
    {
      "critic": "Walter Addiego",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 50,
      "summary": "The film has a good cast, and is competently made in a plain-vanilla way, but its greatest appeal will be to those who share its endorsement of traditional religious values."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2015
      },
      "score": 50,
      "summary": "Little Boy is loaded with weighty subjects and teachable moments, all doled out between generous helpings of tragedy and sentiment. It’s ambitious, but a cluttered weeper whose lessons might have stuck, had there been fewer of them."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2015
      },
      "score": 50,
      "summary": "It conveys life experience to such a sentimentalized degree that the world comes to resemble only the sham of a Norman Rockwell painting."
    },
    {
      "critic": "Stephen Farber",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2015
      },
      "score": 50,
      "summary": "What makes it intermittently palatable even to non-believers is that it acknowledges some of the darker truths of the era."
    },
    {
      "critic": "Steve Davis",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2015
      },
      "score": 40,
      "summary": "For all its unsubtle sentimentality (including a you-can-see-it-from-a-mile-away plot twist), it remains unclear whether Little Boy intends to celebrate the conviction of belief or to mock it. It’s an unfortunate confusion that permanently stunts its growth."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2015
      },
      "score": 40,
      "summary": "Functioning as more parable than sermon, it offers at least a hint of a blueprint for other faith filmmakers who want their message to reach beyond the front pew."
    },
    {
      "critic": "Inkoo Kang",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2015
      },
      "score": 40,
      "summary": "Most impressively, the film admits that the line between faith and magical thinking isn’t as solid as most believers would care to admit — and the Church knows it. Unfortunately, these worthwhile ideas are contained in a phony-baloney tale more artificial than a polyester teddy bear stuffed with Splenda and Cheez Whiz — and just as appealing."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 40,
      "summary": "Checking subtlety at the door, Monteverde goes for broke on the emotional-manipulation front. Perhaps that's OK as a device for illustrating a parable, but it doesn't make for much of a movie."
    },
    {
      "critic": "Christy Lemire",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2015
      },
      "score": 38,
      "summary": "It’s meant to be a tale of uplift for faith-based audiences, but instead wears viewers down with a heavy-handed narrative, an overbearing score and voiceover that spells out everything in cringe-inducing, folksy tones."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 38,
      "summary": "The film is so bizarre, contrived, manipulative, and meretricious that anything is possible."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 38,
      "summary": "Director Monteverde, whose previous feature, \"Bella,\" came out nine years ago, clearly meant his film to lift up everyone and condescend to no one, least of all Pepper and Hashimoto. But Little Boy comes off as a picture-postcard fake."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 37,
      "summary": "Little Boy is a as phony as a game of three-card monte."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 30,
      "summary": "It's all simplistic sermonizing in director and co-writer Alejandro Monteverde's hands, devoid of any thoughtful messiness about wartime mind-sets or family despair, and quick to sand any edges with postcard-pretty coastal town vistas and cutesy music cues."
    },
    {
      "critic": "Tim Grierson",
      "publication": "Screen International",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2015
      },
      "score": 30,
      "summary": "A drearily sincere movie about faith and tolerance, Little Boy boasts plenty of good intentions but very little else."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2015
      },
      "score": 25,
      "summary": "A colossal miscalculation in audience uplift."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2015
      },
      "score": 25,
      "summary": "Though Wilkinson gives an atypically restrained performance that lends the movie its best moments, and Watson manages to breathe a little life into her underwritten character, the movie is hopelessly simple-minded, with corny fantasy sequences, slathered-on folksiness and a plot twist that it would take a miracle of self-delusion not to see coming."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 20,
      "summary": "The steady performances of Tom Wilkinson, playing a kindly priest, and Emily Watson, an angelic mother, in Alejandro Monteverde’s Little Boy do little to offset the cloying sweetness of a movie that has the haranguing inspirational tone of a marathon Sunday-school lesson."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 20,
      "summary": "Somewhere amid the storytelling rubble in Little Boy there’s a decent message against racial prejudice. But it’s suffocated beneath a hokey premise and hopelessly square execution."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 20,
      "summary": "In some ways it takes the right approach, attempting to mix moral lessons into a narrative rather than hit audiences over the head with them. But the lessons are so pat that every moment in which Pepper makes a good moral choice feels like an act of self-congratulation."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 20,
      "summary": "The problem here isn’t theological; even if it were in service of a different message entirely, the sheer gracelessness of Monteverde’s storytelling would be a massive turnoff."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "summary": "Examinations of faith on film don't have to be noxious."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "I took my 13 year old son to see this and we both loved it.  Most of the bad reviews you read for this movie have more to do with an anti-Christian bias than the movie itself.  It's a well written, well acted movie that was really fun to watch.  Just go see it and make up your own mind.",
      "total_reactions": 5,
      "user": "Hapkidoist"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "I watched this last Thursday and I'm glad I did because the trailer did not do the film justice. This is one film where the critics on Rotten Tomatoes are dead wrong!!! This film is a beautiful anti-racist film set during WWII written and produced by many Hispanics. It had many moral messages that all overlapped nicely but the most powerful one is 'Faith does not work if there is hate in ones heart'. I guess for most people they can't stand this message but it isn't surprising considering how racist our country is.  I'm not religious but the films portrayal of both faith and secular views are very respectful which is rare in film today. My family and I loved this film and it brought us all to tears. It's out of theaters mostly by now but if you didn't get the chance to watch it, I'd say watch it when it comes out on Netflix, DVD or Blue-ray.",
      "total_reactions": 5,
      "user": "ITercero"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "Extraordinary film! We brought my mother and our 4 kids and everyone loved it. It is funny, moving and deeply inspiring. The writing, acting and cinematography were extraordinary. Im not going to describe the film because it is too difficult, it has multiple layers but it seamlessly flows. It has the classic sensibility of the sound of music, the heartwarming spirit of E.T. and cinematography like Life is Beautiful. In my opinion, it is the best family film of this decade.",
      "total_reactions": 8,
      "user": "SeanWolfington"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "A boy, through sheer faith, wills into effect the atomic bomb attack on Hiroshima and is declared a hero. YES.....that's the movie. Also, his dad comes back from war unharmed because of the boy's faith.......Because that's a great lesson. Pray hard enough and God will kill your enemies in horrifyingly brutal ways and bring your dad back from war. Apparently, if you lost a loved ones overseas it's just because you didn't believe hard enough. Nothing bad ever happens as long as you have faith. And God apparently is A-OK with unleashing a nuclear bomb on humanity and slaughtering people as long as it's for the sake of a pleasing a believer.....WTF movie? This is offensive to EVERYONE, regardless of your religious beliefs.",
      "total_reactions": 4,
      "user": "SpareParts"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2015
      },
      "score": 0,
      "text": "This movie was one of the worst movies I have ever seen, I made it through an hour and was wishing I was finishing my Algebra homework over watching what was the top three worst movies I have seen this year. All the amazing reviews are insane, you have been warned, see at your own risk!",
      "total_reactions": 4,
      "user": "seanpk6161"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2015
      },
      "score": 10,
      "text": "I'm the first one to shut down a movie if I think they're trying to push religious beliefs under the guise of entertainment. This isn't one of those. Even the priest wasn't very sure of himself. When all is said and done you can believe what you want to believe, just as the people in the movie did. One of my favorite movies of the year, it's a shame that a lot of people won't see it because the critics trashed it. And by reading some of the reviews here, it's obvious a lot of people don't \"get it.\" A shame.",
      "total_reactions": 2,
      "user": "MurrayT"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "The media has shamefully crucified this beautiful film, as it refuses to conform to their status quo.  But, anyone with the slightest heart and humanity in them, will be moved to tears by its message of faith, hope, and love.  The entire theater--both young and old-- were sobbing by the end of the movie.  It left us speechless by its touching story and is personally one of the best movies I've seen.  Don't be fooled by the spiteful, dubious reviews.",
      "total_reactions": 2,
      "user": "Sauteed"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2015
      },
      "score": 0,
      "text": "this is the worst movie ever and a 2 year old boy could have written the story of this movie and the and why would a child act on a movie like this ****",
      "total_reactions": 2,
      "user": "gilgamesh123"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "This movie is amazing! I don't know what the critics are influenced by. I think the 89 out if 100 on rotten tomatoes/flixter speaks for itself. The production and acting was great!",
      "total_reactions": 5,
      "user": "Mso_26"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "We all like stories and this story of a little boy who wants to see his dad come home from war will pull at your heart as you watch him try to \"will\" his dad home. Jakub Salvati is \"Little Boy\"  and brings a freshness to the screen that has not been seen in years. The rest of the cast do their jobs admirably, though there is something very special in the interaction between Little Boy and Hashimoto, the Japanese stranger who moves into town.  Critics do not like the film because it has a strong \"Norman Rockwell\" \"Frank Capra\" air about it.   The priests are decent people. The mother of little boy is strong and holds the family together. The film does not shy away from the hatred and bigotry many held toward Japanese Americans during the war but confronts it with some real lessons for our times.  There is no glorification of war and the pain felt on the home front is very visible in the character development. Are some scenes predictable? Perhaps. Does the director telegraph some of his moves? Yes. But none of this affects the overall feel and charm of the film. David Henrie does a super job of having the older son bottling up and exploding until a critical moment. so I recommend the film strongly and urge viewers to judge for themselves who is right  - the critic or the ordinary guy.",
      "total_reactions": 6,
      "user": "jakeslaw"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "THE FACT IS, BAD PEOPLE AT HEART, COLD PEOPLE, SELFISH, AND BULLIES, CAN'T STAND TO SEE ..GOOD ACTIONS, THEY CAN'T STAND A MOVIE WITH GOOD MORALS, AND PRINCIPALS, WITH SUBSTANCE THEY HATE, HATE,HATE and that's all they know how to do.. So yeah, This is War!.. \"a spiritual one\"",
      "total_reactions": 5,
      "user": "prophet777"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2015
      },
      "score": 8,
      "text": "Wars are the scars in the human history.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2015
      },
      "score": 7,
      "text": "Little Boy is charming and interesting and is a well-shot film overall the film has commonplace characters, a  terrible religious message, cliche's and it's offensive. The acting is okay, the actors give what is expected of them nothing special. An auto mechanic is sent James Busbee (Michael Rapaport) is sent to Japan to fight the Japanese during World War II, leaving his wife (Emily Watson) two sons London (David Henrie) Pepper (Jakob Salvati). Pepper feels upset without his father by his side, so he can't wait for him to return. His favorite magician Ben Eagle (Ben Chaplin) and priest (Tom Wilkinson) convince him to bring his dad home. The filmmakers want to make a story but they failed to make the story good overall they just made a silly mess. Grade B-",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2015
      },
      "score": 9,
      "text": "A very inspiring and lovely movie to watch with loved ones. Perfect for the kids. A mix of funny and inspiring story.",
      "total_reactions": 0,
      "user": "annapatweex31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "A powerful and very inspiring film that teaches good lessons. A perfect movie for the entire family.",
      "total_reactions": 0,
      "user": "sexyanne"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2016
      },
      "score": 10,
      "text": "A very moving story. A drama with a profound meaning and intense moments in which the director captivates the heart. Definitely worth watching, and even better if with spouse and kids!",
      "total_reactions": 0,
      "user": "AndresLuna"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2016
      },
      "score": 6,
      "text": "Little boy initially it will look like to you a great movie, but on having seen the second time you will realize that it is not a good movie..........",
      "total_reactions": 0,
      "user": "2016"
    }
  ]
}