{
  "mc_avg_user_score": 7.9,
  "mc_metascore": 48,
  "mc_mixed_rating_frequency": 78,
  "mc_movie_name": "Lockout",
  "mc_negative_rating_frequency": 21,
  "mc_positive_rating_frequency": 202,
  "mc_pro_critic_reviews": [
    {
      "critic": "James Rocchi",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "Lockout isn't high art, but it's ridiculous fun."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "Lockout is the kind of manly nonsense no one wants to make anymore."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "Lockout is derivative and ridiculous and a good time, provided you can turn off higher brain functions along with any other part of you that might want to lodge a complaint about liberal borrowing from better movies."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "If you're an \"Escape From New York\" fan, you might have wondered about those rumors about a possible remake...Well, wonder no more. Producer Luc Besson's action factory has beaten everyone to it, stylishly. They're just calling the thing Lockout, and setting it in outer space."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "More than any masculine heroics, Pearce's primary job is maintaining the tone: smug, irreverent, and giddily punch-drunk."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "It's clichéd, ridiculous, and very entertaining."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2012
      },
      "score": 67,
      "summary": "The space prison set-pieces get the job done; only in the film's terrestrial bookends does this nuts-and-bolts action film show its rust."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 63,
      "summary": "Lockout is genre all the way. The film wears its colors proudly, but it also, alas, wears out its welcome."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2012
      },
      "score": 63,
      "summary": "The idea of the president's daughter being held captive isn't blindingly original (it's an alarmingly dangerous occupation), but placing the story on a space station is a masterstroke, since we're about filled up to here with prison movies set on Earth."
    },
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2012
      },
      "score": 63,
      "summary": "Luc Besson's producing career has been so geared toward lean, tough genre films that it's somewhat apt that he'd ape--or, if we're being kind, pay homage to--John Carpenter's preeminent sci-fi actioner Escape from New York with his latest, Lockout."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "The pretty good thriller Lockout peaks with its first shot...When the camera moves and the plot kicks in - as it must - the movie loses its witty economy. Things get cluttered."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "Lockout, is as dopey an entertainment as imaginable, but it's also a reminder that the film's star, Guy Pearce, has always had great screen magnetism, to which he has now added a bedrock of muscle. Also: he can act."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "Directors Stephen St. Leger and James Mather fill the film's obvious narrative gaps with enough witty banter and tongue-in-cheek humor for audiences to overlook the subpar special effects used throughout."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "Tackles a nifty futuristic premise with bargain-basement efficiency and a deadpan, devil-may-care attitude. It's an initially invigorating tactic that proves slapdash and unsatisfying over the long haul, reducing a potentially rich sci-fier to the level of a halfway decent time-killer"
    },
    {
      "critic": "Read full review",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "If you were to watch Lockout a few months from now, at home alone, it wouldn't produce more than a shrug. Movies this bad need to be revered in public places. Go see it in a mall, and try to sneak a beer or two in with you."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "Pearce pumps a surprising amount of levity into his one-liners – sure, it's still hot air, but at least the banter comes fully inflated."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "Most of the time Lockout is pleasant enough, not something to recommend to a friend, but enjoyable in the moment. Guy Pearce has a lot to do with that, as the most impervious action star imaginable."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "Pearce gets into his groove swiftly, owns it and remains entertaining throughout. The rest of the movie, however, would work better as a video game."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "With no thriller cliché left unused, the gaily outlandish plot is matched by tin-eared dialogue, ripe tough-guy overacting from the very game Pearce, and best-that-she-could acting from Grace."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2012
      },
      "score": 42,
      "summary": "Lockout consists of disciplined action pastiche, but much of its thundering engine borrows from better movies."
    },
    {
      "critic": "Helen O'Hara",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2012
      },
      "score": 40,
      "summary": "It's just not quite as much fun as it should be, despite Pearce's best efforts and some good chemistry with Grace. Unusually for an action thriller, this could have benefited from being just a little longer."
    },
    {
      "critic": "Ken McIntyre",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 40,
      "summary": "Luc Besson's clunky, space-bound actioner apes '80s B-flick excess but skimps on all the good parts. Fans of really bad science and pixelated CGI won't be disappointed, though."
    },
    {
      "critic": "Henry Barnes",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 40,
      "summary": "Pearce has fun; world-weary in the style of a 15-year-old told one too many times to tidy his room – but shoddy special effects and the surface-level sass of the president's daughter leave this one spinning in low orbit."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 40,
      "summary": "Mostly Lockout is lost in space."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2012
      },
      "score": 40,
      "summary": "Movies like this are supposed to be ridiculous on some level. It's part of the fun. But, dang. Falling through space, popping your parachute and landing on the one empty stretch of freeway in some bustling future city? C'mon. We all have our limits."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2012
      },
      "score": 40,
      "summary": "Lockout is, not unexpectedly, a potluck of derivative references."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 38,
      "summary": "Enjoy it, in moderation. It's your recommended weekly allowance of schlock."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 38,
      "summary": "A putrid film that comes dead-weighted with hammy one-liners and a plot so silly it borders on comedy?"
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 38,
      "summary": "Lockout is painful. Not painful in the way Uwe Boll or \"Sex and the City\" movies are painful. But painful enough that I kept waiting for Nicolas Cage to show up. Or Katherine Heigl. Or, god forbid, both."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 25,
      "summary": "The aftereffects of watching Lockout include an inability to focus or to complete a simple declarative sentence without an ill-timed cutaway in the middle."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 20,
      "summary": "Directors James Mather and Stephen St. Leger stage a few good action set pieces, but unlike the 1981 midnight movie classic it imitates, the blandly titled Lockout never busts out of its cheesy concept."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 12,
      "summary": "Besson co-wrote and produced this cheesy mash-up of elements from James Bond and \"Battlestar Galactica.\""
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "Lockout is a forgettable sci-fi action flick. Guy Pierce plays against type, which is kind of fun, but some dodgy effects, neutered violence and a general lack of identity ultimately overpower the good things on offer here. Lockout makes for a nice one-time viewing but it doesn't have the legs for repeats.",
      "total_reactions": 2,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "It's corny, it's old-school, it's funny, and it knows it. This was not made to be taken as a serious drama, it was made to provide the world of cinema with a good old fashion shot in the ass of 80's action and over-the-top bravado. I loved it, and I especially loved Guy Pearce who played his part of the one-man-army-super-suave-badass beautifully. What's really terrible here are the reviewers that are overthinking this movie to a degree that is as preposterous as the plot. Space station full of convicts? President's daughter held captive? And there's only one man for the job? With the world the way it is today, we need something this fun.",
      "total_reactions": 1,
      "user": "dartvader7177"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "so obviously this wasn't a once in a lifetime, destroy all preconceptions of cultural standards, but you should judge this movie by what its intended purpose was, ie: to have fun while watching it. good wise cracks, kudos guy pierce and the writers. cool sci fy. don't get caught up on why there was a space prison (this is science fiction after all). you might have been able to see the plot twist coming, but at least they threw one in there. on the whole, its a movie if you want some fun. and why does that deserve a bad score?",
      "total_reactions": 1,
      "user": "phunkatonik"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2012
      },
      "score": 4,
      "text": "All I can say is this movie was entertaining enough to keep me watching until the end.  Other than that, there is nothing special about it.  It's one of those movies that you will probably watch on cable TV some Saturday afternoon when nothing else is on and you don't have anything else to do.",
      "total_reactions": 5,
      "user": "BengalsfanAZ"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2012
      },
      "score": 3,
      "text": "Lockout is a product of outright laziness.  There is nothing new here, nothing unique, and nothing to recommend.  Aside from a few good jokes from our hero, Snow (Guy Pearce), the film has nothing going for it.  The plot is stock beyond belief, the dialogue is groan-inducing, and the action editing is some of the worst in years.  What is technically a good idea on paper, a prison break in space, is spoiled with extremely lousy and inept filmmaking.",
      "total_reactions": 4,
      "user": "CitizenCharlie"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2012
      },
      "score": 1,
      "text": "Had potential then jettisoned it self into DEEP SPACE. Went to this movie not expecting much but was looking forward to just kicking back and watching an action flick. The only positive thing about this movie is Guy Pearce's peformance. The (lack) of action, \"quality\" special effects, and peformances by the supporting cast make The Expendables look like it should have one best picture at the Oscars. I constantly found myself along with my buddies laugh at the movie at all of the cheesy moments it had. The pace was ridiculous and the villian's were laughable and half retarded. Two monkey's covered in sh!t could have provided more meanigful performances. The graphics.....lol video games in the mid 90's had better graphics then this. I would have to be borderline blackout drunk to watch this movie again and I would definitely try and pass out immediately after Pearce's interrogation becasue that was the only funny part in the entire movie. Good Talk",
      "total_reactions": 5,
      "user": "Championship"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 2,
      "text": "the hunger games was better... ok but seriously my score equals the amount of time it took for the main character to get to the space station and meet the president's daughter. It was one of the fastest paced movies I've ever seen. Overall was terrible. No character development. No back story. Plot holes (why would the US spend trillions and trillions of dollars on a space station for prisoners when they could kill them at the cost of one bullet?). Would only recommend if it was on netflix and you had nothing else to do.",
      "total_reactions": 11,
      "user": "theoffice"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2012
      },
      "score": 2,
      "text": "This movie overall was just bad. The only thing good about it was the sarcasm by Guy Pearce. Everything else was dreadful. The plot itself is cliche and just plain dumb. It has everything from your corny 80's films blended into a 90 minute duration thats so rushed it feels like it was 5 minutes long. The cgi in this film was awful. It was so fake i felt like i was watching someone play a video game, but not even playstation graphics. It was like the wii. It didn't seem like they finished the work on it. They just halfassed the job. The acting was atoricious besides GuyPearce, and another thing, apparently in lockout their is gravity in space, if you see it, you know what dumb scene im talking about. Anyways, everything was just horrible about this film. The only reason im giving it a 2 and not a 0 is because of Guy Pearce, he was hilarious, but that was the only positive i saw. Don't see this film, its a waste! 2/10.....but really a 0/10â",
      "total_reactions": 2,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2012
      },
      "score": 3,
      "text": "Absolutly hated this movie. Were do i begin... Well to start, about as cliche as i can get, it also focuses on nothing but action. Explosions, and all that random unnecasary crap. And i predicted the ending from the begining. And if you like realism, dont watch.. He should have died in the first five minutes. And he also does abunch of other imposible crap. Bad movie.",
      "total_reactions": 2,
      "user": "Chaseyo2"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "This is no Fight Club or Braveheart  but a VERY GOOD film all the same, if you have been getting sick of all the BADLY made movies lately you should see this movie. I don't understand where this bad rating or coming from......maybe people started liking bad movies like Transformers,Battleship or the like.",
      "total_reactions": 11,
      "user": "Vikingeudy"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "The biggest problem with this movie is that it's just simply generic. It's basically Die Hard set in space. Nothing new. The film does have its cool moments which can take the focus away from the flaws, and there is a sense that serious effort was put into making it, but in the end, Lockout is just another generic action flick. If you just want an entertaining action movie and you couldn't care less if it has been done before, I'd recommend this movie, as it DOES have moments that are very cool and entertaining. However, if you're looking for something fresh, new, and original, look somewhere else.",
      "total_reactions": 7,
      "user": "MikeBoat"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "this is the kind of movie you can't say is a masterpiece, but at the same time you can't stop enjoying. Sure, some special effects are cheap, sure some lines you've heard over and over again. But these days, this one is as good a b movie as it gets. This isn't Guy Pierce's best performance, but he gets the job done as an off the map cop that only does things his own way, tells jokes, gets punched (and punches) a lot and kick a lot of ass. This is like Escape from New York meet the Transporter. Generic ? Kinda. Easy ? in a way. But enjoyable ? Sure is too.",
      "total_reactions": 9,
      "user": "bradaviel"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "It's great to see Guy Pearce on screen in action again. And he's great at delivering the cheesy lines that are so typical of this sort of gung-ho action film...and make you laugh anyway.  Lockout is loads of fun.",
      "total_reactions": 3,
      "user": "Critic2012"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2012
      },
      "score": 1,
      "text": "Cheesy as balls, Guy Richie's annoying as hell, smarmy and unlikable. The only thing which could have saved the film for me would be to see him get gang ra!ed by the prisoners at the end. An awful, soulless waste of money and talent.",
      "total_reactions": 7,
      "user": "Lambo442"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "It's close to the definition of an average film. Pearce is terrific in his highly original and refreshing role - for him - but the \"bad guys\" weren't nearly interesting or threatening enough to make it work. It could have been more like a Die Hard film with better-drawn characters. And was one of the early car chases supposed to look like a videogame cut-scene?  Did they just not have the budget to film that one?  Very interesting. It's great seeing Maggie Grace again, but she doesn't bring enough to rescue the film into the green (recommended) territory.",
      "total_reactions": 2,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "It wasn't terrible and it wasn't really good.  Lockout provides some spectacle that will make you enjoy and feel a little thrill as it all unfolds.  But the biggest problem with the movie is the multiple plot setup that never goes beyond skin depth.  It's a shame, because this could have been a dark horse for best \"summer flick\" of 2012 had most everything not felt so rushed and cut off, but instead we get more of a missed opportunity.  See it if you want, but I have a feeling there might be more big-screen entertainment value out of the soon-to-be released Battleship.",
      "total_reactions": 1,
      "user": "SchroederRock"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "There are some cool special effects, and overall the acting is good, but the story is stale and the believability factor crosses the line.  Example - at one point Guy Pearce jumps off a high rise during a chase.  He ends up uninjured without a scratch, maybe just a little winded.  He endures so much physical abuse throughout the film but is like a cartoon character, he just keeps going.  The other thing about the film that is annoying is Joseph Gilgun, who plays the bad guy.  His acting is great, BUT I couldn't understand more than 5 words he said throughout the film.  He has a very thick Aussie accent.  He needed to clean up the accent a little for American audiences.  His brother in the film is also a bad guy and has an Aussie accent but you can easily understand him.  This wasn't a bad film but it had too many implausibilities to recommend.",
      "total_reactions": 1,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2012
      },
      "score": 5,
      "text": "Lockout is never meant to be a serious, Guy Pearce can do what the best he can with steroid and junk jokes from Luc Besson but well,  somehow it's work.",
      "total_reactions": 1,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "In the later part of the 21st-century the worst criminals the planet has to offer are kept safely away from public in stasis aboard an orbiting prison known as MS: One. Although it is never explained in the film, it does not take a rocket scientist to guess that â",
      "total_reactions": 2,
      "user": "garethvk"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "Uhhh, it's that type of movie when someone escapes space and parachutes down onto a freeway in the middle of NYC/DC? Humor was funny at some points but way too forced. I can just picture the writer laughing at his own jokes behind a computer screen. Entertaining? Yes. Good movie? No.",
      "total_reactions": 1,
      "user": "AmazinKazin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "A big, noisy mess, but rocketing with excitement, this movie never lets up the pace for a second. The lighting is murky throughout, as you may expect from a space station film. The acting by Guy Pearce and company is good. If you like explosions, bad guys and a few plot twists thrown in, you may enjoy this. They didn't quite explore the potential of the space setting as much as I thought they could- there's more to science fiction than crawling through tunnels. Still, it's a brisk adventure and will keep you from getting bored.",
      "total_reactions": 1,
      "user": "Lokar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "bradaviel explained this movie perfectly. It's not a masterpiece but you can't stop enjoying it. It was a pretty solid movie that I did enjoy watching, It's definently worth checking out.",
      "total_reactions": 1,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "Lockout, is a good movie, I remember when I watch the trailer, I think \"a sorprise of the year?\", but no, I watch Lockout, and the movie have much mistakes, the trama sounds excellent, but have some terrible problems in the development, the cast is excellent, Guy Pearce (OMG), but other have some regular performances, I think that the movie can be better.",
      "total_reactions": 6,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "Guy Pearce play's a sarcastic falsely convicted agent that has to go to space to save the President's daughter. And though it looks like it doesn't work, it kind of does, barely. Any normal person would enjoy this movie, and since I consider myself normal, I enjoyed it. It was a popcorn popping action movie that really worked it's hardest to fit itself together. It's nothing that new, and though it really only goes surface level, what else was there to expect? The CGI is kind of shady at times but it maneuvers around on the space visual effects quite well for it's low budget. Lower your expectations and imagine watching you're going to watch a movie like Transformers and you'll have a good time.",
      "total_reactions": 3,
      "user": "racketracer"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "First off,  I would give lockout a 9 out of 10. It's just a great action film for all people wanting a good adventure. Story all right. Acting is also descent as well. Nice sound, and action throughout the move. You really should see this. Overall, this is a fun action film. It's not amazing but, still fun film.",
      "total_reactions": 3,
      "user": "Juanolo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "I certainly enjoyed this movie well enough, but, that's because I showed up expecting it to be ridiculous.  How can you not with a premise like this?  It is a bit generic, and some of the special effects, especially during the early police chase are.... unimpressive.  However, for a mindless action movie, it does have a little charm.  Can't say I'd recommend it to everyone, but for a bad action movie, you could do worse.",
      "total_reactions": 1,
      "user": "weddingsinger"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "Likely to end up as a cult classic. The high point of the film is Guy Pearce's acting. The low point of the film is probably the CG, which looks too much like CG. Everything else is just about mediocre.",
      "total_reactions": 1,
      "user": "Darian"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "When the protagonist's first response to being asked \"What happened in that hotel room\" by a government interrogator is \"I was trampolining your wife\", you know you're in for a treat. Snow feels similar to Drake from Uncharted, but **** and a tad bit more badass. Watching him in action is a thrill, as he takes on hundreds of convicts by himself. The mystery of the case and the events that open the film are slowly dealt out, ending in a huge reveal that makes you really think. The two main villains are well-acted, with one being a sane man who wants to negotiate with the government, the other a psychopath who is really the worst humanity has to offer. You really need to see this movie.",
      "total_reactions": 2,
      "user": "Sben69"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "Almost enjoyable in its absurdity. Almost.",
      "total_reactions": 1,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "When I saw the trailer for Lockout back in 2012, I thought, \"oh, here we go again. Another CGI, messy, violent action movie with one liners and bad acting.\" Lockout proved a little bit of that to be true, but still exceeded my expectations.",
      "total_reactions": 1,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "Whilst watching this I had a nagging feeling I had seen it all before… and I had! It’s ‘Escape From New York’ set is space! The trouble is, it’s not as good as ‘Escape From New York’ despite being set in space. It’s well put together with the exception of the CGI, which looked pretty ropy particularly at the beginning of the film. Performance-wise, well everyone was ok with nobody particularly standing out. I did think Guy Pearce does need to have a word with his agent though, he’s much better than this. Sadly I found it all a little too predictable and although it did have some exciting moments, it didn’t really satisfy.",
      "total_reactions": 0,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "Lockout really reminds me of a good late 80's/early 90's action movie. The ones that actually had the balls to come up with a story that is creative / ridiculous and doesn't have to make a lot of sense. Guy pierce was a great role. He really pulled off the new snake pliskin style character in his own way and I would love to see him do another role. The things I didn't like about the movie; was how a lot of scenes were to fast paced.. They never really give the viewer a chance to understand whats going on or just to have a break. They also jumped around to often from scene to scene. Overall the movie was fun to watch and I support it because I love to see this type of stuff coming out again!",
      "total_reactions": 0,
      "user": "Heaviermetal"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "Entertaining but easily forgotten.   If you are looking for a realistic Sci Fi, you are out of luck with this one.  The movie expects you to believe that we have built a huge space prison hundreds of times bigger than the International space station using nothing but rocket technology and that orbital flights are commonplace using nothing but rockets.  That being said, Guy Pierce does a good job playing a like-ably unlikable character--- and the rest of the cast is pretty decent as well.  This would have been a good movie in a different setting, but the story and premise had more holes than the prison did after Snow (Guy Pierce) was done with it.   Still a good bet late night on Netflix.",
      "total_reactions": 0,
      "user": "nightblade00"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "If you want a chilled out, easy to watch sci-fi action movie then I'd definitely recommend this. There're some pretty funny one liners delivered throughout the film, and the story isn't so bad.",
      "total_reactions": 0,
      "user": "mugslangley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "This movie had potential to be a really good movie. The concept is great, the acting is solid, the characters aren't all so one-dimensional, and it's really entertaining. Guy Pearce did a great job. He kind of reminded me of a \"poor man's\" Mark Wahlberg. The problem came in with the lazy writing that created unbelievable plot development. Add to that the fact that the effects were terrible pretty much throughout the film and the movie goes from really good to just OK. So I guess if you want to see a halfway decent futuristic action movie, check it out.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2014
      },
      "score": 5,
      "text": "Luc Besson is the Writer/Director of The Fifth Element and Taken. Usually when you sit down to watch one of his films, you're in for a treat. When he said he was making a new film that combined elements of both popular movies, I was excited, and then sorely disappointed. Lockout introduces us to a new kind of a prison, one that is in outer space, and holds it's prisoners in cryogenic stasis. The daughter of the U.S. President (Maggie Grace) was set to tour the facility, to make sure the prisoners are being treated fairly, when all hell breaks loose. Wanting to restore order with a minimal amount of casualties, the President sends in one man, his best C.I.A. operative, Snow (Guy Pearce), whose job it is to save the hostages. For starters this film is so full of cliques and references to other things that it almost becomes a farce of itself. Guy Pearce is the star and he was very good, however his character plays like John McClain in Outer Space. Snow is full of jokes and is this huge tough guy, who was almost a mirror image of Bruce Willis in Die Hard. The only thing missing was a catch phrase and lets all be thankful for that. Pearce is paired with Maggie Grace, who as in Taken, finds herself as a hostage once again. To her credit, she was a lot less whiny than in Taken and even fights back a little bit, but she basically played the same character that she always does. I don't know about you, but I have a hard time feeling sorry for a beautiful spoiled blonde girl who gets into trouble because she traveled to Europe or had to take on the cause of prisoners rights. Overall, there was a lot of action, but not much of a story to play on. Guy Pearce does a pretty good job, but Lockout is honestly a predictable, paper thin story, with special effects that aren't anything to write home about. It's another big budget film that tries to wow audiences with a unique setting and lots of explosions in the previews, but the only surprise here is that the usually reliable Luc Besson fails to deliver a worthwhile film.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "For me, Lockout is one of those odd guilty pleasures. It was probably far from the best film released during it's week of release, never mind the month or year. It's a straightforward, short, fast paced, guns blazing, one man action vehicle that doesn't make any attempts to be cleverer than it needs to be. Guy Pearce stands in for the likes of Russell, Seagal, Willis, Arnie or Sly as the likeable rogue protagonist.",
      "total_reactions": 0,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "The action sticks to the usual air ducts and fistfights.Nothing new.They have a whiff of sleaze that many films made domestically avoid. By the very nature of it being in space â",
      "total_reactions": 0,
      "user": "LuckJoe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2014
      },
      "score": 6,
      "text": "Not a terrible movie. It could have been better, but it is definitely worth your time. At least it is worth recording, mor renting. It has great action, and a really fast pace.",
      "total_reactions": 0,
      "user": "mrmonster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "Made very economically for 20m$ by Europacorp but allas you can tell coz some VFX sequences are looking incredibly fake (bike chase & parachute drop). Pearce apparently choose this film for the story, but it's rather simple and not very original. It has to be said that the best thing about this movie is the somewhat Snake Plissken-like 'f*ck the world' attitude with which Pearce plays the part. Grace isn't on the same level but does a nice enough job. A nice quicky for scifi fans I guess.",
      "total_reactions": 0,
      "user": "Apemonkey666"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "The movie was actually not that bad! It had some funny moments!! Which that was surprising! It had great action and great actors that were in it! And the ending is a HUGE shock!!!!!! If you like action, suspense, and some sorta funny parts then this is your type of movie!!",
      "total_reactions": 0,
      "user": "April717"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "Snort some drugs, and watch Lockout- and you will think its the best movie ever made.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2013
      },
      "score": 3,
      "text": "I like Guy Pierce, but he can't even save this film.  Good concept, but poor execution led by a poor script Lockout has its moments but not enough for this bad movie.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "Guy Pearce É super foda nessa performance do galã herói,com muito carisma. Maggie Grace de Taken,está fenomenal também aquela Branquinha Gostosa cheia de carisma também. Interessante E fascinante história. Com boa dose de ação.humor e nada de romance. Boas cenas de ação ótimo filme.",
      "total_reactions": 0,
      "user": "LoRevisor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "\"Lockout\" is a movie by a studio that decided to make a script by throwing the scripts of past blockbusters into a barrel and grabbing chunks randomly until there was a unfinished script to film. At times the movie has a brush of the feeling of a good summer blockbuster movie but trades it for over the top action that seems cartoon like in a movie that demands realism. Guy Pierce is great as the hero but with dialog that goes on to long, the hero is a bit too dis- interested in the happenings around him. Mix that in with some quick editing, useless over the top violence, and yet another sci-fi movie race against the big bang at the end, and you have a missed opportunity. The idea of John McClane in space is great if only it was done a bit better.",
      "total_reactions": 0,
      "user": "NotoriousFraud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2016
      },
      "score": 4,
      "text": "This movie is mediocre, I don't understand why everyone gives it such a high rating. The movie has bad effects, it's boring and is really strange. So I'll give it 4/10",
      "total_reactions": 0,
      "user": "NukaCocaCola"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "The dialogue between the two leads and Guy Pearce's pleasant performance make this sci-di drama worth seeing.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2016
      },
      "score": 7,
      "text": "Guy Pearce is one of the very few actors of his generation that can carry a film, however, clichéd, cheesy, predictable, corny and unoriginal they are. And this one is and again he does. But the script is peppered with dry one liners and there's decent chemistry and engaging banter between Pearce and Grace. I also thought the two Scottish brothers added a bit of fun especially the unhinged younger one. A bit OTT but quite disturbing too. Bottom line is it's clear the makers are not taking this that seriously which is a major plus when so many action, sci fi and superhero films are so deadly humourless.",
      "total_reactions": 0,
      "user": "Trenchfoot"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2016
      },
      "score": 6,
      "text": "Action in orbit as psychopaths take over their space-station-prison and flawed hero is sent to rescue feisty President's daughter who happens to be on board. Wholly predictable, occasionally brutal things happen with a peppering of dry humour and flirting. OK if you've time to kill, but it's not one I'll bother with again.",
      "total_reactions": 0,
      "user": "shiftworker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2017
      },
      "score": 4,
      "text": "Attention, il s'agit d'une \"production\" Luc Besson, le genre de \"production\" qu'on produit dans les chiottes, il faut donc s'attendre au pire avec ce piège de cristal dans une station spatiale. Le scénario présente des trous béants colmatés avec des morceaux de papier-cul et le filmage se laisse souvent aller au cut et move zoomé. Il y a donc matière à se barrer à toute blinde devant ce genre de sous-produit...",
      "total_reactions": 0,
      "user": "Broyax"
    }
  ]
}