{
  "mc_avg_user_score": 8.2,
  "mc_metascore": 84,
  "mc_mixed_rating_frequency": 150,
  "mc_movie_name": "Looper",
  "mc_negative_rating_frequency": 75,
  "mc_positive_rating_frequency": 1244,
  "mc_pro_critic_reviews": [
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2012
      },
      "score": 100,
      "summary": "So what's left for the audience to hook into? Only pounding action, elegant style, steady-state suspense, marvelous acting and, despite that droll pooh-poohing every now and then, haunting explorations of youth, age and personal destiny. It's a lot to claim for a sci-fi thriller, but I was blown away by Rian Johnson's Looper."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2012
      },
      "score": 100,
      "summary": "Looper is a tremendous motion picture experience. Not merely a \"very good\" one, but a great one."
    },
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2012
      },
      "score": 100,
      "summary": "Intelligent science-fiction sometimes seems an endangered species - too much physics and there's a risk of creating something cold and remote, too many explosions and get lost in the multiplex. Looper isn't perfect, but it pulls off the full Wizard Of Oz: it has a brain, courage and a heart."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2012
      },
      "score": 100,
      "summary": "Director Rian Johnson's resulting film, a cornfield neo-noir, is the coolest, most-confident sci-fi flick since 2006's \"Children of Men.\""
    },
    {
      "critic": "James Mottram",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2012
      },
      "score": 100,
      "summary": "The best sci-fi movie since \"Moon.\" The best time-travel yarn since \"12 Monkeys.\" And one of the best films of 2012. You'll immediately want to see it again."
    },
    {
      "critic": "Noel Murray",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2012
      },
      "score": 91,
      "summary": "Looper is a remarkable feat of imagination and execution, entertaining from start to finish, even as it asks the audience to contemplate how and why humanity keeps making the same rotten mistakes."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2012
      },
      "score": 91,
      "summary": "Johnson keeps it simple, yet never stupid. Looper is a puzzle engaging your brain, rather than frying it, as one character describes the process. Obviously he has seen enough movies on the subject by 2024 to know how frustrating that is. This one plays fair with the fantasy."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 90,
      "summary": "I'm not ready to proclaim Looper a sci-fi masterpiece just yet; let's let it sit awhile. But it's a lean, mean, smart, violent picture with a bit of Stanley Kubrick edge, fueled by the terrific Gordon-Levitt."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2012
      },
      "score": 90,
      "summary": "This is a highflying, super-stylish science-fiction thriller that brings a fresh approach to mind-bending genre material. We're not always sure where this time-travel film is going, but we wouldn't dream of abandoning the ride."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2012
      },
      "score": 90,
      "summary": "Looper may not have the bell-ringing resonance of Chris Marker's \"La Jetée,\" one of its touchstones, but it's a jaunty match-up of genre and character drama that's far smarter and more finely wrought than almost anything else in the multiplexes."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2012
      },
      "score": 89,
      "summary": "Looper makes a full-meal entertainment out of piecemealing genres: It boasts the kicky mental gymnastics that come with time-travel terrain, the relentless rapid heart rate of a crackerjack thriller, and the bursts of extreme violence, buttressed with black humor, of a modern actioner."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 88,
      "summary": "This is an exciting, exceptionally well-made futuristic thriller that also happens to be loaded with lived-in touches and punchy ideas."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 88,
      "summary": "Thanks to the assured hold Johnson exerts over this ingeniously structured game of cat-and-cat, we'll go anyplace he has in mind."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2012
      },
      "score": 88,
      "summary": "An indie-inflected popcorn movie with major brains, brilliant acting and a highly satisfying payoff, Looper is the first must-see movie of the season."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2012
      },
      "score": 88,
      "summary": "When so much of what Hollywood churns out is almost instantly forgettable, it says a lot about a film when viewers want to take time to argue, ponder and puzzle over it."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2012
      },
      "score": 88,
      "summary": "Lacing tremendously exciting action with touching gravity, Looper hits you like a shot in the heart."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2012
      },
      "score": 88,
      "summary": "Late in Looper, when a highly telekinetic kid starts levitating things, it really does look like Christopher Nolan had wandered onto the set and taken over."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2012
      },
      "score": 88,
      "summary": "The leads blend as seamlessly as any young-old character coupling I've seen. The prosthetically altered Gordon-Levitt, unrecognizable at first, really resembles Willis."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2012
      },
      "score": 88,
      "summary": "This film leads to a startling conclusion that wipes out the story's paradoxes so neatly it's as if it never happened. You have to grin at the ingenuity of Johnson's screenplay."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2012
      },
      "score": 88,
      "summary": "As in the very best Anthony Mann and John Ford westerns, Looper at once understands the visual power of violence and is deeply critical of it."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2012
      },
      "score": 83,
      "summary": "While the third act inevitably bogs down a bit in gunplay and chases, there are more than enough moments of visual wonder and storytelling surprise to make it worth the trip."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2012
      },
      "score": 83,
      "summary": "The time swivels in Looper evoke some of Inception's fancy temporal tricks... But it's the glimpses of Children of Men-like societal dystopia that give the movie its real weight, and distinguish Johnson's third feature as a marked step forward."
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2012
      },
      "score": 83,
      "summary": "Perhaps the most thrilling thing about Looper is watching Johnson really grow leaps and bounds as a filmmaker."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "A fanciful film with the patina of hyper-realism, Looper is well served by actors who behave not as if they were dropped carelessly into the future but spent their whole desperate lives there."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "Gordon-Levitt is flinty, and Willis, on his A-game, is fiery. Together, they take us on a helluva trip."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "Gordon-Levitt has been so terrific for a while now that he's become a magnetic presence; Willis is also on a nice streak, not as strong here as in \"Moonrise Kingdom,\" but still quite good."
    },
    {
      "critic": "Andrew Schenker",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "Thrilling in its deft juggling of complex narrative elements, utterly clear in its presentation, and unfolding with what feels like serious moral purpose, Looper still can't help but suggest that its larger ambitions are something of a put-on, a nice thematic polish to set off its interpersonal drama."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "As time-travel action films go, here's one that's brainy, stylish and carries itself with B-flick modesty - all of which feels like some kind of alchemy."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "If high-toned futuristic time-travel pictures with a splash of romance float your boat the way they do mine, you'll have yourself a time."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "Their physical disparity notwithstanding, Gordon-Levitt and Willis both come across strongly, while Blunt effectively reveals Sara's tough and vulnerable sides."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "In a genre infamous for loose ends, this thinking man's thriller marshals action, romance and a dose of very dark comedy toward a stunning payoff."
    },
    {
      "critic": "Henry Barnes",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "Once you commit to the lexicon – to the blunderbusses, the silver, the loops that close and the loops let run – you're in for a breathless ride. It's been a patchy summer for sci-fi, absent of anything that really sticks in the mind. Johnson's deep, distinctive film plays on repeat."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 75,
      "summary": "My favorite line in the movie comes when Gordon-Levitt, in a face-off with his mob boss (Jeff Daniels), informs him that he'd like to leave the business one day and move to France, to which Daniels replies: \"I'm from the future; you should go to China.\""
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 75,
      "summary": "Looper, a cocky sci-fi tale with more brass than substance, is rife with these \"Say what?\" moments."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 75,
      "summary": "Looper ups the ante like a poker player on speed. What a potpourri of genres we have here – noir again, but sci-fi too, and action and horror and psycho-drama with existential trimmings, the latter designed to invite the thinking viewer into the fray."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2012
      },
      "score": 75,
      "summary": "The casting is carefully considered, as well, from Willis, whose Old Joe is even more dangerous than Young Joe, to Emily Blunt, who goes American this time and plays a young mother with a winning warmth and vulnerability."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2012
      },
      "score": 75,
      "summary": "With Looper, Johnson proves he can finesse the most complicated notions and visual setups his mind can imagine. It's the simple things that still elude him."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2012
      },
      "score": 75,
      "summary": "While Looper lacks the heft of a classic, this wayback machine is worth taking for a spin."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2012
      },
      "score": 75,
      "summary": "For about an hour Looper really cooks. Its second half is more of a medium boil, and less fun. But watching it, I realized how few commercial entertainments hold up straight through to the end-point."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2012
      },
      "score": 75,
      "summary": "There's a adrenaline rush even in the problematic finish, an eagerness that drives the filmmaking so that Looper is thrilling to watch even when it falls apart."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2012
      },
      "score": 70,
      "summary": "Mr. Johnson throws a lot at the screen, blasted corpses included, yet little here is as initially transfixing as Mr. Gordon-Levitt's mug."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 60,
      "summary": "The resulting slowdown, as well as a significant narrative shift, gives Looper a slightly sprawling and ungrounded feel at times, almost as if the first and second halves are two separate movies."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 50,
      "summary": "Looper felt to me like a maddening near-miss: It posits an impossible but fascinating-to-imagine relationship...and then throws away nearly all the dramatic potential that relationship offers. If someone remakes Looper as the movie it could have been in, say, 30 years, will someone from the future please FedEx it back to me?"
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 15,
      "pos_reactions": 41,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "Best movie I've seen in a long time; definitely the best this year. Absolutely superb. The intellect of Inception with underpinnings of The Terminator. Plot, story, action, acting, pacing... everything fit perfectly. It has a certain intellect to it that you simply do not see in many movies nowadays. It also is a new story and is not some rehashed superhero flick or modern remake of an older film. My only issue is that I would have liked a little more info about the \"rainmaker\" in the future. Otherwise I loved it. Very highly recommend; I don't give out many 10s.",
      "total_reactions": 56,
      "user": "theoffice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "Could be better, if your storyline naum was so slow, rolled and filled with holes, the situation of Bruce Willis was also much lower than expected, the performance of Gordon Lewitt and median, the only thing that saves the film is yours premise, and the ending thoughtful.",
      "total_reactions": 2,
      "user": "Scorpion"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2015
      },
      "score": 5,
      "text": "'Looper' was a movie I was pretty excited about when it was first released. I even saw it the day it opened hoping to see an exciting science-fiction action thriller.",
      "total_reactions": 1,
      "user": "MrMovieBuff"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "Vastly overrated. The film never lives up to its first 20 minutes. (which is high in spectacle and hyper stylish direction)",
      "total_reactions": 3,
      "user": "ryan_radiohead"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "I have mixed feelings toward this movie. Looper was well edited, and suspenseful. The acting was solid, and I enjoyed the futuristic/dystopian world they created. The music fit the mood perfectly, the cinematography was also great. The problems start with the movie's plot. There are some plot holes and inconsistencies in the story, because the way time traveling was portrayed. It was impossible even on a theoretical level (I could write an essay about the problems, there are so many). I wish they would not screw up the time travel part, because that part meant to be a key element, but it just made the plot confusing and senseless at some points. Otherwise technically the movie was really well made.",
      "total_reactions": 8,
      "user": "oliver1h"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "One of the best films of 2012, if not, THE BEST. This movie aims to achieve the main thing we all want in movies, a mesmerising and intriguing science fiction action movie that drives the attention of the audience at all times, and that is what a great film does.",
      "total_reactions": 23,
      "user": "zjacob"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "An intelligent action film is always welcomed, and this is no exception. Rian Johnson's 3rd film, this finally shows Johnson taking some creative ideas and grand detail and puts it altogether. As a result, it's his most complete film, though it's not without its plot holes. But you're going to get that when tackling time-traveling. Don't think too much about it and enjoy the ride.",
      "total_reactions": 5,
      "user": "Friskytiger81"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "This is one of the best action movies I've ever had the pleasure of viewing. The whole time travel thing was well thought out, as was the plot. The acting was superb; the kid was really good. The ending was so intense, that I actually had tears in my eyes. Cannot wait to see this again.",
      "total_reactions": 23,
      "user": "DJ99X"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "When I saw the trailer for this film, I was interested in the concept, but I initially thought that it would probably simply be a cool scifi action film and tried not to let myself get too excited. After seeing a lot of positive reviews, I was hopeful that this was going to be a great film, but upon seeing the film all of my expectations and hopes for it were exceeded.",
      "total_reactions": 18,
      "user": "david_lr"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2012
      },
      "score": 5,
      "text": "I expected a twist to come at some point in the movie because everything had been so predicable.  Even during the final minutes of the movie I was hoping for something to happen other than the ending I had predicted about 30 minutes into the movie.  I was sorely disappointed by another derivative Hollywood cut-and-paste sci-fi.",
      "total_reactions": 15,
      "user": "jball359"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2012
      },
      "score": 5,
      "text": "This movie is very hard to score out of 10, as the first half was as brilliant as the second half was disappointing, so I've opted for a 5.",
      "total_reactions": 15,
      "user": "lenny68"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "This is possibly best movie I've seen this year. It's the first film this year i've eagerly anticipated that lived up to and exceeded every expectation I had. Johnson has assembled a crack cast and written a brilliant yarn. This movie is fun to get lost in. I found myself hoping that it wouldn't end. Go see Lopper now!",
      "total_reactions": 16,
      "user": "cbreiner"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "Looper is an exciting and intriguing science fiction film; even if some of it's shots are cliche and there may be a few plot holes. It is a film that had me from it's opening shots and pulled me through different tones and pacing but I say this in a good way. The first act set up the themes, world and complexeties of the story even if it's not directly related to the rest. It is not a film that solely relies on it's concept; above all Looper is about characters and the moral decisions they have to make.",
      "total_reactions": 16,
      "user": "cabrita"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "Excellent Film! What a breath of fresh air to see a film that is highly original, exciting, touching, funny and ... did I say ORIGINAL! ( people may say it is derivative - but that is the case for every story ever told, except for the first  which was long before any of us were around) I say Great Script!!  If you like Science Fiction (don't expect alien landscapes, outer space etc) and don't mind seeing violence in films then my suggestion is - Go See It - and before you do learn as little about the storyline as possible. If your favorite films are romantic comedies, realistic dramas or Adam Sandler films this will probably not be your cup of tea - but otherwise you will be entertained.",
      "total_reactions": 14,
      "user": "Headcrusher"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "This is one trippy movie..I like movies like this with cool inventions.Except for a few scenes,it is definitely not predictable.",
      "total_reactions": 14,
      "user": "chuckdu"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "A vicious and often bleak thriller involving time travel and telekinesis. To those who haven't seen the movie, it DOES sound like an awful concept. However, both Justin Gordon-Levitt and Bruce Willis deliver with solid acting, a script that has believable (and fun) twists and turns, interesting moral dilemas, and amazing special affects. The only bad aspect of this movie i can think of as of this writing is if you put wayyy too much thought into the time travel mechanics. So just sit back and enjoy the violence and cacophony that is Looper.",
      "total_reactions": 12,
      "user": "rastapasta"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "Well written,strong performances and brilliant action set pieces. I loved this film when I first saw it, I missed the marketing so I wouldn't ruin anything (The young boy who played Sid and Jeff Daniels). Joesph Gordon Levitt does a great job 'as Bruce Willis' and this was one of Bruce Willis's best performaces in years (massive fan of his). Emily Blunt was fantastic as Sid's mother, but for me Sid stole the movie. I had no idea there was a telekinetic part to the plot which was a great surprise for me. The only thing I had a problem with was Jeff Daniels was under used (I think he is very under rated)",
      "total_reactions": 10,
      "user": "ThatBrianW"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "It's very interesting thriller. Everything is perfect. It's \"hard\" movie and age rating is right. The story is very interesting and it's difficult to keep track of the story cunningly. I think it's one of the best movies of 2012.",
      "total_reactions": 8,
      "user": "ddadian"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2016
      },
      "score": 10,
      "text": "Who: Joseph Gordon-Levitt, Die Hard, and that chick who's married to Jim Halpert in real life",
      "total_reactions": 4,
      "user": "RvwFromUpHere"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "This could have been so much better, and that's the biggest disappointment. The idea (given we've had the likes of The Terminator series and Minority Report beforehand) is fine, but at no stage do you ever get to the point of CARING about the characters enough to want them not to get killed.... I cannot fathom why so many critics rate this film so highly- it's bubblegum for a new generation, content to suspend any form of reality for a couple of hours and 'veg out'.",
      "total_reactions": 2,
      "user": "Cainess"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "This film is the definition of terrible! It has more plot holes than I can count, this films time travelling rules are about as backwards as its storyline, it had random telekinetic abilities stuck in that had no influence on the story at all. And the ending made the whole film pointless since it apparently shouldn't have happened.",
      "total_reactions": 2,
      "user": "googlecraft"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "Despite some poorly placed - or perhaps poorly delivered - swearing, some sloppy continuity errors and an annoyingly needless sex scene, Looper really was enjoyable. It did really well to keep me heavily interested in, and knowledgeable about, a storyline that could have easily gone over my head.",
      "total_reactions": 13,
      "user": "MusiclyMade"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "Looper keeps you guessing the entire way through. The character development is great, while Willis and Gordan-Levitt play the same person, they act differently. Gordan-Levitt shines on screen with his true big screen debut, with this being his first film he plays the most significant role. Willis does a great job at displaying his emotion effectively on-screen. Looper's action scenes and special effects are top-tier the whole way through, keeping viewers on the edge of their seats. It has some great twists throughout adding to the how unpredictable it is. Looper is one of the smartest sci-fi films ever made, and is easily one of the best films of 2012 so far.",
      "total_reactions": 13,
      "user": "DickSmith"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "To even begin watching Looper one has to discount the glaring plot hole which should make the film redundant. Then once you have gotten over this, you must suspend your disbelief once again and just accept the ride (less a rollercoaster, more a long boring motorway in a spluttering old volkswagen golf) without questioning further the plot as the director has quite cleverly written the film in such a way that any bizarrities that might pop up throughout can be never fully explained; only through vague guesses can one try to make sense of whats happening. The film itself is paced so unevenly that it made me uncomfortable, sometimes moving so fast as it aims to confuse, at other times crawling at a pace that makes snails look like time travellers. The world that is created is as one-dimensional as the characters. The director has a chance to delve deeper into the decaying society of the future, yet we know practically nothing; all we are given is about 30 seconds worth of lazy city shots and some extreme poverty, which is enough to get one interested but is inexplicably never expanded on. JGL is the stereotypical young reckless man, Bruce the stereotypical older and wiser man. What we are to learn from this is unclear and is about as deep as the main characters get (except at the end when for some reason one character has a change of personality over the space of a day or so). Blunt and JGL are not terrible actors in any way shape or form, and neither is Bruce Willis for that matter, however the direction results in some fairly hammy and uncomfortable acting and some scenes are plain unwatchable without seeing them in a humorous light.",
      "total_reactions": 24,
      "user": "SebDangerfield"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "What did I like about Looper? Well, the better question is, what didn't I like? Legitimately, I sat up all night pondering this question and can honestly say I couldn't come up with anything. It has they style of Drive, the sci fi level of detail of Children of Men, the ingenuity of ,well, I can't think of a good comparison (:P), and a razor sharp script to boot (filled with deliciously dark humor). It is an extremely dynamic movie, and can be appreciated on so many levels from action fans, to sci fi fans, to movie buffs, its all there. While it may not be packed to the gills with symbolism like Prometheus, it doesn't need to be and completely avoids that movie's pretentiousness for it. In Prometheus, some of the scenes are so stagy that it practically screams at the viewer \"THIS SCENE HAS MEANING\", whereas in Looper, you could miss the symbolism entirely simply because of the distracting level of quality found in the rest of the film. Looper is a film that respects the viewers intelligence, exemplified in the scenes where it denies the viewer an explanation of its time travel mechanic, because rather than telling you, Looper shows you. Take Prometheus' exploration of man's origin, which is alluded to from its title, vs. Looper's challenging of the notion that maturity comes with age, while the messages are fundamentally different, Looper has courage to be subtle and explain its message through the character's actions alone (seriously, the whole future Joe vs. past Joe is a really smart way of representing self conflict). I can totally understand why some people didn't like this movie, but that same reason is why I absolutely loved it. It constantly toys with your expectations. The movie actively anticipates your attempts to figure out the resulting changes to the timeline and narrative, but each time playfully veers in a different direction. As for the people that talk about it how it is just a rip off of Blade Runner universe, what these people fail to realize is that every sci fi builds on other sci fi, so even Blade Runner's overcrowded dystopia cribbed from something else at some point. The worst part about this though is the fact that they criticize Looper for taking the good bits of Blade Runner and other sci fi, (SINCE WHEN IS TAKING THE GOOD ELEMENTS OF ANOTHER MOVIE A BAD THING!) but completely fail to see what it adds to the formula to create something all its own. From the technologies, to the fashion, to the TK(telekinesis), it all works to create its own rich dystopian society driven by superficial gimmicks. This influences the way people act and even the idea of closing a loop, which is impractical and unnecessary, but also highly dramatic and believable in this context of this world. Everything works to create a fantastically well realized universe that rivals the depth found in Children of Men. The only thing I would say to be wary of, is if you don't have a stomach for cruelty because Looper has a good deal of the stuff. However, don't let that turn you away because every aspect of the movie serves to aid the narrative, including the cruelty. So please don't listen to the nit pickers on this one, if you are looking for a great movie regardless of genre check out looper. Instant classic.",
      "total_reactions": 11,
      "user": "evergreenOldboy"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "The most interesting Movie of 2012 by far. The storyline is just great. If the middle of the wasn't a bit overextended, I think I'd give it a 10. The Movie is full of memorable characters, the actors play well. Also the ending is really intense!",
      "total_reactions": 11,
      "user": "StaticSpine"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "Looper is a film that could have spiralled out of control at any moment either with its introduction of new sci-fi elements throughout the first hour, or its slightly complex use of time travel which is the emphasis of the science fiction portion of this film. The reason nothing went into disarray is because it was expertly written, keeping itself grounded as much as it could while delivering the viewer with a world to sink its teeth into. What Looper does to surpass itself from merely being an incredibly visceral science fiction and action experience, is it delivers character development and individual moments that transcend what is already a pretty packed film full of interesting ideas and motifs. It's hard not to instantly compare the film to others such as Twelve Monkeys, Inception and even The Matrix, but I think that's what Johnson does best is pull the vibe from other films and source materials (he read a lot of Philip K. Dick before writing this) then incorporate them into a film that feels wholly his own.",
      "total_reactions": 11,
      "user": "Paganostaghetti"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "Ok, let me preface this by saying that I dislike most movies.  I find that the majority of movies released these days are full of plot holes, are poorly written, have no character development, and contain mediocre to bad acting.  You get the gist - i think most movies suck....but Looper is simply spectacular.  It is probably the best movie I have seen in 10 years - great concept with spectacular writing and execution.  It has everything - drama, some humor, great character development (which makes you actually care what happens), great action, suspense, cool effects.  I really can't find anything wrong with this movie, and I'm very picky when it comes to movies.  Someone else compared Looper to Terminator with the style of Inception, and that is pretty accurate.  A lot of the basic concepts are taken from Terminator (time travel, etc.), but it's definitely it's own movie.  This will go down as one of the best movies of this decade, and it's sure to be considered a Sci-Fi classic among the best of all time (Alien, Terminator, The Matrix, etc).",
      "total_reactions": 9,
      "user": "skim123"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "GREAT MOVIE, loved it superb acting and awesome story the only reason i give it a nine is the fact that it really doesnt make sense. it started off really solid but then went down hill when they implemented the multiple universe thing. so one scenario when bruce willis gets killed and one where he doesnt. this means that there are two versions of the same person. meaning that killing or maiming an alternate version of yourself would have no effect on you. so when levitt kills himself it should have not done anything to bruce willis because hes from a different time line. this is a result of the version of bruce willis who gets away when he goes back in time is tied to a different levitt. essentially bruce willis invaded a different universe. almost a polar opposite version of reality. which means he should have no coorelation to levitt. even though they are the same person they're from two different time lines so they should not tie into one another. the same goes for the guy who got dismembered he was from a different time line so he should not of started losing limbs when his younger self got cut up. think of it as two sides of a coin. BUT...i love it when a movie really makes me think and come up with this kind of conclusion. havent had this much fun with a movie since inception.",
      "total_reactions": 9,
      "user": "ThePizzaman100"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "This science-fiction action film is a surprising emotional blend of kick-ass fights and firearm killing and disturbing dystopian themes. It evokes powerful feelings of empathy and fear which is not really seen in similar genres and left me shaken as I left the screen. This made me realise",
      "total_reactions": 9,
      "user": "EssenceOfSugar"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "Wow! The most original movie I've seen since Inception. Very intelligently written! This movie is the complete opposite of most movies that come out today, which aim to please the easily entertained. You'll definitely be thinking about this movie for awhile after you see it. It's an instant classic sci-fi film, which I'll have to add to my collection for sure when it comes out on video.",
      "total_reactions": 9,
      "user": "jlplatten"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "Well first off Joseph Gordon-Levitt, does not look like Joseph Gordon-Levitt. I know, shocking.",
      "total_reactions": 9,
      "user": "silentshade"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "\"Looper\" is great, simply great! It's original, fun, well written and directed, Gordon- Levitt and Bruce Willis are awesome as the same person, it has a fast rhythm and a dynamic soundtrack, it's just fantastic!",
      "total_reactions": 9,
      "user": "mmweiss"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Anyone that has not seen this movie yet, you need to see it. This movie is an instant classic. Joseph Gordon-Levitt is amazing in it. This movie will really f**k with your mind if you like that s**t. I really rec amend this movie to everyone.",
      "total_reactions": 9,
      "user": "SloppyJoe11"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "This was a fantastic movie and I would say is a genuinely new idea to hit theaters. Without spoiling anything all I can say is that it goes beyond the average \"time-travel loop\" plot and every time it seems like it's going to follow a clichÃ (C) it veers off in a different direction. The only things I can see that people might not like are that it is much more of a psychological thriller than an action film, which the trailers make it out to be, and that there are several threads left untied at the end of the movie; while some might find these unexplained parts of the story annoying, I liked them and the fact that the movie left the viewer with some questions gave me a lot to think about after the credits. Its a hard movie to describe without spoiling, but the best way I can put it is Terminator meets Memento, with a little Donnie Darko thrown in. This is an instant classic in the science fiction genre and I absolutely recommend it.",
      "total_reactions": 9,
      "user": "MutantCreature"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 2,
      "text": "Looper is one of those films that desperately wants to be taken seriously. It tries to capture audience interest and respect in several ways -- action, inter-character and character development, even the cerebral \"nature of cause and effect\" conundrum. Unfortunately, it screws everything up and makes a royal mess. Its characters are, by and large, shallow to the point of one-dimensionality, generally merely character stereotypes rather than even photocopied archetypes. The primary anti-hero protagonist/antagonist (yep, it's that convoluted)  probably undergoes the most development, but that's due in part to the fact that he's being played by two separate actors. By and large, the performances are wooden and unconvincing, the writing stilted to the point of being hack dialogue, and the plot so full of holes that trying to sort it all out would take much more time than this film is worth. (Consider this a note to all would-be time travel story writers: whether you decide on a deterministic or non-deterministic model of causality doesn't matter as long as you are consistent. Looper? Total flop on that.) Joseph Gordon-Levitt does a reasonably good job with what the script gives him (which isn't much), and Emily Blunt turns in a rather good performance, in part because she's the only believable character in the whole mangled mess. To be totally and brutally honest, if billing on this movie were by quality of performance, Blunt should be going first; hers is the best portrayal in the film. By the same logic, Bruce Willis' unconvincing, flat, and downright uninterested performance should earn him a credit just below the lighting intern. Frankly, Willis phoned in this performance; even with the pathetic writing, he could have done much better. Jeff Daniels turns in a decent portrayal of a boss from the future sent back to run herd on the miscreants that populate the turkey of a plot. Scriptwriting was horrendous, particularly in the area of plot. The entire film was over-the-top violence and brutality. Really, with the aforementioned exceptions to the generally poor performances, the only other people in this production that deserve a true pat on the back are those responsible for generating the setting and scenery. They, at least, did a fine job in creating a dystopian, energy-starved, socially collapsed world in which to set this train wreck of a film. (It's an unfortunate thing when the setting is outshining most of the cast in quality of performance.) Given the blasting I've given this film, it's easy to wonder why I'm giving it a 2 instead of a 0. Three reasons: Gordon-Levitt, Blunt, and the scene setting crew. Everything else? Junk. Had I known now what I was getting into, I would not have gone to the theater for this. I would've waited until it hit cable...and then watched something else.",
      "total_reactions": 14,
      "user": "Oxcart"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2012
      },
      "score": 5,
      "text": "Truth to be told, I don't get why everyone thinks Looper is so great. Joseph Gordon Levitt's makeup to try to look like Bruce Willis is awful and makes him look like a wax figure and that's the smallest of Looper's problems. The premise is good but never fully explored. In the end, it just falls into the cliches of sci-fi, like the fake kid who talks like an adult. The boy who performs that character promises to become the new Nicholas Cage with his over-the-top acting. Emily Blunt is great as usual, but her character's relationship with Joseph Gordon Levitt's was terribly contrived. The villains are cardboard characters which you know are bad guys because they wear black clothes and are dumber than an Adam Sandler character. Joseph Gordon Levitt, Bruce Willis, Emily Blunt and the few action there is are what made Looper a barely passable movie.",
      "total_reactions": 14,
      "user": "Mazmorrero47"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "In the running for the best movie of the year, Looper definitely does not disappoint what the cast builds the hype up to be.  Bruce Willis a kid killer and JGL looking more bad-ass than ever, Rian Johnson uses the actors to their fullest potential.  Brilliant take on the near future down to every subtle nuance such as the solar power rigged cars and futuristic eye drop drugs.  the Idea of the film was amazing, I may of been expecting a little more out of it although i was looking for it to be one of the best movies ever when I saw the previews.. The ending threw me off but did make me think which is all you can ask for in a movie.",
      "total_reactions": 7,
      "user": "DesertEgoal"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2012
      },
      "score": 4,
      "text": "Good idea, lousy execution.  Needed a couple of more rewrites.  If you think you're getting an exciting action movie, you're not.  A depressing bloody film. Why is it that Hollywood always has the future depicted as dirty, depressing and crime-ridden? The interesting concept makes it a fair DVD rental.  Save the big movie theatre bucks for something else.",
      "total_reactions": 10,
      "user": "Spanky"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "Among the best films of 2012, Looper is ultra-violent, ultra-stylish and ultra-cool. It's bold, brave, smarter that even itself thinks, and most of all, extremely enjoyable. I wanted to see it again straight away.",
      "total_reactions": 10,
      "user": "jackstarr"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "I had great expectations for this film, not least because it showcases Joseph Gordon-Levitt who is rapidly becoming a hallmark for quality (",
      "total_reactions": 5,
      "user": "bennington13"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "Time travel stories are tricky. No matter how much you try to put it all together, there always are loose ends. As good as this Sci-fi story may be, it suffers from this problem. Einstein called this \"the time travel paradox\". While travelling in the future is concievable through time dilation, traveling in the past is an other story.",
      "total_reactions": 5,
      "user": "beladrim"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "Looper is a movie that has time travel in it, but at its core, it is a character drama, a movie about a crime and redemption.",
      "total_reactions": 5,
      "user": "broose"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2012
      },
      "score": 6,
      "text": "It's definitely not a bad movie. I see what they tried to do with all time stuff and for casual consumer it may be a lot to comprehend and it will take time to think this movie through. The thing is I watch Doctor Who a lot and I got used to all the time travel stuff and in Doctor Who this things a lot deeper and confusing. Can't rate performance of Levitt or Willis because i saw this movie in translation. As i said it's not a bad movie. In fact it may be very good but my familiarity with Doctor Who kinda ruins movie for me. It gets 6 out of 10. If it wasn't for Doctor Who this movie would probably got 8 or 9 out of 10",
      "total_reactions": 5,
      "user": "Palenoire"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "Johnson deals with the subtext with no one bothers to... Looper is so original and unique, albeit not so in delivery, it is the best sci-fi yarn in years.",
      "total_reactions": 8,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "Looper mixes mind-bending time-travel craziness, bloody action, some great hilarity and very nicely-done drama, all delivered in an astonishingly creative and original way.",
      "total_reactions": 8,
      "user": "fearless11"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "The trailer for this movie gives the wrong impression. Yes there's plenty of action and violence blended in with Sci-fi elements, but it's more than that. This is a thought-provoking, original piece of work. Sure there are some influences, the biggest one seems to be Terminator, but this is as close to original as you can get in this day in age. I would like to also put out that, as I said there's plenty of action, but the movie at some points slows down. These scenes are just characters talking but they were never boring to me, but they might be to you. Half of the movie takes place on a farm but, like I said I was never bored. I have nothing bad to say about this movie. The plot and story are rich and thought-provoking. For example: If you could go back in time to kill baby Hitler would you? The screenplay is extremely well done and thought out. Sure there are some minor flaws within the time travel aspect(I can list a few but that could potentially spoil things) but that's the case with every movie about time travel. Johnson does a terrific job at plugging in most of these holes and this is probably the best and well thought out movie about time travel. Now if time travel did exist would it be something like this? Probably not but Johnson does such a good job at explaining everything that he makes us believe it, and he never breaks his own rules. You have to really pay attention to everything or else you might miss something and get lost, sort of like Inception. This is nothing like Inception by the way so those who are comparing this movie to that one are wrong. The acting in this more is terrific, but I'm sure none of these performances will get recognition from the academy which is a dam shame. Over the past couple of years Joseph Gordon-Levitt has slowly become one of the best actors working today. His performance is amazing, his impression of Bruce Willis is spot on from his facial expressions to the way he speaks he nailed it, and even though his face is covered in prosthetics he is still able to convey emotion and act. Bruce Willis is back between Expendable Two, Moonrise Kingdom and now Looper. I hope he picks these kinds of movies in the near future. He doesn't just kick was in this movie but he also proves that he's got the chops. One scene in particular, he is crying because of the terrible thing he did and even though I hated what he did I couldn't help but feel sorry for him during that scene. You'll know when you see it. Emily Blunt is great as well, I'm surprised not that many people actually mentioned her, without her the movie wouldn't have been the same. The kid is also great, he certainly has potential. He provided some humorous scenes that the film needed. The guy who plays the main person in charge of the Looper did a great job too. There really is no hero, everyone is the antihero which was a nice change as you don't often see that in movies and just adds to the freshness. The romance between Blunt and Levitt was nice, they both displayed a nice degree of chemistry. I really liked them as a couple even though they're both terrible people(I'd mention a few other things but I don't want to ruin anything). The ending to this film is brilliant, it has a lot of deep meaning behind it even though I'm sure people hated it. There's a reason why the director did this and if only people would look at the meaning behind it. This is as perfect of a movie about time travel as you're going to get. I loved everything about it. Sure you can pick away at some of the flaws within the time travel but what's the point? Every movie about time travel has some flaws within time travel. The strong script, outstanding performances, fleshed out characters, and the rich/original plot make this the best one. Johnson did a brilliant job at closing as many of the flaws as he could. This is one of the best films of the year, it's thought-provoking and original. This movie is still on my mind and though this won't alter my life in any way,  I'm glad I got to see it.",
      "total_reactions": 8,
      "user": "Coco890"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "Definitely one of the best movies I have seen in a great while. Definitely the best movie this year so far. It contained elements of romance, action, and humor, which combined to make a fantastic movie. While starting out somewhat slow, the movie rewards viewers in later scenes by tying together loose plot points. Character development was fantastic, as Joe went from a selfish man to become a true hero, and the same goes for his older self. The older joe goes from a composed man on a quest to save his love, to a monster ready to do whatever it takes for what may not even exist anymore. I can talk about how great this movie is all day long, but my experience in the movie theater really does a better job than any analysis. As the movie ended, as the clocked ticked off the screen, the entire movie theater, a house packed full of people, were silent. The movie literally caused the entire audience to be left speechless at the end of the movie. That has never, ever, happened to me in my entire history of seeing movies. Looper was truly one of the best movies in recent memory and bar none the best movie this year.",
      "total_reactions": 8,
      "user": "domspencer01"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2012
      },
      "score": 4,
      "text": "I am writing this review 30 minutes after I saw this movie. This movie started ok, it had a few plot holes but otherwise the first third the movie went smooth. Then it was destroyed. The rest was a mix of mass confusion that didnt add up at all. It had magic 10 year olds, and became rediculous. None of the characters were connecting with me. The entire movie I was thinking, \"I dont even care what happens to these people\". The movie was funny at times, but only due to the ridiculous scenes. This movie couldve been more like Inception or The Matrix, but instead of being thought-provoking, it was a bad action movie. Definitely skip this.",
      "total_reactions": 8,
      "user": "crazywaffle124"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2012
      },
      "score": 2,
      "text": "I'm confused and a little shocked at the reviews.  I heard a rave review on NPR and so my husband and I went to see it.  We both found it boring and a mix of too many not very interesting things.  It never really made up it's mind what it wanted to be.  I should have watched the trailer first.  My advice would be to skip it.  Emily Blunt and the kid were the only redeemable features for us.",
      "total_reactions": 11,
      "user": "BritinLA"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "This was not a very good movie. I've already wasted too much of my time on it, so I won't write a lengthy review, but suffice it to say that SebDangerfield hit it on the head, it's a movie without an identity. Alternating between genre's and pace at the same time is a very BAD idea, it's one thing to intermix a thriller with a drama, but not if one scene of fast paced (and confusing) action is followed by several scenes of boring dialogue that do not satisfactorily explain many questions raised by the 'action,' or adequately explore the world around them. This could have been an interesting 'Blade Runner' style Sci-Fi Drama, however it fails in that regard, and as a Bruce Willis Action movie. First movie I've seen at or above 75 on Metacritic (user since 2006, this is being charitable, I probably could have gone with a 70 or even 65) that I've thoroughly disliked, I tried to convince myself after the film that it wasn't that bad, but that is a lie. Wasted talent, incredibly overrated.",
      "total_reactions": 14,
      "user": "Jhaft703"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "Looper is the most overrated film I've seen since Inception. (I thought Nolan's Batman trilogy and Memento were great, by the way). Not much happens in Looper, and what does follows from the stupid premise (never explained) that bodies produced by hit-style executions in a future 30 years hence cannot be buried \"then.\"  Under the circumstances, the ruthlessness, persistence and sheer number of bad guys seems unnecessary and poorly motivated. As for the action, it's is just a lot of gratuitous shoot-and-miss, chase 'em-around-some-more, try to shoot-'em-again emptiness. The fact that Looper has been rated so highly by both critics and audiences suggests that, in the era of the suburban multiplex, viewers who honed their critical faculties in the 50s and 60s have been leached from the vetting process. I'm no snob and like \"good junk,\" but Looper is just bad junk.",
      "total_reactions": 17,
      "user": "MargateExpert"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "I went, I saw, I was entertained.  I didn't go in overthinking every little thing, with some ridiculous notion that I was going to see a time travel movie and there would be no plot holes.  No time travel movie has ever done that right.  I didn't go in expecting non-stop action for two hours, either.  I felt it spent just enough time on everything - action, story and characters.  I still liked TDKR better, but this was an excellent movie.",
      "total_reactions": 12,
      "user": "Destinite"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "What an original and masterful sci fi film, the kind We've been waiting for for ages, maybe since Twelve Monkeys. Great to see Willis on form here and nailing the action genre again. From the second you start watching it you're thinking 'timeless classic.' Stick this one in the sci fi cannon without a doubt, open the gates and real her in. Prometheus is nothing compared to this. Brilliantly woven plot, great pacing, always exciting. Might be a while before we get another treat like this",
      "total_reactions": 9,
      "user": "Lambo442"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "I believe this is one of the top ten best movies of the first three years of this decade. It's very rare that a movie can be this enjoyable and exciting, have this much of an emotional impact, make a thought provoking statement, be an intelligent story throughout, and even make the viewer reflect on themselves, and question their own character. This movie does all of those things. Just about any criteria that can go into a great movie is very strong with this one. It was a very well thought out story, but it's orchestrated in the script very competently, so that every moment is able to have its full impact. From the very beginning of the movie, you're already questioning things about yourself, and that's only mild compared to the self evaluation you'll be doing towards the middle of the movie, and at the end. If you want a movie that is going to knock you out emotionally, and leave you in chills at the end, this will do it. At the same time, if you just want to be entertained, this will do the job too. This is the rare kind of movie that can be satisfying to watch no matter what mood you're in. There are times when I feel like watching a thought provoking movie, or one with a clever story, or an emotional movie, or just one that's going to entertain me. This would be a good choice for all of those moods. There are a couple of plot holes, but they are mild, and easily forgivable, when the script overall is this brilliant. The choices made by the director are also very clever, and elevate the script even further. Joseph Gordon-Levitt, Bruce Willis, and Emily Blunt all give strong performances, and add depth to their characters, and dimensions to the story overall. I'm not even worried about raising people's expectations too high. I heard great things about this movie before I saw it, and I expected it to be in contention for my favorite movie of the year, yet it still exceeded my expectations, and blew me away.",
      "total_reactions": 9,
      "user": "MichaelDN"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "I base great films on whether I am still thinking about them the next day.  I was still thinking about Looper the next day.  While I may watch something like \"The Avengers\" over and over again to go to sleep to and enjoy on a semi-regular basis, Looper is perhaps the best film so far this year (but far less re watchable as background noise while you are cooking dinner).  Superb acting, casting, and overall directing.",
      "total_reactions": 9,
      "user": "nightblade00"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "An endlessly creative mind-blowing film that captures everything right about the movie going experience. Johnson conjures up the most imaginative action/science fiction film since 'Inception.'",
      "total_reactions": 9,
      "user": "barnet42"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2013
      },
      "score": 3,
      "text": "Good movie, horrible unnecessary ending so many other possibilities that should have been explored. This movie has it's own time travel rules. I really don't know what else to say.",
      "total_reactions": 6,
      "user": "kris2fur"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "Seen Looper tonight. Does it live up to the hype? Not really, but I don't think that is the movies fault. The trailer makes you think its an action flick but its not. Its a concentrate and work out the plot and time travel paradoxes flick, however in my book thats a good thing! I didn't get the Joseph Gordon-Levitt make up as I don't think it made him look like Bruce Willis but watch out for one of the best child acting performances in recent memory. Even though I seen the main \"twist\" coming a mile off I still really liked the film. Like Inception I'm sure multiple viewings will make it even better. This is a real thinking mans Sci-Fi movie.",
      "total_reactions": 6,
      "user": "allystew"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "Outstanding movie. It also makes Bruce Willis the only actor to star in not one but two flawless time travel movies. The movie is much better than the trailers appear to indicate  the action isn't the focus, but a really deep, compelling and surprising story. I was seriously impressed with the consistency. The photography, acting, score and plot are superb as well, but the fact that the movie continues to surprise with unexpected plot twists while telling a convincing and not inane time travel story is astonishing. I wish I had seen this one in the theaters.",
      "total_reactions": 6,
      "user": "norse"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "Nice thing about this movie is that its original and overall good.I felt the movie showcased or built up certain characters that became pointless or underwhelming. lack of time travel technology and the way they cover up the fact made me feel as if they couldn't think of anything. Pacing was to slow at times, even for when they were building good parts, everything else was good for the most part.",
      "total_reactions": 6,
      "user": "Heaviermetal"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "I hate to say it, but a lot of people just didn't get Looper. Honestly, the way it was marketed made is seem like a generic action thriller, something akin to In Time. I was astonished that the main conflict to the movie was never featured in any of the previews making it a pleasant surprise. The first thing to understand is there will never be a perfect time travel movie because there is always the idea of the paradox. With that aside I found Looper to be well grounded in its logic and a thrill to watch. People complain about over wrought violence, but this movie is about the mafia so it is par for the course in any overly violent/sexual nature. It pushes the age old tradition of the dangers of crime, and the violence it can bring. Most of all it pushes the idea that we can be a totally different person in 30 years time, with different motivations and understanding. Looper is just as brilliant as Rian Johnson's other films (Brick, The Brothers Bloom), and is surprising from start to finish.",
      "total_reactions": 6,
      "user": "Cleric22"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "Intelligent. Entertaining. Unique. Violent. Emotional. Disturbing. Sentimental. I loved it. I hope it gets a nomination from the academy.",
      "total_reactions": 6,
      "user": "Greatbeallo"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "Definitely one of the best movies of 2012, and most likely the best science-fiction movie of this year. With movies such as The Dark Knight Rises and The Hunger Games, Looper still manages to shine and delivering one of the best movie experiences of the year. A must see, surprisingly good. 9/10",
      "total_reactions": 6,
      "user": "NektarN"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2013
      },
      "score": 3,
      "text": "Action thrillers generally require the willing suspension of disbelief. You have to *want* to believe that it is possible to shoot people while running, survive explosions \"just outside the fireball\", jump through windows with barely a scratch, etc. These are established patterns of the genre, and we, as an audience, have come to accept them (even though none of these are very likely). The point I am trying to make is that when you go to an action movie, you are willing to overlook a bunch of glaringly impossible stuff, and will be actively trying to accept the plot \"as-is\" without looking too close. this is why it is to jarring when a movie is so full of internal inconsistencies and the sheer number plot holes make the script look like swiss cheese. These people are professionals, and they can apparently turn any weird idea into a marketable film, which makes me question even more why they had to go with this B-plot that made the otherwise seamless visuals simply not entertain anymore. I'm not even going into the onedimensional characters that can be completely described in one short sentence each. This is an action flic after all, we have come to accept that. Haven't we?",
      "total_reactions": 6,
      "user": "upi"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "This movie could have been so much more, but unfortunately shot itself in the foot around the time after the farm house was first seen. Around 30 - 40 minutes of nothingness... but relationship building and character development.. this is not what I want to see in a Sci-Fi Thriller/ Action movie... Having said that, along with a few other irritating nuances.. I must say, stunning visuals, great acting, wonderful script.. it's a shame they let the structure go so horribly wrong.",
      "total_reactions": 6,
      "user": "Deitiesforsale"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "The movie was ok. The only problem i had is Bruce is left handed and Joseph Gordon-Levitt is right handed. Did anyone else notice that. If i had to grade the movie i would give it a C plus",
      "total_reactions": 6,
      "user": "gillette"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2012
      },
      "score": 1,
      "text": "The trailer for Looper had my attention, but the film did not. The first act of the film starts out very promising...set in 2030something a dark future underworld of crime where Loopers are paid to \"assassinate\" dudes sent back from 30 years into the future where time travel exists. Blah blah. I'm not going to spend ages writing this, because this film already owes me 2 hours of my life back. I wish everyone would stop raving on about JGL's prosthetics that are supposed to make him look more like Bruce Willis. They don't. The action is contrived, unsuspenseful, stupid and scarce. The 2nd act is boring...I could give to craps about anything that happened to any of these characters but Im forced to listen to the rubbish dialogue while this film tries to figure out what it wants to be and never does. Unimaginatively filmed, annoying subplots, too many boring characters, a child actor who is annoying and far from menacing (like he is meant to be), plot devices that are poorly used...themes that are not sufficiently explored because they are in the wrong genre of film to allow time for this to happen and actions without consequences. My biggest annoyance was how he betrayed his \"best\" friend in the first act and gets all sad and then this is never mentioned again. Don't waste your time on this mess of a film.",
      "total_reactions": 6,
      "user": "JemJem78"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "Looper was good. It wasn't great, but it was good. It was really heading in the right direction except that inconsistencies with how \"future\" works was silly. Some of the characters are pretty annoying, too. You aren't ever actually sure what characters you are supposed to \"like\" and \"dislike\". That can be good sometimes, but by how the characters were developed and built, it fails. The movie had good ideas and concepts, it just wasn't pieced together that well. It's a pretty good movie if you only look on the 'outside'. If you want it to be logical and well done science fiction, then perhaps this isn't the greatest of movies. What separates a movie like this from Moon is that it Moon is perfectly structured and has very little to nitpick at. I suggest seeing it, but don't have super high expectations. It is only a B or C level sci-fi movie. But there are boobs",
      "total_reactions": 3,
      "user": "Alaira"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "text": "This story was written by someone who does not comprehend even the basics of time travel problems and paradoxes. It is a mystery why this chaos received so high grades. The plot in short: mafia from the future sends their assassination targets into the present to be disposed of; in the present there are killers, so called loopers (organized by a sadist from the future) who await their targets and kill them. Before or later, the looper receives a mission to kill his future self. Some of them fail to do so. And then the chase begins. First of all, the premise is pretty stupid, to use such advanced technology for such mundane goal. In the movie they have explained, that in the future it is impossible to get rid of someone without being tracked. It is, as it seems, far easier to build a time machine then to avoid tracking technology from a collapsed society. Then we have a pretty horrifying (and illogical) scene of punishment for a failed looper. His present self is mutilated and his future self loses his limbs one by one. This is wrong, all his wounds have been inflicted in the past so they would appear all at once in the future. And it is unresolved if his present self has been killed or will they keep him alive for the next few decades without his limbs, until he is sent into the present. Then we have our „hero\", Joe who escapes his captors in the future, escapes his present looper-self and begins his search for a mysterious future mafia boss, the elusive „Rainmaker\", who in the future has killed his wife. Then begins a „Terminator-rip-off\". Terminator-Joe from the future does not have exact information about Rainmaker, only his date of birth and he manages to narrow his search to only three kids he will have to kill. He eliminates two targets and of course, his past self protects the real Rainmaker, the fact that it HAS TO BE KNOWN to his future self even before his trip to the past, because it is past, no matter when the audience has find out this. Then the Terminator-Joe eliminates his entire (ex-)gang and there is a showdown between him, his present-self and the Rainmaker-Kid. The situation is resolved when the present Joe kills himself and the Terminator-Joe disappears. Which would set in motion time traveling paradox: Terminator Joe does not exist so he cant be sent into the past and all his actions would be reversed. But no, all his actions in the movie remain. The Rainmaker-kid survives and he will grow up not to be mafia boss but exemplary member of future society. The end. Oh, and this Rainmaker-kid has a Carrie-like telekinetic abilities, which has nothing to do with a plot and is complete superficial. As for the pacing of the movie, it is horrible. We begin with a bang (literary), then a movie comes to a halt and we have an hour or so pure boredom (or character „development\"). Then we have a final shoot out. All in all a very bad experience, caused by a fanboy-hype. If you want to see Bruce Willis travel through time, watch „12 Monkeys\", a far superior movie in every sense.",
      "total_reactions": 3,
      "user": "TurkishCritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "This movie has an interesting premise and great actors and acting, which make up for the sometimes-lackluster action sequences. I think that if ones goes into this movie looking for simply an action movie, they will be disappointed. However, if you want something deeper: compelling characters and character development, suspense, moral dilemmas, then you will be satisfied. The film does suffer a bit at a few crucial plot points, where it's not entirely clear what happened. If you leave the theater confused, then look online for an explanation and it should make those little pieces fall into place nicely.",
      "total_reactions": 3,
      "user": "kane148"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 2,
      "text": "Looper sucked in so many ways that it's actually difficult count them all. Unlike most of the other haters, I would be willing to overlook the ridiculous plot and the inconsistencies (of which there are many), if the movie was generally well executed and entertaining.  But it's not.  The movie is amateurishly directed, poorly edited, and unevenly paced. 80% of the action scenes lack the slightest amount of tension and fall completely flat. There is not one single well-developed character in the entire film, so there's no reason to care when anything happens to any of them. The script is disjointed and back-fills plot lines to explain things after they happen.  The last two-thirds of the movie is very boring, and is chock full of clumsy, melodramatic, and just plain corny dialogue (especially between the Emily Blunt character and her \"son\"). Some of these dramatic scenes are so long and awkward that when I saw it, people in the theater were actually laughing uncomfortably, unsure of how to react. Then on top of everything else, Looper is a highly derivative mish-mash of other, much better, sci-fi movies, but doesn't even do a competent rip off job (see Inception ripping off the Matrix).  Instead, what the viewer gets treated to is a series of dumbed-down scenes and plot points from movies like 12 Monkeys, The Matrix, Blade Runner, The Fifth Element, Strange Days, and a host of others.  In the end, Looper is a smelly turd of a Movie. The only possible explanation I can offer as to why people liking this movie is that maybe we've been starved of a truly great sci-fi movie for so long, that almost anything will do at this point.  Or maybe people are just idiots.  Or both.",
      "total_reactions": 3,
      "user": "JonnyRaves"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Just like Terminator mixed with some Die Hard. It is a really good movie. A must watch for people who like action and TriStar movies should defenetly watch this!",
      "total_reactions": 3,
      "user": "Annoymous1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "This is slightly unfair, as a film itself I would give it 8 maybe, but I must give it 7 due to the consensus, the consensus is this was an amazing film, it wasn't, it was solid but wasn't awe inspiring, it was also this decades Matrix, and it wasn't, it was nowhere near Matrix, I had to be true to myself, I'd rent it before buying it",
      "total_reactions": 3,
      "user": "jkxtreme"
    },
    {
      "neg_reactions": 27,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 3,
      "text": "Looper has a fantastic start but soon collapses under a weak combination of different storylines and a somewhat random plot element that has too much contrast with the Rian Johnson's \"realistic approach\".",
      "total_reactions": 40,
      "user": "dogman25"
    },
    {
      "neg_reactions": 15,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2012
      },
      "score": 5,
      "text": "This is one of those scifi flix with a cool concept that falls flat in execution. Joseph Gordon-Levitt kills people who are sent back from the future to be executed. Complication arise when his older self (played by Bruce Willis) is sent back to be offed. This takes place in one of those futuristic worlds where much is rundown and little is neat and modern. It starts off well with some solid action and interesting dialogue, but bog down to a standstill with too much talk and not enough action. There are a few worthwhile moments, but the best performance goes to the kid.",
      "total_reactions": 22,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "Wow! An original idea comes out of Hollywood! Even though It bogged down a bit through the middle and took a weird left turn with the whole telekinesis plot line I confess I really enjoyed it. Of course its not possible to make a believable time travel movie so I suppose I shouldn't be offended by the endless paradoxes. My hat is off to Joseph Gordon-Levitt and the prosthetics folks on this one. I was totally sold that the kid from 3rd rock was the guy from blind date. Ripe with sequel potential.",
      "total_reactions": 7,
      "user": "gunnyart"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "I love Sci Fi, and like all the actors in this film, so I was looking forward to seeing it.  It was a mixed bag for me.  The film kept me interested, but turned out to be more about the telekinetic kid than anything else.  The child, played by Pierce Gagnon, is one of the best child performances I've ever seen in a film.  He is absolutely mesmerizing.  Unfortunately, the film ended up feeling more like a \"demon seed\" scary film rather than an intriguing Sci Fi film.  I did not care for the whole telekinesis angle which seemed tacked on, and there is a sex scene in the film which was ridiculous and unnecessary.  There was also inconsistencies which made no sense.  The younger looper always shot and killed the future loopers the instance they appeared, and for some unexplained reason when the older version of himself appeared he hesitated before shooting.  There was also some very slow moments throughout the film.  Not a bad film, but it won't be a Blu Ray purchase.",
      "total_reactions": 7,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "Looper was quite an enjoyable movie.  The story seemed pretty original, though a little slow in the middle.  I thought the performances of Joseph Gordon-Levitt and Emily Blunt were excellent and whoever did the make up on Joseph's face did a great job making him look quite close to a younger Bruce Willis.  I think Looper was a very good blend of a mob story and sci-fi all rolled up into a nice cozy burrito. P.S. If you want a future car just attach some solar panels and wires to the outside of your car and you will be driving a car from 2044.",
      "total_reactions": 7,
      "user": "TerKaDer"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2012
      },
      "score": 2,
      "text": "There are two aspects of Looper that cause it to be stifling: It tries too hard to be stylish and too hard to be deep. The production values are there, with the actors well cast - though, when it comes down to it Bruce Willis is cast as a character that is essentially himself in every single Die Hard, and Joseph Gordon-Levitt is cast as (and takes on the attempts at acting like) a younger Bruce Willis.",
      "total_reactions": 7,
      "user": "m3xc"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "Rarely you would find a science fiction movie these days not relying on CGI and action to draw audiences, this movie does not require both, Joseph Gordon-Levitt  and Bruce Willis pack a great performance, best science fiction movie I have watched in recent times.",
      "total_reactions": 7,
      "user": "KreativeGeek"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2012
      },
      "score": 0,
      "text": "I liked this movie way better back when it was called the Terminator.  Seriously? A movie about a time traveler coming back in time to assassinate a child who will change the future?  Gee whiz, where have I heard that before.  And then a movie where the protagonist goes back in time to watch himself get killed?  Does that sound familiar?  It should because Bruce Willis already did that one in Twelve Monkeys too.  Bruce Willis blatantly tells the audience \"Hey, don't think to hard on this time travel stuff or your head will explode.\"  What he really means is \"The writers of this movie are too lazy to worry about filling in all the plot holes, so just accept it and we can move on.\"  The action scenes seem to be added in to distract you from the terrible acting and boring dialog that drags on for the second hour of the movie.  Bruce Willis' character seems to only exist for comedic effect.",
      "total_reactions": 7,
      "user": "Kulivontot"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2012
      },
      "score": 2,
      "text": "Seeing the trailer I thought:",
      "total_reactions": 7,
      "user": "sabazuki"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 5,
      "text": "In short, this is not a bad film it is just not a very good one. The first twenty minutes of the film had me completely engorged by it's style, understated tone and intriguing if not completely original plot line. By it's second act, however, it begins to run out of steam. It becomes distracted by sub plots that are never realized and characters that lose their initial promise of depth. By the end of the film I felt like I was deprived of the breath of fresh air it could have been had it managed to focus more on its core characters, central story lines and themes. Instead it asks the audience for the all to generous courtesy of ignoring its plot holes, shallow characters and abrupt and underwhelming ending. Given the critics and audience response especially, I was mostly unimpressed. Save it for a rainy day when your Netflix queue feels stale.",
      "total_reactions": 15,
      "user": "guiffre"
    },
    {
      "neg_reactions": 25,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 0,
      "text": "I went to see this strictly based on the critic reviews. I am basically all done with reading any sort of critic reviews. The same people who invest in the movie production are the same people who own the media outlets that write the reviews. This movie sucks. I wouldn't recommend this movie if it was free on the Lifetime movie network. Hollywood is a joke, American film is a joke. Absolutely pathetic.",
      "total_reactions": 34,
      "user": "mostmoviessuck"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2012
      },
      "score": 1,
      "text": "Don't waste a minute of your time or a nickel of your money on this silly lightweight schoolboy shoot 'em up. I cannot imagine how low the bar must be for reviewers who manage to find some kind of 'artistic value' in this train wreck of a poorly plotted movie.  The worst thing about this truly terrible film may be that it takes itself so seriously...not one light moment, not one original scene, not one fresh line of dialog.  BEWARE!!!",
      "total_reactions": 12,
      "user": "franclinolin"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "How would you like to sit in a diner having steak and scrambled eggs with a version of yourself, but 30 years older, who also orders steak and scrambled eggs?  How would you like to be Bruce Willis surrounded by 20 men with guns and you kill them all but can",
      "total_reactions": 8,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2012
      },
      "score": 6,
      "text": "The overall movie is fantastic, excellent acting, special effects, and story all-around. The dissappointing ending was the only drawback, which made me subtract from the score.",
      "total_reactions": 4,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "The verdict is out. It appears if you are a troubled male enduring a violent life style, a woman from your past, or future, is likely responsible. If you want proof, look no further than this film. All major characters are deeply affected by females. Whether it's a mother, a wife, or a hooker, they all determine the destiny of the world.",
      "total_reactions": 4,
      "user": "SantiagoMAKiiNA"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "This movie could have done with a 10, although it was great it did not live up to my expectations, there were may plot and logic holes/flaws. Like with almost all time travel movies it stumbles in handling its core element (time travel logic). There was nudity which was forced. The ending was great but the addition of the TK Kid was SO STUPID. Other than these flaws the movie was great, loved the whole young BWills thing decent action the story was also commendable putting aside the time travel  logic issues.",
      "total_reactions": 4,
      "user": "Drewk"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "It's a mix of \"10\" scenes and three times as much \"6\". Worth watching--as is any film that manages to have even a minute of level ten. But, 66 critics saying 8.2? They're bonkers.",
      "total_reactions": 4,
      "user": "Weis-mueller"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Looper is the best movie I've seen in 2012 and the best of the science fiction genre. The environment shown in the movie is just perfect, holding off, the extremely unreal. The best role that has been assigned to Joseph Gordon Levit in his career.",
      "total_reactions": 4,
      "user": "Ouendaner"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "I have been waiting to see Looper for a while now & like always when a film is highly rated with many positive reviews your excitment increases day by day. I can safely say it's up there with the best sci-fi / time travelling movies, Terminator/12 Monkeys etc. I loved the story & all the cast are superb, even the little touches like Joseph Gordon-Levitt plastic face.. Cool.",
      "total_reactions": 4,
      "user": "Pjdblue"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "Attempt at cerebral sci-fi let down by endless plot holes and a feather-headed lack of logic... First the good",
      "total_reactions": 4,
      "user": "Snowdon-goat"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "The worst movie i saw this year by a long margin, not only its full of the usual nonsense about time traveling but also the whole story is a mess. I watched the movie accepting its own schizophrenic paradigms but even doing so all the remaining plot doesn't make sense, the main character is just a lunatic cliche that doesn't even know himself and act randomly without any logic, all the events, i repeat, even accepting the time traveling part that is very inconsistent on its own, are scattered without any logic leading to an end where he does the dumbest choice of the whole movie, really only for 10 years old kids or something, avoid it.",
      "total_reactions": 4,
      "user": "mess888"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "All the douches giving this anything below a 7 are a bunch of hipsters that think they're cool for disagreeing with the way time-travel is portrayed in this movie. This movie was AMAZING, not as a sci-fi movie, not as a thriller, but in the way it executed both elements seamlessly and with uniqueness. If you're going to watch this JUST for the sci-fi, then don't bother. This is a great MOVIE, one that will stay in the back of my mind for years to come",
      "total_reactions": 4,
      "user": "Patrick94"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "You either hate this movie or you are retarded. This movie has made you expect something good but it screwed you. The time traveling makes no sense at all. When in the end the main character shot himself his older version should disappear IMMEDIATELY not thinking and have a bad disappear effect. The fact that the kid was introduced at the beginning of the end and his powers were only introduced at the end with no explanation at all, makes me thing what the hell the writers were thinking. To include time travel in a movie is not new (see back to the future) but at least in that movie they explained how it was \"possible\" as you should in science-fiction. This movie did NOT! This was just a major disappointment and you will start to hate the kid and at the end he lives.",
      "total_reactions": 4,
      "user": "Gridoverflow"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2013
      },
      "score": 2,
      "text": "I joined Metacritic, as a public service, to review this movie and hopefully prevent someone else like me, who generally relies on the consensus of professional critics, from making the mistake of watching this tripe. THIS IS NOT A GOOD FILM, IN THE LEAST. Compounding the film's incoherent, inconsistent treatment of time travel -- the writer explicitly telegraphs, during one of the scenes, that the viewer need not attempt to make any sense of it -- are myriad additional (glaring) plot holes and unanswered questions. The \"development\" (such as it is) of JGL's \"character\" (such as it is) is utterly, maddeningly unbelievable. (The only way even to begin to make sense of him is as a walking mommy complex.) The penultimate action sequence is simultaneously so out-of-place and fantastic that it beggars contemplation, much less belief. And those are just the movie's three most fundamental defects; there are many, many more. It seems to me that the writer, when developing the screenplay, first conceived of the \"clever\" ending (which is actually clever only insofar as one is profoundly stoned) and then sloppily constructed a storyline to get there. I am honestly *befuddled* by the strong critical reception of this movie, *befuddled*. See also the reviews by  Oxcart, JonnyRaves, mess888, and (especially) SebDangerfield. Do not waste your time or money on this one.",
      "total_reactions": 4,
      "user": "Chad_Hill"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "Looper is just simply one of my favorite movies ever.  Excellent acting, writing...the works.  The little things in the movie make it great.  Looking for an original screenplay sci-fi?  Look no further than Looper.",
      "total_reactions": 4,
      "user": "adidaht"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "This film got snubbed during the Oscars. How in the world did this not even get nominated for Best Original Screenplay?! Seriously you cannot show me a more unique film than Looper. Very few films blow my mind but Looper succeeded in doing just that. Dark, Different, and Entertaining as hell. One of the best movies of 2012.",
      "total_reactions": 4,
      "user": "WayneThomas412"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "A great time travel movie with I think a bit of revenge flick thrown in there. The characters chemistry are perfect between the hero, the mother and the destined child and Bruce Willis is a stone cold killer, which you dislike his character from the start. It's a believable realistic future setting in which your engrossed into these people that when they get emotional or are put in a life or death situation you feel the moment so the ending was unexpected and sad, but understood the decision made with a meaningful action.",
      "total_reactions": 4,
      "user": "WalkingDead5640"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "In fact it is one of the best movies I have watched. It entertains as lots of other movies but it also gives us a very serious message to think over. www.viewforum.net/movie-stunned-me-150/looper-2012-a-3852/",
      "total_reactions": 4,
      "user": "HumptyRu"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "Looper is so much more than the Trailers let you thinking and that you would hope.This movie has everything,it explains time travel in a perfect way,and the ending is so good.The acting is superb and you really get into thinking that Joseph Gordon-Levitt is really younger Bruce Willis.Jeff Daniels and Emily Blunt do a great job also.This movie is worth seeing,I loved it and I just can't believe that I haven't seen it earlier.",
      "total_reactions": 4,
      "user": "GentM2015"
    },
    {
      "neg_reactions": 31,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 0,
      "text": "If you are a fan of high bodycount, ultra violent action movies and hopelessly dystopian visions of the future, and you don't care about silly little things like theme, or even a coherent message that teaches us something, ANYTHING about the human condition, look away. Stop reading right now. I warned you. Don't you dare thumb me down. This review is for people like me, people who like a little bit of hope and optimism in their movies, and are tired of cold blooded killers and ruthless criminals (\"with a heart!\", I can hear them saying) occupying the lead spots in supposedly intelligent, critically acclaimed (a term I have learned to take with a hefty grain of salt) movies. So, what makes this movie so bad? First of all, it doesn't have an original bone in its emaciated, cliche ridden body. If you've seen Blade Runner, or Twelve Monkeys, or even the awful remake of the awful adaption of the awful comic strip 2000 A.D., or hell, basically any movie made in the last seventy five years, you've seen Looper. People will think it's original because it's based around a mildly inventive, highly questionable gimmick- time traveling hitmen assassinating themselves- but in reality, it's blatantly, shamelessly derivative. There's even a scene where Jeff Daniel's character (Tom? Joe? Bill? Jesus? I can't even remember the guy's name) points out the movie's own fatal flaw, in which he chides JGL's drab, uninspired Hollywood wardrobe. Masterful bit of foreshadowing right there. Or perhaps a subtle jab at itself? Either way, I should have left the theater right then and there. Let's start a checklist. Why? It's fun and I'm lazy: Bleak vision of the future? Check. Exorbitantly powerful criminal empire? Check. Widespread poverty? Check. Totally ineffective/powerless government/police force? Check. Unbelievable, scientifically implausible technological advancements? Check. Low I.Q. henchmen with terrible aim, wielding nonsensical weapons (the ridiculous long barreled revolvers reminded me of the joke pistol the Joker uses in Tim Burton's \"Batman\"). Check. Drug addicted, shamelessly materialistic, callously indifferent populace? Check, check, and check. Beautiful, gentle Asian prostitute who saves the older Joe from a life of crime? Check. Faceless villain? Check. Complete lack of any likeable characters? Check. Convenient, contrived ending? Check. Sound familiar? Alright, enough checks. I'm tired, and all of this is skirting the real issue. \"Looper\" is the kind of garbage I'd expect out of a film school amateur, a kid who has yet to learn the single most important thing about storytelling: soul. As in, this movie has none. \"Looper\" left a bad taste in my mouth, and if you're anything like me, you'll be just as disgusted. Avoid at all costs.",
      "total_reactions": 40,
      "user": "gimmedatsammich"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2012
      },
      "score": 1,
      "text": "I have three words.",
      "total_reactions": 9,
      "user": "pdwlsn"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2012
      },
      "score": 0,
      "text": "I dont like this movie. its too much like bladerunner and is not original at all. It was the biggest waste of 9 dollars and two hours of my life. No one should see this movie.",
      "total_reactions": 9,
      "user": "rocklob"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "Time travel is confusing.  Once you think you may have a grasp on it and have ironed out the 'what-ifs', a new paradox will pop up and collapse your argument which was a house of cards anyways.  There are too many holes, and especially plot holes, when you try to rationally reason through what it means to travel through time and change the past.  Once time travel is invented, hasn't it always been invented then?  If you go back in time and change something, will you just disappear because your specific future no longer exists?",
      "total_reactions": 10,
      "user": "CitizenCharlie"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "This movie is a masterpiece of sci-fi cinema. Joseph Gordon-Levitt and Bruce Willis were the perfect choice of actors for the right movie. Looper is a unique and fresh film in a period of bland $200 million films.",
      "total_reactions": 5,
      "user": "Pixarlover"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "Best sci-fi I've seen since maybe Inception, although I wouldn't call Inception a strictly sci-fi film. As far as time travel movies go, which there really aren't very many of, let alone good ones, this is the best I've seen in years. As with any movie based on time-travel, you have to accept a few rules presented by the specific movie or you WILL make the film fall apart. Thankfully this film only has one major rule, and it's easy to accept and let go of your reality. It's hard to talk about the story without giving anything away but you will be very entertained. There is not a dull moment in the film's entirety and there are twists and turns throughout. The acting is fantastic (JGL is only getting better and better, and Bruce Willis is captivating as usual), the cinematography is engaging...this is a very well made and meticulously thought-out film. Definitely worth a visit to the cinema to see it on the big screen, and if not, absolutely worth a rental or even a place on your shelf in your collection.",
      "total_reactions": 5,
      "user": "thesaxmaniac"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "I thought this was a pretty bad movie overall.  Everything is derivative of stuff you've seen before, and even if this is deliberate, the riffing on familiar themes and plot points isn't clever enough to hold your interest.",
      "total_reactions": 5,
      "user": "jon44"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "If you're looking for something thrilling yet thought provoking, go no further, Looper has arrived. Rian Johnson's Looper is a bold, wholly original genre film that delves into the fabric of time travel like you hardly get see these days. The high concept story line of a man's future-self on the loose after failing to 'get rid of him' is only the tip of the iceberg. Whats left is a dizzying tale of crime, time alteration and most interestingly, parenthood, that twists and turns the audience like an intelligent thriller should. The deceptive direction may not satisfy all, but it kept the intrigue on high.The principal cast was very good, and it's also good to see Bruce Willis on form this year. Filmed with much style and edited with clockwork precision; I highly recommend this to movie-goers.",
      "total_reactions": 5,
      "user": "lahaine2012"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "I loved this movie. It has an original take on a dirty future that does not require old blade runner sets remade. It handles the time travel stuff perfect. Not to mention it has Bruce Willis and a some machine guns, what is not to like.",
      "total_reactions": 5,
      "user": "analogkid280"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "Best movie I've seen in a long time. Genius plot, awesome actors and great cinematography. Definitely the best movie of the year. I really was excited when I saw the trailer, but I didn' t expect to have been as surpised as I became.",
      "total_reactions": 5,
      "user": "makister"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "Looper is a movie that epitomizes how an ending can make or break a story. Looper is the complete and utter opposite of what we saw happen with the Mass Effect franchise. Whereas the ME series was fantastic up until the last 10 minutes of ME3, I found Looper to be \"just okay\" up until the last 10 minutes - and then it blew my freakin' mind. Without getting \"spoily,\" I will be completely honest - I almost walked out on Looper about 45 minutes in. Why? I have a personal problem with disturbing/graphic violence. I'm very sensitive and have trouble dealing with certain kinds of violence (not so much guns and shooting, but the kind of violence that haunts the imagination). The first 45 minutes or so has a LOT of that. There were parts I couldn't watch, while there were other parts I COULD watch but freaked the hell out of me (hint to people who have seen the movie: Old Seth. I can't get it out of my mind). However, when the movie gets to the point where we're introduced to the young version of the Rainmaker, I decided to stay - and I'm glad I did. Whereas the Mass Effect ending completely ruined the franchise for me, the ending of Looper completely redeemed the convoluted blood bath that went before. My initial thought when the credits rolled: \"I hated it - and it blew my freakin' mind.\" My feelings about the movie as a whole are mixed. I admit my bias against graphic violence plays a huge role in these mixed feelings, so I will put all of that aside and say that the premise is fantastic, the acting is superb (the kid in this movie was outstanding) and DESPITE the violence, the story of this movie is well-written and mind-blowing. It reminded me of the original Terminator movie (one of my favourite movies of all time). I probably won't watch it again because of my sensitivity to violence, but for those of you who can deal with it, it's a story that's both touching and profound will leave your jaw hanging open when the credits roll.",
      "total_reactions": 5,
      "user": "Marmalade"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "I absolutely loved it. This is a great movie. Performances, direction, script: all are top notch. Not as much action as the trailer makes out but it doesn't matter because it's a proper, intelligent sci-fi movie. Makes a nice change from all the empty spectacle of most blockbuster films these days",
      "total_reactions": 5,
      "user": "thebaldavenger"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "Rian Johnson's latest sci-fi drama is an absolute joy to watch; not just as a well executed non-linear narrative but also as a deeply resonant love story operating on two separate plains: the past and the future. Juggling this complex series of events and organising them into a story that makes sense - let alone functions at all - is an achievement not to be snarked at. The credit truly has to go to Johnson as both writer and director, as well as sterling performances from both Joseph Gordon-Levitt and Bruce Willis, supplemented nicely with the work of Jeff Daniels and Emily Blunt.",
      "total_reactions": 5,
      "user": "YanYan1990"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "A wonderful, and heartbreaking, film.  Definitely see it!  A fascinating contrast between youth and wisdom gained.  Superb.  Fantastic acting all around.",
      "total_reactions": 5,
      "user": "zergflesh"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Looper takes an tremendously silly concept and tries to ask some big questions with it, which unfortunately does not work at all. However, it manages to set up a compelling conflict that avoids standard \"good guy, bad guy\" fare for something much more complex, resulting in a very good thriller where you can easily forget about all the philosophy and just watch the players make their moves. It provided me with the rare experience of watching a Hollywood film and truly wondering what's going to happen next, because there wasn't any obvious happy end in sight. Add some great acting (with the exception of Bruce Willis, who, as always, plays Bruce Willis and matches Kristen Steward in his range of facial expressions), and the fact that it doesn't rely on CGI and explosions to keep you excited, and you end up with a surprisingly solid experience.",
      "total_reactions": 5,
      "user": "Bestpony"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 0,
      "text": "What happened to cinema, Looper is a terrible film, reasons are 1. shaky cam 2. baby being shot 3. poor writing 4. not believable. Joespeh gordon levitt really gave a poor performance as well as the others. The best scenein the film was the credits, everything was so off. It was unwacthble, do not see this, my nan approved this message.",
      "total_reactions": 16,
      "user": "WhySoSerious008"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2012
      },
      "score": 0,
      "text": "What bothers me about this movie isn't that it's stupid.  It's that so many stupid people are calling it \"smart\".  Right, so the Mob has time-machine technology.  But instead of using it to, say, send them back football scores or manipulate the stock market, they use it to get rid of bodies.  Right, that makes ALL KINDS of sense.  Oh, and instead of just using the time machine (which would obviously have to also be a \"space\" machine, since the planet is constantly moving) to dump the bodies into the ocean, or a volcano, or outer space, they hire people in our time to kill them.  *sigh*  If you think this movie is \"smart\" or \"clever\" or any of the other terms currently being used to describe it, it's because you yourself are an idiot.",
      "total_reactions": 12,
      "user": "Mavent"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "The first half of the film is extremely stylish and ambitious, but the second half just gets far too narrow in plot.  There are a host of really nice time travel touches, but nothing that wasn't already covered with aplomb in Bill & Ted's Bogus Journey.  I give the film credit for attempting to go big with the attempt.  Again, the story of the boy is really interesting, but I expected a grander path for the film after the first hour or so.  It's great to see Piper Perabo in a slightly racier role than her Covert Affairs persona.",
      "total_reactions": 6,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "Basically unwatchable. I really do not understand why Joseph Gordon-Levitt is being heralded as the new Hollywood superstar. There is absolutely nothing that makes you want to see him, in any role. He is short, ugly, has absolutely no charisma, and is as boring as hell. Well, hell is probably a lot more interesting. Bruce Willis at least attempts to spice this movie up, but even he cannot do it. When trained killers miss him time and again, at point blank range, the entire premise becomes nothing but utterly ridiculous.",
      "total_reactions": 6,
      "user": "Nazgulero"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 1,
      "text": "No one was looking forward to this movie more than me.  I love science fiction, Bruce Willis and especially time travel.  So let me get to the nitty gritty.  There is no time travel to see nor any glimpse of futuristic life.  So get that out of the way immediately.  Secondly, the writing for this script is as lame as anything you will ever see.  The plot hole is so obvious that you could drive a Mack truck thru it.  This is blood and gore shoot em movie in which you feel nothing for any character.  Th ending is predicatble.  Just awful.",
      "total_reactions": 15,
      "user": "fantasy"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "text": "if garfield was sent back in time to past garfield to kill future garfield i bet they would have both eaten lasagna but that did not happen    0/100000 DONT BOTHER WATCHING",
      "total_reactions": 9,
      "user": "psyprbsfan1"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2012
      },
      "score": 0,
      "text": "Apparently the method of time travel movies is to show the same scene over and over again to see if the outcome can be changed.  The effect is numbing.  J. Gordon Leavitt is talented, but he is gotten up to look like Keanu Reeves and acts accordingly. Bruce Willis has only his smirk left.   I lasted a bit less than an hour.",
      "total_reactions": 10,
      "user": "amboy"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 4,
      "text": "Disappointing. Great opening, great ending... yet half way through it turns into a boring talk festival for 50 minutes until the action starts up again. I feel sorry for the actors because the action stalls and you stop seeing the characters on the screen but actors reciting their lines. I couldn't figure out why so many film critics love this movie unless the script idea reminds them of what they would have written in school. It is a great idea but the execution seems like something out of a studio committee. The cinematography and editing is straight out of the 80s. I can not recommend it even though the trailer is fanstatic.",
      "total_reactions": 12,
      "user": "nameless"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "THERE IS A SPOILER IN HERE! I FEEL, THOUGH, THAT IT IS VERY IMPORTANT TO ADDRESS IT!What garbage! The previews were very vague and now I see why. If the previews showed that Willis's character was going around shooting up children then I'd say it would get no views at all. Getting through the first 15 minutes was a chore, then the nude girls started showing up. Time to fast forward a scene or two. Then it starts to get interesting as Willis and Levitt meet up in current time. Well, more interesting than it was. Then Willis's character starts to kill children (with what all is going on today who thought it was a good idea to glamorize this idea???). That would have warranted an instant shut of, but it left me so dark that I had to fast forward to the end to get some closure to the movie, where I saw another child get shot in the face. Even though the movie ends with a little closure concerning the situation it wasn't enough, and afterward I had to watch a comedy just to shake the bad energy. The plot was crap, barely coherent in any way, and if you're paying attention even in the slightest you'll pick up on a major hole that should ruin the whole movie anyway. Absolutely a ZERO in every way. Willis and Levitt should be more careful of the movie roles they chose. Sometimes your character choice leaves a bad impression on your fans. My verdict: craptacular, absolutely avoid this move.",
      "total_reactions": 13,
      "user": "kingdomboost"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Thank god that the National Board of Review seems to have common sense still with giving \"Looper\" the Best Original Screenplay award. This film is AMAZING. It is a \"Inception 2.0\" of sorts, but even more action-packed. Is that the possible downfall of it in the awards circuit? Maybe. I'll admit, I've been rather limited in my 2012 film watching (so far), but this has been my second favourite film of the year (right after \"Argo\"). The screenplay, as noted, is extremely well done with an intelligent idea and exceedingly good dialogue. Bruce Willis is great in action films, and he does the same here. Ms Blunt is a great actress and she keeps her head high with this performance. The best, however, is the work of the makeup department and Mr Gordon-Levitt. Wow. That was a great and totally out-of-character performance for his usual self. Finally, I can see him as a serious actor. So, what more does one need than a great screenplay and great cast? Technical aspects? Those are covered too. It's just a good film. No. It's a great film. There is no way about it. One of the best of the year.",
      "total_reactions": 2,
      "user": "smijatov"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "i enjoyed it, enternaning and bruce is a little diferent in this one, well there are some crazy effects and even my girlfriend likeed it.  i find myself at a loss of words so that means i cant remember too much about it",
      "total_reactions": 1,
      "user": "mau1133"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2013
      },
      "score": 3,
      "text": "Kudos to Rian Johnson for a creative and tricky screenplay, but the problem with Looper is that's all there is to the movie.  The pacing is agonizingly slow, the performances are uninspired and there is little for viewers to grasp onto in order to connect with the film.  There are lots of ideas but nothing to really think about.  Perhaps a different director would have yielded more satisfying results.",
      "total_reactions": 1,
      "user": "BKM"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2012
      },
      "score": 6,
      "text": "Looper was interesting, but not for so long. The concept of time traveling and the Loopers killing waste from the future seemed incredibly intriguing. But the problem is that the movie shifts from those ideals into a more standard type of movie. So the first half is fast paced and explains the concept in majestic ways, but then the second half deviates and almost completely forgets it. Its still an entertaining movie thanks to some very good acting and great direction, but the shifts in genre from action to slow drama kills what it could have been. It had the potential to be the next Inception, but the thing is that Inception never abandoned its unique concept the way Looper does. Looper feels like it lacks identity, but at the same time given what it does right, it also feels intriguing when compared to most of the movies that come everyday. Its a recommendable movie, but also disappointing nonetheless.",
      "total_reactions": 3,
      "user": "Gilberto"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "A refreshing approach to the overly tired action genre. The film achieved many things right, but what really shines is by far the script. When is Looper 2 coming out?",
      "total_reactions": 2,
      "user": "Pier"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "I think this is on par with Source Code and Moon (and maybe even Twelve Monkeys) as story-driven scifi that could probably bear several watchings over the years. It's a fine addition to the canon of fine scifi movies.",
      "total_reactions": 2,
      "user": "JUIKER"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "The first half was much better than the second half. Once Willis arrives and we got to the farmhouse, I knew how the movie was going to end. The first part about the concept of looters was intriguing but could have used a little more \"Blade Runner\" styling. The second half degenerated into the Terminator again and was quite predictable. The film should have been focused on the unseen future instead of dragging back into the present. Daniels' character could have been expanded as well. A seven is the most I can rate this one.",
      "total_reactions": 1,
      "user": "JamesL"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "Looper is a great sci-fi thriller with an intense and intriguing story. It has good characters and visuals while using time travel in interesting ways. The third act has a shift in pace and story. In my opinion it felt a little disjointed and less interesting compared to the first two-thirds of the film. Never-the-less, it is a great experience.",
      "total_reactions": 3,
      "user": "Sacrifice"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Tried to read some negative reviews, and is it a joke? \"This movie is bad, because this scene is bad, plot is bad, acting is poor, actors are awful... blah-blah-blah\". Are you all 15-years old? The only thing I didn't like, is that plot is a bit dense for 2 hours, looks like writer had too many things to discuss and had to make it short..",
      "total_reactions": 4,
      "user": "Digitalkid"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "Rian Johnson wrote delicious script for this movie.  It's inventive, original, and unpredictable (but with plenty of foreshadowing to properly prepare the audience).  When you consider just how many movies recently are sequels and remakes, and the few that aren't are adapted from popular books, its surprising that hollywood managed to produce a movie this interesting.  I don't give a 10/10 to anything, but there literally was not one thing I hated about this movie.  Some \"comic book guy\" (\"worst movie evar\") types are unable to accept some of the fictional elements in the story, but that's their loss.  I would dare any of them to write a script 10% as good as Johnson's.",
      "total_reactions": 2,
      "user": "Bitter_Boy"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "I've pondered over this film for a few days and i still have yet to come up with a legitemate flaw. This was a great film. From the acting by the new superstar Gordon-Levitt, to the engaging and genius story, to the beautiful cgi. I just had 2 minor flaws. It got a little bit boring a few times throughout the film but it was recovered quickly each time and it seemed a bit overly long but when you think about it there really wasn't a scene you could take out so i'll give Looper a 9.5/10. This is definitely the biggest surprise of 2012 for me, i didn't expect much from this film. I just expected another dumb time-travel involved film, but this one actually had an amazing plot that was near perfectly executed.",
      "total_reactions": 3,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "Brilliant, unique and disturbing, with a lot of unexpected twists and turns. Looper is far from your typical generic time travel movie and is one of those rare science fiction futuristic movies that will tug on your emotions. Emily Blunt and Joseph Gordon Levitt deliver brilliant performances and the child actor who plays Blunt's son is a scene stealer. Easily the best movie I've watched this year.",
      "total_reactions": 2,
      "user": "Dobby"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2012
      },
      "score": 6,
      "text": "Good, definitely not this years Matrix, but enjoyable. TK bits seem added on to get an explanation that isn't very satisfactory. Remember there are two ways to close your loop!",
      "total_reactions": 2,
      "user": "eiskrap"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "I enjoyed this film, to an extent. It's very clever, and it's refreshing to watch a film that doesn't treat its audience like idiots that need everything explained to them. The premise is interesting and the 3 lead characters give strong performances, particularly Emily Blunt.",
      "total_reactions": 1,
      "user": "DukeJon"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "I went to go see this movie on a whim. I'm not generally a fan of time-travel. However, Looper does incredibly well to keep the time-travel gimmick, while also being a generally good film. It keeps a steady, and never disappointing, pace throughout the film. It doesn't try too hard to explain the science behind the time travel or in what way it works. It just flat out shows you what happens. Which is better than being given five minutes of screen-time for some poorly articulated explanation for the mechanism of time-travel.",
      "total_reactions": 3,
      "user": "Rechiau"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2012
      },
      "score": 3,
      "text": "Slightly Interesting story - a bit confused at times mixing too much diverse sci-fi into the same story. Good acting and direction. HORRIBLE violence -- its way to excessive and gory at times and un-necessarily so. It makes Tarentino look like a sissy. And that's not easy to do, neither is it a good thing to achieve.",
      "total_reactions": 2,
      "user": "Vulcan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "\"Looper\" is a refreshing action thriller that shines from a original and clever script, clean cinematography, and skilled acting from both Bruce Willis and Joseph Gordon-Levitt. It's definitely a one-of-its-kind movie.",
      "total_reactions": 1,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2013
      },
      "score": 2,
      "text": "The problem with this movie is, that it tries to be taken as a serious piece of work. But fails, becasue of the many loop holes in the plot. On the positve side, the cast did a great job. But that wasnt enough, to save this movie.",
      "total_reactions": 2,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Top of the line popcorn entertainment. Acting is good, plot holds a few surprises and most importantly the pace of the movie keeps you from looking at errors in the plotline due to the element of timetravel.",
      "total_reactions": 2,
      "user": "DeSelle"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "What a film. I did not expect this to be as good as it was. This is not a film for lovers of light-hearted films: it is a very dark one-of-a-kind experience. The problem is that I'm writing this review quite a long time after having seen the film; so I apologize for anything that I put wrong or not quite right. This is not a film about time travel as such; as time travel has been invented in the future, and it is used to send criminals back in time to be exterminated, when upon yourself arrives to be exterminated, you must do so, or you will suffer the consequences (as someone did in a very gruesome way during the opening of the movie). That is the premise of the plot in its simplest form. When (I forget the main character's name, sorry) arrives to be killed by himself, all hell breaks loose. The complicated (yet simple) storyline is handled masterfully, not leading to any confusing moments during the whole run-time of the picture. The acting is also ace, Bruce Willis providing everything you'd want from him in role such as this, and Joseph Gordon Levitt being the perfect anti-hero. The camerawork is mind-boggingly fantastic, although perhaps a tad hard to watch at times. This is a dark, unnerving sci-fi film that provides a very smart, witty and surprise of a gem that I don't think anyone was expecting. Not for kids, Looper wins the award of the most surprising film of the year (in a great way). 92/100.",
      "total_reactions": 2,
      "user": "Happymonk"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "Such a surprising cinematic experience. I was apprehensive before watching because most movies dealing with time travel completely butcher it and make the movie seem more silly than anything. Thankfully, Looper did a very good job with it. They didn't try to explain anything about the science of it, which I was fine with, but I felt that they nailed the concept. Joseph Gordon-Levitt did an amazing job, not only acting but as portraying a young Bruce Willis. Obviously the make-up department deserves credit for the look but JGL mastered all of the mannerisms and the style of talking. Very impressive performance on his behalf. And I love Emily Blunt so her being in the film is a nice bonus, plus it's nice to see her take on a slightly different role from her typical typecast. The only negative in the film, in my opinion, was the telekinesis element. I thought it was a really silly aspect of the film and didn't need to be in there at all. The Rainmaker, could've easily been portrayed to be a genius child, not a borderline superhuman. That's really the only part of the film that was mediocre. Looper is definitely a movie that I think most people would enjoy. Some will probably find it challenging to follow but those that follow it well will surely consider it entertaining.",
      "total_reactions": 2,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "Good movie and easily one of the best of the year, Looper does a good job of avoiding some of the usual trappings that time-travel movies fall into nowadays. I love the idea that is glosses over most of the explanation of why time travel works in this movie and just focuses on the story between Levitt and Willis, even if they aren't on screen together for the vast majority of the movie. I love how this movie takes a played out concept and puts a nice, original spin on it for the audience. I can see why this movie might turn off some people with a few things here and there, but I personally loved this movie. The only problem I have is that I didn't get to see it soon enough.",
      "total_reactions": 3,
      "user": "Kenmei"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "Looper -- well scripted. It has a very logical and believable sci-fi. My only problem is that Joseph Levitt-Gordon and Bruce Willis are just not from the same mold. Poor casting there.",
      "total_reactions": 3,
      "user": "marioping"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "Good movie, coherent, plot-twisting, and with well written characters. This said, I thought there would be more science fiction and a little more broader view. It made me think of \"12 Monkeys\", which had the same scale: one city, max. 10 depicted characters, and surprising ending. To sum up, very engaging, despite the flaws.",
      "total_reactions": 2,
      "user": "JudgeHolden"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2012
      },
      "score": 6,
      "text": "Rian Johnson",
      "total_reactions": 2,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "I have to agree that",
      "total_reactions": 3,
      "user": "akb_r"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "Decent enough story but this still doesn't make time travel believable, not sure that can ever be done  the plausibility of it, that is. But I'm pretty sure people just appearing and disappearing isn't how it'll look. Same kind of thing with telekinesis, let alone being exhibited by a 10 yo kid. The quality of this movie is like a very good steak served with ketchup as sauce.",
      "total_reactions": 3,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "A time Travel Movie that is fresh and finely acted without getting overly complicated. Levitt and Willis do great work here as well does the rest of the cast. I just wish more movies likes this would get made.",
      "total_reactions": 2,
      "user": "clasher101"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "It's a thrilling piece of futuristic mayhem! An original and mind-blowing creation from newcomer Rian Johnson. Unfortunately, several of its performances fell short of the film's brilliance.",
      "total_reactions": 2,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "I dont usually say this but WHY are you reading this? Go out and watch this NOW. Brilliant acting, a brilliant plot where everything clicks and excellent sequences - Looper is my favourite film of the year alongside Dark Knight Rises. And it beats the hell out of The Avengers. There are minor loopholes if you think hard enough but overall, its as enjoyable as Inception and definitely, a well-rounded film on an intriguing premise. A movie with the brains and passion that you will definitely enjoy. If you love Inception, you'll love this film. It makes you think and gives you a satisfying conclusion.",
      "total_reactions": 2,
      "user": "aznassassin"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 2,
      "text": "Looper is a movie that has an interesting story to some degree but from the mindless action scenes to the and incoherent editing, Looper fails miserably like Bruce Willis's acting.",
      "total_reactions": 4,
      "user": "csw12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "Excellent movie. The cast is fantastic, Joseph Gordon-Levitt especially and the story is a real mind twister. I liked how the future is shown almost similar to the present with only details showing us that not everything is the same. However it takes some time to tie all threads into one, but once you get the point than the story fully mesmerizes you. I was also surprised with the force little Pierce Gagnon played his very demanding part.",
      "total_reactions": 2,
      "user": "Tara61"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "A rarity for me, a very fun sci-fi movie that I enjoyed immensely. Why? Because this is a character and story driven science fiction film. We really grow to care about these characters in one sense or another, and the story keeps us guessing and intrigued right up to the emotional ending. Most of the problems that I have read about this movie revolve around the time travel dynamics or how the story slows in it's second half. I disagree on both counts. First I want to say that Johnson does have some obvious rules for time travel that he is following throughout this film, but I admire how he knows that if you think about time travel long enough you will find holes in any story involving something that both doesn't exist and is implausible in the real world. I love the scene where Johnson gives a wink to this idea by having Willis's character tell Levitt's, \" I don't want to talk about time travel because we would be here all day.\" I also disagree that the film slows in the second half. I feel that the scenes at the farm are among the best in the movie, also Willis's character goes to some bad places which gets us to the more than satisfying ending. I have two issues with this movie and they probably keep this from being an all time classic science fiction movie for me. One is Levitt's performance. This is an actor that I normally like so I am going to believe that his poor performance is due to the prosthetic that were used to transform his face. Most will probably disagree with me about his performance, but I feel he is outmatched in almost every scene he shares with the other players in this movie. My second issue are the action sequences. If there is one reason for me not enjoying most action films anymore it is the implausibility of the gun fight, and Looper is no exception. I am infinitely tired of trained killers who can kill with professional precision suddenly becoming incapable of firing straight when they are shooting at a movies protagonist. This is probably nitpicking but I would rather not see the action at all than be taken out of the movie in this way. Overall this is a highly enjoyable, unique science fiction film.",
      "total_reactions": 2,
      "user": "seancriswell"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "Looper is my favorite movie of the year. I got the blu ray the day it was released and watched it immediately. I find the self inclosed story (with no need for sequels or prequels) to be very refreshing in a genre populated by franchises. While I avoided the movie in theaters for some time, after hearing about how good it actually was I went to see it and was blow away. Part of this is most likely because my expectations were not great. The idea of the mob using time travel didn't seem plausible. I think a bigger organization than the mob would be required to harness and use a power as awesome as time travel. How about a government conspiracy with CIA agents instead of criminals? Regardless of that fatal flaw the world created by writer director Rian Johnson is flawless. He brought a skeptical viewer (myself) to an adoring viewer in less than 10 minutes.",
      "total_reactions": 2,
      "user": "metaxeno"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "A well constructed story-driven scifi film that doesn't hit you over the head with explanations about causality but just works with the already well established (mainly by Back to the Future I guess) hollywood time-travel ruleset. Levitt plays a younger Bruce Willis and does so very well but his 'altered' appearance does take some getting used too. One of the better films of 2012 and certainly a recommended watch!",
      "total_reactions": 2,
      "user": "Apemonkey666"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "The summer brought us many blockbusters, The Avengers, Men in Black 3, Prometheus, the Amazing Spider-Man, and the Dark Knight Rises. It was a successful summer overall, but the fall season is where the Oscar contenders come out, and with that, I have Looper, which is the first fall movie of the year that looks like it can contend with the heavy weights. The story takes place in the year 2044,",
      "total_reactions": 3,
      "user": "Tbrown15"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "First of all, let me take a moment to praise outstanding work done by the director and writer of this movie, Rian Johnson. I have watched a lot of science-fiction films that incorporate the elements of time travel and in the beginning, this movie seems like any other typical science-fiction film but it has a lot of surprises, the amount of creativity that has been put in the making of this film. Looper is a remarkable and beautiful film, with astounding performances by Joseph Gordon-Levitt (Young Joe Simmons), Bruce Willis (Old Joe Simmons), Emily Blunt (Sara Rollins) and Pierce Gagnon (Sara",
      "total_reactions": 2,
      "user": "theahsanhaseeb"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Looper seems to suffer from over-expectation, going by some reviews. Heavily pushed as the \"new matrix\", I struggled to find the similarity to the Keanu Action-blockbuster. Sure, Looper is a high-concept movie but its much smaller in scale and focus - and all the better for it. There's action but its quite spaced out and rarely the showstopper that a film like the Matrix would require. Instead we get a very good turn from JGL playing his character like a young Bruce Willis. When it works, its fantastic although sometimes the eyebrows seemed a bit too much. Willis himself is great as the reluctant assassin and the two play off each other well in their scene together. The rest of the cast work well, although I would have liked a bit more of Jeff Daniels. But sometimes its better to be left wanting more. Overall though, Looper is a nice bit of sci-fi but not the picture some will be expecting. The script can feel a little clunky but its got enough nuance to carry through to the ending which, while some hated it, I quite enjoyed.",
      "total_reactions": 2,
      "user": "reddave2"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Looper is a really good movie! Great special effects and a great story. The best thing about Looper is that it perfectly mixes story and action making it a must see! I'd highly recommend it to anyone so long as they don't have an extreme hate of the Sci-fi genre!",
      "total_reactions": 2,
      "user": "moonman1994"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "One of the masterpieces of the science fiction, where we appreciate good theories abiut the future and the mafias of the future.",
      "total_reactions": 2,
      "user": "LucasSC"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "A good sci-fi story done with finesse. Watch Joseph Gordon-Levitt closely. He may not \"look\" like a younger Bruce Willis, but he has his familiar mannerisms and speech down: especially in a sit-down with a crime boss. For the most part, the story takes some unexpected turns but doesn't hold up in the ending, which is telegraphed in advance. Too bad, because this had the makings of a classic. Still, the acting and direction elevate this to a must-see of Fall films.",
      "total_reactions": 2,
      "user": "JohnnyC"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "Not the New Star Wars or Matrix. More the New Logans Run. Very good smart sci-fi, it did get perilously close to being slow towards the end but saved itself. Also for a sci-fi timetravel film the narrative held together quite nicely without masses of plot holes.",
      "total_reactions": 2,
      "user": "JDFreeman001"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "It doesn't meet my expectations. But, nonetheless, Looper is a smart, unique, and well written film that ranks high above other movies in the same genre.",
      "total_reactions": 3,
      "user": "ScreenShade"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "I found it to be an overall good movie, best of its genre i have seen in a long time. It developed the story very well and increased its intensity as it went. 9/10-9.5/10 is exactly what it deserves.",
      "total_reactions": 3,
      "user": "Samtheseal"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "Best movies I've seen in this year is Looper and batman the dark knight rises  ,my all time favorite movie's are  The Godfather (1972) .Taxi Driver (1976).  Carrie (1976). Scarface (1983). GoodFellas (1990) . Raging Bull (1980) .Casino (1995) there masterpiece movies, what i don't like are the silly remakes why a new carrie movie ? this is the 4th movie carrie the made it's just stupid ,Sissy Spacek and Piper Laurie are absolutely perfect ,they both got Oscar nominations out of it, for God sake!",
      "total_reactions": 3,
      "user": "Dollis"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Joseph Gordon-Levitt and Bruce Willis are gripping in the movie Looper.",
      "total_reactions": 2,
      "user": "dante_finn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "Good point but have neglected entertainment.",
      "total_reactions": 1,
      "user": "raulpc"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Rian Johnson takes you from this world and pulls into the world of Looper. Johnson's films are unlike those of other filmmakers, because they are  so surreal.",
      "total_reactions": 2,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Okay, to be honest, \"Looper\" has earned the medal for the great plot and innovative ideas. The only thing that was not right was the action and bad guys' motivations. I see that the movie has its meaning, and it is really good, very interesting to see; however, the action was not quite as I was hoping it to be. Moreover, if the bad old dude that trained Joe got killed pretty easy... But still, there's a reason for that and I understand: the movie just simply circles around Joseph and Willis and the boy (the \"Rain Maker\"). In short, the movie is a lil' bit overrated when talking about the action aspect, but it deserves a 5-star rating over the meaning. Good movie.",
      "total_reactions": 2,
      "user": "Canotic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "This is one of the best movies this year along with a few others. It is very dark and evil especially all the children, the rainmaker and Bruce Willis character killing the children. I enjoyed the movie but some people might find it confusing, if you get most confusing movie then you will get this but if you don`t you won`t. Its a great movie and i would recommend it to anyone.",
      "total_reactions": 2,
      "user": "cesarone102"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Pretty cool little movie. Most importantly it doesn't try to be anything its not. Its not really philosophical, its not not even overloaded on special effects. Its a story, a real good story with decent acting. In the end it was entertaining, which is exactly why I go to movies. One note, this movie gets extra points because it has Jeff Daniels as a bad guy...very cool.",
      "total_reactions": 2,
      "user": "Oroiael"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "This is a thrill ride and a joy to watch up to the end. It keeps you glued to your chair the whole time until the plot unfolds and a shocking end reveals itself!!!!",
      "total_reactions": 2,
      "user": "CritictheBomb"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "Pretty good, but not as good as I thought.  I thought this was going to be some futuristic science fiction movie, but it barely classifies as this.  The acting and characters are good, my main issue though is the plot.  I was expecting a bind boggling journey into 2 futures, instead half the movie just takes place on a farm.    There is less to do with science/future here, and more to do with magic.  Yes, magic....and this is where the movie falls flat.  There is this child called the rainmaker who has a telekenetic ability to manipulate gravity or something....essentially he can kill people with his thoughts.  Its not so much I have an issue with that the story focuses too heavily on this kids magic abilities rather than the science/future/time travel aspect...the problem lies with that the movie doesnt bother to explain how or why this magic is possible.  It also shows a brief portion in the future, where it appears that this future child rainmaker is killing a bunch of people and destroying a city...I wanted so bad to see that and have it be part of the movie!  So half of the movie's cool futurustic, post depression society, and time traveling complexes ideas are stolen by this little boy and his magic abilities.  Nothing is done to explain why this kid has magic abilities, and right when you think that this focus is going to pay off(by showing the kid in the future, destroying a city and killing millions of people), it doesnt....it just shows someone reading a number(boys birthdate) to Bruce Willis for no reason before he dies....Well it just happens bruce willis goes back in time so he can kill this boy, but the reader of the number didnt know that....and this is where this movie suffers in scenes like this....it fails to explain or identify reasons, which is usually fine, but in this movie YOU really want to know the reasons.  Overall You are left dissapointed and wanting more from only certain segments of the movie.  It sucks you in by building suspense to show something spectacular are cool, but it only follows through half the time.  It is a good movie, it is just that if certain ideas or scenes were extended or elaborated upon this would have been a perfect movie.",
      "total_reactions": 1,
      "user": "TheJeffness"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "It's not every day you see a irresistible trailer and it surpasses your lofty expectations. A highly ambitious undertaking by director Rian Johnson who masterfully executes and delivers on all fronts. In the year 2044, the US economy collapses giving way to widespread organized crime. In 2074, time travel is invented but immediately prohibited. Because of advanced tracking systems in place, disposing of murder victims isn't possible, which in turn creates a \"new\" market and profession. Hence \"Looper.\" Tilted camera angles, upside-down shots, super slow-motion; Johnson toys with experimental cinematography with formidable results. A fantastic time travel sci-fi thriller that is firmly character based, and not just solely relying on special effects or time travel. Rian's directing art house style is evident but it's also blended with some mainstream elements not seen much in previous films such as \"'Brick\". What flaws this film may possess can be easily absolved because the overall experience is extraordinary.",
      "total_reactions": 2,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Looper is a really good sci-fi/action thriller. Although the second half of the film tapers off towards the end, the film is held together by a solid concept, great direction, and good performances, even if some things are left unanswered.",
      "total_reactions": 2,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "Amazing movie!!!!!!!! Nice story and good actors",
      "total_reactions": 2,
      "user": "Wiesy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2013
      },
      "score": 2,
      "text": "I know I'm in the minority here, but I HATE this movie! After watching it I was actually angry. I felt like the writers and the director had just smacked me. This movie really did show ALLOT of promise as it built itself up rather nicely, establishing a \"kind-of\" realistic near future. But then they introduce the whole time travel element. At first it was a creative new use for it. But the longer they developed it, the more it the logic surrounding it fell apart. Basically they have created a form of time travel that completely ignores its own rules to the point that you would have to be a a half brained idiot to not see it. Basically the movie is saying: Shut up, stop thinking and enjoy the movie. Overall: This had the chance to be a really good movie, but any ingenuity was raped out of it by lazy writers and a director with no direction.",
      "total_reactions": 1,
      "user": "Rox22"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "My favourite film of the year although not for everyone. The best way I can describe it is like a mash-up of Twelve Monkeys, Terminator & Drive. It's basic yet very graceful. JGL pus in a great performance & the story is really good but this is definitely a marmite film.",
      "total_reactions": 2,
      "user": "CmeNOWsoFLYii"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "The title is a Mars bar and just like junk food this film delivers that useless energy. In its fantasy came a world that could never even be explained, logically or even with any degree of attempt. Maybe in 1930's there is an era of which this film is modeled from definitely in no foreseeable future. This aside the plot is littered with gaping holes. Paradoxes were given as much thought as some illiterate explaining the theory of relativity and resulting in suicide. Quite literally those braincells where already popped from it's crackheads abusive direction. Poor at everything, what SCI-FI  I ask, it really didn't even try to be scientific. Bums with guns, and silver equals gold.",
      "total_reactions": 5,
      "user": "Bo33y"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2013
      },
      "score": 3,
      "text": "In 2 words, this film is so-so.  It wants to be a Hi Res concetpt sci-fi film, but the plot doesn't hold out for that, and the splatter violence and appalling and unnecessary language give away the fact that there isn't enough in the story or the characters to keep it going.  If you've paid oyur money and bought your popcorn, it will tick over, but you'll forget it within minutes if you have any semblance of intelligence.  And if you have any sensitbility, you will actively WANT to forget it.  It's just poor and nasty, at its heart.",
      "total_reactions": 1,
      "user": "Terbo49"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "This movie has everything you would want in a time travel film, action drama and well TIME TRAVEL. Now i wouldnt say its the best film of 2012 or it sould win best picture but it is a great film and maybe sould be nominated for original screenplay. From the begining to end it is a rollercoaster that has countless loops. It keeps the audiences attention and never lets go. Now for the action, it is great, just enough to hold the audience over. During the movie you will be thinking alot about the time travel in this movie and it can be a little bit confusing but think about it its just a movie about time travel thats all it is too it. Overall this is one of the best timetravel action films i have seen also my top 5 films of 2012. 9/10",
      "total_reactions": 2,
      "user": "KinoCritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "Movie requires a small amount of suspension of disbelief; negative reviewers got hung up here. Director did a fantastic job hinting just enough to understand everything going on, along with creating characters the audience is interested in. Highly entertaining, best movie I've seen in a long time.",
      "total_reactions": 2,
      "user": "Xanderak"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "There are some plot holes and some times you just have yourself scratching you're head because it's not exactly clear how the time travelling works. But everything else of the movie is good and very enjoyable",
      "total_reactions": 2,
      "user": "ReekyAlex"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "surprising and unusual, a new way to enjoy the futuristic genre, besides another unforgettable performance of young Levitt and the good creativity of Rian Johnson",
      "total_reactions": 2,
      "user": "forestville"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "Overall, awesome movie. This is some of the best acting by Joseph Gordon-Levitt I have ever seen. It has one of the best plots. This film is not what you would expect. This has become my second favorite time travel film of all time, next to Back to the Future Part II",
      "total_reactions": 2,
      "user": "tomtom4468"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "Starts out great. The opening felt similar to how I saw Blade Runner but somewhere in the middle it drags and what happens doesn't really matter until the revelation. I respect Rian Johnson for pulling off a great atmosphere but I just thought there were a lot of room for improvement in terms of pacing. Overall it is a good movie that shows a lot of potential for discussions. Maybe I just wanted to see more sci-fi.",
      "total_reactions": 1,
      "user": "Weaselboyst"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "One of the best sci-fi movies in years.  Rian Johnson is a very talented director that previously made the outstanding film Brick, shows the combo of himself and Joseph Gordon Levitt is a winning one.",
      "total_reactions": 2,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "From the unknown director: Rian Johnson comes Looper. A clean and original sci-fi film that got a tough script and much boring stuff.",
      "total_reactions": 2,
      "user": "TheApplegnome"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Looper is a film with great ideas,but unfortunately these ideas weren't so well used,besides of this i can't say that it's a bad movie,but i would do lots of things on this universe.",
      "total_reactions": 1,
      "user": "joao1198pedro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "Not quite the movie the previews make it out to be, but it's still quite good. It's an interesting take on time travel, but that's not even the important part of the movie. This child that has such powerful abilities, that he brings the world terror in the future is in the grasp of the protagonist, but decides that instead of continuing to try and change that future (which in itself only perpetuates it), he decides to end his own life. One of the better sci-fi movies in a while.",
      "total_reactions": 0,
      "user": "dijavantewow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "Despite some pacing issues in the second half and me seeing the lead actors and not their characters, Looper was pretty entertaining. The story is exciting and engaging with interesting morals, the characters are interesting, and the film is shot well. If you want a good fim to watch go check this one out it is pretty good.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "\"Looper is a completely original one of a kind sci-fi film that is thoroughly crowd pleasing including some outstanding performances from the two main leads. Looper is a film that only comes along so often that makes you think and actually use your mind.\"  B+",
      "total_reactions": 0,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "Possibly the kick ass film of the year!  A good story with steady-state suspense and pounding action, a great cast with marvelous acting and a bravado director delivering a film of immaculate style and elegance.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "A very well made film with many practical effects used instead of relying on CGI all the time; hats off to the filmmakers for taking that route. Performance-wise, everyone did a great job with Joseph Gordon-Lovett and Bruce Willis getting that majority of the screen time. I also liked Emily Blunt as Sara, Jeff Daniels as Abe and the young Pierce Gagnon as Cid. Although it did many things right I did feel it was a little unevenly paced in places. It seemed to get a little bogged down in the dialogue which slowed it down a little too much a couple of times. Other than that I found it quite enthralling and one I’d happily watch again sometime.",
      "total_reactions": 0,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "The movie gets a 4 effort but that's about it. My main problem with movies like this, is time travel is in all respects impossible. The mind boggling physics of it make it such a sticky subject that only really good movies who attempt it, seldom get it right. Most only on the grounds that the movie is making fun of time travel, Back to the Future comes to mind. The only serious movie that comes to mind that tackles it well, is 12 Monkeys. In that movie the \"circle of events\" are left to unfold like an infinite loop, old bruce willis is unable to stop the spread of plague, while young bruce willis watches unaware; ad infinitum. But in this movie the plot hole keeps me from really caring about the movie at all, according to the films logic. Here is my best shot at explaining it. In the future, 2074 time travel is created. Also in the future everyone is \"tagged\" so it's impossible to hide a body that has been murdered. So in order for criminals to hide bodies they seize control of time travel. They do this in order to send people 30 years, to be murdered.  Even though \" Old Joe's\" (Bruce Willis) wife is killed in the future. I wonder what they will do with that body? Now, the thugs who murder these people who are sent back are called loopers (Jason GL), they wait in designated locations to kill those wanted by the \"evil higher ups\" and dispose of the bodies. That is until they themselves are to be terminated. The loopers are given a bunch of gold and this lets them know they just killed there future self and that is their last kill. The problem arises in the fact that knowing this would inevitably change the future. Knowing that in thirty years you will be taken away to be sent back to the future to be killed by yourself would make any self surviving human prepare for the day when they are to be taken or get out the looper business altogether. The central theme of this movie is that there is mysterious rainmaker who is terminating all the loopers in the future. This person ends up being a kid that old joe tries to kill in order to save himself.  But the rainmakers reason for terminating all loopers is because his mother/guardian is killed by old joe. This cannot happened is young joe either kills old joe or kills himself. The logic goes that if young joe kills himself, old joe disappears giving no motivation for the rainmaker to become the rainmaker. Which ends the movie from the beginning. Where the logic breakdowns is that if young joe kills himself, their is no old joe to run amok. Therefore old joe is killed in the beginning alternate scene that explains how old joe, gets old and runs amok's already seen himself get killed. He never has a chance to run amok because in this time line he killed himself. Basically the movie makers wanted to make a circle, square. By giving the movie a happy ending it ruins logic the world is based around. Thus don't waste your time trying to watch this movie,  it will make you try to understand time travel, which for me has been a waste of time. Points for every-other aspect of the movie.",
      "total_reactions": 0,
      "user": "Skull-o-mania"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "If this was an original concept, it would be a 10.  But it's a mash-up of multiple ideas (The Witness, Akira, and others come to mind), so we have to take a little off for orginality.  With that being said, it is executed nearly perfectly.",
      "total_reactions": 0,
      "user": "ScrawnyPunk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "This movie is an example of a bathos at it's very best. It showed promise, but it just ended up being another predictable, action-blockbuster cash cow. There's nothing impressive about this movie; it's just disappointingly average. I'd put it on the same level as Total Recall, honestly. The whole \"TK\" concept seemed so clumsy and ill-suited and the writing was just lousier and lousier as the movie progressed.",
      "total_reactions": 0,
      "user": "UnsoundHype"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "The Looper is a decent but strangely disjointed movie. Time travel is always a tricky proposition and, if one were to think hard enough, there are a bunch of reasons why The looper doesn't make sense. But it is a sci-fi film, so what the hell. It's well acted and unpredictable, both of which are a plus. More heart and less cane fields would have been much appreciated, though.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2013
      },
      "score": 4,
      "text": "\"Looper\" was fine as mindless entertainment but if you think too much all the holes show up.  Considering all the positive reviews I was very disappointed.  The ending alone was tough to swallow and left me feeling \"had\".  Futuristic movies can stretch the imagination as long as the story lines make sense within itself.  \"Looper\" just makes no sense.  An 8 for Garret Dillahunt  of whom I have been a fan since \"Deadwood\".  Other than that just an okay movie.",
      "total_reactions": 0,
      "user": "shellview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "Looper is an original, inventive and incredibly entertaining film that is both well-made and well acted, but it does suffer from some dumb little errors. But those errors aside, Looper is plenty of great fun.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "Looper is a really great film for several reasons. Bruce Willis is back on form in one of the best science fiction films of all time. It's as mind-blowing as The Matrix and Inception, with all the action and tension of a blockbuster hit. Joseph Gordon-Levitt is fantastic as Young Joe with some of the most realistic visual make-up I have ever seen. One very memorable scene involves torture in the strangest way possible, without spoiling it, it's definitely one of the most chilling scenes in cinema history. Overall, definitely worth checking out for SciFi  Bruce Willis fans",
      "total_reactions": 0,
      "user": "AlexFili"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "Pretty good Sci-Fi time travel flick in the vein of 'Twelve Monkeys', starring Bruce Willis. Joseph Gordon Levitt is great here as usual, but I found the film a bit over-rated. If you've seen a lot of these time travel stuffs, you know where it's heading, and the whole film is practically a set up for the ending.",
      "total_reactions": 0,
      "user": "dharma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "You might just take Looper at first glance as what it says in all the marketing and synopsis material, with time travel now being possible, large crime syndicates send their targets back in time to be executed by Loopers, hired guns who can dispose of the bodies a lot easier than they can in the future.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "You can never go wrong in choosing a movie that stars Bruce Willis or Joseph Gordon-Levitt, but when they come together, that's when the magic really happens! Looper is the brainchild of Rian Johnson, who likes to bring us unusual stories, that mainly star JGL, however Looper is much easier to follow than most of Johnson's other films. While I'm not his biggest fan, his attention to detail has always really stood out to me and is perhaps never more evident than in Looper. Johnson actually used make-up and special effects to make JGL resemble a young Bruce Willis, which I found to be ingenious. Not to be overlooked is of course how clever a story Looper is, as it blends together time travel and the mafia. In the future, time travel has been invented, but like every other good thing, it is illegal. The mafia controls time travel and uses it as a weapon to commit murder. In this future world, it is impossible to dispose of a body, so the mafia sends their targets back in time where they are met an executed by a hired gun, known as a looper. The performances are of course top notch, Willis, the action star of a generation, only gets better with age, and JGL is the simply put the hardest working, most under appreciated actor in all of Hollywood. To be completely honest, this intriguing, action-packed, thriller was not as good as I expected it to be, and I really didn't care for the way in ended. That being said, it is still a great film that is definitely worth your while.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "Loopers are killers for hire - only they're tasked to get rid of the targets sent to them from the future. Easy gigs - as long as you don't let your target escape.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Writer/director Rian Johnson has hit the big time with Looper, a really polished and original clever sci-fi thriller that succeeds by focusing more on its characters and slick action than tying the narrative in loops to explain the intricacies of time travel. In fact the film makes it clear that the time travel discussion is off the table, Willis makes this point abundantly clear to his younger self when the pair discuss their past/future in another great American diner scene. It simply isn't allowed to distract from the film. The action is stylish and the film carries a genuine sense of almost low budget indie cool throughout. Armed with his awesome blunderbuss, Gordon-Levitt copes with playing a lead action man well and is ably supported by Bruce Willis and Emily Blunt. Blunt, in particular, gives a strong performance as a single mother resolutely protecting her son.",
      "total_reactions": 0,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "I've shied away from movies of late.  There was a time when I would have got excited by the next big science fiction movie, but I didn't really care Looper, and didn't rush out to see it, (even if it did feature the beautiful Emily Blunt).  Especially since advertisements had compared it to that Wachowski Brothers film, which, although visually inventive at the time, had laughable dialogue.  I eventually rented Rian Johnson's movie one bored Saturday evening.  At first I couldn't get into it, so slept on it and watched it the next morning when I was more awake.  Firstly, I must say how refreshing it is to see a movie that actually works.  The visual aesthetic is convincing, and never at one point could I not suspend disbelief in this reality.  Although it does not suffer with bad dialogue like many high concept movies where the focus is too much on the topography and plot of the movie, the dialogue is still probably the weakest element here.  The film is competently acted by its cast leading me to check afterwards that Emily Blunt was indeed English.  Props to her there for the accent.  The film kept me engrossed throughout it's two hour duration.  Admittedly it never really set my pulse racing, nor did it provoke me, or set the synapses firing, but neither was I bored.  The plot is not overly taxing, but there are enough temporal shifts to keep it interesting.  There were some nice stylistic flourishes which were probably unnecessary, but you come to expect style over content in this genre.  The film does feel a little horizontal and flat at times, but maybe that is the mille plateaux.  I would have to agree that I never really felt for the characters, although there was some humanity from Blunt's character.  Although dystopian, to say that there is no hope whatsoever is untrue.  There is some optimism to its denouement.  I'm still waiting on a science fiction film that does not rely on weaponry for its thrills, and I'm growing tired of hearing profanities.  I think it makes for lazy dialogue.  However, I must concur this is one of the better things I have seem for quite some time.  They called it a golden age at the Baftas, and I must admit sensing something of a renaissance in film at the moment.",
      "total_reactions": 0,
      "user": "neilmilton"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "Featuring great acting from Joseph Gordon-Levitt, Bruce Willis, Emily Blunt, Paul Dano, and Jeff Daniels, Looper is an incredibly original and bold film that you do not see made very often nowadays, so for this one, I am grateful. Blessed with a great concept and very interesting design for the future, Looper has some great direction and writing from Rian Johnson. Looper has some very good action sequences, but its real strengths are from its heady science fiction thrills and from the emotional impact it has on you. In addition, it also has some interesting things to say on the nature of evil in our world, as well as the importance of family and love. When it comes to the time travel feature of the film, it is not afraid to raise questions about what time travel really means. Do things keep repeating and we are powerless to stop them? Are we able to change our futures by altering our pasts? These questions are a few of many that come up, but for a major motion picture, Looper certainly is risky, not just in its willingness to test its audience, but in the fact that it was made at all. Thankfully, it paid off in spades and did quite well financially, but most importantly, it is a really great film. Fun, smart, and original, Looper is easily one of the best sci-fi films of the 2010s.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "Looper portrays time-travelling better than most movies and also includes some maybe unexpected emotional messages that make it more than just an entertaining sci-fi flick. Director Rian Johnson gives us just enough explanation to understand the time-travelling aspects and at some parts, re-thinking what happened later on is almost necessary. However, because of this, you don’t get the feeling that information is being thrown at you to help you with comprehending.  It has good acting even in little supporting roles, distances itself from typical Hollywood movies with sometimes long dialogue sequences but also several wordless shots, and has absolutely sightly visuals. It profits from the self-ironic approach of director Rian Johnson and its little flaws can be forgiven. Due to all of that, it becomes a movie that you are definitely going to remember and that you will do well in buying on DVD or Blu-Ray since watching it a second time and then fully grasping everything that's going on is just as much fun as the first time.",
      "total_reactions": 0,
      "user": "axelkoch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "I went in to this movie with high expectations because of the reviews, than i watch the movie and i was bored by it, this movie is clearly made for fans of time travel and science fiction and no one else, the plot is vary complicated and requires a lot of thinking and concentration, i got bored by this movie because i'm not a big fan of time travel movies, if you are not a fan of time travel,science fiction or vary complicated movies, i would say avoid this movie because you will probably not like it",
      "total_reactions": 0,
      "user": "htimreimer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Reading some of the reviews on imdb.com I was excited to see this, I dont think the movie's story is all that great, I guess I was expecting a better movie, 7/10 is the best I can give this.",
      "total_reactions": 0,
      "user": "Cadaveri"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "Looper was a disappointing film that, having promised so much in its trailer, did not satisfy in both its uncompelling storyline, cliched acting and futuristic (borderline annoying) cinematography.",
      "total_reactions": 0,
      "user": "benjiboi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2012
      },
      "score": 4,
      "text": "Mildly entertaining premise that wasn't executed well. The movie's ending was terrible.",
      "total_reactions": 0,
      "user": "jado818"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Nel 2044 i ricchi sono ricchi e i poveri si arrangiano servendoli. I primi vivono nei grattacieli di una città che ricorda vagamente ‘Blade runner’ (ma senza le pubblicità), i secondi abitano in caseggiati popolari davanti ai quali parcheggiano le loro macchine rappezzate. Il risultato  una società violenta e infiltrata dalla malavita: in più, rispetto ai giorni nostri, ci sono i loopers, assassini prezzolati che uccidono le vittime della mafia che vengono loro spedite da trent’anni nel futuro. Un lavoro pulito, pagato con i lingotti recapitati sulla schiena del malcapitato, che però può incepparsi quando a tornare  il te stesso invecchiato. Dopo tanti altri, capita anche a Joe (per la seconda volta in pochi mesi ecco un killer di nome Joe): il problema  che il passare degli anni lo ha fatto diventare Bruce Willis che, in cerca di vendetta, non ha nessuna voglia di farsi ammazzare. A partire da questo momento, ‘Looper’ si trasforma da buon thriller fantascientifico con qualche eccesso di violenza e manierismo ad opera di valore assoluto grazie a una seconda ora che, giocando tra i contrastanti sentimenti umani e i paradossi del viaggio nel tempo, affascina senza possibilità di scampo fino all’efficacissimo finale. E’ vero che, forse, sarebbe stato di ancor maggior effetto ribaltare la conclusione, ma questo  un film, non un romanzo di Dick e allo spettatore fa piacere alleggerire un po’ l’animo dopo tanta cupezza e tensione: il giovane Joe decide di spezzare il cerchio (il loop che sarebbe stato meglio tradurre con circolo o anello) ed  un bel cambiamento da parte di un tossico capace di sacrificare il suo miglior amico  chi non elimina il proprio loop non ha scampo  per salvare i lingotti accuratamente risparmiati sognando una fuga in Francia. Alla trasformazione, contribuisce non poco vedere come  diventato il vecchio Joe: Willis interpreta senza battere ciglio, ormai se lo può permettere, un assassino di bambini  incluso quello di una sua vecchia fiamma  guidato solo dall’amore perduto e da un odio che lo illude di poter cambiare il futuro in cui il misterioso Sciamano (in originale Rainmaker, da cui gli svariati riferimenti a nuvole e pioggia) sta cercando di eliminare tutti i looper. Al confronto dell’attempato leone, al quale l’esperienza ha insegnato a dare qualche sfumatura alla granitica presenza, Gordon-Levitt dimostra di dover ancora percorrere parecchia strada, malgrado l’assidua presenza sugli schermi negli ultimi tempi: la sua interpretazione cresce però con il passare dei minuti, forse perché non ha proprio la faccia da killer e funziona meglio quando, in fuga, abbandona la città per rifugiarsi nella fattoria presidiata,  il caso di dirlo, da una combattiva Emily Blunt. Proprio tra campi di frumento e strade sterrate si arriva alla conclusione, dopo che Willis ha fatto fuori un numero imprecisato, ma certamente alto, di mafiosi (compreso il plenipotenziario venuto dal futuro ben interpretato da Jeff Daniels) armato di due mitragliette, una per mano  uniche armi non vintage, essendo le altre intonate ai gusti ‘passatisti’ del giovane Joe. E’ il culmine di sessanta minuti di grande cinema, capace di far pensare ed emozionare allo stesso tempo grazie a una qualità che, se la prima parte fosse allo stesso livello, porterebbe il film dallo status di ottima pellicola con un futuro di culto a quello di molto vicino al capolavoro, seppur di genere.",
      "total_reactions": 0,
      "user": "catcarlo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "Well... What to say... I think they really tried to make an intelligent movie but they kind of fail. That's too bad because the idea wasn't bad but too many things are out of place. The actors, they're not bad but not really good either, none of them is really engaging.",
      "total_reactions": 0,
      "user": "Charlyson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2013
      },
      "score": 1,
      "text": "A daft script that just isn't interesting. Worst treatment of time travel paradoxes: change a man in the present and that same man from the future changes to his own surprise. Seriously, the Futurama episode where Fry is his own grandfather is practically PKD compared to this tripe. Telekinesis mentioned in the first five minutes, to be used as a Deus Ex Machina in the ending, all in between is filled with awkwardly paced boring filler. The ending feels like bland proselytizing. Incredibly disappointing.",
      "total_reactions": 0,
      "user": "zecg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2013
      },
      "score": 5,
      "text": "I like the idea of time traveling, and this movie had it`s own unique style, but I can`t say I enjoyed it as much as I was hoping to. I`t was really hard to care for any of the characters. I`t didn`t matter who died, and would care less if those that lived died. The ending did get really interesting, I won`t say why but the movie goes up a notch, and almost makes it worth staying until the end.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "The pace during the first hour was relentless. But then it varied so much I looked at the timer several times. Nonetheless, it was great if not awesome. Rainmaker is just a boogeyman. I was disappointed that they didn't show what he had done or was capable of, and I wouldn't have minded if they had added ten, fifteen minutes to shed light on his character. Gordon-Levitt earned some respect from me for his performance. Somehow I also enjoyed watching Willis. Blunt was surprisingly good too. All in all, this is one of the best sci-fi flicks I've ever seen.",
      "total_reactions": 0,
      "user": "Swati"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "Life seems to have a clear beginning and end, but I don't see why almost every movieplot needs to follow the same format.  Not saying that all movieplots litteraly begin with the birth of a character and end with their death, but instead I'm suggesting they begin with the so-called \"Hollywood Beginning\" and end with its short-bus brother the \"Hollywood Ending.\"  I define the \"Hollywood Beginning\" as any plot that force feeds milk down our throats until we understand what's going on, while its counterpart the \"Hollywood Ending\" ensure's us that the plot is over and not continuing on secretly after you leave the theater.  What I like about Looper is the beginning.  Without any leadup, it drops you into the middle of the main characters somewhat unique situation (Just watch the trailer and you'll find out what that is).  A dangerous move for most far-fetched plots, but Looper is paced well and acted clear enough so the we naturally get on board with what's going on and even start to feel for the main character and the people around him.  Brilliant. What I don't like about Looper is the latter half and the god awful ending.  It takes everything that was semi-unique and compelling about the first 30 minutes and tosses it out the window with a lit molotov **** in its mouth.  The only shred that remained was a \"It's me against a brigade of unfair big cocks\" plot, or in other words, the \"Minority Report\" plot..  So, to the same effect of sticking your mom in the ring to fight Mike Tyson, we have to watch our main character put up with his future brainless, professional death machine self, who wields uzzies like he's on the set of the next Die Hard installment.  The beginning of the movie was so good because the daily life of a looper sounds so enticing,  of course you'd inevitably have to think about the possibitly of killing your future self.  A movie based around this idea alone is doomed to follow a path that leads to a big pile or already been used toilet paper.  But a movie based around the life of one looper who has to deal with drug addiction, daily executions and the disposal of such victimes, coping with co-workers who shot their future self, or even didn't shoot their future self, is already enough character-plot crap to jam into a 2-hour flick.",
      "total_reactions": 0,
      "user": "Rotondi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "An intelligently written and fairly original sci-fi thriller that carries a decent amount of emotional resonance; Looper will reward your time greatly, if not exactly perfectly.  The premise is somewhat similar to other time travel movies, like The Terminator, but it's been reworked into something more intellectually complex while staying fairly easy to follow.  The characters all feel fleshed out and all have extremely well rounded personalities.  (This is no Prometheus.)  Action is rarely this exhilaratingly brutal.  None of it feels like filler here.  Every last shot and every fight is embedded with incendiary energy.  While the movie is extremely well acted and decently unique it still lacks the weight to be a masterpiece, but I'm not exactly sure why.  The fault may lie in its futuristic world.  A lot of the environments seemed unimaginative and I kept yearning for this future to catch up to the narrative in terms of creativity and awe.  That's not to say that the film lacks atmosphere.  It's just missing that extra spark to make it incredible.  Still, it's definitely worth seeing, and is head and shoulders above most action fare.",
      "total_reactions": 0,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "The first negative thing any critic will mention about this film is the plotholes. But you just have to remember that it is a time travel film and there is no escaping it, so you may as well embrace it. Was the Back to the Future franchise any less of a prodigy because of its gaping plotholes?",
      "total_reactions": 0,
      "user": "LonePiper"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "There are only a few movies in the world that can make you think. Think about what will happen next or even think about how the story relates to the characters. This movie has both. This Movie was an unexpected thriller, incredibly written and will keep me up at night just thinking about it.",
      "total_reactions": 0,
      "user": "Gary_2013"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "Great movie but had a couple flaws hear and there but a great movie overall. Maybe one of the best movies of the year it had great action.GREAT MOVIE with great actors and a great plot.",
      "total_reactions": 0,
      "user": "bradtheman123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "Awesome movie. Despite a concept over present in modern movies  the time-travel; the director succeed to create a world and a plot really captivating from the beginning to the great ending. Except the fact that it would have been really interesting to have a better look at the hero's future, the whole movie avoid the \"cliches\" and succeed in its initial goal  entertain",
      "total_reactions": 0,
      "user": "Luisboss"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "The time travel paradox is glaringly obvious in this one. But it has to be. The movie itself would cease to exist otherwise :)",
      "total_reactions": 0,
      "user": "Maverick2013"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "Looper could possibly be my favourite film of 2012. It's not quite as good as 2010's Inception, but it's certainly the most thought provoking and entertaining Sci-Fi since then and personally I think Looper is a worthy mention alongside Sci-Fi's such as Inception, The Matrix and 12 Monkeys. To Rian Johnson's credit, this film has everything. It boasts originality and sophistication, thought provoking story telling, visually it's spectacular, the set pieces are thoroughly enjoyable and all round the performances are as equally impressive. Joseph Gordon-Levitt is one of my favourite actors in recent years and he's brilliant here. I was pleased to see him take centre stage after a successful run of supporting roles. And Bruce Willis actually looks interested for a change and he gives his best performance in years. Emily Blunt is strong also and I was surprised to see underrated actor Jeff Daniels in a supporting role for the first time in years. Most Sci-Fi's attempt to be as big and loud as possible. But tonally I think Looper hits a similar chord to Terry Gilliam's 12 Monkeys. It's an impressive, ambitious and intelligent piece of filmmaking from Rian Johnson. And to the films credit it doesn't get carried away with an excessive sense of scale and it doesn't over complicate itself with too many unnecessary characters and multiple distractive plot threads. Also it balances the action perfectly knowing exactly when to throw in a set piece for good measure. Looper is a thoroughly enjoyable piece of filmmaking and I'm intrigued to see what the likes of Rian Johnson and Joseph Gordon-Levitt do next. Collapse",
      "total_reactions": 0,
      "user": "lloydharrison"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "It is apparent that Joseph Gordon-Levitt is talented enough to be portraying a younger Bruce Willis. Pierce Gagnon (a.k.a Cid) is possibly the most skillful child actor to be seen in a film recently. Not even eight years old yet, the director of the film admits to having been amazed and privileged to have worked with him. He deserves more credit. Furthermore, despite the fact that Levitt's make-up to resemble Willis was far too exaggerated and distinct to be unnatural throughout the movie, Looper was a spectacular work of science fiction. It delivered beyond the expectations of the public by combining the good-old time travel tradition with the emotional hardship of facing your future-self (with a view to killing him). Watching it was like reading a good book. When it's over there's just something missing...",
      "total_reactions": 0,
      "user": "TimeToRoam"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "This film is ok. It has an interesting plot and i liked the futuristic action and all this stuff. However there was something missing in that film. Maybe the actors, or the ending or the 'power' of that kid. I don't know. I enjoyed it but I knew that something was missing from Looper",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "The idea of this film I found to be absolutely fantastic. However, I feel it could have been executed better. I'd heard rave reviews about the film, reading them and from friends so I gave the film a try and found it to be very anti-climatic compared to the plot. To me, it seems like they thought the plot was good enough to make a hit film and not fill it with the right content.",
      "total_reactions": 0,
      "user": "Yorkshireman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "One of the best Sci-fi thrillers to come about in a long time, Looper brings the audience an original story with great intensity and relatable characters.  The film is intelligently written and touches on themes of fate, responsibility, and coming of age.  I personally loved Joe's character arch and how he changes as the movie goes on.  A must see and one of the 5 best movies of 2012.",
      "total_reactions": 0,
      "user": "bsykes91"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "By far the best Bruce Willis film I have ever seen. It is not just a lazy action film, the plot and characters and really quite clever, and the ending is superb. You won't be disapointed...",
      "total_reactions": 0,
      "user": "giaco1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "this movie is held together barely by duct tape logic. The producers really cashed in on people who just want a total escape into absurdity really so many holes the cast should've felled to their deaths but somehow they managed to live. Great entertainment loved this movie i really liked campy time travel logic i really loved going down the rabbit hole.",
      "total_reactions": 0,
      "user": "dyshpo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "Looper starts out great. The plot is fresh and original, the acting is pretty good, Joseph Gordon Levitt looks a hell of a lot like an actual young Bruce Willis, and the movie goes from there, with JGL trying to chase his \"future self\" through the present. This movie is complex, but once you hit Nirvana with the idea, like Inception, you will understand everything.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "Looper is generally good in terms of both \"science-fiction\" and \"crime thriller\". The idea of time travel is obviously exciting, which in particular permits us to kill our own \"future guy\" who is also a target for the mob, while thriller, crime genre has always been highly favored by even the most fastidious film critics. But that's all to say about Looper. It is far from as good as Minority Report ( sci-fi ) or goodfellas ( crime thriller )",
      "total_reactions": 0,
      "user": "PvtJackson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "Looper is not just a \"science fiction flick\" it has very innovated inventions in its own way, the story is and the concept of the story are top notch, reminds me of \"Inception\" and \"12 Monkeys\"",
      "total_reactions": 0,
      "user": "heeldavid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "One of the best  Bruce Willis performance and probably one of the best  Bruce Willis movie I have seen in a long time. The story is original and the acting in general is really good.Joseph Gordon-Levitt is absolutely stunning and the movie overall is surprisingly good.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "To say this is my kind of film is an understatement. I get to see two of my favorite actors (Levitt and Blunt) kicking ass in an intelligent film I am sad I took this long to watch. Every shot is crisp and the whole concept is original. Rian Johnson (annoyingly, Rian with an \"i\", but whatever) made this movie feel so cool. But the truth is, that's not the point. It's smart. At some points, I had to pause the film to check I understood everything. Joseph Gordon-Levitt, Emily Blunt, and Pierce Gagnon are amazing. Gagnon impressed me very much. There's a whole other part of this film that comes through: it's also psychological. One of the best time-travel/action/drama films ever. Never once during the film did Inception come across, so there's also that.",
      "total_reactions": 0,
      "user": "carlosgz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "Looper was an impressive futuristic movie with an incredible panorama, full of action and drama, at first it was little slow but it was up the pace and ended up being an outstanding film and an exceptional plot.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "\"Looper\" started with a great and fresh idea about time travelling and how criminal organisations use it to get rid of people in the future. I really thought that this movie has such a big potential, that it could become one of my favorite movies in years. But then the second half of the movie began and all my hopes were immediately shattered as I witnessed pointless gunfights and a little kid with superpowers. The ending could have also been a little more satisfying. I am still really sad about the second half of the movie, but it still shows big potential and an absolutely great first half that makes you forget the second a bit faster. So I think a 7 out of 10 is still appropriate and hardcore fans of sci-fi thrillers should definitely watch \"Looper\". Even if its just for its great concept.",
      "total_reactions": 0,
      "user": "Kunsti"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "Looper will be enjoyable only by your taste of opinion. If you think Looper will be wicked fun and an ultimate ride, don't look at me. Go watch this on your own.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2016
      },
      "score": 5,
      "text": "Having watched this film twice now I have come to the conclusion that there is something missing. I think this film had the potential to be really good but to be honest after a strong start to the film it got really boring. The plot kind of faded away and had to many flaws. Certainly not the worst film Iv'e seen but just not for me.",
      "total_reactions": 0,
      "user": "reviewerd1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2016
      },
      "score": 7,
      "text": "0 = Worse thing ever made",
      "total_reactions": 0,
      "user": "SuaveWerewolf"
    }
  ]
}