{
  "avg_user_score": 8.3,
  "metascore": 96,
  "mixed_rating_frequency": 18,
  "movie_name": "Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb",
  "negative_rating_frequency": 56,
  "positive_rating_frequency": 497,
  "pro_critic_reviews": [],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "Dr. Strangelove is very simply one of the best films ever made. It easily takes the title of best comedy film. Wickedly smart and satirical, Dr. Strangelove still very much applies to the present day situation, 47 years later.  Superbly acted, well written, and directed by the great Kubrick, Strangelove delivers everything you could want from a movie: humor, drama, history, and a main character with Alien Hand Syndrome. No matter what kind of movies you like, Dr. Strangelove is for you.",
      "total_reactions": 5,
      "user": "AtTheMovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "A Hollywood classic, Kubrick is a movie mastermind there is so many redeeming qualities in this movie. The acting was above par and There is no other movie out there that takes itself so serious but not so serious at the same time, there is a lot of comedic values in here strung over a very serious plot, It's hard to tell exactly what it is. This movie will have you in awe one second and you will laugh the next. I have never seen anything like it and I doubt I ever will again. One of my favorite movies of all time.",
      "total_reactions": 2,
      "user": "Colossus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "Greatest satirical comedy film ever made, as well as the funniest death scene. **** Metacritic's outrageous rule of a minimum 150 characters.",
      "total_reactions": 2,
      "user": "Bob_Loblaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "It's not just one of Kubrick's best, it's one of the greatest comedies ever made. Black Comedy about Cold War Paranoia? Oh Come on. What else could you wan't from a film?",
      "total_reactions": 2,
      "user": "AkashVijay"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "Stanley Kurbrick's brillant satire on the cold war is widely considered one of the funniest movies in cinematic history. A lone general gone mad gives the green light launching an A-Bomb attack on Russia, and the President now (Sellers) must pull out all the stops to prevent this. This dark comedy is shot entirely in black and white with terrific production design. Astutely, Kubrick focuses on the actual nuclear event in itself, thus removing the issues of foreign politics. The films message simply put its this; man is not at the mercey of machines,but it in fact it's just the opposite. Petter Sellers is sensational playing several roles and the film has stood the test of time remaining undated.",
      "total_reactions": 1,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Feels like 2 movies in 1, the segments on the plane and in the air force base are largely solemn and serious, the War room however is comical and insane. But this works well as it conveys what the film is about, the lunacy of politicians and the effects of beaurocracy. Dr Strangelove himself only appears in the latter half of the film but god does Peter Sellers do a good job! In all 3 of his roles. It's a pity everyone knows the ending though because it's been done to death in popular culture (Along with the famous line \"Mein Fuhrer! I can walk!\" one of the funniest in history. However I will say the 5 minutes before the famous segment with major Kong is i think one of the best 5 minutes in cinematic history, especially with the countdown, of sorts. It is truly one of the most tense few minutes I've ever seen and the acting is brilliant! The look on their faces as they approach the target in almost too real. It deserves all of the praise it gets without doubt! Peter Sellers, you are one of the greats! Along of course with Kubrick",
      "total_reactions": 12,
      "user": "NF123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "A film that is a true masterpiece. It has it all; comedy,suspense and a well told story. The film truly shows how silly people in goverment can be. Not trying to say this is what actually happened during the cold war although I do have a suspicion. Overall an unbelievable film which could never be created today because of people's longing of a happy ending.",
      "total_reactions": 3,
      "user": "cabrita"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "Stanley Kubrick's black comedy about cold war paranoia.",
      "total_reactions": 2,
      "user": "ERG1008"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "Bottom Line: Kubrickâ",
      "total_reactions": 1,
      "user": "Spielberg00"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "You really can't rave too much about  Kubric's  black comedy.  After all these years, it still resonates both comically and politically.  Recently, I've been showing my Ukranian girlfriend my favorite movies.  Some of my selections haven't held up as well as others (i.e. National Lampoon's Vacation).  Dr. Strangelove was as fresh as the first time that I viewed it...30 years ago.  The only negative thing that I learned was that the Soviet ambassador's (Alexei de Sadeski) Russian wasn't authentic.   On the positive side, he (Sadeski) realized that Soviet Premier Dimitri Kisov was drunk because Kisov ordered Sadeski to kill the president (in Russian).  If you enjoy black comedies, then you must see this masterpiece.",
      "total_reactions": 0,
      "user": "Darwin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Great performances.. great story.... great humor... great directing.... top 10 for me",
      "total_reactions": 0,
      "user": "pgmark"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "This is my #1 movie of all time. Funniest movie there is. It was a spoof on another movie which actually makes it funnier. During one of Dr. Strangelove's speeches an actor in the background can barely contain himself. Slim Pickens had me laughing like anything. Peter Sellers plays three parts,  Strangelove, the President and the English Officer. George C. Scott was incredibly funny. Each character is a gem.",
      "total_reactions": 0,
      "user": "chocolatekiss"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "There has never been a funnier movie.  I can't tell you how many times I have watched this.  Peter Sellers, George C. Scott, Slim Pickens were all genius and all the supporting actors were perfect.   \"I've never seen such behavior in the war room.\"  One of the funniest lines in the movie.  One of the funniest scenes is Slim Pickens riding the missile.  Although it is a black comedy it is not gross or depressing.",
      "total_reactions": 0,
      "user": "CritiqueGirl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "An uncompromising insight into the us versus them Cold War mentality, its impact strengthened by Kubrick's clever satire. The movie contains three different but equally satisfying stories that examine war on a personal and political level. This is an intelligent and bold film that highlights the paranoia and ridiculousness of the time.",
      "total_reactions": 0,
      "user": "ImUnavailable"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "People usually overlook how funny Kubrick films are, but Dr. Strangelove, The Killing, Barry Lyndon and Full Metal Jacket are all rich in timeless comedy, dark as that comedy might be.",
      "total_reactions": 0,
      "user": "MovieGenius"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "Kubrick has never had a problem dazzling his audience or at least making them wince, but Dr. Strangelove shows the director in strange form. Who knew the Cold War could be this hilarious? The always fantastic performances by Peter Sellers are worth it alone (and you get three of them). Along with George C. Scott, this is truly an unforgettable film. If you aren't laughing than greater work is needed. The greatest truths are in comedy.",
      "total_reactions": 0,
      "user": "TheDaveHimself"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "Dr Strangelove is regarded as being the 14th greatest movie of all time (to see my IMDb list depicting it go to http://www.imdb.com/list/jcBWwJSOLX8/ ) It is regarded as such for its groundbreaking intitiative and its comedic senses. When the bomb went off at the end and \"We'll Meet Again Some Sunny Day\" started playing I laughed out loud. Love the bomb everybody. Love. The. Bomb.",
      "total_reactions": 0,
      "user": "BillMarlo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "Another Fantastic Movie of Stanley Kubrick, Peter Sellers did a great job with all of his characters, especially Dr. strangelove, the ending scene was very interesting and original. I like it very much, it's my favourite movie of stanley kubrick.",
      "total_reactions": 0,
      "user": "FIlmsareawesome"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "Dr. Strangelove or: How I Learned To Stop Worrying And Love The Bomb is a war thriller, turned into a satire of the absurdity of the cold war and one of cinemas greatest dark comedies. The film depicts an unbalanced General Jack D. Ripper, who has sent his squadron of B-52 bombers to attack their designated targets inside Russia, having forged orders from Washington. Once the government finds out, they convene to figure out how to stop the General and return the bombers from of enemy territory. If they do not succeed, they are faced with the terrible power of the Doomsday Device. A weapon that's soul purpose is mutually assured destruction. I could see that as a plausible thriller. Instead, Kubrik took the film another direction saying, \"After all, what could be more absurd than the very idea of two mega powers willing to wipe out all human life because of an accident, spiced up by political differences that will seem as meaningless to people a hundred years from now as the theological conflicts of the Middle Ages appear to us today.\" Perhaps what is darkest about this comedy is just how plausible it was becoming in it's day. Made in 1964, the country was tense and in mourning. Only 2 years previously, the United States had looked down the barrel of total nuclear commitment during the Cuban Missile Crisis. And it was still reeling over the assassination of President John F. Kennedy. The only certainty was that nothing was certain. What began as fanciful musing became a question of: \"What if\"? The film was nominated for Best Picture, Best Director, Best Screenplay, and Best Actor for Peter Sellers. Peter Sellers gives an impressive performance as not only one character, but as three: British officer Mandrake, Predsident Muffly, and Dr. Strangelove. His performance is so well done that the casual movie goer would most likely never know he plays all three parts. If you are into Kubrik, dark comedies, or just good cinema then check this out.",
      "total_reactions": 0,
      "user": "SpacePope"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "This movie might be a little overrated by today's standards, but it is still very enjoyable. It has the perfect mixture of smart and idiotic humor. The writing is brilliant. The acting is amazing, especially that of Sellers. It really is a must see.",
      "total_reactions": 0,
      "user": "shamusolarry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "This is what i called i great black humor movie, if i can bring some person from dead that would be Stanley Kubrick, this movie show that he was a **** genius , mixing drama and humor in such a perfect way, i must give it 10 because i can not give it a 100",
      "total_reactions": 0,
      "user": "RodrigoBGC"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "A film that simply doesn't age, almost 50 years after its release, Dr. Strangelove is still considered to be the greatest comedy of all time and one of the all time best films, it takes the very serious and historic setting of the Cold War and manages to make it hilarious, not through the actions, but through the characters that are carrying out these actions, Peter Sellers plays three roles in this film, and each of these roles is as side-splitting as the next. But perhaps his best of the three is the titular character Dr. Strangelove, a former Nazi scientist who aides the current President of the United States, Merkin Muffley (also played by Sellers) on the basis of the film, where a crazed general (George C. Scott) initiates a first stike nuclear attack on the Soviet Union, something which everyone else is now attempting to prevent as this will mean nuclear annihilation.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "According to Morrissey’s recent manifestation “more gay people, more peaceful the world”, war is the malicious ramification of heterosexual men’s urge to kill their peers (I’m paraphrasing here), which tallies germanely with this Kubrick’s black war satire. Under the cold war backdrop, a rogue nuclear attack to Soviet Union commenced by a fervid anti-communist USA general, which would (irrevocably) launch a doomsday machine (a Soviet Union’s ultimate self-destructive nuclear contraption), and would annihilate all the human beings on the earth. It may sounds ridiculous and far-fetched by the mass, Kubrick’s masterful endeavor has overcome the detached accessibility of the warfare lingoes and the exclusivity of the decision-makers’ political impasse to implement a stranger-than-fiction satire which grants a considerable closeness to its audience with ease.  Running within 100 minutes, the film slickly unreels its storyline with great force of dark humor which imbues parodic and even cartoonish idiosyncrasies to the permeating machismo in the air.  Peter Sellers’ three-faceted versatility, George C. Scott’s Communism-slamming extravaganza and Sterling Hayden’s trigger-happy paranoia plus Slim Pickens’ cowboy hat, the ensemble cast owns their respective frantic glory within a compacted steak of time, umpteen gags and mockeries can be savored ad infinitum, Sellers’British accent (as Group Captain) when confronting Sterling’s General Rippers is unimpeachably spontaneous, Keenan Wynn’s coca-cola joke is pertinently deadpan serious and Sterling’s conspiracy theory about water fluoridation and the fearful deprivation of life essence during a sexual intercourse (the man just cannot face his natural aging mechanism of the body) are plainly golden ideas, outlandish but vividly rib-tickling, and astringently self-reflective.",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "With humor and intense acting throughout, Dr.Strange clearly stands the test of time. Easily enjoyable well after the cold war, one can only imagine how hard it would have been to laugh at this scenario back then. The film shows impending doom in two equally greatly written perspectives. The great cinematography of Gilbert Taylor, gives Dr. Strangelove a beautiful aesthetic.",
      "total_reactions": 0,
      "user": "AlvaradoKTA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "I'm loathe to give anything a ten as you can always go better... but this is up there. Unmatched and endlessly quotable,  \"Gentlemen you can't fight in here...\" Watch and learn.",
      "total_reactions": 0,
      "user": "VerbalCant"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "Dr. Strangelove continues to prove to me why Stanley Kubrick is worthy of the praise heaped upon him. On the surface, this one is absolutely hilarious. There are numerous scenes that have you laughing out loud, especially ones with Peter Sellers and/or George Scott. Luckily, Sellers plays three roles so we get to see a lot of him and he really helped put this one over the top for me. It is amazing to me that this one is still a riot considering that it was released 50 years ago, but it goes to show that good films transcend time and this one fits the bill completely. In addition to being funny, it is a great political thriller as we watch everything unfold in the film. The ending song as the film wraps up was also a phenomenal choice and was a perfect compliment to the things going on on screen.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "Razor sharp satire and blissfully dark lunacy prevail in Stanley Kubrick's classic and brazen comment on the Cold War - \"Dr. Strangelove: Or How I Learned To Stop Worrying And Love The Bomb.\"",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Certainly one of the best comedies i have ever seen. The great thing about it, is that it's more than a comedy.It gives you an insight into the military way of thinking and into human nature in general, via sarcasm. Brilliant!",
      "total_reactions": 0,
      "user": "ilias252"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "Peter Sellers is definately the funniest actor ever. This movie shows us why. And due to the path our society has taken, its criticism may never stop being modern.",
      "total_reactions": 0,
      "user": "pHrfo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "This and \"Oceans Eleven\" easily takes the title of best comedy film. And this comedy is still surprisingly relevant even today. Utterly one of the best films I have ever seen. This will go down in history as the best satire ever created.",
      "total_reactions": 0,
      "user": "IonXtreme"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "Taking a look back at some of Kubrick's earlier looks I noticed that I didn't love this movie. I really wanted to love this movie, but it did kind of disappointed me. Here's the thing, the movie looks great on a technical level, Peter Sellars and George C. Scott are great in the movie, some of the war scenes looked really amazing, and it's funny at parts. However, I wasn't interested the rest of the characters aside from Sellars multiple performances and Scott's performance. I wasn't that too invested in the story until about halfway through. And there were parts that I simply did not laugh at. The movie, to me, only felt like it was suppose to be a comedy at parts. The rest felt to me that it was suppose to be drama. I guess the structure didn't feel like a true comedy to me. But like I said, the second half is what ultimately drew me into the story. I know lots of people love this political comedy, but personally it didn't work to its full benefit like I hoped it would. Overall, even with its lack in structure, the movie slowly builds to become more engaging the further you get into it even if it feels too late. I'll give \"Dr. Strangelove\" a B-!",
      "total_reactions": 0,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "I don't think I've seen a satire made exactly for its time, and becoming a critically lauded success. The cinematography, acting, script, and underlying themes, all in total, makes for the one of the smartest, and oddly blackest of black comedies. Stanley Kubrick is, in my personal opinion, the greatest filmmaker of the late 20th century.",
      "total_reactions": 0,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "This is the Kubrick film I've seen the most, about several times in a short amount of time. So it's hard to give a really positive review when you've seen it a lot. All I can say is this. In my opinion it's not one of the funniest comedies of all time but I agree it's one of the greatest. This is one of the shortest Kubrick films and probably the most casual to watch which I like. There is a lot of dialogue but it gets pretty entertaining in the second half of the film. And there are a couple of really funny scenes; my highlight is the one where the President is on the phone trying to tell the Russian leader that American planes are going to bomb Russia. And what makes it great also is the comment it makes. This is one of THE cold war films. All the paranoia and suspicion and madness. The ending was the right way to end the film. It should be part of your bucket list of films to watch.",
      "total_reactions": 0,
      "user": "theunholymesiah"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "kubrick's most important and (in my opinion) most enjoyable film. Was, and maybe still is, years ahead of its time. hilarious and unmatched dark comedy (closest runner up is Fargo).",
      "total_reactions": 0,
      "user": "rachemsachem"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "This movie is pure genius, pure art and pure truth about the way of thinking of the political victors of World War 2 and their use of captured German scientists to further their objectives by force of arms.",
      "total_reactions": 0,
      "user": "Unurautare"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Dr. Strangelove wasn't Stanley Kubrick's best movie, in my own opinion. There's barely any rising action in the movie, just dialogue. It is still a good movie, with a purpose.",
      "total_reactions": 0,
      "user": "REDWOU"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2015
      },
      "score": 9,
      "text": "Out of one of the most tense times in U.S. history came one of the more crude and witty satires on the U.S. approach and policies. The film was a spoof of the entire American special forces, and their protocols. Dr. Strangelove was a witty satire of the paranoia towards communism, the overly complex emergency protocols, and the U.S. special forces leadership. It was also most likely a film that would predict the future culture of america.",
      "total_reactions": 0,
      "user": "tjman09"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "Probably one of the greatest films ever made, Stanley Kubrick's Cold War satire, is a madhouse of wacko performances and a screwball plot add with a explosive mixture of dark elements including nuclear weapons.",
      "total_reactions": 0,
      "user": "VinceRocks123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "When you consider the history of motion pictures, certain watershed films leap to mind -- productions which have left their mark on the craft. Without a doubt, one of those is Stanley Kubrik's 1964 masterpiece, Dr. Strangelove (or, as it's subtitled, How I Learned to Stop Worrying and Love the Bomb). As political satire, few movies -- even those as incisive as the hilariously vicious 1992 release Bob Roberts -- come close to this level of accomplishment. In the case of Dr. Strangelove, the barbs and quips (both subtle and obvious) hold up as well today as they did thirty years ago.",
      "total_reactions": 0,
      "user": "CinemaSins"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2015
      },
      "score": 10,
      "text": "Kubrick's black comedy is both hilarious and shockingly intelligent. Peter Sellers turns in the best comedic performance of all time(imo) in his portrayal of three surprisingly different characters. The whole movie is a satire on nuclear war, paranoia and how governments were run during the Cold War. While there are many iconic moments, Kong riding the bomb and the fight in the War Room, Sellers' portrayal of the former Nazi Dr. Strangelove is genius and the he's the real star of the movie. Combine that to a great performance from George C. Scott, brilliant direction from Kubrick and quick pacing and Dr. Strangelove might be the best comedy of all time, and is of the best movies ever made.",
      "total_reactions": 0,
      "user": "Ravensman345"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "Dr. Strangelove has a dated yet classic 50s/60s feel to the filmmaking and acting, and it also has timeless comedic appeal. Perhaps the degree of its humor has increased, since what was absurd then seems even more so now. The action moves along and switches between the three locations, without going on (much) too long in any scene. The length of the film is just right -- perfect for a laugh on a Saturday afternoon.",
      "total_reactions": 0,
      "user": "RobertBrogan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2015
      },
      "score": 9,
      "text": "Stanley Kubrick throws his hat into the political aspect of the cold war and comes out a war hero. Kubrick's satirical side really comes out in the film showing not only does the legendary director has a sense of humor but he can cover political issues in the same light without making them seem like a joke.",
      "total_reactions": 0,
      "user": "AnarchyAus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2016
      },
      "score": 10,
      "text": "One of the best ever made! Every detail of it have a great attention; the war room scenes are satirical at best, the skirmish in airbase is full of action and the air plane scenes are dramatic; everything is in its place. Every camera angle, every phrase you see around, every facial expression, simply everything in this movie is excellent. And Peter Sellers. The great comedian worth every penny he got from this movie. It's not just an excellent performance but three perfect performances (and it could have been four if there wasn't an unlucky accident). A genius movie from a genius director.",
      "total_reactions": 0,
      "user": "svperstar6"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2016
      },
      "score": 10,
      "text": "This is nothing less than a classic. I would suggest that everyone get this for their DVD collection. It is a very dark comedy, a bit of a slow burn, it isn't high action like modern movies, but It is subversive and pokes fun at the time in which it was made. One of the best ever.",
      "total_reactions": 0,
      "user": "anonymousey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2017
      },
      "score": 10,
      "text": "كوميديا سوداء رائعة من ستانلي كوبريك",
      "total_reactions": 0,
      "user": "ali_almubairik"
    }
  ]
}