{
  "mc_avg_user_score": 7.0,
  "mc_metascore": 43,
  "mc_mixed_rating_frequency": 8,
  "mc_movie_name": "Machine Gun Preacher",
  "mc_negative_rating_frequency": 7,
  "mc_positive_rating_frequency": 29,
  "mc_pro_critic_reviews": [
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2011
      },
      "score": 80,
      "summary": "The exploitation title may not do it any favors, but this biopic based on the incredible life journey of Sam Childers is gripping, inspirational and well told."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "Machine Gun Preacher is stirring when it presents Childers as a hero, but it does its most impressive work when it addresses him as a flawed, struggling, but still determined man."
    },
    {
      "critic": "Kirk Honeycutt",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2011
      },
      "score": 70,
      "summary": "One can't escape the nagging feeling that the film doesn't dig deeply enough into its real-life hero. The film doesn't explore all those \"whys\" and \"whats.\""
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 63,
      "summary": "If you'd pay to see a film called \"Hotel Rwanda: Maniac Manager,\" you might be receptive to this mixed-message movie, but skeptics should keep one eye on the exit."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 63,
      "summary": "The action sequences are energetic and suspenseful but they don't always mesh well with the dramatic material."
    },
    {
      "critic": "David Hughes",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "It's gratifying to see Butler giving a proper acting role the old college try. Despite his best efforts, Forster's film, while pulling no punches, still somehow manages to miss the mark."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 60,
      "summary": "Director Marc Forster moves from one thing to the next so quickly the movie plays like a two-hour-plus trailer. Something feels like it's missing here, even at that length."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 60,
      "summary": "If anything, watching the film is like attending an old-style Southern tent revival - you want to believe in the fight against all that fire and brimstone. Heck, you want to join the righteous brigade. But when the lights go up and the fever dies down, it feels more like you've witnessed a show than a real showdown with the devil."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "The movie never convinces us that Forster is convinced himself. The director lines up this bad good man in his sights, but he never quite has the nerve quite to pull the trigger."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "At the end of these \"based on a true story\" flicks, it's customary to flash photos of the real people over the end credits. There, Sam Childers looks older and less handsome and awfully imposing, a scary sort of cat with raw but authentic tales to tell. I'd like to hear them."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Is he a hero or a lunatic? He's possibly neither, or possibly a little of both, but this is the problem with making a movie about a real person."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Machine Gun Preacher is crude and ham-handed from its ridiculous title on down, but it still gets to some interesting places."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "By the end of Machine Gun Preacher, its title character has become a cartoon."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "He's a fascinating character (even in the person of Gerard Butler), but his conversion from drug-crazed bruiser to psalm-singing family man is so swift and unconvincing that the movie is hobbled from the start. It becomes more engrossing once Childers finds his mission in Africa."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "He seems fueled more by anger and ego than spirituality and essentially abandons his family to play with his guns. It's intriguing, however, how well Butler enlists our sympathy for the character."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Director Marc Forster and screenwriter Jason Keller take the easy way out by turning Childers into a Bible-thumping Rambo. Just because the Childers of this movie is not, to put it mildly, introspective, is no reason why the filmmakers had to be equally dense."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "In movie terms, Mr. Childers's story is too true to be good. Machine Gun Preacher, directed by Marc Forster and starring Gerard Butler, illustrates some of the ways that a terrific story can turn into a bad film despite the best intentions of everyone involved."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "The action scenes in Machine Gun Preacher work fine on their own, but they cheapen a work that attempts to command great importance."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Gerard Butler, who's honed his screen persona as a brutish, charismatic jerk, isn't a bad fit for the role of Sam, even if he's more believable spraying bullets and stabbing hitchhikers than he is delivering a sermon."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Marc Forster regards the real-life Childers's evolution from heroin-addicted, wife-beating (implied), gun-toting oblivion to born-again do-gooderism with motorized aloofness."
    },
    {
      "critic": "Melissa Anderson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Machine Gun Preacher is the umpteenth onscreen iteration of a white savior aiding the most desperate in Africa."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 40,
      "summary": "With its combustible mix of high-octane action and Christian faith, and an overall vibe that falls somewhere between bloodthirsty nihilism and an unshakable belief in the twinned powers of religious redemption and obsession, Machine Gun Preacher is certainly the strangest examination of grace under AK-47 fire to merit a mainstream release in ages."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "The result is far too high-and-mighty to truly be moving."
    },
    {
      "critic": "David Fear",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "Childers's varied, charitable life story warrants a movie, but whether that means it's okay to simply mash up sappy Christian piety and action-movie chaos is highly debatable."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "While the result is yet another story of African suffering told from a white do-gooder's perspective, this particular do-gooder is intrinsically fascinating enough to warrant attention, albeit more nuanced attention than he receives here."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 38,
      "summary": "The events of the movie may be a little bit true, or a lot, but hardly any of it plays that way."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2011
      },
      "score": 38,
      "summary": "Machine Gun Preacher has a lot more wrong with it than a bullet-riddled premise. It is yet another iteration of the big, strong white man who comes to save legions of poor anonymous black Africans."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2011
      },
      "score": 38,
      "summary": "In Machine Gun Preacher, Gerard Butler says, \"I've done a lot of things I'm not proud of that hurt a lot of people.\" But enough about \"The Bounty Hunter,\" \"The Ugly Truth\" and \"P.S. I Love You.\""
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 30,
      "summary": "The failure lies not with the film's director, Marc Forster, nor with its impressive star, Gerard Butler, but with Jason Keller's dreadfully earnest script, which charts the hero's spiritual journey, and his Rambo-esque exploits, without offering a scintilla of mature perspective on his state of mind."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 25,
      "summary": "Machine Gun Preacher comes alive only when Sam is pulling a trigger, which is most of the second hour. You can find the same thrill from watching a grindhouse descendant like \"The Expendables\" on cable TV."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 25,
      "summary": "It gets the bullet points of Sam Childers's life, but misses the target."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 25,
      "summary": "The title, Machine Gun Preacher, makes it sound like a piece of grindhouse kitsch - and by the time it's over, you'll be thinking, ''If only!''"
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "I am not sure why this movie is rated so low.  Absolutely incredible.  very moving and varying degrees of emotion.  I would call this a must see!  Dont be fooled by the low ratings",
      "total_reactions": 4,
      "user": "lachacz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "In his best performance yet, Gerard Butler plays a troubled, complex guy who leaves his life of crime for God and becomes a real life hero in Sudan. Machine Gun Preacher is violent and, at times, hard to watch, but the story is inspirational and puts the spotlight on an ordinary man doing extraordinary things. But he is far from subtle and chooses to use a gun to get them done. The film can certainly be upsetting, especially when you see how kids in Sudan are treated and what happens if they disobey. But no matter how gruesome some parts may be, Machine Gun Preacher only shows the audience the brutal truth and the cause that Sam Childers is fighting for.",
      "total_reactions": 2,
      "user": "Sir_Brandon"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2012
      },
      "score": 3,
      "text": "I found this movie very \"preachy\" and honestly boring. It picks up in the second half, but the first half is so dreadful, why bother? I thought Gerard Butler did a fine job with what he was given, but what he was given was a shallow cartoonish character, who is not only rather uninteresting but unlikable to boot. If you are interested in Africa or the atrocities that have and continue to go on over there, due yourself a favor and find a documentary or other film to satiate your appetite!",
      "total_reactions": 3,
      "user": "EatToWatch"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "This is an amazing real life story. I found it inspirational how the main character \"Sam Childers\" changed his life from from a drug addict thug to putting his life on the line to help the orphan kids in Southern Sudan. I like his realism after his conversion. I believe the way he channeled his fearlessness from something dark into something great challenges the audience to greater potential as well.",
      "total_reactions": 1,
      "user": "Mrjoelv"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "\"MACHINE GUN PREACHER\" - A very powerful movie. My question is: how many modern American Preachers would actually teach in support of the efforts of San Childers and how many would condemn his methods? This R-rated film is a gritty and realistic portrayal of the unimaginable brutality still going on in the Sudan. My favorite aspect of this film was that it showed the deep flaws and humanity of Childers, his struggles, doubts and anger.",
      "total_reactions": 1,
      "user": "theMKlife"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "Machine Gun Preacher was a fantastic movie with a plot that almost felt like a modern day version of Schindler's List. Now don't get me wrong. In no way am I saying that this film was anywhere near that level. I'm just saying that some of the emotions were similar due to the similarly tragic nature of the true stories they tell. Gerard Butler leads a cast that provide great acting throughout the film and deliver on those emotions. The plot develops well and the reality of the story adds an additional layer of depth. The action sequences were a little weak and unfortunately the movie leans a little too heavily on those scenes. The constant varying perspectives makes you think and the drama is effective. I think the ending felt a bit rushed and the film lacked that climactic emotional sequence that sticks with you but overall, I think most people would really enjoy this movie.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "The movie is amazing, on the whole. The beginning is a bit hard to bear, as it's *extremely* vulgar and painful. Although, it is an good representation of what Sam Childers' life used to be like. The accuracy of what is going on over in Africa is heart wrenching and makes you want to go over to help them yourself. And watching the development of Sam is interesting and will have you feeling for him.",
      "total_reactions": 0,
      "user": "Eriaste"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2013
      },
      "score": 1,
      "text": "There is in fact an incredible story to be told of Childers' life and of his mission to help children in Sudan. Unfortunately, Machine Gun Preacher is not an incredible film but rather one lacking the emotional pull needed to adequately reflect the work Childers has done on behalf of so many who are completely unable to help themselves.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "Gritty, gray life.  And some red too.  The movie wades from deep, murky pond to deep, murky pond. It isn't your typical formulaic, black/white entertainment where the good guys save the day and everything works out. Reality isn't like that. Sometimes sacrifices (even big, soul-wrenching sacrifices) have to happen. Sometimes you have to beg and plead for help from people who will never understand because they are so far removed from you. Can you imagine trying to live these two lives in the movie? I don't mean biker and Christian, or even AKs and Christian. I mean Sudan and America. One week you're with kids who are happy to have food, health, and a ball to kick and the next your wife and daughter think you don't love them if you say 'No\" to a limo for the prom. I'm guessing all these talking about whether or not Gerald Butler was a good fit for the role and \"white savior tropes\" didn't relate to the film. Which is a shame. It is so powerful and shines a bright light on the West's spoiled, self-centered society if you're willing to look. I only wish they had used a different title.",
      "total_reactions": 0,
      "user": "TheMessy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "I don't see how this movie is rated so low, this movie was amazing yet sad and touching at the same time. Gerald Butler was a great actor chosen for this movie. This movie is actually a true story, they are still alive to this day. It's so hard to see good true movies now-a-days.",
      "total_reactions": 0,
      "user": "Aedrone12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "This story held me glued to the screen from the very beginning. I was touched deeply by Sam Childers' heroic efforts. At least he is trying to make a difference. It only takes a spark to get a fire burning. Bravo for  Sam, who stands up for what he believes is right.  This movie definitely inspired me to think about what is really important. Saving children and helping the needy should be our primary focus, but unfortunately in our society, its all about taking care of numeral Uno. I loved this movie, and I'm proud of the fact that it is based on actual events. We need more inspiring characters and movies like this.",
      "total_reactions": 0,
      "user": "debbthatsme"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2014
      },
      "score": 0,
      "text": "Wow. This movie is quite simply unbearable to watch. While the story itself may harbor some interesting and compelling material, the script is so horribly mundane, cliche, and unbelievable that the film comes off as unintentionally comic material. Gerard Butler does the best with what he is given; however, his character's arc goes from awful scoundrel to world saver literally overnight. Furthermore, not only is the entire film's premise a stretch of your imagination, the ending is extremely unrewarding and empty. Please, save yourself some brain cells and some time, and choose something else to watch.",
      "total_reactions": 0,
      "user": "elvisheimer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "Despite a competent performance from Butler, Machine Gun Preacher tackles way too much material to present a cohesive onscreen telling of the Sam Childers story.",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ]
}