{
  "mc_avg_user_score": 6.3,
  "mc_metascore": 52,
  "mc_mixed_rating_frequency": 35,
  "mc_movie_name": "Maggie",
  "mc_negative_rating_frequency": 23,
  "mc_positive_rating_frequency": 64,
  "mc_pro_critic_reviews": [
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2015
      },
      "score": 83,
      "summary": "The movie subtly examines whether people accustomed to a precise way of life can deal with cataclysmic change; by extension, it implies similar questions about Schwarzenegger's career as he heads toward his seventies, and makes a solid case that more new directions await."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2015
      },
      "score": 70,
      "summary": "Maggie has some rough edges — what caused the epidemic, for instance? — but it's still a worthwhile effort, especially for a first-time director. And for an old pro like Schwarzenegger, trying something different and succeeding."
    },
    {
      "critic": "Guy Lodge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 70,
      "summary": "Though Henry Hobson’s hugely promising debut feature is generating buzz from the casting of a fine, low-key Arnold Schwarzenegger as the anguished father of a semi-zombified teen, it’s Abigail Breslin’s gutsy, nuanced turn as the reluctantly undead title character — at once a heroine to be protected and a mutant threat to be destroyed — that makes the film unique within its grisly canon."
    },
    {
      "critic": "Jeff Baker",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2015
      },
      "score": 67,
      "summary": "It's an odd concept, turning a zombie movie into a downbeat actor's showcase, but first-time director Henry Hobson gets great work from a subdued Schwarzenegger and an even better performance from Abigail Breslin in the title role."
    },
    {
      "critic": "Joe McGovern",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2015
      },
      "score": 67,
      "summary": "The sight of Schwarzenegger in this small, subdued role makes us root for his survival. That’s the power of star wattage at work. Not even the undead can kill it."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2015
      },
      "score": 67,
      "summary": "The words “Arnold Schwarzenegger zombie movie” create certain expectations. Maggie, the glum new indie that technically fits that description, meets almost none of them."
    },
    {
      "critic": "Odie Henderson",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2015
      },
      "score": 63,
      "summary": "Maggie” is Schwarzenegger’s “Cop Land,” that is, a feature designed to highlight and showcase that which an action movie hero could only hint at in glancing moments between explosions."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2015
      },
      "score": 63,
      "summary": "The film suffers a bit for its slowness. But once you get used to the fact that this is not “World War Z,” it has its small pleasures, which are both cerebral and emotional."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2015
      },
      "score": 63,
      "summary": "Downbeat but humanistic, Maggie is the rare zombie tale that's less about the appetites of the walking dead and more about their complicated emotions."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2015
      },
      "score": 63,
      "summary": "Gore is kept to a minimum, a fact likely to disappoint audiences out for blood. It's a changed Schwarzenegger on view in Maggie, and the change becomes him."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2015
      },
      "score": 63,
      "summary": "Sad and forlorn as Maggie is, there are no surprises left in Zombieland."
    },
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2015
      },
      "score": 60,
      "summary": "It feels a little like ‘a very special episode of The Walking Dead’ and might be a tad low-key for its field, but Schwarzenegger and Breslin are good and the payoff is affecting."
    },
    {
      "critic": "Paul Bradshaw",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2015
      },
      "score": 60,
      "summary": "A sad, gloomy family drama dressed up as horror, Maggie proves that Schwarzenegger can act when he wants to – even if he still looks like he’d rather be blowing shit up."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2015
      },
      "score": 60,
      "summary": "It’s not a great movie, but it’s haunting, a sort of one-stop shop for a range of cultural anxieties — plague, environmental catastrophe, big government threatening the sanctity of home and family."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2015
      },
      "score": 60,
      "summary": "A rewarding, moving and satisfyingly original film."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2015
      },
      "score": 60,
      "summary": "Past the novelty of its conceit and casting, and the animating intelligence of its first-time director, Henry Hobson, Maggie is a bit of a drag."
    },
    {
      "critic": "David Ehrlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2015
      },
      "score": 60,
      "summary": "Henry Hobson’s zombie movie does for coping with terminal illness what \"Dawn of the Dead\" did for consumerism, the difference here being that Hobson isn’t interested in satire, only sadness. Oh, and he’s got Arnold Schwarzenegger."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 60,
      "summary": "While Hobson's smarts are evident here, the picture's uniformly dim visuals and sometimes overplayed sound design are static enough to do a disservice to his work with the cast."
    },
    {
      "critic": "David D'Arcy",
      "publication": "Screen International",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 60,
      "summary": "The surprise in Maggie is Abigail Breslin, playing a teenager who flares and burns with dread as she becomes aware of the horror of her infection. For a zombie film, her performance delivers real emotion which is rarely seen in this genre."
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 58,
      "summary": "Maggie is not your standard zombie movie, and while it tantalizingly puts action hero Arnold Schwarzenegger into the lead role, the film is actually low on setpieces, and instead is a ponderous, sombre take on the genre that may leave those looking for a traditional horror flick disappointed."
    },
    {
      "critic": "Michael Ordona",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2015
      },
      "score": 50,
      "summary": "Abigail Breslin (“Little Miss Sunshine”) plays the infected daughter. Her performance seems unsettled at first, but it doesn’t take long for Breslin to sink into Maggie’s (rotting) skin, aided by some fine makeup work. Her most effective moments come when the teen faces the inescapability of her death."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2015
      },
      "score": 50,
      "summary": "The plot is lean, the dialogue is spare and there are some intriguing stabs at intellectual and emotional terrain. But the pacing is deadly, so slow there might be time for a catnap or two without missing anything important."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2015
      },
      "score": 50,
      "summary": "The film feels very tiny, and intentionally so. This isn't a horror film at all, which is an odd thing to say when you're talking about a movie with zombies in it."
    },
    {
      "critic": "Simon Abrams",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2015
      },
      "score": 40,
      "summary": "While zombie drama Maggie seems intended as a showcase for Arnold Schwarzenegger's acting range, the star's performance is smothered by the film's deeply affected style."
    },
    {
      "critic": "Dan Callahan",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 40,
      "summary": "A zombie movie starring Arnold Schwarzenegger sounds like it should be campy fun, but first-time director Henry Hobson’s Maggie is grimly one-note, a small mood piece and character study that relies heavily on its three main actors: Schwarzenegger, Abigail Breslin and Joely Richardson."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 40,
      "summary": "I give the odd, small film Maggie all the points in the world for experimenting with genre-blending and subverting audience expectations, but there’s just too much about it that fails to connect."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2015
      },
      "score": 38,
      "summary": "Bidding to be the “Terms of Endearment” of zombie movies, Maggie sucks all the life out of an idea that just won’t die."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2015
      },
      "score": 38,
      "summary": "Its only claim to uniqueness becomes running the standard zombie narrative through a Hallmark-card filter."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2015
      },
      "score": 30,
      "summary": "Zombies, Arnold Schwarzenegger and a certain Terrence Malick je ne sais quoi — what could go wrong? More or less everything in this low-budget head-scratcher and periodic knee-slapper."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2015
      },
      "score": 20,
      "summary": "Its creepy atmosphere aside, Maggie is a slog of the living dead."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "Brilliant drama,",
      "total_reactions": 5,
      "user": "WataKorosu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "Maggie is unique, intense and original. Arnold Schwarzenegger is awesome, best performance of his career. Its a must watch for drama fans, just do not confuse this with a horror movie.",
      "total_reactions": 4,
      "user": "xxkaiokenxx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "A slow-paced, emotional look at the effects of the zombie apocalypse. By focusing on one girl's transformation and the effect it has on her and those around her during a time when the world isn't completely ravaged by the undead, director Henry Hobson and writer John Scott III create a compelling world and effective tale. Even better is that it is brought to life by fantastic performances from it's two leads.",
      "total_reactions": 2,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2015
      },
      "score": 6,
      "text": "Time to time, \"Maggie\" has its melodramatic, tear-jerking moments, but the movie is just mostly a huge boring sequence of events with a wandering plot and sub-par acting.",
      "total_reactions": 2,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "Maggie is the film that finally shows an emotional side to zombie films. This movie is not about killing all the infected people in sight. I think that Maggie has a least four excellent performances. The best is definitely Abigail Breslin. It is Arnold Schwarzenegger who is going to bring people to the theatre to see this movie but it really is Breslin's film, she is really the star. Schwarzenegger however is not his normal self. The man can act, and I'm sure that this film will never receive the credit it should because Schwarzenegger is in it and people are too quick to judge it by its cover. Maggie is slow but the performances managed to keep me interested. The film is also dark which perfectly captures its tone. I think that people need to go into this movie with an unbiased mind and it could really be enjoyed.",
      "total_reactions": 2,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "Beautiful shots, full of suspense and a decent cast all combine to make Maggie an enjoyable film. The story is believable and not your usual apocalypse scenario.",
      "total_reactions": 2,
      "user": "thebeardedoneuk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "I don't think I've ever seen a movie like Maggie. This movie hit me hard emotionally when I saw it a month ago and I have not been able to get it out of my mind since. Arnie plays a father who shows his daughter love, devotion, trust and dignity after she is bitten and infected with a virus that will eventually turn her into a zombie like state, Where everyone else pretty much gives up on her he refuses to. Abigail Breslin plays Maggie as a teenager who accepts her fate without any outlandish behavior and just wants to be with family when the end comes, Her father is the only real family she has left. Breslin is outstanding in this role, she reminded me a lot of my own daughter which is probably why it hit me so hard. If the movie concentrated on just these two and trimmed maybe 10 to15 min I would have given this movie a 10",
      "total_reactions": 2,
      "user": "Grogmonster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2015
      },
      "score": 2,
      "text": "Maggie 2015 is one of those movies that is a great example of how not to make a movie and how to waste everyone's time.",
      "total_reactions": 1,
      "user": "Heaviermetal"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2015
      },
      "score": 10,
      "text": "Very good movie, although quite sad and emotional.  If you're looking for an action movie or the type of Arnold fare of days past forget this movie.  Zombies are just the vehicle used to grab your attention.  Everybody loves zombies and Arnold.  But this movie is about the tragic, sad deterioration of a sick daughter suffering from a nasty disease and deeply loved by her father who must watch his daughter slip away and will ultimately have to make some tough decisions at the end.  The disease could have easily been cancer and it would be the same movie.  I was very impressed with the actress who played Maggie and Arnold's performance was extraordinary.  The man can act.",
      "total_reactions": 1,
      "user": "nonaste"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2015
      },
      "score": 3,
      "text": "f the audience goes into this movie thinking Arnold is going to be fighting zombies and killing bad guys, they will be extremely disappointed. Maggie is simply a father-daughter drama, taking place in an apocalyptic world with not much else going on.",
      "total_reactions": 1,
      "user": "ReysonPoint"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "Maggie is a film that was marketed as a slow drama with zombies. It turned out to be a pretty good slow drama that had a fresh take on the zombie apocalypse story we all know. It is widely disliked for not being an action-packed piece of crap with Arnold Schwarzenegger cracking one-liners constantly like they all thought it was going to be. If someone could explain that to me, that would be great.",
      "total_reactions": 1,
      "user": "BrianAD9"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "The normal zombie movie would be all about killing zombies with strange weapons or firearms, but this movie give us a new perspective. It was very touching see how Maggie sickness advance and i think everybody have acted well during the movie. All the characters act realistically from Wade and Maggie to Caroline and the cops that want to finish the work faster because they don't want have further problems.  It's a drama story, this is not an action movie or horror one , but it can touch you like the past two genres won't do. If a movie is slow is not a problem and i've not found this movie so slow. Great Movie , i hope independent production realesed more often movies like this.",
      "total_reactions": 1,
      "user": "Pippo93"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "Decent movie. Don't listen to the likes of \"ArkhamKnight \" here. if you look at his profile, all he does is bash movies he does not understand. It s a decent movie. nice to see Arnold in a different role.",
      "total_reactions": 1,
      "user": "DannoMano"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "Every moment of Maggie is brilliant and emotional. Breslin and Schwarznegger both give solid performances, and the movie is very, very, well written. Henry Hobson has done justice to Arnold fans, and given him the role of his lifetime. I can compare Maggie to my favourite video game, The Last Of Us. The result is haunting, suspenseful, terrifying and thrilling, every moment was crackling with suspense, an eerie quietness and powerhouse performances and emotions. Wade knows that Maggie will die, but he stays close to her till her last breath. Maggie captures the relationship between a father and her daughter masterfully. It's dark and scary, and meets the requirements of a zombie outbreak and its effect hits home. Maggie deserves a staring ovation. It's brilliantly written, sharply directed, masterfully acted and well executed. Take your father to watch this one, it's a love letter to all fathers in the whole world. Being a father himself, Schwarznegger beautifully captures a role of a father struggling to help his daughter before she turns into the things he most hates. Maggie deserves to be watched. 10/10.",
      "total_reactions": 10,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "This was a wonderful movie about a family having to deal with the inevitable death of their daughter. It touches on death and knowing that a loved one will die and how people around them cope with it. Great movie",
      "total_reactions": 8,
      "user": "jamessamuel"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "It was awesome to finally see Arnold in a serious dramatic role. The movie is slow and tragic but that is what makes it so unique to the genre. Maggie is a fantastic piece of work that reminds me of \"The Last of Us\" in its best moments. Sad thing is most people probably won't be able to sit still long enough to enjoy it.",
      "total_reactions": 4,
      "user": "wgillis"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "For every dumbass review of zero I will score it a ten.Arkham you are a ra tard. You know NOTHING about movies.Police Academy got a 7 and you think a zero is fair? Go watch Batman .How many different Batman's are there anyway? Enough's enough .",
      "total_reactions": 6,
      "user": "capone5150"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "Don't expect this to be an action movie or even a zombie movie.  And thank goodness for that.  If you're interested in seeing a slow-burn film about a family put into an impossible position by love and circumstances, your time will be respected.  It's as refreshing to see a movie deal with zombies as something other than an action or horror plot device as it is to see Schwarzenegger play a human being instead of a comic book character or a one-liner vending machine.",
      "total_reactions": 3,
      "user": "delusionnn"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "\"After his daughter (Abigail Breslin) is infected with a virus that transforms her into a zombie, a small-town farmer (Arnold Schwarzenegger) will stop at nothing to save her.\"",
      "total_reactions": 7,
      "user": "JohnKristofer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "Nothing new to see here. Some good scenes about a person dealing with the inevitability of turning into a zombie, but really didn't dive into anything we haven't already seen from a Walking Dead episode.",
      "total_reactions": 2,
      "user": "jlplatten"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "Arnold Schwarzenegger in a zombie drama movie, hmm  interesting.",
      "total_reactions": 2,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "This was a beautiful, bumpy ride to a horrible ending. The story was beautiful, but the film suffered a lack of pacing. Some moments were extremely thrilling, some moments seemed to drag on forever, and some moments built to nothing. That is where the ending comes in. This movie is ultimately about Schwarzenegger's character, not Breslin's, and the ending resolved Breslin's storyline, but Schwarzenegger's storyline was not resolved. Had they added another scene at the ending resolving his storyline, my score would have been a point higher. This is one of Schwarzenegger's better performances, and it stands out among other zombie flicks.",
      "total_reactions": 3,
      "user": "bigtunaonfilm"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2015
      },
      "score": 1,
      "text": "Trash, nothing but total trash from beginning to end. A melodramatic bore that failed on nearly every level. Contrived, torturous and the fact Arnold Schwarzenegger is in this type of role is a failure in of itself.",
      "total_reactions": 7,
      "user": "csw12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "Schwarzenegger has grown a beard and added a new skill to his notable acting ability: crying (total 2 tears). He plays a protective father whose daughter (Abigail Breslin) has been infected by the zombie virus that's terrorizing the world. He stubbornly defies authorities and struggles to hold on to her humanity. You expect this type of film to be bleak, but this one is saturated with slow somber suffering. While the concept offers an original spin, the tedious pacing, relentless dismal emotions and heavy-handed score drag it down. The most affecting moments are between Breslin and her teen friends. (Criterion Cinema only)",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 4,
      "text": "You won't miss anything if you skip this movie. If you like to see Arnold a little tuned down, and have nothing better to do, sure ... but it's basically a slow predictable drama.",
      "total_reactions": 1,
      "user": "Idiota150"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2016
      },
      "score": 3,
      "text": "This is just one of those scenes from The Walking Dead where someone's been bitten and they're waiting to turn--but strung out for 95 minutes. If you've seen the trailer, you've seen the movie.  Add tons of shaky cam, slow pacing, and \"indy film\" camera angles to make it extra pretentious.  No twists, no new take on zombies, zero surprises.    It was seemingly made by people who've skipped the zombie genre for 20 years and thought they discovered this scenario themselves.",
      "total_reactions": 0,
      "user": "goodterling"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2015
      },
      "score": 9,
      "text": "Touching, bleak, thoughtful... makes 'The Road' look like National Lampoons Apocalypse Vacation by comparison. Good performances all round, and best original take on the Zombie genre for a long time.",
      "total_reactions": 0,
      "user": "Themadcow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2015
      },
      "score": 2,
      "text": "ce film est d'un ennuie mortel ! j'esperé que cela s'anime a un moment ou a un autre, mais non, jusqu'a la fin on ce tourne les pousses. bref passez votre chemin !",
      "total_reactions": 0,
      "user": "torax"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "Ok let me start by saying, this is a drama, based in a Zombie epidemic. A inside view of farmers family dealing with a infected family member. There is no action and there is very little gore, its not a horror as such. Now my personal opinion. Lots of new going on in this film, i normally don't like Drama's but i am glad i gave this one a go. Acting is brilliant, the story is brilliant but slow, it's atmosphere paced and very touching. Very different take on a zombie apocalypse. Arnold's acting was brilliant and very surprising, Not massive dialogues, but enough, with the expressions and portrayal, Arnold did well. Everyone else in this movie also made it happen, nothing was flawed and it all came together well. Now it is slow and i was tempted to skip forward here and there but i stuck with it until the end and i am glad i did. It leaves a mark on you. Go into this movie expecting only a drama based in the zombie world and a whole new side to Arnold and you will appreciate it. Once again Drama's not my thing and Arnold's usual work is more to my taste, but i appreciated everything in this film, so on that perspective, il give it a 8.5/10. Its a shame people have not judged the film correctly. Nearly all Negative reviews say \"Bah where's the gore\", \"bah no action\" or \"Bah i hate Arnie\". If you see reviews involving anything similar to that... they have not watched it knowing what they were about to watch or are bigoted.",
      "total_reactions": 0,
      "user": "babalonkie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "Deeply moving and superbly acted and written movie.  The story develops slowly as the tension builds while you grow to care about these people and the situation they are forced to deal with. The music adds the final element to complete the atmosphere of terror and sorrow. A totally unique movie experience with elements of the classic zombie masterpieces of the past making it a rare and special gem. Be patient with this and you will be rewarded. It will stay with you unless you have no soul.",
      "total_reactions": 0,
      "user": "osprey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2015
      },
      "score": 6,
      "text": "There are stretches of painfully boring silence, but the movie really starts picking up in the second half.  It was good to see Arnold in something different, however, this movie belongs to Abigail Breslin. Not your typical mindless zombie film.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2015
      },
      "score": 7,
      "text": "A tale of a father who stood by his daughter till the final.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "While the film may have been a slow burn I felt interested throughout.  Arnold Schwarzenegger is fantastic in this role as a father who knows what's best for his daughter but can't come to grips with the right decision.  Overall this dramatic zombie film was a surprise.  B+",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "I liked this film, and I really wish I could give it a higher score.",
      "total_reactions": 0,
      "user": "adpirtle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "This movie was a real surprise at a retail store as I had missed its theatrical release. I took a chance on it, knowing nothing but the two excellent actors, and was not disappointed in their performances. This is not an action film, and doesn't apologize for it, and those who review it negatively are incompetent movie watchers who don't understand that there's more than one genre of film. This film sort of has an old-school M. Night feel to it, in the vein of The Sixth Sense--slow, suspenseful, nags at you, because you never know what's going to happen. But it doesn't throw blood in your face--this is not The Walking Dead, and that's what many reviewers are ignorantly comparing it to. Whatever, I bought it, watched it twice already, will watch again.",
      "total_reactions": 0,
      "user": "jsharbour"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "In an over-crowded market where fighting for the flesh of the masses is the norm, it’s always a surprising pleasure to witness one of these somnambulistic walkers twist the event inside out and present something very different in a very familiar setting. To overtly put, Maggie has breathed some new life into the tired zombie sub-genre.",
      "total_reactions": 0,
      "user": "Terminated"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "Maggie is an UFO in the movie landscape. Beautiful images, lightings.and what about that gripping performance from Schwarzenegger. Really moving performance and a Must see",
      "total_reactions": 0,
      "user": "doudiss"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "Excellent movie. The finale was quite unexpected and not totally satisfying, but the performances of Schwarzneger and Breslin respectivly are simply fantastic. I also like the different approach on the ,now overdone, zombie movie trend. So, 1010.",
      "total_reactions": 0,
      "user": "vladimir9911"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2016
      },
      "score": 3,
      "text": "This movie should have been called \"I Was A Teenage Zombie.\"  Predictable and derivative.  Boring.  Minimalistic.  Bad cinematography and coloring.  My biggest complaint is they don't play \"Free Falling\" at the end.",
      "total_reactions": 0,
      "user": "DCMovie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2015
      },
      "score": 9,
      "text": "One of the Best drama i ve ever seen!Pure true drama.Not only effects and killing.Every scene hides so much emotion!I recommend it.I like some meanings of the movie.Really great one!",
      "total_reactions": 0,
      "user": "Copa"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2016
      },
      "score": 5,
      "text": "It burns me to say this but Maggie isn't quite emotional, quite sad in some scenes, but not during the entire movie, and the pain Wade Vogel (Arnold Schwarzenegger) has been having with Maggie Vogel (Abigail Breslin; she got infected by a zombie) isn't really much to say and zombies have really been overused in movies.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "I honestly can say that I did not find any flaws with this movie, due the fact that I was so engrossed in this masterpiece.  I grew up watching Arnie blow stuff up, be a twin, dress up as Turboman, but Maggie is without a doubt his best performance.  The macabre undertone of 1 of 3 impending outcomes would be more than enough to push anyone to the breaking point, and Arnie hits the nail dead center on the head.  Brav-effing-o.",
      "total_reactions": 0,
      "user": "foodismusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2016
      },
      "score": 10,
      "text": "First, I have to clarify this... Maggie is a human drama. Period. If you are expecting it to be anything else(an action movie or a horror movie or maybe even a zombie movie), this is not the movie that you are looking for. I know it sounds like I'm exaggerating, but I'm certainly not.",
      "total_reactions": 0,
      "user": "G1ock"
    }
  ]
}