{
  "avg_user_score": 6.1,
  "metascore": 76,
  "mixed_rating_frequency": 13,
  "movie_name": "Maggie's Plan",
  "negative_rating_frequency": 9,
  "positive_rating_frequency": 22,
  "pro_critic_reviews": [
    {
      "critic": "Dan Mecca",
      "publication": "The Film Stage",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2016
      },
      "score": 91,
      "summary": "Miller’s New York, full of academics who still have the capacity to act like children, isn’t exactly new, but plenty fascinating."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2016
      },
      "score": 89,
      "summary": "Maggie’s Plan is an ensemble piece, with Maya Rudolph, Travis Fimmel, and a magic, romantic New York rounding out the cast. They’re all great, but it’s Gerwig who’s just so damn gosh-wow."
    },
    {
      "critic": "Moira Macdonald",
      "publication": "The Seattle Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2016
      },
      "score": 88,
      "summary": "It’s a sweet, faintly screwball, faintly Shakespearean look at love, families and what happens when a well-made plan goes just a bit awry."
    },
    {
      "critic": "Johanna Schneller",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2016
      },
      "score": 88,
      "summary": "Miller’s characters are complete, singular people, and her take is thoroughly female. She subverts the genre, and wakes it up."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2016
      },
      "score": 88,
      "summary": "It’s a fine brew, equal parts cynical and whimsical, dark and sunny. It’s fairly slight but nearly great."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2016
      },
      "score": 88,
      "summary": "Without pushing or showing off, Miller creates a breezy comedy that pulls you up short. Buoyed by faultless actors who mesh beautifully, Maggie's Plan tickles you with laughs that can — suddenly or even days later — choke you up with emotion."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2015
      },
      "score": 83,
      "summary": "Miller applies Gerwig to the center of a busy story with simple themes, but it glides along so effortlessly that its reductive qualities barely register. The filmmaker's exceedingly smart screenplay is the real plan, and Gerwig's performance puts it into action."
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2015
      },
      "score": 83,
      "summary": "Witty, observational, and hilarious, Maggie’s Plan is the kind of richly complex dramedy that proves to be the rare picture that serves both halves of that genre description fully, equally, and satisfyingly."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2016
      },
      "score": 80,
      "summary": "Don’t underestimate the knitwear in Maggie’s Plan. This comedy from Rebecca Miller says more about the human condition through its cardigans than most films this summer have managed in their scripts."
    },
    {
      "critic": "Tom Duggins",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2016
      },
      "score": 80,
      "summary": "Maggie's Plan is over-educated satirical skewering at its finest - to be enjoyed at leisure, between symposia perhaps, or other perambulatory Manhattan-style discussions of crypto-narratives in the modern family unit."
    },
    {
      "critic": "Cath Clarke",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2016
      },
      "score": 80,
      "summary": "Intelligent and screwball-funny with clever and complicated female characters."
    },
    {
      "critic": "Jimi Famurewa",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2016
      },
      "score": 80,
      "summary": "A perfectly cast comedy of manners that couches complex emotional questions in joyous farce and continues Gerwig’s reign as the undisputed Queen Of Quirk."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2016
      },
      "score": 80,
      "summary": "Ms. Miller’s choices are hard to argue with. She steers gracefully through a zigzagging plot, slowing down for quiet, contemplative stretches and pausing for jokes that are irrelevant but irresistible. She finds a tricky balance of farce, satire and emotional sincerity, a way of treating people as ridiculous without denying them empathy."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2016
      },
      "score": 80,
      "summary": "Ms. Miller proves to be an original, setting her comic characters in motion like mini-planets that spin in eccentric but overlapping orbits."
    },
    {
      "critic": "Katie Walsh",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2016
      },
      "score": 80,
      "summary": "The writing crackles, and Miller doesn’t waste time getting right at the meat of the story."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2015
      },
      "score": 80,
      "summary": "The picture is one part vintage Woody Allen, a few parts Screwball-era comedy of remarriage, and a vigorous shake of Gerwig herself, without whose particular spirit — \"so pure,\" as an admirer puts it here, and \"a little stupid\" — this scenario might have trouble getting off the ground."
    },
    {
      "critic": "Tim Grierson",
      "publication": "Screen International",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2015
      },
      "score": 80,
      "summary": "All three leads get stronger as the movie goes along, in part because Miller’s full intention isn’t clear until about halfway through. These characters are foolish without being idiots, which produces a more sophisticated type of comedy."
    },
    {
      "critic": "Dennis Harvey",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2015
      },
      "score": 80,
      "summary": "Miller is greatly helped by all her major collaborators here."
    },
    {
      "critic": "Nigel M Smith",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2015
      },
      "score": 80,
      "summary": "It’s unpredictable and a bit of a mess. And that’s what makes Maggie’s Plan such a delight."
    },
    {
      "critic": "Calvin Wilson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2016
      },
      "score": 75,
      "summary": "A sophisticated comedy about New Yorkers who might easily be mistaken for characters in a Woody Allen movie."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2016
      },
      "score": 75,
      "summary": "The Oscar winning Moore slings just enough of an accent for her lines to be funny. Her top-knot hairstyle says everything about the character we need to know — frosty, severe."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2016
      },
      "score": 75,
      "summary": "This is the rare occasion when one of these brittle, neurotic social comedies serves as the vehicle for a woman’s sensibility rather than a man’s. In the process, Miller quietly but forcefully reinvents an entire movie genre."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2016
      },
      "score": 75,
      "summary": "There’s also a lightness in the tone that yet allows for real emotion and impressive performances. Maggie’s Plan doesn’t quite transcend the limits of the romantic comedy genre, but it pushes at them."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2016
      },
      "score": 75,
      "summary": "Maggie’s Plan exerts unmistakable charm, and once it hits its stride and the titular scheme kicks into gear, the movie takes on its own weird, giddy rhythms and really soars."
    },
    {
      "critic": "Leah Greenblatt",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2016
      },
      "score": 75,
      "summary": "Sometimes that tips too far into silliness (the final scene, especially, works strenuously towards an end-cute); still, its mildly subversive rom-com sensibilities are just sour-sweet enough to pull it off."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2016
      },
      "score": 75,
      "summary": "Writer-director Rebecca Miller never wrests her movie free of its associations with the films of Woody Allen and Noah Baumbach, and some of it plays like a generic indie film rom-com."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2016
      },
      "score": 75,
      "summary": "Maggie’s Plan isn’t perfect — the threads of its plot are sometimes a little too loosely knit — but Miller’s clearly got her finger on the pulse of the New York intellectual comedy."
    },
    {
      "critic": "Sam Adams",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2016
      },
      "score": 75,
      "summary": "Like any artist, Miller has the right to reinvent herself, but we don’t need one more director of winsome, Sundance-ready rom-coms. That said, as winsome, Sundance-ready rom-coms go, Maggie’s Plan is a pretty winning one."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2016
      },
      "score": 70,
      "summary": "Maggie’s Plan doesn’t quite gel, but it’s very enjoyable, and it has a solid emotional core."
    },
    {
      "critic": "April Wolfe",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2016
      },
      "score": 70,
      "summary": "Maggie's Plan is a fun light comedy with memorable characters, from a writer-director who lives up to her lineage (Arthur Miller's her dad), but it relies heavily on Gerwig's predictable charm and sometimes seems more Woody Allen than Rebecca Miller."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2016
      },
      "score": 63,
      "summary": "Gerwig and Hawke are outstanding reasons to see this movie, but your patience — just like Maggie’s — will be tested before it’s over."
    },
    {
      "critic": "Christy Lemire",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2016
      },
      "score": 63,
      "summary": "Maggie’s Plan almost isn’t screwball enough. The characters must undergo some introspection, as well, and striking a balance between those two dynamics proves challenging."
    },
    {
      "critic": "Jake Cole",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2015
      },
      "score": 63,
      "summary": "As a writer and director, Rebecca Miller is at her best when she finds the shared wavelengths of her lead cast's divergent styles."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2016
      },
      "score": 58,
      "summary": "A comedy that proves that an appealing cast (Gerwig, Ethan Hawke, Julianne Moore) and a wonderful premise are no guarantee of big laughs."
    },
    {
      "critic": "Nina Corcoran",
      "publication": "Consequence of Sound",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2016
      },
      "score": 50,
      "summary": "The script, although endearing, is too poorly edited to lift its quirks to the next level, no matter how many stars show up for roll call."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2016
      },
      "score": 0,
      "text": "Don't Let any positive reviews here  FOOL you !! Written by FOOLS. This is a Pretentious, superficial piece of ....... you know what. Actually HORRIBLE!!! The Dialogue alone s BEYOND vomit worthy. Attempting to be Woody Allen isk  A HUGE MAJOR FAIL!!!  In the GREAT WOODY ALLEN movies if a character is pretentious the audience is IN ON IT NOT SO HERE OH MY GOSH RUN THE OTHER WAY SO BAD  SO HORRIBLY BAD. A good cast directed by a spoiled rotten delusional girl whosE father was FAMOUS and rightfully so",
      "total_reactions": 2,
      "user": "DUMBFREDDY"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2016
      },
      "score": 5,
      "text": "Even though she's supposed to be quirky and charming, I've never found Greta Gerwig either (in this movie or her 2 other leads in Frances Ha & Mistress America). She plays a woman ready to have a baby, when she falls for a married man (Ethan Hawke). Complications ensue when his ex-wife (Julianne Moore, in a fun take on a Danish intellectual) gets in the mix. This feels like a minor Woody Allen film: New York locations, a group of academics, confused love and plenty of neuroses. Although it's moderately involving, it's hardly ever funny, clever or especially unique. Plus, I found most of the other actors more interesting than Gerwig.",
      "total_reactions": 4,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2016
      },
      "score": 5,
      "text": "Aside from a fine supporting performance by Julianne Moore, this alleged screwball romantic comedy is slow-paced, unfunny and not especially amorous. What more is there to say? It's basically a lightweight, eminently forgettable picture, one that I'm amazed ever reached production.",
      "total_reactions": 4,
      "user": "Brent_Marchant"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2016
      },
      "score": 0,
      "text": "Boring, unfunny, contrived film that I am amazed made it to the film festivals, distributors, movie screens.  The handful of people in the theatre with me were largely unresponsive to this stunted production.  Ridiculous plot with insipid characters who were supposed to be funny.  Julianne Moore's accent was a mystery; Gerwig was the usual Gerwig; poor direction, poor script, I found this movie to be a complete waste of time.",
      "total_reactions": 3,
      "user": "Earlsmama"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2016
      },
      "score": 10,
      "text": "Wasn't sure how much I was going to like this at first. I thought it might turn out to be one of those overly quirky movies, but I was wrong. It was wonderful. I enjoyed every minute of it.  Greta Gerwig could be considered the Diane Keaton of this generation. She was wonderful in \"Maggie's Plan.\" So was Ethan Hawke and the rest of the supporting cast, including Bill Hader, Julianne Moore, Maya Rudolph, and Travis Fimmel (whom I am not familiar with) as the potential sperm donor. Loved the NYC setting, too. It reminded me of a good Woody Allen-type story, so if you like that sort of thing, you will like this, too.",
      "total_reactions": 4,
      "user": "preciouskiki"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2016
      },
      "score": 3,
      "text": "Watching \"Maggie's Plan\" a few thoughts went through my mind starting with the role of Maggie was begging for a 25 year old Meg Ryan and Greta Gerwig is not her. Meryl Streep better watch out if Julianne Moore decides to give her a run for believable accents and Moore should insist that Malgopsia Turzanska never be the costume designer on any of her future movies.",
      "total_reactions": 2,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2016
      },
      "score": 7,
      "text": "Once more, Greta Gerwig finds herself as a lost, naive, and unsure 20 something living in New York City. As typical, Maggie's Plan is an interesting little indie dramedy in which Gerwig turns in a very good performance. Though her characters are becoming quite one note at this point, her ability to pull off the role is undeniable. Plus, she is well matched here by Ethan Hawke who plays a self-absorbed and unethical man that seemingly cannot control his sexual urges. Julianne Moore, however, steals the show as his foreign and experienced wife. Together, these actors help bring to life this charming, heartbreaking, and thoroughly relatable tale of love and marriage. Though quite the typical indie dramedy, writer/director Rebecca Miller breathes some new life into its conventions with this thoroughly odd and off-kilter story, plus conjuring great chemistry between her actors. The film is both family and touching, while also being thoroughly engaging. Overall, Maggie's Plan works, though typical in its blend of comedy with serious life occurrences.",
      "total_reactions": 2,
      "user": "Spangle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2016
      },
      "score": 2,
      "text": "The silly season is not lifted one iota by this critically lauded, but extremely overrated comedy- drama.  Comparisons can be made to a bad Woody Allen outing in so much as the film is set in New York and has a very verbose script, but similarities end there. Whereas Allen at his best employs great actors in good stories this verbiage finally adds up to nothing more than pretentious drivel. Despite a good start with early scenes promising an Art house level of sophisticated articulation, it’s not long before the eyes glaze over, the ears tune out and one is left to endure a bunch of uninteresting characters espousing little more than blah, blah, blah. All three leads are not at their best. Greta Gerwig is still Greta who? Julianne Moore continues to lose her edge in yet another downward spiral performance and even Ethan Hawke is the weakest he’s been for years. In fact, it is the supporting turn of Bill Hader that impresses most as Gerwig’s ‘say it as it is’ best friend. Ultimately the film is neither funny nor dramatic enough to make one care about any of these tiresome characters and their predicaments are totally uninvolving. As for the jolly incidental music, this is just another irritating aspect of a small and insignificantly forgettable film.",
      "total_reactions": 2,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2016
      },
      "score": 1,
      "text": "I wish I'd spent my money on any other movie in the theater. Maggie's Plan is listed as a \"romantic comedy\" but it was neither romantic or funny. Sorry, but it wasn't entertaining at all. In the entire audience there was only one light chuckle. Maya Rudolf had only a minimal part. There was one \"gratuitous\" bare breast and absolutely no story worth the time or money to see it.",
      "total_reactions": 2,
      "user": "Waveguide3"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2016
      },
      "score": 10,
      "text": "This is an extremely good movie. There are so many lovely ways to appreciate it I don't know where to start. The cast does an exceptional job. The director uses them perfectly and edits and paces things perfectly. Quality scene after quality scene. In Olympic diving they have a degree of difficulty scale. This movies degree of difficulty is at the absolute top notch. Yet, they nail scene after nuanced scene after complex scene after emotional after funny after charming scene. Critics should be raving about this movie. Its so hard to pull this sort of thing off. Because critics don't make movies they don't know how hard it is. Go see this movie and enjoy enjoy enjoy.",
      "total_reactions": 3,
      "user": "Proteus"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2016
      },
      "score": 6,
      "text": "The movie was watchable, especially Greta Gerwig's performance, but as several reviewers mentioned, it's not funny enough, and much of it is entirely predictable. I knew in the first five minutes how it would end, and that predictable ending is really unforgivable. SPOILER: Could a movie end with a single woman happily raising a child by herself, for once? Apparently not. Other turnoffs for me: the two married best friends, who of course are adorable and happy together -- such a cliche. Also, I'm a NYC professor, and let me tell you, no one has apartments like that who isn't born with a silver spoon like Donald Trump, and would never say things like \"No one unpacks commodity fetishism like you do.\" Please. For some reason, movies never get the way professors really talk -- if anything, they bend over backwards to avoid being seen as pretentious, so they're more likely to speak self-deprecatingly or ironically/ jokingly --they would never say something like that seriously. Altogether, the movie seemed as fake and contrived as could be,, except that I did enjoy the way the couple acted when their marriage began to go downhill. \"Do you want to hear your horoscope?\" \"Um, no.\" Now that has a ring of truth -- but I can't say the same for most of the movie.",
      "total_reactions": 1,
      "user": "amaryllisvn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2016
      },
      "score": 6,
      "text": "Who: Greta Gerwig, The Dad from Boyhood, Stefan, and The sh*tty version of Clarice Starling as Georgette",
      "total_reactions": 1,
      "user": "RvwFromUpHere"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2016
      },
      "score": 8,
      "text": "The reason to see this film are the performances of Greta Gerwig,who seems made for this type of role, Bill Hader, and  Maya Rudolf, her best friends, and who wouldn't want friends like that, that offer solid shoulders to lean on. Ethan Hawke and Julianne Moore as the couple at the crux of Maggie's plan are two totally unlikable characters who readily deserve each other. Hooray for the pickle salesman!",
      "total_reactions": 1,
      "user": "RAISEDbyWOLVES"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2016
      },
      "score": 10,
      "text": "I LOVED Maggie's Plan. What I loved most about this wonderful film was the dialog, which comes at you at a relentless and nonstop and WONDERFUL way. Gerwig is so believable and another's reviewers comparison to Woody Allen-era Diane Keaton are spot on. Not that she's a Keaton clone, she's comes across so sincere and really wanting to do the right thing, but things just don't work out. The few pieces of music fit in so perfectly (altho I\"ve always hated Bruce Springsteen, I actually found my self liking Dancing in the Dark in the one scene with the bar band version.) There are obscure reggae cuts that feel so right and so great in the movie.  The scenes  involving her children are heartbreakingly  adorable. And the kids are so adorable....whatever Maggie's  Plan was, the results are these kids who have the most wonderful(seemed to be using that word alot) rapport with Gerwig.. Juliane Moore is great as the ice queen who turns out to be not so icy after all. This was my favorite movie so far this year. OK I'm not the greatest at telling you why, but PLEASE see this movie.  This movie deserves a bigger audience(I saw it in an audience of three people) and I wish this would be come a huge suprise hit. It won't, and that will be alot of people's bad luck, because Maggie's Plan is (sorry) WONDERFUL. There's just no other word that does it.",
      "total_reactions": 1,
      "user": "bobmeier"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2016
      },
      "score": 7,
      "text": "Returning a product to the previous owner!",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2016
      },
      "score": 6,
      "text": "A film that treats marriage and relationships like a ping pong ball.  Don't get me wrong there are parts of this film that really worked for me but overall it is just decent.  B-",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2016
      },
      "score": 6,
      "text": "I've begun to feel like I'm watching a Woody Allen movie every time I see Greta Gerwig.  We have the talky characters who have emotional problems and neuroses, we have the awkward situations, yada yada yada.  At the end, we have the typical Woody Allen ending, everyone's happy.",
      "total_reactions": 0,
      "user": "smiyamot"
    }
  ]
}