{
  "mc_avg_user_score": 6.6,
  "mc_metascore": 59,
  "mc_mixed_rating_frequency": 1,
  "mc_movie_name": "Magic Magic",
  "mc_negative_rating_frequency": 1,
  "mc_positive_rating_frequency": 3,
  "mc_pro_critic_reviews": [
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2014
      },
      "score": 80,
      "summary": "Meticulously acted, gorgeously shot and hilariously insightful about the strange, inarticulable ways people can get on one another’s nerves, this psychological thriller takes its premise to surprising, darkly comic extremes."
    },
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2014
      },
      "score": 60,
      "summary": "The first half of Magic Magic is greatly enjoyable... Sadly, director Sebastián Silva isn’t sure where to take his characters."
    },
    {
      "critic": "David Hughes",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2014
      },
      "score": 60,
      "summary": "Chilean writer-director Sebastián Silva’s neither-fish-nor-fowl narrative plays tricks on our minds, without fully engaging our senses."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2014
      },
      "score": 60,
      "summary": "The film falls apart once its mysteries dissipate. With them go all the dark ambiguities that colored the first hour."
    },
    {
      "critic": "Sebastian Doggart",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2014
      },
      "score": 60,
      "summary": "The script unsettles, but never scares, so it doesn't work as a horror film. It's also not a convincing chronicle of deteriorating mental illness."
    },
    {
      "critic": "Matt Glasby",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2014
      },
      "score": 60,
      "summary": "It ebbs away at the climax, but there’s 45 minutes where it sings loud and strange."
    },
    {
      "critic": "Rodrigo Perez",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2014
      },
      "score": 42,
      "summary": "There’s a terrific ensemble at the heart of Magic Magic, including its talented director, but this psychological horror is only creepily superficial and has very little of anything insightful to say about people, its characters or its lead."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2014
      },
      "score": 6,
      "text": "I agree with most of the professional critic reviews.  The acting is nearly perfect.  However, I am distracted by Michael Cera's celebrity status and his playing a character so different than his usual roles.  I admit for the sake of creating tension Cera does a good job overall.  The directing is quite good too as tension and mystery builds throughout..  the problem is the actual story, plot points and resolution.  Once the film is done we are left with a kind of \"o.k.. so... what\"   feeling...  SPOILER ALERT STARTS HERE:  The film is basically about a girl, Alicia who has apparent social and mental health issues being hosted by strangers to a comfortable cabin in a remote area.  O this trip we realize that no one she is with is qualified to diagnose her or interested in connecting with her or even  interesting in spending much energy to help her feel comfortable.  There's a scene where they do the same thing to an abandoned puppy at the start and this is the foreshadowing of Alicia's fate.   The plot points and story build on moments where the group is basically indifferent to the fact that this girl, Alicia, is really uncomfortable maybe even ill.  She is so uncomfortable its kind of annoying everyone around her so its obvious they know she is unhappy. The director shoots the film in a way that puts us, the audience, on Alicia-the-awkward-girl's side. The  tension throughout is therefore created by a group of antagonists that are just indifferent to her experience making me shout at the screen :\"what an a**hole thing to say/do\".  As the film builds we get glimpses of  a Alicia having a kind of warped perception of reality leading to our understand that she is probably verging on a psychotic breakdown.  The indifference of the group to her troubles culminates and turns when she finally disappears and starts to really crack up.  Then the ineptitude of everyone she is in contact with seals her demise.  So the end leaves you with this feeling: don't take a person with mental health issues on a trip with indifferent, cold and immature strangers to a remote area.  in fact, its more like, \"just go camping with people you like\"  kind of message from the story.   its a shame because there's a lot of good work by everyone involved. This film has a mood and a feeling to it, which, as elements to the film are artistically executed and realized.  but the film's plot and the experience of watching it neither subverts any common perspective from a culture  nor does it make any original point. It also doesn't scare or thrill the viewer as a horror film would, nor does it twist your p.o.v.  into seeing things from a whole new perspective as a good psychological thriller would.   it has tension, mystery and suspense without really doing anything with it.  Its like the artists involved put there best work together but didn't really have a reason or a destination in mind.  It was tension, mystery and suspense for the sake of tension mystery and suspense.  like watching a dunking contest  with some great basketball players but wishing you had the full basketball game with the rival team and the rules to create the  dramatic arc or story from beginning to end. the film's point was basically made with the puppy scene.  they took a sick puppy out of its element away from its sibling and dropped it in a remote area where it was left to suffer alone... then they did the same with Alicia. why even make this movie?",
      "total_reactions": 0,
      "user": "djalex"
    }
  ]
}