{
  "mc_avg_user_score": 6.0,
  "mc_metascore": 72,
  "mc_mixed_rating_frequency": 64,
  "mc_movie_name": "Magic Mike",
  "mc_negative_rating_frequency": 52,
  "mc_positive_rating_frequency": 132,
  "mc_pro_critic_reviews": [
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2012
      },
      "score": 100,
      "summary": "As we face yet another summer of brooding superheroes, it's Magic Mike to the rescue! He's got the civilian alter ego and the acrobatic skills to rival Spidey or Batman."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 100,
      "summary": "If it falls short of greatness, it's not by much - and it could end up growing with the years. At the very least, it is exceptional and one of the best and most original pictures to come along in 2012."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2012
      },
      "score": 91,
      "summary": "The movie is Mike's story, and Channing Tatum proves himself a true movie star. His Mike glides through the world with the ease of a god, and on stage he's electrifying."
    },
    {
      "critic": "David Rooney",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2012
      },
      "score": 90,
      "summary": "The raunchiest, funniest and most enjoyably nonjudgmental American movie about selling sex since \"Boogie Nights.\""
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2012
      },
      "score": 88,
      "summary": "Director Steven Soderbergh is working very near the top of his game here, and if Magic Mike tells an old, old story about a young man, his talent, his rise, and his fall - see everything from \"Saturday Night Fever\" to \"Boogie Nights\" - he brings the confidence of a born filmmaker and a cast that's sharper than their characters and ready to play."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 88,
      "summary": "One of the pleasures of Magic Mike is its egalitarian spirit and dedication to the ensemble."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 83,
      "summary": "Magic Mike casts a seriously entertaining spell."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2012
      },
      "score": 83,
      "summary": "Even when Magic Mike is skimpier than a g-string it soars on daring, as if Soderbergh asked himself who could possibly make a good movie from such offbeat material, answered \"I can,\" and did."
    },
    {
      "critic": "Neil Smith",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2012
      },
      "score": 80,
      "summary": "Soderbergh lets his hair down with a frank, funny dramedy that bulges with humour, heart and smarts as McConaughey gives it everything he's got, in a potentially gong-grabbing turn."
    },
    {
      "critic": "Steven James Snyder",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2012
      },
      "score": 80,
      "summary": "Rarely do you see an actor harness such physical energy on the screen, much less dance at this level of intensity while converting raw muscle mass into raging sex appeal. But Tatum is the real McCoy."
    },
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2012
      },
      "score": 80,
      "summary": "The final act has an inevitable wavering patch when the film is obliged to tut-tut about the shallowness of the stripping, drinking, bantering, carousing and whooping it has previously enjoyed, but this is terrific entertainment with a sideline in wry melancholia and testosterone-fuelled philosophy. Have 20 dollars."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2012
      },
      "score": 80,
      "summary": "It's better to think of Magic Mike as arty but energetic soft-core porn, with no pickle shots but plenty of juice. You should see it if only for McConaughey, an underrated leading man who finally gets a chance to use his strange timing."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 80,
      "summary": "It works - beautifully."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 80,
      "summary": "For starters, it's a pleasure to see Matthew McConaughey - a gifted actor who can't hide his boredom in trivial work - finally settle into the role for which he was born."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 80,
      "summary": "Magic Mike is a fascinating film, one of his (Soderbergh's) best in recent years."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2012
      },
      "score": 80,
      "summary": "Didn't Soderbergh notice there was pathos enough in Matthew McConaughey's beefcake proprietor, an ab-slapping, spandexed Peter Pan? Between this role and his owlish DA in the subversively sly \"Bernie,\" the actor has finally found a way to subvert his six-pack. He's the magic here."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2012
      },
      "score": 80,
      "summary": "By way of remarkable sleight-of-hand, Steven Soderbergh's Magic Mike both is and is not the freewheeling, fun-loving, male stripper extravaganza its trailers peddle."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2012
      },
      "score": 80,
      "summary": "Ladies are gonna love Magic Mike, a lively male-stripper meller inspired by Channing Tatum's late-teen, pre-screen stint as an exotic dancer."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "Magic Mike doesn't sizzle often enough as either cinema or beefcake, though.  It's medium-strength Soderbergh, which is better than the full-strength stuff most filmmakers can manage but not exactly the brand that keeps you coming back for more."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "Almost as impressive as Tatum's moves are his comic flair and breezy grace. He proved his comic talents earlier this year in \"21 Jump Street\" and shows them off winningly here."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "It's a nicely balanced blend of comedy, drama and athletic dancing that plies its trade with winking, unforced self-assurance."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "It's guilty of some sleight-of-hand hokum, but in pulling the rug from under the norm, Magic Mike turns a trick."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "Magic Mike takes itself seriously - not so seriously that there isn't room for a little humor, but this is not an excursion into cheesiness and gratuitous nudity."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "Like \"The Girlfriend Experience,\" Magic Mike doubles as an of-the-moment film about life in a down economy, so much so that it would play like a bait-and-switch if it didn't just as thoroughly deliver as a movie about stripping."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "If you can look past all the flesh and the thongs and the thrusting - and I admit that is an almost impossible task and probably not one you'd want to undertake anyway - what's most distinctive about Steven Soderbergh's Magic Mike is its sense of fun."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "Selling anyone the right to touch your genital area for a couple of bucks is not a good way to build self-esteem. Steven Soderbergh's Magic Mike makes this argument with a crafty mixture of comedy, romance, melodrama and some remarkably well-staged strip routines involving hunky, good-looking guys."
    },
    {
      "critic": "Ben Sachs",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2012
      },
      "score": 70,
      "summary": "The dance numbers, choreographed by Allison Faulk, are inventive and athletic, but not really erotic; Soderbergh never lets you forget that, for these men, dancing is above all a job."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 70,
      "summary": "The process is called acting, and the man (Tatum) in the title role of Steven Soderbergh's flashy, not-so-trashy entertainment does it so well that the debate should be officially ended."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2012
      },
      "score": 70,
      "summary": "Skeptical at first, perhaps a little embarrassed, but before you know it, you're having a blast."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2012
      },
      "score": 67,
      "summary": "Soderberg enhances the meager storyline with some creative camerawork (again shot by himself under the pseudonym Peter Andrews). The club scenes are always entertaining and some of the backstage imagery is unforgettable."
    },
    {
      "critic": "James Adams",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 63,
      "summary": "Two things do redeem the film somewhat. One is the near-uniform excellence of the cast, led by Tatum, who has a compelling, eminently watchable aw-shucks charisma, and newcomer Horn as the cute, concerned sister. The other is the easy, naturalistic flow and ebb of Reid Carolin's dialogue, which gives none of his characters a vocabulary or insights above his or her station."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 63,
      "summary": "An odd and entertaining mix of backstage melodrama, indie verite, and \"Showgirls\" kitsch, the usual gender stereotypes are upturned."
    },
    {
      "critic": "John Semley",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 63,
      "summary": "It's as if Soderbergh expects the film to mostly resolve itself, rounded out by the asses-in-the-seats appeal of the material, rote thematic underpinning, and ample charms of the cast."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2012
      },
      "score": 60,
      "summary": "Oddly, Magic Mike somehow looks like a much darker and more challenging movie than is actually the case."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2012
      },
      "score": 60,
      "summary": "The divide between Tatum as performer and Tatum as actor gives the film an interesting unsteadiness."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 50,
      "summary": "Magic Mike slowly degenerates into a simplistic cautionary fable. I didn't see that coming from a sharp observer like Soderbergh."
    },
    {
      "critic": "Karina Longworth",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2012
      },
      "score": 50,
      "summary": "The highly calculated Magic Mike is pure Hollywood self-mythology - a neo-Depression musical, a wish-fulfillment fantasy for shitty times, an origin-of-the-star story, and a projection of that star's hoped-for future."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 40,
      "summary": "Life, however, cannot be lived entirely on stage, and once the characters have to take off their thongs and return to their real lives, the film goes nowhere that is either interesting, involving or surprising."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "I was surprised by just how bland and unfocused Magic Mike turned out to be.  Soderbergh is a genuinely talented director but he can't quite seem to decide what he wants his latest film to be.  Is it a raucous crowd pleaser?  An overwrought melodrama?  A romantic comedy?  Perhaps a cautionary tale?  Ultimately it doesn't really matter because it's one of his least inspired and most detached efforts to date.",
      "total_reactions": 1,
      "user": "BKM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "Soderbergh does well to subvert expectation. After a while, however, the feeling of being pleasantly surprised wears off and the once rousing strip scenes begin to drag on. The film eventually loses its magic by relying on predictable and uninspired storytelling",
      "total_reactions": 1,
      "user": "LaGuerta"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "The doorman must turn gay guys away from the club since none ever materialize inside. The film could have used more gay--for realism, to appeal more to gay men (I was the only one in my audience), and because, as I understand it, straight women find man-on-man hot. The \"gayest\" character is a bi female stripper we meet briefly and never see again. She's most likely thrown in because straight boyfriends find girl-on-girl hot. Every 20 minutes or so the script throws them a bone--some boobs here, an I-imagine-hot woman there--but it's easily ignorable. Anyway, aside from that odd and unnecessary omission, the movie was much better than I expected. The plot was decent--maybe a little slow and trite--the characters were somewhat interesting, and the guys were hot to really hot. I didn't find the dancing, especially Tatum's, particularly erotic, but it was well-choreographed and your mileage may vary. As for skin, there are numerous nice butt and torso shots; no full frontal unfortunately (and a lack of crotch closeups come to think of it) but it's not porn and not meant to be. It does what it's supposed to and does it well.",
      "total_reactions": 4,
      "user": "JoshS"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "I am a 32 y/o man & went w/ my GF. I thought the movie was original, funny, and worth seeing. I think a lot of guys will feel embarassed about telling their guy friends that they saw this movie or even enjoyed it. Horny women, partying, drinking, drugs, sex: all the things I love in a movie. It was fun watching Channing Tatum and Matthew McConnahey* play a role that basically is their real life, women wanting to have sex with them 24/7.",
      "total_reactions": 11,
      "user": "mostmoviessuck"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2012
      },
      "score": 3,
      "text": "I'm male, and I can appreciate films like this for what they are (or aspire to be), but this is just ridiculous and completely unrealistic.  It's as if this film was made by a 40-year old feminist homophobic schoolteacher who hasn't ever even been to a strip club of any kind and just wanted something moderately acceptable to get her and her like-minded girlfriends panties wet in public.  Avoid at all cost if you're a guy, and if you're a chick then watch it at home so you can do what everyone knows you want to do while watching it but social conventions don't allow.",
      "total_reactions": 3,
      "user": "OnAnarchy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "I wished I could have seen more of Matthew McConaughey!  However, Channing Tatum was Great.  I took my Male Friend with me.  He and the other men (with their girlfriends and wives) enjoyed the movie as well.  I don't think guys should be embarrassed if they do go to this movie.  All the actors in this movie played their roles to the \"T\"!  Excelleant Movie!",
      "total_reactions": 5,
      "user": "Lize40"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2012
      },
      "score": 3,
      "text": "This movie wasn't anything. It was air. The plot was more or less non-existent, the acting was sub-par at best, the dialogue was average and the dance scenes seemed forced. Utterly forgettable, incredibly average, a total yawnfest that ran way too long. See this movie only as a last resort.",
      "total_reactions": 21,
      "user": "Lusy"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "Amazing :) I had the best time yesterday with my sisters and mama.. The energy from the crowd. The movie was exactly what was promised and it was nice that finally the lady's had something good to watch and do while the men were at home..",
      "total_reactions": 8,
      "user": "Jordanspick"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "Very much a Soderbergh film, Magic Mike definitely entertains - and is a tour de force for McConnahey's acting and Tatum's dancing. I was a little disappointed that we didn't get a few more lines from Bomer.  My single favorite aspect of the film is the chemistry between Mike and The Kid's sister.  While the rest of the film is so seedy and in-your-face with its overt and aggressive sexuality, their relationship isn't consummated at all - instead, they come together in a very classy, traditional, romantic way, finally touching hands and sharing a kiss in the film's final frame. Nice.",
      "total_reactions": 6,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2012
      },
      "score": 1,
      "text": "I'm choosing not to check the spoiler box because I won't mention specific events, but I will discuss the themes and feeling I was left with at the end of the movie, so consider yourself warned....",
      "total_reactions": 6,
      "user": "HazelWolf"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "I may not be a Steven Soderborgh, but i can easily say that this movie was a disaster. The storyline was stale, the characters were uninteresting and (lets face it) no man (unless they're gay) would want to watch a bunch of guys show to show us their junk. Truly one of the worst movies ever made!",
      "total_reactions": 2,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "I thought that it was good, however it wasnt quite what I was expecting. This movie is sopose to be for the women! (And gay guys obviously) finally we have a movie showing off the men's sexual attributes and were sick of going to the movies and watching our bfs get all hot and bothered by the female nude scenes, what I didn't like was there were some lesbians and two different girls that showed their **** that was frustrating because that is not what us women came to this movie to see! We would like to see how hung Channing tatum is obviously, we don't want to see women's boobs, like really don't we have enough movies showing that? We want our movie showing what we want to see for once!",
      "total_reactions": 2,
      "user": "CharCritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2012
      },
      "score": 0,
      "text": "This movie was terrible. I am so disappointed with Steven Soderbergh, and the writer Reid Carolin. I went with a couple of friends for her 16th birthday. We all were so disappointed. Yes, we did just go to see it for the hot guys, but come on, what a horrible plot line and camera angles. Right from the beginning, the camera above his truck...never do above shots for no reason, ever. I could have directed this better! There was no real ending to movie and there was just too many different plots happening at once. Don't see this movie. Maybe rent it from Redbox, to see the hot guys, but, ughhh. This was just the worst.",
      "total_reactions": 3,
      "user": "AnnieAllison"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2012
      },
      "score": 0,
      "text": "This movie is horrible.  Bad directing, set and script.  Not enough story or dancing.  They really could have made this into a fun movie.  The actors apparently had no direction.  Just get out there and do whatever is what it looked like.  If you think the Twighlight series has bad acting etc.. dont even bother with this.  The audience for the most part laughed.  The few dancing scenes are not worth sitting through the whole movie.  I will pass on the sequel.  Sorry.  great looking guys though.",
      "total_reactions": 2,
      "user": "Jillmi63"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2012
      },
      "score": 0,
      "text": "Three of my friends and I went to see this movie. We were disappointed with the plot. Channing Tatum is an excellent actor, however this role did not do him justice. I am aware that he did stripping in his youth. The acting was sub par for all the actors. My friends all agreed not to recommend Magic Mike as a must see!!!!!!!!!!!!!!!!!!",
      "total_reactions": 2,
      "user": "myrr"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "A very good film that deserves a wider audience than the mostly female audience it now attracts.  The honesty of the script and the performances are what makes the film enjoyable.   Pettyfer and Tatum are excellent;  McConaughey is sleazy enough to add character to his role. The only major problem is the love connection -- you know from the moment she appears on screen that Mike and The Kid's sister will be an item.  Sadly this predictable weight diminishes an otherwise excellent movie.",
      "total_reactions": 1,
      "user": "wvmoviefan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2012
      },
      "score": 2,
      "text": "The movie was disappointing to me. This could of been tastefully done with some fun stripping and a plot with more meaning then all the drugs, sex and lesbians . 5 of us were disappointed with the movie and would not recommend it. Distasteful and story line was not good.",
      "total_reactions": 1,
      "user": "realistbutfun"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2012
      },
      "score": 3,
      "text": "There were some entertaining parts,funny in places and some hot bodies to lech over but my low score comes purely from the character of 'Brooke' played by Cody Horn,who was so miserable looking and so out of sync with every scene,much like miming to a song badly..she needs to smile and look at people in the eye when talking to them..disappointing that somebody so bad at acting got a huge part in the film but we all know who her father is.",
      "total_reactions": 1,
      "user": "itsmevix"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2012
      },
      "score": 0,
      "text": "Ok, if you are a, how should i say this, woman looking for a good socially redeeming movie then this is for you! i dont see where this movie could have gone worse, there was no plot, there was no qualities that could make this movie better",
      "total_reactions": 1,
      "user": "pedob3ar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 0,
      "text": "I actually has to read Charles Darwin's \"Origin of Species\" in order to reconstitute the brain cells I lost whilst watching this movie. Seriously, its like Stupid and Retarded **** and had a rape baby that they named **** and then **** met the writer of this movie...",
      "total_reactions": 1,
      "user": "RobYes92"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2012
      },
      "score": 0,
      "text": "I MADE AN ACCOUNT JUST TO TALK ABOUT THIS MOVIE. It was horriable totally not worth 15 dollars. The plot could have been written by a child. The begging sucked. The movie  had nothing and to make matters worse they dragged THAT NOTHING out for too long. Worst part is I can never get my money back from Walmart. Dumbest movie ever I felt like I was watch reality tv",
      "total_reactions": 1,
      "user": "courtcourt101"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2012
      },
      "score": 0,
      "text": "What a boring, unintresting movie! The whole story was bad, and worst of all the movie was not fun to watch.",
      "total_reactions": 1,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "For once, Hollywood has turned the tables on the typical male-centric movie and given us a breath of fresh air. The actors were great in their respective roles, and Soderbergh's direction was superb as well. The best part, in my opinion, was the very original writing - kudos to Reid Carolin. This film has a lot of heart, and it showed because everyone in the theater had a great time!",
      "total_reactions": 0,
      "user": "kwbmusicman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "This semi-autobiographical story of Channing Tatum's own experiences as a male dancer casts him in the role of elder stripper, who introduces the newbie (Alex Pettyfer) into the biz. Of course, there is lots of buff male flesh, but nobody's taking it seriously. Director Steven Soderbergh has crafted the trite story into a winning narrative, but it's Tatum who's in every sense the star: his stature as THE leading man of his generation continues to develop, thanks to his charismatic presence and comic charms (not to mention his physique and flashy dance moves). As the boss, Matthew McConaughey turns in a enjoyable over-the-top performance that reflects the rowdy fun attitude of this movie.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "Amazing! Channing Tatum was awesome and can dance his ass off! it is definitely worth the money and excitement and definitely a ladies night out! Ladies leave your man @ home..lol!",
      "total_reactions": 0,
      "user": "AYIM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "There is some disappointment circulating as viewers learn that Magic Mike is not exclusively focused on male strippers strutting their goods for all to see. There is an actual story woven into the scenes of quasi-erotic gyrations and dry humping. Yes, this exploitation flick has a heart at its center and the entire cast is up to the task of making it work. Channing Tatum and Alex Petyfer shine as the film's central protagonists, the development of the their friendship central to the flow of the movie. Things do take a decidedly melodramatic turn towards darker themes but in the end, this shift is important to delivering the viewer to the film's final moment, the only moment of the film that features a genuine portrayal of sweetness. The biggest flaw is the development of the potential love story which seems rushed and at times it seems forgotten in the loose plot. Still, the actors all pull together to deliver some memorable moments. The eye candy is plentiful and there is plenty of nudity to satisfy men and women alike. The editing seems a little choppy but it only adds to the gritty nature of this story. All in all, this is a solid summer film with equal amounts of drama and comedy and a healthy dose of celebrity skin.",
      "total_reactions": 0,
      "user": "gemini0577"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "I felt the movie did what it was meant to do, and that's get the ladies laughing and having a great time.  I laughed, then I hysterically laughed and of course there was moments when I wanted to jump through the screen and join the cast...but never once did the smile leave my face.  Channing is charming, sexy and played the role with perfection - his personality shines through and allows women to actually relate to the movie and pretend they're there.  The true plot and story line captures your heart, and then Channing and his sexy co stars take it to a whole new level. Well done!",
      "total_reactions": 0,
      "user": "NMReynolds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2012
      },
      "score": 5,
      "text": "I can think of only two messages that this film gives, and they are friendship and survival. I'm upset with this movie not because of the acting or actors, and not because of the plot or sets, but, rather, I'm upset with how this movie was put together. Male stripping is prevalent throughout it all, and this is where the survival message comes in. We, the audience, are presented with the dilemma of what somebody needs to do in order to provide for their well being and stability. Mike, played by Channing Tatum, has the goal of getting out of, \"the business,\" and working on his own company. Unfortunately, since he only deals in cash, and you know why that is, his credit rating disqualifies him for a loan to start that business. A quick note, when doing a review, I hardly ever imagine that I'm going to mention a character's credit score. However, with this movie, it seems to stand out within the story line and that's not a good thing at all. The other message I mentioned was friendship. Mike has befriended a young nineteen year old named Adam, who is played by Alex Pettyfer. He's not a male stripper when the film starts, but, by the time it ends, he's completely immersed in this lucrative industry. It's a nice friendship between the two characters and they seem to have each other's back. Unfortunately, towards the end, the whole idea flops over with them parting ways. Friendship and survival are the two messages I got from this film, and I'm not even sure if those are the messages I'm supposed to get. The story line was all over the place with no clear direction until mid way through the movie when the actors are presented with the opportunity of expanding their stripping business. From there, everything goes down hill, with drugs, alcohol, and threatened relationships. I do not recommend this movie for anybody. Save your money or see another production.",
      "total_reactions": 0,
      "user": "holmanpatrick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2012
      },
      "score": 5,
      "text": "A film about male strippers without a gay angle?  Preposterous!  But Channing Tatum with and without clothes is worth the price of admission. As for that line in the movie where an unkempt looking Alex Pettyfer as the Kid gets a job as a male stripper on the spot because \"...the Kid's got something...,\" my question is, \"And what is that something exactly?\"",
      "total_reactions": 0,
      "user": "imaginingdesire"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2012
      },
      "score": 7,
      "text": "Magic Mike is an excellent picture because it is more than showing Channing Tatum's ass to screaming morons at movie theaters across America. This film shows us insider details of male strippers which is a topic or career that rarely receives attention. Few of us will become doctors, and even fewer strippers, but that does not make us curious about how they live and what it would be like to be in their shoes. www.screenspotlight.com",
      "total_reactions": 0,
      "user": "screenspotlight"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "Most fun film of the summer so far. Weird, dark, and not at all what you're expecting it to be, this movie stuck with me. Don't trust the trailer! This movie is all about stripping away your notions of sexiness and exposing  (yes, I know) the world of male stripping as a neurotic little worm-hole. And yet to the director's credit the movie sails along and is almost always a blast!",
      "total_reactions": 0,
      "user": "pleaseandthanks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "First, I'm a guy who went to this with my girlfriend. Second, there was only three guys in the theater, I never thought I would see this happen. Even with hardcore guy movies (say, Solaris or something) you still see tons of girls. Wierd. Anyways, here we go... if you remove the 20 minutes of guys dancing in leather underwear, you have a rockstar movie about a group of guys trying to make it big. Acting's great, and Matt M. is playing himself so over the top that it's actually totally hilarious and you have to hand it to him for being so rediculous. Super-hot girls, drugs, some violence- it's got everything a guy needs in a movie, and just grin and bear the few dance seens (which actually contain quite a bit of comedy in themselves). Think the movie 'Rockstar' on a smaller scale with dancing instead of rock concerts. Oh, but it's better than the movie Rockstar (Rockstar's not a bad movie though).",
      "total_reactions": 0,
      "user": "VidsRule"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "I went to see this with my daughter-in-law and another friend. It is definitely a girls' night out movie! We all enjoyed it. Channing T and Matthew M really made the movie for us. Definitely recommend getting together with friends and going to see it.",
      "total_reactions": 0,
      "user": "scoobydoogurl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "Magic Mike should go down as having one of the most deceiving trailers of all time.  The trailer makes the film seem like a quick cash grab, filled with meathead hunks taking their clothes off, to fill theater seats on opening night.  While the film does feature its fair share of stripped down men, it also has an incredible story and real emotional depth, something that might not be assumed from initial expectations.",
      "total_reactions": 0,
      "user": "sanctuaryreview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "Soderbergh",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "My wife took me to this movies as a trade off for Total Recall.  I have enjoyed some of Soderbergs work and I am a fan of McConnahey's.  Tatum was funny as hell in 21 jump street and is easy not to hate.  Overall this movie is just \"ehh\".  The story is Ok but I felt I knew what was going to happen in the rest of the movie after the first 15 mins.  The characters are likable, but outside of McConnahey, forgettable.  The love interest is beautiful and has a rare natural beauty about her, acting needs some work in the \"dramatic\" moments.  This movies shows how disconnected reviewers are from the general public, they overhype this movies into something its not.  Worth seeing as a rental.",
      "total_reactions": 0,
      "user": "JW00042"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "Even though towards the end it takes its self too serious and perhaps misses the spot, this could well be the feel good fim of the year: plenty of laughs, great choreographies and music and a number of memorable performances from Tatum and especially McConaughey.  This is entertainment!",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "I was surprised to see that Channing Tatum can actually carry the whole movie. Up till this I really didn't think that the guy can seriously act, however he made it credible. The movie itself is full of cliches and after 20 minutes or so, you will know up to the last scene how it will go. The ending is flat as again some 20 minutes before the end you are actually made aware how it will go. As most of the movies nowadays the guy just has to get the girl at the end. All in all, the movie makes sense if you watch it with a bunch of girlfriends before going out on a Friday night. And yes, it is 30 minutes too long.",
      "total_reactions": 0,
      "user": "Tara61"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "Magic Mike, ok... the movie can be boring on some parts of the story, but have some funny moments. The performances are really good, and the screenplay is cool. Magic Mike is only for enjoy amazing (*.*) bodies, and cool music.",
      "total_reactions": 0,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "I loved the first half of Magic Mike. It oozed with originality. The screenplay was fantastically written by first-timer Reid Carolin. It just never went far enough dramatically.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "Soderbergh has crafted what I consider to be a possible future classic with",
      "total_reactions": 0,
      "user": "TheDRauch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "a funny, yet kinda serious take on the life of male strippers, always classified in the lower strata, it is a reminder that some wish to achieve a higher level. However, this film lacked the sturdiness to make it truly outstanding",
      "total_reactions": 0,
      "user": "swan19"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2013
      },
      "score": 1,
      "text": "Forgettable  what was the aim of the movie  what was Soderbergh trying to do  i think that he failed  there's no plot  the actors were so weak  the movie is nothing special  M.McConaughey was the best thing  to mention",
      "total_reactions": 0,
      "user": "AliBenzekri"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "(skip to the last paragraph for a concise one-sentence summary and a number)",
      "total_reactions": 0,
      "user": "RedOwlReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "It has a surprising factor. It´s pretty fun to watch all these actors taking these roles, they do it surprisingly good. The problem is the good things end there. The plot goes nowhere and the film becomes too superficial. Even boring in the second half, when the novelty is over. It had potential though.",
      "total_reactions": 0,
      "user": "sanyrub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2014
      },
      "score": 6,
      "text": "Girls will be happy watching this movie for the sole purpose of seeing Channing Tatum shirtless. Woman will feel the same way, and possibly appreciate Matthew McConaughey. Guys will be dragged to it by their significant other, and suffer watching a chick flick with a lack of story or anything redeeming in the movie. That's about all I can say.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "I'm a guy but I thoroughly enjoyed this movie. The performances were great, especially from Channing Tatum and Matthew McConaughey. The screenplay is surprisingly smart, it's essentially a male version of Showgirls but it's more tolerable and skillfully crafted. It's a thoroughly engaging party film (for those who just want the main attraction) as well as an intimate character study (for all movie lovers alike). I recommend this to every girl as well as every guy. Unlike most films, this film has substance beneath the erotic stripping and dancing from the handsome cast of male actors. It's not Soderbergh's best film but it's probably his most enjoyable and commercially successful. Steven Soderbergh directs this film with style and flair, it's not a disappointment!",
      "total_reactions": 0,
      "user": "kaizidokiller"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "Magic Mike is much, much, much more than an entertaining piece of eye candy. It's deep and human. Yes, it has it's traditional rom-com tendencies--but there are energies and real stories to be told.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "While Magic Mike may be based off of Tatum’s life as a stripper you wouldn’t know it from the film which feels uninspired. Tatum and McConoughey come alive in a film that features well shot scenes especially during the strip shows, which are creative and for ladies probably satisfying. Unfortunately, its hard to appreciate the strengths of the film at times. Often the stripping and humping scenes exist just for the sake of having eye candy lacking any purpose in the story and while the characters may be intriguing, they lose their interest as the film falls back on clichés with the film boasting the obligatory mopey and dopey third act. Women will no doubt be swept away by the wonders of Tatum’s abs while males are averting their eyes and/or wishing there was something to this film.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "Funny, wild, sexy, entertaining ooh I really enjoyed this movie.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "Many people right off Magic Mike before they even watch the film and I am here to tell you that these people are wrong. A film about human beings who happen to be strippers (this does not define them in any sense), Magic Mike is a down to earth and engrossing character study. Channing Tatum, Alex Pettfyer, and Matthew McConaughey, are all phenomenal here and McConaughey especially nails his role. The direction from Steven Soderbergh is very good and the film does a good job making the story be more about than the stripping. Rather, it is about these characters, their struggles, and the things they must overcome. Magic Mike, however, is held back by a few things. First, there is some filler here. Some scenes really added nothing, namely the scene where Adam (Pettfyer) fondles the breasts of another male stripper's wife. While she does have a nice set, admittedly, the scene adds absolutely nothing to the film. Cody Horn is also entirely unconvincing here and her character's role in the film really does very little. She is entirely useless for this film. However, aside from that, Magic Mike is a pretty good film. Both entertaining and an entertaining character study, do not judge a book by its cover here.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "People have a tendency to simplify movies down to a sentence or a few words in an attempt to disparage them. For example, Brokeback Mountain is: \"the gay cowboy movie,\" I'm sure most people have heard that said about that movie. Those of us who have seen Brokeback Mountain know that it is so much more than a \"gay cowboy movie.\"",
      "total_reactions": 0,
      "user": "cjm868"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2017
      },
      "score": 7,
      "text": "A little bit of fun, a little bit engaging, a little bit beside myself. Magic Mike is based on Channing Tatum's earlier life as a male stripper. That is enough to merit a try, but there's a bit of magic on-screen that will entertain just about anyone giving it a go. If you are absolutely repulsed by the thought of dudes stripping down to their underoos and dancing about, then why would you even consider this movie? You wouldn't.",
      "total_reactions": 0,
      "user": "SchroederRock"
    }
  ]
}