{
  "mc_avg_user_score": 6.2,
  "mc_metascore": 40,
  "mc_mixed_rating_frequency": 55,
  "mc_movie_name": "Man on a Ledge",
  "mc_negative_rating_frequency": 14,
  "mc_positive_rating_frequency": 70,
  "mc_pro_critic_reviews": [
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "Man on a Ledge doesn't aim high, but what it aims to do, it does. It grabs the audience's attention, engages its anxieties, stokes its resentments and, at the finish, sends people out saying, \"That was good.\""
    },
    {
      "critic": "Ben Sachs",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 70,
      "summary": "Leth moves lightly and briskly, streamlining the weird material into something elemental and true; he's also assembled a knockout supporting cast."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 65,
      "summary": "Either in spite of or because of its whimsically convincing quality, Man on a Ledge is reasonably fun to watch along the way."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2012
      },
      "score": 63,
      "summary": "On balance, Man on a Ledge is fun, but I left the theater feeling disappointed and cheated, as if the filmmakers set me up for something great they ultimately couldn't deliver."
    },
    {
      "critic": "John Anderson",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 60,
      "summary": "The ending, for instance, is so ridiculously tidy it squeaks. But en route to its kitchen-sink climax, \"Man\" manages to both amuse and provoke, to cleave to convention and promote ideas."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 60,
      "summary": "It's fun in a perverse way; the viewer gets to experience a vivid sense of what it feels like to occupy a pigeon-poop smeared piece of stone high in the sky."
    },
    {
      "critic": "Sara Maria Vizcarrondo",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2012
      },
      "score": 60,
      "summary": "Clichés and thin thrillers are what we can expect from January releases and while Man on a Ledge has predictability to spare, it also has something that makes your time spent worthwhile: legitimate suspense."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "As in the mindless Man on a Ledge, the hero is never really in danger, we're the ones who are trapped."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "As ridiculous as it is, Man on a Ledge isn't a movie that requires suspension of disbelief. It requires the absolute absence of it."
    },
    {
      "critic": "Andrew Lapin",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "The film aims for Hitchcock and gets a bit turned around; we're The Audience That Knew Too Much."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "None of it rings true, except perhaps the presence of an ambitious local TV news reporter (Kyra Sedgwick) who begins recording every macabre moment with relish."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "In Man on a Ledge, Leth does well in taking us to dizzying heights. If only he had found a way to ground that thrill in some real pathos as well."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "The supporting players in Man on a Ledge bring more to the party than the leads, and my suspension of disbelief seems to have gotten hung up in traffic while attempting to cross the suspension-of-disbelief bridge from the Brooklyn side."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "The movie cuts back and forth between two preposterous plot lines and uses the man on the ledge as a device to pump up the tension."
    },
    {
      "critic": "Keith Staskiewicz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "Despite the occasional dumb fun - especially with the heist portions - the leap of logic required to make it all work is enough to leave your brain pancaked on the sidewalk."
    },
    {
      "critic": "Michael Rechtshaffen",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "To his credit, director Asger Leth (Ghosts of Cite Soleil) gets right to the business at hand where the set-up is concerned, but it's in the execution that this would-be thriller falls flat."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "This cloddishly contrived suspenser is too busy to bore, but too farfetched to thrill, combining routine heist-thriller machinations with dialogue that often thuds like a body hitting asphalt."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2012
      },
      "score": 42,
      "summary": "Man on a Ledge makes bigger leaps of logic than Nick will if he fails a gravity test. If the transparent sting springing him from Sing Sing doesn't roll your eyes, then wait for the climax when Nick becomes a kind of plainclothes Spider-Man."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 40,
      "summary": "Screenwriter Pablo Fenjves start with a promising premise, and the opening scenes are taut and suspenseful. A late-day chase scene picks up the sagging middle, but Leth totally fumbles what should be the movie's biggest moment."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 40,
      "summary": "Too bad. You sense that someone could have made a good movie with this material. Unfortunately, Leth didn't."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2012
      },
      "score": 40,
      "summary": "In the end it's all much ado about not so much, a semifunctional thriller that tingles but never terrifies. Ledge schmedge."
    },
    {
      "critic": "A. A. Dowd",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2012
      },
      "score": 40,
      "summary": "Trusting an action drone like Worthington to anchor the human drama is a fatal mistake. With him perched on that narrow slab of concrete, it's only a matter of time before the film plummets."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 38,
      "summary": "Man on a Ledge has its diverting moments, but by the time it has reached its too-pat final twist, it turns out to be a title desperately in search of a movie."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 38,
      "summary": "What follows is a jumble of cop- and heist-movie clichés, dotted with appearances by actors you liked in something else."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 38,
      "summary": "More often the film succumbs to clichés, grows convoluted and outlandish, and winds up dead on arrival."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 38,
      "summary": "You could cast this movie with potato chips and still get cheers when one of the bad guys is cuffed. It doesn't matter that none of it is to be believed."
    },
    {
      "critic": "Jaime N. Christley",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2012
      },
      "score": 38,
      "summary": "The script is a hot mess of the highest order, taking some of the stalest chestnuts in the long, venerated legacy of the framed-cop-trying-to-clear-his-name genre and somehow f---ing it up, in scene after scene after scene."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2012
      },
      "score": 33,
      "summary": "As the plot unfolds, brick by brick, the structure starts to wobble until it finally collapses into unintentional comedy."
    },
    {
      "critic": "Brian Miller",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2012
      },
      "score": 30,
      "summary": "Worthington wouldn't know how to behave if the film were a comedy; and poor Banks, after a promising, \"Young Adult\"–style introduction, isn't allowed to goose the script or push beyond the glass ceiling of her character."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 25,
      "summary": "The shopworn script by Pablo F. Fenjves, who ghost-wrote the unpublished O.J. Simpson book, If I Did It: The Confessions of the Killer, gets no help from director Asger Leth (Ghosts of Cite Soleil)."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 25,
      "summary": "Man on a Ledge just made me think of an old Van Halen song: Jump."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "summary": "Rarely has a film exhibited a bigger disconnect between urban realism and utter ludicrousness."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "As usual, the idiots known as \"movie critics\" missed completely. Most of the critics rated this movie incredibly low for some reason that I don't understand. This movie is meant to be a suspenseful thriller/heist movie and it is just that. The acting and cast was solid, the plot was good, and the suspense scenes worked well. Was this movie perfect? Of course not. It definitely wasn't as good as Phone Booth was but it was built in that model and was similarly enjoyable to watch which is ultimately the point in watching movies.",
      "total_reactions": 1,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "Most of the movie is the guy out on the ledge talking to a cop while his partners are stealing a diamond from a nearby building and while this is happening it is quite exiting but once it starts to get into the reason he is doing it towards the end, it gets a bit messy and confusing. For a bit its not very clear why hes telling the cop hes doing it, why hes really doing it, and whether or not they are actually the same reason. In the end though it does make sense and its a pretty good resolution to the story.",
      "total_reactions": 1,
      "user": "SwarleyStinson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "I was curious to see if this movie could deliver on the plot and performances level, it did so",
      "total_reactions": 1,
      "user": "HomeReviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "Miri from \"Zack and Miri Make a Porno\" tries to talk the dude from \"Avatar\" down from a ledge while Avatar's brother and a good looking chick try and steal a diamond, that was already \"stolen.\"  Pretty good little flick, if not a little disjointed.",
      "total_reactions": 1,
      "user": "bigwigbob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2012
      },
      "score": 6,
      "text": "A promising crime suspense thriller keeping you on the L\"edge\" of your seat.",
      "total_reactions": 1,
      "user": "GES"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "It's again not very surprising that the audition reviews are mostly common with mine. This film profits from a clever plot, great actors and bursting edge-of-your-seat-tension. A movie that could be a bit more serious in some bits but still is very entertaining.",
      "total_reactions": 1,
      "user": "TECfilms"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Have to say this film really exceeded my expectations  lots of original angles and ideas plus some gripping action sequences.  I like that it peppered the story with light humour here and there, and even though the ending takes a small liberty or two, it is a very satisfying rollercoaster ride.  Great directing and strong performances all round  I especially liked the behind the scenes elements on the dvd  definitely adds to the sense of realism and attention to detail.  This had a nice touch of mission impossible mixed into a ledge scenario which naturally offers limited room to move.  Overall I loved it.  Haven't before referred to other reviewers but Sickdrummer1 you are a genius.  Well done.",
      "total_reactions": 1,
      "user": "Huckster"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "\"Man on a Ledge\" doesn't really satisfy the huge premise it promises to the audience, but it does fairly better than most (tasteless) thrillers out there.",
      "total_reactions": 5,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "Could have been better.  Just glad this was not a two hour documentary of an actual man on a ledge. Really how much action can you have with a Man on a Ledge?",
      "total_reactions": 4,
      "user": "smoman03"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "This is one of the most underrated movies I have ever seen. Are you kidding me? I literally sat on the edge of my seat for most the movie. The action sequences were well shot, and, for a modern thriller, the plot is pretty logical. I don't see the plot holes the critics were talking about. Anyone who didn't enjoy this has something up their a**. Hating on movies for no reason. Overall, this movie was very entertaining, and I find it very hard to believe that it didn't receive a higher user score. I mean, critics are a bunch of gay-lords so I may understand that the lack of gay characters, and the abundance of hot women (Elizabeth Banks, and Genesis Rodriguez anyone?) may have put them off... Also, there is no vague pseudo-art for them to praise here, just an adrenaline rush from beginning to end. Also, I have to respond to some of the sad reviews in here:",
      "total_reactions": 4,
      "user": "sickdrummer1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "Extremely underrated movie. From the start until the end Man on a Ledge does something to keep your eyes glued to the screen. Plenty of action and its a very smart film.",
      "total_reactions": 3,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "I was actually surprised by this movie. When i first heard about a movie called \"Man on a ledge\" i was like, wow really? how did they possibly come up with that name? I thought it would be really dumb, but I work at my local movie theater and the majority of the people who saw this movie said it was pretty good. So i became intrigued. I finally decided to just go see it. Going into it with low expectations I was a bit surprised. It was good, but obviously not Oscar material or anywheres near that. With a pretty solid cast all around, including Sam Worthington (Avatar, Terminator Salvation) Anthony Mackie (The Adjustment Bereau, The Hurt Locker) Ed Harris (Alot of movies) and Kyra Sedgwick (The Closer). The cast made the movie look better than it actually was. Although Sam Worthington seems as though he just does any movie he can, hes still a pretty good actor, at least in the 2 movies i listed. The plot obviously is all around weak and very predictable. Everybody with a brain knows what is going to happen in the end. They were some very unrealistic factors in this film such as Sam Worthingtons character making a 25 story leap of faith jump, and just so happens to hit this 15 foot wide cushion thing right in the center, no whiplash or anything, he hops right back up and chases after Ed Harris. I mean, we don't always go to the movies expecting 100% realism, but come on, thats just a bit ridiculous. So overall, I enjoyed myself during this movie, but only because I went in with low expectations. There are very many holes in this movie that just can't be filled, even with a solid cast. If you go in expecting a perfect film you will be very disappointed, so i suggest you go into the theater open minded and you will be entertained. This movie gets an ok from me. 4.5/10",
      "total_reactions": 2,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2012
      },
      "score": 5,
      "text": "It wasn't that bad, but it wasn't really that good either. The characters were forgettable, and not the best acting by some of the actors. Not much suspense. But it was kinda interesting.",
      "total_reactions": 2,
      "user": "RustShackleford"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 4,
      "text": "It's a good heist/thriller with Sam Worthington leading the way up until the last fourth of the movie where things start to spiral out of sensibility and control. I truly left the theater thinking that the director should probably work on his finishing touches to an otherwise excitement filled movie. Normal audiences will love the movie much more than critics will as the movie does try to make you laugh a little here and there. Overall, a decent movie to see in the first month of 2012.",
      "total_reactions": 2,
      "user": "racketracer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "Creative premise but unfortunately not very creative execution. It wasn't painful to sit through but I found myself focused on the holes in the plot instead of being carried along by it.",
      "total_reactions": 3,
      "user": "gunnyart"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "When I first heard about '' Man on a Ledge '', I was expecting a bad, cheesy, lame crime movie. Finally, it turned out okay. I mean, it could have been better, but it's good enough for a rental. You don't need to see this in theaters. In fact, it should have been a B list movie. I find '' Man on a Ledge '' weird, because it seems like two different movies in one plot. It's like if the director took two movies, and put them together. The first half was a little slow, yet intriguing. The second half was more of an action pack. So '' Man on a Ledge '' is a normal, forgettable movie. You don't need to see this, if not, you will not die. In fact, I almost forgot about it.",
      "total_reactions": 3,
      "user": "scrieciu"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Man on a ledge is a fantastic film, really, because the cast have an awesome performance and do that the film be interesting, the trama can be simple but is perfect, this film is really great, I love it. Man on a ledge is a new classic.",
      "total_reactions": 3,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 0,
      "text": "this provided a good nap for me last night.",
      "total_reactions": 3,
      "user": "timbosabo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 4,
      "text": "Anyone who has ever seen a movie had to know going in, that this movie was about more than just a man on a ledge. Unfortunately, this film couldn't have been more ridiculous. Action movies are by nature unrealistic, but most of the time, at least some of the story is believable and makes sense. Man On A Ledge is a film that is all over the place, filled with scenes of unbelievable stupidity. The combination of corruption, theft, ridiculous moves, and lines that sound like their out of a comic book make this movie close to unwatchable. The man on the ledge has an agenda and asks for a beautiful negotiator to talk him down. Even she can see that he's stalling for time, but to what end? It leads to a totally unbelievable story with a horrible ending. I watched this film because I thought it would be different and I love both Elizabeth Banks and Jamie Bell. The cast was talented and the previews were good, but this movie is not. Man On A Ledge is just one of those movies that makes you question how stupid  like this even gets made in the first place.",
      "total_reactions": 1,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2012
      },
      "score": 2,
      "text": "It was a real mistake to buy a movie ticket for this movie. To be fair, some reviews of it were much harsher than it deserves, but it is a movie that doesn't deserve to be watched. Two characters with the most prominent roles are probably the most irritating characters in recent memory. The plot is highly improbable and the action is dull. Sam Worthington can't be blamed for how bad the movie is, but he does not do much to salvage it. His back story? Same story as the one in Terminator: Salvation. I've seen this movie before, with all its cliches and dull twists. I promise you, it is not worth it.",
      "total_reactions": 4,
      "user": "FlorenceWong"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 1,
      "text": "An infuriatingly unoriginal and bland caper film where we have seen every single plot twist before and in better movies where character pathos mattered just enough to keep us invested emotionally. About five minutes in is how long my attention was kept. The majority of the plot is milked so thin that, I bet if all ideas had been thrown on the table and executed fast enough to keep us on our toes, the movie would only have been about 40 minutes long. It's like drinking a soda that is heavily watered down - it tastes mild, with only a few traces of the original drink caught on the taste buds. There is a lot of acting talent wasted here too. Sam Worthington, Ed Harris, Elizabeth Banks, Jamie Bell, and Kyra Sedgwick are all unable to save the movie from sub-mediocrity. In short (I shouldn't have devoted this much time to writing a review on something I despise so much) 'Man on a Ledge' is basically what you would expect from a January release. It might even be a little worse.",
      "total_reactions": 1,
      "user": "TheDRauch"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2012
      },
      "score": 0,
      "text": "This was a terrible film. It begins with an interesting premise but soon descends into complete absurdity. I couldn't bring myself to watch many parts of the film due to excessive cringing, especially the bar scene at the end with the proposal. To make matters work, the acting was at best mediocre and anyone with a brain cell will tire of this film very quickly. Don't waste your time or money watching this!",
      "total_reactions": 2,
      "user": "HelenK"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2012
      },
      "score": 4,
      "text": "Hey, its not that bad, i mean, its bad but not horrible. Its the kind of movie you get at the redbox or watch on FX in 2 years. It manages to be entertaining and keep you interested. But the movie's ridiculously silly and has every cliche in the book. You don't hate it, but you don't like it either.",
      "total_reactions": 2,
      "user": "snazzyjuice"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2012
      },
      "score": 6,
      "text": "Dictionary definition of an average movie. Perfectly watchable from beginning to end, ok performances all round, but you won't remember anything about it in a weeks time. 6/10 from me.",
      "total_reactions": 1,
      "user": "Goodfella"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "I found this movie to be very poorly made.  The acting for the most part was just passable, the camera work was mediocre, and there's amillion different points in the plot where it contradicts itself.  The premise was ok, but it wasn't used very well.  Overall a mediocre movie which is watchable but that's all it really is.  Watchable.",
      "total_reactions": 1,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "Five! Well, since the five early minutes, thiz movie has already set up the sharp action pace. It does not waste your time any longer. It takes you directly to the center of the story. How a desperate man steps out on a ledge of Manhattan Hotel to commit suicide. Why, what and who are told by flashback storytelling. Four! There are four key characters. First, Sam Worthington is the man on a ledge himself. Yes, we still hear his Australian accent, but it does not matter. He delivers a good and believable presence. We have been sweating along every time he moves around on the thin edge of the building. Elizabeth Banks is the police negotiator who interferes in thiz circumstance. Jamie TINTIN Bell is the brother who conducts a heist on next building, with his girlfriend Angie (Genesis Rodriguez). And Ed Harris is a powerful multi-billionaire who has a covert secret purpose. It reminds me of those simple movies that keep you entertain until the last minute, e.g. PHONE BOOTH (2002), CELLULAR (2004), RED EYE (2005), you named it! I always love thiz kind of movie. Three! Yeah, there are three possibilities to end thiz situation. One, finally he does not jump and the end. Two, he jump and the end, or there will be unthinkable surprise for the ending, one way or another. And yes, you know in your heart it wont end so easily, there are lots of twists and turns waiting for you. You bet! The mystery will keep you guessing until the end. The movie is presented by first-time Director Asger Leth. Two! There are two reasons to watch thiz movie. First is Sam Worthington. Two years ago, I told everyone that someday thiz man will be a great iconic Star. And hey look now. It is the future! He sells the movie only by his name! People will easily cherish him, Woo hoo, the man from AVATAR (2009). The second, if you have watched the trailer, I am sure it would tickle your curiosity about what will happen next. One! Jump! Jump to thiz movie immediately, thiz one is the movie that you want to see.",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "It's apparent not too long into 'Man on a Ledge' that the premise of it is more than it seems, as Nick Cassidy (Sam Worthington) takes to a ledge on one of the highest floors of a New York hotel, but it's immediately clear  that he doesn't have much intention of jumping, that a sleight of hand is in place. Without giving too much away, it's pretty clear that Nick Cassidy isn't up there for the view, or to leap off to his death, but what follows is aiming too much above its weight to the exhausting point of this steak being overdone.  We are lead down a path of conspiracies and ulterior motives, this is when it's easy to realise that the movie acts a lot more seriously than it should, a preposterous twinning of two stories leaves the film fun and cheerful, but not as dramatic as it is trying to be.  What irritates me is the fact that we start off with Nick climbing to the ledge, where we then see a month before where he is in prison, what could have been set up here is a simple dramatic piece of a man seeing error in his decisions, but instead a thriller with many shady characters and money falling from the sky to create diversions, this turns into a heist, to mask a thievery that didn't, emm, actually happen. Elizabeth Banks plays the negotiator who attempts to talk Nick down, she has her own regretful past as she sees that Nick isn't who he says he is. As a thriller, this certainly isn't a a dull affair, with plenty of pulsating action and several twists and turns throughout, but it's also entirely ridiculous and over the top, trading what was a good thing. The lead characters each bring something to the table, but in the grand scheme of things, they get lost in all the flashy ideas that we are given and they must settle for playing second fiddle to an over-arching story. Worthington plays a calm and collective individual on the ledge, but he is much more interesting on the ground when we learn about his past, but the chemistry between himself and Banks feel real and worthwhile. Supporting cast members Anthony Mackie and Titus Welliver deliver solid albeit limited performances, they have significant roles yet small appearances throughout the film. This sums up just how big and serious the film attempts to be, but everything is too co-ordinated to the point where the heroes never seen to be in danger, it's a fun thrill, but one which is playful and entertaining, not one which is too convincing in its execution.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "Strong 3 1/2 stars.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "Going into â",
      "total_reactions": 0,
      "user": "chrisv39"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Good film  Ending was a little too happy to be true and overall some plot parts where basic and unrealistic. Still alot better than other reviewers will have you think and worth watching  even if it is like a long episode of a crime drama you might see on channel 5 or sky one",
      "total_reactions": 0,
      "user": "yrcrazy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "A fast paced movie,not something special.I am glad to watch this movie,is above my expectations,lot of twist and turns,not so good great perfomance's,a great casting that overshadows the horrible ending,with Sam Worthington,Elizabeth Banks,Jamie Bell and Ed Harris.If you are fun of those kind of movies,then probably you gonna love this.",
      "total_reactions": 0,
      "user": "Mr-K05"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "While I'm admittedly not the harshest of critics, I still feel that this film deserves a positive review.  The plot was good, the twist was good, I just found the final action scene implausible. Other than that one detail, I found the film very enjoyable; well worth the $1 I paid from Redbox.",
      "total_reactions": 0,
      "user": "TarHeelHomie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "Nothing special about this film, but it is a decent watch.  A solid cast led by Sam Worthington and Elizabeth Banks do the best they can with a very mediocre script.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "La pelicula contiene muchas escenas interesantes de accion y un buen suspenso, es excelente la inteligencia en el robo y la buena edicion en este.",
      "total_reactions": 0,
      "user": "Jmsbpp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "A movie asking, over and over, to suspend belief in ways that aren't fun. Even the coincidences have coincidences! Does everyone really have to dance at the end these days?",
      "total_reactions": 0,
      "user": "nxrble"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "Man On A Ledge is light entertainment with a somewhat interesting plot line and okay execution. It'll keep your attention, maybe even explore some deeper themes and metaphors throughout the movie. There's little action that actually goes on, and more of the film I just Sam Worthington standing on a ledge. But hey, you can't say the title didn't warn you!",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "Man on a Ledge had an interesting plot and an interesting cast.The movie had some good intense moments and even had some action so why the movie was not that good?Probably because of the lack of characters development and because the movie was a little bit boring at times.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "Man on a ledge has to be one of the most underrated films. Clever plot and interesting characters makes this movie great. The actors put in a great performance and the idea's presented make it more believable. They use items that everyday people could use making it believable. it sits as my No. 2 film to watch of this thriller/heist genre with inside man as my no.1",
      "total_reactions": 0,
      "user": "jarrett658"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "Ugh. This movie was Great. I don't know anything wrong with this movie, Actual movie critics can be so damn weird to what they would consider a good movie. Not all are, but some are.",
      "total_reactions": 0,
      "user": "cmainthuging12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2014
      },
      "score": 0,
      "text": "Man on a ledge was slightly",
      "total_reactions": 0,
      "user": "Introduce"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "\"Man on a Ledge\" is not a film that will change the way we look at thrillers, but it is a film that has enough thrills to provide for a very entertaining ride",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ]
}