{
  "mc_avg_user_score": 5.7,
  "mc_metascore": 50,
  "mc_mixed_rating_frequency": 9,
  "mc_movie_name": "Management",
  "mc_negative_rating_frequency": 6,
  "mc_positive_rating_frequency": 8,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2010
      },
      "score": 2,
      "text": "This movie sucks. I am still trying to understand what the point of this wanna-be cute movie is. Throughout the romantic \"comedy\", I was confused. The way you know a movie is bad is when it confuses the hell out of you without trying to. Horrible movie. Wouldn't recommend it to a horse.",
      "total_reactions": 0,
      "user": "Deadsarow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "I'll be honest: Management floored me. Based on Jen Aniston's stint in The Good Girl, I knew she could act. Here, she uses those skills superbly once more. I never would have imagined Steve Zahn and Jen Aniston a match, but they are. Perhaps that is the magic behind Management. It's honest, telling and surprisingly good.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2016
      },
      "score": 8,
      "text": "Sometimes life choices actually work out in unexpectedly amazing ways.  In \"Management,\" Steve Zhan and Jennifer Aniston both are lonely people, vulnerable in very different ways.  But it is because they each are not on the prowl that their unlikely encounter in a modest motel, while Aniston's character is traveling on business, begins a series of strangely charming repeat encounters.  There is some pathos along the way, which only makes the ending that much more satisfying.  Without the excellent acting work on display here by both leads, this story would be a simplistic joke tucked inside another joke etc.  But the stellar performances drew me into the story so much I truly cared to know how it would all resolve.  Every few years I find myself watching \"Management\" again, and each time find that I still care for these two people to find their heart's desires.  For me, that's a successful movie.  Try it.  You may be as pleasantly surprised as I was.",
      "total_reactions": 0,
      "user": "LBS"
    }
  ]
}