{
  "mc_avg_user_score": 7.6,
  "mc_metascore": 61,
  "mc_mixed_rating_frequency": 7,
  "mc_movie_name": "Margaret",
  "mc_negative_rating_frequency": 3,
  "mc_positive_rating_frequency": 24,
  "mc_pro_critic_reviews": [
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 100,
      "summary": "Ambitious, affecting, unwieldy and haunting, it's an eccentric, densely atmospheric, morally hyper-aware masterpiece that refuses to follow the strictures of conventional cinematic structure, instead leading the audience on a circuitous journey down the myriad rabbit holes that comprise modern-day Manhattan."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2011
      },
      "score": 100,
      "summary": "And though not all of Lonergan's conceits work on a scene-by-scene basis (an upper-crust womanizer played by Jean Reno skews a bit too close to caricature), the film has a cumulative power-solidified by a devastating opera-house finale-that's staggering. This is frayed-edges filmmaking at its finest."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2012
      },
      "score": 88,
      "summary": "Margaret, for all its flaws, is a film of rare beauty and shocking gravity."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 88,
      "summary": "Who knows what movie Lonergan was searching for in all that footage? But what emerges from the tinkering and legal skirmishes is an occasional marvel, a kind of everyday highbrow social X-ray, Paul Mazursky by way of Krzysztof Kieslowski."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2011
      },
      "score": 83,
      "summary": "Artistically, however, the movie delivers on a surprisingly effective scale, no matter how Lonergan sees it. Alternately perceptive, subversive, tragic and profound."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2011
      },
      "score": 80,
      "summary": "A fascinating, deeply felt film of wild, untamed emotions and probing insights."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 80,
      "summary": "Margaret - titled after a poem - reflects its adolescent subject with striking accuracy. It can be frustrating and self-important, clumsy and naive. But it's also passionate, curious and filled with insight, so unafraid in its ambitions that even the flaws are interesting. Every bold vision requires respect; a few deserve celebration. This is one of them, imperfections and all."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 80,
      "summary": "It's not a film that's easy to love, but like a song you at first can't stand but then end up humming all day, it works its way past your defenses and curls in close."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "A half hour before the finish, Margaret loses altitude and starts looking for a place, any place, to land. Instead it crashes, in slow motion. But up until then, Margaret is committed and unusual."
    },
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "Besides Paquin, who delivers a once-in-a-lifetime performance as the maddeningly inconsistent Lisa, also wrenchingly fine are Jeannie Berlin as the best friend of the deceased and J. Smith-Cameron as Lisa's actress mother."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 70,
      "summary": "Even in its truncated state, this is pretty gripping stuff; just think of it as an epic commercial for the director's cut DVD."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 70,
      "summary": "Lonergan didn't bite off more than he could chew with Margaret - this is his personal moral gymnasium - but he did bite off more than others might want to chew."
    },
    {
      "critic": "Karina Longworth",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2011
      },
      "score": 70,
      "summary": "It's less successful as a human drama than as a near-Brechtian exercise in what human drama looks and sounds like - a distanced but often car-crash compelling portrait of a teen as an unfinished being."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 67,
      "summary": "Lonergan's dialogue can sweep you up in a whoosh of personality and ideas, but it's hard to see what, apart from ego, convinced him that this story was so epic."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 63,
      "summary": "For a 90-minute movie, Margaret has a thin story. So it's unfortunate that it runs 2 1/2 hours."
    },
    {
      "critic": "Sheri Linden",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 60,
      "summary": "Fine performances and bristling language compel in this overlong, often off-putting but well-observed New York story."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Kenneth Lonergan's new film, Margaret, finally released six years after it was shot, now seems destined to become part of film history as one of the more stunning examples of a filmmaker's sophomore slump."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "What an interesting failure Margaret is."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "I wish I could say it's a resurrected classic but, alas, it's mostly a mess – a 2-1/2-hour mess no less."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "To watch the long, painful last hour of this movie is to watch all of his good ideas and smart impulses collapse into a heap of half-written, awkwardly acted, increasingly frantic scenes."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Lonergan has created a forceful yet extremely fitful film that teases with moments of brilliance only to frustrate in the end. Margaret is an unrealized dream, one you wish he'd gotten as right as his 2000 debut, \"You Can Count on Me.\""
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "This unwieldy drama of conscience in the wake of tragedy is hyperarticulate but rarely eloquent, full of wrenchingly acted scenes that lack credible motivation or devolve into shrill hectoring."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "A 2½-hour art film that is something of a well-intentioned mess."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2012
      },
      "score": 40,
      "summary": "As well-shot and well-acted as it is, one can't help feeling there's a good movie in there somewhere. Unfortunately, it's buried beneath such an avalanche of extraneousness and artistic posing."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 40,
      "summary": "Margaret definitely has many elements for a successful drama. It's unfortunate that no one was able to shape them into a functional movie."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "This is the first bad movie that has ever made me call for a sequel - to get it all right."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 30,
      "summary": "Rarely has a film with such a great cast and so many moments of terrific writing and such high dramatic goals been so messy and disorganized and fundamentally bad."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "Although the film is long, it is not too long. I would be ready to see it again a week after my first viewing. The characters and situations are true to life, that is, painful and messy. The ellipsis at the end of many scenes, in which the scene seems to be cut short, was puzzling at first but contributed to the emotional power of the movie. The actors who played Margaret, her mother, and the dead woman's friend were terrific. I could really relate to everything in this film even though I have never been in any similar situation.",
      "total_reactions": 2,
      "user": "halfcentury"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2012
      },
      "score": 4,
      "text": "Huge fan of Lonergan's debut, \"You Can Count on Me\", but this bears little similarity to that in execution. I felt the material was way too over-the-top, like Paquin and Co. were acting for the stage, not the screen. Overlong and overwrought, it's evidence of the reported years-long fight between Longergan and producers over what cut could be delivered. Regardless of the running-time, if I watched any more, it wouldn't have changed my mind. I love great cinema, but this was closer to a Mexican soap opera written by Noah Baumback and directed by Walt Stillman.",
      "total_reactions": 2,
      "user": "Friskytiger81"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2016
      },
      "score": 0,
      "text": "horrible. excruciatingly bad. the reviewers are liars or there's something really wrong with people. don't waste your time with this POS. why did they even put matt damon or any other actors in this for like 5 minutes of screen time?",
      "total_reactions": 1,
      "user": "iplayandwatch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2012
      },
      "score": 3,
      "text": "The more you enjoyed Lonergans first film, the more you should be preparing yourself for a massive disappointment. For the record: Lonergan is a great writer, with a great talent; and for all his stilted, play-acting dialogue and characters, theres a real humanity and depth to his work. Its much, much appreciated. However, thats a discussion for You Can Count On Me. Because theres no room for it here. Anyway, its not that often I see a movie, in theaters, that looks like a very early, messy rough cut of something that could of been possibly much better, or even great (e.g. Melancholia). Margaret is a mistake, and the only thing more embarrassing than for the filmmaker to have this on his hands is the fact of how simply obvious it would have been (and still is!) to amend nearly all of its mistakes. These mistakes are mostly large, clumpy structural attempts to branch off, with sub-plots, or mini-scenes, into the perceptions and experiences of secondary characters, to get a taste of how they operate, or to see what theyre going though parallel to the main characters journey. However, it isnt always just a head-shakingly maudlin checker-boarding of scenes; it can also be as minute and simple as a quick comparison of thoughts or screams. This is a selfish juxtaposition issue that rears its head at EVERY opportunity. In fact, there should be an Ebert-ism regarding this: a director, after a first decent hit (or maybe two), now allows his unbridled ego full and entire authority over all his creative consciousness, to the extent that he wants to say this and this and this and this, etc. Ad nauseam. Its nothing but a complete loss of focus, allowing useless, extraneous information to barge in as it pleases. How many movies can you fit into one? And how long can you deceive yourself into believing that all of these themes, these situations and characters connect in an honest and emotionally engaging way? A film is not a 1,000-page novel, it never will be. Less will always be more, and the secret to success will always be those infinite suggestions held within every frame. Two-and-a-half hours of loud talk is not the answer. I bet the average person, including myself, could step into this and remove at LEAST 40 minutes of footage. Just cut every time you see something boring, every time you instinctively know that what youre watching amounts to next to nothing in the grand scheme of the picture. Every time you know youre seeing-not experiencing-something that youll forget five minutes after its occurred. Besides killing the flow of the main conflict at every opportunity, there are also some new, quirky, New-Yorky aesthetics Lonergan tries to arbitrarily incorporate into the picture; such as odd, extended zooms; slow-motion with often-times bad complimentary score; ironic, disgustingly self-aware cuts concluding scene after scene with a strange line or action of a character, implicitly expecting the audience to bowl over with ironic, disgustingly self-aware laughter; and even more self-aware camera angles, designed to make you believe that what you are seeing is just TOO INTENSE for a normal shot. And the film actually uses opera, multiple times, for dramatic effect. (Basically, if youre not a privileged, college-level graduate you arent allowed to participate in the fun.) Theres also the main, underlying theme to this film that, I felt, was entirely naive and general. It seems to want to take to the podium every time theres a classroom discussion scene -- as though by having young adults tackling major issues, the topical blow isnt quite so severe. What happens specifically is: everybody sits around and argues for about five minutes regarding their own personal views on America and the rest of the world -- terrorism, bombing of women and children, blah blah blah. And then, at the very height of it all, the scene just abruptly ends, and the subject promptly disappears for a while. How irritating. Almost cowardly. Its as though Lonergan read in his old, misplaced college textbook on film: movies are for raising questions, not answering them. He really took that to heart.",
      "total_reactions": 0,
      "user": "desppun"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "Superb acting by the principals, especially Anna Paquin. Unlikely scenarios and story, though. The protagonist is not a very likeable character and one has a difficult time identifying with her problems.",
      "total_reactions": 0,
      "user": "mschoa"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "This lengthily delayed film (for more than 6 years, what",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "Another well written movie with great multilayered characters by Lonergan. A great premise that sends the protagonist into a whirlwind of emotion that doesn't stop though the film's two and a half hours. I feel this film falls short in the same way that You Can Count On Me did. For me Lonergan never seems to be able to find a way to end his protagonists journey. Both movies ended on a less than satisfying note. I do not always need the neat and tidy Hollywood ending, however an obvious end to the story or an obvious open ended ending to take a movie from good to great.",
      "total_reactions": 0,
      "user": "seancriswell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "A film of true gravitas. The acting is amazing and the script often spot-on. Not only is the main drama fascinating, but there is also coverage of issues like single motherhood and self-acceptance. Best film I saw in a long time. I may have given it a ten if it was a bit shorter, as there are some sidetrips that hurt the focus and do not yield the insight of the segments dealing with the main drama.",
      "total_reactions": 0,
      "user": "lancekoz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "I wish more movies were like this. Having seen Margaret in it's intended 3hr Director's Cut it's difficult thing to comment here on this, the shorter cut of the film. I immediately fell in love with Margaret from the get-go. It's really a simple story: a girl witnesses/causes a fatal accident and the rest of the film is about how she deals with it. So many times watching film and television I've longed for more reality; what really happens to a person after they go through a traumatic event? Anna Paquin portrays the confusion and fracture with a raw power; she's a time-bomb. All the performances are excellent, with J. Smith-Cameron and Jeannie Berlin filling the other main roles, with wonderful actors popping up everywhere in support (Matt Damon, Olivia Thrilby, Jean Reno, Keiran Culkin, Mark Ruffalo, Rosemarie DeWitt and Allison Janney in a small but incredible performance). It's about a search for meaning, for redemption and as much about the differences and failings and needs and desires that define every one of us. And it is glorious.",
      "total_reactions": 0,
      "user": "wiggipop"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "2h30mns seem quite long but in this case it flows thanks to the unexpected emotional journey the main character goes through from the main event. It felt real and powerful.",
      "total_reactions": 0,
      "user": "Cmjirrmoore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Well rounded cast and drama, thought it was a little long and drawn out, but well acted and scripted.  Basically the main character is affected by an accident with a bus that she saw, and actually had a part in causing.  The movie loosely looks at someone caught in the right and wrong of things and also how tragic events can lead into something more serious and conflicting.  Matt Damon, Matthew Broderick, and Mark Ruffalo in my opinion weren't utilized as well as they should have been given their talent.  Still Anna Paquin carries the main role decently and I find myself getting irritated with the mess she creates for herself.  Overall a middle of the road movie which if you can sit through has a decent ride.",
      "total_reactions": 0,
      "user": "horizonbts"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2017
      },
      "score": 8,
      "text": "At three hours, the extended cut of this film is a really behemoth. I am watching director Kenneth Lonergan's filmography is reverse order, having already seen Manchester by the Sea before watching Margaret. That said, this film further shows that there is a rule when watching a Longeran. If things can get worse, they absolutely will. In this film, a woman is killed by a bus and young Lisa Cohen (Anna Paquin) is a witness and a cause of the accident, as she purposely distracted the bus driver. The rest of the film depicts her trying to right this wrong and come to terms with the negative impact she had in this case. Largely a character study, Margaret is a film with a dire and pessimistic depiction of the world and of human beings. Yet, as is the case with his follow-up to this film, Margaret is oddly emotionally cathartic. Though it really goes the full 12 rounds with your heart and emotions, the film is an operatic and beautiful portrayal of life, death, teenagers, and human relationships.",
      "total_reactions": 0,
      "user": "Spangle"
    }
  ]
}