{
  "mc_avg_user_score": 7.2,
  "mc_metascore": 76,
  "mc_mixed_rating_frequency": 25,
  "mc_movie_name": "Margin Call",
  "mc_negative_rating_frequency": 11,
  "mc_positive_rating_frequency": 103,
  "mc_pro_critic_reviews": [
    {
      "critic": "Stephen Cole",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 100,
      "summary": "Chandor's shrewdest bit of business is figuring out how to make an A-list movie with a $3.5-million budget. Solution: buy low, sell high. Hire last decade's A-list – Spacey, Irons and Demi Moore – and give them their best parts in years."
    },
    {
      "critic": "Read full review",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2011
      },
      "score": 100,
      "summary": "Margin Call is one of the strongest American films of the year and easily the best Wall Street movie ever made."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 91,
      "summary": "You could describe Margin Call as a thriller (it's wired with suspense), yet the tension all comes from words."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 90,
      "summary": "A terrific piece of entertainment. The financial lingo will please money wonks. But the film as a whole focuses more on the people and personalities who went into such a catastrophic failure."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 90,
      "summary": "The accomplishment of this movie is that it allows you to sympathize with them, to acknowledge the reality of their predicament, without letting them off the hook or forgetting the damage they did."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 90,
      "summary": "This confident, crisply made piece of work does an expert job of bringing us inside the inner sanctum of a top Wall Street investment bank in extremis, giving us a convincing and coolly dramatic portrait of what it must have been like when titans trembled."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2011
      },
      "score": 88,
      "summary": "Chandor's film goes a long way toward making understandable - in vivid, cinematic terms - what exactly happened to make that first big domino fall over."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 88,
      "summary": "Margin Call employs an excellent cast who can make financial talk into compelling dialogue. They also can reflect the enormity of what is happening: Their company and their lives are being rendered meaningless."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 88,
      "summary": "The movie with which it has the closest relationship may be \"Glengarry Glen Ross.\" The same sense of desperation, the same need to make the sale, permeates Margin Call. Both films are to some degree about the dehumanizing impact of money and both are driven more by characters than plot points."
    },
    {
      "critic": "Ian Freer",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2012
      },
      "score": 80,
      "summary": "Chock-full of terrific performances, Margin Call is the kind of gripping, grown-up film that these days is usually found on the small screen."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2011
      },
      "score": 80,
      "summary": "With its restricted one-night timeframe and a setting that rarely expands beyond the walls of the firm, Margin Call can feel like a dramatized version of those ubiquitous 2008 news photos of white men staring in horror at numbers on a screen. But in its best moments, this film reminds us that every one of those pictures contained its own story of compromise, corruption, and ruin."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2011
      },
      "score": 80,
      "summary": "While Spacey, Tucci, and Bettany are the standouts, every cast member locates disturbing notes of villainy or humanity."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 80,
      "summary": "As such, it's chilling and enjoyable in unequal measure. Entertainment predominates, but entertainment with smarts, and a well-honed edge."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 80,
      "summary": "Margin Call's strengths are of mood and the slick surfaces of things, and these elements are haunting long after the credits have rolled."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 80,
      "summary": "Sam Rogers (Spacey) is not an especially enigmatic character, but he is a profoundly wounded one who has given his life to a business and an institution that has relied for years on his unscrupulous conduct and is about to kick him to the curb...It's one of the great performances found in American movies this year."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2011
      },
      "score": 80,
      "summary": "A hell of a picture. And shrewd."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2011
      },
      "score": 80,
      "summary": "J.C. Chandor's precocious writing-directing debut is fastidious, smart and more than a bit portentous as it probes the human costs of unchecked greed."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2011
      },
      "score": 75,
      "summary": "Margin Call doesn't demonize its characters, nor does it absolve them of their sins. The movie simply shows, without judgment or anger, how our economic crisis came to be."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "It's all fairly entertaining but also confusing for anybody who doesn't get the Wall Street lingo. Irons, as the company's chief executive officer, seems to sympathize with us: He keeps asking his minions to explain the impending problems in plain English."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "Spacey does his best work since \"American Beauty'' as a tired middle-aged corporate warrior whose greatest compassion, in the end, is reserved for an ailing dog he has to put to sleep."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "Chandor's writing goes to some darkly interesting places, and there's fun to be found in individual performances."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "Margin Call is an explosive drama that speaks lucidly and scarily to the times we live in."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "On the facile side, but it's well-crafted and smartly acted."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "Margin Call has a spectacular cast, and the 24-hour cycle of events gives the movie the compressed dramatic effect of a fine play."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "If nothing else, Margin Call serves as a rebuke to \"Wall Street: Money Never Sleeps\" emphatic style - which ultimately glamorizes the profession it means to shame - and brings this dangerous numbers game back to the trading-floor desktops and mahogany-covered conference tables where it belongs. It isn't sexy, but the stakes feel much higher."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "This compelling-acted film explains, better than any soundbite, why people have taken to the streets, \"occupying\" centers of finance. If their rage is unfocused, Margin Call suggests, that's with good reason. There are no real heroes or villains here, just human beings with human failings making BIG human mistakes."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 70,
      "summary": "Margin Call is smart, but too cool and solemn to raise anyone's temperature. Nonetheless, writer/director J. C. Chandor should count himself the luckiest man in show business this weekend. How many first-time feature filmmakers can truthfully claim that their movie collided right up against the zeitgeist?"
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 70,
      "summary": "Chanodr has said that he wanted to portray the 2008 financial meltdown in all its complexity, assigning everyone a fair share of the blame. But the real strength of his debut feature is how persuasively it depicts the fishbowl world of high finance, whose executives seem incapable of seeing past their towering salaries and privileged lives."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2011
      },
      "score": 67,
      "summary": "Unlikely to be either the tea party or Occupy America's first pick for best film of the year, Margin Call is nevertheless a surprisingly adroit effort to A) explain the birth pains of our current financial woes, and B) show what it might have been like, in these first few hours within the confines of an early investment trading firm casualty."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 63,
      "summary": "It's hard to feel compassion for these Masters of the Universe. I'm not even sure Chandor wants us to, but if he doesn't, then what's the point?"
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 63,
      "summary": "In the case of Jeremy Irons playing the aloof English billionaire who owns the bank, that's dinner theater. But it's of the highest caliber."
    },
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2011
      },
      "score": 63,
      "summary": "A portrait of the eve of 2008's financial crisis that plays out with\r\nfunereal inevitability, Margin Call loves speechifying, but the film is far\r\nmore assured when lingering in the silence of its morally compromised\r\ncharacters."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "Escalation is the main thing Margin Call has going for it, as more substantial actors are trotted out to have their way with Chandor's realistic-sounding boardroom dialogue."
    },
    {
      "critic": "Stephen Farber",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "The first-rate cast cannot be faulted. Chandor has assembled an extraordinary ensemble."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2011
      },
      "score": 58,
      "summary": "At least the latest movie about the financial meltdown doesn't make the same mistake as the last one. It also doesn't prove that a fictional film can explain the downturn's causes and effects better than a documentary."
    },
    {
      "critic": "M. E. Russell",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 58,
      "summary": "I just wish the movie wasn't also so monologue-choked, muted to a fault and fond of oversimplifying financial lingo to the point of meaninglessness."
    },
    {
      "critic": "Melissa Anderson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Unlike \"The Company Men,\" which successfully explored the moral conscience and despair of its corporate titans and middle managers, Margin Call's bids for sympathy for its most conflicted character, Spacey's Sam, fail."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 25,
      "summary": "As a movie, it's so tightly framed you gasp from claustrophobia. As a film of cryptic boredom, I cannot believe the actors were able to say their lines without cue cards."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "First off, this is not a tense Wall Street thriller. This is a tight drama about an economic titanic without the sappy love story. I am happy to have gotten to see this on VOD. I like a lot about the film. It has a great cast, the acting is professional, and the dialog and plot work like a finely tuned machine. That said, the only thing that is really off putting about this film is the average level cinematography. I don't know if it looked like this in theaters, but the aspect ratio and lighting didn't quite do justice to the epic scale of the story. This film is definitely worth seeing if you don't go into it expecting more of an thriller. There are a lot of speeches, and it comes off more as an exercise in dramatic theater rather than fully cinematic experience. However, it works.",
      "total_reactions": 3,
      "user": "Evanduq"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "It's definitely the best Wall street movie I've ever seen. Very well-written: complex characters and smart lines. It makes you want to become rich by every means necessary. It's that good!",
      "total_reactions": 2,
      "user": "TheoS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "This is an exceptional piece of independent cinema. Margin Call tackles the '08 financial crisis in the shrewdest, most charismatic way possible; with its brisk story telling, cool character development and a satisfying close. Chandor's direction made this a tangible, thrilling and understandable yet complex viewing experience; clearly outlining the root of the disaster and its unfortunate consequences. Its also important to mention the ensemble cast, who all gave powerhouse performances in this small movie. Very well done.",
      "total_reactions": 2,
      "user": "lahaine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "Margin Call is this years depiction of the current economic crisis and how it might have come about. Much like 2009s Up In The Air and Januarys The Company Men its main aim is to say something about the morally corrupt world we live in and how we live with the fact we know its morally corrupt.",
      "total_reactions": 2,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "This is a good movie. Great actor selection, Kevin Spacey and Jeremy Irons really making the difference. Comedy, drama and action in one place. It is a must-see.",
      "total_reactions": 1,
      "user": "radumilan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "A great cast and really solid direction, help this film about the financial crisis take off. As much as the film, at times, attempted to try and put the issues into simple terms, however, it still seemed confusing at times and unless you have some knowledge of the field, you'll be left sitting there confused. Luckily, I understood some of what they were talking about, but certainly not all of it and that hampered the enjoyablility for me. Otherwise, the characterization of the many characters was done really well and the acting, across the board, was really good. Overall, a solid film.",
      "total_reactions": 1,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "This is one of those movies where everyone calls flawless but I think it's well done on a acting and directing point of view, but I do think it's a bit overrated in my opinion.",
      "total_reactions": 1,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2011
      },
      "score": 3,
      "text": "If you know what a Margin Call is then you will be disappointed with this movie. The movies way of explaining anything is to say 'in plain English'. Apparently no-one in the upper echelons of the firm know nothing about securities as it is boiled down to the lowest common denominator  possible. This is no Enron- The smartest man in the room' - this is Fast and Furious. Fail.",
      "total_reactions": 3,
      "user": "MorriBey"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "This movie would have been a lot more potent had it come out right after the crisis. Three years later we have received so much information on the happenings in 2008 that a film that stays this close to the surface is just not going to cut it.",
      "total_reactions": 1,
      "user": "supersigy"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "Margin Callâ",
      "total_reactions": 4,
      "user": "CitizenCharlie"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2012
      },
      "score": 0,
      "text": "How can a film be labeled a thriller and suspenseful when I know what happens? And how can any reviewer say that their review contains spoilers? I know what happened. This is just a made up story  of what Mr Gecko said  \"... is good\". I knew they all did the wrong thing, thought only of themselves ,and took the money. Not one person cared. If this fictional account of what may have happened prior to the biggest hit to our economy in my 63 years didn't happen, the film would not have been made. There is no one to root for. Mr Irons says it's a great story. Maybe if it weren't true ( the outcome). Why would anyone praise a fictional film about soulless, inconsiderate, selfish people? And none of these people paid in any way, they made a bunch of money and not only has no one gone to jail, many got hired by our government. They deliberately sold worthless paper (isn't all paper really worthless) and didn't inform their customers. Lying, no? All the people that lost their jobs, their homes, their savings hopefully will not see this and no one involved in it will make much money. The reviewers, the actors, well, the people who don't worry about paying a mortgage, eating, etc. probably find it amusing as once again they are sticking it to the rest of us. I am prepared to suspend belief and even a film with no redeeming value of any kind can still be a well made film with believable characters, except, when the disastrous outcome is true. This film does not enlighten (what is a margin call? does it have anything to do with what happened? with the film?) nor entertain. If you are unlucky enough to see it, hopefully you will come away angry. But to paraphrase some dialogue from the film, \"nothing is going to change. there will always be the haves and have nots. F*** 'em.\"",
      "total_reactions": 3,
      "user": "RobinsNest"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2011
      },
      "score": 1,
      "text": "I had high expectations for this movie. It was really disappointed. The plot was thin - no character development to speak of. And they way the story came together was absurd. I was hoping for a thriller - this was a joke.",
      "total_reactions": 1,
      "user": "Jockodebockoo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2014
      },
      "score": 3,
      "text": "This film is boring from beginning to end.  It's not even a particularly good depiction of the greed behind the mortgage crisis.  The harm done to ordinary folks is totally absent.",
      "total_reactions": 0,
      "user": "duanewilliams"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "An engrossing drama about the shrewdness of the financial industry with a wonderful cast that delivers great perfomances (OK there is Demi Moore in it as well, but she has a small part) with Jeremy Irons standing out.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "On the face of it, this film does not appear to be the kind of thing to inspire an audience. I’m here to tell you that is far from the truth; I found it very compelling and a great eye-opener to the mechanics of the financial crash. Great performances all round with top honours going to Jeremy Irons and Kevin Spacey; both really excelled in this one. I think it’s a film I’d like to see again because the details of the reasons behind it all are quite complex and I’d like to get a better handle on that. It does lose a little momentum in the final quarter but it’s certainly worth investing the time to watch.",
      "total_reactions": 0,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "Not a bad movie, but the movie just was not attractive to me, bored me, the only thing salvageable was the decent performances, mainly the short appearance of Stanley Tucci.",
      "total_reactions": 0,
      "user": "wishmaster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "Margin Call is more like Shark thriller than financial meltdown movie. What'd you expect from movie about people who 'trapped' all night fighting the beginning of crisis? Powerful script, act and direction.",
      "total_reactions": 0,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 3,
      "text": "This film is so painfully dull. It does not fail because it's story but instead because of it's horrible choice of style and terribly slow moving plot. The film attempts to build tension throughout the film to lead up to it's climax. However the climax is well done but the viewer feels nothing because at that point of the film they don't care what happens. The film try's to go into what's right and wrong among many other themes but ultimately all of them go nowhere with the last scene of the film being spacey burrying his dead dog. I either could not figure out the significance in this scene or like most bad movies there was no significance. Definitely the most overated film I have ever seen.",
      "total_reactions": 0,
      "user": "cabrita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Just an awesome movie about how **** up this world is now. The whole film was so amazing.Awesome acting . The whole cast was great. great screenplay and Directing by J.C. Chandor. Margin Call is a different kind of thriller which is amazing coz its damn realistic .One of 2011's best movie with perfect screenplay , Great Cast and acting and good direction. Dialogues were so smart and yeah this world is **** up,Money +Human=Worst then Animals . J.C. Chandor's first feature film Margin Call will definitely take him higher.",
      "total_reactions": 0,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "This was very close to being the perfect movie. It was a great story, it was based on the reality of the world around us, the dialog was authentic, and the actors were brilliant. What more can the critics ask for? It just shows how powerful film can really be--without violence, without special effects, and without sex. Of course, the f-word was a special guest star, but unfortunately that is how the prostitute-addicted, drinking, lying robots on Wall Street really talk. The plot centers on a company that is basically a nonentity--there is no real product, no real service to humanity. These companies are merely parasites on our society whose function is to move money around, while their people get paid astronomical salaries for being a lot like Scarecrow in the Wizard of Oz--they prance around singing, \"if I only had a brainâ",
      "total_reactions": 0,
      "user": "ClariseSamuels"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "Very, very, very far from being a thriller of any kind. It's more like you're in the room with them. And for me, not knowing anything about anything to do with Wall Street, I got to have everything explained to me more than once, so even I felt like I knew what was going on. I mostly appreciated the atmosphere of the movie. The cinematography wasn't particularly flattering for anyone. I don't know how else to put it except that it felt like following a bunch of suits around during a crisis that they're a lot more worried about than you are.",
      "total_reactions": 0,
      "user": "allisonstarr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2011
      },
      "score": 2,
      "text": "As entertainment this movie is probably a 6 or 6.5.  However as historical fiction, which the film purports to be, it is an inexcusable dis-education of the public as to what happened in late 2008.  It actually takes quite a bit of financial education to understand what happened.  My suggestion to those who are interested would be to learn about leverage, the modern banking system,  CODs and MBSs.  Then read Ron Suskind's excellent book \"Confidence Men.\"",
      "total_reactions": 0,
      "user": "Ajedrecista"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "J.C. Chandor's debut is both challenging and a gripping look at corporate America during the early days of the recession of 2008. One bold look at corruption.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "First time director and writer J.C. Chandor delivers a gripping, tense film with Academy nominated screenplay, told largely over the hours of a single New York night.",
      "total_reactions": 0,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2012
      },
      "score": 5,
      "text": "Story was okay, and so were the actors. But the feeling as a whole was boredom, and at the end we couldn't even see the consequences of the crisis, just the man burying a dog. Pssh.",
      "total_reactions": 0,
      "user": "sLm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "Having worked in investment banking, I found this movie very interesting.  Although there is a clear bias against the trader, many of the perceptions and ethical values conveyed are somewhat accurate based on my experience.  It provides good information how the system works, and how it was destroyed.  Additionally, it was well acted, and has a very unique and attention-holding plot.  I definitely recommend it!",
      "total_reactions": 0,
      "user": "Tooms"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "The characters make the film here, as they're well drawn, yet difficult to sympathize with as this reveals the darker side of the decisions that sparked the 2008 financial crisis.",
      "total_reactions": 0,
      "user": "JTKelley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "Almost perfect. The film's contemporaneous relevance might be compared to certain stage plays in Shakespeare's time. The acting here is intoxicating in its honesty; the story-telling is exquisitely humble. To appreciate this movie solely as a \"cautionary tale\" is to overlook the true value proposition.",
      "total_reactions": 0,
      "user": "davidjden"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "Similar to another quiet, but fiery financial thriller (\"Arbitrage\"), \"Margin Call\" is a gripping, unflinchingly gray and well-written piece that simplifies a complex topic into something everyone can understand.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "Brilliant film! Great cast. Fantastic screenplay. While I'm not an expert in business/economics, the dialogue in this film was engrossing and powerful. One of my favorites of 2011 and one of the best as well! I plan to watch this again soon.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "Margin Call is a Masterpiece. Firstly because it is by far the most realistic film ever made about business in general and finance especially, even topping now number two Oliver Stone's Wall Street. Secondly, the cast is impeccable. Irons, Baker, Moore, Spacey, Bettany, Tucci and Quinto are at their finest hour. And thirdly, from the very first minute until the end, Chandor creates this heavy, dark and oppressing atmosphere that puts you emotionally and nervously on the trading seat.",
      "total_reactions": 0,
      "user": "Erik_Imsen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2016
      },
      "score": 7,
      "text": "Great performances from all the cast as, however the film at times feels slow part of that is because they are too many characters too focus on, aside from that the story is good if you like business movies, In the end, its a good movie.",
      "total_reactions": 0,
      "user": "geo333"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2015
      },
      "score": 7,
      "text": "I rate Margin Call up on account of the acting overall and as a Kevin Spacey fan (otherwise it would be a three). The shooting is fine, with some nicely framed shots. The story is OK but was a bit disappointing in terms of tension. Some scenes could have been left out in favor of flashbacks which reveal what the characters were doing in the weeks and months prior to the meltdown: who knew, what they knew, how they contributed, etc. But despite the story not being what it could have been, Margin Call is still an enjoyable film.",
      "total_reactions": 0,
      "user": "RobertBrogan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2016
      },
      "score": 3,
      "text": "This movie is just weird. The actors are great but the storyline and the content is very thin. An employee finds out the bank is leaking money for the past couple of weeks. After some analysis they figure out the bank is going bust. Everything else is stereotyping. That's all the movie is about. Stereo typing. This is how the movie goes:",
      "total_reactions": 0,
      "user": "Renovatia"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "Good movie, good actors, interesting dynamics, well worth the watch. Surprisingly well-done.",
      "total_reactions": 0,
      "user": "choomtabi31"
    }
  ]
}