{
  "mc_avg_user_score": 8.1,
  "mc_metascore": 82,
  "mc_mixed_rating_frequency": 3,
  "mc_movie_name": "Marley",
  "mc_negative_rating_frequency": 1,
  "mc_positive_rating_frequency": 25,
  "mc_pro_critic_reviews": [
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2012
      },
      "score": 100,
      "summary": "The tunes, flooding every frame, remain perfect."
    },
    {
      "critic": "Eve Barlow",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2012
      },
      "score": 100,
      "summary": "A masterful documentary to rival Macdonald's \"Touching The Void.\""
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 91,
      "summary": "Marley was directed by the gifted Kevin Macdonald (The Last King of Scotland), who shows off his chops not by doing anything dazzling - the film is documentary prose, not poetry - but by treating Marley as a man of depth and nuance, of inner light and shadow."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 90,
      "summary": "Marley is a detailed, finely edited character study whose theme - Marley's bid to reconcile his divided racial legacy - defined his music and his life."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 90,
      "summary": "What Marley and its wonderful performance footage leave you with most of all is the joy the man took in the music that set him free and enchanted the world."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 90,
      "summary": "It is gripping from the start, not just because of the quality of the music, but because of Marley's magnetic, challenging personality, as well."
    },
    {
      "critic": "Melissa Anderson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2012
      },
      "score": 90,
      "summary": "Thoroughly researched and packed with phenomenal archival footage, it's a rousing tribute to a mesmerizing performer that forgoes blind hero worship."
    },
    {
      "critic": "Jordan Mintzer",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 90,
      "summary": "Marley is sure to become the definitive documentary on the much beloved king of reggae."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2012
      },
      "score": 88,
      "summary": "Sprinkled with riffs, concert footage and home videos, the family-authorized documentary does what the artist usually did: When in doubt, return to the beat."
    },
    {
      "critic": "Farran Smith Nehme",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2012
      },
      "score": 88,
      "summary": "The movie has enormous force - because it's about a genius, yes, but even more so because of the intelligence, passion and wit of the people who knew Marley."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 88,
      "summary": "Marley, the new documentary about reggae icon Bob Marley opens on April 20 - of course. That date - often referred to as 420 - has been, since the 1970s, a time for people to gather to consume or celebrate pot. It has become an unofficial marijuana holiday, and Bob Marley has become the unofficial saint of marijuana."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 88,
      "summary": "It all flows from the shum. The man's musical and political influence was no illusion."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2012
      },
      "score": 88,
      "summary": "Marley, an ambitious and comprehensive film, does what is probably the best possible job of documenting an important life."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 85,
      "summary": "By the end you feel you've learned something about the man, yet his mystique emerges intact."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 83,
      "summary": "It may, finally, be the best and last word on the man, his music and his myth that we ever get on film -- an estimable achievement in itself."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "The thoughtful and leisurely paced Marley is an exemplary music documentary in almost every way - but the area in which it falls short is an important one. Like a surprisingly large number of films about musicians (whether biopic or documentary), this one is curiously resistant to letting the audience hear its subject's songs in their entirety."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "The director, Kevin Macdonald, searches for clarity amid the contradictions of Marley's life and reaches no conclusions, but that's a tribute to his subject's complexity in a film of fascinating too-muchness."
    },
    {
      "critic": "Jim Farber",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "Though the course of the movie, viewers learns a lot about the star's generosity, sense of justice and power in Jamaica, but also about his naivete."
    },
    {
      "critic": "Guy Lodge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "Kevin Macdonald's generous, absorbing, family-authorized documentary on the late, still-reigning king of reggae music."
    },
    {
      "critic": "Andrew Pulver",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "What results is an immensely detailed overview of Marley's life and times, from the hillside Jamaican shack where he grew up to the snowy Bavarian clinic where he spent his last weeks in a fruitless attempt to cure the cancer that killed him in 1981, aged 36."
    },
    {
      "critic": "Kevin Harley",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "Every second is earned in Macdonald's long, generous and rigorously detailed Bob doc. You might wish for more live material but what's here is stirring, probing and moving."
    },
    {
      "critic": "Ian Buckwalter",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 78,
      "summary": "Stylistically unremarkable, playing it safe with structure, the film is still quietly revelatory."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2012
      },
      "score": 78,
      "summary": "Most striking is Macdonald's deft use of music and Marley's lyrics (many of them obscure) to illustrate the film's points. So thoughtful is this counterpoint that it almost makes up for Macdonald never showing any one song in a complete performance."
    },
    {
      "critic": "Brad Wheeler",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2012
      },
      "score": 75,
      "summary": "Marley the film wonderfully explains its subject's music. As for Macdonald's message, I'm just not sure."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "Marley is thus a valuable history project but not a definitive or analytical one. For that, we await a film that's less \"One Love\" and more \"Stir It Up.\""
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "Marley celebrates the fact that its subject is still among us in the way that perhaps matters most: His music not only survives, it thrives."
    },
    {
      "critic": "Steve Morse",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "It's an outstanding, warts-and-all look at reggae legend Bob Marley."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "You also see a man, flawed and imperfect, finding his way through with his music, constantly searching for his place in the world."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "That's a lot for any film to unpack, and \"The Last King Of Scotland\" director Kevin MacDonald deserves a lot of credit simply for keeping the narrative coherent."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "There is no diverting from strict chronology, no point the documentary wants to make that requires moving forward and back through time. It just inches ahead, one year to another, sometimes one day to another. By the middle, each time a year changes, it's a relief."
    },
    {
      "critic": "Glenn Heath Jr.",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "The bloat and heft of Marley's narrative scope leaves the viewer awash in a sea of historical \"facts\" with very little sense of the human experience behind the curtain of celebrity."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "While the journey of getting \"Marley\" to theaters was complex, (copious disputes over director/producers) it's documentation of the titular figure, to the audiences' dismay, is not nearly as intricate; his life, as delineated on-screen, although captured musically through some hit-nostalgic riffs, feels unfulfilled compared to his off-screen life that saw moments of controversy--one most notably leading to the untimely end of his young life. Although such musical symbolism is effective in attemping to resurrect his name and rememberance, the film simply doesn't find a way to make him \"feel\" real. Instead, \"Marley\" is laden with incessant interviews, often back-to-back-to-back, a handful conflicting with each other, without director Kevin Macdonald making the least amount of effort to clear up the equivocation. Also seldom, are archival interviews with Bob Marley, himself. One would think the filmmakers would make it a priority to document the \"man\" and keep \"others\" documenting him to a limit. There are plenty of pictures snapped of him, and a couple clips, too, but the film primarily contains anecdotes told through the eyes of those who knew him best, most notably his children. However, the lasting image that is painted by the filmmakers in \"Marley\" is one that bears the scars of elongated delays in production, combating takes on creativity, and the overlying blatency of the indecent indignity that is held over it all, the film being hand-me-downed to the second highest bidder. Even more insulting, is the \"4/20\"--unoffically National Marijuana Day--release date that reverts back to the long-held self-concept of Marley as a ganja-smoking, marijuana mascot for all to lampoon at; it's a proscribing shame of a legacy. Not only is it a cheap gimmick from producers to get the stoner's to theaters, but more importantly, it unworthily labels a man who stood for much more than toking up and listening to reggae music; the film will be shown to millions who know little of Marley, and it is them, that need to know the \"true him\" most of all. Sadly to say, the film does him little justice, excluding much more than is satisfactory. Ultimately, it's still highly entertaining--leaving you with \"what might have been...if...--even despite its 144 minute duration, which by its end, will supply one with a warm feeling to \"jam.\"",
      "total_reactions": 1,
      "user": "FDT44"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "An excellent documentary not only for fans of the music, but for anyone with a remote interest in Bob Marley. We learn about Bob's upbringing, how he becomes a musical god and how his music touches people, both politically and commercially.",
      "total_reactions": 1,
      "user": "Notorious"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "Marley is a truly memorable documentary, and a glorious and fitting tribute not only to one of the biggest icons of reggae music but to a remarkable and fascinating man. From the very first jaw-droppingly beautiful aerial shot of Jamaica, Kevin MacDonald captivates you with his undeniable gift for documentary storytelling that really speaks to your heart. Rather than the usual dull \"expert\" talking heads, we watch interviews only from those who knew the subject best - his family, friends, band-mates and colourful neighbours. Bob Marley's life story is told in great depth and with incredible insight, and even the most ardent fan should come away better informed than before. I, for instance, never realised how central and domineering the Rastafarian religion was to Marley's life, nor how involved he became with political strife in South Africa and Zimbabwe. While some may accuse MacDonald of presenting an overly glamorous, rose-tinted view of Marley (he is clearly a fan), the way in which the documentary shows one of Marley's daughters talking about her father with such disdain and anger more than adequately covers his less-than-admirable personality traits. My only major criticism of the film is its running time, which is merciless. Consistently engaging though this documentary is, only the most dedicated viewer will get through the 2 hours 25 minutes unscathed. There's easily enough material here to split the story into two films, and then perhaps cover the darker elements of Marley's life in more detail. Over-long though it is, Marley remains a rewarding journey through an incredible life and wonderful music. The soundtrack, made up of Bob Marley's biggest hits in addition to some lesser-known early songs elevates the story even further, and not only allows you to re-appreciate his staggering talent, but in turn MacDonald's presentation of Marley's story allows you to glean the true meaning behind much of his songwriting. Everyone should be able to get something out of this tale of sunshine, passion and soul, but for a real fan of Bob Marley, this is essential viewing.",
      "total_reactions": 1,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "The best Bob Marley doc to be made as of yet. I would recommend to any Bob or just hardcore music fans. The music and interviews are intertwined perfectly to present a comprehensive portrait of Bob.",
      "total_reactions": 1,
      "user": "vivedreamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "Oh, I though that this was the review of the singer, LOL!! Still, I watched this documentary. It is the best documentary of Bob Marley. Keep doing awesome documentary, Mangolia Pictures!",
      "total_reactions": 1,
      "user": "Cubixreviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "They made a **** movie out of a legend's life... This movie was so incredibly boring to me, all 2 hours 20 minutes of it. I tried watching it again to try make sense out of it again, but no, another 2 hours 20 minutes wasted, and I don't know how to use that amount for the quote \"I want my __________ minutes back.\" That's Gone with the Wind and an episode of 24.",
      "total_reactions": 0,
      "user": "chw"
    }
  ]
}