{
  "mc_avg_user_score": 4.6,
  "mc_metascore": 30,
  "mc_mixed_rating_frequency": 14,
  "mc_movie_name": "Marmaduke",
  "mc_negative_rating_frequency": 22,
  "mc_positive_rating_frequency": 19,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "not the best movie in the world but a pretty good movie for little kids not a very good movie for older audiences though. at least it keeps little kids entertained.",
      "total_reactions": 3,
      "user": "dylster11"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "cut the film some slack, it may not be to grown upsliking but is perfect for the lttle kids. it has its funny moments, whoever does not like this does not have any sense of humour!",
      "total_reactions": 5,
      "user": "jackb99"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "This movie is the best, it's funny, it's just awesome. It the best movie made in 2010!. I couldn't give it 10-it had some flaws. But it was still awesome! I loved it",
      "total_reactions": 5,
      "user": "RyanLopez"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2010
      },
      "score": 3,
      "text": "\"Extremely Cartoonish , the CGI animated dancing Dog sequence kind of freaked me out , it reminded me of Scooby Doo which i liked better than this its mild entertainment for the young ones parents and teens you will be lost in the movies bad plot & blunder\" .. C-",
      "total_reactions": 1,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 1,
      "text": "If you watch the live action Garfield film, you must think \"surely this is the worst film involving a live action animal as the star\"? Not anymore, it isn't Marmaduke is a dull film about a live action dog, where the humour is mainly dancing animals and farting. Oh, and William H Macy getting knocked over. Twice. I know, the film is intended for children, but seriously?Kids like this garbage? I suppose they also like Batman & Robin then The reason I haven't given this film a 0 ratingis because the live action actors, such as Lee Pace and William H Macy, act well, despite the godawful script which could've been written better by two five year olds. They manage to endure the rubbish and act professionally. It's also impressive how many good actors the film got for voice actors. Kiefer Sutherland, Owen Wilson, Christopher Mintz-Plass, Chris Colfer. Must've been paying them a lot. So, if you get to the cinema and find all films but Marmaduke are sold out, go home. It's not worth the admission of the cinema ticket. In fact, it's better for you to take a ten pound note and place it in the shredder. It's more entertaining, has better dialogue and is a better value for money than seeing Marmaduke. I think i'm gonna Marma-puke",
      "total_reactions": 1,
      "user": "roddersj04"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "Marmaduke is a good film for young and old. I really enjoyed it because of the cute dogs and funny storyline. Yes, it is not perfect, but it's good for what it's for and it is a big selling film. And you have gotta love Mazie and Marmaduke's cute relationship, haven't you?",
      "total_reactions": 1,
      "user": "Filmcritic1000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2010
      },
      "score": 4,
      "text": "The voice cast impress, but the plot, characters and jokes are all recycled from better movies.  Fun for young toddlers, innofensive but rather too derivative for an older audience.",
      "total_reactions": 0,
      "user": "grindhouse83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2010
      },
      "score": 0,
      "text": "I knew the movie was going to be terrible when the CGI looked like something I would do when I am extremely tired, drunk, or all of the above. And when I seen Marmaduke fart, I knew it was going to be awful.",
      "total_reactions": 0,
      "user": "Vormund_Bolt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "This movie is an extremely predictable story about trying to find your place in high school, the difference? the teenagers are dogs, while it does have it's funny moments, it's not all that entertaining, only young children will enjoy this movie, and not all of them, know what your getting into before you watch.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2014
      },
      "score": 4,
      "text": "Based on the long running comic strip about a great dane Marmaduke doesn't do any better job of converting its source material than the ill advised Garfield movies.",
      "total_reactions": 0,
      "user": "drlowdon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2012
      },
      "score": 5,
      "text": "Its not all bad, and its a heck of a lot more fun than Alvin and the Chipmunks 3. Owen Wilson was a good choice for Marmaduke's voice and the story is harmless fun.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2014
      },
      "score": 1,
      "text": "The films absolutely annoying characters and boring dialogue are likely to slip past the minds of kids, but for everyone else It's an 87 minute film that is dull and ugly. Very, very ugly.",
      "total_reactions": 0,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "Charming and it's a kid's comedy but somewhat funny, there are talented people in the film but all of them were missed cast go watch them in something else. Grade C+",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2016
      },
      "score": 4,
      "text": "It's not the best dog movie for this year at all. In fact, they all had their moments just like how Marmaduke has its moments. Someone needs to put a movie poster on this movie though.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2016
      },
      "score": 10,
      "text": "Absolutely fantastic movie, it made me cry tears of happiness. The characters are completely believable, the acting is superb, especially Owen Wilson, and the directing is some of the best since Stanley Kubrick, heck, even better! This movie deserves an academy award in every category, including best original song and best animated movie!! Truly a masterpiece of film making! I would recommend this movie to everyone I know. I watch it every day.",
      "total_reactions": 0,
      "user": "Zarbixii"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2016
      },
      "score": 1,
      "text": "Another one of these dog movies with bad characters, bad plot, bad special effects, and the jokes to be so bland and cliche and annoying that even KIDS will hate it!",
      "total_reactions": 0,
      "user": "GamecubeLover"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2016
      },
      "score": 5,
      "text": "Marmaduke is one of those movies that isn't a dog, but not PAW some either. It has some moneys of humor, but its a flick mainly for younger ones. It has an overload on potty humor and is bland and very predictable. It's mostly harmless, but not the best family movie.",
      "total_reactions": 0,
      "user": "StannyCartvski"
    }
  ]
}