{
  "mc_avg_user_score": 7.1,
  "mc_metascore": 76,
  "mc_mixed_rating_frequency": 25,
  "mc_movie_name": "Martha Marcy May Marlene",
  "mc_negative_rating_frequency": 9,
  "mc_positive_rating_frequency": 80,
  "mc_pro_critic_reviews": [
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 100,
      "summary": "Moves from its protagonist's dream state to her memories to her waking present in imperceptible shifts - the effect is disorienting, at first, but ingenious."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2011
      },
      "score": 91,
      "summary": "It's a topic that's been handled in films before, perhaps most notably in Jane Campion's \"Holy Smoke,\" but Durkin offers the most persuasively believable peek into the psyche of such a character I've ever seen."
    },
    {
      "critic": "Noel Murray",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 91,
      "summary": "Because the movie plays on so many common fears - including fears of being in a remote house with big windows when intruders arrive - the confusion of Martha Marcy May Marlene proves effective, not sloppy."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2011
      },
      "score": 91,
      "summary": "Like \"Afterschool,\" Durkin's first feature explores the dangerous extremes of youth vulnerability."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2011
      },
      "score": 90,
      "summary": "Olsen makes us understand, as best we can, Martha's plight. She has a tenuous grip on reality, and, thanks to Olsen's performance and Durkin's sure hand, by the film's end, so do we."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 90,
      "summary": "A film of rough edges and no easy answers, nearly perfect in its imperfection."
    },
    {
      "critic": "Sara Maria Vizcarrondo",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2011
      },
      "score": 90,
      "summary": "Martha Marcy May Marlene enters so richly into psychological horror it recalls those disturbing dramatizations of Jonestown that were big on TV in the '80s."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2011
      },
      "score": 88,
      "summary": "The rawboned Hawkes manages both charm and menace in the same look, and Dancy gives his character a testy, fearful edge that doesn't make him scary, but rather someone we fear for."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 88,
      "summary": "The acting in Durkin's feature is excellent. Olsen is utilized largely as an object for camera adoration, but not in the usual glamorizing way. Olsen, Hawkes and company play slippery figures with lovely assurance."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2011
      },
      "score": 88,
      "summary": "A linear story, or one that was fragmented more clearly, could have been more effective. Still, a good film, ambitious and effective, introducing a gifted young actress and a director whose work I'll anticipate."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2011
      },
      "score": 88,
      "summary": "Martha Marcy May Marlene offers a challenging, emotionally riveting experience, even if the conclusion dangles at the edge of an unresolvable cliffhanger."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2011
      },
      "score": 88,
      "summary": "This small movie carries great allegorical weight as it echoes the Manson Family, the long list of failed utopian communes that culminated in Bolshevism and the one-child policy that in China has prevented the births of untold numbers of girls."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 88,
      "summary": "It's Olsen, as a damaged soul clinging to shifting ground, who makes this spellbinder impossible to shake."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 88,
      "summary": "Like Roman Polanski's \"Repulsion,\" Martha Marcy May Marlene gradually places us inside the mind of a woman who just might be insane, and in its audacious, terrifying final scene, the movie traps us there in perpetuity, refusing to provide the viewer with a way out. This time, the horror follows you home - no exit, no escape."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2011
      },
      "score": 85,
      "summary": "Olsen's performance is restrained but not tentative; you could say the same for the movie around it."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 83,
      "summary": "Martha Marcy May Marlene leaves a viewer hanging, quite literally, lost in an enveloping fog of mood without resolution. Olsen, meanwhile, definitely marks her arrival."
    },
    {
      "critic": "Ian Freer",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2012
      },
      "score": 80,
      "summary": "Rough around the edges and too ambiguous for some tastes, this is grim but clever, insidiously creepy and affecting. And in Olsen and Durkin, it marks the arrival of two exciting talents to watch. It still should be called Mental Sex Cult."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 80,
      "summary": "Durkin reveals how the sisters have been pulled in opposite directions by the death of their parents. But the story structure also nurtures a creeping, finally unbearable dread that may have you looking over your shoulder all the way home."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2011
      },
      "score": 80,
      "summary": "Durkin seems to be aiming for a Hitchcock-style thriller that has the unsettling psychological and narrative ambiguity of, say, Michael Haneke's films, with an ending you can read in many different ways. If he doesn't quite get there, it's still a remarkable feature-directing debut."
    },
    {
      "critic": "J. Hoberman",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2011
      },
      "score": 80,
      "summary": "A deft, old-school psychological thriller (or perhaps horror film) that relies mainly on the power of suggestion and memories of hippie cult crazies."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2011
      },
      "score": 80,
      "summary": "A lesser movie might hammer home the idea that the cult squashes Martha's sense of self. This distinctive and haunting effort implies something much scarier: that there is no self to start with."
    },
    {
      "critic": "Read full review",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2011
      },
      "score": 80,
      "summary": "What the writer and director, Sean Durkin, delivers here is not a cult film at all but something more troubled and insidious - a film about a cult."
    },
    {
      "critic": "David Rooney",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2011
      },
      "score": 80,
      "summary": "Elizabeth Olsen steps onto the radar as a seriously accomplished actor in this mesmerizing drama, which also marks an assured feature debut for writer-director Sean Durkin."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2011
      },
      "score": 80,
      "summary": "The largely elliptical script feels a few drafts shy of focus, with the thriller elements undermining the juicier questions of why one joins a cult and how life can go back to normal later."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2011
      },
      "score": 78,
      "summary": "Durkin's film seems to exist in its own fractured dream state. It's hypnotic, narcotic, and trembling on the verge of either dread or redemption or some hazy state of nothingness in between."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2011
      },
      "score": 75,
      "summary": "Perhaps the spookiest thing in this slyly scary movie is the word-for-word way that Patrick's followers regurgitate his pablum."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "Director Sean Durkin's precisely constructed psychological thriller Martha Marcy May Marlene is a movie of many m-words – memories, mirrors and madness."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "Elizabeth Olsen delivers an utterly transfixing turn as the title character of this chilling psychological thriller."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "This doesn't feel like art, it feels like a cop-out, as though Durkin couldn't decide how to end his movie, so he didn't. He's a mature filmmaker - a natural - but he's still thinking in shorts."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "Durkin is a bit too fond of drawn-out scenes of ominous anomie, and he doesn't provide enough psychological ballast for Martha's misery. He doesn't need to. Olsen, with her angelic face and hard-bitten voice, provides it for him."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "A horror movie that follows none of the predictable paths of the genre, it offers disturbing psychological drama and nuanced chills rather than outright terror."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "Creepy and serenely suspenseful, Martha Marcy May Marlene is a riveting study in what it's like to escape from a physically, psychologically abusive cult, and how hard it is to return to normal life after being brainwashed."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 63,
      "summary": "The quietly moving drama Martha Marcy May Marlene must be thought of as an \"arrival\" film. That is, for all that it has going for it (and, it must be said, against it), if it is remembered for anything it will be for introducing a 22-year-old newcomer named Elizabeth Olsen."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Patrick periodically criticizes his disciples, including Martha, for failing to be open enough with him, and that is also a shortcoming of Martha Marcy May Marlene, which is a bit too coy, too clever and too diffident to believe in."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "The non-ending turns the whole movie into an elaborate tease, too creepy to dismiss, too shallow to justify its \"ambiguities.\""
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 40,
      "summary": "Martha Marcy May Marlene took a good hour to start really getting on my nerves. Up till then, I kept cutting this maddening little psychological thriller break after break, because it has the outer form of a promising debut."
    },
    {
      "critic": "Jaime N. Christley",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2011
      },
      "score": 38,
      "summary": "The film seems almost to have been produced spontaneously, by gears of a larger system as they mesh together right this instant, culled from the ether with the words \"Customers Who Also Liked Dogtooth and Winter's Bone Liked This…\""
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 25,
      "summary": "Martha Marcy May Marlene is a strange case, a drama that's disturbing and yet inert. Writer-director Sean Durkin builds an atmosphere of dread, which means that he persuades us to believe in the characters and in the central situation. But he doesn't build interest."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "While this is getting rave reviews, I personally had a miserable time with \"Martha Marcy May Marlene.\" First of all, in any movie the characters need to go through some kind of transformation so we can understand what they're going through. In a way, Martha does change. There are a series of flashbacks that show her happy and carefree as she settles into the cult of a sex crazed looney. Then we see her psychologically damaged after she's escaped and living with her sister. But the movie establishes these two sides of Martha early on and very little is done in the end to give us a complete picture of who Martha is as a person. I also didn't care too much for the outcome of her character. While Elizabeth Olsen gives a knockout debut performance, I found her character to be very self-centered and foolish. First, she was stupid to have joined the cult and believe all of the stupid babble the leader spewed on her. Then she refuses to even hint at what happened to her with her sister. I understand that a person would have a hard time opening up about traumatic events, but they at least need to understand that she's been through some messed up times. She never lets them know. It becomes very frustrating to deal with. Then to top it all off, the movie ends at a random point. I felt like I went through enough trouble in this film to get some kind of conclusion, but the movie leaves us with none. I saw a lot of similarities between \"Martha Marcy May Marlene\" and \"Take Shelter,\" but the biggest differences for me were the characters and execution. The characters in \"Take Shelter\" were compelling enough that it could end on a cliffhanger and get away with it. The characters in \" Martha\" on the other hand, were rather unlikable. Also, the ending is beautifully executed in \"Take Shelter,\" while in \"Marcy\" the movie ends like the projectionist forgot to put on the last reel.",
      "total_reactions": 3,
      "user": "JollyG87"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2011
      },
      "score": 3,
      "text": "Martha Marcy May Marlene continuously cuts back and forth between past and present.  However, the audience could have used a lot more past and a bit more present to help understand more about Martha (Elizabeth Olsen).  The past shows Marthaâ",
      "total_reactions": 1,
      "user": "CitizenCharlie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2013
      },
      "score": 2,
      "text": "I'm late in viewing this film and then seeing these reviews... I'm astounded by the number of people who found this really spoke to them. It's not a terrible movie.... just hollow at the core. It uses minimalism for a subject that deserves a lot more story and script to describe what is going on psychologically. This attempt is not ambitious enough to go there. Instead, it is just kind of prurient and blanky dismal.",
      "total_reactions": 1,
      "user": "lancekoz"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "I'm giving this film a slightly higher score than I think it deserves simply for the intense, disturbing feeling it left me with. The film's structure - which tells a tale in sort of a double-helix structure, alternating between a girl's time in a Utopian cult and her time with her sister and the sister's new husband after fleeing from the cult - is effectively spun.  It doesn't knock you over the head with it's bluntness. It becomes more and more stressful as you see more of both stories. John Hawkes and Sarah Paulson are uniformly terrific as the dominant supporting characters on opposite sides of the film's divide. And Elizabeth Olsen is clearly a rising star, though I don't think she's as effective in this role as someone like Jennifer Lawrence is in Winter's Bone - a film that I think will be compared to this one by many.  The ending of the film will certainly have you talking with whomever you go to the movie with - so go with somebody \"with it.\" Now that I've dwelt on it a bit more, a think a 9 is appropriate. See it.",
      "total_reactions": 5,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "I hate movies that leave me with a question mark at the end, but this takes away what it was a movie that I agree with the expectation until the last minute but ultimately disappointed, I have to praise the performance of Elisabeth Olsen magnificent. btw: the song of Marcy, damn addictive.",
      "total_reactions": 2,
      "user": "wishmaster"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "Where was Marlene? After @20 minutes I began fast forwarding to see if anything actually \"happens\". It finally does, someone gets killed for no reason. Uninteresting story and people. Why is the heroine the way she is? Why was she so lost? Is she strong ? I guess so because she runs away; but why? She must be weak because she believed that rape and abuse are normal. Why was this movie made? What's the point? A film must reach me on at least one emotion. Nothing, hence the grade, reached me. Every generation has it's group that does something different; pushes the envelope; creates an opposite. Sometimes those with too much time on their hands, grab on and tell us to \"Look at the emperor's beautiful clothes\" because there is very little going on. They try to convince us the clothes are beautiful when in fact this emperor is not wearing anything; like the heroine.",
      "total_reactions": 2,
      "user": "RobinsNest"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2011
      },
      "score": 1,
      "text": "So what if it's turgid, banal, and entirely in love with itself? At least it's slow. What a turkey.  And can you imagine the suits panicking over the title?  \"Do we HAVE to call it 'Marth... Mary... no, Merle'... oh what the CHRIST is the name of this thing again??  Can't we just call it 'Lots of Young Naked People Swimming'?\"",
      "total_reactions": 0,
      "user": "dougrees"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "An interesting exploration of PTSD, and well-acted by all. But the frustration of a couple of characters who don't do what you really, really want them to do culminates in an abrupt, unsatisfying ending.",
      "total_reactions": 0,
      "user": "Lyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "Elisabeth is the true star of the Olsen sisterhood.  She shines so bright with her assured performance of a damaged soul, wrecked by a horrific cult leader who is played by an equally amazing Hawkes.  A harrowing story, masterfully directed is not an easy watch which might haunt you the same way Martha is haunted in the film by her ordeals.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "It",
      "total_reactions": 0,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "With such a lyrical title, you'd think this was a sweet story about a young girl, but you'd be wrong. Elizabeth Olsen (younger sister of the twins) plays a very troubled young woman who leaves a small cult to find refuge with her sister. Even though she's separated physically, she can't escape the emotional damage. The film alternates between both worlds without ever giving enough resolution in either (don't get me started on the ending). The narrative flow is disrupted by brief scenes that dole out snippets of revelation, but never build to a cohesive whole. The slow pacing only adds to the frustration.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 1,
      "text": "You really won't care about Martha, her sister, her sister's husband, the cult leader, the cult members or anyone else.  You'll just be bored and annoyed by the glacial pacing, the inane camera pans, the silly time jumps and the general lack of storytelling.  I gave it a one instead of a zero because Sarah Paulson and John Hawkes are good actors who attempt to do something with this awful material.  Elizabeth Olson, however, doesn't do much more than stare blankly in scene after boring scene.",
      "total_reactions": 0,
      "user": "dotfail"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "Like another reviewer, I also left this film feeling very disturbed and sure I would have nightmares (didn't), so any film that can produce that kind of emotional reaction gets a thumbs up from me. It was not a perfect film, but overall really well done. I enjoyed the split time-line way of telling the story, always trying to guess what time period I was watching. Thought Elizabeth Olsen was very effective, but once again agree that Jennifer Lawrence would have been better cast (MarcDoyle we ought to compare notes on film). So it's worth the time and $, go.",
      "total_reactions": 0,
      "user": "Hawkeye_Lori"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "Often times, when we go to the movies and see a great film, we lay back in our seats and go",
      "total_reactions": 0,
      "user": "NKOAS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "I appreciated this film immensely. Very well acted, especially Elizabeth Olsen who is a breath of fresh air, with an intriguing and mysterious plot, where empty space and what was unsaid were just as important as dialogue. Olsen's character was a delight to watch, so unstable as to explode at any moment, and John Hawkes was excellent as always as the unhinged cult leader, a terrifying force. In the end what I appreciated the most was being able to interpret the vagaries of the story myself, without threads being wrapped up neatly; makes for a much more unsettling experience. Great stuff.",
      "total_reactions": 0,
      "user": "wiggipop"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "I think most people will probably understand this movie logically, but it's vital to understand it deeply, because it talks about how bad she wants a different point of view over life. She wants something more than what it's shown for most people, so she searches for this alternative group of people to develop herself, but her error is in pushing the situation to its extreme, because clearly (in my opinion) they're radical beings who try to attract people that have different analysis about the world. However, they're intentionally bad, because obviously they like to create a law on their own, and by that they try to take advantage of people. They're messed up, they left their disorders get the best of them, and it turns out that what they're actually doing is nothing more than screwing up with themselves. /Martha is someone neurotic, but she's a good person, and she does not realize that those creatures are trying to manipulate her, to change her for the sake of their welfare. She doesn't need that kind of environment, she needs to focus in the right way, and by that would be pursuing her philosophy and growing it into a healthy life, where soul matters, where you achieve a true connection with your higher self. And of course neither living the normal life supported by the thesis you have to build a career like everybody else nor living in a place made by people who try to live freely with abusive ways towards human condition and that eventually corrupts.",
      "total_reactions": 0,
      "user": "LeadBox"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "Martha Marcy May Marlene is one of the best films of 2011. The film has great performances powerful imagery and an outstanding ending. Many have called it ambiguous, but I believe further examination shows otherwise.",
      "total_reactions": 0,
      "user": "cabrita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "Draw yourself a warm bath because you're going to need one after the heartbreaking Matha Marcy May Marlene. Incredible performance by Elizabeth Olsen who I think got snubbed from the Oscars.",
      "total_reactions": 0,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "Althought not as good as Black Swan, MMMM is certainly the best psychological thriller of 2011. Olsen is an absolute surprise. Had to see this twice. It's very slow-paced but, if you commit , very fragile, intense and disturbing as well. What I appreciated the most was that lots of issues were not explicitly settled but you can decode them, you can see where they are. Those subtleties made the movie. Just wondered why the trailer has some scenes which don't appear in the official version.",
      "total_reactions": 0,
      "user": "Belmsher"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "Amazing film - very sinister and reminiscent of Funny Games where the nothing is allowed to fill the eerie silence. Elisabeth Olsen's performance was truly superb and deserves the plaudits, awards and nominations she's receiving at the moment - one to watch for the future. The suspense and tension throughout the film made you wish to be put out of your misery (in a very good way). Expecting big things from director Sean Dirking in the very near future...bravo",
      "total_reactions": 0,
      "user": "iamclacky"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "The film is at once disorienting and intriguing, about a girl's personality disintegration from a cult background to a blur with reality, and everything in between. The flashbacks serve to underscore how reality changes perceptibly with the past, with a very surprising, unexpected ending that seems puzzling at first but when put in perspective is a brilliant culmination to this excellent film. The clue to the entire movie is in the title, and requires thinking away from the normal. I recommend this film with only minimal reservation. Superb acting and a chilling plot make for great entertainment for the thinking individual.",
      "total_reactions": 0,
      "user": "drchoc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "Kind of an exquisite film, a movie about a cult that explores the darker psychological aspects of brain-washing that are so integral to \"cult life.\" All of the actors give fantastic and wide-ranging performances, from Martha/Marcy May/Marlene, to her yuppie sister and her delightfully square husband. The film is beautifully shot, utilizing cuts in subtle and effective fashion, seamlessly weaving from past to present in an interesting and exciting way. It is a quiet movie in the literal sense, the score is never assaulting, and not much really happens, but it is mesmerizing in its silence. Some may say it is a little on the boring side, which may be true, but if you just sit back and allow this film to work on you, and not the other way around, you will be truly amazed at what you find.",
      "total_reactions": 0,
      "user": "todayor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "This movie is remarkable for it's ability to describe the garden variety psychological flashback that survivors of psychological trauma experience. The main character Martha can't always tell the past from the present, and to free herself from the disturbing confusion, usually responds to present situations with the kind of inappropriate behavior that she learned and was encouraged to use while she belonged to a cult. The cult is creepy, no argument there, but the eerie tone of the movie comes from our own our vicariously experiencing Martha's flashbacks. The movie's ability to throw us into Martha's confused and disturbed mind, it's startlingly original, but for someone not willing to take the bait, it's just another psychological terror flick, but a really good one at that!",
      "total_reactions": 0,
      "user": "eugene_skala"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2011
      },
      "score": 1,
      "text": "Who knew it was so easy to start a cult? I found the script lacking in depth and imagination. I just didn't buy it. If it was Kool-Aid, I would have spit it out.",
      "total_reactions": 0,
      "user": "Debbie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "Well told story of a troubled girl to say the least. The movies disturbing narrative exceeds making hairs stand up on you neck, it painfully pricks them leaving you with no choice but to continue watching, yes that's a good thing. Watching \"MMMM\" re-develop her relationship with her sister, (or should I stay corrupt further) was more intense to watch than the cult like farm life. The movie has good cinematography and Olsens performance is better than the older sisters life work combined. I hope the academy recognizes her performance.",
      "total_reactions": 0,
      "user": "cheesepoof420"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "I'm sorry, but while watching Martha Marcy May Marlene, I was never once frightened, worried, or even disturbed. After watching the film and reading what people were saying I just felt like I had missed something very important. I never once felt that the cult, whose practices she seemed to embrace were coming after her. For the bulk of the flashbacks, or whatever you want to call them, she seemed to be okay with whatever bizarre rituals were taking place. I don't know what she was so afraid of. But still, this Olsen twin who appears to have eaten a meal in her life, was interesting to watch. Her interactions with her sister were the moments where I felt the most on edge. Captivating stuff.  I desperately wanted to understand her fear, but the film didn't have me buying it.",
      "total_reactions": 0,
      "user": "allisonstarr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "I never expected this film to glue me to the screen. Mention-worthy performance from Elizabeth Olsen. The cast played their parts well. The screenplay was admirable. And, the ending will make you think the film has gone broken and you missed the remaining minutes of the movie. No ending as this was a cliff-hanger this year in the movies. movienotesbook.blogspot.com",
      "total_reactions": 0,
      "user": "aozeta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "There is a quiet dread that lurks over every scene in Sean Durkin's masterful feature debut, Martha Marcy May Marlene. The movie tells a story of a young woman, Martha, who flee's an abusive cult and stays with her sister. While safe with her family, Martha's growing paranoia takes over as the film shifts effortlessly between reality, dream, and memory. We see what Martha sees. The film features a breakout performance from Elizabeth Olsen who is magnetic in the title role. She delivers the breakout performance of the year and I hope that it takes her as far as last years Jennifer Lawrence and she is awarded with an Oscar nomination. There has been a lot of talk revolving around the ambiguity of the movie. There are no answers for some of what we see on screen but I gather that that is the point. The movie is told from Martha's perspective. We are left to wonder, just like her, how much of what is going on is real or in her mind. Martha Marcy May Marlene is a glorious feature with strong performances, beautiful cinematography and editing, and an ending that will leave many frustrated by its ambiguity but also reward everyone with conversation after it is done. One of the best films of the year.",
      "total_reactions": 0,
      "user": "brettjm18"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "The Sundance Rural Thriller, not one of my favorite genres, has been kind of on the rise as of late, and Martha Martha Martha Martha . might be one of the better of the lot. All the talk around the film is around the praiseworthy debut of the other Olsen sister, and that showering of attention is justified. Whatâ",
      "total_reactions": 0,
      "user": "DiegoSanRobles"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "I thoroughly enjoyed the weaving of the past, present and the almost dreamlike state of Martha. The performances were on point but I left the movie with too many unanswered questions. Purposefully made this way to be discussed afterwards I'm sure but I didn't really know what to make of it. For some movies that certainly works but I just needed some more of the story, it was left unfinished in too many areas.",
      "total_reactions": 0,
      "user": "TTW107"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "This last yearâ",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "Dark and fascinating, Martha Marcy May Marlene is not your everyday cult film. Elizabeth Olsen gives us a performance to really sink our teeth into and continue talking about for weeks.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Martha is picked up at the bus stop  scared, confused, and alone. As she attempts to settle in to a normal life with her sister, she is haunted by horrible images from the past, where she had become part of a hippie commune led by the persuasive and charismatic Patrick. Martha's nightmares, fear, and paranoia continue to build until she is unable to separate her dreams from reality. First-time director Sean Durkin has struck immediate success with MARTHA MARCY MAY MARLENE, the award-winning cult drama from 2011. Durkin delicately interlaces the past and the present as he retells Martha's chilling experiences using an organic story structure. It is terrifying to think just how easily an impressionable mind could be manipulated and controlled in such a way, but Durkin takes all of the right steps in disarming the audience in the same way that Patrick has disarmed his followers, perfectly illustrating the power of coercion and the psychological lures that draw people in to such a group. Elizabeth Olsen is phenomenal as Martha, and commits herself mind, body, and soul. There are moments where Martha makes contact with the viewer and causes them to turn away in shame for intruding into her thoughts and emotions. John Hawkes is deadly as Patrick, coming on with a subtle charm that effectively seduces the other characters under his spell before corrupting their minds. MARTHA MARCY MAY MARLENE will not be easily forgotten, and is a top-contender for Best in 2011.",
      "total_reactions": 0,
      "user": "ILHM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "Elizabeth Olsen is a revelation here as the taut script and direction move seamlessly between past and present, creating an odd, haunting atmosphere that is only reinforced by the finale.",
      "total_reactions": 0,
      "user": "JTKelley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "A film that start´s really slow and then abruptly ends, the performances are excellent, the script adds dept but the direction is somewhat weak... mixed reactions about this one.",
      "total_reactions": 0,
      "user": "dodgingbullet"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "A year has past since I first watched this film and with the exception of one or two, not a film has come close. Second to none storytelling and a powerful yet unpretentious performance by Olsen. Outrageously overlooked.",
      "total_reactions": 0,
      "user": "LaGuerta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "You feel real tension as you see this young woman try to become a member of society while still dealing withwhat's right and what's wrong.  Elizabeth Olsen makes you really feel that sense of the unknown and I thought the finale works well.  We don't always need to know the answer.  A-",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "I've tried several times to understand this movie and I have wanted that movie were good-film to me but I can't understand yet. Okay, Martha has many problems, she joined a dangerous sect and she gets to run away up to her sister. She is very scared and these scenes cause me a much anxiety. But, Martha is not a feeling character. Martha runs away but her abstraction is more difficult for understand. Besides, film hasn't got a purpose. It's an attempt to be \"Black Swan\" or \"Perfect Blue\".",
      "total_reactions": 0,
      "user": "mapizarro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "Two things stopped me from enjoying this...film...? Yes, there's the fact it feels incomplete and without a proper ending to do the movie justice, making it feel more like a book instead of a film. Secondly there are constant flash-backs throughout the movie which appear from absolute no where and can cause confusion if not keeping a careful watch on the progression of the characters present in Martha Marcy May Marlene.",
      "total_reactions": 0,
      "user": "JudgeMathew"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2015
      },
      "score": 7,
      "text": "Martha Marcy May Marlene starts better than it ends. Elizabeth Olson plays a sympathetic lead in an intense role. One expects there to be some kind of character development, some payoff for the emotional investment in the main character that the film builds up. Unfortunately, plotwise, the film devolves into a vehicle for cheap thrills and goes nowhere. One wishes it would have been more, but for what it is, it is still worth a view. Recommended to those interested in social dynamics and what life is like for people caught up in cults.",
      "total_reactions": 0,
      "user": "RobertBrogan"
    }
  ]
}