{
  "mc_avg_user_score": 7.8,
  "mc_metascore": 83,
  "mc_mixed_rating_frequency": 2,
  "mc_movie_name": "Marwencol",
  "mc_negative_rating_frequency": 1,
  "mc_positive_rating_frequency": 12,
  "mc_pro_critic_reviews": [
    {
      "critic": "Kevin Thomas",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2013
      },
      "score": 100,
      "summary": "Watching Marwencol, Jeff Malmberg's probing documentary on Hogancamp's undertaking, is an exhilarating, utterly unique experience."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2010
      },
      "score": 100,
      "summary": "A  strange and very beautiful documentary about the gray area between obsession and art."
    },
    {
      "critic": "Stan Hall",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 91,
      "summary": "One of the most affecting true-life character studies in quite some time."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 90,
      "summary": "This moving documentary sidesteps the usual art-world debates over the authenticity and legitimacy of outsider work; instead director Jeff Malmberg simply immerses us in Hogancamp's world, just as Hogancamp immerses himself in the title town and its horrors."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 88,
      "summary": "Marwencol is about Hogancamp and his miniature alter-ego, about his photographs and his creative process. But it is also, on a deeper level, about how we process our experiences - good and bad, violent and mysterious - and how we try to build safe places in our lives."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 88,
      "summary": "Hogancamp's alliance with director Jeff Malmberg in this artful and poignant film marks a victory in the war against the self."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "At its heart, it's about the communities we forge - real and imagined - to save our own lives."
    },
    {
      "critic": "Walter Addiego",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "If you have even a passing interest in outsider art, you owe it to yourself to see Marwencol."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2011
      },
      "score": 63,
      "summary": "Hogancamp seems a pleasant, offbeat and intuitive fellow who probably takes all this less seriously than those who \"discovered\" him."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "Reminds me of recent documentary Catfish, in that it captures an incredible story that could never have been foreseen at the beginning of the project; however, unlike Catfish, this documentary would have been very interesting with or without its several surprises. What does it look like for art to be therapy? This story gives an incredibly intriguing answer to that question.",
      "total_reactions": 0,
      "user": "henryslavens"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "Marwencol is a touching story of a man that lost everything in a bar fight. He now creates the world that he never had with action figures and barbie dolls in great detail. It's an interesting story and any filmmaker would pick up on such a unique centerpiece for a film. However sometimes it seems that the film tells us more about what hasn't happened and less about what has. Still a great documentary.",
      "total_reactions": 0,
      "user": "filmtrashreview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "What if art become a form of therapy? This film portrays the strory of this bizarre man using an extraordinariness and miraculousness of art as a therapy to help him able to cope with the expensive lesson he had learnt from the cruelty and heartedness of people who share the same world as himself. It is new, strange and conducts the super unfimiliar life circumstance of this man with such an enormous maniacal expression. A strange yet very beautiful documentary.",
      "total_reactions": 0,
      "user": "joomjim4"
    }
  ]
}