{
  "avg_user_score": 8.4,
  "metascore": 72,
  "mixed_rating_frequency": 38,
  "movie_name": "Match Point",
  "negative_rating_frequency": 51,
  "positive_rating_frequency": 442,
  "pro_critic_reviews": [],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "This is one of my favorite movie ever. It's a very smart plot (normal for Woody), about a ambicious and smart tennis player, who uses his interest in high culture to penetrate the upper class. Chris is completely amoral. He just coldly calculates the probability of success. Woody plays well with the theme of luck (which is common in his movies), including two interesting scenes, one at the begginning, with a tennis ball touching the net  and luck defining in which side of the court it is going to fall, and another one at the end that makes you anticipate, wrongly, the end of the movie. Scarlett is gorgeous. Myers delivered a good performance. The movie oscilates a lot in its plot, as luck is seemingly defining the path the characters take, and the end tends to be not what you expected (unless you know Allen well). It is philosophical, entertaining, full of suspense and sexy. A masterpiece in my opinion. Dostoevsky would be proud, despite the alternative, nietzschean ending.",
      "total_reactions": 3,
      "user": "Zamba"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "A great contemporary cinema adaption for \"Crime and Punishment\" in which crime is justifiable for social ascension and not for the harm an old usurer does to society.",
      "total_reactions": 1,
      "user": "pr3d4tor"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "text": "I just can't believe how awful this film is and yet it reviewed so well by many. I think this is a case of people focusing on Allens excellent back catalogue of former glories and not treating this as a standalone film. The script is so bad, that it made me hate it despite the normally likeable leads.",
      "total_reactions": 2,
      "user": "Rocco123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "Match Point is a deeply bitter and cynical film about privileged, upper class members of society behaving badly and  getting away with their transgressions.  There is no moral to the story and the thesis that Allen is working with is that there is no rhyme or reason for what happens in this thing called life.  It's all based on luck and chance.  It sounds like a complete downer of a film, but Allen makes it smart, entertaining and ultimately riveting.",
      "total_reactions": 0,
      "user": "BKM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "Hmm hard one to mark. Its in the black and white mystery , adulterous genre. Its an Oscar Wilde thriller if you may. Its good and has a nice twist but its the journey that's makes it enjoyable. Plant an old black and white film complete with English fog and place it in modern London and you have this film.",
      "total_reactions": 0,
      "user": "MorriBey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "Match Point has a good balance of character, plot, unexpected surprises, and the substance to the story was handled well. The middle act of the film does start to drag a little but the 3rd act becomes intense and interesting. The actors do a great job with their rolls, I felt as if I knew the characters after the movie.I have thought about this movie a bit over the years, about its horrible protagonist and the events that play out. I find this movie's story and its take on life very interesting. Recommended.",
      "total_reactions": 0,
      "user": "davenbettridge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "I really liked this movie. Woody Allen finally hits the **** tone where Cassandra's Dream missed horribly.",
      "total_reactions": 0,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2011
      },
      "score": 1,
      "text": "Very poor. Pretentious with poor acting, ubiquitous cringe moments, forced philosophical preachings. Characters are shallow, and non developed and provide no explanations for their actions, they just seem to do things to follow allen's plot. Characters are portrayed one way, and then their actions later on in the film don't conform, but forcibly go to where allen's plot wants. Johanson is gorgeous but her lines and the parts that she has to play are rubbish. Poor girl such a great actor yet such a bad movie. This movies is like someone having to make up a story on the spot with no preparation, they drivvle, drivvle drivvle, find out that they they've just spoke for a long time with nothing important or interesting, no plot or character and then threw in something bad in the last 5 seconds at the end to try and make it interesting.",
      "total_reactions": 0,
      "user": "ewkdon223"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "This movie is fitting for those who like some good, sexy -or less sexy... - drama, love-triangle and cheating plus inner turmoil. A man loves two women - first he cannot get, and when she is available, he is married to the other. The ending was surprising. This is no way a thriller, but a good watch. Very human in many ways. Jonathan Rhys-Meyers, in my opinion, did a good job in his role, a lover/husband trying to decide how to live his life (and with whom), and finally making and extreme decision about it.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2014
      },
      "score": 9,
      "text": "With Match Point, Woody Allen is able to prove he has conquer another genre in the world of film: suspense. As always, the film is smart and wholly entertaining. It's about life and luck--Allen has struck gold here. Scarlett Johansson is captivating as Nola Rice.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2016
      },
      "score": 5,
      "text": "I appreciate the philosophical musings based on \"Crime and Punishment\", as well as the thoughts offered on luck, love, lust, and fidelity, but Match Point is simply dull. It occasionally hits the accelerator, but far too often Woody Allen's pacing of the film just fails to deliver anything of interest. Plus, the film is far too subtle. Obviously, I picked up on all the thematic elements and what not, but as it stands, the film's pacing is just off kilter. That said, Jonathan Rhys Meyers is very good here and Scarlett Johansson also does quite well here. However, the problems of the film all come back again to the lack of intrigue and dramatic entertainment. I appreciate slow burns and slower films, but even though this one has a solid pay-off, it just does not save the film and, even worse, the sequence immediately proceeding the ending makes no sense given the tone and approach of the film before this. It just does not fit, even if the very ending does do a good job tying up all the thematic elements. Overall, Match Point hits the net and bounces back onto your side.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "It is fairly bleak, but \"Match Point\" still remains a testament to Woody Allen's simply tremendous ability to effectively engage the audience in a provocative story.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "it's taken me almost 10 years to see this film. i don't know why i waited so long. it's such a great, dark story. to think scarlett johansson was only 19 when it was filmed. don't try to use logic to fill the plot holes. the overarching theme is luck. just keep that in mind and don't go all CSI on the last quarter of the film.",
      "total_reactions": 0,
      "user": "ariel84"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "I was watching this film on HBO last night (it is now July 2014) and I like this film even better than when I originally saw it in a theater. What I particularly noticed is its tightness -- things happen quickly and inevitably. I also admired again the performance of Jonathan Rhys-Myers who with his slight sneer and silent watchfulness rivals Joseph Cotten in Hitchcock's Shadow of a Doubt. Is the business about luck contrived? I am not sure, but I wish Allen would do a sequel. I would guess the JR-M character becomes a ruthless CEO (perhaps the Jeremy Irons character in Margin Call) and as he climbs, has a more willing string of mistresses. And perhaps he finds his father-in-law and he are more alike than we originally think or if not, and his father-in-law is indeed weak and rich by chance, the sky is the limit for JR-M -- until his luck runs out, that is. This is one of Allen's best.",
      "total_reactions": 0,
      "user": "GinaK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "Woody Allen makes very funny movies but this is his darkest and probably one of his best efforts of the 2000s. This movie is smart and it demonstrates luck, bad behavior, bad actions and very bad decisions. Great Performances by Meyers, Johansson, Mortimer, Cox and Goode",
      "total_reactions": 0,
      "user": "heeldavid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2015
      },
      "score": 10,
      "text": "Sometimes you can understand people's negative reaction to a film. In this case I don't quite understand why would anybody hate the film. There must be two reasons I guess. One is antisemitism or personal hatred of Woody Allen and the second is perhaps just not following the point of the film. The last one is forgivable, so if you are in that category I suggest you see the film again and perceive how masterful it is.",
      "total_reactions": 0,
      "user": "Giorgi751"
    }
  ]
}