{
  "mc_avg_user_score": 7.5,
  "mc_metascore": 73,
  "mc_mixed_rating_frequency": 8,
  "mc_movie_name": "Me and Orson Welles",
  "mc_negative_rating_frequency": 0,
  "mc_positive_rating_frequency": 16,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "Yeah yeah, \"magic of the theater\" and all that. Too much \"Me\" and not enough \"Orson Welles\". No offence to Zac Efron (look, I spelled his name right, there's no k in Zac), but.....yeah ok, a little bit of offence to Zac Efron. Not because of his acting, but because I yawned like I had two beers in me.",
      "total_reactions": 1,
      "user": "Bairdo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "The bone-deep understanding that your life is so utterly without meaning. That simply to survive you have to reinvent yourself. Because if people canâ",
      "total_reactions": 1,
      "user": "Deathromp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 6,
      "text": "Who had the larger ego, Orson Welles or Julius Caesar?  I have heard about the legendary Orson Welles ego and the film â",
      "total_reactions": 0,
      "user": "CitizenCharlie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "Once again Linklater proves that he can direct anything. This film is charming and entertaining. It works as a period piece, a biopic of orson welles and a coming of age story as well as a drama. Every aspect and genre in the film works extremely well. This film is made with so much skill it is astounding. Christian Mckay blew me away with his subtle nuances as Orson Welles. The only time the film kind of faltered for me was it's climax which is the play itself.",
      "total_reactions": 0,
      "user": "cabrita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "An enjoyable film packed full of great performances and interesting characters. Unfortunately Zac Efron, who plays the main character, is a very poor actor and he goes a long way in dragging the film down. If they had cast a better actor in his part this film would have been a lot better.",
      "total_reactions": 0,
      "user": "DukeJon"
    }
  ]
}