{
  "mc_avg_user_score": 8.7,
  "mc_metascore": 60,
  "mc_mixed_rating_frequency": 2,
  "mc_movie_name": "Middle Men",
  "mc_negative_rating_frequency": 2,
  "mc_positive_rating_frequency": 45,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Well, its just on of THOSE movies, simply cannot find a bad thing in it. Cast is perfect, acting accordingly superb, story interesting and intriguing, so 10/10 points is pretty clear sign of what i am talking. Great, great movie.",
      "total_reactions": 2,
      "user": "aryanrule"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "original story, memorable characters, some sex scenes and good humor.",
      "total_reactions": 2,
      "user": "vaell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "From the opening sequence, I knew I was in for a \"Goodfellas\"-styled drama with morals built into the plot and characters goin' down in order to learn their lessons. The movie didn't really disappoint in this regard, but I did find the portrayal of the narrator, a \"fixer\" for dubious businesses, somewhat strangely represented. In other words, this guy (played with staged nonchalance by Luke Wilson) was too good to be true, given the circumstances of his predicament. When the lead character in a drama filled with slime balls comes off smelling like a rose, then you know you're not getting the full story. And that was the main problem with this film: it is an ultra-sanitized, glamorizing reenactment of some truly ugly moments in the underworld of mobsters and drug addicts and porn.",
      "total_reactions": 1,
      "user": "serflood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "I was pleasantly surprised by this movie.Luke Wilson plays his part with all the coolness of a James Bond type.And Giovanni Ribisi plays a loser drug addict very very convincingly.This kind of reminds me of Casino wherein a few regular guys can make it to the top only to blow it with nobody to blame but themselves.Its a very entertaining movie from the first minute to the end.I can't believe how poorly it did at the box office,I think to date it hasn't even made $1,000,000 dollars yet and cost  $20,000,00.I'd have to give this one an 8.5.",
      "total_reactions": 1,
      "user": "rallen399"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "I had never heard of this movie, just saw it at Blockbuster and rented it, I was surprised at how much I enjoyed this movie. This movie was engaging from the beginning to the end with good acting and a good story line. The fact that it was based on true events made it that much more interesting. Even though the story revolves around internet porn and its beginnings it is not a raunchy movie with a bunch of nudity (could be good or bad depending on your interests!). The plot was fascinating, seeing how easily it the idea evolved and how quickly dark elements took control. It was a very pleasant surprise, especially  when you are taking a leap of faith at the video store on a movie you have never heard about!",
      "total_reactions": 3,
      "user": "moviefan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "An interesting movie that may or may not educate you about the early internet and porn industry.  A movie that is satisfying and almost motivational as money is the main theme.",
      "total_reactions": 0,
      "user": "PurpleUrp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "This is an AWESOME movie. It has a very good story, - interesting, goes fast enough, never gets boring. Brilliant acting of Giovanni Ribisi, he didn't play this character, he became this character, I really believed it. Also Laura Ramsey, I hope to see more from them in the future. Tiny little 'negative' point: the ending could have been better with a little script editing, I disappoints a little bit, because you can expect it. Anyway, enjoy this piece of art, you won't regret it!â",
      "total_reactions": 0,
      "user": "Dongangstar"
    }
  ]
}