{
  "avg_user_score": 5.2,
  "metascore": 25,
  "mixed_rating_frequency": 3,
  "movie_name": "Moms' Night Out",
  "negative_rating_frequency": 13,
  "positive_rating_frequency": 14,
  "pro_critic_reviews": [
    {
      "critic": "Bill Zwecker",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2014
      },
      "score": 63,
      "summary": "The life lessons about morals and values are soft-pedaled pretty well and packaged in a mostly funny romp as the trio of mothers’ night-on-the-town turns in all sorts of bizarre and wacky ways."
    },
    {
      "critic": "Sheri Linden",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2014
      },
      "score": 50,
      "summary": "Without creating fully fleshed characters or truly involving conflict, the film aims instead to provoke howls of recognition and tears of gratitude by appealing to very basic notions of parent-child love."
    },
    {
      "critic": "Marc Snetiker",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2014
      },
      "score": 42,
      "summary": "It's a shame that this glossy production doesn't seem to realize it's actually promoting an altogether different message: when moms dare to leave the house, everything goes wrong."
    },
    {
      "critic": "Mike D'Angelo",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2014
      },
      "score": 42,
      "summary": "The film never seems hectoring or preachy. Unfortunately, it never seems funny either, coming across like a sanitized remake of some raunchier laughfest."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2014
      },
      "score": 40,
      "summary": "It’s a passable knock-off of less-godly but more inspired secular fare, which may not sound like high praise, but is clearly all the filmmakers were aiming for. They set the bar low enough to clear it."
    },
    {
      "critic": "Christy Lemire",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2014
      },
      "score": 38,
      "summary": "It wants to inspire as well as entertain. It’s \"The Hangover\" aimed at Christian audiences, and if that sounds like an impossible prospect, well, that’s because it is."
    },
    {
      "critic": "Farran Smith Nehme",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2014
      },
      "score": 38,
      "summary": "Consistently stale but not altogether unpleasant."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2014
      },
      "score": 38,
      "summary": "Mom’s Night Out sets itself up for laughs that it rarely delivers."
    },
    {
      "critic": "Steve Davis",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2014
      },
      "score": 30,
      "summary": "The movie aspires to be an inspirational screwball comedy of sorts about the stresses of motherhood, but the situational humor lacks the spontaneity necessary for some crazy fun."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2014
      },
      "score": 30,
      "summary": "A weird mix of tired jokes, topicality, and crippling anxiety."
    },
    {
      "critic": "Gary Goldstein",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2014
      },
      "score": 30,
      "summary": "Moms' Night Out is a hectic mess that does just the opposite of what it clearly set out to do: It makes motherhood seem like one of the most ill-conceived ideas since New Coke."
    },
    {
      "critic": "Kate Erbland",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2014
      },
      "score": 29,
      "summary": "Plainly unfunny."
    },
    {
      "critic": "Kate Taylor",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2014
      },
      "score": 25,
      "summary": "Mainly, you have to wonder why Allyson doesn’t just hire a nanny, find a job and get out of the house. Ah, but this is a Christian movie, and once it stops pelting an audience with comic incident, it begins preaching."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2014
      },
      "score": 25,
      "summary": "Mothers deserve a much better break than the hectic, shrill and dismally unpleasant Moms' Night Out."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2014
      },
      "score": 25,
      "summary": "[A] strained, clunkily orchestrated and dismally retrograde film."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2014
      },
      "score": 20,
      "summary": "Little of it is funny or genuine, and the benefits and beauty of real faith are nowhere in evidence."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2014
      },
      "score": 20,
      "summary": "There’s nothing inherently wrong with faith-based entertainment. The problem comes when, as with any heavily slanted perspective, the faith takes precedence over the entertainment."
    },
    {
      "critic": "Heather Baysa",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2014
      },
      "score": 20,
      "summary": "Outrageously enough, the moral of Moms' Night Out seems to be that moms should never get a night out."
    },
    {
      "critic": "Inkoo Kang",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2014
      },
      "score": 20,
      "summary": "Directed by brothers Andrew and Jon Erwin, this ostensible femme-powerment film is strangely unsympathetic, even demeaning, to its target audience. Rather than pandering to moms, this unfunny, unabashedly anti-feminist comedy consistently points out how wrong or unnecessary or ungrateful they are."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2014
      },
      "score": 20,
      "summary": "There’s nothing wrong with Moms’ Night Out that couldn’t be fixed by a massive rewrite, preferably one that involves a lobotomy for the main character."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "\"When at first you don't succeed...Just sit down and eat cake. Then try again ;)\"",
      "total_reactions": 2,
      "user": "Talley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "Have to confess - maybe I am weird but I enjoyed this movie.  Contary to some of the more \"professional\" critics; I get it.  I've been in the  big girl world; had a business to run and recieved  kudos (& bumps/bruises) that go with that world. BUT there is nothing like the (to borrow a 50's term) pink ghetto.  Where roles are not as clearly defined; right & wrong are a little hazy (not to mention crazy)  some days and you would sell the contents of your entire house for 5 minutes of peace & quiet.  Am I a homeschooling mom - nope - but I know that the situations depicted here can & do happen - ask any cop, medical personnel, or pastors family of which I have experience in all 3 areas. Many times truth is stranger than fiction.  This movie delievers some powerfulful messages -  loved Bones & the very subtle don't judge by apperances. Loved the mom blogger - I've been there & survived & yes -there were many days (&nights;) where that was in question (any sane mom/dad that denies this is definitely high on the weird side). Loved the pastor's wife - she expresses some real fears & a couple of interesting observations. The single mom - good job - never a good idea to get between her & her baby.  Major thanks to all who dealt with this subject in such an intelligent and respectfull way.  Knowing you would be flogged by critics yet trusting the people who are there & have  been there to validate the humor & content of this movie was a wise move.  I am honored to stand along side this movie & say thanks & yes - I get it so moms go & get it & have a great moms nigt out!",
      "total_reactions": 2,
      "user": "sanityoverrated"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "i know why critics hates this because they have expectations on humor that is good and bad. Moms Night is not expected as i saw it from the trailer but the movie is amazing good humor , best moments that can will never be forget i want to watch it again.",
      "total_reactions": 1,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "One of the most funniest movie ever i seen in my life time. fun fun fun here.... laugh laugh laugh your best",
      "total_reactions": 8,
      "user": "helpmovingtocal"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 0,
      "text": "As much fun as masturbating with sandpaper.",
      "total_reactions": 11,
      "user": "Deepfried"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "Got dragged to this by my wife on Mother's Day. Surprisingly enjoyable. It doesn't try to be anything it isn't. Simple and fun. Wish there were more movies like this...",
      "total_reactions": 6,
      "user": "djnestrick"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "Got a chance to review the movie with the directors.... I thought it was going to be another \"faith based\" movie that was subpar as compared to industry leading studios....and that it probably couldn't hold its own with other comedies....I was pleased that it really was Funny....and well acted...and not over preachy.  Really....an important movie about life....especially if you have small children.",
      "total_reactions": 6,
      "user": "DalecManning"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "One of the funniest movies I have seen in a very long time. They didn't rely on bathroom humor, bratty kids or stupid parents for their humor but came up with original, very funny material. Patricia Heaton nails it with her performance of a pastor's wife. Trace Adkins was fantastic as Bones. But, some of my favorite scenes were with Robert Amaya. We loved him in Courageous and in this movie, he had us laughing until we were crying. I attended the movie with 4 of my kids ages 16-24 - two sons and 2 daughters. The boys pretty much were going just to take me for Mother's Day - not that they thought it would be that funny. Throughout the movie, they were laughing just as hard as the girls and I were. I went with fairly low expectations - knowing that sometimes \"Christian\" movies do not have the same level of acting or writing as some mainstream movies. This one far exceeded my expectations. The acting was first class - I can't think of one actor that was a weak link in this film. The writing was fantastic! So nice to see that there are writers who actually have ideas besides using profanity or crudity to cover for their lack of inspiration!",
      "total_reactions": 6,
      "user": "blessedwith12"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2014
      },
      "score": 4,
      "text": "I like the idea of a family friendly comedy, but the only way to describe this movie is \"yikes\". It has a story foundation and then it abandons of all that for some really stupid wild goose chase that takes up the majority of the film.",
      "total_reactions": 4,
      "user": "Trev29"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2014
      },
      "score": 4,
      "text": "I was surprised to learn that this movie has ties to Affirm Films, whose work consists of movies like 2011's \"Courageous.\" That's right it's a christian-based movie aimed at families. While I've enjoyed previous works from them it was because they held true to their beliefs and strongly held them as the basis for their movies. That might have rubbed many the wrong way, but I've always respected them for it.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2014
      },
      "score": 3,
      "text": "The movie felt like a daycare for 5 year olds except it incorporated  a bunch of idiotic adults running around and screaming. When it did calm down for its brief moments, this forced religious undertone took over and the movie became even more ridiculous.",
      "total_reactions": 3,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2016
      },
      "score": 6,
      "text": "The mothers' adventure on the night of Mother's Day.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "Moms' Night out is a movie for the whole family to enjoy. Its hard to find movies these days without the usual profanities. In some reviews about this movie, people suggests that woman are portrayed as weak and some suggests \"stay at home\" Moms are old fashioned. This movie has moral under tones hence some dreadful scores from some reviewers. This movies does a good job at praising the \"Stay at Home\" Moms. I highly recommend it for family movie nights.",
      "total_reactions": 0,
      "user": "PikesNo1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "This was a well planned out comic movie with a strong message. i would definitely watch it again. There were some mild stereotypes in this movie but overall little bias. He killed Mama!",
      "total_reactions": 0,
      "user": "fed104"
    }
  ]
}