{
  "mc_avg_user_score": 7.8,
  "mc_metascore": 64,
  "mc_mixed_rating_frequency": 3,
  "mc_movie_name": "Mother and Child",
  "mc_negative_rating_frequency": 3,
  "mc_positive_rating_frequency": 24,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "La primera pelicula hollywoodense de la productora Cha-Cha-Cha (fundada por Cuaron, Gonzalez Iarritu y del Toro) es un solido woman's film  que, a pesar de un final demasiado convencional, tiene un par de elementos a su favor: la limpia realizacion artesanal de uno de los directores de cabecera de HBO Rodrigo Garcia y un reparto uniformemente competente en el que brilla especialmente Annette Benning en el papel de una seca enfermera cincuentona que no deja que el amor llame a su puerta.",
      "total_reactions": 1,
      "user": "Diezmartinez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "This is a movie with strong women front and center and much softer men definitely on the perimeter. Benning is incredible, and with her acting in \"The kids are all right\" she ought to at least get the best female actor of the season award. She plays a brittle, socially prickly spinster living with her frail ailing mother. We learn early that she gave up her child at 14, and we are to presume that this has brought her to cope by keeping people at a distance, which she does with great success through the personality of a haughty, reactive, woman with her own arcane sense of social propriety.",
      "total_reactions": 1,
      "user": "jeremyp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "Some bonds are so strong that when broken the individuals previously connected can no longer function properly.  Mother and child explore the mother and child bond and the effects it has on a woman desperately needing to be a mom and also a woman and her daughter separated at birth.  The performances are pitch perfect from Bening, Watts and the remainder of the cast.",
      "total_reactions": 1,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2010
      },
      "score": 3,
      "text": "While watching this film, one realizes that Rodrigo Garcia has been making the same movie... during all his career. His themes, style and framing is exactly the same throughout his work, maybe except for TV. It is a shame about this flick, a strong cast that turns awry due to the predictability of every single character an shot in the movie. Such a shame.",
      "total_reactions": 1,
      "user": "raco2046"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "Only saw the second part of this, but each of the leading ladies did a great job and the story and writing was solid. I hope to watch this all the way through one day.",
      "total_reactions": 0,
      "user": "worleyjamers"
    }
  ]
}