{
  "mc_avg_user_score": 7.7,
  "mc_metascore": 78,
  "mc_mixed_rating_frequency": 8,
  "mc_movie_name": "Much Ado About Nothing",
  "mc_negative_rating_frequency": 4,
  "mc_positive_rating_frequency": 46,
  "mc_pro_critic_reviews": [
    {
      "critic": "Sheila O'Malley",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 100,
      "summary": "Would the magic hold? The magic holds. It holds from beginning to end."
    },
    {
      "critic": "Nell Minow",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2013
      },
      "score": 100,
      "summary": "Joss Whedon’s take on Shakespeare’s classic tale is swanky, sexy and sophisticated, as bracing as a dry martini poured from a silver shaker on a summer night."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 100,
      "summary": "From its very first scenes, Mr. Whedon’s film crackles with a busy, slightly wayward energy that recalls the classic romantic sparring of the studio era."
    },
    {
      "critic": null,
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 91,
      "summary": "Its off-the-cuff nature makes for a film that is not flawless – the music is a bit daft, and some of the acting a little too “large” for the intimate setting – but is, from beginning to end, delightful."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2013
      },
      "score": 90,
      "summary": "The movie’s singular acting triumph is Nathan Fillion’s Constable Dogberry, one of Shakespeare’s simpler buffoons made poetic by understatement. Fillion speaks softly, with ­uninflected sincerity, a brilliant departure from the standard gregarious-­hambone Dogberry. It’s his insularity — his imperviousness to the interjections of more observant people — that makes him such a touchingly credible clown."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 88,
      "summary": "Joss Whedon’s Much Ado About Nothing is just about the sloppiest Shakespeare ever put on the screen. It may also be the most exhilarating — a profound trifle that reminds you how close Shakespeare’s comedies verge on darkness before pirouetting back into the light."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2013
      },
      "score": 88,
      "summary": "Finally! A romantic comedy that works. And not just because of Shakespeare."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 88,
      "summary": "The first filmed Shakespeare comedy in decades that’s actually funny."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2013
      },
      "score": 83,
      "summary": "It's a pleasant, engaging version of probably the closest thing to a sitcom the Bard ever penned."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2013
      },
      "score": 83,
      "summary": "Much Ado About Nothing is simply a fun time among Whedon and his friends, and for the most part it's contagious."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 83,
      "summary": "I enjoyed Whedon’s film both as a species of stunt and also as a legitimately entertaining entry in the voluminous Shakespeare adaptation sweepstakes."
    },
    {
      "critic": "A.A. Dowd",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2013
      },
      "score": 83,
      "summary": "So kudos to the cast of Much Ado About Nothing, Joss Whedon’s scrappy, snappy take of one of Shakespeare’s greatest comedies. With little exception, the players assembled here — most of them veterans of the Whedonverse — pull off that difficult balancing act with gusto."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 80,
      "summary": "Although not everyone in the cast is as comfortable with the dialogue as Acker, for whom it seems natural, there is a clear love for the material here in every performance, in every shot. It’s not stuffy or remote. It’s fun."
    },
    {
      "critic": "David Gritten",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 80,
      "summary": "Acker and Denisof spar with each other in the best traditions of screwball comedy; worthy modern equivalents to Tracy and Hepburn. They’re the main source of joy in a film overflowing with treats."
    },
    {
      "critic": "Helen O'Hara",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 80,
      "summary": "It will require no conspiring to make you fall for this one; Whedon and Shakespeare are a perfect match."
    },
    {
      "critic": "Matt Maytum",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 80,
      "summary": "A breezy but heartfelt Shakespear update that should put a smile on the faces of Whedon fans, Bard worshippers  and anyone in the mood for a sharp, sassy romance."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 80,
      "summary": "This Much Ado About Nothing — while perhaps not an adaptation for the ages in every respect — is as bracingly effervescent as picnic champagne."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 80,
      "summary": "An absolute delight, as merry as the day is long."
    },
    {
      "critic": "Chris Packham",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 80,
      "summary": "With its interrogations of gender, feminism, and marriage, Shakespeare's comedy is an apt vehicle for Whedon's own storytelling agenda."
    },
    {
      "critic": " Catherine Shoard",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 80,
      "summary": "But Whedon's key coup is in simply directing a very good version of the play. He's got a keen ear for comedy, a no-nonsense approach to ditching the gags that don't work, a deft hand for slapstick and an eagerness to use it."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 80,
      "summary": "More than most adaptations, this is a film true to Shakespeare's practice of employing all means at hand to keep the crowd entertained."
    },
    {
      "critic": "Steve Davis",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2013
      },
      "score": 78,
      "summary": "Fillion’s performance as the constable Dogberry in this section is the film’s comic highlight. Wounded by an insult, his ass-backward indignation achieves a droll momentum that will have you chuckling. All’s well that ends well, indeed."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "With Much Ado About Nothing, Whedon has crafted an endearing bagatelle, made with equal parts brio and love, ambition and pared-down modesty."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "Whedon has made the Bard accessible and that achievement places him alongside Branagh in the exclusive club of directors who can handle both superheroes and Shakespeare effectively."
    },
    {
      "critic": "Michael Posner",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "It’s a pleasant surprise, therefore, to see what Whedon has done with the Bard’s timeless comedy Much Ado About Nothing."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "Whedon, without skimping on the tale’s tragic undercurrents, has crafted an irresistible blend of mirth and malice."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "The film isn't as fast and funny as it could be, although Nathan Fillion's easily offended constable injects some sorely needed comic relief."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "A winking comedy with dark underpinnings and some of Shakespeare’s most wicked wordplay."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "This tiny friends-and-family production has the vibe of a project done on weekends and after school. That’s no knock. It is vibrant and bubbly and just clever enough to engage people who wouldn’t normally watch a black-and-white micro-budget Shakespeare adaptation without any big movie stars."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 70,
      "summary": "It feels like a blessing to have this production at all and we are fortunate it turned out as well as it did."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 70,
      "summary": "Homemade as it clearly is, and first-drafty as it often feels, Whedon’s Much Ado will reward repeat viewings, for the adroitly paced dialogue, the debauched humor of the extended party scenes and the offbeat visual jokes."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 70,
      "summary": "Even if snorkeling wasn't a major sport in 16th-century Sicily, where the action was originally set, the joyous spirit of the play has been preserved in this modest, homegrown production."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2013
      },
      "score": 63,
      "summary": "Whether on stage or the screen, Much Ado About Nothing is a pleasure that passes like a midsummer night’s dream."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 60,
      "summary": "The movie feels like too much of a lark. To paraphrase the play’s voice of reason, Friar Francis, it would be better if Whedon paused awhile and let his counsel sway us more."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 58,
      "summary": "Call it a Shakespearean catharsis or just call it a lark -- either way, the movie represents Whedon's least essential work, regardless of the material's inherent comedic inspiration."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2013
      },
      "score": 50,
      "summary": "The film is nothing without the physicality of the performers, as Joss Whedon's script handles the transition of Shakespeare's language to modern day indifferently."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "Brilliant!  Rarely have I enjoyed a film this much.  \"Much Ado\" was funny, beautiful and held the audience rapt.  The cast was captivating.  The artistic and directorial choices in tone, setting, photography, staging, and pace were all spot on.  I guess a little less camera shake would have been OK.",
      "total_reactions": 4,
      "user": "MarthaP"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Joss Whedon seems to be a man who does not understand the concept of downtime. Once shooting wrapped on his wildly ambitious The Avengers, the writer-director was contractually obligated to take a week off before diving into the post-production on the sprawling superhero ensemble piece. But instead of kicking back, Whedon gathered together another ensemble—mostly made up of actors from his various television outings—to make a short and sweet movie out of William Shakespeare's play Much Ado About Nothing. Made in just 12 days, the black-and-white film features the original text in a contemporary setting and is infused with the kind of enthusiasm you'd expect from a Whedon pet project. But its spontaneity does have some drawbacks. Devotees of the Whedonverse are surely chomping at the bit for his latest effort, and likely won't be disappointed. It's fun seeing his familiar crew of performers playing with Shakespeare, and imaging yourself in attendance at one of Whedon's private parties, where the famous people you crush on gather to drink and read plays aloud. (Swoon!) There's an earnestness and energy that exudes from the film, and makes it a joy to watch. However, the overall execution is less than spectacular. The cinematography is functional, but not artful. The blocking feels nonsensical, sometimes distractingly so, as characters meander with unclear purpose around the lovely California home (Whedon's own) where all this mischief unfolds. Sometimes, a scene's staging seems like an idea that didn't pan out, but didn't merit a reshoot (a scene set in a clearly shallow pool makes for a particularly jarring moment). Likewise, the art design lacks Whedon's usual sense of flair, with characters cloaked in ill-fitting suits and dull dresses. Attempts at grandeur (close-ups on delicate table settings and maids prepping flowers) suggest an attempt at scope this low-budget feature can't quite pull off. Basically, it feels like a movie Whedon shot in 12 days. Still, Whedon with 12 days is worthwhile watching. This comedy is undeniably charming, in no small part because of its cast. Acker and Denisof exchange their Shakespearean barbs with a bravado and glee that makes them fun to watch, even if their chemistry never quite feels erotic. Fillion and Lenk are well paired in their roles as easily puzzled comic relief, and spark a welcomed levity to the narrative's bleaker moments. For his part, Gregg brings a radiant warmth—and later chilling rage—to the role of Leonato, further proving he should be in just about everything. But it's Kranz who proves the movie's true standout. Claudio is a tricky role, as he is a soldier who turns from eager, lovesick boy to slut-shaming wrathful brute on a dime. But Kranz manages the turn with aplomb. His bright grin makes him adorable in the film's first act, and his steely scorn makes the pivotal wedding scene profoundly heartbreaking. Between this film and Cabin in the Woods it seems Whedon is trying to convince the world that Kranz is a viable and crush-worthy romantic lead. It might be too soon to speak for the world, but he has at least convinced this critic. Much Ado About Nothing is a joyful romp and noble experiment. There are times where its spontaneity leads to clunky compositions or awkward execution, but the shared charisma of its mostly terrific cast and the bubbly barbs of Shakespeare blend to make an intoxicating treat nicely suited to summer. Whedon has a special skill for marrying lightheartedness to dark matter, and so it in that sense Much Ado About Nothing seemed a perfect play for him to tackle. It's just a shame he didn't have a bit more time and/or money behind it to make it something truly stupendous.",
      "total_reactions": 3,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "This early premiere of Joss Whedon's low budget Shakespearian film of Much Ado About Nothing. Mr. Whedon has created a new black and white love story that takes place in Santa Monica, California, and he developed his stylistic movie at his own home with great actors from his TV series and other movies. Based on William Shakespeare's short novel, the story is about Benedick (Alexis Denisof) and the Dons are approaching at Leonato's home during the war and they take their custody of Don John (Sean Maher) and Conrade (Riki Lindhorne). While they approach to Leonato's home, Claudio wants to fell in love with Leonato's daughter, Hero for his permission to marry her. Also, Benedick and Beatrice (Amy Acker) have love chemistry to each other from the past, and they both have good moments like love and passion. The actors are excellent for portraying Shakespearian characters like Clark Gregg as Leonato, Nathan Fillion as Dogberry, and Franz Kranz as Claudio. One actor who did portray as Benedick is Alexis Denisof, who did an excellent job for performing as a likable character with good acting skills and clever dialogue than other actors try so hard to perform their characters in big blockbuster movies. The scenes are so incredible to look at with great black and white editing, everything is so dark, and the lines are so funny. Much Ado About Nothing is a flawless Shakespearian movie that has incredible cast, great love story and great moments. Joss Whedon makes a nice romantic film that doesn't get too much audience to enjoy this low budget movie than other summer blockbuster movies that are coming out, but this one is a perfect film that I recommended to see this movie in a small local theater near you. Two Thumbs Up!",
      "total_reactions": 3,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 1,
      "text": "Short version: awful acting.  No--- unforgivable acting overall.",
      "total_reactions": 3,
      "user": "Mike_M"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2013
      },
      "score": 0,
      "text": "Thank you, Mike_M. After trying to watch this god awful movie I searched desperately to see if others felt the same way. The critics are idiots and have truly disappointed me. What is worse, they made me feel as though I was taking crazy pills. This movie was terrible. Thank you for the very accurate and well written review.",
      "total_reactions": 3,
      "user": "battlestar_nas"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "What an amazing home!  Whedon's Much Ado is fantastic, mostly because of its lead actors  the consistently amazing Amy Acker and the criminally under-cast Alexis Denisof.",
      "total_reactions": 1,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Joss Whedon is best known as writer/director of \"The Avengers,\" \"Buffy the Vampire Slayer\" and \"Firefly,\" so this departure into Shakespeare is atypical. It was shot in 12 days at his own house using his cast member friends (not movie stars). He's given the romantic comedy a more somber tone, shot it in classic B&W; and injected some musical interludes (which he also wrote). The performances are all strong with Nathan Fillion adding in a delightful turn as Dogberry. If you enjoy the Bard, this contemporary restaging is attractive, well-crafted and entertaining.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "Josh Whedon's take on Shakespeare's Much Ado About Nothing retains the original script but updates the setting to the modern day.",
      "total_reactions": 1,
      "user": "drlowdon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "I love how Whedon was able to film this in 12 days with a fabulous cast and crew in his own home. Whedon and Shakespeare are a match made in heaven. Bravo hands down the best Shakespeare movie ever made. Truly witty and tasteful.",
      "total_reactions": 1,
      "user": "BellaWolfe"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2013
      },
      "score": 4,
      "text": "Unless you are a Shakespeare lover this movie is not for you.  For me, combining a Shakesperian theme in today's world (even if it was meant to be a comedy) just didn't work.  Also didn't care that it was in black and white but that's just me.  It didn't provide any authenticity.  I don give it points for the quality of actors in the movie.",
      "total_reactions": 1,
      "user": "gypsy1022"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2013
      },
      "score": 1,
      "text": "A complete waste of time. Not entertaining at all. Black and white film. What is this retro crap??? I would not recommend this movie at all. Do not bother renting it.",
      "total_reactions": 1,
      "user": "rvan"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "joss whedon once again proves he is a good director and he must be good after avengers , clark gregg did well and so does the rest of cast. always good movie",
      "total_reactions": 3,
      "user": "sivaruthvik"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "Truly wonderful film. Whedon takes Shakespeare's often hard to grasp words and spins some sort of magic, largely due to his raft of friends who come along for the ride. After some initial jarring with the juxtaposition of old style language with the modern setting, it settles into a rhythm thanks to the energy of the performers. Nathan Fillion, Alexis Denisof and Fran Kranz impress with both the dramatic and comedic elements of the script, but it's Amy Acker's Beatrice who ties the film together. Acker is simply magical. The party scene, soundtracked with \"Sigh No More\" by Mau (with lyrics by Shakespeare), was one of the most delightful scenes in a 2013 film.",
      "total_reactions": 0,
      "user": "wiggipop"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "Short review: If you like Joss Whedon, you'll like this movie.",
      "total_reactions": 0,
      "user": "Zack2981"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "Saying anything bad about Shakespeare or an adaptation of one of his works is a quick and easy way for people to jerk their knees and call you an uncultured heathen.  Doing one of his works is the fast track to get great reviews because syndicated snob critics really, REALLY don't want to look uncultured.  Joss Whedon's adaptation of \"Much Ado About Nothing\" doesn't do much wrong but it isn't doing much to stand out either.  Most of the acting is decent and the heart of the play is there, so it's funny.  But it doesn't change the fact that it looked cheap to me.  Modern day retellings always come off cheap to me because it looks like a film student's last minute project.  It's like they forgot the movie was due so they just filmed their friends reading the lines, excused the modern day attire by saying it's a \"modern retelling\" and put it in black and white so it looks, \"you know, deep and stuff.\"  This movie looks less like it was done by Joss Whedon and more like it was done by a student who's semester got away from him and decided to make this the Sunday afternoon before the Monday it was due.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "i had to watch this play in school. In spite of the numerous problems thrown in their way, the couples end up happy with each other. A picturesque ending!",
      "total_reactions": 0,
      "user": "FrankBlunat"
    }
  ]
}