{
  "mc_avg_user_score": 8.2,
  "mc_metascore": 76,
  "mc_mixed_rating_frequency": 25,
  "mc_movie_name": "Mud",
  "mc_negative_rating_frequency": 12,
  "mc_positive_rating_frequency": 273,
  "mc_pro_critic_reviews": [
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2013
      },
      "score": 100,
      "summary": "Watching Mud unfold, one suspects that the Arkansas-reared Nichols remembers exactly what it was like to be a boy of the Southern wilds."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 100,
      "summary": "One of the most creatively rich and emotionally rewarding movies to come along this year."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 100,
      "summary": "Jeff Nichols's third feature traffics unerringly in truth, delicious surprise, unadorned beauty and unforced wisdom."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 100,
      "summary": "Mud is steeped in a sense of place, and the people inhabiting it. Southern. Superstitious. Suspenseful. Sublime."
    },
    {
      "critic": "William Goss",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 100,
      "summary": "That Nichols is able to orchestrate this entire journey with steady tension and lyrical imagery is a testament to his storytelling capabilities."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2013
      },
      "score": 90,
      "summary": "Glorious vision of youth and truth, love and loss, your name is Mud."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 89,
      "summary": "With American independent film teeming with so many shaky-cam snarksters, what an electric riposte to the status quo is Nichols, whose films are classically constructed and deadly serious. In his short but potent career, he’s mastered a wide-vistaed eye for the epic and the elemental."
    },
    {
      "critic": "Calvin Wilson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2013
      },
      "score": 88,
      "summary": "A provocative mood piece. Nichols, who had an art-house hit in 2011 with “Take Shelter,” has a gift for creating characters of unusual depth, and for eliciting performances of emotional resonance. With Mud, he seems to be edging closer to the mainstream, but his skills are as sharp as ever."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 88,
      "summary": "Mud runs over two hours, climaxing with a shootout that belongs in a different movie. It’s a rare misstep in an art-house movie that will pull mainstream audiences along as inexorably as the Mississippi River. Go see it."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 88,
      "summary": "This is where a filmmaker’s taste and reflexive sense of balance makes all the difference. Southern culture may be on the skids in Mud, but Nichols’s sensitive portrayal is gratifyingly on the level."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 88,
      "summary": "In the hands of Nichols, Mud emerges as a thing of bruised beauty. There's magic in it."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2013
      },
      "score": 83,
      "summary": "There's something old-fashioned about Mud, but if you allow yourself to settle into its leisurely pace, it will reward you. If he were alive today, Mark Twain would approve."
    },
    {
      "critic": "Dan Jolin",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2013
      },
      "score": 80,
      "summary": "A bold, intelligent, 21st century take on Mark Twain — with added occult tendencies."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 80,
      "summary": "Mr. Nichols’s screenplay is perhaps a little too heavily plotted, especially toward the end, when everything comes together neatly and noisily, but he more than compensates with graceful rhythm, an unfussy eye for natural beauty and a sure sense of character and place."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 80,
      "summary": "The story is intriguing enough to make Mud a good movie. Led by Sheridan and McConaughey, the performances make it something more."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 80,
      "summary": "Mud poses as a mere adolescent adventure tale but explores a rich vein of grown-up concerns, exploring codes of honor, love and family too solid to be shaken by modernizing forces."
    },
    {
      "critic": "Adam Nayman",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2013
      },
      "score": 75,
      "summary": "So yes, Mud is messy, but it’s also rich and earthy in a way that suggests a filmmaker who is deeply immersed in his story, his characters and his surroundings."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 75,
      "summary": "Endearing and believable, the two actors playing Ellis and Neckbone are pitch-perfect."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 75,
      "summary": "The spirits of Huck Finn and Tom Sawyer are alive and well in the Southern-fried coming-of-age tale Mud. It's got all the ingredients."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 75,
      "summary": "You come away from Mud fondly remembering those two boys, especially Ellis, who has taken his first steps toward adulthood and discovers it suits him just fine."
    },
    {
      "critic": "Mike D'Angelo",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2013
      },
      "score": 75,
      "summary": "Mud unfortunately begins to develop a sour aftertaste in the handful of minor subplots."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2013
      },
      "score": 75,
      "summary": "Reese Witherspoon's unglamorous, understated supporting work recalls the kinds of films she made before becoming a movie star. Other recognizable faces include Sam Shepard, Joe Don Baker, Michael Shannon, and Sarah Paulson."
    },
    {
      "critic": "Steve Macfarlane",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2013
      },
      "score": 75,
      "summary": "The film ultimately succeeds thanks to small details, from its deep-fried lingo and the swampy texture of its location photography to its uniformly expert cast."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2013
      },
      "score": 75,
      "summary": "It doesn’t trivialize Mud to label it Tennessee Williams lite — at least in its romantic notions. Nichols gets good performances out of one and all, but lets himself get so caught up in his sense of place that this potboiler hangs around more than a few minutes after that pot has come to a boil."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2013
      },
      "score": 70,
      "summary": "It’s hard to believe Nichols thinks he can get away with all this and harder still to believe he does. It’s the quality of the attention that he brings — his focus — that makes his work so engrossing."
    },
    {
      "critic": null,
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 70,
      "summary": "Jeff Nichols’ much-anticipated follow-up to his breakthrough second feature Take Shelter feels less adventurous and unsettling but remains a well carpentered piece of work marked by some fine performances and resilient thematic fiber."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 63,
      "summary": "The most striking aspect of Mud is the air of myth and tall-tale telling that hovers lightly over the settings and characters."
    },
    {
      "critic": "Guy Lodge",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2013
      },
      "score": 60,
      "summary": "It’s a broader, starrier project than either of Nichols’s previous films, and he handles the transition to the major league with relative confidence."
    },
    {
      "critic": "David Gritten",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2013
      },
      "score": 60,
      "summary": "It’s a lovely, coherent piece of storytelling, with a unique sense of place."
    },
    {
      "critic": "Jane Crowther",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2013
      },
      "score": 60,
      "summary": "More accessible than \"Take Shelter\" but not as powerful, Mud boasts stunning photography, a mesmerising lead and a strong evocation of Americana. McConaughey’s gold run continues…"
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2013
      },
      "score": 60,
      "summary": "Despite the best efforts of a cast that mixes unstudied newbies such as The Tree of Life’s Sheridan with Hollywood prima donnas like Reese Witherspoon (a starlet-slumming-it distraction as Mud's dim-bulb inamorata), there’s an overall clunkiness that Nichols is unable to overcome."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2013
      },
      "score": 60,
      "summary": "It's too bad...that a movie so attuned to natural currents in the end gets caught up in Hollywood's impossible ones."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "Mud is an engaging and good-looking picture with two bright leading performances from Sheridan and Lofland."
    },
    {
      "critic": "Simon Abrams",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "Mud is as unmoving as it is because it doesn’t aspire to be anything other than a competent anti-fairy tale in which the paint-by-number morals are enforced by equally obvious main protagonists."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 40,
      "summary": "Stripped of his former pretty-boy image, the Texas-born actor is snarly and gnarled, and understands what Nichols is aiming for. That’s crucial, as Mud needs something to stick to."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "“Mud” stars Mathew McConaughhey, Reese Witherspoon, Sam Shepard and two young actors, Tye Sheridan (\"Ellis\" in the film) and Jacob Lofland (Ellis's friend) in this story of life and intrigue in Arkansas on the Mississippi. Filled with interest, suspense and a wonderfully written screenplay by Jeff Nichols, who also directed the film, it is more than a  typical “coming of age” movie for it explores the romantic dreams and aspirations of its young heroes and of Ellis' in particular To describe the two as simply Tom Sawyer and/or Huck Finn types in the modern era does the film a great disservice. This movie captures and vividly desribes what life in the 21st Century for young boys living on the banks of the river is like and how they cope. It is no coincidence that the film's director and writer is a native of Arkansas and the Mississippi and, for this reason, the film's characters and actions ring true.For some unknown reason the film is in limited distribution although, n this writer’s opinion, it deserves much broader exposure. Driven by rich dialogue and scenes along the river community, I give this film an 8 and recommend that it be seen by all within distance of the few houses in which it is playing. I",
      "total_reactions": 1,
      "user": "BHBarry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "Mud is an awesome movie. It's portrayal of the Arkansas wild is great, and the performances are spot on. Matthew McConaughey as Mud is worth watching on its own right. This movie just gives you such a great sense of what it is to live on the river, and so the first hour feels like a sensory feast. It's around the second act that the plot begins to strain, but definitely a film worth watching, and a refreshing piece of American cinema.",
      "total_reactions": 1,
      "user": "nickgreene11"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "Mud is a gripping film from start to finish, marking itself as a modern classic, reminiscent of Stand By Me. McConaughhey delivers his best performance yet as Mud, the man camping out on an island that two boys discover when exploring. Tye Sheridan (Ellis) makes his breakout performance as one of the boys. His friend, Neckbone (played by Jacob Lofland), is excellent as well. Mud captures every emotion with pure accuracy, strategically placing seeds for the audience to feed off of. I could tell you more about Mud, but this is a film you need to experience yourself.",
      "total_reactions": 7,
      "user": "OneSamTwoCups"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "Mud is a good film that starts slow, but carefully develops its characters and story. The result a wholly satisfying experience that features some fantastic performances; McConaughey is incredible and the kid Tye Sheridan is also could. Could very well be the Winter's Bone of 2013.",
      "total_reactions": 3,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "Quiet but efficient, \"Mud\" marks a spectacular niche into the subgenre of \"coming-of-age-tales,\" and it includes yet another surprisingly noteworthy performance from Matthew McConaughey.",
      "total_reactions": 4,
      "user": "Compi24"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "It's a white trash family: three brothers, uneducated Southern rednecks all, Arkansas boys who never left town, fatherless boys barely getting by, and still angry. Kid owns nothing but the tent he pitches in the backyard of his older brother, Son, the eldest, the angriest, the only one with shelter, an actual house with a roof, indoor plumbing even. And then there is boy, the middle child, who lives, literally, in a van by the river, the Mississippi, where Huckleberry Finn and Jim, a runaway slave, and likewise, Mud and Tom Blankenship, floated down to freedom in The Adventures of Huckleberry Finn and Mud, respectively. As far back as Shotgun Stories(the filmmaker's 2008 debut), the Mark Twain novel, albeit less explicitly, found a way to impact the narrative, as it pertains to race relations among blacks and whites in this filmic South. Boy, a middle school basketball coach, diagrams plays for his integrated team, schemes, he tells Kid, are based on Nolan Richardson(the first black coach to helm a predominantly white institution in the old South), whose style of ballin he implemented at Arkansas was given the label \"forty minutes of hell\". Huck, the precocious boy Twain equipped with a relatively progressive mind, more progressive than what passed as thinking in the 19th century South for the most part, says to himself, \"All right then, I'll go to hell,\" before he tears up the letter he addressed to Miss Watson, his guardian, concerning Jim's whereabouts, deciding that he won't doggedly conform to his brethren's policy of degenerate thralldom. With his mind made up, in regard to rescuing the slave from human bondage, Huck muses: \"Because as long as I was in, and in for good, I might as well go the whole hog,\" or in other words, an entire razorback, a half-breed pig, whose caricatured likeness serves as the state university's nickname for its sports teams, whom Boy champions, both miscegenation(he once had a black girlfriend, and perhaps, kids) and Arkansas hoops luminaries such as Sidney Moncrief and Corliss Williamson. Forty minutes of hell, according to Richardson, originally referred to his team's conditioning drills, a system of values, racist values that the generically-named boys buck, and likewise, Huck, who rebels against institutionalized racism, in which nature wins over nurture, as he willfully follows Jim into hell. Ellis, conversely, in Mud, was raised by progressive-minded Southerners who seemingly turned their backs on the Confederate flag, since the boy's name, a Yankee name, conjures up Ellis Island. The father, a small business owner, sells fresh fish to a largely black clientele, and when his son shows up late for work, he docks the boy ten dollars. No ensuing protestation comes out of Ellis' mouth about the pecuniary fine, since good service, the boy reckons, is a colorblind matter. Later, in Mud, Ellis and his best friend Neckbone, knock on motel room doors, posing as fishmongers, in order to locate Juniper, but before they reach her, the film poses a question, a dialectical one, as a black man, from his entryway, staring blankly at Ellis and Neckbone, asks the two boys, \"Why the hell would I want to buy fish?\" After all, Huck, despite being Jim's friend, still insists on the slave serving him, telling the runaway Negro to \"pass me along another hunk of fish and some hot cornbread.\" The black man in the room, arguably, is a stand-in for Jim, and he doesn't seem all that impressed that Ellis goes from house to house, handing black customers their bag of fileted fish, according them the same respect as white men. In their heart of hearts, the black man feels, he and his people will always be, in Twain's own parlance, \"n*****s\". Wherefore The Adventures... is considered, by some, a racist novel, Minor Threat, a DC hardcore band, was also leveled with the same charge of intolerance, in due part to the song \"Guilty of Being White\". Creating even more dissonance, Neckbone wears a Fugazi tee. \"You blame me for slavery,\" Ian MacKaye writes, \"a hundred years before I was born,\" and, perhaps, not coincidentally, both novel(1884) and album(1984) are separated by the same hundred years. For sure, judging by the askant manner in which the black man from the motel dismisses the boys' harried pitch for fresh catfish, he thinks they are guilty of being white. This reconstructed Jim no longer seems grateful for the kindness of white people, and moreover, doesn't want to participate in a film where slavery is coopted as a metaphor for unrequited love, as in \"no man is an island.\". Neckbone, in professing his hatred for snakes, wittingly or unwittingly, conveys an antipathy for African-Americans, since the cottonmouths slithering in the pond are black. When Ellis gets bitten, in an intertextual sense, Jim is avenging the prank Huck pulls which leads to his rattlesnake bite. True, Neckbone never \"lynched somebody\", but is he innocent?",
      "total_reactions": 2,
      "user": "Shiira"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "Matthew McConaughey seems to have turned a new leaf and is delivering powerful performances one after another as of late.  Yet it is young Tye Sheridan who steals the show and I have a hunch that he will become one of my favourites, whilst director Nichols is getting there fast.",
      "total_reactions": 2,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "A very well made film, beautifully photographed, well written and with good performances... BUT it lost major points for me toward the end when one of the main characters literally falls into peril (involving snakes) and is rescued by \"Mud\".  This really bugged me because (a) it seemed unnecessary to the plot and to the character development; and (b) it relies on ignorance of snake behavior (and depicts non-venomous snakes!) and a movie cliche' (oh no, he fell into a snake pit!) to create artificial drama.  If it had just lost that one scene, I think I would have given the film a solid 8.  I can accept a certain amount of dramatic license, but that scene insulted the intelligence of most viewers in my opinion and significantly mars an otherwise very good film.",
      "total_reactions": 2,
      "user": "halcb"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "This is a a lovely story, Mr. McConaughhey has shown once again, that he can truly act.  If you like human stories this movie is for you.  One of the better releases in recent times.",
      "total_reactions": 2,
      "user": "BelgianTofu"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "\"Mud,\" the third feature from writer and director Jeff Nichols, is a remarkably accomplished piece of storytelling. From his promising, impressive film début, \"Shotgun Stories,\" (2007) to the fascinating \"Take Shelter,\" (2011) both showcases for Michael Shannon, who also has a key-supporting role in this film. Nichols has taken another step forward with his latest, which draws on Mark Twain's \"Huckleberry Finn\" as a rough model for Ellis's story. The film presents an impressive narrative construction and compelling characters with dynamic performances.",
      "total_reactions": 2,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "Mud has great acting, great writing, a great story, and a powerful message. I can see this movie being up for a couple academy awards. It doesn't have much action, but when it the action happens it hits you hard. Awesome Flick!",
      "total_reactions": 2,
      "user": "Lansdenrs"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "I really dug this film.  The story is interesting, the drama is done just right and it has some incredibly strong performances in it.  And while McConaughey is awesome in it and it's nice to see him takes roles that push him farther and farther away from the romcom genre, the real movie stealer for me was Tye Sheridan as the young boy that meets Mud and finds his problems increase once he came upon the drifter with a shady past.",
      "total_reactions": 2,
      "user": "RevRon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "I get that it doesn't have CG. This movie would have won Academy Awards in another time. I had a strong visceral reaction to this film, which is precisely why I think it is a keeper. The ending didn't quite fit, which is why I gave it a 9. Mud has an undercurrent of emotional drama that few movies have, given that CG rules the day.  I watched it with my middle son, who happens to be 28 and a confirmed syf-y, CG, thriller moviegoer. After the film, he announced that this was the best movie he had seen in a long time. I agree. Take that Avatar.",
      "total_reactions": 2,
      "user": "Jkfiss"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2015
      },
      "score": 2,
      "text": "This movie was boring boring boring and full of overused tropes. I'm so tired of the white male protagonist children \"growing up\" movies (which p.s. they learned nothing) and misogynistic archetypes. And also I can't be the only one sick of Matthew McConaughey playing the mystical mysterious man, even if his abs are amazing. Yes, nice directing, but that does not save this movie from being super boring and panhandling to the same audience of white dudes feeling sentimental about their childhood and women being awful.",
      "total_reactions": 2,
      "user": "MadMaxFuryRoad2"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2014
      },
      "score": 5,
      "text": "Mud is a strange coming of age story, where one boy learns that love isn't forever and that friendship comes in many different forms. Critics and fans on the movie sites I go to have been raving about this film, so I had to check it out and chime in. I agree with those who say that newcomer, Tye Sheridan, gives an amazing performance, but as for the rest of the film, I think it leaves something to be desired. While out exploring, two boys meet a strange man named Mud, stranded on an island. This man is full of stories and needs the boys help to reconnect with his girlfriend and leave the island. For starters, the film is full of inconsistencies. Mud is starving and needs these boys to bring him food, but somehow, he always has a cigarette in his mouth. One or two things could be overlooked, but the inconsistencies fill up this film. While it's a good story, there isn't a lot of substance to it and the film moves at a snails pace, another thing that tends to turn viewers away. The best thing to do would have been to use flashbacks in Mud's stories to fill the time, instead there are a lot of symbolic scenes of people lost in thought, the business of the town, the kids hanging out, it was very methodical, but also very dull. Matthew McConaughey plays Mud and does a decent job, the problem doesn't lie with him. The film is based on this guy, and for a character with such an interesting past, he really is a sad, dull guy. The only real positive I took away from this film was Tye Sheridan, who plays one of the boys. He does a tremendous job as he starts to realize that love isn't everlasting. To see how this character matures from the beginning of the film to the end, is really remarkable, but it's not unique. Off the top of my head, I can think of a dozen similar stories, where the film is much more interesting and the same thing ends up happening. Mud is ambitious and may be the start of a long career for two young actors, but ultimately it's long, slow, and forgettable.",
      "total_reactions": 3,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2014
      },
      "score": 3,
      "text": ". Mud was boring , really boring and I felt it got no where throughout it , McConaughey is great as are the kid actors but it was just boring it got nowhere it was just like watching this hobos life. Defiantly overrated.",
      "total_reactions": 3,
      "user": "zperry-20"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2013
      },
      "score": 5,
      "text": "It has been 13 years since Matthew McConaughey played his bongos nude while high on Cannabis and then went into a string of not so romantic or funny romantic comedies. In the past 2 years he has been making a startling comeback with 3-4 highly acclaimed performances and he adds another one with “Mud”. With Medusa like hair, a chipped tooth, scraggly beard, tattoos and with a tan that is golden on his chiseled body you can see that bongo playing bad boy through the aging face. As the titled not quite so heroic  lead on the run for killing a man and with that man’s father (Joe Don Baker), and bounty hunters tracking him down, Mud turns to his father-like figure Tom (Sam Shepard) and two 14 year old  boys Ellis (Tye Sheridan) along with Neckbone (Jacob Lofland) for help. Tom warns the boys that Mud is nothing but a liar and all of his failures have been due to his love of Juniper (Reese Witherspoon) who he is now looking to hook up with again, run away and start a new life.",
      "total_reactions": 5,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "Mud is a drama mumbo jumbo Starring- the one and only Matthew Mcaunnghey. Wow. You know I expected a good movie and it it is a good movie with lots of dumb issues, some people say- oh! Great Cannes film!!! But seriously its an okay movie nothing more. The film stars Tye Sheridian- I don't know who the actor is but still he puts in the effort of being a good child actor. The story is just like a Coming of age spatty muddy tale mixed up with children and crime. And milk.",
      "total_reactions": 5,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2013
      },
      "score": 3,
      "text": "Because submitted reviews have to be 150 characters long, I have to keep on typing. When all I have to say about the movie is, ZZZZzzzzz, ZZZZzzzzz.",
      "total_reactions": 6,
      "user": "KnowNothing"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2013
      },
      "score": 3,
      "text": "There's nothing particularly bad about this movie, but also nothing entirely amazing. The younger actors were entirely unconvincing and showed almost no emotion throughout the majority of the film. It wasn't bad, but it definitely was not that good.",
      "total_reactions": 9,
      "user": "steventrouble"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2013
      },
      "score": 1,
      "text": "The most over rated movie of the year and quite possibly history. They finally figured out how to make McConaughey shine as an actor  surround him with other horrific actors. He plays a homeless, starving vagrant. At one point, they mention his shirt and I thought, here it comes, he's going to take his damn shirt off (mandatory in all his movies). Of course, they contrive a way and he takes his shirt off and he's all ripped  he can't find food but manages to hit the gym 3 times a day. Absurd",
      "total_reactions": 11,
      "user": "koconnor"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "A wonderfully entertaining story and film.  Kudos to MM for what is clearly his best performance.  The movie is beautifully filmed, and one feels absorbed by the film (it \"helped\" that we arrived late and sat in the 3rd row!).  Tye Sheridan is superb, perfectly portraying a young man, maturing too fast, yet endearingly naive.  Jacob Lofeland also does a wonderful job, juxtaposed vs. Sheridan, more boyish, clearly looking up to, and trusting Sheridan, almost with his life.  Together, the boys made some outrageous decisions, trusting their as yet undeveloped instincts, to provide a lifeline to a disheveled Mud.  The writing and dialogue are are incredibly honest and credible for small town Arkansas.  The story itself is captivating and anyone who \"zzzzzzzzz'd\" their way through this film, was probably overtired.  It's impossible to deign the ending til the very end.  My wife also enjoyed this immensely.  Thanks to Jeff Nichols for an exciting and entertaining evening.",
      "total_reactions": 1,
      "user": "brewster"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "Two Arkansas boys discover a boat in a tree and the fugitive hiding on the island (Matthew McConaughey). As they help him salvage the boat, they become entangled in his plight and learn about love on several levels. Although audiences will expect to see McConaughey get serious as this rough character (chipped tooth, scruffy beard), it's centered around the boys, who are sweet, earnest and sometimes funny. The story is absorbing, even if it falls apart before it's over. This is a solid drama with subdued direction and compelling performances.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "This is the best film of the year so far.  The acting and writing is great, and the movie feels authentic.  I was never bored at the 2 hours and 5 minutes it took to watch it.  It is kind of a modern day Huck Finn story, with two boys helping a fugitive to escape.  The story mainly centers around Ellis, perfectly played by Tye Sheridan, who's world is changing with the impending divorce of his parents and his first crush on an older girl in town.  They live on a river boat and his parents have loose reins on his upbringing, which I appreciated.  He is free to live a very fun childhood with his best friend Neckbone, played excellently by Jacob Lofland.  Matthew McConaughey is also good as the fugitive.  If you like coming of age films like \"Stand By Me\", you will like this one.",
      "total_reactions": 1,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "I don't want to spoil anything that happens in this movie, but I will tell you that it is a fantastic story and a must watch. Matthew McConaughey delivers a fantastic performance, as does the rest of the cast. The best part about this movie is that it all feels realistic. Watching it all unfold can deliver on the edge of your seat moments, but the real prize comes from the little moments that help keep everything in place. These are the moments that the true potential of the actors comes forth for you to marvel at. Just the little things like the expression on a face go a long way to create the sense of realism in this movie of love and loss. Make no mistake, \"Mud\" is a fantastic movie and a must see.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "From all the fine reviews, I expected this movie would really \"grab\" me, but it did not. It is still a very good film, but it was slow in the middle with a number of plot machinations, which could have been avoided. It was not quite clear to me why the one boy (Ellis\"), went to such extremes (like stealing) for Mud. I found myself looking at my watch periodically, hoping the film would get to the \"grand finale\" soon. When it finally did, it was very intense and well done. The young actors who played the boys did not seem like the best who could have been chosen for these roles. Matthew McConaughey (\"Mud), however, was just right for his role (a sort of modern day Paul Newman).",
      "total_reactions": 1,
      "user": "whitewind"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "Matthew McConaghay's previous foray into the lives of people in southern USA was the distressing and pointless Killer Joe. Mud takes a different track by presenting the characters lives as their choice and where they want to be. When Ellis (Tye Sheridan) and Neckbone (Jacob Lofland) find a boat in the middle of a small island they discover Mud (McConaghay), a man waiting for his girlfriend Juniper (Reese Witherspoon) who has promised to meet him. While structured like a pretty conventional revenge story, Mud is really a tale about sons and fathers and the women who control them. Directed by Jeff Nichols, Mud is a film about the beauty of a simple life and the kindness and humanity that comes with this kind of community. Mud is really the tale of Ellis, a smooth talking yet naive young boy who relates to Mud because of their complex relationships with their fathers. The film is filled with sharply written and well acted characters with McConaghay and Witherspoon being a terrific tragic pairing as the true reason for Mud's banishment becomes apparent, the two get better and better. Sheridan is a brilliant new find and brings out all of Ellis' growing pains wonderfully. The film rides on the relationship between Ellis and Mud and the two mesh well together as they form an almost brotherly bond. Ultimately its a beautifully performed and filmed picture that displays the beauty of living on the river and of living in a world of your own where the odd is strangely normal and people like Mud fortunately exist.",
      "total_reactions": 1,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "There's a gritty and realistic form of wisdom to take away from 'Mud', full of surprises, subtle brilliance and some engrossing performances. Mud feels art house, but it also hints towards mainstream elements, either way it throws some interesting characters into one big pot, each with their own problems and difficulties in life, age not being a factor. Although the title refers to the character Matthew McConaughey portrays, there's also two young boys, Ellis (Tye Sheridan) and Neckbone (Jacob Lofland) are two young boys who have a knack for going out in little adventures, one which brings them to a secluded island in the waters of Arkansas, where they live. On said island, they try to claim ownership of a stranded boat high in trees, but they soon realise that they aren't the only ones who know about the boat, Mud comes into their life with his unkempt hair, heavy southern accent and aspirations of meeting his one true love Juniper (Reese Witherspoon), but when love is involved, it isn't usually savoury or happy trials ahead. Ellis in particular is young boy with all the problems in front of him, parents possibly getting divorced, learning about love and even heartbreak for the first time. The story of Ellis and Mud are mirrored in a deliberate and intriguing tale, they share similar experiences and the film seems to be showing what Mud's life was like as a younger person, perhaps showing the mistakes he made and how to steer Ellis away from making the same ones. This is the sort of film where many will judge the character of Mud, to many he will still be a murderer on the run, no matter his excuses, but to others he will be the man looking out for his girl, even if she doesn't show the same gratitude. The height of brilliance in the storytelling from writer and director Jeff Nichols strong and inspirational throughout the film, he paints a sort of prophet in Mud who isn't necessarily delusional, but more like someone who has hit rock bottom already and doesn't really know where else to go but up.",
      "total_reactions": 1,
      "user": "StevenF"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "I have a feeling we're going to see a lot more of newcomer Tye Sheridan, but it is our titular role from McConaughey that will set this film apart. I sincerely hope Jeff Nichols keeps on delivering emotional powerhouse films.",
      "total_reactions": 1,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "Mud is a well directed and well acted film with its two star young roles playing the key to its success. It's a quiet but efficient coming of age tale that may not hit you hard with emotion but gives you a story and characters to care about.",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "Mud marks the first great movie of 2013. The acting is fantastic and especially hats off to the young boys whose performances are so spot on. Beautiful imagery of a part of the south rarely showcased in films. A great story all around.",
      "total_reactions": 1,
      "user": "Trev29"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "For full review: http://youngthespian42films.blogspot.com/2013/06/mud.html",
      "total_reactions": 1,
      "user": "youngthespian42"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "When I was a kid movies about super heroes or vampires or giant robots were kid stuff. Grown ups watched dramas where what got you interested and kept you interested were just good stories about interesting characters. These days there are very few of those available on the screen on any given day. Mud is one of them. Good but it could have been better if it had gone a little more Flannery O'Connor and a little less Disney at the end. The acting is superb. I'm referring to the screenplay. You just know at some point the story was stronger and then someone in a suit forced them to water it down. For those expecting lots of violence, but for one scene, you're not going to find that here.",
      "total_reactions": 2,
      "user": "NikolayG"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Saw the 99% review rating on rotten tomatoes and thought this had to be a great great movie.  Had high hopes going in and it was a very good movie, just not as good as I thought it would be.  This is def one I would recommend seeing in the theater, just don't go in thinking it will set the world on fire.  Very good movie though.",
      "total_reactions": 1,
      "user": "DC4Cards"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "Great acting and a moving but calm storyline gives this movie a pleasant feel. There is really nothing wrong with this movie. it starts with great introductions to all the characters and gives you just enough information to be curious. There were a couple of times while watching this  that I had to just take myself out of it to just think, \"What a quality made movie\". What really bumps the score up for me though it the screenwriters resistance to jump into typical Hollywood cliches. Certainly better than many wide release films out there and this one deserves a wide release soon.",
      "total_reactions": 1,
      "user": "analogkid280"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "\"Mud\" is an outstanding American film that is destined to be a classic. It features a terrific performances by all involved. It's definitely a film that will stick with you long afterwards, and you can't really ask for more than that from a movie these days.",
      "total_reactions": 1,
      "user": "RandallAudrain"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "It was a bit slow, but it`s a movie with characters you learn to care about.I thought it was a good movie overall. I did not expect it to be about love as much as it was, but it was interesting",
      "total_reactions": 1,
      "user": "oblique15"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "Wonderfully written and acted, at its heart this is a coming of age story about a young boy's disillusionment with life and love. Tye Sheridan is a natural as the boy and Matthew McConaughey must now rank as one of the top 5 American actors in movies today. His performances of late (Killer Joe; Magic Mike; Dallas Buyers Club) Just keep stretching him and he continues to get better and better. The film is so lovingly photographed that you begin to feel the environment. Directed with restraint by original author Jeff Nicholls it is spot on tonally in eliciting pathos. Only some mis judged music at the end rudely spoils the effect of this other wise quite brilliant little gem.",
      "total_reactions": 1,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Mud is a well directed, well acted film that helps to show that love isn't easy.  The kids are the standout performances here along with Matthew McConaughey's Mud.",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "Mud is one of the most unexpected surprises of 2013.It is a great coming-of-age film which manages to never feel sappy or overly-sentimental. It features an incredible performance by Mathew McConaughey as well as the child actors plus great cinematography and an engaging script  that entertains you from start to finish. McConaughey has made a huge turn around with his career, and i applaud him for that. Mud is a prime example of the man's acting skill, and I can't wait to see what other projects he will take as his career continues. I usually don't praise child actors, but the kids in this movie were great.With a movie like this it's easy to become cliche and derivative, but Mud never becomes that. It's a great film, one of my 5 favorite of 2013 and some people are even hailing it as a modern classic. 2013 has been a great year for films, and Mud is a perfect example of why it has been such a good year. Very much worth a watch.",
      "total_reactions": 1,
      "user": "NBAluke579"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "One of those heartwarming stories with 2 young boys looking for a role model and the meaning of love. This delivers FAR past what I expected and has become one of my favorite movies of the whole year. McConaughey and the other boys have incredible performances that pull you right into the story. Could possible become a new classic that is hopelessly overlooked at awards season",
      "total_reactions": 1,
      "user": "JCouch777"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "Mud covers how to become a man. What is the role of a man in his family, to his son, to his wife and to the woman he loves? What will a man sacrifice for love? Is a man's word his bond or burden? Tragically, most men will not see this film and appreciate's this film's velvety goodness. Nichols is a gentle taskmaster, tempering his cold lashes of truth with sweet southern charm. McConaughey has never been more charming in his devotion and desperation. There is a soul behind those baby blue eyes. The real star belongs to Sheridan, who's tour de force performance, shows how boys become men. A young star is born. This film ultimately highlights how boys must lose themselves to change, to embrace change and uncertainty with strength, faith, loyalty and family. Innocence is always a casualty, but doesn't make it beautiful corpse?",
      "total_reactions": 1,
      "user": "dongua"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "‘Mud’ was a satisfying film about two fourteen year old boys who help a fugitive evade bounty hunters and reunite with his true love. While the plot stood out, the movie worked more as a rich character study about one of the boys, Ellis, and how his recent predicaments and fractured home teach him a series of valuable lessons that he can take with him for the rest of his life. Whether it be his marginalized father, divorce ready mother, or the well meaning fugitive, Mud; everybody has an input in his development. Matthew McConaughey gives an outstanding performance as the titular character, called Mud, who acts as a mentor for the young boys, while trying to battle his own demons in his life. McConaughey’s portrayal of a hard edged killer with a rather naïve outlook on love, made the character both engrossing and sympathetic. Also of note was Tye Sheridan who convincingly performs the mental growth of our young character, Ellis; as the actions of all the adults in his life mold him into the man he will one day become. This was a rock solid movie that tackles themes of love, embracing change and ultimately accepting the realities of life, even the harsh ones. It was a touching film without being sappy in any way, shape or form.",
      "total_reactions": 1,
      "user": "Prodigy2013"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Mud is an enjoyable modern \"coming of age\" American drama film which takes place in the deep South.  The two young new actors Tye Sheridan & Jacob Lofland, along with Matthew McConaughey provided the audience with a superb performance!  Any fan of the 1986 movie, \"Stand by Me,\" should enjoy this movie.",
      "total_reactions": 1,
      "user": "BeePositive"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "I'll be honest I was never really a fan of Matthew McConaughey most of his movies are rather just unwatchable to me save for a few like A Time to Kill, We Are Marshall and Dazed and Confused. Though it seems that with all the highly rated movies that he has either stared in or just acted in this year im really impressed with him and his acting skills. Now I can't wait to see his performance in Christopher Nolan's Interstellar that is coming out next year. I have actally owned this movie for months now and just never really got around to watching it i know Jeff Nichols is a great director i really liked Take Shelter i should've' got around to watching this ALONG TIME AGO.",
      "total_reactions": 1,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "Understated and beautiful, this film brings you gently into the character's world, and then grips you. The writer/director Jeff Nichols gave the cast plenty to work with, and they didn't let him down. Compelling and honest throughout, this is my favourite film of the year so far.",
      "total_reactions": 1,
      "user": "atrichornis"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2014
      },
      "score": 9,
      "text": "Mud is one of the best movies of late. Many stars are here, and they are anything but wasted. It starts off a little slow, but once Mud gets going, it's thrillingly alive. Even after it's ending, I wanted more. McConaughey's performance in this well-executed drama is one of the best of his career. However, it's the kid, Tye Sheridan, who steals the show here. Even for a teenage actor, Sheridan shows depth to the character, and won't be a \"one-hit wonder\". This kid has real potential, and I would love to see him in more movies.",
      "total_reactions": 1,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "One of the best Southern American drama ever seen in recent memory and makes me love that genre. \"Mud\" is sweet and heartwarming drama film about trust, love, loss and woman . It's just like an enchanted-fairytale from Arkansas Texas, easily like Mark Twain's Tom Sawyer and Huck Finn",
      "total_reactions": 1,
      "user": "ugisupriatna"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "Jimmy Spoiler-free reviews 2013 things:",
      "total_reactions": 1,
      "user": "iswantingcake"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "Mud was my favorite movie last year. A lovely fable about the friendship between a drifter on the run from the police and two teenage boys, growing up in dysfunctional families, on the Arkansas River. It brought to mind Carson McCullers as much as Mark Twain. McConaughey as a man who had been a feral child and had never really become an adult, gave a beautifully modulated performance, making a touching portrait of a simple man easily the equal of his Oscar-winning work in Dallas Buyers Club. Jeff Nichols' film is even more emotionally involving than his stunning \"Take Shelter\", a lovely portrait of a simple society being torn apart by \"progress\". Superb work also by Tye Sheridan and Sam Shepard.",
      "total_reactions": 1,
      "user": "Eilidh2"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "I was captivated from the very beginning to the credits. I, for one, would have entitled it something else, since the lead actor here was not Mcconaughey, but Tye Sheridan and Jacob Lofland. Considering how young they were, their performance was nothing but a truly remarkable one, hats off to them.",
      "total_reactions": 1,
      "user": "soma95"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "\"Mud\" 10 Scale Rating: 8.0 (Great) ...",
      "total_reactions": 1,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "Its a different story , but a beautiful one full of suspense .",
      "total_reactions": 1,
      "user": "root_"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2015
      },
      "score": 10,
      "text": "Mud is by far one of the most original story I have ever seen. Matthew McConaughey was amazing in this film and Reese Witherspoon was brilliant. The two kids were also amazing and the movie just was pretty good. The movie does start to lose steam in the middle but catches up to the fun and hype at the very end. Overall, I am satisfied with this one and I think is one of the better movies I have seen this year.",
      "total_reactions": 1,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "The type of film that's miraculously heartwarming, while also mournful and filled with sorrow.",
      "total_reactions": 1,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "The central image in “Mud,” Jeff Nichols’s deft and absorbing third feature, is of a boat in a tree. It’s the kind of phenomenon — a caprice of nature that is absurd but also wondrous — designed to enchant adventurous children like Ellis (Tye Sheridan) and Neckbone (Jacob Lofland), two Arkansas boys who discover the boat on an overgrown island in the Mississippi River. They also discover the fellow who claims to own, or at least inhabit, the vessel, a leathery loner whose name is Mud.",
      "total_reactions": 1,
      "user": "MovieMasterEddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "Charming, sweet, touching, heartfelt, and tragic, Mud is a successful film for many reasons, one of which is the acting. It is hard to think of an actor more on top of his game than Matthew McConaughey and Mud is no exception. His charisma and easy going demeanor really pull you in and, while he is not directly the protagonist (even though he plays the title character), you find yourself rooting for him and hoping things work out for him. On top of McConaughey, both Tye Sheridan and Jack Lofland did fantastic jobs. For actors of their age, they packed considerable emotion and passion into their roles and really impressed me. Also, the supporting cast, headed by Sam Shepard was also phenomenal and really helped. While Fargo is a superior film, a lot of Mud reminded me of Fargo. While it was a totally different film, the way the film totally embodies the region it depicts and sort of oozes with Southern charm is very similar to the way Fargo really represents Minnesota. Both are also beautifully filmed. Fargo's imagery really helped to define it, especially with the blue/white colorization, while Mud's visuals have the same effect, but with golden light on it as if it was shot in \"the magic hour\" a la Terrence Malick's Days of Heaven.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "Though my opinion might be slightly biased as director Jeff Nichols is from my hometown of Little Rock, Arkansas and is certainly the most prominent filmmaker to come out of here in quite some time it is also nice to see the south receive authentic representation in a film that receives wide, and mostly positive recognition. This isn't Nichols first foray into depicting the south in all its bare normality's and simplicities though as he has ventured here twice before in 2007's deadly family feud drama Shotgun Stories and 2011's Take Shelter that perfectly encapsulated the inner demons and slow unraveling of the human psyche. In his latest, Mud, Nichols has kept his location the same as he is able to so naturally create a sense of place and that is key here as our two young protagonists live on and off of the river that guides them to an island where they meet the titular character. The atmosphere and the way in which Nichols crafts his story lend an almost mythical quality to the tone. It is as if this could just have easily been a southern fable that parents told their children at night so as to keep them from wandering where they aren't supposed to go. Still, even with these vibes of a folk legend the film is able to say and do so much more than simply teach a moral lesson. I expected the slow pace, the southern setting, and the bigger implications the story might make other than what is on the surface, but what continues to surprise is the renaissance of a period that Matthew McConaughey is having in his career at the moment. All of the performances here are strong and Nichols has rounded up a solid cast, especially in his two young stars, but it is McConaughey's turn as the title character that will have you thinking about the film long after the credits roll and what he stood for, what he wanted from life, and most inconspicuously, who he really was.",
      "total_reactions": 0,
      "user": "VandyPrice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2017
      },
      "score": 8,
      "text": "Captivating, Endearing, Believable. Great acting, and storytelling. Moments of powerful emotion in this piece of drama. Simple yet remarkable. Multiple different angles can elevate a simple story; Love and Friendship. Maybe a modern classic.",
      "total_reactions": 0,
      "user": "Paarthurnax16"
    }
  ]
}