{
  "avg_user_score": 8.1,
  "metascore": 82,
  "mixed_rating_frequency": 7,
  "movie_name": "Memories of Murder",
  "negative_rating_frequency": 5,
  "positive_rating_frequency": 65,
  "pro_critic_reviews": [],
  "user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "If there was a film I was utterly disappointed in that I thought would be wonderful it would be Zodiac which took the intriguingly dark story of the Zodiac killings and brought a whole lot of suspense and mystery and built it up to a crescendo only to leave the viewer wondering what the point was with an ending so utterly muddled it spoilt the entire film. My opinion of Memories of Murder follows the same logic but I look back on it more favourably than Zodiac thanks to some artistic flair by director Bong Joon-ho and some entertaining dark comedy. The story is about a two inept police officers who are trying to catch a serial killer who is raping and murdering girls in the district. They are joined by an intelligent (in comparison to the other two he is Einstein) detective from Seoul brought in to apprehend the killer. The story is based on real events but it does bring an interesting theatricality to the events with the comedy lightening the dire situation. However it doesnâ",
      "total_reactions": 1,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "Memories of Murder is far superior to most murder-mystery films. Writer/director Bong Joon-ho's mastery of the macabre, and of writing disturbed characters makes the film a joy to behold. The cast are superb, and in fine neo-noir tradition (a tradition effectively started by Chinatown), the investigators haven't got a clue what is really going on. This idea is taken even further than in that Polanski classic, where Jack Nicholson's P.I. Jake Gittes was smart and street-wise, but never quite grasped the dire nature of the situation until it was far too late.  In Memories of Murder, the detectives in charge of the murder investigation are essentially three different kinds of idiot, and all their investigative techniques are deeply flawed. Detective Park (Song Kang-ho) is a firm believer in following your gut, and appears to have progressed through his career in the police force through sheer blind luck rather than any conceivable skill. Detective Seo (Kim Sang-kyung) is a city cop, and on the surface appears to be the most competent of the group, but is completely out of his depth working in the countryside, and unable to recognise that his usual methods won't serve him as well in his new surroundings. Finally Detective Cho (Kim Roe-ha) is the classic dumb brute, using his army-booted feet to find the answers his mind is too feeble to root out. All of the cast are good, but of particular note are Song, who manages to play a fairly unlikeable character, but at the same time keeps viewers on his side because of his incompetent, clownish nature, and Kim Sang-kyung, who provides the story its emotional core. Loosely based on the Korean stage play Come See Me which re-tells the story of the Hwaseong murders just as the film does, Memories of Murder retains the feel of a play, with numerous scenes of the group of inept detectives simply sitting, and working out what to do next. Bong has ample opportunity to flex his filmmaking muscles in other scenes, with expansive and striking crane shots of the ominous rice fields where several of the murders take place, and classic horror movie P.O.V. shots from the killer's perspective (particularly shudder-inducing and tense is a scene later on in the film where we see the killer torn between two potential victims from his own perspective). Only in South Korean cinema do you see such brilliantly disjointed ideas on screen - such a dark film involving a serial killer shouldn't work with the addition of comedy, but somehow it does. As he has proved in all of his films, Bong is a real master of film deconstruction, and of making seemingly contradictory ideas work together, most commonly by adding his own unique brand of black comedy to normally serious situations (I hardly think a smile would be raised in a police torture scene directed by any other filmmaker in the world, with the possible exception of Quentin Tarantino). So Memories of Murder is a far cry from a conventional murder-mystery. It's not just its quirkiness that makes it stand out, though - it's well-written, performed and filmed. The story captivates you from the start, and it maintains momentum throughout. You never find out any more than the detectives in the film do, so you go through exactly the same experiences as them - you feel their frustration at their lack of progress and numerous investigative dead-ends, and their pain and despair at their inability to catch the elusive monster they are hunting. It's a very effective technique to keep the viewer compelled by the characters in a film. Bong Joon-ho also makes some explicit comments about the state of the Korean government and society in the 1980s, and in doing so, makes a more subliminal comment about modern Korea. He's easily among the most talented filmmakers working today, both technically and artistically, and isn't afraid to just let audiences loose in the film worlds he creates, leaving them to have their own unique experiences, and make their own judgements. Memories of Murder is dark, intelligent and beautifully crafted filmmaking at its finest, and I consider it one of the best films of the past decade.",
      "total_reactions": 0,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "I've seen worse and much, much better. This film does not know what it wants to be  a comedy or a thriller. Many films have accomplished combining those two elements to success, but not this one. Though there are some very well done scenes and, at times, an appropriate dark mood attached to the film, it is quite uneven. The acting pretty bad, also.",
      "total_reactions": 0,
      "user": "Film13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "A total knockout film. A piece of art which has everything one goes to cinema for. From funny to hilarious and then dramatic, emotional, sad and finally shocked. It's a movie without any ending and the one that attaches a hook to you brain and won't let it go. From the publicity posters to the editing, writing and acting this movie is a thoughtful work.",
      "total_reactions": 0,
      "user": "Xan_Ryil"
    }
  ]
}