{
  "mc_avg_user_score": 5.2,
  "mc_metascore": 52,
  "mc_mixed_rating_frequency": 17,
  "mc_movie_name": "Nanny McPhee Returns",
  "mc_negative_rating_frequency": 8,
  "mc_positive_rating_frequency": 12,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "Funny, charming, visually well done, and well performed from Emma Thompson. This is a definite improvement on the original because it is entertaining. I five this film a 93% of a good movie.",
      "total_reactions": 6,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2010
      },
      "score": 5,
      "text": "Several decent moments, but in many aspects this is a average film at best, with a uninspired and badly plotted story, and often feels like a Frankenstein's monster of bits and bobs that don't fit well together. Sub par performances, a dull plot and a poorly thought out film in general. Deeply average.",
      "total_reactions": 1,
      "user": "Susano"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "Cut the Green children some slack; their father is away at war. It's hard being left behind, the not knowing, moment to moment, if you still have two parents. Life during wartime, life on a pig farmer's wages, that's more than enough stress for Norman(Asa Butterfield) and Megsie(Lil Woods), the muddy children of a soldier who worry if their evergreen mother(the beautiful Maggie Gylenhaal) can keep the farm from going under. While machinations loom, the agenda of a degenerate uncle(Rhys Ifans) with gambling debts to pay off, the Green family takes in borders, the Gray children, Cyril(Eros Vlahos) and Celia(Rosie Taylor Rilson), rich cousins from the city who don't like their new digs, and don't like them. \"Nanny McPhee Returns\" deals a lot with the dynamics between the bourgeois and the proletariat, and how even a woman of modest means end up on the wrong side of the class war(i.e. Ms. Kilman, the homely tutor who fawns over Elizabeth in Virginia Woolf's \"Miss Dalloway\"). Matilda, Nanny McPhee's real name(the two films are adapted from Christianna Brand's \"Nurse Matilda\" books), was also the name of a boxing kangaroo(Daniel Mann's \"Matilda\", starring Elliott Gould), which is so befitting since the nanny runs a kangaroo court. When a brouhaha erupts in the children's quarters, not only are Cyril and Celia punished, but Norman and Megsie, as well, even though their misbehavior is only natural, a result of their houseguests' ingratitude who put on airs from the very moment they arrive. Nanny McPhee(Emma Thompson) is magic; she casts a spell on her charges by striking her walking stick on the ground as a means of discipline, when what she really ought to do is reprimand the pint-sized urbanites for being such ungrateful little snots. But no, the nanny arbitrates arbitrarily, punishing both the poor and rich alike, without ever considering the factors of the situation. Under the thrall of McPhee's invocation, Norman turns into a vandal, and watches helplessly as the nanny nearly turns his father's warfront dispatches into ash. As it turns out, the rich have their own issues to deal with, and in the Gray children's case, they have a stereotypically British military father(stiff upper lip and the whole nine yards) who seems, literally, cold-blooded, when the moviegoer sees him handle Cyril's request. (Ralph Fiennes would be right at home in Alan Parker's \"Pink Floyd: The Wall\".) Now the moviegoer sympathizes with the boy and girl, just like the nanny, who helps Mrs. Green because she's not one of the common people, after all. With each good deed, the nanny grows more and more beautiful, until she looks, well, just like Emma Thompson, a lady.",
      "total_reactions": 0,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "If you like British cliches then you'll in for a real treat with this latest installment of the ugly Nanny McPhee. If you're not into Britiish cliches about a nanny who could put up with snobby, middle class children then your be best skipping this one by a long shot.",
      "total_reactions": 0,
      "user": "Joshua_Jamaar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2010
      },
      "score": 6,
      "text": "not our favorite family movie, but Emma Thompson's charm as the title character was good and the acting was decent.",
      "total_reactions": 0,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "This was in my opinion better than the first movie, it's funny and the characters are enjoyable, my only complaint is that it has a crappy opening which makes you think this movie is going to suck, but after that it turns out to be one of the best movies of 2010.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "It's entertaining enough. That's pretty much all I have to say about this movie.",
      "total_reactions": 0,
      "user": "MichaelD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "This movie is just another terrible movie filled with stupid misbehaved British kids. This one is just as bad as the first. Nannys suck. Never see this movie ever.",
      "total_reactions": 0,
      "user": "kylerawks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2016
      },
      "score": 5,
      "text": "Nanny McPhee and the Big Bang, they released it as Nanny McPhee Returns in the US and Canada, prepares to enter glory fun, but overloads it so the fun can be this annoying and boring.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    }
  ]
}