{
  "mc_avg_user_score": 8.0,
  "mc_metascore": 69,
  "mc_mixed_rating_frequency": 20,
  "mc_movie_name": "Never Let Me Go",
  "mc_negative_rating_frequency": 15,
  "mc_positive_rating_frequency": 178,
  "mc_pro_critic_reviews": [
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2010
      },
      "score": 88,
      "summary": "A beautifully mopey adaptation of Kazuo Ishiguro's much-praised novel."
    },
    {
      "critic": "Dan Jolin",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2011
      },
      "score": 80,
      "summary": "A beautifully realised adaptation of a profoundly affecting novel. Intelligent sci-fi provides the backdrop, while in the foreground is a trio of truly impressive performances from Mulligan, Knightley and Garfield."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "A simple love story. Still films like Atonement and this one bring new elements, twists and turns to the table. Making for a more enjoyable experience as we continue to think about the human condition. There is no need for a screenplay on this one, the director of this film took it page by page through the story. Refreshing and new, this film will please all fans of the award winning novel.",
      "total_reactions": 2,
      "user": "filmtrashreview"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "Creating a haunting yet provocative science fiction piece of art, director Mark Romenek creates a film that will consume its audience with heartbreak and despair. Never Let Me Go is best approached with little information of the sequential plot in Ishiguro's novel. In trying to simplify the premise, the film follows the life of three students deriving from Hailshaim school. The highlight of the film is the performance by Carey Mulligan. She creates so much pathos in her character, it is surreal how real her emotions are. Mulligan executes this film with so much poise; Even her subtle facial expressions create goosebumps. This film is a masterpiece. The cinematography in the film is memorizing; The natural shots and the exposure of the characters reactions add to the chilling manner of the film overall. Moreover, the emotions that are enabled by the casts performances are simply haunting and heart-crushing. I have never seen so many people cry in one movie theater, it is really a defining film in combining drama with science fiction. Technique-wise, Romeneks film is the pinnacle of perfection; But many of its small flaws keep it from being an overall unblemished film. The films pace is much too slow and it some times experiences a directionless path, where it seems that the film is heading towards nowhere. At times there was a lack of forwards which negatively influences the films effectiveness. In addition, while the film does create some great heartbreak, there is somewhat a distance between the characters and the audience. While the cast is not at fault, the plot and given details make the characters only somewhat relatable, it seems as if they derive too much from an alternate world to be one of our time. But in the end, the film is an emotion-provoking film that will strike the heart of its audience in a way that is devastating yet memorable. It does not quite reach perfection, but the beauty, heart, and thought of the film covers its small blemishes.",
      "total_reactions": 10,
      "user": "RyanGee"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2010
      },
      "score": 2,
      "text": "Saw this at TIFF I don't think  have ever been so bored watching a movie in my life.  There was no one or nothing to route for.  They just sat around and waited to die.  At least In the movie The Island, when they discovered what they were in for they fought to stay alive.  These people sat around a whined about how unfair it was.  I wanted to scream \"THEN DO SOMETHING ABOUT IT!\"  But that something never came.  I don't respect people who don't at least try to change their circumstances.  Awful story, Normal I cry like a baby at these movies and I didn't shed a single tear because I didn't Feel anything for any of them.",
      "total_reactions": 6,
      "user": "Dayna"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2011
      },
      "score": 2,
      "text": "I was mesmerized by the book. When I heard there was a film, I wondered how they would make a movie of this quite, emotionally laden, non-high speed action book. I just finished the movie and was dismayed that I bought the DVD. The film seemed like a made-for-TV video. I personally added emotion to the viewing because I had such an attachment to the book characters. Had I not had that attachment to them  prior to watching the film, I would have shut it off and done the laundry or the dishes. I absolutely did not care for the movie. Having said that, I really didn't know how anyone could take all that thought and emotion from the book and translate it to a medium that calls for some action in the conflict. Great Book. Terrible Film. Keira Knightly = ick.",
      "total_reactions": 3,
      "user": "deereads"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "This movie was excellent. The premise of the story intrigued me so I purchased my ticket and entered the theater with a skeptical expression. I had seen the island but I knew that this movie was approaching it from a wholly different angle, providing the aesthetic foresight accompanying the characters and their destinations. I felt immensely invested in the characters; suffice it to say Carey Mulligan's performance gripped me and elicited a strong sense of nostalgia as she progressed through the film. I seldom cry I'm movies but the story of this film, the tribulation they undergo is one that connects to the innermost rivers of emotion we experience as we face the end of something, namely life, and by the end of the film tears streamed from my eyes. The premise of the film sits on the assumption that society accepts the system presented to us in the film, and many elements of the film allow that assumption to flow quite nicely. I look forward to the novel and I encourage all to watch the movie.",
      "total_reactions": 5,
      "user": "Trophysucka"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2011
      },
      "score": 2,
      "text": "I had no expectations to this film, I just read the introduction to what the plot of the film was and then I pressed play. After twenty minutes the film finally reveals what the plot is about, so anyone who have not read the cliffnotes will have no idea what it is about.",
      "total_reactions": 10,
      "user": "Jon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2010
      },
      "score": 5,
      "text": "As I was watching this movie, I keep thinking about The Island, a movie with a similar scientific premise, but handled in a much more interesting way. Yes, that was a sci-fi action flick, and this is a pure drama, but it seems like almost TOO much of the detail was left out of this movie. And it maintained a slow emotional burn throughout. Almost a bit boring.  Doesn't have the emotional wallop like I thought it would have. I was disappointed that Sally Hawkins had such little (though impactful) screen time.",
      "total_reactions": 2,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "This is a melancholy and brooding movie with very good acting.  There are two stories simultaneously going on.  The first has to do with the Orwellian government's purpose for the existence of the main characters.  The second is about a jealous and petty girl who intentionally thwarts the development of a relationship involving her friend, only to try and make up for it later in her life.  The contra-position of these two stories is very interesting.   The movies Coma and The Island both dealt with the Orwellian part of this movie's story, both in a completely different (and I would say less successful) way.  Those movies assumed that what was happening was so horrible that all one has to do is expose it for it to stop.  This movie assumes that it is accepted by society.  It ends up being a fresh and unique take on the subject. Well worth seeing and very thought provoking.",
      "total_reactions": 2,
      "user": "StevieGJD"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "I'm overwhelmed.  After a summer of crude, overly-budgeted nonsense, the last three weeks have found me in the theater watching films that were thoughtful, mature, and perhaps most resonantly, emotionally razing.  It's exciting to arrive at this time of year as the mood starts to shift along with the caliber, but it's also important to be prepared for it, and I can't say that I have been.  I've gone head first into these films with little more than excitement to safeguard me.  Today, this trilogy of despair came to its logical conclusion with the lovingly crafted and deeply heartbreaking Never Let Me Go.",
      "total_reactions": 2,
      "user": "PeterWertz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2010
      },
      "score": 2,
      "text": "Disappointing because this could have been a really compelling movie and I loved the premise. The film on it's own has a gaping fatal flaw, a fundamental question REQUIRED for us to continue suspension of disbelief and immerse ourselves in the story. Perhaps this is why the book readers rated it higher. It's insulting to the audience not to acknowledge the elephant in the room or even attempt to address it's presence. Maddeningly stupid decision or oversight that reduces the rest of the film to fairly useless fiction.",
      "total_reactions": 2,
      "user": "asterix11"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "I love rare films. This is the significance of this film, rareness. When I say this film is rare I mean that you don't see this drama in movies very often. I loved the performances of the actors and the setting. Not to forget how they turned a love triangle to a friendship to last in their memories forever.",
      "total_reactions": 2,
      "user": "Mary7"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "It's the saddest music in the world. By itself, Judy Bridgewater's \"Never Let Me Go\" is just another torch song of no particular distinction, it's what Kathy H. brings to the canned performance; her naivety as a listener which makes the ordinary ballad so heartbreaking, when she misinterprets \"baby\", the singer's plea to a careless lover, as a petition to a baby, in the literal sense, that he/she \"never let [her] go\". While the cassette tape plays in the empty dorm room, Kathy H. slow-dances with a pillow, the baby she'll never conceive, in her arms, with Madame watching from outside the doorway, a little bleary-eyed, flummoxed by the young girl's humanity. In an instant, she knows the \"gallery\" is just window-dressing. These children do indeed have souls. This scene, more than any from the Kazuo Ishiguro novel, demonstrates the profundity of inhumaneness at work here, made all the more strange by the genteel setting of the Hailsham school, whose guardians, despite their advocacy against treating these children inhumanely, still believe that the final solution is a necessary evil. These unseen forces count on the guardians to poison their minds with propaganda about the world outside Hailsham, and the world inside their bodies.This ignorance; this resignation, that these children have been instilled with all their lives, since birth, made them feeble, made them strange. The pantomime Ishiguro describes in his Man Booker Prize-short-listed book, an imitation of motherhood which Kathy H. performs in a context so grossly misapprehended because of her own circumscribed purview, is a grotesquerie that makes the girl too vulnerable, too much like a freak. With the same stiff upper lip he applied to his third novel \"The Remains of the Day\", the pre-eminent writer of contemporary British fiction has no reservations about putting Kathy H., Tommy D. and Ruth in tragi-comic situations that serve them up for ridicule. Too bad the film version of \"Never Let Me Go\" chose to iron out the flaws which made the students less bland. They're maladjusted, but the film wants to ensure that audiences like them. In the book, Kathy H. had lots of sex with strangers, Tommy D. didn't seem nearly as thoughtful like how Andrew Garfield plays him, and Ruth was a whole lot more machiavellian at Hailsham, and especially at the Cottages. But most egregious of all, what \"Never Let Me Go\" loses in the translation from novel to film, is the original meaning of the Judy Bridgewater song, since the filmmaker changes Ishiguro's lyrics by replacing \"baby\" with \"darling\", a term of endearment that Kathy H. associates with Tommy D.. The dystopian film loses its key estranging moment in order to make the girl more relatable to the moviegoer, who can better identify with a girl in the throes of puppy love. Kathy H. has a better grip on her feelings in the movie than the book, an effect, however, that makes her indistinguishable from any other boarding school girl with growing pains. Instead of Madame, it's Ruth who's the quiescent observer, and like her best friend, she too seems overtly sophisticated and worldly, not at all how Ishiguro envisioned them, his \"poor creatures\", as Madame later describes them, but in the film, the jealous girl understands Kathy H.'s designs on Tommy D., understands the gist of the song, which gives her the impetus to steal the boy's heart. \"Never Let Me Go\" is too conventional for its own good. The love story plays too prominent a role in the narrative, at the expense of the dislocative atmosphere which drives the book, but disappointingly, not the adaptation, whose revamped character seem to understand the difference between love and sex, tears and come, in spite of their limited experiences. As adults, when Kathy H., Tommy D., and Ruth begin to fulfill their destinies as \"carers\"(Kathy H.) and \"donors\"(Ruth and Tommy), \"Never Let Me Go\" pays the price of loving its characters too much. The filmmaker wants the trio to be savvy about love, but naive about dying, but they seem too smart, so when the former Hailsham students don't seem fully cognizant to the fact that \"completion\" and death are a matter of semantics with little or no differentiation, it rings false. They should escape, but \"Never Let Me Go\" avoids that banality, so prevalent in the third act of so many genre films, especially science fiction, because Hailsham turned them into good little soldiers who wouldn't desert their mission and escape the fate which awaits them. In one scene, acting on a tip about a boat, Kathy H. drives Tommy D. and Ruth to the coastline, but the boat is purely for sightseeing. Marooned on the sand, nobody seems terribly disappointed that the boat isn't on the water. If it was, would they have the survival instinct to sail away? After Ruth dies, clearing the way for Kathy and Tommy to get their \"deferral\", why don't they just get in the car and take off?",
      "total_reactions": 5,
      "user": "Shiira"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "i will be adding this movie to my library. it was not like all your other vampire flicks that are out their.  one you can sit down and enjoy. has a good story line that can be fallowed easy so is a good movie for a crowd of adults. or just snuggled up on the couch on a snowy day.",
      "total_reactions": 3,
      "user": "shepardn"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "First, I must explain that I read the book prior to seeing the movie.  I thought it was well acted and caught the mood and tone of the book precisely.  Also, it was cast well and I felt Andrew Garfield's performance as Tommy was fabulous.  The reason for a bit lower score is due to (2) reasons:  changes in significant events in the book -- don't worry, I won't tell.  And, the oversimplification of the dialogue and lack of nuances that are in the book.  I realize in order to adapt any book to a movie, much must be cut.  But a couple of significant things could have been included and not added too much to the running time.  Regardless, I think it's a compelling movie that will leave you with questions for days.  And, I recommend you read the book first.",
      "total_reactions": 3,
      "user": "KismetKat"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 1,
      "text": "This movie was sooooooooo boring and dull!!! I found it very unoriginal!!! Keria Knightly is an awful actress!!! She is always doing movies she feels she'll get an Oscar nomination for!!! Any movie that stars Keria Knightly is going to be c**p that's a guarantee. I lost interest in this movie within the first 30 seconds!!!",
      "total_reactions": 3,
      "user": "HEI5ENBERG"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "In 35 years this is the worst film I have ever seen. Boring Boring Boring Boring.  The most exciting thing that happened was at the end of the movie watching plastic bags stuck to a fence fluttering in the wind.  What a waste of 2 hours of my life.  I have seen all 3 main actors in other films where they have been fantastically directed.  They should all feel embarrased by this movie.  I would rather watch paint dry than see this film again.",
      "total_reactions": 3,
      "user": "steveb"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2011
      },
      "score": 2,
      "text": "Highly Implausible plot... I kept thinking why on earth wouldn't ALL the organ donors volunteer to be \"caregivers\" and why would a caregiver opt to become a donor... Acting was good, but the plot was annoying. Its hard to get involved in a film when there are such gaping holes in the logic of the narrative.",
      "total_reactions": 5,
      "user": "fredphoesh"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2010
      },
      "score": 8,
      "text": "A friend of mine who saw this movie encountered a woman after the movie in the woman's restroom crying uncontrollably.  It is a sad movie.  Though the temptation is to classify this movie as science fiction, I don't think it is.  It is more an allegory about live and life and death.  The young folks in the movies are raised to literally give of themselves and the search for love is the center of their lives.  The only thing that is certain is the inevitability of death.  Death brings all the characters closer together, encourages them to love, but also separates them.  Life in all is beautiful but sad.  Unless we are stone cold and ungiving, we are very much like the characters in this movie.",
      "total_reactions": 1,
      "user": "Dalem"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 1,
      "text": "In an alternative reality taking place in the 20th century, clones of people are being raised in boarding schools for them to grow up as walking organ donors to aid mankind to lead longer lives. The film follows the short lived lives of several of them from childhood up, in the most lifeless and dragged out fashion imaginable. There isn't much of a story here, in between the excruciatingly overacted drama and ponderous thought provoking (the term is used loosely here) clichÃ©s, that is. The premise is asinine (Do they transplant brains too? Can't they just create lifeless bodies and put them in stasis until such time an organ is needed or something to that effect) and the execution vapid and nonsensical. Any interesting ground that could have been explored, was conveniently reduced to a heap of hopelessly boring platitudes about inter human connections and done to death ethics involving human cloning. It plods and then plods some more.",
      "total_reactions": 1,
      "user": "DirtyCash"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "so many questions unanswered in a script which tends to linger on details rather than the essence. But the beautiful photography and the masterful performances (especially from Mulligan) make the film worthwhile watching.",
      "total_reactions": 1,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2011
      },
      "score": 0,
      "text": "I suffered thru the first 20 minutes, skipped a bit forward and suffered some more. It just drags along and it must expect that its audience has an immense reserve of patience as i had to cut it short. Perhaps something happens in the movie but i would rather read the summary than having to endure such a slow death.",
      "total_reactions": 2,
      "user": "MorriBey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "A superbly crafted and thoughtful movie.  While skeptics will decry the suspension of disbelief required to accept the film's underlying premise, you will leave this movie in quiet, deep thought.  My wife had read the book, for which I was grateful  to obtain a few additional layers the movie omitted.  The movie proposes ethical dilemmas of which stem cells are the tiny tup of the iceberg which our planet and our country will soon face.  This film forces us to consider these dilemmas, although in a way in which the choices are made too obvious.  As technology advances, and our choices become more complex, how will the simplistic sound bites presented by talking heads ever help us understand and choose wisely?",
      "total_reactions": 0,
      "user": "brewster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "waoo an argument he had not seen, I liked, strong and sad movie with a heartbreaking social contrast. good interpretation, especially Carey Mulligan, I have to say I love it xDD",
      "total_reactions": 0,
      "user": "wishmaster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2012
      },
      "score": 2,
      "text": "A sci-fi movie written by the master of elegance Kazuo Ishiguru? Sign me up! Unfortunately, Never Let Me Go turns out to be a beautifully shot but utterly tedious affair. The characters show no backbone or fight. Talking of fighting; I was fighting boredom all the way through this art-house turd... and boredom won! A severely disappointing film.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "Great movie, beautiful, of an amazing subtlety, and with two of the best actors from the new generation, Andrew Garfield and the ever-wonderful Carey Mulligan. If the outcome is hardly surprising, at least itâ",
      "total_reactions": 0,
      "user": "jimmytancredi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2011
      },
      "score": 5,
      "text": "If they called this film 'Never Gonna End' it would have been much more accurate. While the premise of the film is kind of interesting in an intellectual way, the understated, sad sack performances of the three leads suck all the life out of it. They are so wrapped up in themselves it's really hard to care about any of them. Carey Mulligan is cute as a button, but by the end, even she has lost any sympathy she might have had. If you like movies about frustrated, grey English upbringings, then you will have a ball with this movie.",
      "total_reactions": 0,
      "user": "MikkiHK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "A near great science fiction movie with a great up and coming cast. Andrew Garfield is explosive (See the Part 1 of the Red Riding Trilogy), I'd expect him to win some serious awards in the future.",
      "total_reactions": 0,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "Mulliganâ",
      "total_reactions": 0,
      "user": "trailofthebread"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "this movie is so **** good, whow the actrors are fantastic, the history is very beautiful even i cried, and for me is one of the beutiful films ever do. i really love",
      "total_reactions": 0,
      "user": "rafael14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "the most common criticism I see of this movie is that nobody subjected to this treatment would accept it as it is, but as a work of fiction it's trying to say something, so put that aside for a moment.  but after I saw the movie it lingered in my head and I spent the rest of the night thinking of it.  never let me go is about cruelty and apathy, on a macro and micro level.  It's about the cruel things we do to each other, and that are imposed on us by society, and the cruelty inherent to humans.  and for that to come through you have to be with these characters and feel almost like you want to turn it off, because you know what's coming.  and, more profoundly, as is explicit in the movie's closing, it's about losing what makes life worth living, and feeling, all the time subjectively when faced with the inevitable peril of vanishing from consciousness, that it is somehow unfair that we have not had much more time to revel in what we have, and that it has been taken or we have lost it somehow.  very good and thought provoking, but I would not suggest it if you are one of those people that can't sustain a fiction because you keep trying to superimpose the reality you're used to and because you have trouble with metaphor.  you know who you are.",
      "total_reactions": 0,
      "user": "altdrsmoothop"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "A touching, heart-rending movie - although depressing in parts. There's so many aspects of this movie that has so much to do with real life - it triggered my sense of morality and set off my tear duct. It wasn't a cheesy movie designed to just make you cry - it wasn't even a cheesy movie at all. This movie touches on so many things, so many sensitive things that you wouldn't even think about. The plot thickens as the story continues and learn of 'completions' and 'organ donors'. This movie is a movie about real life and looks at the more sensitive and harder to touch aspects of movie aspects.",
      "total_reactions": 0,
      "user": "EssenceOfSugar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "My favorite drama movie with a gripping story that makes us wonder about ourselves, a very sad end, almost impossible not to cry watching. The acting is also impeccable.",
      "total_reactions": 0,
      "user": "vini1904"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "A nicely shot, very effective social commentary film on the human ethics. This well acted drama had an interesting plot carried out through an effective (if mediocre) screenplay.",
      "total_reactions": 0,
      "user": "CinemaNoir"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "Beautiful, fresh, good approach. I think it can't be a coincidence that good movies are mostly based on good books. I mean, the scripts have to have a good base. Gripping and wonderful.",
      "total_reactions": 0,
      "user": "helly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "A powerful look at dystopia--carried with great performances from an astonishing cast and a well-written script. Never Let Me Go is non-traditional as far as dystopian dramas go--not that dystopia is at all typical.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2012
      },
      "score": 1,
      "text": "Completely depressing. Who would even write a book like this let alone make it into a movie, The characters have absolutely no spark, no will to live. I mean seriously, why not just run away. Alternate reality or not. Where they genetically engineered to have no sense of survival?? Even the simplest of life forms have the will to live. A gallery to see if they have souls at all, how depraved is that??  I think the actors are great but the movie just brought me down. Completely and utterly depressing,  I would keep going, but i don't want to waste anymore time writing about how awful it is.",
      "total_reactions": 0,
      "user": "vmajr0263"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2016
      },
      "score": 9,
      "text": "A beautiful and moving film, director Mark Romanek's Never Let Me Go is a fantastic film that really nails its thematic elements. Speaking on mortality, humanity, classism, and free will, Never Let Me Go is a beautiful film with many touching elements. The world created here is incredibly interesting and fits the \"dystopian\" billing perfectly, but only if you are the unfortunate group who has to see that underbelly of society. The romance, cinematography, and score, of the film are beautiful and really give the film a period piece type feel, even though it is not a period piece. Despite the lack of similarity in genre, it is clear that somebody on the creative team here has seen some period pieces in their time. As a person who loves the look and feel of those films, it was much appreciated. Carey Mulligan, Keira Knightley, and Andrew Garfield, are phenomenal and have fantastic chemistry between them. Finally, the script from Alex Garland is strikingly written, thought provoking, and just absolutely wondrous. Overall, Never Let Me Go is a stirring and beautifully made film that will get you thinking and move your heart.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2016
      },
      "score": 7,
      "text": "Another slow paced Carey Mulligan film (surprise) with a lot of heart and beautiful scenery.  The concept brilliant was let down slightly by the acting ability and connection of the characters.",
      "total_reactions": 0,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "Amazing movie, If you have a open mind and let it, it will move you no have you thinking for days, It does go abit slow so anyone with ADHD will problem find in boring and not be into it, Was a great watch though defiantly worth a watch if you like to be moved",
      "total_reactions": 0,
      "user": "Sam1234"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "Although has passive characters who do not arouse any interest in the viewer, the film has a good message and has story enough to arrest those who are watching and stay in memory for long days story.",
      "total_reactions": 0,
      "user": "VictorBueno"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2015
      },
      "score": 6,
      "text": "Never Let Me Go never had the chance at being the same book and movie – the very elements and intricacies of conversation that contributed to the book's allure were those that were completely ignored in the movie. Perhaps I'm an unfair critic, basing my rating on similarities between a book and its dramatization, but on it's own, I completely understand the movie. No mystery, but it served its purpose – like the clones put in their place. The odd relationships that form between these carers and donors and their relation to society are the star – as they entirely should be. The movie also raises questions about true love and morality with a unique take.",
      "total_reactions": 0,
      "user": "hanneguacamole"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "Never Let Me Go is a surprising film, with a strange blend of sci-fi, mystery, romance, and atrocity that I've never seen before. The film's style, especially in the first act, is quite good and gives the sense it takes place in an alternate, but very real world. The lead actresses play their parts well, as one would expect. The main strike against the film is the lead actor, who is fine, but not on par with his co-stars and it detracts from the tragic strain the film is going for. But overall, Never Let Me Go is a memorable film and is quite good.",
      "total_reactions": 0,
      "user": "RobertBrogan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2016
      },
      "score": 7,
      "text": "Not a feel-good movie at all, which isn't a bad thing. The plot was very good, and this movie did a good job of presenting it clearly. I just wouldn't recommend this to anyone who is looking for a light-hearted film.",
      "total_reactions": 0,
      "user": "rosstheboss2000"
    }
  ]
}