{
  "mc_avg_user_score": 5.4,
  "mc_metascore": 29,
  "mc_mixed_rating_frequency": 14,
  "mc_movie_name": "New in Town",
  "mc_negative_rating_frequency": 10,
  "mc_positive_rating_frequency": 12,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2011
      },
      "score": 3,
      "text": "The first and biggest problem this film has is the fact that it is a romantic comedy. Being one, it does not deviate from the typical rom-com recipe, what-so-ever. Being rather predictable (and by rather I mean completely to an annoying degree), the film does not offer anything new to the audience. The screenplay is simply bad, with a storyline that was maybe innovative back in the 1980s, but now has become the standardised cliche. One the film manages well is to create a positive relationship between the audience and the Minnesotans in the film. Some very cute scenes are in the film, and one cannot but feel warmly towards them, especially Siobhan Fallon's character, who is, by far, the best thing in this bad film. Renee Zellweger is rather bad - her strongest asset here seems to be her body, and it's in a film where that shouldn't be an issue. But yes, Zellweger doesn't give anything good to the film, and one can only wonder why she ever got cast. Maybe trying to re-connect to her Bridget Jones' days? Be it as it may, the film is rather bad and annoying, full of cliches concerning both rom-coms and Minnesota, and with generally pretty bad dialogue and acting, makes \"New in Town\"  be one of those films you could have easily gone without ever watching.",
      "total_reactions": 0,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2010
      },
      "score": 0,
      "text": "Probably one of the worst movies ever. It's equally off-base with its portrayal of \"city people\" and \"country folks'. Both seem to be outdated and stereotypical. Don't waste your time.",
      "total_reactions": 0,
      "user": "heather1987"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "New in Town drove me out.",
      "total_reactions": 0,
      "user": "RayzorMoose"
    }
  ]
}