{
  "avg_user_score": 5.9,
  "metascore": 47,
  "mixed_rating_frequency": 56,
  "movie_name": "Night at the Museum: Secret of the Tomb",
  "negative_rating_frequency": 17,
  "positive_rating_frequency": 50,
  "pro_critic_reviews": [
    {
      "critic": "Joe McGovern",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "Night at the Museum: Secret of the Tomb has one thing going for it that even many of this season's prestige films don't: It's kind of fun, unembarrassingly, and not least of all because the people who made it look like they had a good time doing so."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 70,
      "summary": "Playing Teddy Roosevelt in these films was nowhere near a highpoint for Williams, but it did speak to his fondness for these CGI-infused kids’ spectacles. His final farewell here is gentle, reflectively and almost unbearably moving. It lends the the film a retroactive grace."
    },
    {
      "critic": "Read full review",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2014
      },
      "score": 70,
      "summary": "The third installment, Night at the Museum: Secret of the Tomb may be the best, and even the generally wound-too-tight Ben Stiller — once again playing a bemused Museum of Natural History guard — is easy to tolerate."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2014
      },
      "score": 70,
      "summary": "A most enjoyable capper to director Shawn Levy and producer Chris Columbus’ cheerfully silly and sneakily smart family-entertainment juggernaut."
    },
    {
      "critic": "Louis Black",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 67,
      "summary": "Surprisingly well-crafted for something as aggressively dumb as this, the real surprise is the cast."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2014
      },
      "score": 63,
      "summary": "The Night at the Museum tent pole has played fast and loose with history, and with our knowledge, or lack of knowledge, of the past. But I'm pretty sure a capuchin monkey never urinated on teensy-weensy figures of a cowboy and a Roman emperor as they ran for their lives from a lava flow in ancient Pompeii. That happens in Secret of the Tomb, and it seems like a fitting way to retire the show."
    },
    {
      "critic": "John Semley",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2014
      },
      "score": 63,
      "summary": "The SFX set pieces are pretty lame, mostly involving a lot of weary running around and tense, ticking-clock urgency. What elevates Secret of the Tomb is the classicism of its humour."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2014
      },
      "score": 63,
      "summary": "The third installment of the Night at the Museum franchise, Secret of the Tomb, is better than its predecessors, funnier and more adventurous, thanks to a visit across the pond to the British Museum."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2014
      },
      "score": 63,
      "summary": "Seeing Ben Stiller, the late Robin Williams, and their magically roused gang together again, this time in London, is initially all about indulgent, nostalgic smiles rather than new wows. But then comes the movie’s exceptionally clever and fresh final act, which delivers genuine surprise along with many laughs."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2014
      },
      "score": 63,
      "summary": "Rates as more determinedly heartfelt than the first and not as witty as the second (and best). Also, no Amy Adams as Amelia Earhart in jodhpurs this time around."
    },
    {
      "critic": "Neil Smith",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2015
      },
      "score": 60,
      "summary": "The most inventive sequence has Larry and Teddy plunge into an MC Escher painting, an interlude so dazzling you can almost overlook the weeing monkey."
    },
    {
      "critic": "Angie Errigo",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 60,
      "summary": "Against the odds, perhaps, but part three injects a tiring franchise with new life and some surprisingly dark jokes. Some fun cameos and another winning Dan Stevens turn also add much needed unpredictability to the miniature goings-on."
    },
    {
      "critic": "Nicolas Rapold",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2014
      },
      "score": 60,
      "summary": "It’s a chronically underachieving movie, but relatively amusing in its quaint wish fulfillment."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2014
      },
      "score": 60,
      "summary": "The third Night at the Museum film starts strongly, with its heart in the past... It’s an exciting opening, and perhaps too exciting for the film’s own good. It’s hard not to be disappointed when the plot moves back to the present and settles into the time-honoured formula of digitised creatures running riot and famous people in fancy dress doing shtick."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 60,
      "summary": "There are big special effects, of course, but refreshingly, this third (and final?) movie in the franchise is like a pleasant stroll through familiar halls."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 58,
      "summary": "The real problem for me is that every one of the films feels exactly the same, and this is where I think I'm at odds with what the studios want from these films."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 58,
      "summary": "Secret Of The Tomb plays it as a source of corny jokes, pop-culture references, and father-son bonding moments. In other words, it’s exactly the kind of film that shouldn’t be expected to engage with its assorted bizarre subtexts — but what a movie it could be if it did."
    },
    {
      "critic": "Glenn Kenny",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "The adult viewer, reflecting on the idea that this is “just” a kid’s movie, might conclude that kids deserve a little better."
    },
    {
      "critic": "Walter Addiego",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "This film is mainly for “Night at the Museum” diehards."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "The special effects remain good, but the jokes are creaky, the sentiments are forced and the pop-historical lessons are obligatory."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "For piquing kids’ interest in history and nature, you could do worse than this goofy Ben Stiller franchise. But its third installment is more meh than manic, too reliant on wide shots of the ragtag Museum of Natural History cohorts striding down corridors. You get the feeling returning director Shawn Levy is ready to hang it up."
    },
    {
      "critic": "Stephen Whitty",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2014
      },
      "score": 42,
      "summary": "The exhibits in this Night at the Museum may still come to life nightly. But their latest movie stays stubbornly inert."
    },
    {
      "critic": "Jamie Neish",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2014
      },
      "score": 40,
      "summary": "Looped around a paper-thin narrative that makes hardly any sense, Secret of the Tomb displays signs of fatigue right from the start."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2014
      },
      "score": 40,
      "summary": "Night at the Museum: Secret of the Tomb is a rather lackluster affair, a cash grab that tries to aim a little higher but confuses sappy shortcuts with real emotion."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2014
      },
      "score": 38,
      "summary": "The dialogue is schmaltzy and often painfully unfunny. The special effects are often so 1980s-bad... Time and again, terrific actors sink in the equivalent of cinematic quicksand, helpless against the sucking sound of this movie."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 38,
      "summary": "Minor moments of slapstick may tickle the kids, but anybody older, especially those who remember what Williams was like in his prime and how funny Stiller was just two “Museum” movies ago, will wish this tomb had stayed sealed."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2014
      },
      "score": 37,
      "summary": "The aptly subtitled Night at the Museum: Secret of the Tomb is a blast of dead air and mummified humor."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2014
      },
      "score": 31,
      "summary": "It's hard to get invested in the father-son dynamic here, even it when it represents a diversion from the limp comedy bits and the flatlined suspense."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2014
      },
      "score": 30,
      "summary": "Did anyone have a good time making this movie? The actors seem to be reading their lines at gunpoint, in an enterprise whose mood is less summer camp than internment camp."
    },
    {
      "critic": "Michael Rechtshaffen",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2014
      },
      "score": 30,
      "summary": "Despite relocating across the pond to the esteemed British Museum, the creaky Night at the Museum: Secret of the Tomb fails to capitalize on the comic potential provided by that change of venue."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 25,
      "summary": "Night at the Museum was always the best when it was closest to complete anarchy, tapping into the zippy, good-natured malevolence of filmmakers like Joe Dante, but here that energy is gone, replaced by a kind of sleepy noncommittal attitude. The magic has dried up; the museum is closed forever."
    },
    {
      "critic": "Drew Hunt",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2014
      },
      "score": 25,
      "summary": "This third and supposedly final edition in the franchise is nothing more than an uncomfortably transparent contractual obligation."
    },
    {
      "critic": "Andrew Lapin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 20,
      "summary": "Even for the third entry in a family franchise, the construction is lazy to the point of indifference."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2014
      },
      "score": 1,
      "text": "This was a recycled idea being brought over and over again! This is getting really boring and Shawn Levy really needs to end it now. The first one was good but when Smithsonian came out, I was bummed because it sucked. The Secret Of The Tomb is the WORST of the two, its boring, mind numbing but atleast Ben Stiller and Dan Stevens with ROBIN Wiliiams (His Last Role, R.I.P) were what made me atleast 30 percent interested. Its not even funny anymore, some snappy lines aside this film is the same garbage (washed out Smithsonian). Do not waste your time, because its not the same! The secret of the tomb deserves my 1/10 because at least some actors brought their best. Ignore.",
      "total_reactions": 2,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "Night at the Museum: Secret of the Tomb is a fun family film finale to the adventure trilogy of Larry Daley. What started as a semi-educational spectacle became a trilogy that focused less on the premise and more on the CGI action. The dragging narrative picks up as beloved characters bring their antics to the big screen one last time.",
      "total_reactions": 2,
      "user": "TheFilmFanatic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "It had its moments. I get the idea they lost some of their creative drive in this movie, and simply made a sequel because it would sell. Sir Lancelot was fun but unfortunately the only interesting character. The rest was recycled from previous movies.",
      "total_reactions": 2,
      "user": "SH1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "Not at all funny, Bad visual effect, bad dialogue, at it seems that the group is just a filler and names without any effect on story. i mean the movie without Williams, Wilson and Kingsley  would not be any different.",
      "total_reactions": 2,
      "user": "RaminSharifian"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "For the final night, the final movie and the film ended...so so.",
      "total_reactions": 2,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "The same old story, but this time the action is transplanted to the British Museum. A star studded cast do what they can with a very weak script but they really are fighting a losing battle. A particular low point is the running gag with Stiller's neanderthal doppleganger, which surely someone saw was stunningly unfunny. The highlight comes with a big star cameo near the end. A shame that this may be seen as Robin Williams last film",
      "total_reactions": 1,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "So the final movie in the trilogy. That's what I'm hoping for. Because when the first movie came I thought it was a nice idea and then its sequel was so bad without any further innovative ideas to add up. I was not expecting the third movie, but it made its way and I give it a try only to get disappointed.",
      "total_reactions": 1,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2014
      },
      "score": 1,
      "text": "I really enjoyed the first two of this genre,in particular the second one,but this? utter dross! bitterly disappointed...Don't bother.Perhaps kids will like it,not sure,but they could have made more of an effort,a bit insulting really, shame on you Ben Stiller!!",
      "total_reactions": 1,
      "user": "Zaphod20212"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2015
      },
      "score": 1,
      "text": "Atrociously awful. Full of useless filler dialogue, illogical situations and solutions (urinating on lava wouldn't put it out THAT quickly), and a plot so full of holes that it makes termites jealous, Secret of the Tomb spectacularly fails on almost every level. The only reason I'm giving this a 1 is because of the Mickey Rooney/Robin Williams tribute at the end of the film. 1/10, F.",
      "total_reactions": 1,
      "user": "TimeOfTheChimps"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "Night at the Museum: Secret of the Tomb provides mindless fun and will entertain young viewers but beyond its over reliance of CGI is an abysmal plot recycled from the first two movies.",
      "total_reactions": 1,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "The last night at the museum has its own moments just like the previous two installments, the Egyptian theme and the tomb at the very beginning of the film might bring audiences the feeling of getting back to the first two Mummy films, but soon after that, everything ruins thanks to the easy, lazy story line without a proper exploration on each characters development and to build a logic connection and memory among themselves. It intends to be ridiculous, joyful and hilarious, especially the monkey character, Dexter which impresses the most are all the main factors that the film is suitable for family goers on Christmas. The film would be a complete disaster without Ben Stiller to lead, but this does not save the film to look dull, not so funny with lame jokes, weak scores and to look inert. Overall, it is a disappointment as this family franchise film lacks of inspiring message, burns off the original film's energy and ideas, and ends losing all the magics abruptly.",
      "total_reactions": 1,
      "user": "michael1208"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "Enjoyed the previous films and was looking forward to this one.  The characters, a new location with tons of history. But I came away feeling cheated. At times the interactions between characters looked awkward, you could see they were going through the motions. Like it was less the movie, more the paycheck. Robin Williams was not at his best and he seems so sad throughout which in retrospect might have been the case. The new characters, the cheeky security girl, the Knight, were ok. The lions from Trafalgar square chasing a laser light was the highlight. It was enjoyable, just I was expecting more. So many historical characters to choose from, a fresher pair of directorial eyes might have helped.",
      "total_reactions": 1,
      "user": "amwbfh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "This movie is less of what I expected. It’s really funny in some parts, it has good acting, and all the characters you missed are back. Sadly, it’s boring in some another parts, it’s just stupid, it reuses a lot of old jokes that aren’t funny anymore, and it has a lot of subplots that weren’t necessary and just made the movie worst.",
      "total_reactions": 1,
      "user": "Dokalu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2015
      },
      "score": 3,
      "text": "such an average film, just the same as the older films really",
      "total_reactions": 1,
      "user": "boubadiop"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "As a FAMILY movie, it deserves an eight. It's something enjoyable for the adults (especially with Robin Williams' performance) and my 11 and 10 year-olds loved it.  Don't let the critics' score stop you from seeing this one, if it's a family movie you are looking for.",
      "total_reactions": 3,
      "user": "HolaAnderson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "A fitting end to a trilogy that was great, especially the second installment. Secret of the Tomb delivers with more emotional scenes than its predecessor, an interesting plot, and funny dialogue. The movie is definitely worthy of Robin Williams' last role.",
      "total_reactions": 3,
      "user": "DBPirate1129"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2015
      },
      "score": 7,
      "text": "The third installment of the franchise doesn't go on par with the last two films, in terms of pure adventure and entertainment, However it offers a good ending with a powerful main point.Overall it was a good way to end the franchise.",
      "total_reactions": 2,
      "user": "geo333"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "Ben Stiller is back at his museum full of historical figures that come alive at night. This sequel's adventure takes them to London's British Museum, where a bunch of new exhibits enter the fray. Again, there are lots of big setups, inane chases and dozens of animated creatures. While this movie could be construed as cute for adults, the movie is really for kids. The plot is silly, but it's about the characters who add personality and fun to the film.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "We saw Night at the Museum at the Houston Museum of Natural History in their IMAX theatre. We had the best seats and loved this movie! The special effects were fantastic. I wouldn't be surprised if they get a nomination for set decoration, maybe costumes. The scenery and location shots were superb. The story was the weakest part of the movie for most people, but not for us. It was silly, sappy and sentimental. Just what we want to escape to instead of reading the latest horrors in the world. It's about people who have no common interests, no common culture to relate to, and are centuries apart in age and ideals. Yet they mostly get along and care about each other. If only that was real life. It was bittersweet seeing Robin Williams and Mickey Rooney (died at 93 after a 91 year career in show business). The Movie has a wonderful goodbye scene for Robin as Teddy Roosevelt. The good feelings from the movie made us leave happy with the magical theme of people of all kinds getting along, which of course, is fantasy in real life.",
      "total_reactions": 2,
      "user": "ledaumas"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "Great encore presentation from the returning cast and a few new ones. Robin williams gives a wonderful performance that creepingly parallels his now known personal struggles. It makes you shed a tear thinking of what could of been on his mind while showing us one more performance of his Roosevelt. We also get to see Mickey Rooney as lively as ever. This is indeed a great family film and should not be looked over so easily.",
      "total_reactions": 2,
      "user": "analogkid280"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "Oh goody, more of the exact same thing except now in England. So much rehashing and focus on the EXACT SAME CHARACTERS! While I love Robin Williams as much as the next guy, I feel his passing has seriously clouded most people's judgement on this movie as a whole. Everyone want Robin Williams' last movie to be remembered well.",
      "total_reactions": 1,
      "user": "Rox22"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "Much better than its predecessor. Night of the Museum 3 offers the wackiness of the original but also with some better humour and character development.",
      "total_reactions": 1,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 2,
      "text": "BEN STILLER IS ON TOP OF HIS GAME!! The entire time my eye balls were glued to the screen as I watched the iconic movie magic of the ex \"meet the fockers\" legend! I saw the other Night at the Museum movies so natural i was VERY curious to see what these wacky characters were up to next! So me and my cousin went on a movie date to the closest drive-in vendor and sat back and enjoyed! 10 mins in and Ben Stiller already blowing us left and right with his humorous punchlines and silly satire. OH BEN!! At the half way point my cousin was soaking WET from crying of laughter! I got so excited i had to swallow my roars of laughter so i didnt disturb the families around us. Near the end of the film, the wise cracks were still penetrating my ear-holes fast and often. Me and my little cousin left more than satisfied! I recommended this film to all the kids i see in my neighbors apartment. They don't get out much because they are so close to there two dads but I'm sure they would love it!! I know I did! Ben Stiller is almost as good as Adam Sandlar!",
      "total_reactions": 2,
      "user": "Phillyedwards37"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "Night of the museum is back this the new trilogy, Yea! personally i thought this movie was  gonna be terrible why? cause the last Night of the museum (Night of the museum 2) i hated the kids humor but the movie is fun. But the humor in this movie the humor gets funny, the adventure gets fun and that's what children love when they watch the franchise.The movie has a little bit problems, the humor well its ok i really hated Rebel Wilson's character she was annoying and Not funny at all. Ben Stiller returns he still got it his performance is charming and well funny. Grade B this movie is funny, but the humor has some issues.",
      "total_reactions": 1,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "The movie has somewhat become straganvant, this movie doesnt even deserve funny things and scary things, but it still managed to have a decent story and acting.",
      "total_reactions": 1,
      "user": "Asyulus"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "Fun and bittersweet end of the series. I enjoyed it and makes me want to see the first two again. Robin Williams was excellent. Odd brief appearance by Dick Van Dyke.",
      "total_reactions": 1,
      "user": "Katzmandu1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "I just found the free download from this link, is that legal?",
      "total_reactions": 1,
      "user": "love_cisco"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "A very kid friendly movie with clean humor...Robin Williams last performance and he was hilarious as usual...A good movie to see with entire family if you can't find a babysitter for the evening. 6 out of 10",
      "total_reactions": 1,
      "user": "jlittle1404"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "I didn't like the first half of the movie, it was kind of lame and drawn out... toward the middle and the end I couldn't stop laughing. I give it a six because it was good over all but I wouldn't go any higher.. good movie and probably end up buying it.",
      "total_reactions": 1,
      "user": "showgirl1314"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "The third Night at the Museum still packs the magic. It may feel a touch familiar, but for once that's not a bad thing. It's great to see the character's I enjoyed in the previous two movies back again with some new faces. It's a family movie with plenty of humor.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2015
      },
      "score": 4,
      "text": "A cinema-going in Shanghai with my cousin, who handpicks this comedy sequel for solace because she has freshly gotten out of a tormenting tug-of-war between her parents and her boyfriend, so I dare not to differ.",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "This is an amazing family film, i am shocked this only got mixed reviews. It was funny, it was action packed, it had great prrformances from Ben Stiller and the late Robin Williams, and was a great last installment in the trilogy. I would highly recommend it.",
      "total_reactions": 0,
      "user": "mrmonster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "Terminar franquicias después de mucho tiempo deja un sabor agridulce para la última película de Robin Williams que hizo en vida. La trama es más de lo mismo.",
      "total_reactions": 0,
      "user": "chepod8"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "By the third entry in the series, this has become pretty predictable. That doesn't mean it can't be funny because there were lots of moments where I was laughing out loud. I thought it was a great sendoff to the trilogy. Recommended if you liked the first two.",
      "total_reactions": 0,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "The movie could have ended as heartbreaking as the Toy Story 3 if the disco/party scene have not concluded the film. However, of course, the genre is comedy and it intended to leave smiles on the audience' faces. Overall, the movie was worth a watch and a stress relief.",
      "total_reactions": 0,
      "user": "xenonpages"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "Even though I only remember bits and pieces from the first two films, this movie reminded me of my childhood. The acting, of course, was incredible.The scene where Akmenrah met his parents almost, ALMOST, made me tear up. You could read his emotion on his face - his love for his family, even after having not seen them for years. Robin Williams' final lines were more than a bit touching. The SFX were great, too (the constellation scene had me spellbound), but could have been better. The ending, on the other hand, left a bit to be desired. They had it set up well enough, with Akmenrah choosing to stay in London with his family and the tablet, while the others left back for New York, but I was expecting more of a relationship between Larry and Tilly. I was hoping that Larry would teach Tilly about the magic that was now her job every night; I was hoping he would help her learn how to handle the live dinosaurs and tigers and mammoths and war criminals; I was hoping he would at least warn her about what was going on - the two are kindred spirits now, after all. But no, instead the only thing he tells her is that she'll have the \"best job ever.\" Then it jumps to three years later, which disappointed me because I was eager to see how Tilly would handle her new-found responsibility and how Larry fared after the loss of his night show and if Nick ever went to college or not. This wasn't the only part that left me frustrated either. There were scenes when I felt the camera was focusing on entirely the wrong thing. During the roof scene, I wanted to shout at the screen \"Who cares about the monkey when Akmenrah is crumbling to dust after just having reunited with his family for the first time in decades?!?\" Although, in all fairness, this is a children's movie, and children would rather focus on the monkey. There were also some scenes I felt were a little unnecessary, such as the romance between Teddy and Sacagawea that was thrown in there at the last minute just for good measure (come to think of it, did Sacagawea even do anything in this movie? It seems she was just off to the side the whole time. I wasn't paying attention to it while I was watching, but I don't think this movie even passed the Bechdel Test). The same goes for the monkey-kiss scene in the falling action. Just because the main character didn't have a female love interest doesn't mean you can substitute in a monkey. Even though I had my quarrels with the falling action, the resolution ended on a positive note. The magic wasn't gone. It will never be gone. It just moved somewhere else to allow for new adventures and misadventures. With that said, I feel I should emphasize that this film is for children and families, and some of its shortcomings may be excused because of this. Despite its flaws, I actually enjoyed the movie while I was watching it, and if I didn't appreciate these movies enough as a kid, I certainly do now.",
      "total_reactions": 0,
      "user": "ABCReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "The first half of the film could've used more laughs, but Night at the Museum: Secret of the Tomb is a refreshing film full of great characters and humor.",
      "total_reactions": 0,
      "user": "WheelzFourReelz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "Piacevole dal primo minuto fino ai titoli di coda,dopo il \"flop\" del secondo episodio,finalmente un degno finale della trilogia,anche se il migliore resta il primo! Consigliato assolutamente se amate fare due risate in assenza di volgarità.",
      "total_reactions": 0,
      "user": "Ciccioboy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "Felt it was time for a fitting ending with the passing of Robin Williams and Mickey Rooney.  They done a good job with the movie wrapping up and it was nice to see all them back together again.  I can say the movie was a little slow at times, but did eventually pick up speed and pace.  The story was OK, but could have been better, still I gave it a 7 just for the fact that it was wrapped up nicely so we could all move on from the series.",
      "total_reactions": 0,
      "user": "horizonbts"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "Ben Stiller,intentando despedir la algo famosa trilogía de Noche en el museo,pretendía dejar huella a lo grande,pero lo único que ha conseguido es presentar un trabajo de lo más chirriante y simplón,que dejará a los espectadores con su deseo de que les devuelvan el dinero invertido en tal disparate.",
      "total_reactions": 0,
      "user": "Marchenator"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "Night at the museum : secret of the tomb is a movie which was released in 2015 in France. It was directed by Shawn Levy and written by Thomas Lennon and Robert Ben Garant. The main character is Ben Stiller who plays the night watchman. There are also character in the story we have seen in the previous films, they are played by good actors : Robin Williams is Theodore Roosevelt, Rami Malek is Ahkmenrah, the pharaon. There are new characters in this film, the parents of Ahkmenrah and Lancelot.",
      "total_reactions": 0,
      "user": "solenneparis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2016
      },
      "score": 10,
      "text": "My boi theodore looking fineeeeeee",
      "total_reactions": 0,
      "user": "Thatoneotaku"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2015
      },
      "score": 0,
      "text": "This movie sucks in every way. There is no plot what so ever.It is ridiculously immature, and it was a very,very, anticlimactic role for Robin William's. Yay evan he could not save the film. Also it is so bad I did not Finnish it.",
      "total_reactions": 0,
      "user": "Jollyjoe1000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2016
      },
      "score": 5,
      "text": "The Museum is back! Except they're going to London for a new adventure. This adventure is predictable and cheesy, but it's still a fun ride for those fans out there.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2016
      },
      "score": 1,
      "text": "I love this film franchise but this one movie from it I not good. It wasn't as funny as 1 and 2. I had no interest in it when I saw it. It was a boring movie only one funny part in it as well. If they do make a number 4 I hope it's better otherwise I will just stop watching the franchise. :(",
      "total_reactions": 0,
      "user": "Jay777"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "Definitely the weakest of trilogy but still fun. I loved going to London and seeing all the new exhibits come to life. sir Lancelot was a treat to watch and was probably one of the best character. we also get a fantastically developed back story to the tablet. This movie takes alot of inspiration for the first. For example back is the party scene at the end we get more of robin Williams as teddy Roosevelt more rexy once again because teddy Roosevelt travels with him to London. The action once again is fun and Hugh jack man makes a hilarious cameo. dick van dyke comes back after being absent in the first movie for a short but worth while scene which adds some back story to the tablet. Speaking of which when there were flashbacks to the tablet the ancient Egypt scene were effective and although they were extras no white washing. Micky roony dick van dyke and bill cobs come back briefly but it was good to see them again. Ricky Jarvais as always does great as Larry daily's sassy boss. What keeps this movie from being great are a couple of things. While not completely gone gone is mostly the smart humor Ben stiller seems more grumpy than in the previous too which i didn't like. Russel Wilson as the night guard lady was OK but not the best. Also any scene with laa was not done very well. I understand he was the comic relief but he was not very good but i see it was defiantly a character geared more toward kids. The father son relationship sub plot was completely under developed and didn't add much to the movie. However even with these flaw the movie still maintained the joy the others brought in a fantastic last performance from Robin Williams and mickey roony keeps this movie as one of the weakest yet still enjoyable and a surprisingly satisfying ending to the trilogy films",
      "total_reactions": 0,
      "user": "nahtan1244"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2016
      },
      "score": 6,
      "text": "Night at the Museum III doesn't really work with the two originals, being very obvious, not-much-funny, almost free of real tension, unremarkable characters and not much inventive story-telling. We gotta add that it's some kind of boring and even illogical.",
      "total_reactions": 0,
      "user": "Futuredirector"
    }
  ]
}