{
  "mc_avg_user_score": 5.6,
  "mc_metascore": 42,
  "mc_mixed_rating_frequency": 67,
  "mc_movie_name": "Night at the Museum: Battle of the Smithsonian",
  "mc_negative_rating_frequency": 25,
  "mc_positive_rating_frequency": 45,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "Lighten up people, It's meant to be a fun movie. That's just what people don't understand. Some movies are fun and not meant to be taken seriously.",
      "total_reactions": 5,
      "user": "ReviewCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "A much better movie than its predecessor that brings all the great stuff from the first and adds even more! With an even better story than the last one, it's going to be hard to go back to the original after viewing this!",
      "total_reactions": 1,
      "user": "DBPirate1129"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2011
      },
      "score": 4,
      "text": "Yes, any movie critic who can think deeply than others would understand \"Night at the Museum 2\" was a (obviously) unecessary sequel.",
      "total_reactions": 4,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "While not a terrible film, Night at the Museum 2 isn't as good as the original, as some much of it is wasted. Major plot points collapse with no real meaning, acting talent is wasted, and there are very few good jokes. Not the worst film ever, but it's hardly a nominee for best film ever either. South of average.",
      "total_reactions": 1,
      "user": "Susano"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "Not as good as the original because of the fact Robin Williams barely appeared in the movie. Despite that, everything else was great, especially Hank Azaria.",
      "total_reactions": 1,
      "user": "gm101"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "Not bad but quite good as well. Ben Stiller acted pretty well for the movie in my opinion.",
      "total_reactions": 1,
      "user": "MichaelD"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2012
      },
      "score": 1,
      "text": "Sometimes I wonder why I bothered watching this film again. You cannot possibly take this film seriously because this is not supposed to be serious. But neither was it fun. In fact, I don't think it had any redeeming features. There's not actually many funny jokes and as much as it tried, nothing seemed to make this look good. Stiller's performance is just forgettable - he doesn't do anything interesting - and Azaria's performance was the only mildly entertaining thing on screen despite the range of colourful historical characters available, who I don't think even did anything as I recall. The second time I watched it, I barely kept my eyes on the screen and thought about what else I could be doing instead of this. Seems like a pretty childish waste of effort.",
      "total_reactions": 2,
      "user": "EssenceOfSugar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2012
      },
      "score": 0,
      "text": "Even for Ben Stiller this is a total embarrassment. Why the hell would you want to be part of this idiotic film. Also shame on Amy Adams for completely lowering her standards for films. The movie made me sick to my stomach.",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "It may seem like an unnecessary sequel, but it is still fun. It is bigger because of being at the Smithsonian museum area, which has a lot more that comes to life.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "Better than the original. The movie decides to utilize even more effectively what made its predecessor so entertaining - exaggerated, caricatured, amusingly overblown characters that don't take themselves seriously in the slightest.",
      "total_reactions": 0,
      "user": "Aquophis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "I guess this movie works the best when you've recently seen the first \"Night at the Museum\" film. The old characters were very poorly re-introduced, if at all, and the whole idea of the museum coming to life at night was left without further explanation.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2012
      },
      "score": 4,
      "text": "I am sorry, I just don't think is a fun movie. I am not expecting a marvellous comedy, but I just don't see anything here that makes me enjoy it. Not even the performances...for couldn't even finish watching it. Good for those who enjoy it, I am happy for them, but I am not one of them...am I charitable if I give this movie a 4? ...well, but I think it may be a 4, and perhaps even a 3...",
      "total_reactions": 0,
      "user": "RegOz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "To call this movie stupid is an understatement, but there is still enough wit to it to keep it going. There are several characters that are truly enjoyable, but the poor effects and childish script hinder it.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "I really disliked this sequel. \"Night at the Museum: Battle of the Smithsonian\" is a really silly way to make a sequel. It's plot is lame, dull and predictable. Also, we know that the objects turn to life at night and we know that they turn to stone in the day. We don't need to be told a million times.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 4,
      "text": "It was funny in places but this sequel could not live up to its predecessor and like so many films before it will struggle on that basis alone. It is meant to be a family/children's film so I can't be too harsh on it. I am sure children will find it funny.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "This movie seems almost like his previous part.",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "Kind of rehashing the first movie. Luckily they do add allot of new ideas to the mix too.",
      "total_reactions": 0,
      "user": "Rox22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "Similar to the first one, but just a step worse.  Unlike the first film some of the new characters didn't work for me.  That being said still a decent watch.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2013
      },
      "score": 4,
      "text": "I actually enjoyed the first \"Night at the Museum\" movie. But after watching this one, I now know for sure that there won't be a third one. The storyline may be o.k., but when you got bad characters such as Amelia Airhart (Amy Adams) and Kamunrah (Hank Azaria), it really bums you interests on the movie. It did have it's funny moments, like the Jonah Hill and Ben Stiller scene, but most of the time, the humor was just stale and weak. I can't that this movie was just terrible, but it really wasn't good either. Overall, it's just a boring sequel.",
      "total_reactions": 0,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "Watched it recently on BD and for the first time. Just like the predecessor the movie continues with its lame jokes that simply aren't that funny. If you watch it with family members or friends you might get a laugh or two but thats about it.",
      "total_reactions": 0,
      "user": "Tessara_Vejgan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2014
      },
      "score": 4,
      "text": "Quite common to see writers squeeze as much as they can into the sequel, resulting in an over-the-top mess, that fills up the box with ideas and historical references. The jokes are more corny, the acting is stale and lifeless, and the plot becomes more convoluted than the predecessor. I would only recommend this to someone maybe five-seven years old, or a man with the mind of a five or seven year old.",
      "total_reactions": 0,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 4,
      "text": "Amy Adams puts on a rather good performance as Amelia Earhart, but that's about as far as this movie goes. The scenes and premise are pretty stupid in the sequel.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "Night at the Museum gets sleepy.",
      "total_reactions": 0,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "I was shocked seeing the ratings of this movie, Whats wrong with people these days? This movie is awesome cause It's FUN, I guess most people have forgotten what fun is,movies are made to entertain us;to make us happy,not to put us in a gloomy mood for the rest of the day.So'll I say this,ignore these people and go watch this extremely FUN movie.",
      "total_reactions": 0,
      "user": "Jedi18"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "This is a fun movie, less cinematic than the first one, but more ridiculous and on a much bigger scale of \"adventure\". I had fun watching it, but I'll admit, it's more of a kids movie and has no basic point other than wanting to entertain you.",
      "total_reactions": 0,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2016
      },
      "score": 5,
      "text": "The absolute adventurousness is starting to wear off with Battle of the Smithsonian. With Battle of the Smithsonian, it just makes the adventure look incredibly slow.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2016
      },
      "score": 9,
      "text": "A movie that beats it's predecessor. It takes everything that makes the first so great and makes it even better. More of the fantastic humor and sometimes it's even better humor than the first and new comer hank azaria brings a charming yet deliciously fun evil role to the pharaoh. Some new comers who also shine are Amy Adams as amilia earheart. The one thing i didn't like is robin Williams did not get as much screen time as i would have liked him too same goes with mizuo peck as Sacajawea. Other than that this film was a great fun and was surprised about how good it was especially at number 2.",
      "total_reactions": 0,
      "user": "nahtan1244"
    }
  ]
}