{
  "mc_avg_user_score": 8.7,
  "mc_metascore": 76,
  "mc_mixed_rating_frequency": 45,
  "mc_movie_name": "Nightcrawler",
  "mc_negative_rating_frequency": 18,
  "mc_positive_rating_frequency": 977,
  "mc_pro_critic_reviews": [
    {
      "critic": "Matt Zoller Seitz",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2014
      },
      "score": 100,
      "summary": "This is a classic film, not just because every scene and line is casually beautiful and devoid of extraneous touches, but because its tone is mercilessly exact."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2014
      },
      "score": 100,
      "summary": "Mr. Gyllenhaal’s startling portrayal is far from the only distinction in this impeccably crafted feature film. Mr. Gilroy’s directorial debut connects its hero’s tacit madness to the larger craziness of a broadcast medium that teaches vast numbers of viewers to live with a false sense of insecurity."
    },
    {
      "critic": "Dan Jolin",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2014
      },
      "score": 100,
      "summary": "Sharp, dark, satirical and bone-rattlingly thrilling, with a career-peak turn from Jake Gyllenhaal. It’s this year’s \"Drive.\""
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 100,
      "summary": "Gilroy, vastly supported by cinematographer and Los Angeles specialist Robert Elswit (Boogie Nights, Magnolia), directs with the verve of a seasoned pro, even though Nightcrawler is his debut."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 100,
      "summary": "The film plays with tension beautifully, and there are a few set pieces that I think are all-timers."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2014
      },
      "score": 95,
      "summary": "A fantastic, sleek and fun satire."
    },
    {
      "critic": "Jeff Baker",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2014
      },
      "score": 91,
      "summary": "Gyllenhaal is in almost every frame of writer-director Dan Gilroy's first feature, skinny and wide-eyed, running down a driveway with his camera or cutting across oncoming traffic in the Challenger. It's an intense performance, the flip side of Ryan Gosling's in \"Drive,\" playing the angles and filling space with empty words instead of soulful silences."
    },
    {
      "critic": "Rodrigo Perez",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 91,
      "summary": "There’s tremendous social and moral texture throughout the drama, but the socio-economic commentary of the movie is fabric, not heavy handed accessory. And the provocative ethical breaches—savage and scathing in the latter half—give the movie its delectable and wicked bite."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2014
      },
      "score": 90,
      "summary": "Nightcrawler is pulp with a purpose. A smart, engaged film powered by an altogether remarkable performance by Jake Gyllenhaal, it is melodrama grounded in a disturbing reality, an extreme scenario that is troubling because it cuts close to the bone."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2014
      },
      "score": 90,
      "summary": "Nightcrawler executes its ideas with tremendous craft and cool, and the courageous and counterintuitive pairing of its leads — Russo is 60, and Gyllenhaal 33 – produces two electrical, interlocking performances and undeniable erotic chemistry."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2014
      },
      "score": 90,
      "summary": "If you see him (Jake Gyllenhaal)onscreen in Nightcrawler, you’ll have a closeup view of one of the movie year’s most compelling sociopaths. He’s something you can’t turn away from."
    },
    {
      "critic": "William Goss",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2014
      },
      "score": 89,
      "summary": "Releasing Nightcrawler on Halloween may seem counterintuitive, but then again, when better to release a thoroughly gripping portrait of an utterly modern sociopath?"
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2014
      },
      "score": 88,
      "summary": "In his own twisted way, Lou is just as much a bloodsucker as Dracula, in a horror story that this tabloid veteran can attest is not as far removed from reality as you might assume."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2014
      },
      "score": 88,
      "summary": "Nightcrawler curves and hisses its way into your head with demonic skill. When the laughs come, they stick in your throat. This is a deliciously twisted piece of work. And Gyllenhaal, coiled and ready to spring, is scarily brilliant. He truly is a monster for our time."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2014
      },
      "score": 88,
      "summary": "Thirty pounds lighter, all cheekbones and bulging eyes, Gyllenhaal plays one of the year's most memorable characters in this dark, provocative drama."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2014
      },
      "score": 88,
      "summary": "Gilroy vividly evokes both the LA exteriors and newsroom interiors, and the action sequences are fraught with tension."
    },
    {
      "critic": "Inkoo Kang",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2014
      },
      "score": 85,
      "summary": "The dramatic weight loss Gyllenhaal endured for the role, which transforms his dreamboat looks into a bat-like mask, is startling. But the actor's performance is just as impressive, nimbly selling Gilroy's occasionally overwritten lines while Louis’ punishing optimism finds new gradations of sadism and rage. Nightcrawler is the arrival of a thrilling character actor."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2014
      },
      "score": 83,
      "summary": "In its wickedly twisted way, Nightcrawler keeps \"Network's\" battle cry alive. It's a 21st-century takedown of the media's pandering ''if it bleeds, it leads'' ethos and the ghoulish nightcrawlers who live by it."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2014
      },
      "score": 83,
      "summary": "The movie has a caffeinated spirit worthy of its graveyard shift milieu, a darkness artfully breached by cinematographer Robert Elswit, who previously framed L.A.'s unstill life in Magnolia and Boogie Nights."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2014
      },
      "score": 80,
      "summary": "A thick film of sleaze coats every frame of Nightcrawler, a movie that takes a hard look at media culture and provides Jake Gyllenhaal a terrific opportunity to creep us all out."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2014
      },
      "score": 80,
      "summary": "On the strength of Gyllenhaal's performance, Nightcrawler works best as a character study. It's chilling, but also wickedly funny and strange, like a good, dark Brian De Palma joke — in short, it's everything the stolid and humorless Gone Girl should have been."
    },
    {
      "critic": "Jamie Graham",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2014
      },
      "score": 80,
      "summary": "Gyllenhaal is sensational headlining a pitch-black satire with its finger on the pulse."
    },
    {
      "critic": "Henry Barnes",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 80,
      "summary": "From a subdued start Nightcrawler unfurls into a ghoulish and wickedly funny satire on journalism, the job market and self-help culture."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2014
      },
      "score": 75,
      "summary": "The trouble is that absolutely nothing about the movie feels like news."
    },
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2014
      },
      "score": 75,
      "summary": "Yet, despite a mesmerizing performance by Gyllenhaal - he's as transfixing as a cobra in a snake charmer's dance - and a terrific turn by Riz Ahmed as an unskilled homeless kid Louis hires as his assistant, Nightcrawler doesn't quite have the satirical smarts that made \"Network\" a classic."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2014
      },
      "score": 75,
      "summary": "The most notable element of screenwriter Dan Gilroy's debut feature is the performance he elicits from Jake Gyllenhaal. In the tradition of Brando, Bale, Theron, and others, Gyllenhaal undergoes a radical physical transformation to play the part of Louis Bloom."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2014
      },
      "score": 75,
      "summary": "Nightcrawler is about TV news-video parasites, but the freakiest thing in it — the biggest bedbug of all — is Jake Gyllenhaal as the movie’s hero, Lou Bloom."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2014
      },
      "score": 75,
      "summary": "The film has a sulfuric, Dostoyevskian quality — and sick sense of humor — that captures the muted aquarium that Los Angeles becomes at night, a spell that’s broken once plot overtakes mood."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2014
      },
      "score": 75,
      "summary": "There are moments that are too macabre and outlandish, but Gilroy steers the movie just this side of farce, just this side of Chayefsky, and keeps it all within a realistic framework. At times watching, you might wonder how he’ll keep the story going, how he’ll top himself. But he does."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2014
      },
      "score": 75,
      "summary": "Despite the familiarity of its themes — the bottom-feeding news media; the pathology born of extreme isolation and a little too much online time; the American can-do spirit, perverted into something poisonous — Gilroy's clever, skeezy little noir is worth a prowl."
    },
    {
      "critic": "Mike D'Angelo",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2014
      },
      "score": 75,
      "summary": "Nightcrawler is a portrait of an amoral opportunist who stumbles upon his horrible calling, and the film’s chief pleasure is watching Gyllenhaal portray what it might be like if Rushmore’s Max Fischer grew up to become Chuck Tatum, the unscrupulous reporter played by Kirk Douglas in Billy Wilder’s scabrous Ace In The Hole. It’s adolescent solipsism gone grotesquely rancid."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2014
      },
      "score": 75,
      "summary": "It keeps you creeped out and fascinated."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2014
      },
      "score": 75,
      "summary": "Rene Russo is spot-on as Nina, an aging TV news director who is the only person Bloom will sell his footage to."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2014
      },
      "score": 70,
      "summary": "There’s a scolding tone to Nightcrawler that runs counter to its pulp energy, as if Gilroy is telling the audience to be alarmed by the things that turn them on. But much as Gilroy tries to be his own killjoy, Gyllenhaal’s wickedness prevails."
    },
    {
      "critic": "Anthony Lane",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2014
      },
      "score": 70,
      "summary": "Nightcrawler has patches of clunkiness, to be sure, and Lou’s face-off at a police station, near the end, feels graceless and unnecessary. Yet the movie is quite something, and, despite its title, it doesn’t really crawl."
    },
    {
      "critic": "Jordan Mintzer",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 70,
      "summary": "Like his erratic protagonist, Gilroy doesn’t always know when to settle down or call it quits, and the film’s constant shifts of tone can grow tiring, even if the action as a whole never gets boring."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2014
      },
      "score": 63,
      "summary": "It’s a brilliant performance by Gyllenhaal in a film that veers from dark satire to tense crime thriller before the tires come off near the end, leaving the entire vehicle just short of worth recommending."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2014
      },
      "score": 63,
      "summary": "Dan Gilroy's directorial debut only offers a familiar vision of today's newsman and producers as misery peddlers, and callow ratings slaves bordering on the monstrous."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2014
      },
      "score": 60,
      "summary": "Nightcrawler is a slick and shallow movie desperate, like Lou himself, to be something more."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2014
      },
      "score": 60,
      "summary": "It’s a pleasure to see Russo back on screen (she’s married to Gilroy). But Nina’s eager complicity is far too easy and every social critique flashes as bright as the neon guiding Lou around back-alley L.A."
    },
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 60,
      "summary": "The film’s a satirical thriller, which is a novel enough entity in itself these days; it has a pungent, can’t-miss-the-point premise, and a big, weird, sharkish performance from Jake Gyllenhaal powering it up. It’s a must-see and a must-talk-about film, electrically overblown in the moment, if not wholly in control of its pay-off."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2014
      },
      "score": 58,
      "summary": "By turning the loner Louis into a nutcase – if he blinked at all during the movie, I missed it – the movie becomes a species of horror film."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 50,
      "summary": "Touches of apocalyptic comedy run throughout Nightcrawler, but the movie’s overriding tone is one of strident, finger-wagging self-seriousness."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2014
      },
      "score": 40,
      "summary": "Nightcrawler, like its entrepreneurial-to-a-fault protagonist, is ambitious but ultimately hollow, eager to dazzle and shock us but reluctant to let us inside."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2014
      },
      "score": 40,
      "summary": "After a few minutes you know everything about Louis you’re going to know; the only surprise in Nightcrawler is the level of grotesqueness it achieves. There’s more insight (and entertainment) in an average sketch from the old SCTV series; I kept imagining Joe Flaherty’s horror host Count Floyd climbing out of his coffin and chanting, “Oooh, that Louis, he’s veh-ry skerrrr-y, kiddies — ahwoooooooo!”"
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 6,
      "pos_reactions": 26,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "Nightcrawler is a modern achievement.",
      "total_reactions": 32,
      "user": "exmordis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "This film is the probably the best thing you'll ever have. Its pretty much lord of the rings mixed with megaman mixed with interstellar, all mixed in with a sprinkle of N-methyl D-aspartate antagonists. You will feel like someone has inflated your scrotum after watching this. Its awesome.",
      "total_reactions": 3,
      "user": "Unladenswallow0"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "Suspension of disbelief should be an advisory caution when viewing 'Nightcrawler'. However, as long as one can over look the story's obvious absurdities it can be enjoyed as a compelling and superior thriller.",
      "total_reactions": 2,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "Nightcrawler is a masterpiece. With scenes that would leave you breathless and nervous. The intensity in this movie is big. It would leave you in the edge of your seat. It's easily the best movie so far (That I have seen) And of course it's in my Top 10.",
      "total_reactions": 2,
      "user": "DavidV293"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "Lou Bloom: \"Steady hands, steady hands\".",
      "total_reactions": 2,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "What a fantastic film, there were so many moments where I expected things to happen, only to be surprised that there were no clichés and many moments where you can predict what was going to happen; making the film even more exciting.",
      "total_reactions": 1,
      "user": "Dalek"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2015
      },
      "score": 4,
      "text": "the opening shots had me expecting a lot more from this movie. while gyllenhaal is good, his character doesn't creep out the way i would've expected. his literalness is blackly funny, but works against his turning into an immoral slimeball. didn't buy his power plays over nina. i liked the movie. don't know why it's getting so many glowing user reviews.",
      "total_reactions": 1,
      "user": "ariel84"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "In 2012, Aaron Sorkin piloted a television program that educated, informed and entertained by nit-picking the issues of modern day television broadcasting, information distribution and most of all, societal perception. Luckily, I was able to stumble upon a clip of the opening monologue of the show via YouTube, which was recommendation by a friend. The monologue, delivered by Will McAvoy, played by the audacious Jeff Daniels, is single handedly, one of the greatest monologues in television history, describing the issues with contemporary American politics, government, its people and most of all, the media. Approaching its third (and final) season, The Newsroom has proved to be a champion of debunking the public’s predictive perspective of hyped up terror scares, exploitation news broadcasting and television, as well as ginned up controversy.",
      "total_reactions": 1,
      "user": "NightReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2015
      },
      "score": 10,
      "text": "Jake Gyllenhaal is a Basilisk in this film. He is a Basilisk in a suit and tie and with a sickly cold smile on his face. This is genuinely a masterpiece. How crafted and well thought out this is for an idea, the quirks of the characters and the instant establishment of juxtapositions between Rick and Lou is phenomenal. A great achievement in cinema history and surely one of the greatest films I've ever seen.",
      "total_reactions": 1,
      "user": "TrilobiteG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "I didn't think too much of Nightcrawler, especially after the shower of positive reviews it has gotten, ranging from comparisons with Taxi Driver to praises to the extraordinary acting (by Jake Gullenhaal). I honestly disagree with both these examples, in that Nightcrawler doesn't feel at all like Taxi Driver, and Gyllenhaal, although certainly very good, is not \"extraordinary\".",
      "total_reactions": 1,
      "user": "nicholasbert"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "This is an absolutely fantastic character study with great directing and a brilliant performance from Jake Gyllenhaal. I've watched this film several times and always feel emotionally effected and moved by its powerful and wonderfully designed character.",
      "total_reactions": 1,
      "user": "BobCat51"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Not the masterwork it wants to be but huge credit for trying and almost getting there. The film suffers from an uneven voice and bad pacing which all could have been corrected by an expert editor. NIGHTCRAWLER needs an objective eye to whip it into shape. But enough of the negative. So much is so good and the film is full of surprises from the performances to its depiction of LA. Incidentally, about 90% of this film is shot like 50 feet from our house. I can only think of one other film that captured the \"real\" LA so closely and that is THE MORNING AFTER. This is the real LA. Not the reel LA. I don't want to give it away but I so appreciate that the sleaze factor is kept in check and actually feels like the real world rather than an over amped sizzle reel. Jake Gyllenhaal is very good but doesn't totally or intrinsically inhabit his character. He's a guy that's weird and scary but not so scary that you'd run away from him which is good but you see Gyllenhaal's wheels turning which is not so good.",
      "total_reactions": 1,
      "user": "LowbrowCinema"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "“Nightcrawler\" is an intense and riveting thriller, with a neo-noir style and and some dark social commentary of today's news media. Death and destruction becomes headlines, \"each police siren wail equals a possible windfall, and victims\" are merely \"dollars and cents\" in the film \"Nightcrawler\".",
      "total_reactions": 1,
      "user": "AGarcia732"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "Entertaining and different.   Jake Gyllenhall plays a sociopathic denizen of Los Angeles eking out an existence by stealing and pawning scrap materials.  We learn early on that he has no qualms about using violence, if necessary, to accomplish his goals.  He likes to talk and he frequently tries to convince people that he’s a successful business man, a mover and shaker, who’s moving up in the world.  But, he’s more than unconvincing, and when he talks people look at him as though he were Dustin Hoffman in Rain Man.  He’s a mimic, without a moral compass.  He tries to parrot the words and actions of those around him, and he’s a quick learner.  Rene Russo plays an aging TV news director working the night shift at the lowest rated TV station in LA.  Gyllenhall learns that she will pay cash money for video footage of car crashes and other dirty laundry, if he can get it to her first.  Bill Paxton is Gyllenhalls’ competition.  Gyllenhall wants more than just a job, he wants it all, and as man without a conscious he’ll do anything to get it.",
      "total_reactions": 1,
      "user": "Axgrinder"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "A dark and entertaining flick that provides an insight into an unthought of world that is elevated by a magnetic performance from Jake Gyllenhaal, giving what may be the performance of his career.",
      "total_reactions": 1,
      "user": "El_Jacko"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "The creep factor in Nightcrawler is off the scale. Jake Gyllenhaal is awesome. This film could have been written by Stephen King. Especially the main character, he's very Stephen Kingesque. The tension is palpable and the slow escalation gives a real feeling of menace. A must watch!",
      "total_reactions": 1,
      "user": "ozymandias79"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "Great sociopathic fun!",
      "total_reactions": 1,
      "user": "tvnewsguido"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "Deeply engrossing performance by Gyllenhaal that is highlighted and enriched by Russo's supporting bits. Thematically I'd compare this to Gone Girl, but in its execution, insight and dynamics is a million times better.",
      "total_reactions": 1,
      "user": "benutty"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "Nightcrawler breaks the barrier between suspenseful and twisted, and that's just why I thought it was amazing. It has to be one of the greatest Jake Gyllenhal performances and one of the greatest films of 2014!",
      "total_reactions": 1,
      "user": "TotallyEpicHD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "\"Nightcrawler\" is defined, to the average viewer, by Jake Gyllenhaal (playing Louis Bloom) who's performance was, to me, outstanding. He said in a recent interview in regards to the film \"I don't think this experience will every completely go away\" and I would be surprised if it left him that easily. Gyllenhaal builds an extremely complex character, reminiscent of Heath Ledger's portrayal of The Joker in \"The Dark Knight\" in some ways. This performance is one of the best of the year and his character should be viewed as one of those that I am lucky enough to have seen on the big screen. Like Gylllenhaal I don't think that, for me, \"this experience will every go away.\"",
      "total_reactions": 1,
      "user": "TheRocksBarney"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "this was a very interesting movie, gyllenhaal gives a great performance and shows you his range of acting , to the people that give negative reviews such as complaining about how the movie was predictable, i dont even understand what you mean by that i mean given the previews alone ok we can decipher that he is going to be filming late breaking news involving crime scenes and police chases but that hardly makes the movie predictable it still keeps your interest throughout, the only thing i found to be questionable would be the idea that a local news station would ever show the level of graphic footage he provided them with , i cant imagine that happening in the real world",
      "total_reactions": 1,
      "user": "member23"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "from the second the movie took off you could feel the disturbing thrill ride you were about to be engulfed into. I was enthralled with interest to who Lou Bloom was. Jake Gyllenhaal was about as creepy that you could get. When i say creepy it’s a good creepy, that keeps you interested and locked to the screen. The dark ruthlessness that Gyllenhaal displays throughout the film was proof of his strong determination to be the best and most successful in his business. by the end you are 100% sure that you know that Lou Bloom is one messed up mother **** who knew that a movie about a freelance cameraman could be so brilliantly put together.",
      "total_reactions": 1,
      "user": "shufflesnuffle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "Penned and directed by Dan Gilroy, a first time director, though known for the scripts of “Real Steel” and “The Bourne Legacy”, “Nightcrawler” delivers one of the best cinematic surprises of the year, mostly due to its chameleonic star, Jake Gyllenhaal.",
      "total_reactions": 1,
      "user": "Ronin810"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "Jake Gyllenhaal makes this movie. It's worth watching just for this performance. He plays a sociopath who is a master manipulator and liar who's decided to troll for blood and guts to sell to the local news. Many unexpected plot twists make for a very deep and interesting movie.",
      "total_reactions": 1,
      "user": "kriebelr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Great movie, very interesting to watch. What a amazing movie Nightcrawler is! Great acting from every cast member.It's hard to believe Nightcrawler was made by first time director Dan Gilroy, because what a movie this is.",
      "total_reactions": 1,
      "user": "hayashi1229"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "A dark and nightmarish rags to riches story, set in the city of angels LA in a stylish neo-noir setting.",
      "total_reactions": 1,
      "user": "VinceRocks123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2015
      },
      "score": 7,
      "text": "After seeing this movie I thought to myself its gonna be a instant classic. though its most faved by older viewers. When I went to the theatre it was filled with older men and older women. Jake Gyllenhaal's best movie since prisoners.",
      "total_reactions": 1,
      "user": "cliftonrain"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "It's hard to believe Nightcrawler was made by first time director Dan Gilroy, because what a movie this is. It's appropriately seedy and eerie; Jake Gyllenhaal gives one of his best performances of his career; and the tone is dead-on accurate in every scene no matter what s happening. The characters are all round and realistic, and the cinematography to die for. If these things don't do it for you, it'll be the pure atmospheric tension of the movie that keeps it going along, scene by scene, building up for a climactic final third. This is one of the best films of the year.",
      "total_reactions": 5,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "When a movie manages to make you forget that you're watching as famous an actor as Jake Gyllenhaal because you're totally engrossed by the character he's portraying, you know you're viewing something special. Nightcrawler is a character study, a look into the mind of an already established psychopath as he delves deeper and deeper to the point of no return. You follow Lou Bloom, a man who goes from one payout to the next in a variety of illegal ways, until one night he discovers he has an unmatched talent for Nichtcrawling, which is the filming of crime scenes and violent acts for the seedy underworld of the late night news. Bloom becomes so obsessed with capturing the best possible crime on camera and goes to unspeakable lengths to achieve his goal.",
      "total_reactions": 4,
      "user": "QwertyPJM"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "Nightcrawler is for sure one of the best film of the year no doubt about that and its another great acting performance by Jake Gyllenhaal proving once again that he is one of the best actors in the industry. The film opens up with Jake Gyllenhaal's character \"Louis Bloom\" steeling some chain-link fence when a cop roles up but when questioning the cop he learns that he is just a private security guard and proceeds on beating him up and stealing his valuable watch. While driving home after trying the sell the fence and a few other things to a scrapyard Louis stumbles upon a wreckage on the highway and notices two guys filming cops trying to save a woman from a burning car and by the look on his face you can just see him fall in love it. From here we see Louis go from a no name guy with a cheap camcorder recording graphic news stories to one of the best in the game with his own company, a new ride with tons of high-tech equipment, and a assistant. All is not so great though and we see just the lengths Louis will go to become the best in the business even if that means lying to the police. The ending had such a great build up and fully delivered i was on the edge of my seat for about the last 15-20 minutes of the film.",
      "total_reactions": 4,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Dan Gilroy's debut flick is everything what it needs to be – a perfect reflection of his superb writing. His direction is subtle. Editing is just brilliant. The plot flows in a perfect rhythm through the head of a messed up guy Louis Bloom, who takes you on a high speed ride behind an exquisite red muscle to shoot stories up close.",
      "total_reactions": 4,
      "user": "Scottshak"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Jake Gyllenhaal delivers the performance of a life time, as a creepy, unsettling character who dives into the world of news broadcasting, and goes into some dark places. Nightcrawler is all about the characters, everyone delivers amazing performances with dialogue that felt real. You can sort of tell where the movie is going, but it takes a slight turn, and goes into a different direction you werent expecting, and keeps you on the edge of your seat for the whole runtime of the movie. It is also visually sleek, great job by this movie's director and cinematographer. My only problem with the movie is, at least for me, the ending was a bit anti-climatic, and I was expecting something more out of the ending. That being said, Nightcrawler is a  great thriller, and one of the best movies of the year, who knows, maybe in a couple of years this movie will be considered the new American Psycho.",
      "total_reactions": 4,
      "user": "felix99gomez"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "Just an amazing movie, with a haunting and pulse pounding tone, it has an eerie vibe that always keeps you alert and one he edge of your seat, it has a down right creepy performance by jake ghylanhal and great performances from the rest of the cast, it is a truly an amazing, once and a life time movie theater experience.",
      "total_reactions": 4,
      "user": "LucasGilbert"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "Jake Gyllenhaal perfects his psychopathic role through 2 hours of insensitive, unemotional dictatorship which results in a film packed full of tension, surprises and an eary discomfort bound to keep you hooked throughout the entire movie.",
      "total_reactions": 7,
      "user": "harrybuckley"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "This is a knockout--the intensity is sustained through brilliant writing, remarkable acting, and stunning camera work.  What it suggests about contemporary media and technology is scary.  The most remarkable element, however, is Jake Gyllenhall--the contrast between his Medici prince face and his amoral, sociopathic ambition is overwhelming and should make him an early favorite for an Oscar.",
      "total_reactions": 6,
      "user": "amboy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Attack of the evil Sheldon Cooper could be a good secondary title for this movie.  Gyllenhaal is hyper creepy and disturbing as the immoral news video gatherer.  He's utterly convincing.  I felt a sort of weird pity for him at first, but this was all washed away once it became clear just how twisted the character really was.  Nightcrawler is a very exciting movie, full of intense action scenes.  It's also a very stylish looking film.  It uses neon and shadows in much of the way Drive did, but not quite to that movie's vibrant extant.  There are some surprising turns, the story is involving, and the satire is sharp, but I also felt that in the end it didn't have enough weight to it.  It's memorable, but something about it is fairly distant, and unattainable.  You'd never guess that it's a small budget indie film though.  It has all the polish of a major Hollywood blockbuster.  I wouldn't be shocked if it ended up with a couple Oscar nominations, even in some of the major categories.",
      "total_reactions": 6,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "It is hard for me to say that I “liked” Nightcrawler. Or that I liked Lou Bloom. As someone suggested at dinner afterwards, he may be a sociopath like Charles Manson or Hannibal Lecter, but at least Hannibal Lecter had a sense of humor and so some self-knowledge. Jake Gyllenhaal gives an Oscar-worthy performance and is always in character and completely convincing. The analogy to Manson may be apt since Manson supposedly (and ironically) got his start in manipulation by reading Dale Carnegie’s classic  book “How to Win Friends and Influence People.” Bloom has taken business courses online and learned only to be ruthless. He also reminded me of Bartleby the Scrivener in that his own desires and will came before anyone else’s. Nightcrawler is a fascinating film, and I wasn’t bored for a second, watching the diabolical Bloom become a \"success\" in the amoral world of sensational broadcast journalism where ratings are the only thing that count – a world worthy of Bloom’s cold and clinical view of life.",
      "total_reactions": 6,
      "user": "GinaK"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "A slick, satisfying L.A.-set noir, Nightcrawler features Jake Gyllenhaal's most accomplished performance, and it's surrounded by lush cinematography, sharp writing, and a great sense of direction.",
      "total_reactions": 3,
      "user": "SimpleMethod"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "NIGHTCRAWLER – JUST WOW – WHAT A MOVIE. Jake Gyllenhaal is my pick for Best Male Actor Oscar this year and the movie deserves a nomination, as does first time director, Dan Gilroy. In the words of Lou Bloom “A friend is a gift you give yourself” – this movie is your friend!",
      "total_reactions": 3,
      "user": "SaltyPopcorn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "Great movie, spectacular visual of the City of Angels. Exellent direction by Dan Gilroy  and fabulous, crazy performance by Jake Gyllenhaal...Rene Russo is fantastic here.",
      "total_reactions": 3,
      "user": "marlasinger1999"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "I had no idea what to expect going into this movie but Gyllenhaal sucked me in fro the get go.  His Aspergers character is unlike anything depicted in cinema so far, showing a willingness to video victims as they die live on camera.  It is an indictiment on the gory lengths \"stringer\" cameramen will go to get a scoop in today's tabloid TV (and print) news culture.  Everyone is expendable in order to get a scoop.",
      "total_reactions": 3,
      "user": "infin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "Nightcrawler is a dark, thought-provoking drama that is certainly not everyone’s cup of tea. The tension is built beautifully through the film’s soundtrack, dialogue and characters, particularly Lou Bloom who is an instant classic anti-hero that falls into the ranks of Norman Bates and Verbal Kint. Although the film’s ending was anti-climactic, the overall story is a psychological thrill ride worth going to see. If it bleeds, it leads and Lou Bloom will always find a way to get the story first.",
      "total_reactions": 3,
      "user": "TheFilmFanatic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "This is a terrific film that explores the length someone will go to be the best and most cutting edge.  Jake Gyllenhaal gives a chilling performance as a driven yet psychotic man who will stop it nothing to get what he wants.  It's also good to see Rene Russo and Bill Paxton in strong supporting roles.  Nightcrawler gets a high recommendation from me.  A",
      "total_reactions": 8,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "Nightcrawler is an amazing film with an amazing performance of Jake Gyllenhaal and the incredible power of thriller-comedy-drama. I think it's incredible.",
      "total_reactions": 8,
      "user": "ismacinefilo"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "Really enjoyed this movie, it's been a while since I've been hooked into a movie. I agree with some people on here, you almost know what's going to happen, but it doesn't matter because you get so into it. There are some good twists and turns, and the end is great. I highly suggest seeing this movie.",
      "total_reactions": 8,
      "user": "JKA_92"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "The title refers to camera crews who troll the dark hours, listening for police calls and rushing to bloody crime scenes in hopes of selling their footage to TV stations. Jake Gyllenhaal plays a fast-talking, self-confident new entrant into the field, who's determination for success crosses the line between objective observer and dangerous participant. His character is a smart, but not saavy charmer without a conscience and Gyllenhaal makes him fascinating with masterful skill. The film is disturbing and ultimately, suspenseful as we watch him get deeper into success.",
      "total_reactions": 5,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "I thought this action thriller was well directed leaving the audience at the edge of their seat. Not since 'No Country for Old men' was an action drama so intense. In a real world with tangible and realistic events instead of make believe. Finally a director gave us a unique approach at newsroom entertainment in today's 'I want it now mentality'. Jake Gyllenhaal was memorizing and Rene Russo was at her best giving us an insight of newsroom activity and what today's hot stories and how they are portrayed along at what costs News-directors are willing to pay to have them revealed. Thumbs up on this one!!!!",
      "total_reactions": 5,
      "user": "COOP4514"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "Jake proves himself a very talented and promising  actor once again and not just a pretty face with his performance in this film. The story is great, cinematography is cool and a stellar cast throughout this thriller. Overall a great film in general hope to see some more dramatic takes for Jake though.",
      "total_reactions": 5,
      "user": "bigusdicus1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "What a amazing movie Nightcrawler is! Great acting from every cast member, with Gyllenhaal being the stand out. The feel of the movie is very dark and disturbingly interesting every moment of the way. I would totally recommend this to anyone.  10/10",
      "total_reactions": 5,
      "user": "MouseyV"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Serving as a harrowing cautionary tale and one of the most uncomfortable viewing experiences I've had in a while -- thanks in no small part to Jake Gyllenhaal's uncompromisingly disquieting Oscar-worthy performance -- \"Nightcrawler\" forcefully assumes its role as one of the most impressive writer-director debuts this side of his brother's \"Michael Clayton.\"",
      "total_reactions": 8,
      "user": "Compi24"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "Jake Gyllenhaal delivers a terrifically chilling performance in this mesmerizing tale of freelance journalism, Lou Bloom is like a descendant of Robert De Niro's Travis Bickle from Taxi Driver. Nightcrawler functions very effectively as a noir thriller with the city night also being a beautiful sight to see.",
      "total_reactions": 6,
      "user": "NotoriousFraud"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "\"Nightcrawler\" stars Jake Gyllenhaal, Rene Russo and Bill Paxton in a film written and directed by Dan Gilroy. Although opening on or about Halloween eve, and with a suggestive title lending itself to that ritual, the film is actually the story of those vulture-like papparazzi who, instead of following celebs in innocent daily real life situations, seek to capture the tragedies and \"breaking news\" stories that besiege our evening news each night. In the mid 20th Century, these photo journalists would freelance and sell their wares to the highest newspaper bidder. Now, in the era of television and video and digital photography, the suppliers become video camera operators and the bidders are the news directors of local tv stations.",
      "total_reactions": 4,
      "user": "BHBarry"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "I have seen a lot of movies in 2014 and I will tell you that Nightcrawler is the absolute best movie I’ve seen all year. We are featured an outstanding film with an unforgettable performance Jake Gyllenhaal.",
      "total_reactions": 4,
      "user": "Movi3R3vi3wer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "This film did not work for me. I found Jake's character to be more like a pushy, immature teenager than a sociopath. He annoyed me rather than disturbed me. They should have found more time for his private relationship with Renee Russo..She was a more interesting character than him.  You knew how the big finale was going to occur and end up but they made it so implausible that it made me laugh not take it serious. A serious letdown.",
      "total_reactions": 2,
      "user": "JamesL"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "A cinema-going to continually witness Jake Gyllenhaal’s unstoppable resurgence to be the most versatile and ardent actor among his peers. After last year’s one-two punch PRISONERS (2013, 8/10) and ENEMY (2013, 8/10), NIGHTCRAWLER is screenwriter Dan Gilroy’s director debut, set in L.A., the title refers to hired hands who usually drift at night, as soon as any accident or crime happens, they will rush to the scene and take lurid photos and videos, then sell them to the local media for highest bid. Gyllenhaal’s Louis Bloom is one of them, he is so good at it and professes that he is born to do this job, what’s more chilling is that he is a callous sociopath with no moral boundary, even more shockingly is the society not only condones him, but encourages and rewards him bountifully.",
      "total_reactions": 2,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "One of this year's sharpest and most poignant films, Nightcrawler intensely thrills with clever direction from newcomer Dan Gilroy and a terrifying sociopathic portrayal from Jake Gyllenhaal. You won't know what hit you.",
      "total_reactions": 2,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "An uncharacteristically intelligent thrill ride exploring the newfound career path of Louis Bloom, an ambitious and manipulative sociopath played by Jake Gyllenhaal who immerses himself in the L.A. crime scene in the hope of capturing graphic footage he can sell to news stations for considerable profit. The film is bolstered by Gyllenhaal's performance which is electrifying, unpredictable and extraordinary. I'm holding out hope for an Oscar nomination, even if his superb work in recent years (i.e. Zodiac, Prisoners) has gone unrecognised by the Academy. His work here is more than deserving to buck the trend - I was left hanging on every word that came out of his mouth, dripping in guile and insanity. He's backed up by a strong supporting cast. Rene Russo stands out as the station manager who becomes Louis's biggest client for his footage. Her work is similarly Oscar-calibre and she shows her character's insecurities and vulnerabilities with subtlety and grace, doing a particularly good job of showing simultaneously the shock at Louis's moral decline and her dependence at the rejuvenation his footage is giving her career. Dan Gilroy's alternately disturbing and exciting and surprisingly funny (in parts) script deftly handles its character's amorality and the exploration of the way media and crime are becoming closely intertwined.",
      "total_reactions": 2,
      "user": "googolendtimes"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Really good film. Great characters, acting is on point. The only issue would be with the overall story and sometimes wonder the logic of how realistic it is for a guy with a camera to capture such graphic footage and a local news station to actually show it. Ending was okay but could of been a bit better. Jake for sure should get the Oscar nod for this.",
      "total_reactions": 2,
      "user": "Dalifeblives"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "Was very disappointed with this given the hype, the story line is poor and not very interesting. Lacks any suspense or twist that it needed and is very predictable.",
      "total_reactions": 2,
      "user": "Wexford_C"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "THE best film I've seen in years.  Honest in its abrasive satire.  Can you believe we mythologize CEOs?  They are some of the sickest mofos ever.  Jake's performance is the best he's done.  He's never looked uglier, physically or as a character, but he's never been more charismatic, either.",
      "total_reactions": 2,
      "user": "josephkokomo"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "There's no doubting that the movie is good, but you just don't feel great leaving the thing - not that every movie needs to have a \"feel good\" quality to it.  But this lead character is creepy as hell, sociopathic, and just  plain antisocial. It's never a movie you'd want to see twice.  Gyllenhaal is great in it, of course, and it's cool seeing all the RL LA anchors involved - certainly provides a degree of authenticity to it all.",
      "total_reactions": 5,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "This is a movie about a bad person doing bad things for bad reasons. Definitely a movie I didn't need to see because I know how close to the truth this movie is about people's morals. It was well written, well acted and thank goodness for the characters who had a conscience, as I was squirmed watching this lack of moral conduct.",
      "total_reactions": 8,
      "user": "ledaumas"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "A young unscrupulous and ruthless guy with criminal tendencies dreams of becoming a Nightcrawler: to film crime scenes for local TV channels. And he manages to become one using whatever it takes.",
      "total_reactions": 3,
      "user": "netflic"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "Phony, uneven, boring, and the wrong tone.  Utterly predictable.",
      "total_reactions": 14,
      "user": "AxeT"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "Good premise and some worthwhile momentsscenes. A great car chase (and I don't even like car chases...this one you want to see on the big screen.)",
      "total_reactions": 7,
      "user": "Edeltraud"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "Very creepy movie. Jake Gyllenhaal is outstanding and Rene Russo is very good too. But the movie itself was a tad on the slow side and took forever to kick into gear. And even when it did pick up its pace, it was a little too predictable for my liking.",
      "total_reactions": 4,
      "user": "alangee"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "Jake Gyllenhaal stars as a sociopathic version of Sheldon Cooper in a movie that somehow manages to be neither interesting or boring. Nightcrawler is a film with a linear plot (which is pretty much given away in the first scene) that is populated by characters that you won't care about. This is one of those films that can be experienced in its entirety by watching the trailer.",
      "total_reactions": 4,
      "user": "Zimbardo"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2014
      },
      "score": 7,
      "text": "In this fun and exciting crime thriller, Jake Gyllenhaal plays a motivated crime journalist hired by a TV station to document crime scenes and murders. The result is easily yet another tour de force lead performance from him. His acting along with the great action and car chase scenes throughout made for an overall entertaining experience. Despite some slow moments, they're easily made up for through the film's brilliant acting and writing, as well as an intriguing story with great action. Definitely check this one out if you're a fan of Gyllenhaal or if you just flat out want to see one hell of a cool movie!",
      "total_reactions": 4,
      "user": "moviemitch96"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "Well this is Jake Gyllenhaal's acting baby and he does a great job. I think that he should get an Oscar nomination for creating a new narcissistic creepy negotiator but not win the award. That character I found extremely interesting for the first quarter of this movie and as the film goes on it grew increasingly predictable. Most the supporting cast are cookie cutter characters and add little other than to give the lead something to push against. The people following up on his tail are about as qualified as some keystone cops. Most of all I must apologize because I just was not buying it. The whole thing. the suspension of belief for this film just left me in the dust. I am not even in the law enforcement or news industries and I can tell you this guy would not be walking the streets if this had anything to do with any kind of reality. The police scanners he uses were out of date back in the 1980's. The whole movie might of made a good Law And Order episode. Unfortunately it is stretched out to a full length film.",
      "total_reactions": 7,
      "user": "analogkid280"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "Ok well I went to see this movie not really knowing for. Sure exactly what it was really and I must say I only watched about half an hour of this movie before I got a ticket to see big hero 6 instead this movie was wayyyyyyy too slow paced not like the trailer at all it might have gotten better but I wasn't giving it any more of my very valuable time sorry if you liked it and are offended by this review but my god \"move already \"like I Sayed very slow my personal thoughts",
      "total_reactions": 7,
      "user": "chrismovieguy"
    },
    {
      "neg_reactions": 61,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2014
      },
      "score": 1,
      "text": "Major Disappointment! Predictable to the point of no return. If you know what is going to happen throughout the movie, what fun or enjoyment can anyone get from that?",
      "total_reactions": 67,
      "user": "bigfoot6463"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2015
      },
      "score": 4,
      "text": "There was a huge buzz on the internet about this film, because of Jake Gyllenhaal's outstanding performance, but a great performance doesn't always make for a great film. Louis Bloom (Gyllenhaal) is down on his luck, he drives an old car, lives in an disgusting apartment, and doesn't have a job. He drives around at night looking for ways to earn money, when he comes across a film crew taping a crime scene. It seems like easy money, so Bloom goes out, gets a camera, and starts filming the police himself, only, he doesn't follow the same rules that the others do. I will not dispute that Gyllenhaal was terrific, but his character was beyond annoying. Louis Bloom is this O.C.D. guy, who is constantly rambling and talking to himself, something that basically ruins the whole film. This guy gets so annoying it's to the point of frustrating. On top of that, it takes a long time for anything substantial to happen. I was really looking forward to seeing this film and was impressed by how far Jake Gyllenhaal has come, but despite it's looming cult classic label, I found this film to just be one frustrating scene after another. Critics are willing to give films like this four stars and tell you it's a must see, because of an Oscar worthy performance, but what's really the point of seeing something that most people aren't going to want to sit through? Similar to Citizen Kane, it's got a great reputation, but don't let that fool you, this is one of the most nerve racking films I've ever sat through and to be honest, I'm sorry I did.",
      "total_reactions": 1,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "Wow..... Just.... Wow.. I watch a lot of movies. This movie is by far the best movie I have seen this year and is certainly in my all-time top 10 list. Jake Gyllenhaal's performance was masterful.",
      "total_reactions": 1,
      "user": "Fishersam"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "Nightcrawler, what a dark, creepy movie! Jake Gyllenhaal plays a role that most actors would dream about. One of the creepiest and weirdest and down right evil roles that I have ever seen. I can honestly say that Gyllenhaal makes you hate him in this movie. He pissed me off so much but I think that was what he was supposed to do in this movie. He was robbed of an Oscar nomination, and I'm not the first who has said that. If you enjoy superior acting then this is certainly a movie you should watch.",
      "total_reactions": 1,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "Well what an experience this flick proved to be!",
      "total_reactions": 1,
      "user": "seventhseal"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "This movie rocks, or in modern vernacular \"it's sick\".",
      "total_reactions": 1,
      "user": "raybies"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "Great movie.  With some bloody scenes, it touches slightly horror.",
      "total_reactions": 1,
      "user": "markvantpark"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "Jake Gyllenhaal **** nails the role of a sociopath manipulating his way to the top of a lucrative underworld business. Fantastic casting, filming, and dialogue make this unique and gritty story a vivid experience. Scenes transition effortlessly and efficiently bringing the plot to a engaging and intense climax that finishes on a bittersweet and ominous ending. The film stands out stylistically, and it's wonderful and horrifying to see Gyllenhaal's character evolve subtly over the course of the film.",
      "total_reactions": 1,
      "user": "DontBeSalty"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "Two intoxicated old newsmen, a producer and the anchorman he just fired, in Network, nurse their last drinks at the bar, commiserating over the slipping standards of broadcast journalism. As a riposte to Howard Beale's avowal of an on-air suicide, in jest, the UBS news division head envisions The Death Hour, a weekly series whose content is wholly violent, wholly sensational. \"Suicides, assassinations, automobile smashups,\" Max jokingly brainstorms, never dreaming that his drunken ramblings outlining a telecast of blood-soaked spectacle would one day turn out to be an uncanny bit of prophetic extrapolation, a bar-lowering that allows somebody like Louis Bloom, a freelancing videographer, to be an invaluable media cog. Louis' bosses are death merchants, ratings-driven professionals who fulfill the UBS producer's longago pitch for a \"great Sunday night show for the whole family.\" Nightcrawler can be seen as the third film in an unofficial trilogy about the dumbing down of the news, the unassailable culmination of Beale's rant to the studio audience that television had supplanted books and newspapers as the primary medium of intellectual discourse. The penultimate film, Broadcast News, released a decade after Network, screenwriter Paddy Chayefsky's divination that entertainment value would eventually encroach on the erudite nature of hard news proved to be true, finds encapsulation in the scene where Jane Craig, a Washington bureau producer, sounds the alarm on broadcast news content when she presents a domino demonstration clip at a conference for local reporters. Whereas, in Network, the studio audience watching a degraded version of the news was the hoi polloi, denizens raised on Bugs Bunny, therefore rankling the old vanguard who still controlled the medium, in Broadcast News, we can see, quite pointedly, how the generation gap closed during the interim between both films. The Bugs Bunny aficionados were now the gatekeepers, industry insiders, who, to Jane's disappointment, are not \"mad as hell\" about the infiltration of fluff bombarding the airwaves, when the seminar attendees clap in approval after the final domino falls. At this juncture, the late-eighties, it would seem by the light-hearted genre(the rom-com) that is chosen to document the news program's fluid aspect in filmic amber, networks and their affiliates were, as of yet, not the whorehouses that Frank Hackett had purported UBS to be. Broadcast News ends on an optimistic note, a note suggesting that the trend could still be reversed. Tom Grunick, newly minted as the face of the news division, at his press conference, defers the programming duties to a civic-minded heavyweight. This conceit, in which a narcissist like the telegenic, yet uninformed newsman would be an advocate for hard copy that matters, now, in retrospect, seems more absurd than an anchorman being assassinated by network honchos because of low ratings. Tom is all about style over substance. Jane Craig doesn't exist anymore. Diana Christensen does. Once thought to be an implausible invention of a scribe with an overheated imagination, the bloodthirsty woman behind The Mao Tse Tung Hour, the UBS hit show documenting the terroristic maneuvers of the Ecumenical Liberation Army, lives on in Nina Romina, the news editor for a low-rated L.A. morning show, who embodies and widens Diana's vision of broadcast news as spectacle. Chayefsky, who would die in '81, never lived to see the ultra-violent direction that Hollywood would take; he never saw the big-budgeted studio films with high body counts, the count so high, audiences would become desensitized to the human collateral damage. In Bad Boys 2, neither we nor the filmmaker, in a chase scene between off-road vehicles, stop to consider the welfare of the Haitian peasants as the Hummer and Range Rover plow through their tarpaper shanties. Nightcrawler satirizes a different generation, The Terminator Generation, raised on the \"event movie\". Better than Man Bites Dog, the psuedo-doc about a film crew who follows a serial killer at work, Nightcrawler gets its message across about audience complicity towards violence because unlike the grainy B/W, cinema verite style of the Belgian import, the filmmaker uses the film language of the Hollywood blockbuster. Situated outside a glass-walled Chinese restaurant, Louis records a furious exchange of gunfire between the police and the suspects of a home invasion. The rectangular glass front, meant to represent a movie screen, provides a clue as to why people tune into the graphic imagery that apparently turns up on local mornings news shows in big cities. It's entertainment. It's The Death Hour. When Ben, in Man Bites Dog, murders an entire family in their home, we're horrified because it looks real. Here, violence, looks fun behind Louis' camera eye. Innocent bystanders die in the shootout, but we don't care. We've seen it in the movies.",
      "total_reactions": 0,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "A dark side look at the American dream. There's always a movie about what it takes, and what is \"takes\", to make it big, but writer/director Dan Gilroy implies something a bit different here. That maybe what it takes is to be sociopath, have no principles, moral or empathy and that maybe it rubs off a bit, because it is seductive and it is EVERYTHING and that's how it spreads.",
      "total_reactions": 0,
      "user": "DirigiblePulp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Great as far as it goes -- Jake Gyllenhaal attains a new level of cold creepiness. And unlike most films/shows slamming the \"if it bleeds, it leads\" mantra, this film avoids preaching. Rene Russo is totally believable as the TV producer past the point of prettiness and fighting to stay relevant. But I really wanted a little bit of insight into the lead character's behavior ... the logistics of his previous survival, not to mention the roots of his sociopathic behavior.",
      "total_reactions": 0,
      "user": "Lyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "Really well made, a totally believable conceit. Gyllenhall is great as an antihero - and Russo plays against him very nicely. a damn good watch late at night.",
      "total_reactions": 0,
      "user": "tonyGreen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "If you can get past how disturbing Louis is Nightcrawler is a good film. This is not just a thriller and Rear Window ripoff but a nice commentary on the media and violence, which is explored through the disturbing and intriguing Louis Bloom. Jake Gyllenhall does a great job in the role providing a character that is both revolting in his obsession with violence and media as well as his detachment from it but is also intruging with his passion and obsession. I won’t blame you if you find this movie revolting as it is messed up but for me I could and was entertained by this film.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "The line between observer and participant is crossed in this beautifully deranged thriller. Scenarios are intense as we watch our lead Gyllenhaal run into dangerous situations that could land him in prison or in the grave. His motives aren't exactly disagreeable, but his methods are. The movie has a lot to say about modern journalism tactics.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "Excellent acting from Gyllenhall, playing an ambitious character who wants to get ahead, by any means necessary.",
      "total_reactions": 0,
      "user": "codayop"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "Good acting. It wasn't a bad movie... but it left a very bad taste in my mouth. Like... I've honestly never felt so empty after a movie. My girlfriend was actually telling me that I needed to watch Scrubs to cheer up.",
      "total_reactions": 0,
      "user": "TheChaser1985"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "I haven't been a particular fan of Jake Gyllenhaal, but in this film he portrays a creepy, night-dwelling man with some serious ability.  The story is interesting, if slightly predictable, the peripheral actors do their bit - but it is the main man's work that stands out here.",
      "total_reactions": 0,
      "user": "funkydoodycool"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2015
      },
      "score": 9,
      "text": "Jake Gyllenhaal gives one of the creepiest performances I've seen and he does a fantastic job at it. Nightcrawler has a haunting and pulse pounding tone with an eerie vibe that is disturbingly interesting every moment of the way.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "An engaging well acted movie. It certainly stands out as something different from other pieces of work this year. It also has a memorable score thanks to the ever reliable James Newton Howard.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "Although the writing for the protagonist's surrounding characters fails to portray believable reactions to Lou's obtrusively insane actions, as well as some of James Newton Howard's music (at times) failing to coalesce with the emotional essence of many scenes, 'Nightcrawler' is a provocative, turbulent and disturbing  investigation into the sociopathic mind, elevated by a standout heart-stopping performance from Jake Gyllenhaal.",
      "total_reactions": 0,
      "user": "anshiman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "Beautifully shot, wonderfully acted, and very well written, Nightcrawler is a great debut for director Dan Gilroy, another feather in the cap for cinematographer Robert Elswitt, and yet another example of why Jake Gyllenhaal is one of the top actors working today. Creepy and unhinged, Gyllenhaal's performance in the lead was great, as you truly believe every word he says and all of his mannerisms and oddities. However, to me, one of the films best features was the cinematography, in particular the lighting. In line with other great films that capture Los Angeles at night such as Drive and Collateral, Nightcrawler is beautifully shot and lit. Another major plus for this one would have to be the way it operates as a biting criticism of the television news industry. Showing them as morally questionable and willing to do anything for ratings, this one certainly shows the shady side of television and raises many questions that should be answered, such as the morality of showing some of the footage shown. Overall, Nightcrawler is a thrilling, intense, and very creepy, experience that should help propel both Gilroy and Gyllenhaal to further success.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "Brilliantly acted by Jake Gyllenhall, taking a moderately interesting look at the highly immoral yet occasionally defensible world of true crime parasites and turning it into something that is hard to look away from. His character is so awful, and so awkward, yet just strangely sympathetic enough to make it impossible not to root for him just a little, then immediately feel like that was a mistake.",
      "total_reactions": 0,
      "user": "dinojay2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "Jake Gyllenhaal gives one of his best performances here in this film. It's so incredibly dark and slimy, you'll want to look away at some parts but you're just unable to because of the pull this movie has on the viewer.  Beautiful cinematography, actually reminded me a bit of Nicolas Winding Refn's film \"Drive\" with Ryan Gosling especially with the dark Los Angeles setting. Definitely a must-see film, and I pray that Gyllenhaal at least gets an Oscar nomination for this.",
      "total_reactions": 0,
      "user": "Eon2323"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2016
      },
      "score": 8,
      "text": "Nightcrawler is a beautifully made, riveting study of a fascinatingly deranged character played brilliantly by Jake Gyllenhaal in a career best performance.",
      "total_reactions": 0,
      "user": "Jack97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Holds your attention for the entirety. Jake Gyllenhaal delivers a strange, spot-on performance of an OCD, business-focused personality. His character was both terrifying and enthralling. Reminded me of Prisoners (although the characters were obviously not the same).",
      "total_reactions": 0,
      "user": "Bshop"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "Dan Gilroy's 'Nightcrawler', is not only one of the most intense modern thrillers I've ever seen, it's fantastically written script coupled with Gyllenhaal's incredible performance ultimately cements its place as one of the best films of 2O14.",
      "total_reactions": 0,
      "user": "HazzaGalla"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "Very interesting and disturbing film which takes the essence of part of our society to extremes to prove a point. The film is pretty different to most of the films out there and Jake Gyllenhaal is fantastic in the role. He totally disappears in the character and gives one of his best performances to date, the best for many. He is definitely on a roll lately, after Prisoners, Enemy and a couple of upcoming very attractive films. He hadn´t enjoyed such acclaim since the Brokeback Mountain days. However, as good as this is, it lacks that push or x-factor that would make the film worth of an 8 or a 9. Hopefully we will get better and better bodies of work from this director.",
      "total_reactions": 0,
      "user": "sanyrub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "it's absolutely a Jake Gyllenhaal's movie brilliant performance by him. he has done exceptionally well, good enf job by riz ahmed and Rene Russo, was worth my time.",
      "total_reactions": 0,
      "user": "ultimateshank"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Okay. When you go watch 'Nightcrawler', which is a very well done film, focus on Jake Ghylenhaal, Rene Russo and the heavenly script. Everything is good in the movie. But just focus on those three things and I promise you: YOU WILL BE BLOWN AWAY.",
      "total_reactions": 0,
      "user": "joeyrios"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "A near perfect film. Jake Gyllenhaal stuns in this Dan Gilroy piece, a thriller on steroids if ever I've seen one. Gyllenhaal was absolutely robbed of an Oscar nomination here. Just watch it, trust me.",
      "total_reactions": 0,
      "user": "heromoder"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "Jake Gyllenhaal does a great job of creating a really creepy character.  The story is interesting.  Having said that I wouldn't want to watch it again because the main character CREEPED ME OUT...!  So, good acting, cinematography, writing, etc. but I don't know who I would recommend it to.",
      "total_reactions": 0,
      "user": "psyberdelic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "First rate portrayal of a borderline sociopath who decides to become a nightcrawler, cruising the streets at night to film the latest tragedy to sell to night time TV. Gyllenhaall, always watchable, is first rate as the hungry man with a plan, but sometimes too Travis Bickle. Seedily shot and moodily played, \"Nightcrawler\" has just the right amount of dark humor to add to the sweetly sour take on what we want to see. Recommended.",
      "total_reactions": 0,
      "user": "manofthemoon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "Nightcrawler is a great thriller movie that’s highly original, and it’s the desire for having a basic job and the success that follows that truly makes this movie incredible.",
      "total_reactions": 0,
      "user": "TheApplegnome"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "fantastic performance, I found myself lost in his own obsession. he looks like a coyote, and if a coyote would be able to talk it would maybe sound like Lou.",
      "total_reactions": 0,
      "user": "Jacketrooperr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "It is one of the best satire movies. Perfectly written and directed. And there is no word to tell Gyllenhaal's performance. He is completely live with his character. Walking, talking, gestures... I am lost for words.",
      "total_reactions": 0,
      "user": "cinecine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "This film was fascinating to watch. Jake Gyllenhaal plays Bloom perfectly and provides one of 2014's most interesting characters. He will let nothing stand in his sociopathic way to become the best of what he does. He believes he can deceive and manipulate anything as long as he's good at it, and he strives to become best to have something of his own. His humanity is certainly questionable but it delivers the fact of what loneliness can do to people. He is alone (and perhaps wants to be) but whats recognition that only he himself can see he deserves. The film plays out brilliantly and is paced greatly until somewhere in the second half that i can't state exactly where, but once the \"road accident\" and \"set up\" takes place the film picks back up for a climactic, fast paced and faultless finale! One of 2014's best, grab it now!",
      "total_reactions": 0,
      "user": "oDjento"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "This film has amazing camera work, every shot is great. Remember the name Dan Gilroy because you are going to see a lot of great things from him in the future. Jake Gyllenhaal is outstandingly chaotic in this film and it is a performance to remember for years.",
      "total_reactions": 0,
      "user": "heeldavid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "Nightcrawler es una película con un guión ingenioso y que desarrolla una historia criminal que sucumbe a la intriga.",
      "total_reactions": 0,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "I am one who adore movies that leave me walking out the theatre and still thinking about the movie; movies I like to call thought-provoking. Nightcrawler is one of those films, but it also entertains greatly with its fantastic performances, outlook on modern media, and a great tone. Elephant in the room time: Jake Gyllenhaal. I've heard buzz lately about Jake's recent outstanding performances. He has surely stepped up his game, and Nightcrawler delivers with another superior performance from him. Here, he plays a sociopath hell-bent on getting all that he wants in his job. He really gives off a creepy, disturbing, and unsettling tone playing this character. I more than look forward to his future movies. Rene Russo is nearly as good as Gyllenhaal. There's an actor here I don't think I've seen before: Riz Ahmed. While he does have some glimpses of very good acting, I think there was lost potential with his role, meaning he could've been better or even easily replaced. I see potential with him, though, I'll give him that. Even though Michael Hyatt's role and appearances were brief, she was incredibly good. The main plot here is that Jake's character works in the LA freelance crime journalism territory. He goes up to crime scenes, films it, and sells the footage to news channel broadcasts. With this, Nightcrawler delves into dark, mature territory at times, which I welcomed. How far Jake's character will go just might astound you. The movie also has it's fair share of jaw-dropping moments. The movie mixes thriller, suspense, and drama to great results. The flaws here aren't too big, but noticeable. The movie sometimes objectifies logic and equals to annoying measures. I also was unsatisfied with the ending and the scene before that final scene. The pacing problems were so, so slight, but it is worth mentioning that the first half's pacing will differ from parts of the second half's, which irritated me at only a few points. Nightcrawler is a great movie, even a bit above great. It just misses my 9 out of 10, SO CLOSE. It may not be in my Top 10 movies of the year, but it will be one I will surely remember.",
      "total_reactions": 0,
      "user": "SimpleReviewz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2016
      },
      "score": 8,
      "text": "In this neo-noir movie, Jake Gyllenhaal delivers one of his best performance yet. The story is original and interesting and the movie is entertaining.Nightcrawler definitely is a modern classic.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "A very well acted and very well executed movie. This movie was very well paced and flowed well and you were never bored with it. This is one of if not the best role of Gyllenalls career he is fantastic in it. He is a creepy, mysterious character and you never know what is going to happen next.Watch for this movie during award season.",
      "total_reactions": 0,
      "user": "Viper8787"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "A creepy, quirky thriller that, despite some pacing issues early on, delivers an entertaining mix of drama, comedy and insightful commentary about the state of today's media. Superb performances by Jake Gyllenhaal and Rene Russo help to elevate this film to a level that might not have been attained with lesser talent. Not for everyone, to be sure, but those who appreciate offbeat fare will certainly enjoy this one.",
      "total_reactions": 0,
      "user": "Brent_Marchant"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "Nightcrawler is an absolutely gigantic achievement. Coming from first time director Dan Gilroy, the film is the mystic combination of intense and dark. Jake Gyllenhaal should be granted and Oscar nomination, just for having his \"skinny scavenger\" image stuck up my mind.",
      "total_reactions": 0,
      "user": "HaithamB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "'Nightcrawler' is a great example of an actor playing/fitting his roll perfectly, Jake Gyllenhaal is able to make you feel completely immersed in his character and the film. Supporting actors seem much more dull compared to Gyllenhall's acting but still give engaging characters. Once the plot picks up pace at the midway point it keeps you guessing with what twisted/Partly Insane act the main character will do next to further himself. The story gives a good look on the Job of recording Fires/Car Accidents or anything worth reporting on the news and how twisted the job could be at times.Gyllenhaal enraptures his character perfectly and delivers a stellar performance, If you in need of a great Drama/Thriller give \"Nightcrawler\" a chance..and no, not the X-Men Character",
      "total_reactions": 0,
      "user": "ToFewViews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Anchored by a spellbinding performance by Jake Gyllenhaal and sharp media behind the scenes satire, Nightcrawler is an atmospheric neo noir achievement by first time director Dan Gilroy.",
      "total_reactions": 0,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 3,
      "text": "I'm just disappointed with this film. I think that is a much better made and more interesting.********************************************************",
      "total_reactions": 0,
      "user": "Marick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "Survival of the Batsh!t Craziest",
      "total_reactions": 0,
      "user": "borderlinefilms"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "Jake gives best performance of the year by far. The reason why it is so good that he doesnt act in this movie, he totally lives this character. Yes, movie can be not good for everybody but nobody can say that jake wasn't amazing. He deserves really oscar award but academy doesnt like this type of movies, shame on them. but a nomination would be enough i think. This move is like dallas buyers club, the performances are better than movie.",
      "total_reactions": 0,
      "user": "easybreezy248"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "Nightcrawler is an exciting and gritty crime-thriller movie that explores the depths of LA crime-journalism at its most gruesome. Jake Gyllenhaal plays Lou Bloom who films crime scenes and sells them to a local news station, while blurring the lines between observer and participant. The movie works best as a character study of Lou, showing how he can manipulate people into helping him in this dangerous profession and the lengths he will go to sell the video to the news. It's dark, intelligent, and violent while still being able to engage and entertain the audience.",
      "total_reactions": 0,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "How did Jake Gyllenhaal not get an Oscar nomination for best actor? Not only one of the best acting performances of this year, but any year. The same for the movie itself, easily one of the best of the year, and so much better than that Birdbrain movie.",
      "total_reactions": 0,
      "user": "MurrayT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "The Movie Is Great!",
      "total_reactions": 0,
      "user": "sepeh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "Jake Gyllenhall gives a top notch performance and totally gives you the creeps! And Renee Russo gives a superb performance that we haven't seen from her since Get Shorty. Where has she been, she's wonderful! Action packed and funny at times, overall I would recommend you see this movie for sure!",
      "total_reactions": 0,
      "user": "SSKellyHulse"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "Really entertaining. I was impressed by almost all the main characters, because they were convincing. Both the dialog and the emotional intensity rings true throughout the movie. As if you can feel all of their motivations and fears. And this is what makes it a winner. On top of that the script is developed very well and keeps you interested. I do think this movie deserves high score and I may easily miss-score it a little as 7.5 or even 8 sounds more appropriate. Anyway... it is certainly a good one!",
      "total_reactions": 0,
      "user": "pesho_one"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "Nightcrawler is a really great movie. Jake Gyllenhaal plays the role of a psychopathic journalist who will stop at nothing for his career. I love that. I am also into journalism myself and recommend this movie to others who have the same interest, and even to others who are not into that sort of thing, it is just a really good movie too watch. Very interesting throughout the whole movie.",
      "total_reactions": 0,
      "user": "vanessaspencer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2015
      },
      "score": 9,
      "text": "Un excelente Thriller que muestra la doble cara de la televisión y la comunicación, un hombre que busca el sueño americano y la superación a cualquier precio. Jake Gyllenhaal es tan brillante que simplemente olvidas que es Jake, se transforma completamente en Lou, un ladrón psicópata manipulador e inteligente. Nightcrawler es Solido, interesante, con una poderosa trama.",
      "total_reactions": 0,
      "user": "JohnMasterL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "It creatively and clearly demonstrates the life of an informal reporter who stays actively at night, thrills enough to take risk as a freelance camera crew and snapshots the first hand crimes and accidents to be the headline of the medias. The first directional debut of Dan Gilroy is surprising successful in maintaining a good pacing throughout the film and it works entirely on every level as a chilling drama, action and society commentary. Jake Gyllenhaal, undeniable has shaped himself perfectly in this intriguing, ambitious, eager, greedy yet selfish character, thanks to the good screenplay which should have no problem to get him at least an Oscar nomination. With the eerie scores from James Newton Howard and diverting from the usual plot line, this hysteric masterpiece defines and admires the dark nature of the society, the evil nature of the human - to be selflessness on humanity in order to define success in one's life.",
      "total_reactions": 0,
      "user": "michael1208"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "Night crawler is its own animal. It does not resort the to the typical archs and storylines that so many other hollywood films do. You walk away with a serious, topical and important issue that journalism as a whole is faced with.",
      "total_reactions": 0,
      "user": "newfilm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "\"Nightcrawler\" 10 Scale Rating: 8.5 (Fantastic) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "a star performance from Jake Gyllenhaal  a sociopath.",
      "total_reactions": 0,
      "user": "root_"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "I agree with the majority in thinking this movie was amazing looking, had great acting and defiantly set a tone; but in the end I really don't think a story was even told.  At first it seems like the plot takes off very quickly but then it keeps that tone through the very end and it's like a story was never even told.  I not sure how else to describe how this movie makes you feel, but in the end it's not good.  I usually love these kinds of movies but for me this missed the mark by miles and left me questioning what I just watched.",
      "total_reactions": 0,
      "user": "Stevesitz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "When I went to see the movie, I did not know what to expect. I was amazed and surprised when I left. American Psycho for a new generation, Brilliant!!!!!!!!!",
      "total_reactions": 0,
      "user": "rysully666"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "Definitely an interesting movie. It is very slow at the beginning but it gets interesting eventually with the ending making you scratch your head. It wasn't the best but its way better than nothing.",
      "total_reactions": 0,
      "user": "Gennifer11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "This a really good film I don't know about great. The films well shot except for a little weird framing, and the story's pretty cool, but something just feels a little off. The pacing is a little too slow for me at times, and other than gyllenhal the characters all feel one-dimensional. There are some scenes that lose my suspension of disbelief, but boy is gyllenhal great. I'll say this gyllenhal deserves a Oscar nod.",
      "total_reactions": 0,
      "user": "tjman09"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Jake Gyllenhaal is incredible in this adventure of a criminal cinematographer who is capable of doing anything to achieve his goals and be successful. Lou is a systhematic and pragmatic guy who is determined to find a good job and with a simple camera and a lot of boldness he manages to catch Nina's attention and sold her his work. And knowing how much she depends on his images to keep her job, he'll become more and more demanding as the time goes by. He also won't think twice about doing evil things to gain more space on screen. Rene Russo does an amazing job as Nina, such as Riz Ahmed as Rick. Bill Paxton promissed something good at the beginning but he totally vanishes, never to be seen again. Another weak point in the script is the lack of background in the life of Lou. On the other hand, these things don't get in the way of this amazing first film of Dan Gilroy. Nightcrawler is crazy, scary and electricfying.",
      "total_reactions": 0,
      "user": "danipp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Filme muito interessante que mostra o lado podre da TV, do jornalismo e da mídia em geral. As distorções, a sede por sangue... Interpretação incrível do Jake Gyllenhaal, que vive um personagem totalmente insano.  Enfim, uma boa história bem contada faz valer a pena assistir esse filme!! Em minha opinião, 8/10 !!!",
      "total_reactions": 0,
      "user": "BlaKDemonaZ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "At first, I found myself not caring for Glyllenhaal's character.  But little by little, he drew me in.  And the writing is superb:  his quirky, unexpected dialogue and edgy personality became mesmerizing.  A remarkable performance by an actor who's made some terrific films - Donnie Dark, End of Watch - but outdoes himself him.   Loved it.",
      "total_reactions": 0,
      "user": "5thStFreddie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "In any hybrid you’re looking for the best of both worlds. For instance, there’s a dog, one bred for service. The goal of the breeding is to combine the intelligence of the one dog with the low-key temperament of the other. The risk of the new breed is getting the reverse and having a useless dog. The same applies to movies, such as blending two genres being “thriller” and “comedy.” If executed well, it can land safely. If not, well, the movie ends up becoming a waste of  money.",
      "total_reactions": 0,
      "user": "bora8413"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Nightcrawler is the compelling and disturbing story of a sociopath gradually getting better at manipulating those around him.  Jake Gyllenhaal was incredible--I was shocked by how completely unattractive he made himself for this movie, adopting the role of the extremely creepy, sociopathic protagonist, constantly spouting off tired motivational business truisms in the most off-putting way imaginable (not to mention the way he abused and exploited his single employee and coerced Nina into having sex with him).  Other user reviews have noted that you need to suspend a little disbelief for this movie, and I think that's true--in particular, the quick scenes where Gyllenhaal's character suddenly achieves success and all his equipment is enormously updated was too sudden to be financially credible, even accounting for the sparseness with which he lives his life otherwise.",
      "total_reactions": 0,
      "user": "heatherm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "An outstanding movie with excellent performances, especially from Jake Gyllenhaal. A searing indictment of the morals of American TV news and the society that breeds it.",
      "total_reactions": 0,
      "user": "royphishooh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "Jake Gillenhaal makes the best performance of his entire career in Nightcrawler. This movie has such an excellent character development, having as protagonist this weird, eccentric guy, that, being desperate for a job, muscles into the world of L.A. crime journalism. The film is fantastic, all the acting is very good, but the one from Gillenhaal is just beautiful. He really knows how to give life to his character, and how to make progress all the way through the film. The script is incredible, everything in the movie makes sense, and everything Gillenhaal says is extremely well thought, there isn't anything out of context and the story is very original. The ambient is very realistic, and you will not want to take your eyes out of the screen. The score, not being extremely good, gets its job done. The movie is excellent. I would really like a sequel. Watch it, without doubt.",
      "total_reactions": 0,
      "user": "Dokalu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2017
      },
      "score": 10,
      "text": "Good god damn. This movie is as good as it gets. Everything in this movie was AWESOME. Lets get the basics out of the way fast - the acting, filming and setting was fantastic. Pacing could have been a LITTLE better but was still very good.",
      "total_reactions": 0,
      "user": "vishalgoradia27"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "Nightcrawler gives you a movie that is truly of the night",
      "total_reactions": 0,
      "user": "Lelchelsea"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "First of all i want to say im not a big fan of a Jake Gyllenhaal. But his performance in this movie make me watch it actually i think the movie wasn't something special a normal crime thriller about the television industry concerning a mysterious figure Lou Bloom who is a sociopath bent on success, and he won't let anything or anyone stand in his way to the top.When he sees an opportunity to shape events for mutual benefit within the confides of criminal law he chooses to ignore moral law to achieve his goals.See the movie show us a person who is ready to do anything for his career he move death body's he lie and manipulate he even stalk criminals that's and film a horror crime scene for his selfish reason im saying selfish because the character was selfish.When he was blackmailing Nina Romina (Rene Ruso) he not only wanted money and place in business he want her too not only that think the way that he film all the thing he didn't think about the victims he think about his film about he name and watch every one his films again and again, he even kill his employe for that selfish. And that's the interesting Jake Gyllenhaal fit this role so good that you can't even take eye off the screen in waiting of his next psycho move or idea.That's probably the best role of Gyllenhaalhe is utterly disturbing at one point, hilarious at another, and horrifying at others.You can see that he was work hard for that role and give his best and i think that made the movie so good to watching the performance of one single actor make this movie soo good .",
      "total_reactions": 0,
      "user": "SmileATT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "An entertaining film, in part because it delves into the grotesque and graphically violent, and also because it breaks the typical mold with a main character who is not likable but is singularly driven to achieve his \"career goals.\"  And indeed this film gives whole new worlds of credibility to the studies that indicate a great many businesses are piloted by people who are certifiable sociopaths who would happily throw their employees in front of a speeding freight train just to earn a few bucks.",
      "total_reactions": 0,
      "user": "HotelCentral"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "Do you ever going into a movie hearing about how great it is and afraid it won’t live up to the hype? I feel that way about a lot of movies when I hear about them from friends, the internet, and various other places. Does Nightcrawler fall under that category? No, definitely not.",
      "total_reactions": 0,
      "user": "BottleOfPop"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "Jake Gyllenhaal gives a really strong performance in this movie - the whole thing is strong from start to finish, with a very engaging plot / story and fine performances from many of the actors. Absolutely worth watching.",
      "total_reactions": 0,
      "user": "NRNSW"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "One of the most underestimated films of 2014 with a great performance of Jake Gyllenhaal, one know-it-all, childish psycho. Great action, kept me on the verge all the time. A very contemporary story that everyone who watches the news these days can relate to.",
      "total_reactions": 0,
      "user": "hugoactivia"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "Such an amazing and great film, watched it three times already. Jake Gyllenhaal gives you something insane, it's beautiful on so many levels, the tone or old school vibe. The Director is so confident, and in creating such and chilling and immense atmosphere for Jake run around and do his thing, it just works, it's simple.",
      "total_reactions": 0,
      "user": "SupermanX1925"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "The acting from jake glynenhall in this movie is amazing his play lou bloom to perection but other than that the film was bland and predictable the character development was almost 0 all we knew about rick is he is homeless and thats all and all we knew about lou is that he has some serious issues also from my opinion he seemed quie autisctic either way the film was sub par but the acting was oscar worthy from glynenhall",
      "total_reactions": 0,
      "user": "zuereuz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "Jake Gyllenhaal provides an amazing psychopathic performance. Beautifully directed and written by Dan Gilroy. He should of been nominated for an oscar at least",
      "total_reactions": 0,
      "user": "shaneisaghost"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "One of the best movies I've seen. Shows the kind of character that is willing to go where nobody else will in order to maximize profit; otherwise known as a psychopath.",
      "total_reactions": 0,
      "user": "steelreserve"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "Don't buy into the hype on this one, Nightcrawler is just a mediocre character study of a hackneyed, Norman Bates-type character masquerading as some profound social commentary regarding media sensationalism and the American Dream/capitalism at its most amoral. While Gyllenhaal gives it his all in what some would consider the most compelling performance of his career, I never entirely bought into his character because he was essentially an amalgam of every other brooding, reclusive sociopath in cinema history, and he was all too familiar a character to even remotely pique my interest. Nightcrawler is a film that teeters uncomfortably between being realistic and illogical throughout, with vague social commentary jammed somewhere in between. It seemed like the score was absent for over half the movie's duration, but it flutters in occasionally (and awkwardly, I might add) to remind the audience of its existence. Director Dan Gilroy also demands that the audience revel in the inhumanity depicted on screen, and is so focused upon unsettling the audience, that any message he may be trying to convey is completely diluted by this forced grittiness. This film pales in comparison to Gone Girl in all respects.",
      "total_reactions": 0,
      "user": "lomeli"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "Nightcrawler was an ambitious, stylistic and wonderful thriller, whose anti-hero Lou is portrayed in one of the most riveting performances I've ever seen Gyllenhaal throw down. It was glitzy, polished, and the story was fleshed out quite well. There were a few slight discontinuities for me near the end, particularly a very forced and altogether useless romantic encounter that I feel the film could have done very much without. Altogether, though, a memorable satire of what it means to bring the news to life, and pull yourself up by the bootstraps.",
      "total_reactions": 0,
      "user": "Jarhead335"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "Compelling and intense, the story progresses at a well balanced rate, building to crescendo. An absolute must see.",
      "total_reactions": 0,
      "user": "jigsmode31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "This was gritty, extreme, crazy, and VERY well acted. An excellent movie.",
      "total_reactions": 0,
      "user": "jinannn31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2016
      },
      "score": 9,
      "text": "A mesmerizing, haunting character study of the sociopathic Lou Bloom, played to perfection by an absorbing Jake Gyllenhaal in what may be the defining performance of his career to date.",
      "total_reactions": 0,
      "user": "AndrewLambert"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2016
      },
      "score": 9,
      "text": "Fu*$#d up and oh so twisted! First time I felt genuine suspense in a movie in a long time! Jake Gyllenhaal is so good and an obvious psychopath in his own way. Really good and disturbing.",
      "total_reactions": 0,
      "user": "Stargirl04"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2017
      },
      "score": 10,
      "text": "This movie is awesome! It gets better as it goes along, and it ends in a thrilling, impactful manner. This movie's gritty, night-oriented style works with its story and themes and really goes along well with the various settings in the movie, the dark writing and acting, and its indie-rock/orchestral score.",
      "total_reactions": 0,
      "user": "SomePersona"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2017
      },
      "score": 8,
      "text": "To watch this movie is truly a thrilling and disturbing experience. A refreshing, original movie with mostly great pacing, beautiful cinematography along with characters who challenge the viewer, making them question the characters motives along with their mental stability. All actors are excellent in their roles, to the point where you forget their celebrity status and believe their motivations as real people.",
      "total_reactions": 0,
      "user": "Rysterman"
    }
  ]
}