{
  "mc_avg_user_score": 4.3,
  "mc_metascore": 49,
  "mc_mixed_rating_frequency": 50,
  "mc_movie_name": "Nine",
  "mc_negative_rating_frequency": 104,
  "mc_positive_rating_frequency": 74,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2011
      },
      "score": 0,
      "text": "Unbelievable trash - Fellini would turn in his grave. Daniel Day Lewis and Kate Hudson will be ashamed of playing in this forever. Judy Dench - totally miscast. Worst musical score I've ever heard. Cheesy, ugly and pathetic. Zero points.",
      "total_reactions": 1,
      "user": "Charlieparker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "Rob Marshall proves here that he still having the talent that made Chicago a Best picture winning,it has strong performances from Daniel Day Lewis and Marion Cotillard and dazzling musical sequences.",
      "total_reactions": 1,
      "user": "rodrique"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "Yes, \"Nine\" is not a strong movie and I also agree that Federico Fellini would have despised it. But the veteran actors (especially Daniel Day Lewis) saves the day for the movie.",
      "total_reactions": 4,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "the movieÂ´s photography is simply perfect, i swear i love itÂ´s scenography, BUT the movie, itÂ´s kind of boring, i admit i like every kind of movies like musicals, historic dramaÂ´s but i was REALLY bored. Penelope Cruz actuation was not bad at all, but i consider that is NOT that greatful to be nominated for AcademyAwrds. . I thnk that the movie getÂ´s so long, without an important topic, at the end, WHO cares Contini ? .",
      "total_reactions": 1,
      "user": "bluemilk"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "I don't understand why so many people hate this movie.  It's such a luscious film.  Perhaps the only downside is being unable to understand Penelope Cruz when she's singing.  Fergie's \"Be Italian\" is one of the best musical numbers ever.  This movie is poignant, fabulous, and charming.",
      "total_reactions": 1,
      "user": "Werothegreat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "Well, 'Nine' surely is not Rob Marshall's masterpiece (especially after 'Chicago' and 'Memoirs of a Geisha'), but it does have some good points.",
      "total_reactions": 0,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2010
      },
      "score": 4,
      "text": "I thought \"Chicago\" was brilliant and enjoyable, but with a story so thin that it evaporated from one's mind before one got home from the theater. By contrast, \"Nine\" has some brilliant and enjoyable song-and-dance performances, but virtually no story at all! To me, it's a waste of a lot of excellent actors, but people who are deeply appreciative of song-and-dance   efforts might find it worthwhile.",
      "total_reactions": 0,
      "user": "Lyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2010
      },
      "score": 4,
      "text": "only good parts were when Penelope Cruz was on screen..worth renting if nothing else..........................................................................................................................................",
      "total_reactions": 0,
      "user": "jjam970308"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 4,
      "text": "A film's stylistic vision is perhaps the aspect of film that I most personally adore.  But although a film may employ all of the chic characteristics possible, it is completely futile if it possesses a lack of plot.  Unfortunately, this is ultimately the importune description of Rob Marshall's(Chicago, Memoirs of a Geisha) Nine.",
      "total_reactions": 0,
      "user": "RyanGee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2011
      },
      "score": 3,
      "text": "I wish I could have graded 2 and 1/8ths because \"nine\"  the movie is exactly that, the original 8 1/2 turned into a musical, then turned into a movie again, losing half of its potency with every transformation. too bad that marion cotillard's elegance is wasted on \"nine\".",
      "total_reactions": 0,
      "user": "istanbul"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "Page one.. page oneâ",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2011
      },
      "score": 0,
      "text": "This movie was an insult to musical theatre. I honestly think it was the worst movie I have ever seen. I could hardly sit through it. Of all the musicals to turn into a movie, this was not the one.",
      "total_reactions": 0,
      "user": "LillyI"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2011
      },
      "score": 1,
      "text": "This movie was very poor. There was very little story development and half the time you couldn't even tell what was going on. Marion Cotillard and Judi Dench stood out in terms of her acting, but the needless overuse of risque poses really let this one down. I really did not enjoy this and was spending a lot of the movie hoping for it to end.",
      "total_reactions": 0,
      "user": "alleyt1989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "Overall the movie falls very short of being much more than a composite work that fails.  Individually the film is filmed with performances that had they been somehow blended with each other it might have been much more satisfying.  Lewis was an excellent choice for the protoganist but he has his limitations.  The women each in their own way deliver the goods it's the goods they are asked to deliver that are questionable, and not so much the goods as to the way in which they are asked to deliver them.  Cruz, Coitllard and Loren are excellent within their limitations.  Kidman  is quite good as is Dench and Fergie.  Only Kate Hudson seems lost in the shuffle and in many respects just wasn't needed.  The cohesion is missing.  That's the failing.",
      "total_reactions": 0,
      "user": "NJWolfgang"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Daniel Day-Lewis is most definitely not in his best form; but Marion Cotillard,who steals the show, and help from the other women in this cast make this musical a triumph. Although not a single song is really entertaining enough to keep you engaged the whole time. I give this film 76%.",
      "total_reactions": 0,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2014
      },
      "score": 4,
      "text": "Rob Marshall is by far one of the finest directors in the musical genre. This time he's taken a lesser known musical and has attempted to raise it as high as 2002's Chicago. Unfortunately, other than some gifted music, it falls completely flat.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "Academy Award nominated for Best Supporting Actress I resent the fact that this movie would have negative reviews from fans.",
      "total_reactions": 0,
      "user": "TheGeographer52"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "The saving grace is Dion Beebe's beautiful cinematography, Cotillard, Cruz and a superb ending that is delicately delivered and adds an excellent final touch tying up loose ends and book-ending the feature with its opening number, which will most likely be confusing for those that aren't familiar with Fellini's original film. Everything said, I'm interested in seeing it again. I am leaving room for this one to grow on me.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2014
      },
      "score": 9,
      "text": "For me was a very good movie, if you enjoy movies and musicals, this is for you. The cinematography was excellent. Kidman, Dench, Cruz, Cotillard, Fergie, HUdson look very nice in the movie. you must to see it.",
      "total_reactions": 0,
      "user": "Bobson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2016
      },
      "score": 4,
      "text": "Nine (they couldn't use the number 9 as this film's title because another film got there first, without all the women getting in the way, all the musical nonsense, and the reality) just seems weak to balance through in the start. Weakened to fit another plain film not worth watching with any men around here.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    }
  ]
}