{
  "mc_avg_user_score": 6.8,
  "mc_metascore": 34,
  "mc_mixed_rating_frequency": 30,
  "mc_movie_name": "Ninja Assassin",
  "mc_negative_rating_frequency": 39,
  "mc_positive_rating_frequency": 117,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "This movie is hilarious.  Pure camp action.  The Plot is supposed to suck because it is completely Tongue in Cheek and over the top.  I would give it a 10, if they kept the pace consistent to the crescendo. . . but it's near perfect for what they were trying to do. . .  Kick ass and have a fun romp at the same time!",
      "total_reactions": 2,
      "user": "DiggidyDan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "let's be real you don't go to watch a movie titled ninja assassin for an in depth plot.  you go to see the martial arts ninja action and it delivers in satisfying over the top action sequences coupled with excellent fight scenes.  would anyone watch a movie titled Debbie does Dallas expecting some great story to emerge? no",
      "total_reactions": 2,
      "user": "mana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "NINJA ASSASSIN is a violent, visually impressive and entertaining ninja film that is bloody, good fun.",
      "total_reactions": 1,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "This is an excellent movie, you have to watch it 2nd time to really appreciate it.  It is so real although it could be a little bloody, but that is the ninja was famous for.  Of course, for people who don't understand what ninja is all about, it would be difficult for them to enjoy the movie.  The actor Rain is fantastic, and well loved by millions all over asia.  If compare Rain singing on stage normally to what he was in the movie, you realise how much work he had put into this movie.  Well deserve a 9!",
      "total_reactions": 1,
      "user": "chinchin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "It's like being injected with a bloody, gory and jaw dropping drug. Ninja Assassin captures the story of Rain, a student in martial arts. When Rain's bloodthirsty killers shadow him, he uses his carnage to payback and get his lady love who has been captured by the antagonist. NA is a good film, in fact a really good film. The fast paced killings, brilliant martial arts and good story- All done by James McTiguge. This film is about killing and killing works. The visuals are stunning and a bloody good time. This was the only fun, indo, fast and gory film that worked in 2009. This film is not for soft people or people who don't like this genre and blood and gore.  This film is not for everyone. Certainley, not for kids, though. You can't compare it to masterpieces like There Will Be Blood or The Dark Knight. But certainly, rent or buy this film for 9.99 and sit back with buttery popcorn and enjoy the blood, gore and stylized violence. Or buy a ticket if needed. This was a badass movie and the critics are talking s**t about it.",
      "total_reactions": 1,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "While the acting could've been better, I really enjoyed this movie. Awesome martial arts by Rain. And I loved seeing blood all over the place. Good thing this movie wasn't in 3d though!",
      "total_reactions": 3,
      "user": "gm101"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 4,
      "text": "\"Ninja Assassin\" is a straight up brutal hack-and-slash film that has fountains of blood oozing out of somebody's head within 5 seconds. The film needs serious trimming.",
      "total_reactions": 3,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 2,
      "text": "All other standards aside, to me 'Ninja Assassin\" is really flawed on two fundamental levels - first of all, the plot is completely overthought, overwritten, and completely irrelevant to the action onscreen. We don't need a complicated trisecting storyline with braindead characters to complement random limbs getting hacked apart (and believe me, there are plenty of limbs flying around this movie). The second main flaw, to me at least, is the movie's idea of a ninja. To me, ninjas are meant to be unassuming, enigmatic, killers who work alone for some self-defined benefit. Not in this movie. Here, ninjas are essentially as refined as an LA street-gang who run aimlessly around and throw ungodly amounts of ninja stars, which coincidentally sound like loud bullets, which ruins the point of a using a ninja star over a gun. Most of the ninjas in the movie are there to simply get shot down by the SWAT team (the movie wastes no time for epic, romantic battle scenes, save for the few with the Asian superstar Rain). To top it all off, there is not a single smoke bomb! Dammit!",
      "total_reactions": 1,
      "user": "ryancarroll88"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "The main Cast of NINJA ASSASIN is Rain, the pop-superstar from South Korea. I had a doubt before watching thiz movie, that Rain could perform convincing in thiz kind of genre. The movie directed by James Mc Teigue, and supported by Wachowski Brothers (THE MATRIX, 1999). Mc Teigue, we remembered him on his last film, V FOR VENDETTA (2005). In this newest feature, Mc Teigue improved with more actions and straight-to-the-point plots. The Actions however had a few weaknesses. The fight-scene is too fast and not focus, despite the special effect already in right measurement. The only thing that I like on thiz movie, is for the first time Ninja aura was revealed better on Hollywood movie. Rain performance was not stable. In one scene he could be an unmerciful Ninja, but on the other scene he shows softer character. I remembered in one scene, when Raizo (Rain character), was being watched on interrogation room. One police said, He is not seems like a Ninja to me,..It is more like a boy-band member. Do not blame him, he is: a boy-band.  Visit My Blog on JONNY'S MOVEE : http://jonnyfendi.blogspot.com",
      "total_reactions": 1,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2012
      },
      "score": 2,
      "text": "Rain's performance is awesome, but the action really sucks. The blood doesn't have very good visual effects, the film editing is terrible, and the rest of the acting is also terrible. The story is also senseless and lacking depth.",
      "total_reactions": 1,
      "user": "Jedi_Jettson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2012
      },
      "score": 4,
      "text": "Alright, we get the message - ninjas are cool! Most of the action in the film is extremely well handled (other than a frankly quite laughable chase on foot through speeding traffic) and for the most part the fight scenes are creative, stylised and brutal, with copious assistance from CGI. The film is very obviously a McTeigue/Wachowski collaboration, with similar aesthetics and an identical central theme of revenge as their previous joint effort, V for Vendetta, though it lacks that film's darkness and political subtext. Lead actor Rain, with his dance background, can handle the stunts without difficulty, but he isn't a particularly good actor and his vengeful ninja outcast Raizo doesn't make for a very compelling protagonist. The rest of the cast, particularly Naomie Harris are a little bland and their performances underwhelming. Sho Kosugi, however, makes for a decent, extremely menacing antagonist, the diabolical ninja Lord Ozunu, though Kosugi is simply once again playing the kind of character that made his name. The film's script leaves a lot to be desired, and the story is conventional, occasionally verging on dull. In addition, the finale, though technically accomplished, makes it crystal clear that all you need to defeat an army of highly trained killing machines armed with swords is to carry a lot of guns. Ninja Assassin may be action-packed and gloriously ultraviolent, providing sporadic perverse pleasure, but it's also as dumb as a bag of rocks.",
      "total_reactions": 1,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "I'm very disappointed with all these \"critics\" giving thumbs down to this masterpiece. If you are a movie \"critic\" and you gave this NINJA movie a thumbs down... you don't know  about Ninjas and NINJA fans.",
      "total_reactions": 1,
      "user": "theBrainJuice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "This movie is so under-appreciated it is a crime.",
      "total_reactions": 0,
      "user": "jediboy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "\"Ninja Assassin\" knows exactly what it is-A bloody good time. Though, many people mite not care for the offerings that this movie has for us, this movie was really made to be a load of bloody fun! Just sit back, relax, and enjoy gore, the action, and the thrills.",
      "total_reactions": 0,
      "user": "xXRenTyrellXx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2013
      },
      "score": 3,
      "text": "To be expected, all it has to offer is gruesome violence. Other than that there is nothing to interested in, and a ninja swinging a blade around- no matter how skilled he is- gets boring when that is all there is to be interested in.",
      "total_reactions": 0,
      "user": "KaptainHutchino"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "Without a doubt, ninja are the most mysterious martial artists or killers imaginable. Sho Kosugi for decades has somewhat amazed us with his talent for bringing the ninja reputation to the captive eye, but beneath all of the luster there lies a fragment of boringness, false perception, and over glamorous situations where you begin to wonder why the story panned out the way that it did. You never expect a gory killer to associate himself with a hot chick and have to rely on her. I mean, lets face it- that kind of a man would have disposed of her to keep himself hidden. Instead, they go off on their crazy Hollywood adventure. I gave this a six only because of its action packed flesh-ripping sequences, but its not something that could entice me twice.",
      "total_reactions": 0,
      "user": "Ninja7Everin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2015
      },
      "score": 3,
      "text": "As I looked in the Bluray cover my friend borrowed me, I already knew what I was going for in this film: A brutally violent, yet overly serious and too choppy motion picture to be entertaining. That is the case with this movie, but what's worst is the addition of paper-thin characters, half-baked plotting, and poorly directed, edited gory scenes, with zero knowledge of what is going on in the particular scenes. There was no sense of fun in those sequences. Sure, there were ninjas with knives, swords, bladed chains, but does that really equal to good action? Absolutely no. The way director James McTeigue structured the action beats was beyond rushed and horrendous, with quick cuts, unnecessary close-ups and unrealistic jumps, along with awful editing, which is in display just by looking at the obviously shoddy CGI blood effect. Of course this guy learned nothing about \"Matrix\".",
      "total_reactions": 0,
      "user": "diogomendes"
    }
  ]
}