{
  "mc_avg_user_score": 5.4,
  "mc_metascore": 68,
  "mc_mixed_rating_frequency": 170,
  "mc_movie_name": "Noah",
  "mc_negative_rating_frequency": 227,
  "mc_positive_rating_frequency": 323,
  "mc_pro_critic_reviews": [
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 91,
      "summary": "Despite wild deviations in spiritual themes and execution, nothing in Noah approaches sacrilege or surrender, making this an acutely sensible biblical epic. It may simply be too strange for the masses to notice."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 90,
      "summary": "Darren Aronofsky brings wild ambition and thrilling artistry to one of the Old Testament’s best-known, most dramatic, least plausible stories — Noah and the ark — with Russell Crowe infusing the role of God’s first seaman and zookeeper with all his surly majesty."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2014
      },
      "score": 90,
      "summary": "Darren Aronofsky wrestles one of scripture's most primal stories to the ground and extracts something vital and audacious, while also pushing some aggressive environmentalism, in Noah."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 88,
      "summary": "This is a Noah for the 21st century, one of the most dazzling and unforgettable biblical epics ever put on film."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 83,
      "summary": "Darren Aronofsky's Noah is not just one of the most ambitious films I've seen this year, it's one of the most ambitious films I've ever seen."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 83,
      "summary": "Overall, Noah represents a respectful take on an old story by filmmakers who pose a pertinent question. The Creator promises never again to wipe humanity off the face of the Earth, signing that covenant with the cheering image of a rainbow. Does that mean he won’t let us wipe ourselves out millennia later, if we’re hell-bent on doing so?"
    },
    {
      "critic": "Curtis Woloschuk",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2014
      },
      "score": 80,
      "summary": "Aronofsky’s first bona-fide blockbuster is a sweat-stained labour of love. Audacious and uncompromising, it’s a legitimate epic."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 80,
      "summary": "Aronofsky’s sixth film is not the Noah you know, but a hundred-million-dollar Chinese whisper; a familiar story made newly poetic and strange with a flavour that’s less Genesis than Revelation."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 80,
      "summary": "Noah manages to blend the expected with the unexpected and does it with so much gusto and cinematic energy you won't want to divert your eyes from the screen."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 80,
      "summary": "Noah can be silly or sublime, but it's never less than fascinating. I was on board from start to finish."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 80,
      "summary": "Taken strictly as a piece of filmmaking, Aranofsky's Noah is ambitious. And as theology, well, it may not hew exactly to the letter of the law, but the spirit survives intact."
    },
    {
      "critic": "Dan Jolin",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2014
      },
      "score": 80,
      "summary": "Inventive, ambitious, brutal and beautiful: a potent mythological epic. But also wilfully challenging, as likely to infuriate as inspire, whether through its unmitigated Old Testament harshness or its eco-message revisionism. If only more blockbusters were like this."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2014
      },
      "score": 80,
      "summary": "It is never less than fascinating — and sometimes dazzling — in its ambitions."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 75,
      "summary": "Darren Aronofsky's Noah is the Old Testament on acid. It's the movie equivalent of Christian death metal. It's an antediluvian Lord of the Rings, fist-pumping, ferocious, apocalyptic, and wet - very wet."
    },
    {
      "critic": "Matt Zoller Seitz",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 75,
      "summary": "Noah is more of a surrealist nightmare disaster picture fused to a parable of human greed and compassion, all based on the bestselling book of all time, the Bible, mainly the Book of Genesis."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 75,
      "summary": "Viewers may not agree about what they’ve seen when they come out of Noah. But there’s no doubt that Aronofsky has made an ambitious, serious, even visionary motion picture, whose super-sized popcorn-movie vernacular may occasionally submerge the story’s more reflective implications, but never drowns them entirely."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 75,
      "summary": "If we want a bigger picture, we’ll have to wait for God to green-light “Noah: The Next Generation.”"
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 75,
      "summary": "Holy ship! Crowe’s grumpy Noah and his dysfunctional clan help God reboot the too-wicked world in this imaginative (but hardly sacrilegious) and visually spectacular elaboration on Genesis."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 75,
      "summary": "Hold off on burning Aronofsky at the stake till you see Noah, a film of grit, grace and visual wonders that for all its tech-head modernity is built on a spiritual core."
    },
    {
      "critic": "Stephen Whitty",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 75,
      "summary": "The film is best when it isn't trying to be an action epic, but is simply being a character study. Here stands a man, asked to prepare for an unspeakable thing by an unknowable presence."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 75,
      "summary": "Noah is no silly action blockbuster with a Biblical pretext. Rather, it's the product of writer-director Darren Aronofsky's vigorous engagement with the Biblical story and what it might mean in our time."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 75,
      "summary": "Will Noah anger some rigid purists and scholars because of the liberties it takes? Perhaps. But the point to take home is the message the movie leaves you with, which works regardless of your faith (or lack thereof). Humans are inherently flawed. How we deal with those defects is what truly matters."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2014
      },
      "score": 75,
      "summary": "It isn’t “The Ten Commandments” and Crowe is no Charlton Heston. But Noah makes Biblical myth grand in scope and intimate in appeal. The purists can always go argue over “God Isn’t Dead.” The rest of creation can appreciate this rousing good yarn, told with blood and guts and brawn and beauty, with just a hint of madness to the whole enterprise."
    },
    {
      "critic": "Bob Mondello",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 70,
      "summary": "All of which makes the film Noah psychologically credible — his behavior is very much what you might expect of a man who has just condemned millions of screaming souls to watery graves. And it makes the film unpredictably suspenseful, which is dramatically the most welcome thing you could ask of a biblical epic."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 70,
      "summary": "There’s so much delusion and so much delight in Noah that I have trouble distinguishing one from the other, or determining whether its most outlandish flourishes qualify as mistakes or as strokes of genius."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 70,
      "summary": "Mr. Aronofsky’s earnest, uneven, intermittently powerful film, is both a psychological case study and a parable of hubris and humility. At its best, its shares some its namesake’s ferocious conviction, and not a little of his madness."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 70,
      "summary": "It’s an unwieldy, sometimes overreaching effort, but the laudable ambition makes it easy to forgive some rough patches."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2014
      },
      "score": 67,
      "summary": "Aronofsky’s story of Noah and his ark is far-removed from our collective recollections of Sunday school pageants and Cecil B. DeMille extravaganzas. Instead, this film opts for the sort of human-scaled realism that almost allows us to smell the dank stench of a menagerie cooped up for 40 days and nights on a water-swept barge."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 67,
      "summary": "The result is a monolithic slab of Biblical fan fiction, at once deeply serious and seriously silly. It’s a mess, but at least it’s the mess its creators wanted."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2014
      },
      "score": 63,
      "summary": "The movie as a whole is a mixed bag. It's overlong and a times sluggish. The fights and battles, designed to give an epic fantasy feel to the movie, are grave miscalculations."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 63,
      "summary": "Noah is no by-the-book Bible story. Think of it as a visually mesmerizing sci-fi adventure saga loosely based on the book of Genesis."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 63,
      "summary": "Noah is equal parts ridiculous and magnificent, a showman’s folly and a madman’s epic."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 63,
      "summary": "Neither fish nor fowl, neither foul nor inspiring, director and co-writer Darren Aronofsky's strange and often rich new movie Noah has enough actual filmmaking to its name to deserve better handling than a plainly nervous Paramount Pictures has given it."
    },
    {
      "critic": "Andrew Pulver",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2014
      },
      "score": 60,
      "summary": "Impressive as much of his film is, however, Aronofsky never quite solves the main challenge of the semi-literal biblical adaptation: what is so economical, and beautifully expressed, on the page can become a heavy, lumbering beast when translated into conventional narrative."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 60,
      "summary": "It’s Aronofsky’s least personal work. So you get a fat dose of conventional melodrama with your Old Testament: It’s the antediluvian \"Gladiator.\""
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 58,
      "summary": "Noah is a movie about big ideas (environmentalism, heavenly obedience versus earthly love) and even bigger directorial ambitions (how to tell a personal story on the grandest of grand scales). But, in the end, it's also a disappointment. Maybe not one of Biblical proportions, but a disappointment nonetheless."
    },
    {
      "critic": "Charlie Schmidlin",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 58,
      "summary": "When focused on the natural world and the internal thoughts of its characters, Noah positively crackles with the energy of a filmmaker inspired by a new perspective on classic material... But the latter half of the film, turgid and hamfisted throughout, cripples the film so severely that it makes one thankful for the added elements to Noah’s story."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "The director’s vision is so dark — and Mr. Crowe’s grumbling, sour-stomach persona so much like a Tums commercial — that you don’t care much what happens to him or his ark, which looks like a big barge with a stove pipe in the middle."
    },
    {
      "critic": "Eric Henderson",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 50,
      "summary": "Once the money shots of Darren Aronofsky's version recede, it becomes ever more clear that his intention is to tackle the capriciousness of Old Testament logic. And, ultimately, to assent to it."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2014
      },
      "score": 50,
      "summary": "The director's murky, ill-conceived take on the world's oldest disaster story contains some of the most pristine visuals produced on a mass studio scale in some time. But it's also constantly tethered to a dull, melodramatic series of events out of whack with any traditional interpretation of the material."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2014
      },
      "score": 40,
      "summary": "Noah is here not to set the record straight, but to set it on its head. This isn't a lavish work of mad genius, it's a movie designed to be a lavish work of mad genius, and there's a difference."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 40,
      "summary": "Darren Aronofsky’s big-ticket retelling of the biblical legend of Noah (Russell Crowe, so damn serious) is a wildly stupid, yet still train-wreck-fascinating piece of work."
    },
    {
      "critic": "James Rocchi",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 40,
      "summary": "The execution of that script – is so clumsy and over-written that nothing in it sticks. There’s a symphony of visuals here, and big strange ideas, but when it comes to the actual characters, we get automatons sleepwalking through clichés."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 40,
      "summary": "Noah, Darren Aronofsky’s often ludicrous, occasionally thoughtful epic, puts theology front-and-center, and doubles down on its blockbuster ingredients — like adding huge rock monsters with glowing eyes."
    },
    {
      "critic": "Adam Nayman",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 38,
      "summary": "What could have made Noah work is the same sense of urgency – of fateful craziness – that made \"Pi\" so memorable, and which also factored into the fatal obsessions of \"The Wrestler\" and \"Black Swan\" (two very flawed movies that admittedly benefited from stronger lead performances than the one here)."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 12,
      "pos_reactions": 21,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 2,
      "text": "This film would be laughable if it wasn't so depressing, and by depressing I mean Aronofsky's blatant disregard for the Bible account he supposedly drew inspiration from.",
      "total_reactions": 33,
      "user": "lennycliff123"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 23,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 3,
      "text": "If you believe in the Biblical version of the story of Noah, this is not the movie for you.  However, if you are a transformer fan, you're right at home.  The actors were solid in their performance.  Hollywood creators never cease to amaze me.  How do you get rocks to act like transformers and yet when their job is finished they get beamed up to heaven. I will NOT recommend this movie to my friends.",
      "total_reactions": 37,
      "user": "phillytom"
    },
    {
      "neg_reactions": 18,
      "pos_reactions": 27,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 3,
      "text": "While not the worst film I've ever seen, Noah has to be one of, if not the most disappointing.",
      "total_reactions": 45,
      "user": "allisonjane65"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 20,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 1,
      "text": "There's a well worn phrase \"if it ain't broke don't fix it\". Why Aronofsky felt the need to tamper with an epic story that would/could have been thrilling and thought provoking in it's unadulterated form baffles me.",
      "total_reactions": 34,
      "user": "antmolly1995"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 17,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 3,
      "text": "Movie held at best 10% of the biblical version of the story.  Acting is ok but too many rock monsters for my liking - I mean ROCK monsters! LOL. Noah is very scary as a character & not at all likeable. want those 2 1/2 hours of my life back.",
      "total_reactions": 30,
      "user": "dave495"
    },
    {
      "neg_reactions": 22,
      "pos_reactions": 27,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 2,
      "text": "What do you get if you mix 130 million dollars, a talented but clearly misguided director and a story believed and respected by hundreds of millions of people around the world.",
      "total_reactions": 49,
      "user": "lenny68"
    },
    {
      "neg_reactions": 16,
      "pos_reactions": 19,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "I want to know who is responsible for the story of this film; whoever it was needs to be fired... immediately! I believe fiction can only be taken so far. 0/10 would not watch.",
      "total_reactions": 35,
      "user": "SpazzBrozz"
    },
    {
      "neg_reactions": 16,
      "pos_reactions": 19,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 2,
      "text": "Incoherent, confusing, and completely stupid.  Major plot holes, overlong, and entirely unfun. wayyyyyyyyyy too damn long.  if you have small children accompanying you whilst watching this film, be prepared to give them \"the talk\". not about sex, but about incest.  remember incest=wincest!!!",
      "total_reactions": 35,
      "user": "ericisadog"
    },
    {
      "neg_reactions": 18,
      "pos_reactions": 21,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 3,
      "text": "This was extremely disappointing. Yes the special effects were cool but that was about it. The story line was... Noah-esque perhaps? It had little to nothing to do with the bible story of Noah. Amid a large number of Christian movies coming out at this time, people should be aware going in that it is NOT a Christian. It's really an environmental movie. It was less Charleton Heston's 'The Ten Commandments' and far more 'The Day After Tomorrow' or 'Birdemic'. Just terrible, the whole thing.",
      "total_reactions": 39,
      "user": "WillADOC"
    },
    {
      "neg_reactions": 15,
      "pos_reactions": 15,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 1,
      "text": "First hour is fine but then it turns into a talk fest with the director making the mistake that if he shows the characters experiencing emotion we will feel it.... doesn't work. The second half slowly dies until you are just waiting for it to be over. The actors are doing an excellent job but there just isn't enough to save it. Don't waste your money, see it on cable where you can watch the best parts and then turn it off.",
      "total_reactions": 30,
      "user": "nameless"
    },
    {
      "neg_reactions": 18,
      "pos_reactions": 17,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 1,
      "text": "This movie has zero to do with the true Noah in the Bible, and should be considered blasphemy against the truth of God's history provided for us in the Bible. This is typical Hollywood garbage trying to make money from the hype that followed the popularity of that Bible TV show. Apparently they missed the point they need to follow the real story of the Bible not a made up fantasy using Bible characters and general story back drop. I can just see people who know little to nothing about the truth actually think this is what really happened. Sad very sad indeed, but what should we expect from immoral establishment media who hates Christianity and truth.",
      "total_reactions": 35,
      "user": "sirkel"
    },
    {
      "neg_reactions": 19,
      "pos_reactions": 17,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 2,
      "text": "bleak, too slow, drab, no laughter, no smile, historically inaccurate not that i care...as i was leaving theater a woman said 'that was horrible'...i tried hard to like it because i liked Aronofsky's 'Wrestler' and 'Pi' and Black Swan a little but this was so drab, drawn out...nothing to it...bad news flick.",
      "total_reactions": 36,
      "user": "jcjs33"
    },
    {
      "neg_reactions": 19,
      "pos_reactions": 16,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "I don't get all the negative reviews and hate. On one end people are mad because of this director's interpretation of the story in the Bible. On the other end people won't like it because it has to do with the Bible. And then you will have people not like for other stupid political reasons not even mentioned. I get it.... for some reason the film is polarizing. This movie is NOT the same as the cartoon movie you saw as a kid (yes people that is also one guy's interpretation). However it does have essentially everything that is in the Bible with some artistic flair which is cool with me. Sure they don't say \"God\" but everybody knows \"The Creator\" is \"God\" so whatever... that does kinda bug me but I won't hate on it too much. In any case I enjoyed the movie. It has good action, a pretty faithful telling of the story, interesting take on the pre-flood world, fantastic acting etc. I think you guys need to see the movie for what it is and not make it more than it sets out to be. It's a really good film.",
      "total_reactions": 35,
      "user": "theoffice"
    },
    {
      "neg_reactions": 45,
      "pos_reactions": 32,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "An incredible movie with great graphics, story and characters. As a christian I do not find a unique interpretation of the Noah story a bad thing. No, on the contrary I think it is a really good thing - if I want to read the actual story, I'll read the Bible. The Noah is not a retelling, but rather an attempt to understand the values and to make the short tale something bigger and more complex. And they did it right - drama made me weep, action made me thrilled, conclusion gave me feeling of hope and happiness",
      "total_reactions": 77,
      "user": "Byarru"
    },
    {
      "neg_reactions": 26,
      "pos_reactions": 17,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "Ultimately, Noah is a powerful but complicated experience that’s deeply fascinating in the way it subverts expectations. It will crash over you like the flood itself, knocking you back, allowing you to take in awe-inspiring visuals but also forcing you to contemplate complex questions. An absorbing character study and an action epic all at once, Noah is a highly ambitious, largely successful outing for its director and star.",
      "total_reactions": 43,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 26,
      "pos_reactions": 16,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "Excellent movie! Highly engaging & greatly acted! Some amazing bible themed CG set pieces spread across! Outstanding score by Clint Mansell will drive you from start to final credit roll!!! Amazing movie",
      "total_reactions": 42,
      "user": "splitshock"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2014
      },
      "score": 1,
      "text": "I am a longtime fan of the director so my disappointment here is massive. In a nutshell it is a pro-veganism, pro-ecology,pro-self-hating,pro-social isolation and anti-progress gritty reboot of the known tale of the Bible. The main problem with this movie and its most unforgivable trait is that it tries sadistically hard to enforce those ideals to the viewer, to the point that it makes the viewer actually hate the protagonist and his headstrong self-righteous opinions. The society it shows of Sodom and Gomorrah is clearly a parallel of our society today. The only things that differentiate it is the lack of iphones and presence of rugs. 'We are evil and deserve to be destroyed' he preaches. 'It is a crime against nature to eat an animal' he says and insinuates by showing a man gutting a lamb with his bare hands and eating it raw. This is the work of a raging misanthropist wrapped in a Michael Bay exterior so the masses he hates so much will flock  and pay to watch his delirium.   Despite sharing some of his views,I cannot help but hate this unprecedented ideological enforcement and the movie as a whole as a result. If you can ignore all of the above, the movie has some strong visuals and performances by the cast and maybe you should give it a go. If not stay away.",
      "total_reactions": 2,
      "user": "AliasAndrew"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "text": "I just saw this movie and I regret every minute of it.  This is the first thing I'm doing after the movie was over, writing a review of how bad it was.",
      "total_reactions": 2,
      "user": "tyrealsan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2014
      },
      "score": 5,
      "text": "Noah tries to be an epic biblical journey, a visual spectacle, a psychological thriller, but it fails in every aspect. It's true, the performances are great, but there's something about the plot that turns out to be dull and flat. Aronofsky has done way better films.",
      "total_reactions": 1,
      "user": "RamonGuerrero"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2014
      },
      "score": 3,
      "text": "Aronofsky's \"Noah\" is a bold yet impotent attempt to portray such a well known epic. I kept thinking throughout that \"old Hollywood\" with Charleton Heston and the attendant grandeur would've been so much more satisfying. The film's end was totally lackluster given the fact that this count-them-on-two-hands set of people were the only ones left to repopulate the planet! The magnificent gravity of that was never adequately expressed. Very disappointing attempt at what should've been an amazing experience.",
      "total_reactions": 3,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2014
      },
      "score": 3,
      "text": "Aronofsky's film has the same flaw as the Biblical Noah story.  At the end, Noah is still hearing voices from on high and believing that, because of that, he is right, infallible, and righteous.  The history of humanity has been haunted by these voices from on high resulting in most of the wars, killing, and general misery.  Despite the \"killing\" part of his philosophy, the Cainanite (sic.) King was right in his comments about free will.  Noah was a truly evil man.",
      "total_reactions": 3,
      "user": "BogKid"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "Confused, baffling, overly violent humourless and contrived, Noah suffers from a complete lack of focus and direction (other than into the belly of a difficultly realised arc) which leaves its actors struggling, its epic set pieces cold and its emotional engagement minimal.",
      "total_reactions": 16,
      "user": "schmores"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "I learned some things from this movie! Apparently Methuselah was Gandalf! And Noah built the ark with the help of rock elementals! And \"righteous in the eyes of God\" means \"psychotic homicidal maniac\"! And when the Bible says \"Noah and Shem and Ham and Japeth, the sons of Noah, and Noah's wife and the three wives of his sons with them, entered the ark\" it REALLY means \"Noah, his wife, his kids, Shem's wife, and this guy who snuck on board and tried to kill Noah\"! And those explicit instructions in Genesis for how to build the ark? Really that was a cryptic acid trip where nothing was really explained. Thank you Darren Aronofsky for setting me straight. I thought that I knew how to read, but apparently I was wrong! And thank you Russel Crowe for your most dynamic performance yet!",
      "total_reactions": 23,
      "user": "WarKittens"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "Not Biblical except for a very few references.  The special effects were pedestrian, at best.  We were so disappointed, having looked forward to the movie.  We should have walked out when the first words on the screen were, \"In the beginning, there was.....nothing\"!  Or perhaps when the rock beasts showed up!  Don't waste your time or money!",
      "total_reactions": 15,
      "user": "kechmocash"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "text": "It is just an awful movie. There is no nicer way of saying that. Forgetting the religious objections completely, the movie is long, boring, and not in the least entertaining. When you add to that the fact that it seems engineered to piss Christians and Jews off, you end up wondering what the hell they were thinking.",
      "total_reactions": 10,
      "user": "VukBrankovic"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "If you eat meat then you must die... well that is what this movie is about. Humans are evil because we eat meat and need to be wiped off the earth. The action in the movie was outweighed by the boring boat ride. I noticed a bunch of people walk out at that point. I would have too if I hadn't been with some friends. Turns out I wasn't the only one in my group that wanted to walk out. Not only am I mad that I paid for the movie, but I probably won't watch another movie in theaters for a while. Yep, that bad.",
      "total_reactions": 19,
      "user": "n0junk"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "A Horrible perversion of everything the bible teaches, whats worse is it seems to push a vegan/environmentalist/atheistic point of view down the viewers throat.  It's not a movie so much as it seems to be propaganda by the director.",
      "total_reactions": 14,
      "user": "ydoc16"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2014
      },
      "score": 1,
      "text": "first of all they get almost everything wrong.  If you are going to do a historic piece, you should at least try to keep the story correct. only the names re the same and there is an arc full of animals and birds, etc.  that is where it ends being the story of noah.  Cain kills Able and starts an industrial society, according to the narrator, but since when did people in an industrialized society still run around in ragged clothes and animal skins and use clubs and swords?  And then fallen angels come down to help mankind and are crusted with volcanic rock as punishment from God.  That's so wrong, I'm not even going there. And it just gets worse.  Noah is supposedly given the decision to save or destroy all of mankind, by God, and he chooses to destroy all. so this is offensive  not only Christians, but to anyone who ever saw a great story come to screen, and it was all screwed up by Hollywood.",
      "total_reactions": 23,
      "user": "tuneintofans"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 2,
      "text": "I went with high hopes based on some early screening feedback, talk about disappointment! I expected a lot of story fill in and even some liberties on surrounding events, but most of this movie had absolutely no basis in the biblical account. Noah as presented and played by Crowe was no better than the people that were being destroyed! I am used to Hollywood presenting male characters as weak, flawed and stupid, but c'mon! Plus BORING! at least make it entertaining! Now on to the absolute lack of imagination in stealing from LOTR...The cross between Ents and Trolls that were inserted as a major story driver are not only found NOWHERE in the bible (I know they used the giant Nephilim that are mentioned, but really?}, but  I fully expected as Sauron's army stormed the Ark for Gandalf to step out, plant his staff and yell 'You shall not pass!!!'. The amount of visual theft should have Jackson suing!",
      "total_reactions": 16,
      "user": "Ed1Smith"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "Absolutely horrible! They made Noah look like a fumbling idiot, chasing down his daughter-n-law trying to murder her twin babies because God said only a certain amount could live. He doubted God in the movie and had no hope. The worst part was the rock monsters with glowing eyes who helped build the ark! Say what???????????????????? What the heck? This was more science fiction then biblical. Who came up with rock monsters???? I couldn't believe my eyes! Worse movie ever! The only thing that resembled the bible story was the name Noah, an ark, rain, and the dove. And get this! The villain in the movie even stowes away with them on the ark after the earth has flooded and Noah's son helps plan his father's murder! Say what? Horrible movie!!!! Don't waste your precious money. I want mine back!",
      "total_reactions": 25,
      "user": "Fantasygirl"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 1,
      "text": "Are you kidding me?  What, they ran out of comic book super-heroes to make blockbusters out of so Hollywood is resorting to Bible characters?",
      "total_reactions": 25,
      "user": "paulmars"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 1,
      "text": "I can't believe how many positive reviews there are from professional critics! Were they threatened?! Bribed?! Or did they just see a different movie than me.",
      "total_reactions": 25,
      "user": "hayceelynt_2"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "Amazing visuals, great acting and a really good story. I really didn't know Emma Watson was that good. I enjoyed the movie very much. Not a penny was wasted.",
      "total_reactions": 18,
      "user": "l4zy610"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2014
      },
      "score": 1,
      "text": "Very to little of this movie is biblical, Golems, Magic and Noah is a raging madman? Leave it to an atheist to try and discredit God by calling it a \"Creator\".",
      "total_reactions": 9,
      "user": "Kuse"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2014
      },
      "score": 4,
      "text": "No, I didnt like this. First of all this movie is rough misinterpretation of Bible story, for me, religious man, this is bad. I am not any sort of religious fanatic, I am not going to curse this movie, no. I just didnt enjoy the fact of such Bible rework. Second, actors are kinda overplaying, especially Conelly and Watson. I know Conelly is a great drama actress, and I like her, but this movie should be about Noah, God and The Sundering, not about Noahs wife nerves and arguing. I watch movies to enjoy the plot, decorations or actors play, but spitting tears and saliva at the face of Noah is quite disgusting. Scenes of pregnancy and birth accompanying by Watson screams is even more disgusting. This movie is dirty - this is the right word - dirty and dark. This is not a drama, not a disaster film, I dont know what is it. Aronofski is a great director, but I believe he failed this time.",
      "total_reactions": 9,
      "user": "Violett"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "Just saw the movie and it is pure garbage from almost any point of view ,such as , script , acting , costumes,  sets . I nearly walked out several times . Any \"critic\" who rates more than 2 stars don't ever trust again , they don't have a clue.",
      "total_reactions": 20,
      "user": "racer10"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2014
      },
      "score": 2,
      "text": "Just bad, like they wanted to do a new take on Noah and halfway decided to play it safe and give you the classic story with bad acting and a lot of special effects. Wanted my money back 30 minutes in, even though I honestly tried to like it.",
      "total_reactions": 11,
      "user": "Menroth"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "A story from the bible meets science fiction with rock monsters!?!?  What were they thinking?  Would have definitely skipped this movie if the trailer showed how truly ridiculous it is.  The rock monsters are not shown in the movie trailer at all!",
      "total_reactions": 13,
      "user": "MrWestside"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 1,
      "text": "Firstly I should admit that I saw this movie for free - and it was still too expensive. Preachy eco-twaddle delivered through wooden performances in an epic marathon of sheer boredom.",
      "total_reactions": 13,
      "user": "TwentyTwotwenty"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "An interesting movie to say none the less it never stops amazing you. Finally a religious movie that raises the roof and exposes what will happen to the wicked hearted.",
      "total_reactions": 15,
      "user": "M9ki"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 1,
      "text": "First off, Aronofsky and the bible shouldn't even be in the same sentence. I'm not even a bible nut, I don't have a religion, but holy **** this movie sucked every one of the male animal's testicles, and thoroughly. The rock creatures weren't even original, it was like a play on the tree guardians from The Two Towers. I did go into this movie knowing full well the probability it would be a complete train wreck, I just didn't know how bad of a train wreck it could be. Another thing, what the hell was a bear trap doing in the forest when Ham and the girl were running back? Anyways, the 1 isn't even for this movie, it's for making a love scene between Natalie Portman and Mila Kunis become a reality.",
      "total_reactions": 15,
      "user": "2thepoint"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "NOAH is overproduced and just plain awful. Metacritic requires 150 characters but I can't come up with any more to describe this total vapid mess of a movie.",
      "total_reactions": 21,
      "user": "LowbrowCinema"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "What on heaven was this? I've always wondered how Noah build the ARK. Now, I know ROCK MONSTeRS did, lol. What were those people wearing Jeans n leather boots pathetic costume department.  I still don't know how I survived 2 1/2 hrs of Aronofsky's plague.",
      "total_reactions": 26,
      "user": "franissavio"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "I can't believe Hollywood is going so low, What exactly is this story, I understand you smoke strong stuff but give the world this, is unacceptable, definitely something need to fixe at Hollywood. I need a refund cuz Noah is a crap.",
      "total_reactions": 22,
      "user": "junofoto"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "Dont listen to the RELIGIOUS NUT CASES reviewing them they sleep with there dear old  bibles every night and feed their bibles with their mouths. When they walk out of the house its like they are seeing hell so its expected for them to give everything one. Only at night time with there bibles they are truly happy. They are sub human and not to be listened to. There 1 actually means a 7 or higher. but as I said before all they can rate anything is a 1 other then there precious bibles",
      "total_reactions": 20,
      "user": "Kirbyeh"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "I don't understand the negative reviews. Cinematography is superior, acting is excellent, story line was made suspenseful. (Pretty good for a biblical movie.) All together - very entertaining.",
      "total_reactions": 20,
      "user": "jlbrown100"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "Let me preface my remarks by stating I am not one of those religious fanatics as I could care less.  The public gets hosed again by the bought & paid for professional critics. This movie is so bad and boring, that you almost hope, the entire planet gets washed away. Somewhere PT Barnum is smiling as it's true a sucker is born every minute.  How can a professional critic with even an ounce of dignity not expose this film for the crap it truly is.  Anthony Hopkins has about 4 minutes of screen time. He has to be embarrassed by his performance in this dreadful movie. Russell Crowe as Noah is mentally deranged. You don't care one iota about any of the characters. Rock Monsters built the arc?  Where were the transformers?  LOL  And just when you thought the movie is mercifully over, it goes on and on and never ends. How ludicrous was this. It starts to rain. About a minute later the dam breaks from below ground and everyone is washed away. Why would the Creator, by the way, never mentioned as G-d, have it rain for one minute and then a minute later water is everywhere as if a broken water main. I wouldn't watch this movie again on free TV.  Avoid at all costs.",
      "total_reactions": 16,
      "user": "fantasy"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2014
      },
      "score": 2,
      "text": "The film is showing  Noah as some kind of psychopathic servant of a deaf evil deity . It is like \"Lord of the Rings\", but with bad CGI and with psychopaths.",
      "total_reactions": 8,
      "user": "OTPOBEH"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "text": "Is 2014 a magnet to biblical movies?Despite the spot on performance from Emma it just feels like...i don't know 'reverse sci-fi' with too much imagination",
      "total_reactions": 8,
      "user": "Ziscky"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2014
      },
      "score": 3,
      "text": "Rock creatures built the Ark, rock creatures ?  Such a weird movie.....using bad cartoons to explain the state of the earth and how it came to be....Movie was watchable but could have been GREAT.   The Rock Creatures made the movie laughable.....too much MAGIC....the movie should not be called NOAH because it really was a different movie.",
      "total_reactions": 6,
      "user": "evearcher"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2014
      },
      "score": 1,
      "text": "Dont waste youre money or youre time on this one, if you are going to make a Biblical epic at least follow the story. This was Holly Wood at its worst making things up as it goes along, worst film i have ever seen.",
      "total_reactions": 4,
      "user": "sewandsews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "text": "Forget that the movie completely ignores the actual Noah story and puts an environmentalist spin on it. The look of the movie wasn't good even. Everything looks bleak. The graphics did not impress me. it looked outdated, in fact. Couldn't they have designed the Rock monsters a little better? I know Scifi channel could have done a better job. The story was dull, the characters cranky, and in the end, it all seem pointless. Aronofsky ruined the character of Noah and turned him into a maniac.",
      "total_reactions": 2,
      "user": "Isotopesam"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2014
      },
      "score": 5,
      "text": "I'm a fairly big fan of Aronofsky, I have enjoyed all of his films and until 'Noah' I considered his portfolio of work to be incredibly consistent in terms of quality.",
      "total_reactions": 2,
      "user": "themillz1988"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2014
      },
      "score": 1,
      "text": "The first hour is unbearable, the last hour is boring and the entire movie had no life to it. The epic story of Noah has been  turned into a disaster of epic proportions.",
      "total_reactions": 2,
      "user": "csw12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "Noah starts off surprisingly terrible and then manages to rise just above mediocrity in the end. A Strange way to present the story. It was no fun at all. The visuals were good at times.",
      "total_reactions": 2,
      "user": "Trev29"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "text": "This movie can't possibly be directed by Aronofsky. Everything from the art direction, to the acting, the plot and pace was horrible. Goes on to show how corrupted journalists are hypocritical liers...",
      "total_reactions": 2,
      "user": "Augure"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "This film was created for the sole purpose of making fun of the Bible and spit in the face to Christians. Is horribly inaccurate on purpose and Noah looks like a psychopath. Do fallen angels wanted to help the man? Think before you shoot this smoked marijuana, pure chlorine injected and even licked a poisonous frog.",
      "total_reactions": 2,
      "user": "guitarone47"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2014
      },
      "score": 5,
      "text": "Personally I was divided by 'Noah'. I'm not well acquainted with the intricacies of the Bible story so I entered the cinema not really sure what to expect. I immediately, however, recognized that this rendition of the story would be embellished and changed, something I have absolutely no problem with.",
      "total_reactions": 2,
      "user": "Laffingravy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2014
      },
      "score": 6,
      "text": "So-So... Well thought out details to fill the gaps in bible story. Special effecs good to OK. Expected a little more from a Russel Crow flick, but good enough to rent from Red-Box when available.",
      "total_reactions": 2,
      "user": "TBrianBryan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2014
      },
      "score": 5,
      "text": "Noah may be visually outstanding and very well-acted, but it is unable to satisfy due to a weak third act and unnecessary liberties Darren Aronofsky decides to take.",
      "total_reactions": 2,
      "user": "SimonSays18"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "I'm going to step away from all religious interpretations and regard this simply on its merits as a film, not as a traditional biblical story. The problem is, it doesn't really have many merits. This film was simply two hours and fifteen minutes of tedium. The special effects are barely worthy of a SyFy Channel original film. The acting is overly hammy and in some cases mind-numbingly wooden, part of which I feel is the part of the script, which eschews actually writing good dialogue for what seems to be just spewing out statements at random. The editing ranges in style from choppy to lingering overly long on mundane, uninteresting scenes. Everything is just...off. As bad as everything else felt, the score was possibly worse. I've never had issue with the work of Clint Mansell before, but for Noah he's opted for a blaring two note score that just keeps screaming the same two flipping horn blasts in your face over and over again. This is also the first time I would ever describe Aronofsky's directing as \"ham-fisted\". Everything feels overdone, self-indulgent and overproduced. I usually walk out of a Darren Aronofsky film contemplating the themes and mulling it over in my head to uncover deeper meanings. This one only stayed with me as a bad memory.",
      "total_reactions": 2,
      "user": "mzup77"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "I love movies very much and I respect the imagination and time and effort afforded to them. The story of Noah and the ark is a very old, well respected, and loved story, many people believe those events really occurred. When you get the chance to make a movie that stems directly from The Holy Bible, you would think it would stay knit at the waist with it as far as accuracy and tone. Aronofsky is obviously not a religious man, otherwise he would have had much more respect for the story of Noah and the nature of the characters involved. Portraying Noah, who has been said to have been directly guided by God to save the human race and its righteous moral ideals, as a crazed lunatic who spends most of the movie dazed and confused about his purpose who needs help from giant rock people and who eventually is convinced he needs to kill his family, is quite a slippery direction to take. it doesn't seem to paint a pretty picture of God or his followers. Though I will note that that the title \"God\" was not even used once in the entire film. From the artsy perspective, this was a well done unique piece of movie making. That explains why a simple bible story made it to such a large scale movie in this day and age. It was warped. Severely. The graphics were impressive and dazzling, the acting performances were polished and sharp, it was coordinated well. But the point of telling the story of Noah and his trials with the flood and the rest of a wicked world and a wicked people, and his dealings with God, got completely lost. Way to go. I cannot support this movie.",
      "total_reactions": 2,
      "user": "BigZ"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2014
      },
      "score": 9,
      "text": "Simply amazing! I get stuck all the course of the film, to the dip of the plot and to the grandiose special effects. Great acting, great elements of emotion, drama, angst, and very few cliches and predictable elements. People who became negative this movie, most certainly mixed their religion and their beliefs. I as an atheist, I attended an amazing story extremely well executed visually and sonically.",
      "total_reactions": 25,
      "user": "docarmobruno"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 1,
      "text": "Average acting, overly grandiose soundtrack, jittery cinematography, and ridiculous special effects that were often poorly executed make this a waste of money, time, and a good piece of fiction known as the Bible. I agree with those who have called this movie a cross between \"Transformers\" and \"Waterworld\". Add \"The 300\"  and you get a blood and water soaked disaster movie that had me wishing that  Noah's poorly constructed ark would just sink and get it over with.",
      "total_reactions": 23,
      "user": "LightninWill"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "Biblical accuracy - pretty accurate, most \"inaccuracies\" are just filling in blanks. Reviews that say otherwise need to reread their Bible.",
      "total_reactions": 17,
      "user": "ThatDR_V"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2014
      },
      "score": 9,
      "text": "Let’s begin where the Book does…",
      "total_reactions": 17,
      "user": "RobMcQueary"
    },
    {
      "neg_reactions": 16,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "Before we start, let's make a note about the controversies surrounding the movie. So many people got sensitive because it wasn't their \"exact interpretation\" of the story. Settle down. Be thankful that someone in HOLLYWOOD actually made a movie about this biblical tale. Now, time to review.  Darren Aronosky (hope I spelled that right) is at it again with one of the most destructive and action-packed tales from the Bible. Who better to do it? Noah is a home run in terms of movie making and sits along with Requiem of a Dream and Black Swan in a stalemate. Everybody in the movie does a fantastic job and all feel equal in terms of skill and screen time. While it doesn't have as much action as you'd expect, the drama is still amazing and even sad at times. Speaking of action, what you do get is phenomenal. Giant rock men fighting against regular men with armor and spears, destructive water effects, and my jaw was open so many times during the action. But sadly, I felt there wasn't enough. I'd never want it to be a Michael Bay kind of movie, but if I got 15-30 minutes more of action, I'd be very satisfied. Another flaw I noticed was that it can be a little hard to follow at times. A few times I thought to myself \"OK...let me think this over...\". While the story can be harsh at times, I appreciated these parts and they make the movie feel like something different. There's so much more to say, but you should already get the gist that you should see this movie. It's worth every penny.",
      "total_reactions": 30,
      "user": "SimpleReviewz"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2014
      },
      "score": 9,
      "text": "I felt this movie was astounding – flawed, but astounding.  It is what it wants to be and it does not bow to convention.  It is both a block buster and a psychological character study.  It is both Biblical and inventive.  It is both digital and auteur.  It is also, obviously, very thought-provoking…which is more than can be said for most big movies these days.",
      "total_reactions": 26,
      "user": "ScrawnyPunk"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2014
      },
      "score": 4,
      "text": "I wasn't expecting any accuracy to the bible story but this was frustating. So many drugs man. Don't watch. Unless you like special effects and CGI, but if so keep away from the plot",
      "total_reactions": 11,
      "user": "Alan250"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "The biblical story of Noah is fake too, so I don't see why Christians are getting so worked up about this. It's a nice movie. Christians are just mad that the director didn't misinterpret Noah's story to their liking.",
      "total_reactions": 20,
      "user": "Brute1995"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "Encantadora y atrapante pelicula para ver en familia,los actores una joya la trama es  increiblemente atrapante mucha emocion y nada triste, como me gunstan ami",
      "total_reactions": 18,
      "user": "Crist"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2014
      },
      "score": 1,
      "text": "What a waste of money! I am not a very religious person but I found it disrespectful to the Bible and religion. In two words lame and stupid. They missed the opportunity of making a great film.",
      "total_reactions": 9,
      "user": "bartmir"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 2,
      "text": "This movie should have been renamed \"Ila\" because it felt like the film was really about her struggles from a kid to a mother. The CG animals were designed and animated in a very lackluster way. The animated CG intro was, for lack of a better word, a joke. Every character pretty much had the same expression on their faces the whole way through, which is appropriate in this case but it really bores the audience and dulls the character. I went because of the interesting reviews, but now I realized I probably haven't read them carefully enough. I am one of the many others who want my dough back. It's a shame, really: it had good potential.",
      "total_reactions": 16,
      "user": "petitorenji"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2014
      },
      "score": 9,
      "text": "Personally I enjoyed this movie as a fiction film, though if you are looking for an accurate biblical tale it might not satisfy your expectations. I feel the people giving this bad reviews are only doing so because it does not fit \"their\" view of the biblical story.",
      "total_reactions": 23,
      "user": "order"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "I hereby contribute a series of two word mini-reviews of the film, Noah.",
      "total_reactions": 14,
      "user": "Rossi163"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2014
      },
      "score": 3,
      "text": "I went to see this full of high expectation,but almost left halfway through I was so disappointed...Lots of looking into the distance, histrionics and overloud music does not compensate for a poor script. Too many holes in the film for my liking,my friend felt the same way.Basically a waste of money, wish I had not bothered. Some of the story was hard to follow too, and did not bear much resemblance to the actual biblical story! Save your money!. An epic it is not inspite of the good actors(Crowe, Winstone & Watson).",
      "total_reactions": 7,
      "user": "Zaphod20212"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2014
      },
      "score": 3,
      "text": "One of the worst movies I have ever seen in years. Do not go to this movie expecting any accuracy to the Bible stories. The acting is ok but the plot is so dragged out and just becomes pointless after the 2 hour mark. I even began to side with the villain at one point hoping that he would end the movie , but nope , it  dragged giving me a headache and making me ponder wither to leave or not. Even me giving it a 3 is a bit too generous.",
      "total_reactions": 7,
      "user": "RATCHETSLYJAK"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "I have never written a movie review before but this one cries for one.  This was absolutely one of the most boring movies I have ever seen.  Almost every scene was over dramatized and agonizingly drawn-out, resulting in one slow, boring movie.  It was painful to watch; I just wanted to walk out.  Giant rock monsters built the ark?  This film was a total waste of my time - two hours of my life I will never get back.  If you need a good nap, go to this movie.",
      "total_reactions": 19,
      "user": "RST303"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "My husband and I just saw Noah and we both loved it. Well and bravely written, beautifully acted, creative CGI & not \"biblical\" but certainly spiritual and ultimately inspiring, especially for nature lovers like ourselves. Noah: \"We have to be gentle with the animals and we have to be protective. If something were to happen to them, a small piece of creation would be lost for ever\" And so it has. And there are many way to appreciate this movie outside of its reference to the Old Testament story. As clever science fiction/fantasy ~ an intense family drama ~ edge of your seat action/adventure ~ a cautionary tale that could inspire some interesting discussion about the state of the world and our place in it afterward.",
      "total_reactions": 12,
      "user": "catanna1"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 3,
      "text": "Controversy is sure to ensue following the release of the Bible’s greatest and most epic story found in the Old Testament involving Noah and his arc. Visionary director and passionate auteur Darren Aronofsky has always been fascinated with the character of Noah, and the inner workings of a man tormented by the voice of God and conflicted by his own voice of reason. For the sake of skeptics, religious groups, and devout Catholics, I intend to avert my review very far away from any religious claims or criticism for the film Noah, and instead intend to only offer criticism on the film itself, regardless of its strong Biblical undercurrent. Visually, Noah floats adrift many previous films that share a similar look (The Road, Tree of Life, The New World) but unfortunately sinks in a preposterous commentary set amongst mythological creatures, accepting fate and the age-old argument of man versus God, man versus nature, and man versus himself.",
      "total_reactions": 17,
      "user": "NightReviews"
    },
    {
      "neg_reactions": 16,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "Loved the movie.. I mean it has only a couple small story things that did not make much sense.. BUT, the acting and animals were great.. Great story.. All around good movie.. Plus i been saying for awhile that Emma Watson is a STAR.. Proved it once again.. Not as EPIC as Gladiator but some good fight scenes none the less.. Overall was very happy.. I think its 100% worth watching!",
      "total_reactions": 27,
      "user": "Npurgatory"
    },
    {
      "neg_reactions": 15,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 3,
      "text": "This movie is a hybrid of religion and science fiction and will disappoint fans of both.  The absurd storyline in a semi religious setting is so unbelievable that it loses the viewer’s interest.  Had it been a made for TV Movie, it would last 30 minutes before the channel was changed.  The trailer on the internet is misleading which adds to the dislike of the movie.  Russell Crowe does a good job holding it together, but he can’t overcome the absurdity of this Harry Potter type of movie.  A redeeming value of the movie is that it shows the religious story of Noah and an Ark could never have existed and is a bible fantasy.",
      "total_reactions": 25,
      "user": "gfny"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "text": "This movies is a waste of money, both in the production of and the going to see of. Not only does it not follow the actual story of Noah, it is fully of absurd situations and creatures that have no real bearing on the story being told. The agnostic and environmentalist agenda is being pushed so hard that it detracts seriously from the movie as a whole regardless of what religion or view point you are coming from. It takes away from what could have been an entertaining movie, that was about something other than the story of Noah, and instead makes it a mixmash of explosions, special effects, poor acting and lines, that is painful to sit through. Sad.",
      "total_reactions": 5,
      "user": "NagromNniuq"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2014
      },
      "score": 2,
      "text": "Not sure how people who query accuracy have a leg to stand unless they were there at the time of Adam, Eve, Noah and friends. However, that does not excuse the film makers coming up with probably the worst film I have ever seen. There is simply nothing positive I can say about it. Refund please, for my wasted time and money.",
      "total_reactions": 5,
      "user": "Lincolnbaz"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2014
      },
      "score": 1,
      "text": "The only reason this is evening scoring a one is simply for the actors.",
      "total_reactions": 23,
      "user": "achomefront"
    },
    {
      "neg_reactions": 22,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 2,
      "text": "I walked out of the theater and dearly wished I hadn't wasted $10 and two hours of my life. Have you ever heard of Tommy Wiseau's The Room? That movie was a cinematic masterpiece in comparison.",
      "total_reactions": 36,
      "user": "Unsung_Paladin"
    },
    {
      "neg_reactions": 19,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "There is a great deal of controversy surrounding this film, and rightly so. It's one of the most bizarre, ballsy interpretations of a Biblical story I've seen. If you were expecting a \"to-the-letter\" rendition of Noah you will very much dislike Aronofsky's take on the story. If you want to watch a deeper than usual exploration of the nature of God with fully humanized Biblical characters, strongly stated moral questions, and striking visual effects, you may just about love it. I fall into the latter category, and would happily recommend this film on the basis of moral and spiritual exploration and exposition, not as an historical set piece.",
      "total_reactions": 31,
      "user": "TheTransmuted"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "text": "I usually can't be bothered to write reviews, but 'NOAH' was so bad I've even gone to the trouble of creating an account (yep, another password to forget) in order to share this. Oh grief, 'NOAH is rubbish. Russell Crowe did his usual half asleep lump of acting except when he was required to become a gladiator and kill someone, Anthony Hopkins (who has seemingly cornered the market in twinkly wisdom) twinkled and Ray Winstone looked menacing (as he always does, so no change there) About the only actor who was remotely convincing was Jennifer Connelly, emoting like a steam train on heat. Directing was lumpen and the special effects (such as they were) scored about 3/10 on the special effects scale while the script was devoid of both humanity and humour, everyone talking in constipated statements and trying to look serious. Why don't they hire people who know how to write?",
      "total_reactions": 8,
      "user": "BingBong"
    },
    {
      "neg_reactions": 21,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "No one should see Noah without knowing who Darren Aronofsky is. No one should see Noah expecting a Mel Gibson movie about Bible stories. People should expect to see pain and evil manifest on screen. That's what makes Noah great.",
      "total_reactions": 33,
      "user": "avcheme"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "Incredible movie you gonna love actor sand is din,t like bible whit so much action and adventure, incredible beautiful, and the efectos awesome, al actores awesome but tus el dont amase but the others yes, this movie is dont like bible but ITS a big movie hit.",
      "total_reactions": 22,
      "user": "alexito660"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "text": "What a waste of good potential.  Strike 1: it's a perversion of a Biblical story.  Strike 2:  it drags into an overly-dramatic, slogging mess after the midpoint.  It could have been so much more.  Save your money.",
      "total_reactions": 11,
      "user": "C-Money"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "text": "Like many  of the other 'user reviews', I didn't expect to see an exact representation of the biblical account, but I did expect to see a movie that included the basic facts of the 'Noah' story. Unfortunately, this debacle was so far removed from the original story that I'm tempted to call it intentional blasphemy and I'm left wondering whether God will hold the author or authors accountable. My wife and I nearly left the theater when the 'Watchers' were introduced but managed to endure until Russell Crowe told his family that they all would die, implying that God only used them to build a boat to save the animals. Disgusting!",
      "total_reactions": 11,
      "user": "RTFORD"
    },
    {
      "neg_reactions": 17,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "Great movie, Very entertaining, I think it deserves a eight because I did find things wrong with it, I gave it a ten due to the fact there are so many bible loving hippies on here that trying drag it down...  I don't understand these people who believed this guy build a boat to fit every animal that doesn't exist on the same continent? but still cant accept that there religious groups rape there own children even though its on the news every day?  Maybe these people should go back to there business ooops mean \"church\" that are buying up property with the donations they get!!! Let people who want to see a great entertaining film enjoy it without having to read all there crap!",
      "total_reactions": 26,
      "user": "Sam1234"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2014
      },
      "score": 3,
      "text": "They ignored every little bit pof personality the original bible lore had and turned into an action oriented bull **** This movie could of gone much better had they stuck with the spiritual interpretation of the original.",
      "total_reactions": 9,
      "user": "MetaCryptic"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "text": "How could anyone possibly think the special effects were any good? The Watchers were almost funny in their ridiculousness - they definitely took you out of the movie every time they appeared on screen. Aronofsky bragged that none of the animals were real - NO JOKE. They were anything but. Watch 'The Life of Pi' for some incredible CGI animals (I still can't believe the Lion was not real). Muddles story, poor execution and sometimes painful to sit through. I could care less if this adheres to the biblical story - just do it well.",
      "total_reactions": 9,
      "user": "Stahl"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2014
      },
      "score": 1,
      "text": "I was with a girl at the time, and I felt nothing but embarrassment watching this with her, as it was my choice for movie.  Boy, I'll check out more than one crazy fundamentalist christian review next time.  **** insane, that part I liked.  But to many parts were just cringeworthy and cheesy.",
      "total_reactions": 6,
      "user": "belfastbiker"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2014
      },
      "score": 2,
      "text": "People were quick to judge the movie based on that fact it is biblical, but that should be put aside because it never mattered.",
      "total_reactions": 6,
      "user": "AlanCheung"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "text": "Saw it yesterday. Just made an account to write this. What a waste of time, money, humor.... You name it. Went out of the movie very disappointed, a little angry too. Story sucks, play sucks, effects sucks. I rate with 1 for those who took the time to get together one of the worste movie ever.",
      "total_reactions": 6,
      "user": "Memeto"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "text": "As a filmmaker, I would simply be ashamed to present this garbage to an audience. Sub par CGI, horrible acting, dialogue that makes you cringe. The costume department must have had an off day as well. Just awful.",
      "total_reactions": 3,
      "user": "Nazgulero"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2014
      },
      "score": 2,
      "text": "Very poor and nearly sent me to sleep. The highlights included a scene which followed the earth from its birth to now and Russell Crowes performance. Apart from that it was a dour film in which another Bible adventure was depicted in a boring way. The issue I have with Bible stories is that you know the plot and the ending therefore no suspense or even a slight bit of interest towards the end of the film.",
      "total_reactions": 3,
      "user": "GMaj777"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2014
      },
      "score": 5,
      "text": "It would be hard to predict who might like this show, and who might not.",
      "total_reactions": 3,
      "user": "drewstroyer"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2014
      },
      "score": 9,
      "text": "So the Lord said, “I will wipe from the face of the earth the human race I have created—and with them the animals, the birds and the creatures that move along the ground—for I regret that I have made them.”  (Genesis 6:7)",
      "total_reactions": 10,
      "user": "mpicus5000"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "Seriously, why is everyone freaking out about this? Do I have to be a religious fanatic in order to hate this movie? Because this film was amazing! \"Worst movie ever\"??? Get over yourselves!",
      "total_reactions": 7,
      "user": "Edork"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2014
      },
      "score": 1,
      "text": "This movie could have been great! But I really found it boooooooring. The rhythm is just so slow you could fall asleep, many elements are present but are just useless to the development of the story and man ... why did some Rocky Transformers and magic golden stones appear in the story?!  I mean come on! The big bad guy uses a mortar with a golden rock! (I ain't kidding it's really happening!)",
      "total_reactions": 7,
      "user": "J0hnny"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2014
      },
      "score": 3,
      "text": "Film felt confused; it just added content inconsistent with original Biblical teaching, but then tried to approach evolution, and even mix in the story of Abraham instead of just telling the story.",
      "total_reactions": 7,
      "user": "Xirr"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "text": "\"Noah\" is the worst movie my two friends and I have ever seen in a theater -- and we're in our 60s and love movies, so that's saying a lot.  (And no, we aren't religious fanatics.)  It's so bad it's laughable, beginning with the Adam and Eve sequence to the Hobbit-ripoff rock monsters.  The plot is boring and so full of plot holes (including a huge tent that the characters just happen to put together out of backpacks) that it's beyond stupid..  The acting is bad, even though we all three usually love Crowe.  It was like the actors were cringing at having to put up with anything so moronic. Don't waste your money!",
      "total_reactions": 7,
      "user": "glg"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "I have met people who \"knew\" they would hate this movie before they saw it so they either didn't see it and dis it anyway which makes no sense or they went to the theater and made a point of walking out loudly and rudely. One person said he was VERY angry that the word \"God\" was replaced with \"Creator\" and for him it  \"had to be\" downhill from there. A lot of the negative reviews here and elsewhere seem to be coming from the same mindset. Obviously this review is not for these people. Either they won't read it or if they do they won't like it. But for the rest of you, those with open curious minds in search of a film worth spending money on, this is a very good movie. Russell Crowe leads an excellent cast through a script respectful of the Creator and his Creation, especially the innocent, the animals. And we humans must admit that we have not been very good caretakers of this planet and the flora and fauna who share it with us. It's an excellent movie for Earth Day! And it's also full of mindblowing special effects.  You won't be bored!",
      "total_reactions": 7,
      "user": "karinrocks"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "A very well done movie. I went in without knowing much about it. The story is good, the animation is good as well. The story is easy to follow and doesn't leave you confused. I would watch it again, and that says a lot. If you like stories like the Hobbit you will enjoy this movie.Watch it from the perspective of a story you've never heard before and you can't help but love it. I felt a range of emotions: happiness, anger, sadness, hope, despair. Worth the watch, for sure",
      "total_reactions": 7,
      "user": "ursula079"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "There is as much good as bad in “Noah” with good being the acting of Russell Crowe as the title character doing a strong role convincingly with Jennifer Connelly as his wife, repeating a role she played opposite Crowe in “A Beautiful Mind”. Their sons are played by Douglas Booth as the eldest boy Shem, Logan Lerman themiddle son Ham and with Leo Carroll as the youngest Japheth and Emma Watson as the adopted daughter Ila.",
      "total_reactions": 11,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 20,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "If you go into this movie expecting a strong christian movie, you WILL be disappointing. I think that the creators of this movie did a really good job with appealing to Christians and non-Christians alike. For example, they hint at the big bang and evolution, but not \"apes to humans\". Small things like these really help the movie stand out. The first half was fantastic. The last hour or so really made me lose some interest. To the people who are strong Christians, I do recommend you watch this movie on one account. You need to go in with an open mind, remembering that nobody really knows what happened from this long ago. The writers simply read the text, inferred their opinion of what happened, and tried to make it interesting to large crowds of people. I think they did well.",
      "total_reactions": 27,
      "user": "TheHelp"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "text": "There is a first for everything. Yesterday, on my 31st birthday something happened around me that I have never before experienced. I am not talking about the dinner with the love of my life eating the love of my life, Pizza, leading up to the movie. I am not talking about the romantic walk towards each other that ended up in hot steamy kiss up against the glass of shop on the street outside the theatre. I walked to the street corner after I purchased the tickets for the movie and as I turned my head to my left I saw her, it was like the first time I had seen this woman but I felt the energy from a block away, I knew she had me in her sites. I knew she was determined to run into me, I felt compelled to meet her half way and run into her just as determined. Our bodies collided like two galaxies in outer space. There is no collision more graceful than that of two galaxies. So large, so great, so passionate that when they collide the planets that make them up never hit. The two beautiful forces of our universe dance like they are in love until they settle into one new galaxy. That was us right there on the sidewalk under the streetlight at night just like in the movies. However this is not the first I am speaking of. The night was young and the movie had yet begun. After having a few laughs at the tavern next door, we walked through the crystal clear glass that lead to our horror. With a big bag of mouthwatering popcorn in one hand and a genetically engineered fructose corn syrup soup in the other. Sitting in the third row, we were traditionally set for our feature presentation starring, Rustle Crow. At first I am moved, pulled in by the selflessness of Noah and his sons. I thought I was proud to be in this crowd, so glad to see a movie that did not promote bad. However it was at this moment that I witnessed something I had never seen before! Something that totally made sense but yet none at all. I needed to take a picture so people would believe me when I share it on social media with the world to save them from making the same mistake we made that beautiful night. To save them from not only having to watch this movie but from possibly facing the same fate of those around me. To my right it was happening. Directly in front of me it was happening, I turned to look behind me and it was happening all around me. I thought at first, its ok, this is a dream, pinch yourself you fool this can’t happen in real life. It hurt, I was not sleeping, not yet, but if I subjected myself to this anymore I could end up doing just that. Doing what all the sinners around me were doing, engaging in what seemed to be either a mass suicide attempt or possibly a slumber party. People were sleeping not only around me but on each other. The young couple to my right fell asleep leaning against each other. The mother who sat in front of me separating her husband and son started snoring. People all around were speechless as we were subjected to the glorious acting out of a phycodic script obviously written or directed by a white male animal lover who probably has small ligaments. A white man that feels inferior to woman and children. Scared that one day people will wake up and realize that this is not a white man’s world. But a natural habitat for humanity. Scared that people will realize there is no one greater than our creator who is genderless and colorless. This movie features 100% people with a white ethnic background and a man who tells his sons that he does not believe there should be kings for there is no man greater than our creator. But after the king and his men are killed by the water from above Noah becomes a King, President, Dictator, Ruler, CEO whatever you want to call it, its all the same. He decided who lives and who dies. He decides who will go and who will stay regardless of the thoughts of the people who make up his pride. A man who believes that woman are to serve man and bear children. Only if he wants them to. He cares not what other humans say, he is only interested in carrying out the decisions that take place in his own mind and claims that they are orders from above, from the almighty who works threw no one other than himself. He believes that humans are not animals, that its only ok for lions to eat other animals, for if a human eats another animal he is eating the forbidden fruit. He supports the idea that killing mass quantities of humans is justified for the humans are all sinners. My take on this movie is that if you believe you are getting orders from god, you should act them out regardless of the thoughts of others around you even if it involves killing babies that are one day old or making mankind extinct. That murdering most the world population if not all is not only justified but glorious in the evolution of our Garden of Eden which we of the modern world refer to as planet earth, the third rock from the sun.",
      "total_reactions": 12,
      "user": "officerhansen"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "Noah is definitely not one for the purists. Opening in a bleak landscape and adopting a preachy tone, the film takes a good hour to really get going. Darren Aronofsky, usually one of the best visual directors around, takes a fair while to bring his undoubted talent to the fore concentrating instead on character development and uninteresting family dialogue. Even the visual effects, including some rock monsters that look as if they have just stepped out of a Transformers movie, seem dislocated from everything else going on at this time. In fact, it's not until the tremendous battle for the ark that things start to improve. From here, it's onwards and upwards and the cast finally have some dialogue and drama to sink their teeth into. A crazed Russell Crowe starts to lose it; Jennifer Connelly steals the acting honours in just two scenes; Emma Watson cries a lot, but shows real promise here, and even Ray Winstone is rather good in a baddie role that he can play in his sleep.",
      "total_reactions": 4,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "While it left me feeling drained as I left the cinema, \"Noah\" was technically superb, offering yet another outlet for Darren Aronofsky to showcase his skill as a director, and well-acted; Russell Crowe, in particular, fit the lead better than I expected he would; his performance is haunted, sunken and finely nuanced. It drags, it feels an hour longer than it actually was, and only loosely adherent to the Bible, which may leave some offended. But it was an impressive piece of filmmaking, even if its entertainment value didn't quite measure up.",
      "total_reactions": 4,
      "user": "googolendtimes"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2014
      },
      "score": 2,
      "text": "I would have given this movie a 0 if it wasn't for the spectacular special effects put into this movie. However, I'm not a Christian so I was bored half-way through the movie. It had a weird storyline of Noah killing all humans on earth including himself. To be honest, the movie Evan Almighty was even way better than this. I know, Noah was way more darker but I found Evan Almighty more fun and entertaining to watch.",
      "total_reactions": 4,
      "user": "Navin_Ad"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2014
      },
      "score": 4,
      "text": "As an Atheist, i dont care about accuracy.",
      "total_reactions": 4,
      "user": "Garfoodle"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Aronofsky has drawn from a number of canonical and apocryphal texts, as well as more modern post-apocalyptic and environmentalist themes, to craft an antediluvian world which feels part Biblical, part mystical, and part Mad Max. That might sound like the makings of a hot mess, but it all somehow works, thanks to a strong script and even stronger casting. \"Noah\" is definitely not the story you learned in Sunday School, but it is a great movie, taken on it's own merits, as well as managing to inject some emotional impact back into a story we've become numbed to, having heard it so many times.",
      "total_reactions": 4,
      "user": "adpirtle"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "To be honest, I was pleasantly surprised with this movie. Sure, it was not spot on with the Bible but it was still pretty good. It goes away from the child hood story showing the raw side of Noah. The side that any regular human would have. It has just the right balance of drama and action to make it a fairly satisfying movie.",
      "total_reactions": 4,
      "user": "BigMike71"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2014
      },
      "score": 8,
      "text": "Although it was inconsistent to have something stuck home, taking the viewer the first time sleepy",
      "total_reactions": 9,
      "user": "Ouendaner"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "text": "What should have been an at least 'so bad its good' disaster movie, compounded to create one of the most drab and dull films i've seen in cinema for years. Each line feels as though it drags on longer than its previous, the script in itself as wooden and repetitive as the acting. And one of the most irritating pauses after each and every line to try and emphasise the 'cleansing' or whatever drivel the actor/actress was spouting. I couldn't care less about it's religious inaccuracies, as long as you make it a decent story, but unfortunately the film fails on both accounts. Not worth anyones time.",
      "total_reactions": 9,
      "user": "Fnacy"
    },
    {
      "neg_reactions": 16,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "I heard a reviewer call this film both \"faithful and fanciful\" and that's exactly what it is. I don't believe in as literal, historical Noah and the Flood, but I do believe in human good and evil, and it's told masterfully in  this film. It's an epic myth about humanity and divinity. Crowe and Connelly are superb. The visuals are good. Overall, very good.",
      "total_reactions": 20,
      "user": "titanium-tiger"
    },
    {
      "neg_reactions": 16,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "dont listen to all the bible bashers!. We all know the story of noah and this Hollywood adaptation isn't that bad, sure their is a few plot holes but other than that noah is an entertaining movie. the movie may not be historically accurate but its still an amazing looking film.",
      "total_reactions": 20,
      "user": "Mr_zaneage"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "This movie was quite disappointing in the way it was hyped as this bold version of the telling of Noah. The story Darren tells is quite bold and it had a great dark tone to it. However, its message was thrown at you in a way that pissed me off. This idea that god would kill off the bad is a good thing, but to let the good suffer along with them is stupid. The loss of mental control of Noah wasn't something I was taught but maybe it was true. I'm right on the fence with this one; until I read the actually story (which is something I need to do).  Maybe the story was true which would piss me off more than I'm already at. In the context of the bible of course. Stories of things that I believe were put there to tell the world what is wrong and right. Nothing to be interpreted as real life. So if this was the real story of Noah, then I've lost most my fate in the Bible all together. The story of how one man could get something wrong from god was good and the extent of his awakening was pretty satisfying. Though the decision of Noah to go to that extent where he thinks god is telling him he should kill kids is ridiculous and I wouldn't want a god like that. Though his revaluation at the end kind of made up for it. So at this point its more of a good movie than a bad, but I've got to read the story to see how much the movie is true to it. 7.6/10",
      "total_reactions": 10,
      "user": "bmaster4616"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2014
      },
      "score": 2,
      "text": "Saw this movie on 4/2. While we were expecting somewhat of a fantasy movie we had no idea that it would be so preposterous. We're not  fans of the Hobbit-type movies and this was really in that genera. None the less, I (male) found the acting to be atrocious. Compare this movie to Beautiful Mind in which both these actors starred. It is a masterful work. We expected a fictional movie, not a science fiction movie.",
      "total_reactions": 5,
      "user": "MrBBPrinter"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 1,
      "text": "Transformer rocks and that's all you need to know about this nonsensical fantasy film. Bad, very bad. The liberal film critics liked Noah more due to it's left leaning Biblical story.",
      "total_reactions": 5,
      "user": "WakeForestNC"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2014
      },
      "score": 1,
      "text": "not even close to the bible. what a let down.  The sad thing is some will watch it and think that was what the bible said.  Very sad.  If only it would have been called by another name.  It might have been an o.k. story.",
      "total_reactions": 5,
      "user": "itsjustmeonlyme"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "Over dramatized; that's what I told myself about 5 minutes into this drawn out epic, and that feeling only continued to overpower my thrill of this fantastical story which includes the Watchers within a decently explained creationism framework. Aronofsky is such a skilled director that I didn't think he would ever rely on such an unevenly paced story, disjointed and overly emotional characters, or plot devices that stretched the movie to an uncomfortable length, while failing to truly complete the yarn. That being said, much of the drama culminated in Watson's outtro, which was finally well executed... thereby making sense of the build up, yet not in a way that warranted the sloppy footwork of the preamble.",
      "total_reactions": 5,
      "user": "Benubc"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "People who rated this amazing movie 1 or 0 is what is wrong with the world. Don't listen to the idiots downrating this movie. This is a masterpiece and with top notch performances. Kudos to everyone involved.",
      "total_reactions": 6,
      "user": "meagan214"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "Good and ambitious film. An incredible and cohesive movie under his own universe with great story, graphics and characters.",
      "total_reactions": 6,
      "user": "andreydelorenzo"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "Russell Crowe plays the titular character in this arty version of the tale. Anyone looking for a flood epic will be disappointed. About 10 minutes is devoted to the actual deluge and it's pretty cool. Much of the rest of the time is all about drama and family conflict. Darren Aronofsky (\"Black Swan\") is known for his singular, dark vision and it's manifest in this imaginative adaptation (the evolution of Earth and the montage of violence are standout moments). Like so many epics these days, this one could lose about 30 minutes and be a more compelling film. As it stands, it's a moderately involving drama that puts a pretty unique spin on the Bible story.",
      "total_reactions": 14,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "Darren Aronofsy is being billed as “visionary” director, and in general, I would have to agree with that assessment. He's still young, and his fame is based on a mere handful of movies, so there are still great expectations for this brilliant and politically engaged director. With Noah, Aronofsky reached for the sky, almost literally, and went slightly askew in an attempt to do a strange admixture that included disaster movie, blockbuster-for-teenagers movie, and a Biblical epic that would appeal to the faith-based audience. It was a tall order. Did Aronofsky succeed? To a certain extent, although there are some glaring weaknesses.",
      "total_reactions": 7,
      "user": "ClariseSamuels"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "I'd say that the critical average of 70 is about right on for this one.  I'm a Catholic, and of course this \"drama\" strays from the literal reading of Genesis 5 - 9, but of course it had to, right?  It would have been tough to find a 600-year-old actor to play Noah disembarking the ark. (In MY scripture class, a 600-year-old was meant to represent a \"very old\" man... Father Gatto would be proud.) And yes, the Bible provided for wives for the three sons as they entered the ark, and there was no stowaway, but those deviations from the literal Genesis chapters are done for dramatic effect, and they don't take away from the essential meaning of the passages - that man had become corrupt, and God sought Noah's help to begin things again.  I also didn't have a problem with the angels/rock-monsters - they were a convention to explain how such a small group could build such a massive structure in such a short time, while keeping the bad dudes at bay. The movie flagged a bit as Noah was convinced God would want him to take the life of his would-be granddaughter. The visual effects are amazing in this movie, and the leading actresses (Jennifer Connelly & Emma Watson) are outstanding.  Great to see such strong women represented in a Biblical interpretation.  As a friend of mine advised, it might be helpful to read Genesis 5 - 9 twice - just before and directly after you see the movie, simply to put things in context.",
      "total_reactions": 15,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "Geez Relax, It was a movie, not a documentary. I thought it was a decent movie. Usually 2 hour plus long movies don't keep me motivated for that long, but I was entertained, hence this is a movie.",
      "total_reactions": 15,
      "user": "Roganwarrior"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "Beautiful film, and one of the most interesting worlds I've been to in a while. There was, admittedly, a lot that didn't work all that well (most of the action sequences seemed out of place), but as a character study of Noah, and by extension the Creator he's trying to follow, it's just pretty brilliant.",
      "total_reactions": 15,
      "user": "ParadiseIsLost"
    },
    {
      "neg_reactions": 20,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "If we are grading this movie on accuracy then score would be very low. If we were to disregard the accuracy, because the director did take liberties with the source material molding it into something quite different, then this movie actually deserves a lot more credit. Religious people will be offended and upset but as far as the movie is concerned, i liked it. It was directed well, amazing visuals, with great acting so judging it harshly because it did not interpret the story of Noah as others do seems narrow minded. This is someone else's interpretation of the story while stretching quite a few aspects of it but the movie itself was good and faulting it because of source material doesnt sit well with me. Decide for yourself but its definitely worth a watch.",
      "total_reactions": 23,
      "user": "Pimpinpakman"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "The movie to my understanding is the film maker's interoperation of the story of Noah's Arch. From watching the trailer I didn't expect to see so much cgi creatures. Some will say this stuff is sci fi, but I think it follows the Bible as intended by explaining story metaphorically. It was done very artistically. Some effects looked like they were stop motion. As a movie it entertained. The casting was remarkable. The last Bible movie this good was The Passion of the Christ. Dark and griity Bible movies with great acting and descent production values is the way to go.",
      "total_reactions": 16,
      "user": "Youmustdienow"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2014
      },
      "score": 8,
      "text": "I got dragged along to this film and went in thinking it would be too religious for me... But I was surprised, It was a nice twist on a great biblical story... Special effects were well done and this is one movie that I am sure is Far better to watch at the cinema rather than at home... All is all I enjoyed it and the 2 and a half hours went by quickly.",
      "total_reactions": 8,
      "user": "Canucks"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "Aronofsky puts an exciting sci-fi spin on a renowned biblical story that really does give it a new lease of life.",
      "total_reactions": 8,
      "user": "Iamlush7"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "Any logical person will know that the Bible is a work of fiction, The director also thinks this as he has openly created Noah as a fantasy movie and it does not try to pretend to be anything else, people who have liked any other big blockbuster fantasy movie like the LOTR series will probably enjoy this movie. I can see why some people are creating a fuss about this movie because the director Darren Aronofsky makes it clear in every scene that this stuff obviously did not happen. Anyone who tries to argue that this movie was based on a true story would get laughed at, Aronofsky does not even attempt to hide the logical problems with the source material instead he puts a spotlight onto them and goes out of his way to remind people that the story he is telling is pure fantasy.",
      "total_reactions": 8,
      "user": "GardenChair"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2014
      },
      "score": 0,
      "text": "Saw this movie for free and was angry I spent so much to get in. HORRIFIC! Only thing it has to do with Noah is the title. The actual biblical account of Noah could have made a fantastic movie, this was a bad mix of generic Star Wars type characters that didn't belong, muddled dialog, bad cinematography, horrible special effects and extreme violence that seemed to be thrown in just to have extreme violence. Didn't add to the story one whit. Towards the end seemed to be nothing more than a flagrant attempt to paint important Christian figures as weak and evil.",
      "total_reactions": 8,
      "user": "howardbeens"
    },
    {
      "neg_reactions": 16,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "Some may dislike how 'far fetched' the Darren Aronofsky adaptation of the Biblical story of destruction and new hope is, but you got to give it to him for having taken such a new and emotionally complex look at it.",
      "total_reactions": 18,
      "user": "LWTBP"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2014
      },
      "score": 8,
      "text": "So, it may not follow the bible, but Noah has a powerful message worth telling. The visuals are so incredible. It is one of the most beautiful (in the darkest way) movies that I've ever seen. If you open your mind and don't expect a bible story, you are in for a really good and powerful movie.",
      "total_reactions": 10,
      "user": "itsjustmealbert"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2014
      },
      "score": 8,
      "text": "As far as biblical epics go, they don’t get much better than Noah. And to a great extent, Noah isn’t even a biblical epic. It’s more of a vividly realized action period piece – only the period is an apocalyptic deluge centuries after the birth of mankind. The biblical elements pertain solely to the inner mechanisms of the characters; the audience is only supposed to come in knowing the basics of Abrahamic religion (Adam and Eve, original sin, God is ruler, Noah built an ark). Basically, Noah isn’t The Passion of the Christ, and Russell Crowe isn’t Mel Gibson. Director Darren Aronofsky uses the biblical story as an inspiration, a rough sketch to redraw with creative license and paint over with poetic dialogue, breathtaking imagery and near-flawless acting. With Noah, Aronofsky reaffirms he is an artist, and not simply a storyteller (as if Black Swan didn’t already do that).",
      "total_reactions": 10,
      "user": "RedOwlReviews"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "Though it's almost undone by some absolutely ridiculous conceptual elements throughout, Darren Aronofsky's \"Noah\" still retains its entertainment value with a bevy of powerful performances and some characteristically striking visuals for the director.",
      "total_reactions": 11,
      "user": "Compi24"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "This film was inspired by two different sources IMO - the Bible and the Lord of the Rings movies, put them together and you get something like this.",
      "total_reactions": 12,
      "user": "Headcrusher"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "This movie is interesting. The beginning is very hard to understand, with odd editing choices and a sluggish pace. The middle of the film is pretty good, with some standout fight sequences, but still no story that makes sense. Then the end of the movie drags on in an overly dramatic sequence on the ark. The acting is alright, with Ray Winstone being the standout. But ultimately none of the characters are put to good use. However, some the CGI is very good, the \"world-creation\" scenes being the standouts. But, in the end, the movie fails.",
      "total_reactions": 12,
      "user": "rory_s"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2014
      },
      "score": 8,
      "text": "A solid film that drags on a little bit in its final half but the special effects and its message is very powerful and Russel Crowe's performance is top notch.",
      "total_reactions": 12,
      "user": "NicolasCage"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2014
      },
      "score": 8,
      "text": "I would like to point out that this is not supposed to be the biblical account of Noah's Ark. Honestly, I think that this is why I enjoyed Noah. The acting was good, the special effects were great, and I enjoyed the plot. This is a must watch.",
      "total_reactions": 13,
      "user": "theryno"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "The movie is about the fanatic Noah trying to fulfill the will of God (as he sees it) at any cost, even if it hurts his own family. The visuals are breathtaking. Crowe, Jennifer Connelly and Anthony Hopkins were great, Emma Watson's character was pretty bland. I felt the length of the movie was too much. Overall I liked it.",
      "total_reactions": 14,
      "user": "StaticSpine"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "I really enjoyed this film, much more than I was expecting. The rock monsters felt a bit out of place but they were a necessary plot device and I think they did work. I think the film interpretation of the story was very well done and the values that the film was trying to convey came across well for me, it did make me think afterwards and very few films these days do that. The special effects were very well done, the scenery was beautiful and the water effects were powerful and very well done.",
      "total_reactions": 3,
      "user": "djnicey"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 9,
      "text": "It may not be a Biblically accurate telling of the tale, but it is a gripping one. It focuses on aspects that you won't hear in Sunday school. It takes a look at the emotional and mental tole the events had on Noah and his family. Watching them break and suffer over what is happening to those not on the ark is powerful. Russell Crowe delivers a fantastic performance as Noah, truly bringing the character's emotional complexity to life as he slowly begins to question why these events are happening, why he was chosen, and what he should do next. It really focuses on the morally grey aspects of the events, and shows that God, or \"The Creator\" as he is called in the movie, is capable of wrath as well as love.",
      "total_reactions": 5,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2014
      },
      "score": 3,
      "text": "For a Christian it would be hard not to lend a biblical critique to this. It was odd to the point of irritating that a story about Noah not once uses the word \"God\" in the script, yet it certainly seems typical for Hollywood. There were semi-modern industrial references that seemed way out of place for the historically accepted time period. Even without the biblical errors, the show overall was excruciatingly long and it spends most of its time in a dark and sinister mood.",
      "total_reactions": 2,
      "user": "David_H"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "I love Aronofsky. And the more out he is, the more I love him - The Fountain is my favorite of his films. Anything he makes is required viewing in my opinion and I'm glad I saw Noah, frustrating as it was. It's a thought-provoking movie but I didn't enjoy any of it. The CGI is cartoonish, the score is wall to wall and suffocating, and the general emotional and visual palette is so relentlessly bleak that it feels like one long minor chord. There are numerous moments of genius and true beauty though as well as great performances. I thought Jennifer Connolly did a lot with the little material she was given and Ray Winstone always brings it. I have trouble connecting with Russell Crowe - he's always this monolithic block of human force, but I never see a person - but he gets the job done and carries all of his films.",
      "total_reactions": 8,
      "user": "judahjsn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2014
      },
      "score": 0,
      "text": "What a train wreck of a movie this is, and who is advising a decent actore like Russell Crowe to get involved with a turd like this? It got off ot an interesting start and then - the rock monsters turn up!",
      "total_reactions": 1,
      "user": "AtomicDog"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "One of the most controversial film of the year. Aronofsky's version of NOAH is a mix up between his usual eccentric approach, and a blockbuster film.  Its interpretation of Biblical 'hero' Noah seems to either piss of religious people or acclaimed by critics everywhere. Sure he took great liberties, but the end result is a riveting and unusual 'bible' film that pull no punches in humanizing its hero, a man considered a great prophets by many Religions.  Well acted by Crowe in his best performance in years, highly recommended if you are a bit open minded about it.",
      "total_reactions": 9,
      "user": "dharma"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "Aronofsky’s long-waited follow-up after BLACK SWAN (2010, 9/10) is a re-enactment of biblically inspired story of Noah’s ark, NOAH is a spectacular visual stunt spiked with Aronofsky’s atheist re-construction of a life-or-death conflict between God’s will and humanity.",
      "total_reactions": 2,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "Dark, brooding and surreal; Aronofsky's epic is beautifully shot and ambitiously conceived. Most importantly it gives Biblical lore a healthy dose of human realism - not a bad thing at all.",
      "total_reactions": 2,
      "user": "jack977"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "The typical atheist and Bible hater will probably not like this film; however, for the rest of us it was an awesome work of art. It draws inspiration from the story of Genesis while not taking the story as too literal, and adding special effects and fantasy to the narrative. If you are willing to accept that the producers and director meant to do that then you will enjoy this film. Crowe and Connelly's acting is superb as well as Hopkins.",
      "total_reactions": 4,
      "user": "tvchicano07"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "It was fun to watch. Lots of cool things happen in this movie. The real story of Noah is boring as **** so I am glad they changed it to be entertaining. Most people talk about how they love the story of Noah, but most people don't even know a half of it.",
      "total_reactions": 4,
      "user": "Ezekius"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "Talk about divisive, haha. Though, I think much of the divisiveness surrounding this one is due to many religious folk walking in and expecting a re-enactment of the Bible word-for-word with no added elements and no alteration of anything. Even as a Christian, I realize how stupid that demand is. As a whole, I largely enjoyed Noah. The performances from Russell Crowe, Ray Winstone, and Emma Watson, are all very good. Jennifer Connelly is also alright (though there is one scene where she struggled pretty badly). I also enjoyed many of the added elements, such as the Watchers (the rock creatures). They received the most criticism from hardcore Christians, but for me, I loved what they added to the film and their journey was just as riveting as that of Noah. Up until the flood, this film is brilliant. Post-flood, however, things begin to follow apart (while I liked Winstone's acting, I don't like his character being added and it all felt so cliche). However, it does pick back up again towards the end and convinces me there is brilliance in this somewhat broken film. The cinematography is very consistently beautiful. Some of the shots here are absolutely gorgeous (by some I mean the vast majority). The direction from Darren Aronofsky is also characteristically strong here and while this may not be my favorite film by him, it is still a great example of his talent. Overall, Noah is far from perfect, but is a solid film that does not try to be a Bible film, so do not come expecting that. Rather, it is more along the line of apocalyptic epic,",
      "total_reactions": 3,
      "user": "Spangle"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "The acting is great and it's a well-made movie overall.  It could have been a great movie by accurately portraying Noah and his relationship with God. The movie could have expanded on the story on Noah in much the same way while keeping these essentials truths 1. Noah loved God and clearly heard His voice.  There was a relationship there.  2. God loves people and He wanted to preserve them as much as the animals through the flood.",
      "total_reactions": 12,
      "user": "BalconyView"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "A nice fresh take on an old story. I enjoyed the originality and the acting was overall solid. The action sqeuences were amazing. Yes you understand there is a God, you understand, humans are to be punished, you understand love conquers all. This was the basic principle behind the original story but updated in a new unique way. I am a person of faith and I apretiated the new take on it.",
      "total_reactions": 6,
      "user": "WhySoSerious54"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "Noah is solid entertainment, but nothing incredible.  The action is done well, and the acting is first rate but it never really reaches the stunning heights that it should have.  Aranofsky adds a lot of artistic expansion onto the story, like the rock creatures, and fictional animals, which I thought were ok additions.  I didn't feel like he did this enough with his direction though.  It's missing lyricism in many parts and never approaches the grandness seen in films like Life of Pi, or Avatar.  The effects are solid but occasionally cheesey.  Animals sometimes look too obviously fake.  The flood itself however was very realistic looking.  The script is pretty decent.  It raises some tough questions and is filled with brutal occurrences.  This movie is not for the easily frightened.  Crowe's performance, some great scenes, and the fact that this is the first big budget bible epic in decades all make it worth seeing.  I advise you however not to expect anything miraculous.",
      "total_reactions": 11,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "This biblical inspired action adventure from Darren Aronofsky is not as great as any of his previous films but it does stand out because of it's darkly narrated plot with superior performances by it's cast. Clint Mansell's score is an asset to the film though the film's CGI went haywire at few places.",
      "total_reactions": 5,
      "user": "arunkchow"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "This is not a film for people who ask a lot of literal questions. Not exactly myth, unless you consider it Aronofsky’s version of myth, which seemed always in service of telling a story that made just enough sense to keep people from walking out. I enjoyed the film and thought the cast was very good, especially Russell Crowe. I know he is rightly celebrated for parts like this (e.g., Gladiator), but he is still sincere and convincing even in Aronofsky’s weird world. I thought there were a few slow parts, but generally the film was lively and crazy enough to hold your interest and was perhaps even occasionally moving. I don’t remember a rainbow, but I couldn’t help but wonder if Aronofsky will take on the fire next time. I hope not. Once was enough.",
      "total_reactions": 13,
      "user": "GinaK"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "Loved this movie! Nice surprise to see the inclusion of \"The Watchers/Fallen Angels\" taken from older ancient Flood stories co-mingled with the more recent version that most us have read in the Bible. I call it genius, while some other folks can't seem to imagine it. My advice, leave that religous debating for the Sunday School of your choice, and just enjoy a very well-made movie. Excellent movie. Highly recommend.",
      "total_reactions": 3,
      "user": "cajieboy"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "Nick Nolte rock monster. Nick Nolte rock monster. Nick Nolte rock monster. Nick Nolte rock monster. Nick Nolte rock monster. Nick Nolte rock monster...",
      "total_reactions": 8,
      "user": "geoff_hano"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "This is an amazing visual experience that while there are some story elements that fall short the majority of the film works as a story of a man who must interpret his burden.  B+",
      "total_reactions": 2,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2014
      },
      "score": 8,
      "text": "Noah review",
      "total_reactions": 7,
      "user": "Pablo22"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2014
      },
      "score": 9,
      "text": "Now before I share my opinion on this movie I just want to get one thing out of the way. I am a Christian, My relationship with God and his son Jesus is the most important thing in my life! Now with that being said, I absolutely loved Noah! Do not listen to what all of the people are saying about this film. Yes, it does have one particular element where the director obviously took some creative liberties with the story but to me that was okay. The story of Noah is one of the shortest in the Bible, and a lot of the details are left to your imagination. That is where this film comes in, it shows the dark side of Noah. The stories we heard when we were little kids are the same stories per say, but they are much much darker than we could understand. Which is exactly what I loved about this film! Instead of exploring humans through the eyes of God like so many other movies do, this explores God through the eyes of his servants. It shows their struggles, their sacrifices, their doubts and ultimately how strong their relationship with their creator must be in order to make it in this harsh world! Noah is one of the best films I saw all year! If you are a Christian, or even if you're not, give it a try. I'm sure you will be glad you did!",
      "total_reactions": 3,
      "user": "chrisjones914"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 5,
      "text": "Noe es una historia interesante donde se cuenta con un excelente elenco de actores, la película suele rodarse y tornarse lenta pero al mismo tiempo interesante es una combinación que no me gusta mucho pues en ciertas partes predomina el aburrimiento y la desolacion",
      "total_reactions": 4,
      "user": "Jmsbpp"
    },
    {
      "neg_reactions": 15,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "Noah is a fun adventure however, it lacks in character performance. Emma Watson stole the show leaving the rest of the cast in dust. You will feel satisfied after watching the new take on 'Noahs Arch' however, it never really lives up to the suspense or hype. I had a real problem with the performance by the 'villain king' ,just felt like he was yelling annoyingly into the audience towards the end. Anyway all in all its worth your time and the privileges of the cinema experiences. they have really built on a new and mysterious world, which brought the movie to its full glory.",
      "total_reactions": 15,
      "user": "busbfran"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2014
      },
      "score": 3,
      "text": "A friend told me it's a story believed and respected by hundreds of millions of people around the world..!!",
      "total_reactions": 1,
      "user": "Nitish"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2014
      },
      "score": 9,
      "text": "First of all to deal with inane comments regarding deviation from the biblical texts. Firstly, the story in Genesis is slight. Secondly, it didn't actually happen! It's a myth! One of several deluge myths in ancient middle and near east religion. What Aronofsky does is mint a new version, and it works. Expectedly on some levels, as Aronosky uses typical visual inventiveness to tell the story. One highlight is the creation story-within-the-story interlude which is dazzling, another are his invention of the Watchers, and their nod to both Giacometti and Ray Harryhausen. But also unexpectedly, as we are, for the most part rooting for good Old Testament Yahweh and his plans to cleanse the world, such is Aronofsky's ability to depict it as relentlessly mired in vice, and in doing so hold an uncomfortable mirror up to our own rapaciousness. But this would be for nought if Crowe couldn't make the role work. He does, giving Noah pathos, intensity, a deep inner sadness. It's dark, it drags a bit if you're not lapping up the art direction, and arguably loses it's way a little in the final third, redeeming itself at the very end, but this is bold, intelligent film-making in a different league to the vacuous output of someone like Michael Bay. In time will be appreciated as a minor masterpiece.",
      "total_reactions": 3,
      "user": "gusto43"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "I'm glad We the people have the outlet to set the record straight, as the collective insanity of the pro critics gets increasingly wackier. This was cool, shows the Old Testament with all its prescient wisdom about the world and for once not concerned with exclusive Zionist projects. Some critics thought the plant rock spirits were too far fetched. And what, Guys thinking God is teling them directly to embark on crazy boat building projects isn't? Get a grip critics. Aronofsky executes it all with the right tone, and the performances are grounded in a seriousness that sells it. Ecological warnings and all that. Food for thought in the garden of eden.",
      "total_reactions": 3,
      "user": "Countvontrollio"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "Grounded by a superb performance from Crowe and brilliant special effects emphasised with FANTASTIC camera work, Noah is an ambitious, wholly satisfying take on a biblical tale.",
      "total_reactions": 2,
      "user": "sammurphy66"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2014
      },
      "score": 4,
      "text": "Nice movie Nice movie Nice movie  Nice movie Nice movie  Nice movie Nice movie Nice movie  Nice movie Nice movie  Nice movie Nice movie Nice movie  Nice movie Nice movie  Nice movie Nice movie Nice movie  Nice movie Nice movie  Nice movie Nice movie Nice movie  Nice movie Nice movie  Nice movie Nice movie Nice movie  Nice movie Nice movie  Nice movie Nice movie Nice movie  Nice movie Nice movie  Nice movie Nice movie Nice movie  Nice movie Nice movie  Nice movie Nice movie Nice movie  Nice movie Nice movie  Nice movie Nice movie Nice movie  Nice movie Nice movie  Nice movie Nice movie Nice movie  Nice movie Nice movie  Nice movie Nice movie Nice movie  Nice movie Nice movie",
      "total_reactions": 5,
      "user": "xser12249"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "This movie was one I was skeptical about since the first trailer. Yes, it is directed by Darren Aronofsky. And while he has a pretty good track record, I honestly did not love this film. It was intriguing in some standout scenes, and it was very beautifully shot, but I felt that it wasn't well put together and the editing was a bit \"off\". The movie was filled with little continuity errors, and overall screw-ups. It didn't have a great start, and then got gradually better, it then got to an incredibly well-shot action scene which definitely upped my review, but, it then got boring and predictable, it went on for far too long and didn't have the intrigue that Aronofsky's other films have clearly shown. So, yes, it's worth renting, but I honestly wouldn't go out of your way to see this film.",
      "total_reactions": 7,
      "user": "Ryanb"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "Here we find another example of the typical mistake in epic movies nowadays: to excessively fulfill minutes and minutes with (let's recognize it) wonderful special effects, while leaving stories to a last plane, that get stuck and incomplete. So, we just get regular material, nothing transcendental (quite the opposite as the genre wants us to feel)",
      "total_reactions": 1,
      "user": "jotaeseche"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "If you watch Noah with an open mind, you will be treated to an intense experience that has created a whole new world from one we thought we knew. From the very first scene I knew the movie was going to be well-made, and I was not disappointed. The movie does not hold your hand. As a good movie should, I had unanswered questions, and the movie stayed with me afterwards and the next day.",
      "total_reactions": 3,
      "user": "saintivan"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "A very controversial film, destined through Darren Aronofsky and Ari Handel script to alienate basically all factions who could possibly comprise the film's audience. Christians who take the Bible literally will be offended, athiests wouldn't come within Noah with a ten-foot pole, that sort of thing. It's a lose-lose situation, which is a crying shame, because it's most probably Aronofsky's greatest work since Requiem for a Dream. Very inspired decision reuniting A Beautiful Mind's stars Russell Crowe and Jennifer Connelly, while Sir Anthony Hopkins really shines as Earth's oldest human being (Noah's grandfather Methuselah), it has the best acting I've seen from Emma Watson, and Ray Winstone is very good as the villain. Take it from the doves and grab this olive branch, and see this fine film for what it truly is--a very rewarding experience which examines the power of miracles and the equally fascinating mysteries of love and mercy.",
      "total_reactions": 2,
      "user": "talisencrw"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "a breathtaking movie and its nowhere near being a horrible movie for what everybody else says ..This movie can be the most beautifully movie I've seen in awhile .. A True biblical movie that's put together nicely.",
      "total_reactions": 4,
      "user": "david1997"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "Noah es una película que lleva una historia bíblica al cine, y lo hace de una forma bien hecha, además hay que destacar que Emma Watson a mejorado como actriz, todos los del reparto tuvieron buenas actuaciones. En general, un muy buen film.",
      "total_reactions": 3,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "So the movie has some very good moments such as the acting and Aronofsky's direction, some very bad moments such as the length and some of the horrible special effects, and some strange moments such as the rock Transformers that move as if they were animated with go-motion technology. In the end the movie is okay, I don’t dislike it, but I have no desire to watch it again. However for something I originally had no desire in seeing, it was definitely better than what I imagined it would be.",
      "total_reactions": 8,
      "user": "MrRobinson"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "Alright I saw this movie last night and I was VERY surprised. First off Noah has this army of rock creatures that are really stupid. Second this movie had some really scary parts like when people got chopped apart to eat and when the people outside the ark were on that rock and getting washed away. I would not recommend this movie for people under age 11",
      "total_reactions": 12,
      "user": "GregTheGr8gamr"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "To be clear on this review: I did NOT read the bible story of Noah's ark recently when going into this film. I wasn't looking for a faithful adaptation or something to recapture my feelings on my first experience reading the bible: all I was looking for was a good film.",
      "total_reactions": 3,
      "user": "JoeKnowReviews"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "\"Noah\" is possibly Darren Aronofsky's worst movie. That being said it's still an entertaining well made film in it's own right. I was a little disappointed, but only because I hold him in such high regard with such an amazing track record of movies (The Fountain alone is enough to mark him as a modern master in my opinion, not to even mention Black Swan, The Wrestler, and Requiem). I think his first foray into CGI may have demanded enough of his attention that the film suffered a little. It's not as succinct as his previous outings.",
      "total_reactions": 6,
      "user": "eupatorus"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "The fallen angels were really something to see and added a bit of depth to an otherwise same old story.  The animals should have been more brightly colored and have more to do with the story than just falling asleep.",
      "total_reactions": 5,
      "user": "jakesays"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2014
      },
      "score": 9,
      "text": "i'm not atheist, i'm not christian.",
      "total_reactions": 3,
      "user": "BernanHandeiro"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "if it hadn't been for the stunning visuals and good casting choice with russell crowe, jennifer connelly and emma watson, this movie wouldn't have fostered. in fact, i'd like to think of NOAH as a weak work of arrenofsky. there were high expectations.",
      "total_reactions": 2,
      "user": "arsheesh"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2014
      },
      "score": 9,
      "text": "A fascinating retelling of the Noah story. An epic derived, not from the biblical telling of Noah, but from Hebrew, Gnostic, and Kabbalist texts, interweaving the familiar story with stark and beautiful pagan imagery to create a wholly unique film. With Noah, Aronofsky proves that the story of the great flood does not belong just to Christians, but comes to us from a multitude of different faiths and, with it, different interpretations.",
      "total_reactions": 3,
      "user": "silversun101"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 1,
      "text": "As a Christian, I can accept somethings about this movie that could be in the bible. For example there is no mention of people wanting to get onto Noahs ark in the bible. However I am sure during this time period, people probably thought Noah was crazy, but I have little doubt that they tried to get on, with the impending doom. The rock monsters I am not so sure about.",
      "total_reactions": 3,
      "user": "surfnow3"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "Being a Russell Crowe Fan  I personally thought he put on an Oscar Winning Performance. There was never any reference to God only to the Creator.. When you add alien looking creatures as the Watchers of The Wall you tend to think the producers believe we were created by Alien Beings.I thought all the actors put in terrific performances and the movie had a strong theme of Good vs. Evil with of course Good winning out. As whacked out as Hollywood is at least up to this point they do not have Evil prevailing.",
      "total_reactions": 3,
      "user": "rh2599"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "Even if the story is not close to the Holy Books, it is a unique imagination and interpretation of what could have happened with Noah, and it turned out pretty epic so watch out for it is a must see film!",
      "total_reactions": 3,
      "user": "HaithamB"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "i REALLY liked this movie...it was awesome! i really liked Emma Watsons acting in this movie...and the story line was very well put together, i like the other actor they chose...like Logan Lerman. i really liked this movie and i would recommend you watch it.",
      "total_reactions": 3,
      "user": "co2345"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "No entiendo las malas críticas. Es entretenida de principio a fin, con buenas escenas de acción, interpretaciones dignas y alejada de momentos \"tostón\" de pelis de este género. Ojalá todas las películas bíblicas fueran como esta.",
      "total_reactions": 4,
      "user": "CPD98"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "Um filme duvidoso, vamos começar pelo lado bom",
      "total_reactions": 2,
      "user": "fillipinhoeduar"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "We shouldn't be disappointed that this movie doesn't repeat the biblical story of Noah. We know that the Noah story borrows many elements from the Epic of Gilgamesh. This movie creates an even deeper story that finds that man has destroyed his environment and his lust for violence and domination has brought him to the brink of ruin. It recreates the whole history of creation by fast forwarding the “days” of creation into the evolution of the universe and the life forms on earth. This is a new and revivifying story and one that needs to be told alongside our other stories to carry us forward with the mission of Noah to renew the earth all over again.",
      "total_reactions": 3,
      "user": "johnforourke"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "This movie may rely a little too much on special effects but it was still pretty solid. Nice to see a little bit of a twist on this story. Seeing Noah as a bit of an anti-hero instead of a courageous hero.",
      "total_reactions": 2,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "Very moving version of the classic old testament story.  Really keeps your attention from start to finish.  A powerful tale of good versus evil.  One man's struggle to decide the fate of humanity.",
      "total_reactions": 3,
      "user": "danlm12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "“In the beginning there was nothing.” Says Noah when he describes the creation to his family while they are floating on the water surrounded Earth.",
      "total_reactions": 2,
      "user": "Omid975"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "Very good movie, excellent, highly recommend, I was never bored...great graphics, excellent  actors, the history is very interesting, the question is, the history of the movie there's some parts that are not mentioned on the bible right?",
      "total_reactions": 3,
      "user": "Dominican"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "A pesar de ser una película religiosa trata de los lazos familiares y como hacer frente a una tragedia o cataclismo... Noah le hace frente a la misión sin antes pensarlo dos veces.",
      "total_reactions": 3,
      "user": "realnostok"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "The storytelling is good,score exciting at times",
      "total_reactions": 1,
      "user": "root_"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2015
      },
      "score": 3,
      "text": "A única coisa que salva no filme é o cast com Russell Crowe, Jennifer Connelly, Emma Watson e Anthony Hopkins. No mais, tentaram forçar uma história \"incrível\" e não funcionou.",
      "total_reactions": 1,
      "user": "BlaKDemonaZ"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "Sweet clouts of humour, generosity from the righteous and no vanity. Overall, a movie worth watching, with breath catching nodes.",
      "total_reactions": 2,
      "user": "Myodynamic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "Hey, at least you can end up being ashamed of yourselves after giving that review to this movie. Haven't you people ever heard of this one word called... \"Try\"? At least that's what the filmmakers did unlike most of you out there.",
      "total_reactions": 2,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "A nice fiction/adventure story. I liked the rock creatures, unlike most people who reviewed the film! It made the movie a lot of interesting! Some parts of the movie were actually good! Overall a good movie, something to watch on Netflix if youre bored.",
      "total_reactions": 0,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2015
      },
      "score": 2,
      "text": "All I can tell you about this movie was by the end we were all rooting against Noah and hoping he would get killed.  Our two sons ages 10 and 11 asked why Noah was so evil.  No hero's in this movie.  This story was not the history I was told nor educated in church about.  Very dark depressing movie - worst movie I have seen in some time.",
      "total_reactions": 0,
      "user": "bigjon1958"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2015
      },
      "score": 2,
      "text": "Firstly, I have no idea what the Biblical version of this story actually is other than the pretty basic Noah has two of every animal on the ship thing. That being said there were so many problems with this movie. It is begging to have an MST3K episode actually. The part with the rock transformer things- really? That was so ridiculous. I was also very confused about how the \"ark\" was seemingly completely stationary (seemed a lot more like a large cargo container) but survived the flood. It was not as high as the mountains and those got covered with water so how did that ark not get covered with water. There was a filler section that showed Noah talking about man killing each other and it showed shadows of men with machine guns...Also, the end where it showed all the different animals and their babies should have had \"copyright of the Discovery channel\" because it really looked like stock footage. Some of it was even in standard definition. There was absolutely no emotional connection to the characters.",
      "total_reactions": 0,
      "user": "khaleesi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "We all know Noah and the great flood. I won't go into the details of it. Story line is good, Russell and Emma performances were good. The funny thing is Noah got help from fallen angels such as azazel and Semjaza to build the ark. In history, these 2 and the other fallen angels were punished and locked during enoch time, so it's been long before noah time. I generously give 6 stars because it's a good movie to watch.",
      "total_reactions": 0,
      "user": "ivan_terrible"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2014
      },
      "score": 1,
      "text": "I'm giving this a one to balance out the ridiculous amount of good scores this is getting. This movie doesn't deserve a 5/10. Really bad looking CGI, sacrilege story, unnecessary additions to the original story that ends up making this a terrible film. Seriously, if they had stuck to the original story it would have been a much better movie for Christians and atheists alike. Anyone that gives this anything above a 5/10 has no taste whatsoever.",
      "total_reactions": 0,
      "user": "Patrick94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "Usually everyone knows what it's about after reading the title, but the thing is how much it will surprise us with newly initiated contents like visuals, story alteration, performance and finally 3D. There are many versions of 'Noah's Ark' story including animations. So I expected it wouldn't work as a full-length feature film, Especially in live-shot version. But got a good response by performing decently everywhere. A perfect way to say about the movie is it was an ancient version of the movie '2012'. No science involved, only fantasies. Remember the character Noah was not exactly a good guy either bad in this story. He was portrayed in such a dark and complicated personality who take the responsibility that was given to him by the creator.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "This is a film that gets a pass from me (nothing else) because putting together a big film is always hard and the performances by everybody are correct. The film is watchable and kind of entertaining. Not much more going on with this fictional take on how the invented events wrote by some men centuries ago in the Bible. Decent.",
      "total_reactions": 0,
      "user": "sanyrub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "There is one thing for certain about \"Noah\" that I think everyone will agree with - what Aronofsky does with the film is both very surprising and very creative.",
      "total_reactions": 0,
      "user": "FadeBlack"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "Filme lixo!! Já não esperava a fidelidade com a Bíblia, mas nem entreter esse filme conseguiu. E olha que tinha um bom elenco em mãos (Crowe e Hopkins), mas mesmo assim entraram para a história como estrelas de um dos piores filmes que já vi.",
      "total_reactions": 0,
      "user": "ksatch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2015
      },
      "score": 4,
      "text": "Even the final song is mournful and down.  I don't understand why the 3 sons got no wives and then the whole thing with the twin girls to be killed ala Abraham.  Before the flood was pretty good -- about an 8.  After?  Zero.  Average four.  Shame.",
      "total_reactions": 0,
      "user": "chilledbee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2016
      },
      "score": 3,
      "text": "Absolutely hilarious! This movies' protagonist has nothing to do with the actual \"Noah\" from the old testament! The story was just... wrong! The acting was probably the only good thing, and the visuals were ok, but i don't think that these are the things that make one - a good movie! Frankly even the comedy  \"Evan Almighty\" has more common things with the actual Noah than this one!",
      "total_reactions": 0,
      "user": "SEROJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2014
      },
      "score": 2,
      "text": "The beginning has the feel that it might be on the right track only to completely derail after about 30 minutes.  Shame too because of the quality of actors this movie provided.",
      "total_reactions": 0,
      "user": "tylerdurden1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2015
      },
      "score": 4,
      "text": "It's not like an average Hollywood blockbuster...which in general is a good thing. However Noah is sloppily told with a mix of sometimes incredible sometimes laughable and always slightly odd visuals. However the main problem with this movie stems from the fact that it is quiet obvious that the director-instead of seeing a message of hope and redemption, sees Benjamens...lots and lots of em",
      "total_reactions": 0,
      "user": "cryhardhumor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2014
      },
      "score": 3,
      "text": "The film presented a few interesting moments and some satisfactory acting especially from Russel Crowe.  However, the directing and cinematography were terrible, the script beyond terrible, and the conclusion left much wanting.  The oddest addition to the film by far was the symbolic nature of the snakes skin.",
      "total_reactions": 0,
      "user": "AlexanderLuthor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2014
      },
      "score": 4,
      "text": "It's hard to believe that Noah is actually produced, wrote & directed by Darren Aronofsky, the very man behind masterpiece like Black Swan. The artistic approach, the dramatization is just fail. Classless weak scenes scattered everywhere.",
      "total_reactions": 0,
      "user": "sanct"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2014
      },
      "score": 6,
      "text": "Darren Aronofsky brings Noah into the 21st century with this silly but thought-provoking visual-effects ridden blockbuster epic. The special effects and family conflicts work, but more respect to it's source material and stronger sub-plots would have improved it.",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "As a movie, not from a religious point of view, this is a boring movie.  Utterly unbelievable and dark.  I played the last 45 mins at 2x speed.  I do not know how much is historically correct, but I have never seen or heard about anything in history that was close to what is in this film.  For a 2 plus hour film, no time was spent dealing with the struggle to build the ark.  Poof it was built in 2 mins and all the kids were grown.",
      "total_reactions": 0,
      "user": "MagicManRAW"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "This movie was simply the WORST and I mean that. It tries to be a fantasy movie based on truth and fails in so many ways. The heavy-handed christian morals being shoved in your eyes none stop just makes it plain unbearable. Oh did I mention the angel/rock-monsters that actually do most of the ark building? Give this travesty of a movie a really wide berth.",
      "total_reactions": 0,
      "user": "Zadeus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "One would think this focuses on Noah's Ark. But instead it focuses on the consequences of a pregnant girl, while on the ark. Honestly, extremely overrated. Critics do not realize what good acting is or what a good story is anymore.",
      "total_reactions": 0,
      "user": "chw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "A big-budget Biblical flick that tries to add some psychological drama to the spectacle.  Succeeds in some areas, but fails in others.  The CG babies were almost as bad as the one in Twilight.",
      "total_reactions": 0,
      "user": "joshmorgan64"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2014
      },
      "score": 4,
      "text": "$130 million? $130 million should have made the movie a lot better. Okay, I'll admit it, I liked the graphics. Giant world-covering tsunamis do actually look good. However combine that with a story many centuries old, and mix it with a madman who carries the name Noah, and throw in some random rock people, and this movie becomes plain disrespectful. Battle scenes? Rubbish. Lame tactics (they only charged and used infantry, no cavalry, siege engines, or arrows, javelins, shields, not even slings!), men with no swords, and this adds on to the level of disrespect this movie brings on. If you're Jewish or strongly Catholic, this will not make you happy at all.",
      "total_reactions": 0,
      "user": "smeeeee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "Noah was an entertaining spin on the classic biblical tale that'd be able to capture an audience greater then the diehard religious faithful. Could have been a bit shorter.",
      "total_reactions": 0,
      "user": "tvhandy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2014
      },
      "score": 4,
      "text": "If you didn't tell who the director of the new Noah movie was I would assume almost immediately that it was Michael Bay, not the talented Darron Aronovsky that everyone has come to know. I'm not rating this movie from a Biblical standpoint because everyone should know by now that it isn't accurate at all. (fallen angels that look like rock versions of Optimus Prime, no wives for the other two sons, someone actually getting into the ark) This movie is being completely rated based completely on the production which is sorely lacking in an interesting story. First the good is that the leads do an excellent job of acting the story out and Ruselle Crowe hasn't looked this alive in a movie in about ten years. The scenery is also quite the spectacle and the special effects are almost Bay-like and definitely had a lot of money put into them. That money was spent in vain though. First this movie needed an actual script that didn't sound like it was written by a five year old. Some of the one liners in this movie are actually almost painful to listen too. The acting by a few of the minor characters is awful. The directing by Aronovsky almost seems like the man is truly confused. He almost doesn't even seem to know where this movie was going. The score is almost too ridiculous for its own good. Its constantly too epic and blasts practically throughout the entire movie even when a scene doesn't have any tension whatsoever. Ultimately the bad outweighs the good in this movie. Anybody into explosions and Transformers will be into this film but anyone who actually wants to see a good movie might as well steer clear of this one.",
      "total_reactions": 0,
      "user": "kheuvel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "Noah started promisingly enough by positioning the titular Biblical character as something of an environmentalist - a completely natural trait to show, as anyone who cares about animals must, by default, also care about their habitats and flora - who was at odds with what appeared to be something of a Man-created wasteland in the souring world around him.",
      "total_reactions": 0,
      "user": "Vercoda"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2014
      },
      "score": 1,
      "text": "from now on when people tell me to stop waiting my time i will think in this movie, seariously dont watch it. unless you are really a religious one (fanatic), cheers.",
      "total_reactions": 0,
      "user": "miteshu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "Darren Aronofsky brings Noah into the 21st century with this silly but thought-provoking visual-effects ridden blockbuster epic. The special effects and family conflicts work, but more respect to it's source material and stronger sub-plots would have improved it.",
      "total_reactions": 0,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2014
      },
      "score": 2,
      "text": "The only thing keeping this thing afloat was the collective effort of the actors. But all their relentless emoting  was for naught. They lost their moorings, got caught in tangled story lines, and presumably landed on the isle of B-movieland. Alas.",
      "total_reactions": 0,
      "user": "cdodge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2014
      },
      "score": 1,
      "text": "I like Russel Crowe.  I think he is generally under rated but this movies was awful.  Seriously bad.  Whether you are religious or not it is still bad.  Don't waste your time-i saw it on an airplane so i take some solace in that",
      "total_reactions": 0,
      "user": "pictou"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2014
      },
      "score": 0,
      "text": "A lot of reviews of Noah discuss the straying from the biblical story or other 'spiritual' aspects of the film. As someone who experiences a great movie as a spiritual journey in itself I found Noah to be complete crap. I actually thought the first few minutes (before Mr Crowe appears) were an elaborate piss take of the actual movie (in fact I still am not sure the people who rated this movie highly saw the same movie I did).",
      "total_reactions": 0,
      "user": "RayDiant"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "\"Noah\" 10 Scale Rating: 5.0 (Mediocre) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "*Keep in mind, if you've read the Bible or religious in any sort of way, DO NOT watch Noah*",
      "total_reactions": 0,
      "user": "Movi3R3vi3wer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "Despite its visuals and strong performances, Noah has an uneven narrative and bad storytelling. Not to mention the underused Russel Crowe who was one of the only highlights of this movie. 4/10 (Below Average)",
      "total_reactions": 0,
      "user": "Le__Xenomorph"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 2,
      "text": "Even though the performances are solid and some of the set pieces look fascinated, the bloated, boring, and conceded nature of the whole film just leaves a bad taste in my mouth.",
      "total_reactions": 0,
      "user": "WheelzFourReelz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "Unbelievable! People call this movie a \"Biblical Epic\" This movie was not even 3% true! Noah was one of the worst movies of all time. Besides The Interview, there is a movie with poor direction and dialog and that specific movie is Noah. If you are thinking about watching this movie, You better think more than twice.",
      "total_reactions": 0,
      "user": "TheLatinoCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "In the beginning, there were no rock creatures.  In the beginning, Noah walked and talked with God in all perfectness.  This movie made Noah look like an idiot full of hatred in all ways.  OK so the graphics were great- special effects.  There was pretty stuff, but  The movie didn't really follow the Bible, but more of hollywood's portreyal.  I laughed but walked out because we rented this as a redbox film and I got tired of all the fighting.  Then I came back and just tried sitting through it.  Overall, I've seen better films than this.  Bootycheddah!   Bootycheddah all the way.",
      "total_reactions": 0,
      "user": "nolarc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "Decisamente mediocre, irrealistico e scarsamente attendibile.",
      "total_reactions": 0,
      "user": "alexgrumpyd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "This was a movie that could have been good, but they made it drag on and on. Someone else said that it was a good movie chopped up and spread across a field of bore(my complete paraphrase), and they were spot on. I take off 3 points for the extra half hour they should of trimmed off. There were times I almost turned it off because it was so slow.",
      "total_reactions": 0,
      "user": "mjhollan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2015
      },
      "score": 2,
      "text": "Noah is one of the worst pieces of crap of 2014. The movie doesn't follow the story correctly and half the events in the movie don't make sense. At least the CGI and acting are decent. But by god what an overrated movie. I would recommend this only to hardcore Darren Aronofsky fans, but no one else. 2/10",
      "total_reactions": 0,
      "user": "BB_Critic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2015
      },
      "score": 3,
      "text": "The tedious plot makes the 2 hours over film a pain to watch. The part where it got slightly engaging was the part where the wicked humans starts waging attacks on Noah, attempting to seize the ark to save themselves from the great flood. And the part where Noah was forced to make a choice whether or not to kill his newborn grand daughters was pretty tense.",
      "total_reactions": 0,
      "user": "Astor_"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2015
      },
      "score": 2,
      "text": "This movie is not worth a watch at all. I was watching this late at night and seriously considered just going to sleep on the couch. Also, I must mention that I am not a religious person at all, and I gave my score solely based on the weak aspects of the  film.",
      "total_reactions": 0,
      "user": "TheTitan"
    }
  ]
}