{
  "mc_avg_user_score": 5.4,
  "mc_metascore": 51,
  "mc_mixed_rating_frequency": 4,
  "mc_movie_name": "Nobody Walks",
  "mc_negative_rating_frequency": 1,
  "mc_positive_rating_frequency": 2,
  "mc_pro_critic_reviews": [
    {
      "critic": "Ian Buckwalter",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "A film in which everyone is lusting after the wrong person, and consummating those desires tends to lead to awkward - but not funny, unlike Dunham's usual projects - disasters of various scales."
    },
    {
      "critic": "Cory Everett",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "Full of humor and humanity, Nobody Walks is an emotionally complex, acutely observed and sensual film."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 70,
      "summary": "It would be tempting to dismiss Nobody Walks as a trivial erotic divertissement, even more so because it doesn't apply the kind of symbolic gloss found in a '60s film of serial seduction, like Pasolini's \"Teorema.\" Banal as its situation may be, it picks at every scab you may have left over from wounds suffered during the mating games of your youth."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 70,
      "summary": "If you allow yourself to drift with it, rather than get frustrated by all the non sequiturs, Nobody Walks becomes a more enjoyable film."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 70,
      "summary": "Reminiscent of 2010 Sundance breakout \"The Kids Are All Right,\" Ry Russo-Young's Nobody Walks captures the fallout of an open-minded Los Angeles family shaken up by the arrival of a sexy outsider, only this time, it's the outsider whose perspective takes precedence."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "The acting ensemble is crucial. Everyone's really fine."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 58,
      "summary": "Nobody Walks is Mumblecore 2.0: The budget is bigger, the cast is littered with recognizable faces from popular television programs, and the production values are more impressive, but the fixation with the low-key, artsy angst of rudderless twenty- and thirtysomethings remains constant."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 58,
      "summary": "Russo-Young studies the strange species of affluent Angelenus erectus under a microscope that distorts every character into unbelievability."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 50,
      "summary": "Proves to be unsatisfactory because it establishes a well-defined group of characters and shows them disrupted by the careless behavior of a tiresome young woman and two adults who allow themselves to be motivated in one way or another by her infectious libido."
    },
    {
      "critic": "Walter Addiego",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "Don't fault Thirlby, who does as much as she can with the material. Krasinski is pretty good, and DeWitt and Ennenga are outstanding. The direction is decent, and the film is handsome. But it's finally frustrating, enigmatic in a way that suggests emptiness more than mystery."
    },
    {
      "critic": "Chuck Wilson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "Ultimately, the director and her cinematographer, Christopher Blauvelt (Meek's Cutoff), prove to be more interested in capturing the perfection of L.A.'s perpetual sunshine and the ways in which the people beneath it seem subtly oppressed, as if the light is expecting more of them than they can possibly deliver."
    },
    {
      "critic": "Jesse Cataldo",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "The whole thing comes out feeling kind of featureless, beaten flat by its own sense of fairness."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "A good-looking but anecdotally slight dramedy about life and lifestyles in Los Angeles's hip Silver Lake district."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "Sensitively written, nicely shot, expertly acted, and intelligently ambiguous, Nobody Walks still manages to send you out with a shrug."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "It's a naive example of the transformative powers of a 23-year-old let loose amongst the dullards. Whoa."
    },
    {
      "critic": "R. Emmet Sweeney",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "For a film about sexual conquest, Nobody Walks is a frustratingly flaccid affair."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2012
      },
      "score": 25,
      "summary": "None of Dunham's humor comes across, except when someone says, \"And when you speak, your words are snakes I swat at with swords,\" which is hilarious, but not intentionally."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2012
      },
      "score": 25,
      "summary": "The actors are all completely wasted in this dumb travesty of fumbling, unfocused, oversexed numbskulls who work in the movie business. Everyone connected with Nobody Walks should have done just that-early and quickly."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2012
      },
      "score": 4,
      "text": "A dramatically unengaging mainstream blend of mumblecore ideas, 'Nobody Walks' features some top-notch performances from the all around cast, but fails to utilize them to fullest effect and the film winds up being rather boring, even within its running time of 82-minutes. The recurring air of sensuality is potent enough, but the entanglements that the characters get into are delivered without any real consequences for their actions. These are flat and lifeless characters that feel constructed on cliches from other, better indie character studies (I liked how one critic compared it to Lisa Cholodenko's 'The Kids Are All Right') and their troubles feel less intimate and affecting than they think they are. The cast is appealing and the look is very polished for an indie of this nature, but 'Nobody Walks' is inert at creating any genuine dramatic pull. It's strange that the script, penned by the up-and-coming Lena Dunham, has led to such mediocre results, though it's hard to pinpoint a direct source of blame.",
      "total_reactions": 0,
      "user": "TheDRauch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "\"Nobody Walks\" 10 Scale Rating: 4.5 (Mediocre) ....",
      "total_reactions": 0,
      "user": "DCEdmonds"
    }
  ]
}