{
  "mc_avg_user_score": 7.1,
  "mc_metascore": 50,
  "mc_mixed_rating_frequency": 160,
  "mc_movie_name": "Now You See Me",
  "mc_negative_rating_frequency": 79,
  "mc_positive_rating_frequency": 464,
  "mc_pro_critic_reviews": [
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 91,
      "summary": "Now You See Me can’t quite claim to be the ideal crime drama – that would be “The Usual Suspects,” which justly won an Oscar for its script – but it’s only one level down."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 83,
      "summary": "This movie has everything up its sleeve and presto chango at its core, ending in defiance to the plot's established logic before viewers realize they've been had."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "Much of what makes Now You See Me so entertaining — in a gaudy, disposable, Vegas act sort of way — is its ever-escalating ridiculousness."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 75,
      "summary": "It's a little along the same lines as \"Ocean's 11\" in what it achieves and, like that film, there's plenty of Oscar power among the actors - a combined 15 nominations, to be precise."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 75,
      "summary": "At times, Now You See Me suggests Christopher Nolan's \"The Prestige\" made with a throwaway wink."
    },
    {
      "critic": "A.A. Dowd",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2013
      },
      "score": 75,
      "summary": "Now You See Me, which is essentially an \"Ocean’s\" movie recast with illusionists, demands a kind of childlike fascination with swindles, and a willingness to be hoodwinked along with the characters. Walk in with those expectations and it won’t be hard to see the appeal of this ludicrous but spirited caper, which has nearly as many rug-pulls as game movie stars."
    },
    {
      "critic": "William Goss",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 72,
      "summary": "The film itself is sly and smug in kind, fleetingly enjoyable for all of its old-school showmanship and high-tech hokiness."
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 67,
      "summary": "Leterrier's film is a reminder that sometimes a good yarn can do enough heavy lifting on its own to provide thrills. Whether or not the illusion pays off will be up to you, but the trick itself may be intriguing enough."
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 63,
      "summary": "The problem is that, in focusing on what makes a good caper, director Louis Leterrier forgot about what makes a good movie: character development, carefully constructed tension and believable plot points."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 63,
      "summary": "There's a great movie out now about magicians, sleight-of-hand maestros, illusionists, card and coin tricksters. Now You See Me is not that movie."
    },
    {
      "critic": "Ken McIntyre",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 60,
      "summary": "Ocean’s Eleven meets The Prestige? Not quite. Starts well, ends in a heap, but in between there’s just enough splash and flash to distract from the lack of substance"
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 60,
      "summary": "Thanks to some accomplished hocus pocus and an appealing cast, this would-be “Ocean’s Eleven” of the magic world remains watchable throughout, even as it plods along without ever quite fulfilling its potential."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 60,
      "summary": "A sleight-of-hand heist film that feels like a cross between David Blaine and \"Ocean's Eleven,\" with a little Robin Hood thrown in, it's a ripping bit of fun. If, that is, you let it be."
    },
    {
      "critic": "Zachary Wigon",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 60,
      "summary": "When functioning like a magic trick, this breathlessly entertaining picture delights in its showmanship, but the more entertaining the trickery, the tougher the explanation, and when the truth is revealed the answer can't help but fail to satisfy."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 58,
      "summary": "Although the filmmakers reportedly worked with David Copperfield and other renowned real-life illusionists and tried to minimize the use of CGI, you're still left wondering how much of the magic is merely the kind Hollywood spits out by the terabyte."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2013
      },
      "score": 50,
      "summary": "Leterrier’s film is the kind that doesn’t stand up well to scrutiny: The more you know about it, the more befuddled you’ll be."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "It's mostly smoke and mirrors. After Freeman's snooze became a YouTube fixture, the actor jokingly dismissed the nap, saying he was using \"Google eyelids\" to check his Facebook account. You may find yourself attempting the same feat, because Now has little up its sleeve."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "There is nothing magical about seeing one’s umpteenth car chase. Mark Ruffalo plays the weirdly scruffy FBI agent on the case, while Morgan Freeman, in super-slow mode, plays a famous magic debunker. He’d make the ideal critic for this movie."
    },
    {
      "critic": "Abhimanyu Das",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "There's nothing behind all this sturm und drang but a lineup of insubstantial ciphers, all false fronts and empty words in a pretend world not quite conducive to emotional investment."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "There’s a fine line sometimes, as \"This is Spinal Tap\" reminded us, between stupid and clever. Now You See Me wobbles along that tightrope for much of its running time."
    },
    {
      "critic": "Mark Feeney",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "The editing of the action sequences is an insult to the idea of narrative clarity."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "A superficially diverting but substance-free concoction, a would-be thriller as evanescent as a magic trick and one that develops no suspense or rooting interest because the characters possess all the substance of invisible ink."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "Now You See Me is a movie about magic, but its most astonishing trick is how little mileage it gets out of a stellar cast."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "For all its showmanship, Now You See Me has a lot less up its sleeve than it lets on."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "Overcooked, overcomplicated and underinteresting, this heist caper turns into a mess."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2013
      },
      "score": 40,
      "summary": "Director Leterrier keeps the camera moving and swooping throughout the film as if the Steadicam were another device in the magicians’ tool belt. A clear sense of space and sleight-of-hand is rarely achieved."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "When Mark Ruffalo shows up as a crumpled detective, you expect a dose of reality, yet on his heels come twin hams Michael Caine and Morgan Freeman, whose solemn presences (as Christopher Nolan knows well) prove wonderful distractions from silliness."
    },
    {
      "critic": "Joel Arnold",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "It's all a little dumb, but the movie boasts several non-CG tricks and a few genuinely mesmerizing set pieces including a hand-to-hand-to-magic combat scene between Ruffalo and the spry Franco."
    },
    {
      "critic": "Gary Goldstein",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "For all the talent up on the screen — and one can't fault the performances — the movie just doesn't deliver."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "Long before the story culminates with a preposterous final revelation, whatever hopes you had that Now You See Me might have had anything to say about the profession of magic, rampant greed or anything else have been dashed."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "For a while, Leterrier does manage to conjure up a little bit of magic between all these charming actors. And then, presto: Just like that, it’s gone."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 38,
      "summary": "I left this movie feeling I’d been had. And not in a good way."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 38,
      "summary": "None of these seemingly plot-rich questions are explored; instead, we’re stuck with a greasy-haired Mark Ruffalo, as his detective character flounders along in their wake, muttering that he doesn’t have time for this magic crap."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 38,
      "summary": "This is a slick con, all flash and no substance. Now You See Me seems awfully sure of itself, with self-important, intrusive music, sweeping tracking shots and actors chewing up the scenery."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "This movie is not good. The preview is twice the production the movie is. There is no character building, and you are instantly thrust into this story that does not pan out. Do not waste your time.",
      "total_reactions": 5,
      "user": "chadg_77"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "\"All flash and no trousers\"  A weird saying, but who's Father isn't full of oddness?   Mine certainly was and he used this expression regularly when something was, basically, bollocks.   Now You See Me falls in to this category.  Cool cast,  flashy effects,  great locations, mixed with a predictable story line, average script and some truly wooden performances  Dave Franco, I'm looking at you.",
      "total_reactions": 3,
      "user": "GingerFury"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Although it suffers from a flat ending and can't help feel fictional, Now You See Me provides great visuals and some smart twists (not the last one!) to succeed.",
      "total_reactions": 1,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "Visually appealing movie that is brought down by the very stupid and unbelievable twists that really stretch the suspension of disbelief. Heavy reliance on CGI when trying to show \"magic\" which breaks the illusion that the Four Horsemen are only illusionists. Add to that a pretty pointless and shoehorned romance subplot and you get Now You See Me.",
      "total_reactions": 7,
      "user": "Xandercz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "Terrible Movie however it's weirdly entertaining.",
      "total_reactions": 7,
      "user": "MattyJM"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2013
      },
      "score": 2,
      "text": "This was one of my worst movie experiences in the past ten years: terribly derivative, intellectually insulting, and a complete waste of time.  The sequence of events are too convenient for a heist movie, so the magic element had to be thrown in.  However, the magic show scenes are too boring, and the interplay between the characters is too dull to be a magic movie...so some heist element had to be thrown in.  This was my general take  it is neither one nor the other, nor good enough to be either.",
      "total_reactions": 16,
      "user": "ScrawnyPunk"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2013
      },
      "score": 0,
      "text": "Intellectually insulting, The story felt like it was written as they were shooting the movie! as did the twists and turns. I couldn't believe people are rating this movie so high!",
      "total_reactions": 8,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "This is possibly the worst film i've ever seen, and i'm not saying that lightly. I cannot understand these positive reviews other than they're mentally deficient or paid to do so.",
      "total_reactions": 15,
      "user": "SKELETOR420"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "\"Now You See Me\" was itself a type of magic trick. Louis Leterrier uses a great cast with the premise of magic and bank robbery to draw us in. Unfortunately it doesn't take long to realize that instead of character development we get Morgan Freeman explaining the plot after the fact. At no point did I find myself wondering \"how is this going to turn out?\" The magic has little excitement because we know that using CGI, anything is possible. Add that to the fact that the \"big reveal\" is exactly what you would expect and you end up with the feeling that the trick was on you.",
      "total_reactions": 12,
      "user": "trujustin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "To be honest, I was not expecting much for this movie. It wasn't as hyped as other movies and I would never have known about it if a friend hadn't suggested that we watch it. I have literally jut come home after watching it and I have to say, I enjoyed it. Sure, the characters could have used a little more development, and the movie may seem a little confusing for others, but I was able to keep pace. There is also a rather surprising plot twist (which I won't reveal, obviously). Now You See Me may not be the best movie out there, but it's a pretty good one. Check it out.",
      "total_reactions": 3,
      "user": "MicoB1022"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Most reviews of \"Now You See Me\" are comparing this movie to the \"Ocean\" series, but while the elaborate schemes are somewhat similar it really isn't the knockoff one expects.    Rather, the movie follows the work of four magicians who call themselves \"The Four Horsemen\" and thrill audiences with some very intriguing stunts.",
      "total_reactions": 3,
      "user": "shpostal"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "It's fun in the moment. Some entertaining performances and chase scenes. But there are a half dozen plot holes and an ending that is just lazily handed to the audience. Not awful, just nothing special.",
      "total_reactions": 5,
      "user": "tropicAces"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "I was expecting a lot from this movie, as the premise (magicians AND heists?!?) sounded like a combination made in heaven, and the cast was a dream (Eisenberg and Harrelson back after an awesome Zombieland teamup, and then sprinkle in both Morgan Freeman AND Michael Caine?). This movie should have been a 10. \"Unfortunately,\" it was just an 8. The movie was a lot of fun throughout, wasn't patronizing, had some decent twists, was well acted and directed, and never tried to explain anything supernaturally (which I would have hated as a proud skeptic). It was just a bunch of smart, smooth magicians being awesome. The reason it wasn't a 10? It wasn't perfect, so no 10, and I simply never got goosebumps or was left reeling, which is the standard I hold most 9s to. However, I'd definitely recommend this movie very highly.",
      "total_reactions": 15,
      "user": "Ragaboo"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 1,
      "text": "This movie relies on every cliche used in movies and bad writing.  Can Isla Fisher actually act?  The only movie she was remotely good in was The Wedding Crashers.  Woody Harrelson's acting is always great and consistent as is Mark Ruffalo's but in this case, the writing was so awful nothing could help it.  Yuck blech.  At first I thought the movie was a metaphor for the awful Obama administration, but then it digressed into another \"hate the rich guy and the little guy gets screwed\" movie and needs to have his revenge.   Not much of a surprise.  Bring a pillow if you want to snooze.",
      "total_reactions": 8,
      "user": "poetreviewer"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "You can get some \"wow\" moments from Now You See Me but limited amount. It's not Ocean's Eleven or Tower Heist. It's a heist movie with wow moments and magicians. Now You See Me was directed by Louis Leterrier, the filmmaker responsible for the European pop-art hit The Transporter  as well as The Incredible Hulk and the Clash of the Titans remake. The film’s magician caper/heist storyline  which was engineered by Boaz Yakin (Prince of Persia) and relative newcomer Edward Ricourt  works in unison with Leterrier’s fine knowledge of cinematic technique. This gives rise to an interesting subtext about the enduring “magic” of movies, the purpose of art as entertainment, and the heightened importance of creative integrity in an age where cynical skepticism sells. Because of that, Now You See Me isn’t so much a character study  one set in the world of magicians  as Christopher Nolan’s The Prestige; instead, it approaches related subject matter from a very different angle and proves equally successful in certain regards. Leterrier’s film trades in the nihilism of The Prestige  in favor of hopefulness  and shows how referencing “movie magic” can be captivating; that is, without either coming off as self-congratulatory or waxing nostalgic about film artistry in an on-the-nose manner.",
      "total_reactions": 8,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "Just came from the theatre and talked all the way home about how much we enjoyed this movie from the very first minute. We felt it was well cast,well directed and totally entertaining. Even the music was catchy. It moved right along, did not spend too much time on character back stories and offered a number of interesting twists. I'd pay  full price) to see it again!",
      "total_reactions": 8,
      "user": "IMagram26"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "“Now You See Me” stars Woody Harrelson, Jesse Isenberg, Michael Caine, Morgan Freeman, Mark Ruffalo and Isla Fisher in this film which is basically a poor imitiation of “Oceans Eleven”. The film tells the tale of four prestidigitators as they attempt to work their “magic” in order to commit grand theft (with the emphasis on the word “grand”).",
      "total_reactions": 6,
      "user": "BHBarry"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "How refreshing it is to see a film where the child in you is brought out and bewildered. I found myself smiling from start to finish in awe of the magic and suspense.",
      "total_reactions": 6,
      "user": "bm2759"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "For what it's worth, it's surprisingly an interesting magic movie. It's entertaining and surprisinlgy well acted. As far as characters go, it's Morgan Freeman and Jesse Eisenberg that steal this movie. Most of the other characters are good, but they weren't as good as I expected them to be. To be honest the only characters I didn't really like was Dave Franco and Isla Fisher. The story was surprisingly interesting. It has certain layers to the story. I mean, you have the heist portion, then you have the action thriller type part, then you have well made drama. There are some scenes that were in a way unrelavent. But don't let that distract you from the story. Overall, it's a well made magic movie.",
      "total_reactions": 6,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 1,
      "text": "WAY too hard to follow",
      "total_reactions": 6,
      "user": "thethethethethe"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "Now you see me is pleasant and a clever surprise, with some fascinating effects and one of a kind cast. I loved what the movie is about and I had a really good time watching it, some problems with the movie that are not worth to talk about, despite mediocre reviews, Now you see me is one of the best of 2013.",
      "total_reactions": 6,
      "user": "MovieGoer14"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "It is not a disappointing film, but rather a disappointment of how good it could have been.  There are a lot of great ideas, but then again there are so many holes in the storyline.  There are some great actors, but then again one of the main roles is given to Eisenberg who instead of magical he is quite irritating.",
      "total_reactions": 4,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Fun and flashy to watch; I enjoyed watching the actors and the story unfold.  Not a lot of plot and what there was wasn't particularly  deep, logical or resolved; and no real connection to the characters.  But it was fun, and didn't involve bodily functions, which these days seems to be part of a lot of comedy films.  An amusing and unbelievable heist tale.",
      "total_reactions": 4,
      "user": "nancy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "I guess where this film fails the most is that despite it being a film about magic, I didn't really feel any sense of wonder or disbelief.  Nothing about this film was captivating which is a real shame because the premise is a very cool one.  It's just a case of really mediocre execution.  To the film's credit there were some really quite nice camera sequences and the twist at the end, whilst not entirely unpredictable considering the nature of the film was a very good one but the film as a whole felt so empty and unsatisfying.  The characters are probably the worst part of the film.  The main 4 characters were some of the blandest main characters I've seen in a long time and I felt like I couldn't connect with them at all.  They felt so stock, the kind of characters a 13 year old would try to come up with.  The film also tries to be clever in the way it executes a number of things but it just falls short completely.  Personally the worst thing a film can be for me is boring and unsatisfying which is what this film was for me.  There's a few positive factors but overall the film just felt like a waste of time and money.",
      "total_reactions": 4,
      "user": "Jorad"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "One of the most entertaining movie of this year. Great cast, interesting plot with some twists, some fun moments, impressive illusion tricks. Overall it a great time",
      "total_reactions": 4,
      "user": "PStakhiv"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "This film had a lot of problems.",
      "total_reactions": 2,
      "user": "Miro11"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "A film about magic that is more about CGI.  There is a strong cast that give good performances and the chemistry is the best part of the film.  Finally the finale of the film doesn't work for me.",
      "total_reactions": 2,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "I really don't know how I feel about this film after finally watching it because I was too amped up in watching it that I researched it, read updates from those who saw it and got excited, too excited as my expectations were a bit cheated. (Word of advice, don't read critiques or opinions prior to viewing it) I didn't really read about the film and or have it spoiled for me except seeing previews, videos and hearing so much praise for it that I was expecting mind blowing results but I'm reminded of this saying from Sheldon Cooper (Big Bang Theory) 'You told me it's mind-blowing, so my mind is going into it pre- blown, and once a mind is *pre*-blown, it cannot be *re*-blown.' that is EXACTLY how I felt leaving the theater. It was a great fun movie no doubt. I do not diminish anything about the film but I will say this you have to have the right mindset to thoroughly enjoy it. My only complaint is that there needed to be more development for the four horseman. (It could've used at least another 30 minutes if you ask me) because they needed more screen- time. Im not gonna give anything away but I was not all that blown away in the end. I kinda figured it out. However, great cast, great acting and I WILL see it again. See that is what was brilliant about it. TPTB made it in a way that YOU have to see it again. Whether its for pure enjoyment, catching up or you missed something the first time.",
      "total_reactions": 2,
      "user": "luv70s"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "As the films mantra goes, the closer you look the less you see, but if you are going to enjoy this film it is a wise decision to do exactly the opposite. There is no need to investigate or inspect each and every twist and turn this film throws at you because there are bound to be holes. No, in fact what is best to do in order to enjoy Now You See Me is to simply sit back and take it in for what it is: pure, escapist cinema that delivers a relentlessly fun and entertaining ride that speeds by and leaves you satisfied when the credits begin to roll. Kudos to this movie for being able to stand on its own two feet in a season where every Friday is dominated by a sequel or spin off or re-make or something that is a familiar product that is sure to find an audience somewhere. Now You See Me is a completely original film in the midst of big studio fare that has the star power, the concept, and the appeal to win over those movie-goers who aren't just looking for an escape from the real world, but from the saturated sci-fi superhero adventure genres that are playing on every other screen. That is not to say I don't enjoy those kinds of movies as well and this year has been particularly good so far in terms of summer popcorn entertainment, but simply knowing going into this film that we are up for a fun ride that takes a subject that's commonly considered nerdy, such as magic, and combines it with the formula of a heist film to create something imaginative and fresh is indeed refreshing. Though there are certainly plot holes to be picked apart once people have the ability to re-watch the film several times, upon first viewing this is nothing more than a caper of a good time that has an incredibly strong cast each member of which is doing what they do best, churning out some solid and genuine laughs while balancing the never-serious tone with a fair amount of action and mystery that is compelling and keeps you guessing until the very end.",
      "total_reactions": 2,
      "user": "VandyPrice"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "I enjoyed the concept of the movie. However, I was hoping they would touch on the little things like the handcuffs, flying scarfs, and so on. I understand the point of the movie but more should have been put into explaining. By the time (over 3/4 way in) they started explaining the movie, however, they (the production team) confused me. Magic or real?",
      "total_reactions": 2,
      "user": "kraubenj"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "This movie deserves a round of applause. Its intricate, complicated plot and spectacular cast won me over moments into the film. Every single moment I thought I was completely on board with the plot, the following seconds had me second guessing. This film is definitely a favorite of mine. Well done!",
      "total_reactions": 2,
      "user": "Elizabeth_Wilk"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "\"Well acted, well directed and an amazing concept and story. Now You See Me is the freshest, coolest and one of the most original flicks to come along this year. Filled with surprises at every corner and a stunning final act, its a film you have to see.\"  A-",
      "total_reactions": 7,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "Just ignore all the bad critics and mediocre rate. This movie is incredible!. Even though, It isn't as perfect as The Prestige. But it's absolutely worth to watch! From the beginning till the end, you'll feel the tension and enlightened moment. The twist is awesome. Great job Morgan! you confused me a lot.",
      "total_reactions": 15,
      "user": "Filmlayarlebar"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "A nice movie with a definitely intriguing plot, good actors but, unfortunately, also with a somewhat letting down conclusion, explaining (or not) things. Worth watching nevertheless.",
      "total_reactions": 5,
      "user": "RealMuthaF"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Everyone that I've talked to has enjoyed this movie. Could it have been better? Sure. But it was fun, entertaining, and well paced. What's more, even though I thought some of the plot was predictable, they did get me at the end.",
      "total_reactions": 5,
      "user": "crystalpucca"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Is this movie a \"classic.\" No. Maybe to some people. It is a solid film though. I walked into it not sure what it was. Its a film about magic. But I was quite sure it would be a trick on the viewer. One big illusion with them cheating. (Those flashbacks to hidden scenes so that suddenly the pieces fit). I've always viewed that kind of thing as a cheap trick. But they didn't really go there. The plot is solid. Although like most films riddled with twists your left wondering if a couple of them were un-necessary in the end.",
      "total_reactions": 5,
      "user": "Gamed2long"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "I actually found this movie to be very enjoyable, with the unexpected twist at the end that had me and my friends looking at each other with wide eyes, mouths agape, and saying, \"NO WAY!\" haha Loved all the magic, of course, and that it was all mostly explained so we were not left wondering how in the hell they did all those impressive and seemingly impossible tricks. The cast is excellent with good acting to match. The romance angle they put into the story seemed forced, as if they finished the plot already but then some executive came in and said, \"No, this needs some romance in it. Make it happen.\" There are some questionable elements in the plot as well, but not enough to seriously detract from the overall quality of the movie in my opinion.",
      "total_reactions": 5,
      "user": "Toffenuff"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "There is actually the seed of a good idea here, but the confused execution lets it down. An interesting cast helps and the film is lively enough, but it is all smoke and mirrors. Red herrings abound and there is a surprise revelation at the end, but the improbable premise cannot withstand any serious analysis. An Insistent, almost 70'ish, music score and swirling camera movements try to elevate proceedings to a higher and slicker plane that the material just doesn't deserve. Morgan Freeman redeems himself after his nothing turn in oblivion and some of the editing helps things along.",
      "total_reactions": 5,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "I thought it was very well acted and very intertaining. Had a few twists and turns and just great fun.It was great the way they explained how all the tricks were pulled off.",
      "total_reactions": 5,
      "user": "60ish"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "This is one of the worst movies i've ever seen! I'm not going to add anything. Watch it if you want, but i don't recommend it. My score is 2/10 ,without no doubt",
      "total_reactions": 5,
      "user": "SEROJ"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "We thoroughly enjoyed this movie...fun entertainment with a surprising twist at the very end.  Not a lot of magic in the film, but enough to keep you watching for the next trick.  I do not like either Harrelson or Freeman since both seem so arrogant, but the cast just *worked* together.  Certainly a far better movie than a lot I have seen lately, but I go to be lost in the magic of movies, not for any deep psychological studies or great social commentary.",
      "total_reactions": 18,
      "user": "mjz4043"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "This was a surprisingly good crime thriller. The effects were great, story and actors were all well done. Pacing was good if not better than average for the length and it didn't try to force in room for a sequel or ruin it by showing to much in the previews. A must watch.",
      "total_reactions": 13,
      "user": "JPG127"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "Go see this movie! You will not be disappointed. I found it to be very clever and it has many twists and turns you will not see coming. I compare it to \"Oceans 11\" and the \"Sting\".",
      "total_reactions": 8,
      "user": "Slick1"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "This  movie was incredible. Ignore the ratings on Metacritic and go see this film.  It requires you to think and look in places you would never think to imagine and understand why the trick was happening.  At the end there is a moral compass and core for which we should all live by.  I thoroughly enjoyed this movie because it kept me on the edge my seat from the very beginning to the end.  2 thumbs up!",
      "total_reactions": 8,
      "user": "Marqueshh"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "Yet another instance where I am glad I did not listen to the 'professional' reviewers.   This movie kept me entertained every minute.   'Now You See Me' is clever and fun.  I appreciated that there was humor without a bunch of silliness, no long lulls of character back story development, and no sequel set up at the end.    I also like that it was smart, but not overly complicated.   I took my mom and my teenaged kids and everyone was able follow the plot through all the twists and turns.  We all loved it!",
      "total_reactions": 8,
      "user": "Lisa24"
    },
    {
      "neg_reactions": 17,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "text": "this the worst movies I have seen so far this year, you would think with a cast like this. it would be good, but it wasn't. this was two hour of my life that I will never get back The entire cast should find new agents. They are all talented enough not to waste their time on stuff like this A bank getting robbed in this movie, I got robbed. The thing you don't see coming sitting through and getting nothing in return. I would rather sit through a boring Las  Vegas magic show. No you me telling every disappear yourselves from this one. If it on for the bad movies like this, you could not appreciate the good one.",
      "total_reactions": 27,
      "user": "lismis7000"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "4 magicians (Jesse Eisenberg, Woody Harrelson, Isla Fisher, Dave Franco) are assembled into a super magic act that showers its audiences with money. Meanwhile, the FBI (Mark Ruffalo) and a magic debunker (Morgan Freeman) are out to bust them. The tricks are cool, the look is glossy, the pace never lags and the writing keeps it tight. Just like a good illusion, it's mostly flashy surface with minimal deep meaning (thankfully). Go expecting slick summer fun and you'll be thoroughly entertained.",
      "total_reactions": 9,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Implausible, yes.  Confusing, yes.  At the end, WTF? Yes, yes, yes.  Still, entertaining as hell.  Suburb cast having a great time, and until everything kind of doesn't fall together, it's far more interesting than the usual summer fare.  You will walk out at the end saying \"wait a minute, what about...\" and will not find a coherent answer.   Doesn't matter, enjoy Woody and Eisenberg having a ball, and Morgan and Michael Caine adding their usual excellent work.",
      "total_reactions": 9,
      "user": "csjthree"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "one of the best this year,the plot will surprise you.you will not be able to take your eyes off.too bad Man of steel steals the light from this movie.if you liked The Prestige ,then you will love this one",
      "total_reactions": 6,
      "user": "magician369"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "I was really enjoying the movie at the beginning but then it sort of went downhill and they didn't pull off the final performance as well as the first one; I was starting to change my mind about this movie until the most mind-blowing, unexpected, and gut-wrenching ending came up that made me recap the whole movie and actually think it was one of the most entertaining movies I've ever seen.",
      "total_reactions": 3,
      "user": "Criticak"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "There are many things that movies do well and a handful of things that translate poorly onto film. Stage magic falls into the latter category. The spectacle of movie magic delivered by skilled editors and visual effects artists overshadows a sleight-of-hand trick of pulling a rabbit out of a hat or sawing a lady in half. When movie magic can bring to life superheroes, distant planets, and creatures of the deep, the ability for an actor to guess a card out of a deck of 52 seems rather muted. The allure of stage magic is not in the act, but rather in the act occurring right under your very nose. Thus the task when creating a movie about magic is to make a movie that is about more than just magic. In this, Now You See Me is successful; creating a story that is entertaining enough to make you want to believe in the on-screen magic.",
      "total_reactions": 3,
      "user": "MovieMikeReview"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "I feel like the people who keep talking about the \"thin\" character development don't quite understand what was trying to be done with this movie. The underdeveloped individual characters was an intentional move so you would instead see them as one entity and one force. If you don't understand that then you probably didn't get the movie as a whole and would rather like a movie that is spoon fed to you rather than one that makes you think. Most things were wrapped up at the end...if you followed the movie closely. This was a great film...kudos to the actors for great performances. Clever concept, original idea. Go see it but don't waste your time comparing this to other films like The Prestige. It's like watching Life of Pi and comparing it to Titanic because hey, they both have sinking ships. Just go and enjoy the ride.",
      "total_reactions": 3,
      "user": "Mal1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "good movie  watch it  good movie  watch it  good movie  watch it  good movie  watch it  good movie  watch it  good movie  watch it  what more can I say",
      "total_reactions": 3,
      "user": "DaaneshPenguin"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "The movie was smart  the plot great, it was a combination of action and comedy and fantasy with a great result. I had to think twice the ending but it was a good one too. Really liked Isla Fisher. The movie in general is good and I think it's great for the cinema. Thumbs up",
      "total_reactions": 3,
      "user": "Kiva"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "If you were actually paying attention the movie, you probably saw that twist coming from a mile away. Despite how predictable the ending was, the witty dialogue throughout the movie was enough to make me feel good about buying the ticket. This was Woody Harrelson's  best performance in a long time. The interactions between him and Eisenberg had me laughing the whole time. The humor in this movie should be enough to make up for how predictable the ending was.",
      "total_reactions": 3,
      "user": "BizzyB"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "\"Now You See Me\"  is a good magic movie. When Morgan Freeman explains the magic tricks it takes a while to understand, but I liked the twist at the end. You kinda say to yourself I knew it! The heist they  The Four Horse Men) performed was interesting and fun to figure out how they did it. At times it was hard to keep track with the movie, then your back in track with it. That was my only problem with movie mostly. Overall i give it an 7 out of 10. The movie was really fun throughout though.",
      "total_reactions": 3,
      "user": "CriticGuy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "It is what you'd expect it to be. An entertaining film without anything profound. I didn't go into it expecting Shawshank Redemption-level movie-making and I was entertained as a result.",
      "total_reactions": 3,
      "user": "jdadams01"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Not the best movie on magic and heists, but not the worst either. Its extremely polished (great cinematography, music, art direction and special effects), very good acting (you can't go wrong with such a cast  Morgan Freeman and Michael Caine are stalwarts, Ruffalo is dependably good, and Isla Fisher looks mesmerising), and a good premise. However, the story/screenplay is where the movie takes a hit. Its not very convincing or captivating. It doesn't build the characters after introducing them. Doesn't show how they prepare for each act and how they work as a team except for some friendly banter now and then. And the final twist is not explained properly  as to how he planned and executed this whole thing. Hence it leaves you wanting for more!",
      "total_reactions": 3,
      "user": "srininet1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "The movies plot really is extremely convenient, with it's story tied to random chance. Various plot points and questions were still unresolved at the film's conclusion. It's confusing at times and implausible. However, if you can ignore that, you will enjoy this movie. An entertaining  movie with a strange premise but two huge twists at the end. A cast that really hold this entire movie up, and very well too. Liked the magic and action. You really must see this movie.",
      "total_reactions": 3,
      "user": "andrewgarcia732"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2014
      },
      "score": 4,
      "text": "Entirely subpar in every aspect. The story is a weak heist meets Robin Hood, meets magic mix, and the magic is meant to be illusions. The plot annoyingly relies on shear luck to get through any situations, although the 8/10 cast, try as they might cant bring this movie up from its score,",
      "total_reactions": 3,
      "user": "Sharkyx1"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "It's one of those movies that left you guessing until the very end. No one saw it coming. Incredible twist with flavor. It had comedy... And they wasn't trying to hard on the comedy, which is good because If you try to hard it could ruin the movie. I give it a ten.",
      "total_reactions": 4,
      "user": "Jerry50th"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "I give it a nine, without a second thought. The actors are all amazingly acclaimed talents, and every single one of them fulfilled his/her role. The pacing was great, the visual effects were stunning, and the plot was brilliantly executed. The catchline of the movie is 'Come in closer, because the more you look, the less you see.' I don't know that the audiences are realizing that THEY are the ones seeing the magic trick.",
      "total_reactions": 4,
      "user": "UpInLights"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "It is really smart and really good, I loved it a lot, it is an action in a different and in a really smart and entertaining way, the acting is good, and the actors really fit, the visuals are astonishing, everything in this movie is amazing except that it is somehow hard to understand.",
      "total_reactions": 5,
      "user": "HaithamBayazeed"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "text": "Oh how convenient, the \"inside guy\" was running the whole investigation the entire time.  Yeah you really tricked the audience there, haha that was a great trick.  And Morgan Freeman finally gets stumped by the tricky plot, so no freckle this time.",
      "total_reactions": 6,
      "user": "Bobbo"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2013
      },
      "score": 0,
      "text": "One of the worst movies I have seen this year, two hours of my life that I will never get back. The entire cast just did this film for a paycheck. The real magic trick was taking my money.",
      "total_reactions": 7,
      "user": "R3VEIWR"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Great movie. I didn't go in expecting very much, and it pleasantly surprised me. The actors are top-notch and the story-line is very interesting (even though, at times, very predictable). The only big minus would be that they didn't focus more on the magicians. I would've loved to see more interactions and more situations between them. Overall, a very good movie!",
      "total_reactions": 1,
      "user": "Razv"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2014
      },
      "score": 9,
      "text": "One of the better heist-thrillers I've seen. With an all-star cast and plenty of twists and turns this is one that I found extremely entertaining. The use of magic makes this better than it otherwise would have been. Watching the tricks play out in the scenes is awesome. A particular fight scene's use of illusions and trick is particularly impressive. There are one or two slow moments in the film, and the romance between the interpol and FBI agent is predictable and bland, but otherwise this is one awesome movie. One of the best I've watched in quite a while. I give it a 9.8/10-Amazing.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "This is one of those movies with a twist in the ending that just ruined the rest of the film. Regardless, it was an enjoyable movie. I was expecting the story to focus more on the Four Horsemen, but instead, most of the movie is told through the detective. (He reminds me of Detective Quentin Lance from CW's Arrow)",
      "total_reactions": 1,
      "user": "SirSX3"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "This magician-fuelled attempt at being a thriller constantly reminds the viewer that while something is going on here, the real thing is going on elsewhere, a distraction if you will. Well this whole film, enjoyable yet shallow, is a constant distraction, it has a lot of flashing lights and booming music to draw the attention away from a plot that is drawn out to be very complex when, it actual fact, is quite straightforward. It always makes a point of blowing every single detail out of proportion to the point where there are intentional moments to throw the viewer of a scent, a scent that is honestly not that difficult to follow. There is a star cast to back up such a colourful show, Jesse Eisenberg, Isla Fisher, Woody Harrelson and Dave Franco call themselves the Four Horsemen, we see them going about their day to day trickery as street hustlers and con artists, until they are mysteriously brought together as a collective group, Atlas is the showman and illusionist (Eisenberg), Merritt (Harrelson) is the mentalist who has quite a funny opening scene with a woman and her cheating husband, Henley (Fisher) is a beautiful escape artist while Jack (Franco) is a pickpocket and quite the entertaining fighter as well. As these four are brought together and financed by the shady Tressler (Michael Caine), they pull off a ban heist from their Las Vegas show, yet the heist happens in France, after they ‘teleported’ a man from their show to the vault of said bank. What then ensues is a race against time for the viewer, to see if they can outsmart the writers and get to the finish line of the whole plot, the illusions continue but no clear or reasonable motives ever seem to be present, the film definitely lacks in cause for these characters, particularly the role of Thaddeus (Morgan Freeman), a man who makes a living out of debunking magicians, who then decides to help out the FBI agent Rhodes (Mark Ruffalo) to bring down these magicians, only problem being they cannot figure out what their next move will be. As often impressive as the film looks and feels, it never seems anything more than just that, a nice shiny car that has no engine, it lacks the proper character direction, these four talented individuals show no real inclination of why they so desperately want to evade the police and put on a good show, no backstory whatsoever. But despite that, the talent playing them are bang on the mark in bringing a unique approach to each performance, confidence and wonderful trickery often ensues, but can get a bit long in the tooth as there is little point to a lot of it. This is certainly a flashy and in your face technique, delivered through a lot of dizzy camera movements and showmanship, yet drag it all away and there is still something worth seeing here, but it gets lost in all the glamour of trying to put on a big show, this ultimately prevents the film from being as enjoyable as it could have been, it has its thrills, but tries too hard to deliver more in the process.",
      "total_reactions": 1,
      "user": "StevenF"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2013
      },
      "score": 4,
      "text": "Now You See Me might have the most misleading trailers of all-time. The previews make you think that story follow the four magicians, played by Jesse Eisenberg, Woody Harrelson, Isla Fisher, and Dave Franco. However, the characters with the most screen time are actually an FBI agent played by Mark Ruffalo, an interpol agent played by Melanie Laurent, and a washed up magician played by Morgan Freeman. Guess what? I didn't know any of those actors were even in the movie. The movie also didn't seem to have an identity. It constantly jumped back and forth between magic not being real and then certain things not being possible without magic. This constant uncertainty from the film's perspective created a lazy feeling in the script. As for the individual characters, Woody was hilarious, Isla was absolutely gorgeous, and Eisenberg was, well, the same character he always is. Which reminds me, can we stop calling Jesse Eisenberg a great actor? The kid plays the exact same role every single time and that's who he is in real life. He isn't \"acting\", he's just playing himself in different situations. Back to the movie, it had decent plot development but with so many characters involved, none of them were really fleshed out properly. Lastly, it had the typical twist in the end that's become almost cliched where it wasn't written into the story well but just forced on the viewer. All-in-all, if you want to be mildly entertained with over-the-top magic tricks and a chaotic story and then toss in a romance for no reason, this is the movie for you.",
      "total_reactions": 1,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "A seriously underrated film. The acting was pretty solid through out  Harrelson was hilarious, Freeman was solid, and Ruffalo was a good lead, The rest of the cast was solid as well. Incredibly entertaining movie with well done magic tricks, From start to finish I was entertained. The best part of the film however was the plot. Very well done with a twist you do not see coming at all, It was a great end to the film in my opinion. I'd highly recommend.",
      "total_reactions": 1,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "“Now You See Me” is a enjoyable popcorn flick. However, it tends to be more flash than actual substance.The concept of the film is intriguing, but it isn’t done in an all too interesting way. It’s just a fast paced film that throws a lot of stuff at you, but never truly lets you absorb what is happening. The magic show scenes are one of the highlights of the movie as it’s full of energy and the right amount of flash. My personal favorite moment is a fight/chase scene in the third act of the movie with Dave Franco. It’s shot well and has some really nice fight choreography.",
      "total_reactions": 2,
      "user": "AwesomeReviewer"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "If you go to the movies to be entertained, then ignore the critic's reviews.  For some reason, they think movies must have some deep underlying impact on society or mankind, otherwise they are not worth viewing.  I on the other hand watch movies to be entertained.....and this movie does exactly that.  Although there are likely no oscar nominations here, the pace is fast, there is a lot of action and the script keeps you guessing.  What more could you want?  As further validity to my conviction, notice that 43 or the top 45 most helpful user reviews are GREEN!  Go see it.",
      "total_reactions": 3,
      "user": "erom1943"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "I liked a lot of things about this movie... I liked the story line, I liked the acting, I liked the cinematography, I liked the cast, but most of all I liked the fact that there was NO vulgar language or graphic sex scenes as seem to pervade most movies these days. It seems that the only way people communicate these days is with a lot of vulgar language.... It was so nice to set through a movie that I did not think to myself, is there any one who has enough of a vocabulary that they can write a script that contains  a higher level of communication.  I would categorize this movie as a type of old time classic... and give it a Bravo",
      "total_reactions": 1,
      "user": "ricksroses"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "Now You See Me is at times an enjoyable film. The best scenes are the magic ones, which are very well done and the acting is good. But the story is subpar especially the ending. I don't think the movie is worth the charge for seeing it in theatres. I would recommend waiting till it's on demand or at redbox.",
      "total_reactions": 2,
      "user": "counts0981"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "It has its moments every so often and it does have a genuine sense of intrigue running throughout it, but \"Now You See Me\"s inferior character development and shoddy twists will ultimately leave you feeling cold.",
      "total_reactions": 4,
      "user": "Compi24"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "Now You See Me has it all, an interesting concept, a fantastic cast, cool magic tricks, stylish action sequences, and a car chase, basically anything you could want from a high(er) concept thriller, this film delivers. The third act is a bit underwhelming, but that did not change how much fun I had with this film. With that said, Now You See Me is not as brilliant as it could have been or as smart as it thinks it is, but regardless, it is a lot of fun and I'd definitely recommend it.",
      "total_reactions": 1,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "This movie is great!  The magic is astonishing, most of it highly unrealistic however (but I don't know magic well enough).  Still, this movie is crazy smart, full of action and very cool sequences.  I would recommend this to anyone looking for an action/fun movie to watch.  You wont regret it!",
      "total_reactions": 1,
      "user": "Jimmy15"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "When I went to see this, my expectations were pretty high. A little too high though. Other than the fact that the movie had a few moments that bedazzled and amazed me, I found it to be cheesy and at times boring. In my opinion, this film was worth the price of admission but it could have been worth way more.",
      "total_reactions": 1,
      "user": "mds03"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "A great movie with lots of surprises with some good morally ambiguous elements and characters that make you question who's right and who's wrong. The cop may be an  but that's probably intentional. You could have known many of the twists were coming if you were smart, but much of it plays with your expectations. My only complaint was the 3rd magician introduced (The one that faked his own death) was a bit bland ad underdeveloped.",
      "total_reactions": 1,
      "user": "Rainbow_Lizard"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "I have been hearing that the movie had a big twist, and that, kind of, scared me because I thought it would suck. But I'm so happy I was wrong, I enjoyed every minute, and the end really leaves you wanting more. It truly deserves a 10.",
      "total_reactions": 2,
      "user": "igor789"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "My score for this movie might be a bit generous, as there are some glaring holes in the story, but I personally love heist movies.  This movie is a very clever heist movie with all the fun and drama of Oceans 11 combined with some very good action sequences.  The cast is superb, just like Oceans, and the characters are all well written.  Mark Ruffalo fresh off of his turn as Hulk in Avengers, plays a great angry FBI agent and it was cool to see Eisenberg and Harrelson back together from Zombieland.",
      "total_reactions": 1,
      "user": "knnthp3"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "This movie is not for someone who likes to think about the story during the movie, because of the fact that the story was kind of just summed up in short dialogue that moves on to more action sequences to be summed up again by dialogue. Also it seems like you are involved in this whole heist where actually you're not, The whole movie is kind of like the ending to an Oceans movie. Instead of having them talk over their plans they just go right into the heist and leave us out of it and making Morgan Freeman explain to us what just happened. They did have a plot twist at the end that no one saw coming though. There was very little parts to this twist though to make it seem awesome that that was the twist. The special effects were interesting though and there was a lot a of well known actors that were not used to their best ability. The movie kind of made most of them look like dicks.",
      "total_reactions": 1,
      "user": "CptPicard"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "Here's the deal, mind-bending movies like Inception and The Prestige have revealed an entirely new genre of film. Movies like \"Now You See Me\" attempt to reflect elements of that genre, and ultimately find themselves in a realm closer to \"summer throwaway\". The script is what really throws a wrench in the final cut of this film. Even high caliber actors such as Morgan Freeman and Michael Cain can't save this script from the sloppy mess that the writers left it in. Now, having said that, if you've seen Fast 6 and Star Trek, and you're still forcing yourself to go to the cinema, by all means spare your mind the stress of figuring out a plot and see this movie. Otherwise #skipit.",
      "total_reactions": 1,
      "user": "ceefrosty"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "Upon seeing the trailer, I had a very high hope for the film. The show was very enjoyable until their third final act. Well, even I didn't guess who was the 5th horseman, it was very disappointing to end the film with the twist like this. They could've done better rather than give us a twist like the \"Usual Suspects\".",
      "total_reactions": 1,
      "user": "nairfa"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "\"Now You See Me\" has one of the best movie concepts that I've seen in a while. Adding the idea of magicians and a heist is genius. However, the movie in itself was a mixed bag. The acting was weak in the movie, and Thaddeus was able to debunk the magic tricks way too quick. We get no debunking scenes where Thaddeus is breaking down the puzzle. Instead, he just walks up on stage and tells the FBI agent about every single step and operation. The magic performances were really interesting, we get to learn how the 4 horsemen \"teleported\" a man from Vegas to Paris in under 3 seconds. Definitely something that I was looking forward to. There were some good laughs in the movie placed here and there. But the part of the movie that made me so upset was the ending. Unlike most people, I disliked the plot twist. It was too unexpected. Not in the good way. We had no indication that the FBI agent was in \"The Eye\" and that he would turn on Thaddeus. In the end, it's not an awful movie, and it's very controversial. I say that you should give it a chance. Don't take my word for it. Everyone sees things differently.",
      "total_reactions": 2,
      "user": "ProjectGloom"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "I was expecting a lot of this movie, especially its premise which is different, it absolutely wasn't bad but it wasn't perfect, it had some boring scenes, and it was complicated but as a movie which I had high hopes and expectations, I was definitely without any question disappointed, on the other hand, the casting fits and the special effects are perfect.",
      "total_reactions": 1,
      "user": "AReviews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "Not very convincing. You expect e grand finale but never comes.",
      "total_reactions": 1,
      "user": "Sirbu-Iulian"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "By far, the best movie I've seen this year. So incredible! I loved the plot! It was so smart and so well-written!",
      "total_reactions": 3,
      "user": "enfer99"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "Do we like the magic? Yes, Do we like the heist movies? Of course, Do we like the movies with a big cast? Sometimes, and the movie indeed is a kind of spin-off of the Ocean's Eleven's movies but with magic, so if everybody loves the magic, what can be wrong with the plot, right?",
      "total_reactions": 1,
      "user": "chepod8"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Definitely not as goos as The Prestige but a truly fun engaging movie despite the holes in logic. Cast was fun and nice visual effects. Not a favourite but an enjoyable see.",
      "total_reactions": 1,
      "user": "toemac65"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "Now you see me, a caper-styled movie in the midst of sci-fi flood. The story was quiet unique, in the first and the middle, the director and writer was clever enough to hide that the real thief was one of the investigators of the case. There might be some questions regarding to the ending, yet it was very confusing if we don't see and understand it clearly on the front and middle part of the movie. Even though it was a great job for the writer and director to create a thriller crime movie genre mixed with magic stuff that really amazes the audience.",
      "total_reactions": 1,
      "user": "yeski_yes"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "I really liked this movie. I really wish they didn't show end scenes in the commercials for it but it was a great escape for the weekend. The characters were engaging the end surprises were surprising. All in all a great movie if you can just relax and enjoy it.",
      "total_reactions": 1,
      "user": "Darkin20"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "I really enjoyed this movie, it was equally entertaining, suspenseful and funny at times. However, it was hard to follow at times. Overall, I enjoyed this movie a lot!",
      "total_reactions": 1,
      "user": "Iloveelijahwood"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "A fun movie, which unfortunately let's it's ambition get the best of it. Even though the \"magic tricks\" are visually well executed, they seem very random at times.",
      "total_reactions": 1,
      "user": "Marcel_Thibault"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "The movies plot really is extremely convenient, with it's story tied to random chance. Various plot points and questions were still unresolved at the film's conclusion. It's confusing at times and implausible. However, if you can ignore that, you will enjoy this movie. An entertaining movie with a strange premise but two huge twists at the end. A cast that really hold this entire movie up, and very well too. Liked the magic and action. You really must see this movie.",
      "total_reactions": 2,
      "user": "AGarcia732"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "Even if there are other films that have told a similar story, Now You See Me is entertaining. The story is engaging and suspenseful making me wonder what would happen next. The explanations for the magic tricks were surprising and clever and the big reveal that the end was one that I didn’t see coming and I’ll be curious to rewatch the film to see if there are hints of it. Definately worth checking out.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "A very enjoyable film that rests more on movie magic more than believable world-stage showcases in which Now You See Me spends most of its time focusing on.  Still, Now You See Me hits a certain chord that resonates quite well with a plot that actually ends up being interesting instead of hollow and pointless, which could have easily been the case.  It's the Prestige with more flash but a bit less substance.  Even so, it's easy to argue that just because it's not always perfect, doesn't mean you still can't have a lot of fun.  The cast and lights draw you in and the pacing is swift enough to not make you feel like you need additional character development.  I loved Now You See Me, and many others will too.",
      "total_reactions": 0,
      "user": "SchroederRock"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "It's a decently rewarding film–the final reveal is somewhat surprising and there are numerous scenes with very pretty cinematography. That being said, it is cheapened by two things: the unnecessary use of CGI in certain acts, and the romance forced upon the audience. While it is somewhat helpful to the narrative to have the character of Alma Dray (played by Mélanie Laurent) make it appear that Dylan Rhodes (played by Mark Ruffalo) is even more incompetent/out of his league, the romance is not. The Alma Dray component could have been played by a lesbian or heterosexual male agent (the point isn't the sexuality, just that closing off the potential for the any sort of romance wouldn't have hurt the purpose of the Dray character... hell just make her faithfully married for all I care). Or if you really want, let those characters partake in a romance in the world of this story...just don't show it to the audience. The tension, the lines, and the story between the two is patently forced...to then end on that note is to illogically end on a weaker \"punch\" for the movie.",
      "total_reactions": 0,
      "user": "JuBe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "Well, it had good enough twists, as well as good acting from most of the cast. However, the plot left a lot of questions unanswered or answered unclearly. It was a good movie. I was just expecting something better.",
      "total_reactions": 0,
      "user": "adhamhany"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "Now You See Me is a metaphor for itself. Everything is about misdirection. All the pomp, flash and promised reveals conspire to distract you from the fact that what you're actually watching is a vacuous, emotionally hollow, absurd movie with no real point or substance.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2014
      },
      "score": 3,
      "text": "Given the movie's cast and word of mouth, I was expecting a lot more than I got.  Not a total waste of time--the two female leads are gorgeous--but not far from it, either.",
      "total_reactions": 0,
      "user": "adverb"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "Less then the expected. The greatest problem is about the magic. Several of them are full of computer graphics, what makes you fell like even Chris Angel could never performance that.",
      "total_reactions": 0,
      "user": "Nicholasandrew"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2013
      },
      "score": 1,
      "text": "Horrid. Its ccomes across as an arrogant movie which one is supposed to suspend all belief in order to enjoy it. May be find for cult members but the general public dont buy it.",
      "total_reactions": 0,
      "user": "MorriBey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2016
      },
      "score": 3,
      "text": "Now You See Me may have an interesting concept, however it is a messy, poorly written, and overproduced disappointment that wastes a fun premise and makes bland viewing.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "A movie that starts promising and quickly fizzles into nothing. The real magicians are the people behind the film, which did a very good job at distracting you from shallow characters, a movie that had zero plot and making you think you saw something great.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 5,
      "text": "The idea was pretty neat and some things were funny I guess, but this movie was bad. It was pretty much all a big buildup to a totally arbitrary plot twist, and that's one of the worst things I can think of in writing anything. The final resolution of the plot was... I don't know, it felt bland... as bland as the whole \"Eye\" (sub?)plot and the character of the detective which didn't make much sense in any of its doings in the plot. I would also dare say that it had little to do with magicians... but I guess I couldn't expect  explaining tricks/making plausible ones while still making them really interesting from a mainstream movie, and I guess \"magicians\" played this way is fine too, but... meh. It was entertaining as a light-entertainment action movie I guess, but other than that it was all a big waste of a good basis for a plot and a good cast.",
      "total_reactions": 0,
      "user": "Rolento"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2014
      },
      "score": 9,
      "text": "Totally entertaining and surprising.  It was a perfect popcorn movie and nothing more.  Great cast and just like going on an amusement ride.  Of course it's not deep or meaningful -- if I wanted that, there are plenty of other films out there.",
      "total_reactions": 0,
      "user": "Jmellman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2014
      },
      "score": 4,
      "text": "Although certainly entertaining and with a great cast Now You See Me has a multitude of problems. One of the most notable is how generally dislikable many of the characters are (especially Ruffalo's character). Also the action sequences seem a bit ridiculous considering that it's magicians that are being chased. Not to mention that the twist is idiotic and not all that surprising and it leads to an even less satisfying ending. That said the magic and heist scenes are well done and fun to watch.",
      "total_reactions": 0,
      "user": "moonman1994"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2017
      },
      "score": 7,
      "text": "Now You See Me is a tough film. Undeniably, it is entertaining. Its tricky magicians put on one hell of a show and manage to distract the audience just enough to make you look away from the clunky execution of filmmaking behind the scenes. Its characters are bad. Its plot is cliche. Once you figure out what the trick up the film's sleeve is, the magic does disappear some. Plotholes, likely, abound. Yet, the sleight of hand and wool over our eyes is thoroughly enjoyable. It is fun to be tricked in this way because of the show that goes on. The reveal, the mystery, and the entire show put on by the film is more than enough to make me not overly concerned about the film's faults under the hood. The thing runs on pure adrenaline, even if the engine is bone dry and the brakes are shot.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "Good story with some twists and a slight touch of fiction, a lot of nice actors and characters. All the thing is about tricks, magic and illusions and a criminal element of epic robberies. Nice one to watch, most of the plot details are well explained.",
      "total_reactions": 0,
      "user": "StaticSpine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "I would have to agree with the average viewers score of 6.9.  I know that professional reviewers think each movie needs to be like something from film school.  I look for a video that is entertaining.  I believe this movie is very entertaining.",
      "total_reactions": 0,
      "user": "toliverjohn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "Highly unrealistic and implausible. There were plenty of good enjoyable moments though, but I feel like if I hadn't watched it I wouldn't have missed much. Spend your time elsewhere on better movies, or read a book.",
      "total_reactions": 0,
      "user": "Swati"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "Founder of Facebook Jesse Eisenberg stars alongside Isla Fisher, Woody Harrelson and Dave Franco as the Four Horsemen a group of criminal magicians. Mark Ruffalo gives a brilliant performance as the Interpol agent Dylan Rhodes trying to track them down. And just to top it all off Morgan Freeman and Michael Caine star as money grabbing bastards.",
      "total_reactions": 0,
      "user": "python2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "\"The more you look, the less you see.\" - J Daniel Atlas",
      "total_reactions": 0,
      "user": "Marica"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2014
      },
      "score": 2,
      "text": "Like hairography, camera movement is relentless to disguise the lack of innovation and originality beneath it. It features dialogue which serves only to further stereotypes and drag plot in a direction slightly resembling forwards. Were I a magician, I would make this film disappear. I am not, so it remains.",
      "total_reactions": 0,
      "user": "LaGuerta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2013
      },
      "score": 1,
      "text": "This was an absolute awful movie, I know what they tried to do but my god could any movie fall any shorter from the mark, the CGI was garbage, the \"Magic tricks\" was just a bunch of mombo jumbo. I wish i never rented it...",
      "total_reactions": 0,
      "user": "puddingpiepoper"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "Now You See Me was an enjoyable movie while you are watching but it leaves no lasting effects. I really enjoyed the 4 main characters and how well they worked together. The plot was actually interesting and it had some cool twist (which were kind of predictable). It's everything you want in a lazy Sunday afternoon movie on the couch.",
      "total_reactions": 0,
      "user": "sammietee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 1,
      "text": "You will not get the time you spend watching this movie back. I just feel bad that Morgan Freeman spent even more of it to make this slick looking, but stupid, stupid movie.",
      "total_reactions": 0,
      "user": "greygoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "I really like this movie. Is it the best? Not by any means, but visually it is a spectacle to say the least. The character development isn't up to par, and the plot is too fast and isn't explained as much as it should be, normally those would ruin a movie and is what kept this film from getting tremendous reviews. That said though, it's a wonderful premise and the actin is outstanding. Now You See Me puts you into a wonderful fantasy world and will leave audiences eagerly waiting for the next installment of the franchise",
      "total_reactions": 0,
      "user": "Jamison12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2014
      },
      "score": 9,
      "text": "Man, everytime I see the 'professional' reviews I cringe, this movie was terrific, intricate and very captivating. I was prepared to give this one a 7 or an 8, but the resolution was way better than I thought. Enjoyed thoroughly, some really neat twists, and believable characters; what more could you want from a movie?",
      "total_reactions": 0,
      "user": "Gamer147"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "The characters were bland and uninteresting. Morgan Freeman and Michael Caine were the only interesting ones.  The concept for this movie is great but could have been done better.",
      "total_reactions": 0,
      "user": "IsaacR777"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "Despite a well laid introduction and intriguing premise, Now You See Me stumbles going into its second act and never recovers the scope or direction required to live up to its grandiose attempt at cross genre crime-drama.",
      "total_reactions": 0,
      "user": "chibistevo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "Ok, you have a movie with 'Social Networks,' breakthrough actor, Jesse Eisenberg, \"you had my curiosity, but now, you have my attention.\" The movie, starts off interesting with a line of talented magicians teaming up. Then, after that, the movie just goes down hill. The movie, felt like it had no actual plot. I admit, there where times I was surprised, but the ending just ruined everything the movie was building up towards. Overall, 'Now You See Me,' was interesting, but not a memorable movie at all.",
      "total_reactions": 0,
      "user": "CGraham1101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 4,
      "text": "It frankly doesn't surprise me that this film has received more positive than negative feedback; it gives an audience almost everything the trailers and cast lead them to believe they'll get. Plenty of twists, turns, face time with noteworthy actors and a story that doesn't force you to believe in magic in order to believe what's happening on screen. All that being said, there is a minority of viewers, myself included, who know they could have done much more with all the talent and potential lying within Now You See Me...or maybe they couldn't, and shouldn't have bothered to try.",
      "total_reactions": 0,
      "user": "Kevbo85"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "There's no doubt the film has a few issues.  There are some plotlines that are poorly established and are left unresolved and the female characters lack any real definition and act more as side players when they should be just as prominent as the men.  However, \"Now You See Me\" provides fun entertainment with it's \"Ocean's Eleven\" with magic formula.  The story is easy to get behind, the illusions in the film are crafty and neat and the actors are fantastic...especially Mark Ruffalo who, once again, steals the film and commands attention.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "My expectations weren't so high and I got what I wanted. A great plot with good twists and good acting performances. Sometimes it felt like I was watching a mix of the Usual Suspects and the Prestige. It may not be the best of the year but it's definitely fun to see",
      "total_reactions": 0,
      "user": "Reynmeykaa"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 6,
      "text": "I really don't want to make this a long review so I wont. The cast was amazing but everything else fell short don't get me wrong i still enjoyed the movie while watching it but i just didn't feel the magic and the whole twist at the end was laughable i seen that half way through but hey i guess it tricked my friend. Overall i give it a 6.0 the cast is the only thing that makes this film re-watchable it's also are getting another unnecessary Hollywood sequel.",
      "total_reactions": 0,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "What a mind-boggling film! I was at the edge of my seat the entire time, wondering what had happened and who's who. The story is so interesting. The cast is so talented. There's really nothing not to love!",
      "total_reactions": 0,
      "user": "film_bug"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "Relies far too much on unconvincing 'magic'. The producers pushed the boat out too far, filling the movie with a collection of tricks that would have required extensive setup in reality, but appear out of thin air. As a result, the main characters come across as little more than a bunch of talentless, arrogant twits coasting through a CGI playground. Tedious, boring, and ultimately far too obvious.",
      "total_reactions": 0,
      "user": "charleski"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "If only this movie would've disappeared in front of my eyes. The only magic thing about this is how people are going to give their money to this crap.",
      "total_reactions": 0,
      "user": "Punkmail"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "For those who have not seen this movie and want a opinion of someone who watches movies quite often and has a real feel for more than what you see here is and honest view of this movie.",
      "total_reactions": 0,
      "user": "DJKneegrow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "First, I was excited because I like magic and I like bank heists. But then it all came down in a big crumble. There is no character development throughout the movie. There was no real good guys or real bad guys, which made is very subtile and took the suspense out completely. Nothing more Tuesday night lullaby.",
      "total_reactions": 0,
      "user": "ehser"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "Movie is thrilling, exciting and when I watched it i couldn't wait to see what will happen next. Dialogue was good made me laugh many times as well as the action scenes. Overall the move is very good, if you ignore the end. You get this character development of a sceptic FBI agent that is good at his job and at the end his personality goes 180 and you see the entire plot, scenes, dialogs (what made this movie as excellent as it is) as fake. If you want to see the movie again, with your friends or family, you can't do it unless you ignore the ending, that you previously saw, to re experience the great plot in the first 90% part.",
      "total_reactions": 0,
      "user": "MamaTLF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "\"Now You See Me\" one of the best movie I have seen this year. I really loved it so much and enjoyed the time watching it. Amazing one they deserved 10/10",
      "total_reactions": 0,
      "user": "alis956"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "Amazing. That is the one word I use to describe to quality and high end CGI (Computer-Generated Imagery) effects in Now You See Me. This movie puts into reality what magic will turn into years from now. Big stage effects, using magic to rob banks and transport people. We have big names featured in this movie such as Jesse Eisenberg, Woody Harrelson, Dave Franco, Mark Ruffalo, Isla Fisher, Morgan Freeman, and many more.",
      "total_reactions": 0,
      "user": "AlexProductions"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "Who ever gives this movie less then a 8, well then he just didn't understand it. The movie is well executed has a a lot of twist's and interesting magic scenes  some action as well, and the actors are just fantastic",
      "total_reactions": 0,
      "user": "KillerSlo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2013
      },
      "score": 3,
      "text": "Wanna see a magic trick that's only possible via computer graphics? Suffer through Now You See Me. The music and sweeping camera does all it can to make you care, but since little time is spent developing the four horsemen characters, you really can't be bothered. This movie will drag you around back and fourth in an attempt to throw you off, but when the big reveal comes, all you can think about is how meaningless it turned out to be.",
      "total_reactions": 0,
      "user": "is_is"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2013
      },
      "score": 1,
      "text": "Horrible! This movie is the turd in the spiked punch bowel. Excellent cast, interesting subject that somehow managed to thoroughly and completely jump the shark!  They did a pretty good of building anticipation that SOMETHING interesting was coming....just stick with us...we know the movie doesn't make a whole lot of sense yet, but SOMETHING is going to happen just hang in there......That something didn't help the movie make anymore sense, served to make everyone in the room stop the movie and stay...HUH???? WHY??",
      "total_reactions": 0,
      "user": "sporlock"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2013
      },
      "score": 5,
      "text": "This is a movie to entertain, Nothing else. Average writing, average performances, and an awful plot. Jesse Eisenberg giving an average performance or even lower. The same with James Franco, Mélanie Laurent and Isla Fisher. Woody Harrelson and Morgan Freeman stepping up with a performance that save the film from being a total failure. I know, it was fun to watch but if you can analyze this film after watching it, its nothing more than a Louis Leterrier.",
      "total_reactions": 0,
      "user": "JorgeKaram"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2013
      },
      "score": 2,
      "text": "Una historia que se esforzó demasiado por ser más inteligente de lo que realmente es.  Presentándonos la mayor cantidad de cliché que pueden existir en un libreto. Que tratan de robar nuestro aliento llevándose un bostezo.  No me pareció algo fuera de lo normal, más bien me pareció una película que se puede ver en la comodidad del hogar.  Aclarando que sin una bolsa de popcorn lo que mencioné anteriormente es debatible.  Es más impresionante ver un espectáculo de magos en vivo, que un espectáculo de magos en una película donde todo es posible.  ¿Por qué me tiene que impresionar un grupo de magos que gozan de toda la magia del cine a su favor?",
      "total_reactions": 0,
      "user": "Joselo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Pretty nice movie. Really nice magic tricks. Ah, and i also loved the music of this (i mean a soundtrack). I love magic and magicians, this movie was really pretty nice. 2 months ago i watched it and i loved it.",
      "total_reactions": 0,
      "user": "Annthisway"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "Now You See Me is a very entertaining and fun movie to watch, with a pretty good twist at the end (no spoilers), but the movie fails to convince us of its premise.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2013
      },
      "score": 4,
      "text": "I did have high hopes when I entered the cinema to see this movie; one of my friends had said it was 'amazing', and as I trusted his judgement, I thought I would see just how good it was. For the first 45 minutes or so, I was reasonably impressed. The bank heist I thought was igneous, and the way it had been  explained to the audience well measured. The words of the characters 'this is only the beginning', or whatever it was, awoke my curiousity, and that attention was reasonably maintained until afterwards the New Orleans scene.",
      "total_reactions": 0,
      "user": "GoldenGreen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "This is the best movie of 2013, period. From start to finish, everything in this movie is top notch. Humour, script, acting, twists, flash, music, characters, plot, originality, and especially excitement. I haven't seen a heist film this good since Charlie Croker's italian gold heist ten years ago. If you give this movie below a 5, chances are I'm gonna want to debate and question you.",
      "total_reactions": 0,
      "user": "InverseCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "MY THINK",
      "total_reactions": 0,
      "user": "LivingDead9812"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "expected a much better end....",
      "total_reactions": 0,
      "user": "yogeshsingh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2013
      },
      "score": 3,
      "text": "this movie had great actors that I'm a fan and an interesting plot about magic, but the movie is very boring and is full of things quite annoying part until the end was good but the tail end collapsed the entire movie.",
      "total_reactions": 0,
      "user": "joao1198pedro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "From the beginning to the end, the movie is packed with tension that leave you at the end of your seat.  Generally  public) this movie is great but to Magicians fanatics or critics this might not be a great movie.  Its",
      "total_reactions": 0,
      "user": "Clemen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2016
      },
      "score": 7,
      "text": "Well this film was a lot better than expected. Combining elements of David Copperfield with Ocean's 11 was pretty genius and original. My only big critique is the film would have fared better with real magic tricks rather than CGI.",
      "total_reactions": 0,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "Given the characters in it,I kind of expected more from this one.Over-exaggeration,inflation,underestimating the IQ of viewers are some of the biggest mistakes of this movie.They tired pulling out The prestige and Italian Job in this one and just got stuck on The Cabin in the Woods i.e Insanity.Some scenes just make you feel \"are the police and other guys so dumb!\"I am giving a 4 just for the crew..out of which 3 are for Morgan Freeman",
      "total_reactions": 0,
      "user": "ManasWWM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2013
      },
      "score": 1,
      "text": "Really hated this movie. It's been months since I've seen it, but whilst browsing youtube I was reminded of this piece of turd and feel the need to vent. I've never been to a movie and felt so awful after walking out. Even my friend who was super excited to see this film looked at me in the middle of the climax and said \"this is really bad\". I hated the characters. They were slick and arrogant, con men and thieves but of course they turn out to have hearts of gold and help people get back at evil corporations. The motivation for the main character is so laughably weak I'm left wondering if this movie is suppose to be a satire of bad action movies. The characters were really bland and the plot is super predictable. Although I have to admit I didn't see the plot twist coming, but that's because despite how bad the movie was I didn't think it was going to be that bad. However, The brilliant film makers proved me wrong and overturned whatever little they established in the movie and quickly crammed a whole new back story/character motivation in the final five minutes. I honestly can't say I'm surprised either, I was in such an emotional limbo I couldn't bring myself to care.",
      "total_reactions": 0,
      "user": "Xiaojue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2013
      },
      "score": 2,
      "text": "I rarely see bad movies in theaters, I rarely do, but I was forced to watch this, THIS, due to a theater that was so poor on selection, I only picked it because it was the best movie I could think and wasn't a sequel. Oh God, why didn't I just swallow up my idea of watching all movies before sequels and watch like Fast and Furious 5 or 6, because this is the worst I've seen this year, I know it's probably not the worst of the year for most, but since I don't see many bad ones, this is. This movie manages to somehow suck away all of the talent of it's (admittedly charming) cast, and makes them all either repeating a movie they've already been in (Mark Ruffalo) or just sucks away any of their charm or wit (Jesse Eisenberg, Isla Fisher, Woody Harrelson). It's horribly structured, poorly edited, and clumsily executed, however, the biggest error in this disaster heist movie is that it never, NEVER EVER EVER EVER, EXPLAINS WHAT THE HELL IS HAPPENING, You will constantly be wondering about plot motivations, character motivations, how someone is still alive, how a plan worked, why in the hell would anyone do this, what sense does that make, why, OH WHY, can't these people just sit down, and talk about exposition that we need, not exposition that we don't, somehow, it has a talent of having too MUCH plot, or NO plot at all. This movie is a statistical anomaly, and not in the good way, so just stay away, what ever you do, just stay far away from this film which will bring questions to your head, and not of the thought-provoking kind",
      "total_reactions": 0,
      "user": "Spider1775"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "The story of the film is excellent including direction, cinematography and stunts all are excellent. I less often see that much entertaining movie. I highly recommend this movie. Please watch and enjoy this movie.",
      "total_reactions": 0,
      "user": "yousaf2k"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "Now You See Me was absolutely amazing. The magic tricks weren't just amazing/impossible, but nobody would've thought of doing magic tricks like these.",
      "total_reactions": 0,
      "user": "chw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2015
      },
      "score": 9,
      "text": "The visuals were amazing and the acting was extremely good but the movie tries to be more clever than he really is.With a unexpected twist who doesn't really work with the story and the constant and horrible love story between the two cops, the movie could have been better but it's still an entertaining little movie.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2014
      },
      "score": 8,
      "text": "There are so many twists and turns in this movie and it is great. The magic part of this movie is also really cool and keeps your mind going and into it the whole time. They add many illusions in the movie to keep your mind thinking and maybe not always following what is going on but I really like that about this movie. Also there is a great ending that I don't think anyone could have predicted.",
      "total_reactions": 0,
      "user": "Viper8787"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2014
      },
      "score": 8,
      "text": "Louis Leterrier’s film “Now You See Me,” is fun, easy to enjoy movie. The film does a great job of being flashy with grand spectacles without taking itself too seriously. The four main magicians who work together have great balance in character, and tons of crowd appeal. What this movie lacks in a meaningful message, it makes up with amazing tricks and twists that will leave the audience unable to guess the next move. Add a feel good ending with an interesting twist, and this movie makes a solid addition to any easy watching movie list.",
      "total_reactions": 0,
      "user": "throwaway1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2014
      },
      "score": 4,
      "text": "\"Now You See Me\" is a decent summer blockbuster until the final act which is just so plainly stupid I don't think I could ever describe it and stay polite at the same time. And also: bad CGI during the magic trick sequences? I'm speechless.",
      "total_reactions": 0,
      "user": "Apartment64"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "One of the best thriller movies I have ever seen. Now You See Me is full of a great cast and its the perfect mind screwing movie. It easy to follow but there is always something that twists the plot and gets you even more hooked.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "Now You See Me's convoluted third act and one dimensional characters robs the magic it weaves throughout the remainder of the movie and all of its visual splendour.",
      "total_reactions": 0,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "What an awesome and entertaining movie. Surprising plot twist after plot twist and in the end everything fits together like a puzzle. The reveal of the mastermind at the end will surprise everyone. All  theories I made up were destroyed. Another plus factor is that the movie is enjoyable from start to finish. The cast did a great job and each role was well chosen. The creativity in this movie is ideal. I would not say there are no flaws in this movie but it is so good you will forget your complains. Overall the most positive movie surprise in 2013.",
      "total_reactions": 0,
      "user": "Kai82"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "Now You See Me starts out interesting enough but it turns into more and more of an entertaining mess. The film is always is entertaining with a great cast but the twists and turns get more and more silly as it goes on. Everything done with the Mark Ruffalo character makes no sense by the end I will just say.",
      "total_reactions": 0,
      "user": "Jim222001"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "\"Now You See Me\" 10 Scale Rating: 4.5 (Mediocre) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "Now You See Me - You're Better Off With Penn & Teller (Part 1)",
      "total_reactions": 0,
      "user": "Blurb10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2016
      },
      "score": 9,
      "text": "This movie is exciting, fun, and full of magic! It's different than other movies like this. Well there aren't other movies like this. Great story and good acting this movie makes magic seem interesting and fun again.",
      "total_reactions": 0,
      "user": "jlittle1404"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "this movie is pretty good but its problem is that it is so forgettable does that make it a bad movie no but what's the point in making it so forgettable that  I can barely tell you what the pilot is. I know its not the people who made the film fault but it still is forgettable.",
      "total_reactions": 0,
      "user": "teddyluke"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "A fairly entertaining movie. It shows even more why Eisenberg can completely impress the world with his acting chops. But the cleverness of the script is impressive. the only negative is that it is way too long and drags on to much",
      "total_reactions": 0,
      "user": "AaronDWasserman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2016
      },
      "score": 6,
      "text": "\"Now You See Me \" was a very good movie , a little loose but scenes of magic, are magnificent , including those of action , a great work of the cast, including Isla Fisher is beautiful as always, and finally a good movie , good scenes and good work of the cast.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "This is a magically movie and one of my favorites movies of this genre. When I saw this movie I found an excellent job both script and each of the characters",
      "total_reactions": 0,
      "user": "thecriticboy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2016
      },
      "score": 8,
      "text": "Now You See Me may be a bit light on substance, but it's still stylish and well-acted enough to entertain. The cast were all excellent, bringing plenty of energy to the movie and making the most out of an interesting premise. The magic tricks performed, while not always entirely plausible, were fun to watch as well. Some may find it too slick and twisty, but if you're looking for a fun, entertaining caper flick, this should satisfy you. Overall, a fun movie with enough tricks up its sleeve to make up for its flaws.",
      "total_reactions": 0,
      "user": "DanBurrito"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2015
      },
      "score": 5,
      "text": "I didn't catch on until the near ending the major twist, so that made it good.",
      "total_reactions": 0,
      "user": "BeingNickDoh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2015
      },
      "score": 8,
      "text": "Entertaining and fast-paced with some fun tricks and illusions. I absolutely enjoyed this film. Although some of the \"twists\" couldn't fool me, I still liked it.",
      "total_reactions": 0,
      "user": "FilmQueen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "Like a real magic show, Now You See Me is thoroughly entertaining for the most part, but is ultimately silly and substanceless.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2016
      },
      "score": 5,
      "text": "Now You See Me has great expectations, but it also has a stale mystery, it lacks a lot of thrill to it too, and the magic is sorta predictable after the first hour passes.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2016
      },
      "score": 10,
      "text": "I really, really enjoyed watching this movie, but I was a bit sceptical at first.",
      "total_reactions": 0,
      "user": "Rardoniel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2016
      },
      "score": 6,
      "text": "WHAT I LIKED: It's fast paced, luxurious and well-scored cinema that offers bags of mystery and smiles. The characters are brought to life well with great acting, too. It's just indulgent and fun.",
      "total_reactions": 0,
      "user": "BarneyOnMT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "\"Now you see me\" es una de la películas policiales más originales que vi, no es una obra maestra pero ejecuta muy buenas ideas, giros argumentales y bastante acción que entretienen y termina siendo una buena película.",
      "total_reactions": 0,
      "user": "MEFzelder"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2016
      },
      "score": 3,
      "text": "Paper-thin characters introduced like a sports team line-up, all full of themselves and spewing \"bad-ass\" lines trying way too hard to sound cool, like they were written by a teenager or something. Halfway through the movie the explanation to the \"big mystery\" is spelled out to us in every detail by Morgan Freeman, who did himself a big disservice by playing in this crap, and then all interest in continuing to watch the movie completely dies. At which point I press pause, get out of full-screen and close the player. The End.",
      "total_reactions": 0,
      "user": "abm0"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2016
      },
      "score": 10,
      "text": "This movie is a 10 in my book for its subversive commentary on media as a social tool. Which sociologically speaking, is one of the five forces that shape human society.  Here is the key that many people need to unlock those locks. If you take magic in the movie as an allegory for illusions that shapes social consciousness, the movie will make more sense than the simple heist everyone thinks this movie is.  The main point of the heist was not to steal the money, but to show the true face of their \"benefactor\" for his wrong doings. Their \"benefactor\" used media to make his crimes disappear through shaping social mindsets, much like magicians do a rabbit in a hat. This is a commentary on how there are many more stories of \"good, wealthy\" men (business, political, religious) who have used media (art, print, song, rumour) to make themselves appear to be something they are not, much like an illusion. Our history is littered with them, much like the many locks at the bottom of the water we see at the end of the movie. The key is to realize that men lie, create illusions of truthfulness, to remain in power. We, have the key to see through said illusions. Don't always trust the news, or rumours, or even leaders. Sometimes they are illusions, just as elaborate as a magic show.",
      "total_reactions": 0,
      "user": "SeeRossRun"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2016
      },
      "score": 7,
      "text": "Now You See Me is a very interesting movie that held my interest closely throughout. The way their magic tricks were planned and portrayed kept the film entertaining throughout. Definitely a really cool movie I recommend checking out.",
      "total_reactions": 0,
      "user": "MasterRiley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2017
      },
      "score": 0,
      "text": "This movie was an utter disappointment for me. The plots were not properly executed, there were many loopholes and the story was boring to be honest. The problem with these commercial films is that their whole purpose is to make money out of amateur movie goers rather than make something that should critically make sense.",
      "total_reactions": 0,
      "user": "ammeoo"
    }
  ]
}