{
  "mc_avg_user_score": 6.2,
  "mc_metascore": 54,
  "mc_mixed_rating_frequency": 32,
  "mc_movie_name": "Observe and Report",
  "mc_negative_rating_frequency": 27,
  "mc_positive_rating_frequency": 64,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "Overall a pretty funny movie, but a bit irritating if you're the type to notice details, like how Seth Rogen can commit crime after crime in public, sometimes against police themselves, with little repercussion. Or how handfuls of pills and alcohol aren't lethal.",
      "total_reactions": 1,
      "user": "Akuto"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2016
      },
      "score": 6,
      "text": "Ever watch a movie and realize you are wildly incapable of putting together your thoughts on what you just watched? Well, that was me with Observe and Report. A disturbing look at a man suffering from extreme mental illness and rife with dark jokes and dark scenes (date rape...). That said, the film can be quite funny at times and is reminiscent of a lesser Taxi Driver-esque look at those suffering from violent mood swings and violent inclinations such as Seth Rogen in this film. Rogen is very good in the lead role and encapsulates this delusion and the man different sides of Ronnie. Though he can be quite awkward and creepy, this is all part of his character and can be very tough to watch. Essentially, Ronnie is a very good antihero and thoroughly unreliable narrator. You can be misled into rooting for him many times, even if his actions dictate that he is certainly not the hero of this tale. Overall, Observe and Report is never quite as funny as it thinks it is, but the dark picture portrays of its protagonist/antihero is richly rewarding and thoroughly disturbing. Observe and Report plays less as a comedy and more as a drama about a man who suffers from a serious mental illness and for that, it really hits hard at times. Unfortunately, its tone is all over the place and the film can never decide whether it wants to horrify you, make you laugh, or extract drama and tears from the situation. For this inconsistent tone, the film winds up being only slightly above average. If it remained more focused, it could have been far better.",
      "total_reactions": 1,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "Incredible, extraordinarily underrated movie. Critics and moviegoers were too quick to dismiss itï»¿ because it wasn't a laugh-a-minute comedy (which, admittedly, was what they were promised by the TV ads). But this film, aside from being funny, took serious chances and went very, very dark. In a good way.",
      "total_reactions": 0,
      "user": "Comasi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "The acting is below average, I thought Anna Faris was pretty bad. The whole film is rather dark (in a good way) and it has quite a few hilarious moments. I enjoyed it.",
      "total_reactions": 0,
      "user": "asylumspadez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2011
      },
      "score": 0,
      "text": "This has to be one of the worst movies I've ever seen, avoid at all costs, it's not funny, and Seth Rogen probably gave one of the worst performances ever.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "What a different comedy. But in a good way. This is a very dark comedy where a lot of the humor comes from situations instead of dialogue. But still a very entertaining movie and when you get to the last 5 minutes your gut will be wanting to explode from laughing so hard",
      "total_reactions": 0,
      "user": "boxenford92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "This movie is exacly what you think it is. It is stupid mind numbing humor. Thats it, if you go into this expecting the next Boondock Saints or Godfather then you are horribly confused. This movie is nothing more then stupid joke with lame punch lines, but my god is it funny. The ending made it all worth while for me. Watch this movie to kill a couple hours and just veg out.",
      "total_reactions": 0,
      "user": "moviegrabbag"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "This is a strange movie. Regular fans of Seth Rogen movies will either love it because of him, or be disturbed by his dark turn in this one. Playing a sociopathic, bipolar mall guard, it serves as an adult alternative to Kevin James's similar premise family comedy, Paul Blart: Mall Cop. All in all, I found myself bemused more than amused by the whole thing, and the as the end credits rolled in front of my eyes, I thought \"what the **** did I just witness?\"",
      "total_reactions": 0,
      "user": "alexandergreen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "Observe and Report is a great film, if you're 12 years old and find the obsessive use of the 'F' word funny. I usually love Seth Rogan, I think he's one of the best comedic actors out there, but unfortunately every actor is going to have a few misses. Observe and Report is one of those films that just doesn't cut it. In the film, Seth Rogan plays Ronnie Barnhardt, who is the equivalent of Paul Blart on a bad trip. He's a mall cop, who is obsessed with his job and with the hot girl who works the make-up counter at the local department store. Literally the only funny part of this movie is the flasher, that Ronnie is trying to catch. It's simplistic humor, but a man running around a mall, flashing his penis at people, and making dirty comments is funny! The rest of this film is not, as it's one big racist, childish, romp, through a world of sex, drugs, and the abuse of power. Rogan is terrific, but his character was a rambling, confused, uneducated guy, that just wears on every last nerve. Observe and Report is a film that has been done, many times and in many different ways. The producers hoped that an all-star cast would help the film, but sadly it doesn't. The film plays as though it was written by a teenager, and all that's missing is the fart jokes. I'm a big Seth Rogan fan, but I was sadly disappointed by this film.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "I thought this movie was freakin' hilarious. Seth Rogen portrays such an amusing character here, and I found myself falling victim to the dark humor and violent comedy presented throughout this film. The dialogue in this film consists of some of the most crass and irreverant lines I've ever heard, but It's also some of the most hilarious, and the end of this movie is one of the strangest/goriest/funniest things I've ever seen.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2017
      },
      "score": 8,
      "text": "The movie was funny, well made, the acting was good, the action scenes were well made, the soundtrack was very good and the movie was entertaining. It's probably one of Rogen's best.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2014
      },
      "score": 2,
      "text": "Brutal, absolutely brutal. I love Seth Rogen but you'd have a hard time trying to convince me to watch this again. This one is just too similar to Paul Blart Mall Cop, and its not nearly as funny. Its even got Anna Farris as the love interest just like Mall Cop.",
      "total_reactions": 0,
      "user": "ydnar4"
    }
  ]
}