{
  "mc_avg_user_score": 4.9,
  "mc_metascore": 19,
  "mc_mixed_rating_frequency": 21,
  "mc_movie_name": "Old Dogs",
  "mc_negative_rating_frequency": 53,
  "mc_positive_rating_frequency": 46,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 3,
      "text": "OLD DOGS is a stupid, unfunny and boring kiddie film that even kids wouldn't like.",
      "total_reactions": 2,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "I admit the movie has big flaws, but in the end its a heart warm family movie with Travolta and Robbins on the run.",
      "total_reactions": 4,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2010
      },
      "score": 6,
      "text": "It sure as hell isn't a one star film. I'd give it a 6/10. It was a decent family film with some genuinely funny moments in. At least it wasn't as boring as something like 2001, with straight tens. I watched it with my family and it was a pretty nice film to watch. Innocent enough, with plenty of bits of subtle adult humour. It's hardly an oscar-worthy film, but I get annoyed of people jumping on the bandwagon without even watching it, based purely on reviews. You may as well give it a try.",
      "total_reactions": 1,
      "user": "AarnKrry"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2010
      },
      "score": 1,
      "text": "Wow. I've never seen such a disappointing movie ever. Travolta and Williams fail to get any laughs from adults or kids. Bernie Mac, you could have gotten a better farewell. RIP bernie",
      "total_reactions": 3,
      "user": "mrcritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "Old. Dogs. Uhh. OLD. DOGS.  UHHHHHHHHHHH.",
      "total_reactions": 1,
      "user": "oswaldtherabbit"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2011
      },
      "score": 0,
      "text": "I am beginning to wonder why I can't rate something with ZERO stars.  This movie would have definitely be eligible.  Quite possibly the longest 88 minutes of my life.",
      "total_reactions": 0,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "While this movie may miss a few marks it's still enjoyable, bringing humor, and a surprisingly touching story to the table, I had a blast watching this, and while there are a lot better movies out there this is still one I will recommend.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "Is it supposed to be an award winning comedy? No of course not, but it is a clean family comedy that delivers all sorts of slapstick and cliche ridden jokes...and guess what if you take it as such it works.",
      "total_reactions": 0,
      "user": "jp992751"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2011
      },
      "score": 1,
      "text": "Seth green.check Big giant gorilla-check.kid on the toilet farting check. sounds like a real winner dosen't it. This film might as well came out of a dog, because it sure smells like it",
      "total_reactions": 0,
      "user": "thecurber"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2011
      },
      "score": 3,
      "text": "It's not overwhelmingly horrid -- like most Disney family comedies tend to be -- but it's certainly far from even mildly diverting. Pros: John Travolta and Robin Williams are as charming as they always are. Cons: As charming as Travolta and Williams are, the acting is as dull as the film is itself; overwhelmingly generic; overly cliched; lacks laughs and heart.",
      "total_reactions": 0,
      "user": "KendylKlownfish"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2011
      },
      "score": 0,
      "text": "If someone likes this movie, they should be considered dangerously stupid and avoided at all costs. If you happen to encounter a fan of this movie you should immediately perform a citizen's arrest on them for the good of public safety. After you have successfully handcuffed the brain dead 'movie' 'fan', you should contact the authorities as soon as possible. If the fan begins to speak (surprisingly, some of them can talk) cover your ears. Failing to do so may result in permanent brain damage. If you find yourself having to travel through an area heavily populated by 'fans' of Old Dogs you need to bring the proper equipment. Sound cancelling headphones are a must. Defensive weapons are also useful. Multiple daggers may also be required. If you find yourself surrounded by 'fans' of Old Dog, do not panic! Simply cup your hands around your mouth and yell in several directions. The echoes will confuse them and they will become disoriented. Use this opportunity to cut their hamstrings and escape. Though rare, occasionally they may attempt to pursue you. If this is the case, quickly gather a handful of sticks and rocks and arrange them in a line between you and the 'fans'. Typically they will become so frustrated by this minor obstacle that they will often spontaneously burst into flames. If your skin should come in contact with a 'fan', call poison control. While waiting for the ambulance you should treat the infected area with bleach and gin. If no bleach and/or gin is available, amputate the infected area and pray for god's mercy. If you should accidentally view any portion of the 'movie' Old Dogs the only known antidote is the blood of a Dodo bird. Unfortunately, the Dodo is extinct in our current timeline. Not to worry, as these is a solution. Simply build a time-machine and retrieve a sample. In fact, forget the sample. Just use the time-machine to stop yourself from seeing this movie.",
      "total_reactions": 0,
      "user": "wordy_actions"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2011
      },
      "score": 2,
      "text": "This truly is a bad movie when compared to the moving pictures that movie makers spend hard time making! Sometimes movies need not to be made because they do not portray a purpose!",
      "total_reactions": 0,
      "user": "Ridz43"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2012
      },
      "score": 3,
      "text": "It only had 2 or 3 good laughs. It had potential to be a great comedy but it is plagued with too many problems. Travolta and Williams made the foolish choice to be in this movie.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 3,
      "text": "So cheap, tired, and stale that even its two likable lead actors can't save it.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "It was funny i think, especially when they thought, they were grandpas, and when they thought that he had got a \"pee pee\" :D................................................",
      "total_reactions": 0,
      "user": "Jappe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2016
      },
      "score": 1,
      "text": "You know, I had actually forgotten this movie existed until doing this review. As I'm running through 2009 and thinking \"wow, so many great films that I loved as an 11-year old. I'd love to go back to 2009,\" I came across \"Old Dogs\" and immediately said \"Oh, right...that exists.\" Trust me when I tell you, \"Old Dogs\" is awful. Even with stars John Travolta and Robin Williams headlining it, the film is dull, boring, painfully unfunny, predictable, and all-around bad. This is another case where my only possible praise is that the film is 88 minutes, but that's 88 minutes you'll never get back. Oh, and the actors at least TRY. Not that their performances are GOOD, but at least they try to save this stinker of a movie. Trust me, this film is an atrocity, and you WILL NOT want to watch it. Just ignore it and move on. Please.",
      "total_reactions": 0,
      "user": "FreedomFighters"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "Old Dogs are put down.",
      "total_reactions": 0,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2016
      },
      "score": 6,
      "text": "The movie wasn't that funny and it was pretty stupid, but it was entertaining enough and it was decent enough for a family flick.It's not the best family movie around, but if you want some brainless entertainment then, you may like it.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2016
      },
      "score": 7,
      "text": "I really love Old Dogs. Even just on the soul fact that John Travolta and Robin Williams are in a movie together was enough to get my attention",
      "total_reactions": 0,
      "user": "avamiller21"
    }
  ]
}