{
  "mc_avg_user_score": 4.6,
  "mc_metascore": 49,
  "mc_mixed_rating_frequency": 42,
  "mc_movie_name": "Oldboy",
  "mc_negative_rating_frequency": 44,
  "mc_positive_rating_frequency": 40,
  "mc_pro_critic_reviews": [
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 91,
      "summary": "In the end, the most impressive performance may be Spike Lee's. He uses skill without gimmickry, flash without fuss, to tap the mesmerizing soul of this pulp."
    },
    {
      "critic": "Geoff Pevere",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 88,
      "summary": "Lee’s is more of a hard-edged, hammer-and-nail noir than Park’s existential horror, and it’s far less concerned with the internal state of Joe’s mind than the external havoc it creates."
    },
    {
      "critic": "Bruce Ingram",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 88,
      "summary": "It’s generally a respectful homage that has every bit as much stylishness and visual flair."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 83,
      "summary": "It's been so long since Lee made such a thoroughly amusing work that fans should have no problem excusing its messiness. But make no mistake... Oldboy is all over the place, sometimes playing like a subdued melodrama and elsewhere erupting into flamboyance and gore."
    },
    {
      "critic": "Matt Zoller Seitz",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 75,
      "summary": "This American version of Park Chan-Wook's Korean thriller is Lee's most exciting movie since \"Inside Man\" — not a masterpiece by any stretch, but a lively commercial genre picture with a hypnotic, obsessive quality, and an utter indifference to being liked, much less approved of."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 75,
      "summary": "Oldboy is an immersion into pure twistedness. The purity of its twistedness is its saving grace."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 70,
      "summary": "Oldboy suggests a filmmaker doing almost as much soul-searching as the main character. There is a brashness in the risks taken, the very imperfections revealing an artist finding new inspiration. For Lee, this weird, brutal film seems to have freed him."
    },
    {
      "critic": "Kerry Lengel",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 70,
      "summary": "Surprisingly, the movie doesn’t bear much of the stylistic stamp we’ve come to expect of Lee, who’s in his generic journeyman mode here. But aside from a satisfyingly clever new direction in the denouement, what distinguishes the remake from the original is its cartoonishness."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 67,
      "summary": "For better and worse, Lee’s Oldboy is a more somber affair."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 63,
      "summary": "One of the surprises of Spike Lee’s Oldboy is just how dark the film dares to get."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 63,
      "summary": "Lee’s Oldboy stands on its own. It just stands a bit shorter."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 63,
      "summary": "In general, Lee directs with less visual verve than Park. Anchored by Brolin, who brings an almost simian physicality to his portrayal, this Oldboy feels simultaneously less showy, less nightmarish and less epic than the original."
    },
    {
      "critic": "Tom Shone",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2013
      },
      "score": 60,
      "summary": "Oldboy is lively but numb — checked out, as if Lee were directing it following a period of intense convalescence."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 60,
      "summary": "Most normal people will not see this as a \"pleasant\" film -- I hope that's the case, anyway -- but it certain makes you feel something."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 60,
      "summary": "Watching Spike Lee’s decent but unmemorable remake of Park Chan-wook’s 2003 revenge picture \"Oldboy,\" I kept trying to figure out why he’d done it."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 60,
      "summary": "If you have seen the earlier version, you can occupy yourself with point-by-point comparisons. If not, you may find yourself swerving between bafflement and mild astonishment, wondering how a movie that works so hard to generate intensity and surprise can feel so routine and bereft of genuine imagination."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 60,
      "summary": "Weaknesses from the original remain, including a mustache-twirling villain straight out of a Bond film (Sharlto Copley) and a Freudian master plan that unravels the more you think about it. Give credit to Lee for staying fresh, even if this feels like slumming."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 60,
      "summary": "Leave it to Spike Lee to deliver one of the strangest, most off-putting movies for the Thanksgiving holiday."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 60,
      "summary": "While Lee leaves some of Park's more memorable outrages behind, he and screenwriter Mark Protosevich find one or two ways to up the taboo-testing ante, small surprises that retain the tale's edge without pushing into the realm of exploitation."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 58,
      "summary": "Lee is very good at creating a sense of free-floating dread, but he, and his screenwriter Mark Protosevich, don’t have a real flair for pulp."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 58,
      "summary": "Spike Lee's remake of 2003's Oldboy is as brutally perplexing as the South Korean original, and needless for both its repetition and tweaks. Nothing is really lost in translation, or gained."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2013
      },
      "score": 50,
      "summary": "While few will debate Lee's ability as a director, this isn't close to being in his wheelhouse. Oldboy cries out for a Brian DePalma, a Quentin Tarantino, or even a David Lynch. The end result bears out the suspicion that Lee isn't right for the material, nor it for him."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 50,
      "summary": "Like Martin Scorsese’s \"The Departed,\" a bloated Americanizing of the Hong Kong cop movie \"Infernal Affairs,\" the Lee Oldboy will startle newbies with its story ingenuities and morbid revelations, while leaving connoisseurs of the source film wondering why Hollywood couldn’t have left great enough alone."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 50,
      "summary": "Graphically gruesome when it means to be a provocative look at vengeance."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 50,
      "summary": "Lee, in a sort of humorless send-up of Tarantino, substitutes kinky for mystery, explicit sex and violence for sex and violence with real shock value. When it comes to this remake, you plainly can’t teach an oldboy like Lee new tricks."
    },
    {
      "critic": "Charlie Schmidlin",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 42,
      "summary": "While Lee edges in enough unique elements to argue a second look at the brutal revenge tale, his lean, blackly comic result is transcendent only in fits and starts, stripping away much of its thematic and emotional heft into one of the most frustratingly accomplished disappointments this year."
    },
    {
      "critic": "Curtis Woloschuk",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2013
      },
      "score": 40,
      "summary": "To its credit, Spike Lee’s remake isn’t a slavish imitation. On the other hand, its grit is a grey substitute for the original’s vision and verve. Disappointing."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 40,
      "summary": "This one has its technical virtues, but it’s frankly kind of a muddle, and may have been doomed from the outset. I would divide the potential audience for Oldboy into two groups: Those who will be disappointed and those who will be bewildered."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 40,
      "summary": "From Lee’s point of view, I can understand the enticing challenge of taking on a revered cult film Oldboy. But a pair of ill-conceived casting choices can jolt you out of the film, or worse, elicit the rolling of eyes and barely stifled giggle."
    },
    {
      "critic": "Matt Singer",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 40,
      "summary": "This is a very confused movie, designed for an audience that doesn’t exist."
    },
    {
      "critic": "David Ehrlich",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 39,
      "summary": "A slumming Spike Lee is still better than most directors at the top of their game, but Oldboy isn’t just Lee’s worst movie, it’s practically his “Wicker Man”."
    },
    {
      "critic": "David Hiltbrand",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 38,
      "summary": "The sheer brutality of Oldboy is stunning, especially a deeply disturbing scene in which Brolin tortures Samuel L. Jackson. But this is an unrelievedly grim and hermetic experience throughout, the cinematic equivalent of blunt trauma."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 38,
      "summary": "What's onscreen feels squeezed, truncated and curiously embalmed. It's got no kick to it."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 38,
      "summary": "The feel-bad movie of the holiday season, Spike Lee’s often-repellent Americanized reimagining of Korean director Chan-Wook Park’s twisty 2004 revenge thriller Oldboy is relentlessly gruesome, self-consciously shocking and pretty much pointless."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 38,
      "summary": "The revenge in Oldboy is neither sweet nor sour; it's just drab."
    },
    {
      "critic": "Jesse Cataldo",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 38,
      "summary": "Spike Lee's version loses the one thing that really worked in the original, the sense of moral complication emerging out of the intertwined action of two men hell-bent on retribution."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 30,
      "summary": "His (Lee) Oldboy is relentlessly unpleasant and difficult to watch, without offering audiences much moral or aesthetic payoff for its hour and 40 minutes of graphic violence and abject degradation. Oldboy is both original and uncompromising, I’ll give it that—it just doesn’t happen to be any good."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 30,
      "summary": "Lee and Protosevich have made a picture that, although several shades edgier than the average Hollywood thriller, feels content to shadow its predecessor’s every move while falling short of its unhinged, balls-out delirium."
    },
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2013
      },
      "score": 20,
      "summary": "Other than sniggering about what an outré stereotype they’ve served up, it’s hard to see how Lee and Copley can justify this performance, which is quite the worst of the year, and sends the whole final act of their movie straight to oblivion."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "summary": "Colorless and soulless in the extreme, it bears no one's fingerprints at all. There's no reason for this Oldboy to exist. It's so DOA, you stumble out of it wanting to eat something alive."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 0,
      "summary": "The longer it drags on, the sillier it gets. A preposterous narrative, illogical red herrings, trick endings, bad acting and—shazam! — Spike Lee turns into M. Night Shyamalan!"
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "Josh Brolin plays an arrogant, drunken ad exec who gets locked in a room for twenty years…yes, years. When he's finally released, he must identify his captor before he can seek revenge and be reunited with his daughter. After his one-room ordeal, you expect extreme retribution and there is some: a few brief, well-staged and violent encounters. When he turns to the mystery of his captor, things become more and more convoluted: the villain's omnipresence, those unlikely coincidences and ultimately, the surprise ending. Director Spike Lee has crafted some of this film to be involving and robust, but ultimately it loses momentum and proves a disappointment.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "OLDBOY REMAKE FLOPPED BECAUSE IT’S A REMAKE THAT SHOULDN’T HAVE HAPPENED IN THE FIRST PLACE",
      "total_reactions": 1,
      "user": "drderu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2014
      },
      "score": 3,
      "text": "I gained absolutely nothing from watching this. I completely wasting my time. I hoped it would do something interesting and new with the premise, but instead it treads the same ground, and somehow it manages to not do that properly.",
      "total_reactions": 1,
      "user": "AmongstYou"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "Ultimately, Oldboy isn’t an entirely worthless film; it is an unnecessary one. Brolin, Jackson, and Olsen’s portrayals are compelling and more than worthy. Unfortunately, Copley, who is often a standout, feels like he’s delivering performance art here, rather than a performance. There are some haunting visual motifs and the plot twists are as depraved as one would imagine and may desire. Overall, the changes that are made detract from, rather than enhance the story. The end is where the film truly falls apart, though. The small and large shifts rob the tale of its nuance. Park Chan-wook’s complex meditation on violence, responsibility, revenge, and poetic justice is bastardized and morphed into a cartoonish and contrived version. There is very little in this new Oldboy that the original didn’t do better. You’re best off to save your money at the theater and rewatch or discover Chan-wook’s far more intricately woven and harrowing saga.",
      "total_reactions": 11,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "Simply put, some movies should never be remade. \"Oldboy\" serves as a stark reminder with only a few exceptions: Americanized remakes of beloved and admired foreign films inevitably result in disappointment. For viewers unfamiliar with the history behind Spike Lee's \"Oldboy,\" the 2013 film is a remake of the cult-classic 2003 South Korean film of the same name, directed by Chan-wook Park. The Korean masterpiece possess a highly stylized, gritty sensibility while providing an emotional depth to its characters. Iconic director Spike Lee's \"Oldboy\" is as a handsomely shot piece of genre entertainment, but it fails in its attempt to define itself, resulting into a completely pointless, watered-down underwhelming thriller.",
      "total_reactions": 10,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 1,
      "text": "Perhaps the worst two hours I've ever spent.  I learned absolutely nothing new about life, except that violent sexist patriarchal rape culture cliches still dominate mainstream cinema, and Spike Lee is more than happy to join the bandwagon and resort to them.  Yawn.  I got all hopeful for a Spike Lee social/psychological/metaphorical commentary/tie-in when the historical footage appeared, only to be disappointed when it merely served to pass the time inside the hotel cell.  I left grossed out, hollow, and feeling like a sucker.  For a crowd-funded film, this sure was a lot of tired re-hashed violence with no redeeming message.  From a fan of the Korean 2003 original  don't bother.  Just watch Do The Right Thing again.  This is a Spike Lee Dis-Joint.",
      "total_reactions": 10,
      "user": "megtee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "I came into the movie with open arms and i tried to embrace it but it just fell flat. Yes, I am comparing it to the original. Is that unfair? No, every remake has the opportunity to learn from its predecessor and fix mistakes but Lee's Oldboy doesn't do that. There are a few enjoyable sequences in the beginning but after Brolin goes to meet with the antagonist, the movie is almost worthless to continue watching. It doesn't match the pacing, suspense, or acting from '03. It's so poorly directed that I laughed at inappropriate moments. And there's this soap opera behind-the-shoulder zoom-out around the finale that feels like a megaton bomb of garbage thrown in for good measure; to assure that no one would walk away satisfied from the theater. There's no contest between this and the original. In it's own right, I give the movie a 5. 5 for the first half of the movie and 0 for the other half. On a side note, Josh Brolin was not the right choice for this project. He can't match the dynamic emotional acting that we saw Choi give in 2003. That was so critical to the sympathy the main character is supposed to draw.",
      "total_reactions": 5,
      "user": "UncleEarl"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "Was reluctant to watch, ready to hate, but gotta say Spike Lee won me over. Too easy to be precious about something considered original when everything is just a remake anyway.",
      "total_reactions": 4,
      "user": "wetwebwork"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2013
      },
      "score": 1,
      "text": "I have to think that Spike Lee didn't even watch the original version before making his version.  I also doubt that the person who approved the script could have seen the original version.",
      "total_reactions": 11,
      "user": "HypnoticGuy"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 1,
      "text": "Any movie that gives away that there is a twist in the movie in the trailer is stupid. This is a typical remake that misses the point and charm of the original. Please just go watch the original and skip this garbage. The Original is amazing.",
      "total_reactions": 13,
      "user": "Brosman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "It was more curious that other thing what made me watch it. It was interesting given the necessary changes that had to be made for occidental audience, that is accepted in oriental movies. Good remake, but it won´t be never as good as the original.",
      "total_reactions": 3,
      "user": "Christian0205"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "I haven't seen the Japanese original, so my review is unbiased.",
      "total_reactions": 2,
      "user": "Adam_Kelly"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 4,
      "text": "was hoping this was going to be a good remake but i was completely wrong everything about this movie is pure crap. Spike Lee has made some decent film in his time so i was hoping that he wouldnt mess this film up. I already knew it wasnt going to be anything like the original as in most cases with remakes but this is a slap to the face to the original. The cast is one of the things that really made me want to watch it with Josh Brolin, Samuel L. Jackson, Sharlto Copley, Elizabeth Olsen but in this i find Brolin's character a joke and dont care for as with the original i feel sympathy for the rest are just \"meh\" so you dont even care for them as well. I guess the fact that i was expecting more from this movie makes me dislike it even more. In the end this is just another average remake with nothing to see and i would recommend watching the original and never watching this movie unless want a good laugh.",
      "total_reactions": 2,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2013
      },
      "score": 6,
      "text": "I really enjoyed this film. I thought the cast was great (although I have a few questions) and that it had it's own feel despite being a remake. I will say though this is Sharlto Copley's worst performance. I don't know how much that is Spike Lee's fault, but he just wasn't a very believable villain I mean c'mon Spike did you see Elysium!? Josh Brolin was awesome and Liz Olsen not only looked great but played a very important role. I think the trailer and some other things ruined the whole twist/point of the film but for the new fans in the audience it was well received. However, it does get a little campy and Sam Jackson's character looks a little ridiculous. I will say it's not for everyone and there has been a ton of great films this year but Oldboy holds up somewhere in the middle of the pack.",
      "total_reactions": 2,
      "user": "JC86"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "From the get go this movie was a dud - there were no characters you would like, the main character was a jerk who deserved no sympathy, too much gratuitous violence and bad acting, particularly Samuel Jackson.",
      "total_reactions": 2,
      "user": "Conjure"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2014
      },
      "score": 3,
      "text": "Terrible movie, completely detracts from the original manga and has lots of gaps. Just because Samuel L. Jackson appears give it a 3. And do not misunderstand me, not for being a remake is bad, is that they changed the whole plot and nothing makes sense.",
      "total_reactions": 2,
      "user": "robertodasilva"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2014
      },
      "score": 9,
      "text": "Awesome Spike Lee movie, with a wild twist at the end!  Too bad it came out when other bigger movies were released, which resulted in low box office sales.  Glad I found this one, favorite movie in long time!",
      "total_reactions": 2,
      "user": "Canadian365"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "A few others have said this already but be wary of both the critical and user reviews  they seem to largely be commenting on this movie in relation to the original. And I'll put it out there and say, without question, the original is better. If you haven't seen it, you should.",
      "total_reactions": 9,
      "user": "cwilder06"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2013
      },
      "score": 3,
      "text": "As a huge fan of the original film, I did everything I could to judge Spike Lee's version on its own merits. But he has made an inferior film that simply doesn't work on its own. The story isn't the problem  the film doesn't work due to the choices Spike Lee has made.  Strange changes in the story serve to call attention to the film's inability to entertain like the original.  Samuel L. Jackson. Watch both versions of the film and you will be stunned at Lee's choice to create Jackson's character and storyline. And if you haven't seen the original, you'll certainly wonder why this story was ever told.  In addition, the Director has made some choices that didn't work for me at all. In \"Annie Hall\", having Woody Allen and Tony Roberts watch flashbacks worked; here, to see Josh Brolin watching the action around him  it was distracting, and a huge mistake  much like the decision to tell this story this way.",
      "total_reactions": 5,
      "user": "Johnrieber"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "Not a terrible movie by all means but if you have seen the original you know what is coming. Wish it tried something different, it had some minor stuff but nothing that I can say was major improvement. If you haven't seen the original you might like this and be surprised, if you've seen the original I say see it when it comes on tv or something just to compare it to the original one.",
      "total_reactions": 3,
      "user": "brujah723"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2014
      },
      "score": 1,
      "text": "Dear Spike Lee,",
      "total_reactions": 3,
      "user": "Touchstone"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "I'm gonna be up front and honest. I've never seen a Spike Lee film and I've never seen the original. Knowing that the original had such high acclaim this film had huge shoes to fill. People keep saying that this film is unnecessary which is stupid because most films that are made today are unnecessary, they obviously wanted to put a new look on an acclaimed Korean story and I appreciate that. The story was very interesting and kept me guessing throughout its entirety. Josh Brolin is a great American actor who pulled off his role as Joe really well. The antagonist was kind of a joke, his attitude throughout was so fake. The twist was just crazy and I couldn't have ever seen that coming and I don't think anyone would've unless you've seen the original already. So honestly if I had to commend anything it would be Josh Brolin and his performance because he played it off so well. In conclusion I liked this film, it was a good hour and 45 minutes of entertainment and I didn't based everything off the fact that its a remake and its directed by Spike Lee.",
      "total_reactions": 8,
      "user": "a7xfan"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "I saw the original first just to make a comparison and this was a really clumsy remake. All the subtleties of the original were bulldozed with obvious plot points that the original only gave away at the end. As twisted as the story is, I actually cared about the characters in the original. Spike really should have spent a little more time developing the main characters and maybe this would have worked. Really disappointed",
      "total_reactions": 4,
      "user": "JasonNunes"
    },
    {
      "neg_reactions": 16,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2013
      },
      "score": 9,
      "text": "Everyone in the review section is a  idiot.  They're just hating on it because it's a remake.",
      "total_reactions": 21,
      "user": "Leandro36"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "Spike Lee's remake of Oldboy isn't even near as cool, as memorable or as effective as the original cult classic, but it does have it's good elements such as a fantastic score, decent acting (apart from a laughable and campy Sharlto Copley, who is usually fantastic in his roles), nice visuals and motifs and some fantastic sequences. This remake comes off more as entertaining than intriguing. The film's major flaws is that the first 10 or so minutes are horribly acted and edited, the pacing is odd, it feels like they cut a tone of footage out (which apparently did happen) and the twist is not as effective as it was in the original. Overall, it is decent remake and is pretty enjoyable with the most part with some great sequences and a fantastic score, but it is unnecessary and not even near as memorable as the cult classic that inspired it.",
      "total_reactions": 1,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "I have a confession to make: I have never seen the original, so called 'superior' Korean original. But from what I've seen: it's a case of 'lost in translation'. For the most part, Oldboy's plot is highly original, the ultimate denoument of the story, shocking and heartbreaking.  The casts gave their best A-game: be it Brolin, Olsen and Cooper as well as a particularly hammy Copley. But for the most part, it's a well made thriller that seemed to be 'butchered' a bit by the Producers before release, rumor has it.  If such plot line and signature set pieces were based on a Korean film, then I suppose it's time for me to dwell into Korean fare then. Originality...something that Hollywood has missed in recent year....",
      "total_reactions": 2,
      "user": "dharma"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "Ever since the success of the Grudge, 10 years ago, American filmmakers have been looking to popular overseas films for original ideas, many times simply remaking them. To many, this seems like a desperation move for original material, but I see it more as a cultural thing. Movies often reflect the society of the country they were made in, and by remaking them in the United States, the story introduces movie lovers to something unique, from a different culture. I personally find this very desirable and have appreciated many of these remakes, even when I didn't love the story. In his latest venture, Spike Lee takes on the Korean classic, Oldboy. This is a film that was remade simply because of how bizarre and shocking the story is. The year is 1993, and Joe Doucett (Josh Brolin) isn't a great guy. For some reason, he's drugged and then locked away in a pretty decent looking room without doors or windows, and held there for exactly 20 years. Then, just as suddenly as he was imprisoned, he was released, and goes on a search for answers, in this seemingly new world. Josh Brolin stars and is usually pretty good as an ancillary character, but as the star of a thriller, I was skeptical. As always, he could have shown some more emotion, but he was much better than I thought he'd be. Spike Lee gives him as much help as he can, by giving him a huge cast of supporting actors, all of whom had name recognition. In particular, Samuel L. Jackson playing a psychopath, was very funny, and definitely injected some much needed humor. Oldboy is one of those films where it all comes down to the ending. If you're unfamiliar with the story, I won't say anything other than to tell you, that it is bizarre and twisted, with an ending the likes of which you couldn't possibly have imagined. Even if you start to watch this film and don't really like it, stick with it, because the ending really is that good.",
      "total_reactions": 1,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "One of my all time favorite world cinema is the Korean version of this movie. Remakes are okay, but some movies won't suit for recreation because of its masterpiece value, believing that won't come close for the second time. Just like Mona Lisa, Starry Night, Birth of Venus, The Last Supper and other arts, it should have left alone untouched. Like Japanese did, because it was their story after all. This American version was good, but very much commercialized with the fast pace approach kind of ruined. If I had not seen the original, probably I would have liked it. I knew the twist so I did not get the excitements in those parts. So those who are not familiar with the 2003 movie can definitely have a good time.",
      "total_reactions": 1,
      "user": "LeZee"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "It has been a long time that a plot twist has legitimately shocked me the way that this movie's did! I felt like it could have been a little longer or at least more drawn out. Also one of the death's caught me as particularly cheesy. However, even though the sum of its parts don't add up to a movie that is great, they definitely make one that is very good! It's weird, it's dark, it's crazy and it's violent! If you're into that then definitely don't hesitate in giving Spike Lee's Oldboy a go!",
      "total_reactions": 2,
      "user": "chrisjones914"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "I couldn't find any decent movie on Netflix that I wanted to see, but then I stumbled across this movie and I thought that the premise sounded interesting so I gave it a chance. And ohhh boy, I was not disappointed. I went in with no expectations but I was absolutely blown away at the end!",
      "total_reactions": 1,
      "user": "Wolfguard"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2014
      },
      "score": 3,
      "text": "I would like to lock Spike Lee in my bathroom for 2 hours, then let him out.  Then he would know what it feels like to lose 2 hours of your life that you will never get back.  Adrian locked Joe away for 20 years banking solely on the hope that he would have sex with Marie?  Really?  I know he was led right to her...but what if he kept running?  What if Marie never stopped him to offer help?  What if they werent attracted to each other?  There is seriously a place that is in business to lock people away indefinitely and make them think they are in a hotel?  The fight scenes were ridiculous.  Apparently, watching infomercials for 20 years makes you a complete badass.  He wiped out 2 separate mobs of guys (not sure where they came from) with ease.  He took out the last group of guys with a knife buried in his back.  Yet, when he went to rescue Marie at the house, he was easily overpowered by 2 guys.  I liked the twist at the end with the daughter, but that wasnt enough to make up for the other 95%",
      "total_reactions": 2,
      "user": "bertsienna"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "Siempre la misma murga de siempre (Remakes malvados, remakes diabolicos, puto Hollywood BLA BLA BLA), no voy a negar que Hollywood recurra a las secuelas y a lo remakes, porque este carente de ideas, pero no voy a ser un cínico ni un hipócrita, como mucha gente actúa, solamente porque la película es un remake sin ni siquiera valorarla y mas cuando hay gente competente detrás de ello.",
      "total_reactions": 1,
      "user": "Barbudez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2016
      },
      "score": 5,
      "text": "Disclaimer: I haven't seen the original.",
      "total_reactions": 0,
      "user": "FireOccator"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2014
      },
      "score": 3,
      "text": "Spike Lee was a controversial filmmaker. Now he proves to be a bad filmmaker. Why he would choose to become the victim of the American remake was probably because of The Departed, and how successful it was and how many awards it received. In Oldboy, Spike tries to convince you that it isn't the same, but by the end we find out that it is the same.",
      "total_reactions": 0,
      "user": "chw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2017
      },
      "score": 7,
      "text": "Неплохой ремейк.",
      "total_reactions": 0,
      "user": "russiangamer"
    }
  ]
}