{
  "mc_avg_user_score": 5.7,
  "mc_metascore": 41,
  "mc_mixed_rating_frequency": 118,
  "mc_movie_name": "Olympus Has Fallen",
  "mc_negative_rating_frequency": 78,
  "mc_positive_rating_frequency": 151,
  "mc_pro_critic_reviews": [
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "Korean-American actor and former model Yune (who played a similar role in \"Die Another Day,\" the last Pierce Brosnan James Bond film) makes a colourful villain – handsome and insufferably assured, and also an unchivalrous sadist who kicks around the Secretary of Defense (Melissa Leo in a pageboy wig) as though she’s a hacky sack."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "Although the film's real-world credibility is shaky, it works on its own terms."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "It's that wonderful, totally unambitious yet satisfying thing, a really good movie."
    },
    {
      "critic": "Bill Zwecker",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "While Olympus Has Fallen breaks no major new ground in the political thriller genre, Fuqua has directed a sharp, very taut adventure that keeps you engrossed from start to finish."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 67,
      "summary": "The action is the real star here, and it’s all good enough. It isn’t great – the aerial special effects are distractingly cheap – but at least there’s lots of it on display."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 67,
      "summary": "Melissa Leo has some standout scenes as the secretary of defense, who gets pretty well beaten up for defying her captors, but others, such as Angela Bassett and Morgan Freeman, have little to do but bite their lips and look tense from the confines of their command posts."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 63,
      "summary": "Any semblance of seriousness and verisimilitude suggested by the marketing campaign is quickly forgotten once director Antoine Fuqua's enjoyably tacky Die Hard-on-the-Potomac gets under way."
    },
    {
      "critic": null,
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2013
      },
      "score": 63,
      "summary": "The film spends its first act establishing a flimsy emotional groundwork before gleefully taking a sledgehammer to it just seconds into act two."
    },
    {
      "critic": "Guy Lodge",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2013
      },
      "score": 60,
      "summary": "The thrills and the effects are cheap, but this is in hard-driving, good-humoured command of its own silliness."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2013
      },
      "score": 60,
      "summary": "A deep supporting cast brings its A-game to the ridiculous dialogue."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 60,
      "summary": "Perhaps every generation gets the movie stars it deserves. “Olympus” has quite a bit to say about the current state of our country. Intentions aside, not all of it is entirely flattering."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2013
      },
      "score": 60,
      "summary": "Generates a fair amount of tension and produces the kind of nationalistic outrage that rock-ribbed Americans will feel in their guts."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2013
      },
      "score": 60,
      "summary": "A Red Dawn for the Tea Party era, Olympus Has Fallen is pretty ridiculously entertaining—or at least entertainingly ridiculous—for long stretches, dulled only by the realization that there are many parts of the country where this will play as less than total farce."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "Olympus Has Fallen at least possesses the frisson of timeliness amid otherwise hoary action-movie cliches."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "This unapologetic B-movie at least keeps the action rolling, and the time goes by quickly. To put it another way, I’d rather see Gerard Butler stab a terrorist in the neck than flirt with Katherine Heigl."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "This is for those who like their political thrillers far-fetched, far-reaching and filled with pretty people."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "A North Korean terrorist may be responsible for taking the president hostage, but it’s Bulgarian-made CGI that does the most damage in Antoine Fuqua’s intense, ugly, White-House-under-siege actioner Olympus Has Fallen."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "For all the bursts of blood, the gunplay and execution-style head-shots that punctuate scores of deaths, it’s hard to see Olympus Has Fallen (Secret Service code) as much more than another movie manifestation of a first-person shooter video game."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "Butler serves the cause well, considering. Think that cause is a thankless one? Shhh, don’t tell Secret Service agent Channing Tatum or president Jamie Foxx, headed your way in June with, yes, “White House Down.”"
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "The countdown-to-Armageddon structure generates almost no tension, but Olympus Has Fallen does have lots of squalidly bloody hand-to-hand action, all of which is so pulpy and standardthat the film actually makes you grateful for the presence of Gerard Butler, gnashing his teeth in the Bruce Willis role."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 42,
      "summary": "The movie is so apolitical; there could have been a nice slant to the movie, about how both sides of the aisle could get together to kick out these Korean terrorists. Instead, it remains totally void."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2013
      },
      "score": 40,
      "summary": "Part of the weirdness of this film lies in the fact that the tense North Korean situation in the real world gives it no realism or satirical edge, or prophetic authority of any kind."
    },
    {
      "critic": "Read full review",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2013
      },
      "score": 40,
      "summary": "The movie isn’t a desecration, but it’s action filmmaking, not America, that needs to be reborn."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 40,
      "summary": "If you’re just going to rip off the action movies of yore, why not rip off more of the good stuff?"
    },
    {
      "critic": "Ian Buckwalter",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 35,
      "summary": "Feels from start to finish like a throwback to the action cinema and military thrillers of decades past."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2013
      },
      "score": 30,
      "summary": "Olympus Has Fallen is a disgusting piece of work, but it certainly hits its marks — it makes you sick with suspense."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 25,
      "summary": "Nearly everything that happens in Olympus Has Fallen is ludicrous, yet because the fate of the president and the nation hangs in the balance, the crisis is treated with the gravitas of Paul Scofield at the West End."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 20,
      "summary": "It may be too much to ask for anything more, but, on the other hand, if you’re going to go to the trouble of pretending to blow up the White House, you might also want to pretend that something was at stake."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "summary": "[Antoine Fuqua] gives in to terrible instincts here, flirting with overwrought patriotism, one too many laugh lines amid numerous characters being shot in the head, and a general chaos-inspired editing technique all too rampant in today's action cinema."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "summary": "Olympus Has Fallen is no fun at all. To the contrary, it soon grows tedious, odious and oppressive."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "A competent action flick, perfectly slotted for pre-summer release.  Various plot devices are hardly believable, but you just go with it in this type of movie.  Predictable, but fun.",
      "total_reactions": 2,
      "user": "ScrawnyPunk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "This is everything that Die Hard 5 should've been. An all out, over the top, ridiculous action movie, yet is somehow manages to pull it off and give you a thoroughly entertaining experience. With a great cast consisting of Gerard Butler, Aaron Eckhart and Morgan Freeman  they really make this film work. Olympus Has Fallen deals with a North Korean led guerrilla assault, led by former Bond villain Rick Yune, on the White House, where it's left to a guilt ridden Secret Service agent Mike Banning (Butler) to stop the terrorists and save the President (Eckhart.) It's definitely not an original idea but that doesn't prevent you from enjoying the film. It's a heart pounding, adrenaline filled action adventure that seems to take certain inspiration from classics like Die Hard and Under Siege. As unrealistic as it is. The film is very well acted. Morgan Freeman just doesn't deliver an average performance and that's no different here. Eckhart is believable as the idealist President. Yune was a smart and solid choice as the villain of the piece but it's Butler who rediscovers his form. He has had some shockers recently but this is very much normal business resumed. He thrives as an action star and this may just re-ignite him in that area because he gives a superb showing here. Let's be clear it won't win any Academy Awards. But in terms of action it's packed to the limit, adrenaline fuelled, fist pumping, roller-coaster ride that is pure entertainment.",
      "total_reactions": 2,
      "user": "Rosco"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "Olympus Has Fallen felt like a live-action version of a Call of Duty game. They ignore realism and go for as much shock and awe as possible. When I say they \"ignore realism\", I don't mean it looks or feels fake, I mean the major plot points that establish the premise are ridiculously unbelievable and all of the drama hinges on those points. It makes the very well done action sequences tinge of disbelief because the scenario is flawed. As a matter of fact, all of the drama in the film suffers from these flaws. So why did I give it a not-so-terrible rating? Because Gerard Butler is such a BA that he makes this movie incredibly entertaining. The combat and fighting sequences were incredibly well done and the acting throughout, not just by Butler but really the entire cast, is great. The graphics and cinematic elements were done well also. Really, the only flaws in the film were story related but they had such a cascade effect that it hurt the entire film. Overall, I think most people would actually probably enjoy it because they wouldn't get quite as hung up on the minor details as I did but I expected more.",
      "total_reactions": 2,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "Like alot have already said, it's quite Die Hard-esque, the attack sequences were pretty decent, but there's an element called \"plausibility\" that they punted and that makes this a one-time watch instead of a classic to view repeatedly. I do wonder, though, if Obama requested a Secret Service briefing to ensure such elements of attack couldn't be exploited.",
      "total_reactions": 1,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "The movie is so ludicrous and unrealistic on how it unfolds, that its hard to take anything seriously. Some thrills and action sequences can't make up for the slightly better Sci-Fi channel visual effects.",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "A B movie with an A-list cast of actors, they put in a yeomen-like effort but can't salvage the overly generic dialogue and plot. I love action, and that was done reasonably well without being anything special. As some have noted it's kinda like an old-school 80's action film with Gerald Butler standing in for Chuck Norris.",
      "total_reactions": 1,
      "user": "MalikStarks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "Watching this movie, i was constantly reminded of the film adaption of Tom Clancy's \"The Sum of All Fears\". Show America being hurt, throw in a male model built secret service agent, some shady, obviously evil baddies and Morgan Freeman. What made TSoAFs a superior film however, was that it always managed to maintain an atmosphere that kept you in doubt as to whether the US would escape intact, even though the film viewer in us kept telling ourselves that of course it would. \"Olympus has Fallen\" never keeps you in doubt that America will come out on top and stronger than ever, or that Aaron Eckhart will come out with his face still in presentable condition. Some [one] good jokes and cathartic action sequences push this entirely unremarkable film up to a 5/10.",
      "total_reactions": 1,
      "user": "MrHarkonnen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2014
      },
      "score": 2,
      "text": "I could only make it through about 30 minutes of this movie. The premise is unbelievable-- somehow a lone aircraft sneaks past all our technologies and takes out several F/A-18s-- this is followed by ground troops appearing in D.C. and several spies in the white house taking out the S.S guarding the President. Of course, no explanation is give for how the ground troops (complete with tanks and trucks) somehow managed to enter our country, or how the spies somehow ended up in the bunker with the President and his personal guard.",
      "total_reactions": 1,
      "user": "Iamthejuan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "VERY PREDICTABLE! It only takes one main character to save the world.... Crap. There's nothing new that I have watched. The president will be saved no matter what lol if you want to feel good watch this cos it's like fairytale to me",
      "total_reactions": 1,
      "user": "Decport"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2014
      },
      "score": 3,
      "text": "Really, really stupid plot.  Action and CGI were fine but the plot did this movie in.  Way too many convenient plot points like all of the three code holders in the same place.  And letting the South Korean delegation in the bunker is just beyond the pale.  How did the bad guys know so much?  And how were they able to gain advanced U.S. weaponry.  Stupid, stupid, stupid!",
      "total_reactions": 1,
      "user": "psyberdelic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2013
      },
      "score": 0,
      "text": "A thoroughly racist, flag-waving action movie that inculcates the absurd notion of the secret service and capitol hill counter assault forces being overwhelmed by a small band of N. Korean terrorists. Sorry, not possible. Even taken in it's own insular reality and removing the integral political and racial themes, this movie blows hard and mainly borrows and steals it's plot arc and action-sequences from forebears like the Die Hard series. Not that I was able to appreciate anything after the initially stupefying interpretation of how the capitol would be invaded, as numerically superior and well-fortified Secret Service forces are somehow slaughtered piecemeal, tactically outmaneuvered and out-marksmanned by terrorists marching in an easy to target crowd. Not to mention the archaic looking single war-plane able to dodge all gunfire and release an endless supply of smart missile jammers against the 1 anti-aircraft battery in all of Washington, D.C. Oh, and it's gunner somehow has perfect accuracy. So obnoxious, and the sad part is that there are people who could possibly believe this.",
      "total_reactions": 1,
      "user": "Disckrieg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2013
      },
      "score": 3,
      "text": "A ridiculous rah rah American political movie that is a joke from start to finish.  The anti terrorist sentiment rules every aspect  with the righteousness of  running rampant over every scene.  Infantile and terribly predictable.",
      "total_reactions": 1,
      "user": "Sorrento"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "Cliché, cheesy, inane, boring, predictable  all could be used to sum up this horrible movie. It sucked, and I want my money back. Because this is America, and when things suck you should be able to get your $8 back.",
      "total_reactions": 9,
      "user": "boomersooner75"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "This movie was so bad it made me create a profile and write a review.  This is my first.  This is a horrible movie, so transparent in plot and so lacking in style I actually laughed al the way through it. This is a thin and badly made façade to demonise North Korea to justify the US Government going to war. The imagery  was so crude that America is good and NK so bad I laughed, a five year old could see through it.  Avoid, for the love of god and country avoid.  This movie deserves to go down in history as a piece of crude propaganda that Goebbels would be proud of.",
      "total_reactions": 7,
      "user": "HUMANredux"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "It's essentially the first Die Hard meets Call of Duty: Modern Warfare 2... (and actually, it was way better than that most recent stinky entry in the Die Hard franchise).",
      "total_reactions": 12,
      "user": "2CatShakur"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2013
      },
      "score": 2,
      "text": "Laughable plot, careless CGI, anticlimactic ending, and uninteresting characters. I wanted to enjoy myself, but I just couldn't get past all the mindlessness. Watch at your own rate.",
      "total_reactions": 5,
      "user": "Kracket"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 2,
      "text": "Simply awful, acting is very poor and topic has been done to death.  Needed more to be orginal but it fell short shame really,  I felt rather disapointed I was expecting more.",
      "total_reactions": 7,
      "user": "Tolantra"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "A movie that bring the audience right back to 80's action movies. Crappy effects, unbelievable plot and over the top action sequences. This is the recipe to a good old action movie, simple yet many other movies have failed at it like the last stand. Great movie for good old mindless fun.",
      "total_reactions": 6,
      "user": "rafaram"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2013
      },
      "score": 1,
      "text": "Prepare to have your intelligence insulted. Admittedly I saw this on a \"guys night out\" and I was the only one who hated it in our group of four. That's no excuse for such a steaming pile of Hollywood poo. Its so over the top its better as a parody of action flicks rather than an action flick in its own right. (We need the Mystery Science Theater guys to talk over this one.) I want my nine bucks and two hours back.",
      "total_reactions": 7,
      "user": "gunnyart"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2013
      },
      "score": 3,
      "text": "Not good. Not good at all. This was the single most over hyped movie I have seen since The Dark Knight Rises. The cgi sucks, the acting is mediocre at best, and it's incredibly boring and tedious.",
      "total_reactions": 7,
      "user": "AngusMilne"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "Truly a horrible movie.  Not the actors' fault--they did well enough.  Just a dumb plot with completely implausible elements.  Don't watch this.  You'd be better off staying home and watching re-runs of West Wing.",
      "total_reactions": 9,
      "user": "Muckraker"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 1,
      "text": "I can't believe I paid money to watch this movie. Absolutely terrible. The only reason I didn't give it a zero is because there were a few decent parts. If you are a remotely intelligent person you will find this movie's plot repulsive. It makes no sense at all, characters die for no reason, the CGI is awful, just a very poor movie.",
      "total_reactions": 9,
      "user": "buckeyes7549"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2013
      },
      "score": 1,
      "text": "American hubris at it's most heavy handed (and not in the fun way). It goes beyond mere fantasy into nationalistic mutual masturbation.  Every single American cliche is used. For example, as the Secretary of Defense is dragged to the top floor she says the Pledge of Allegiance to steel herself against the possibility of death. Machismo is satisfied in a number of ways with all female characters (except one) either beaten or killed. In the end, of course, America is united through astronomical blood sacrifice to be \"reborn\" and unified. Also, I am pretty sure that Morgan Freeman is wasted as a very weak Speaker of the House. It was almost comical, but so heavy handed and cliched that I couldn't even laugh.",
      "total_reactions": 11,
      "user": "DuckTales1"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "This is a GREAT action movie.  I'm judging it based on an action movie not a movie up for an oscar.  It has a lot of cool action scenes, good plot, well acted and was intense.  I think it is the perfect action movie.",
      "total_reactions": 26,
      "user": "rmjbones"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "This is a great action movie. Reminiscent of the original Die Hard and Under Siege. Well acted, high body count and well paced, the film never gets preachy or off topic. Not believable, but still a great experience and still better than the other action movies that have come out this year.",
      "total_reactions": 6,
      "user": "JPG127"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "This script is corny and the acting is very uneven.  Gerard Butler is fine as the main badass.  There is a tremendous 20-25 minute action sequence.  Very uneven film.  Didn't anyone day anything to these people about how stupid this is?  Think Die hard crossed with in the line of fire and ask why?",
      "total_reactions": 4,
      "user": "StevieGJD"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "Gerard Butler has had a long string on movie duds, but this one will put him back on solid ground as an intrepid Secret Service agent. After terrorists stage a spectacular attack on the White House and hold President Aaron Eckhart hostage, Butler is the only one who can save the day. As this genre goes, this is pretty much by the numbers, but it's well staged and well acted (who even recognized Melissa Leo in that wig?). The fights are sometimes too jumbled to follow, but the plot (pun intended) offers a frightening theory that's effectively played out.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2013
      },
      "score": 0,
      "text": "Ugh. I've seen the same actors do well in other productions; in this movie, every scene is overacted to the extreme. Never mind the terrible contrieved, inconsistent and unrealistic plot, I believe the director is to blame here. Where else would the actors have gotten the idea to suddenly underperfom like that? As other reviewers have pointed out, trite cliches abound. I am shocked and disappointed that a sequel is in the works. Then again, it could hardly be worse.",
      "total_reactions": 2,
      "user": "norse"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "it could be worse and i guess if you can stand another \"oh my god we are all victims\" super patriotic US movie you can live with it as popcorn movie i guess.",
      "total_reactions": 2,
      "user": "nirax"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "I tried really, really hard to make it past the first half-hour, but it just wasn't possible.  After convincing myself that the terrible dialog was just a brief device to get to the action, and suppressing snickers at the awful character stereotypes, the action arrived and it was  just  awful.",
      "total_reactions": 2,
      "user": "KangarooKurt"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2013
      },
      "score": 2,
      "text": "This is a movie so bad, I actually began writing this review while watching it. I'm all for pointless action, but the cliched plot and absolutely implausible takeover of the White House is near maddening. An army of Koreans sneak into the United States, some disguised as delegates who are mysteriously allowed to carry weapons within the White House, manage to capture the President. Meanwhile, the Secret Service, the men and women who are arguably the best trained agents in the world, run mindlessly into the open to take stray bullets from all directions. It's insane how badly this movie is set up from the beginning. It's not just bad, it's insulting. It's doesn't ever try to be funny like it's Jamie Fox counterpart.",
      "total_reactions": 2,
      "user": "Redfordsto"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2013
      },
      "score": 2,
      "text": "Antoine Fuqua knows how to display brutality in a film, be it physical or psychological and Olympus Has Fallen is bloody and traumatic but overall its a colossal waste of time, money and a plethora of talented actors. The film follows Mike Banning (Gerard Butler) who was the president's lead bodyguard until a tragic accident leaves him warming the bench. However when armed terrorists lay siege to the White House Mike must prove himself by saving not only the president but his son, a young boy who went missing when the gunfire started. Olympus avoids the many action cliches that ruin many a film but in doing so it fails to create any sense of suspense. Everything that happens is without any sense of jeopardy due to the way Mike is shown, he is a killing machine. The film has no tension so therefore it lacks a tone and its looks can be described by just saying the word brown, the film is dark, dingy and dirty and not in a good way, the film is miserably shot. Everything about the film is murky, hard to see and depressing, even in the uplifting moments. It's a film that because of its story is exceptionally bloody but it never really justifies the excessive brutality so by the end the main hero is essentially a sadist and an effective one at that considering he kills a small army in this film. They even attempt to justify his hero status with a girlfriend (Rhada Mitchell) who is literally there to service a plot point that isn't even successfully conveyed. They try a little harder by making him good with kids (because what kind of sociopath would be nice to a child is what I imagine the logic behind this was) as he protects the President's (Aaron Eckhart) son but even this doesn't mesh with the one man army the film is showing you, in fact by the end of the film Banning comes off as a highly trained, highly intelligent serial killer, only he doesn't have to hide any of his crimes. The film is populated with characters so badly written that they are completely unsympathetic. When the President gets threatened you kinda hope they kill him, to be honest, he really deserves it by the end. Melissa Leo gives good tough gal as the Secretary of Defense and Morgan Freeman comes in to literally order coffee and sit and relax. It's a film so remarkably stupid in its writing that the only enjoyable moments are the ones where they aren't talking but even the action fails to maintain your interest. In fact an action scene late into the movie is so hard to see that it sucks the life out of the ending and its a good 5 minute segment of blurry rubbish.  It's a tone deaf mess of an action film that really could have been better.",
      "total_reactions": 2,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2013
      },
      "score": 4,
      "text": "Terribly under developed characters that made no sense. Overall plot holes made the action scenes hard to watch. Something that is \"impossible\" is terribly easy in the next scene... in more than one instance. Probably best to avoid this one.",
      "total_reactions": 2,
      "user": "Cloppers"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "The rating was just so so on imdb. I thought this would be as terrible as die hard 5, but i was wrong. This one was so much better and much more entertaining than die hard 5. Full throttle action, very enjoyable, intense and great acting. I could have given it 10, but since there were too much civilians killing and massacre scenes therefore i reduce it to 8. This movie worth every  and my time on big screen.",
      "total_reactions": 2,
      "user": "ivan_terrible"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "I first want to say, I am anti-American. Born and raised in Russia, my parents abandoned me because of the economy. I've always blamed that on America.",
      "total_reactions": 2,
      "user": "JamesAlexei"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2014
      },
      "score": 0,
      "text": "Ambitiously stupid movie.  And the sentiment is way past its prime.  I don't think anyone, anywhere gives a **** about the \"United States\" or its whorish capital  of Washington DC.  I was rooting for the Koreans to be quite honest.",
      "total_reactions": 2,
      "user": "statsman"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2013
      },
      "score": 2,
      "text": "This movie was terrible! Bad acting all around. Nothing made sense. They tried to make the movie shocking with the violence, but it was laughable. Worst movie I've seen in a long time. I thought this movie was going to be better than Die Hard 5 based on the scores, but it was actually worse. I think there were only two good scenes in the movie: when Butler interrogates two bad guys, and when he saves the kid. There were so many scenes where they were trying to be serious, but I couldn't help but laugh out loud because they were so dumb. How this got a mid 40s score from the critics is beyond me.",
      "total_reactions": 9,
      "user": "jlplatten"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "What a great F#cking movie. I have no idea why some people are giving it such bad reviews. If you like action thrillers then this movie will get your blood boiling and heart pounding. When certain part of the movie occurred (which will remain nameless as not to spoil anyone) the crowd started cheering and there was an applause at the end of the film. The only downfall that I saw in the movie were some real life inaccuracies. other than that it was one of Gerard Butler's best films.",
      "total_reactions": 7,
      "user": "lilschreck"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "This is one wild ride! It will be too much for some people (too much noise, too much blood, etc etc) but that's okay. If you're able to suspend your disbelief, Fuqua's pacing zips along so fast that you bounce over the plot holes. It's like a roller coaster you'll want to get back on as soon as it's over. Butler, Freeman, Basset, Eckhart, et al are terrific! Do not be swayed  see it for yourself",
      "total_reactions": 7,
      "user": "weetiger3"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "According to moviebodycounts.com, (yes, all sorts of information is available on the Internet), Gerard Butler set some sort of top 5 record with his movie “300” and I think he easily breaks that record with a body count of 600 people just in the first half hour of “Olympus Has Fallen”!",
      "total_reactions": 5,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2013
      },
      "score": 3,
      "text": "It's not a terrible film, and it gets your blood up if you're a red-blooded American.  But I think certain directors and producers have a fetish which involves destroying American landmarks, killing American civilians, and desecrating the American flag in really creative ways. Sure, for cheesy movie like this to work, you have to get really pissed at the bad guy for that cathartic payoff at the end.  But the level of destruction and killing in the first half of this film strains credulity and is over-the-top.  Butler's not bad at all in his role, but Morgan Freeman is wasted.  And he's a softie.  Finally, I'm fascinated that Hollywood lacks the sack to make China the enemy in these movies (Red Dawn, etc.)  North Koreans have a tough time scraping together food for their families  they don't have the resources to put together operations like this.  And for what?  The bad guys' motivation is preposterous.  ALL that being said, if you're out for a little brainless fun, it'll work.",
      "total_reactions": 8,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "\"Olympus Has Fallen\" is a taunt, exciting, edgy and just a flat out terrific action movie. More along the lines of a Die Hard for this generation, Antoine Fuqua has created one truly kick ass film, Olympus does not fall, in fact its quite the opposite.\".. A-",
      "total_reactions": 3,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "I thoroughly enjoyed this action packed thrill ride of a movie. Yes it does seem completely impossible at times and the secret service looks pretty incompetent but it doesn't take away from the many awesomeness factors. I think the plot does of good job of making you care about its characters and the many twists and turns keep you engaged. All in all the movie can be a little cheesy at times but I highly recommend you see it.",
      "total_reactions": 3,
      "user": "theoffice"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "An absolute piece of  that shows our Secret Service guys as naive idiots has are running into bullets instead of taking cover, arranging defense perimeter and calling for enforcements. Only certified idiots can believe that something like that can indeed happen especially after 9/11. Watching this junk insults my intelligence.",
      "total_reactions": 3,
      "user": "tomjas"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "If you have seen Die Hard, the original, then you've seen this.  So-so remake in which you know how this is ending.  Lot of destruction and people dying.  And our hero?  LOL",
      "total_reactions": 4,
      "user": "fantasy"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "It's Die Hard in the White House. Olympus has Fallen has a great edgy feeling to it, making the film just like Die Hard movies. The plot was great and the action was mesmerizing. This is the movie for action fanatics but it seems like its more than that. Die Hard 5 is just what I wanted this to be, but the stinky Good Day To Die Hard entered and blowed my mind. Olympus has Fallen is great. Maybe it's the best movie of 2013.",
      "total_reactions": 4,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "I mean it gets your blood pomping but eh sometimes its a little weak. In my opinion so far in 2012 Ive enjoyed 1. Spring Breakers 2. A Haunted House. 3. Olympus Has Fallen. 4. Death Race 3. If you want my opinion watch 'Spring Breakers' it comes out the same day and was much much better. Probably one of the best and most interesting films in like 4-5 years. Watch this if you like destruction to a big point. I have no problem with destroying American landmarks, people, flags. eh. Its just a movie and thats probably the thing that drove the film for me. Watch Spring Breakers. If your unable to watch Olympus Has Fallen. #SpringBreakForever.",
      "total_reactions": 4,
      "user": "MarkMusic"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "i guest this movie goal for give up nationalisme the people americ aof attack by other country,,because this few month there issues attack from north korea and others countryt,,,this punish for people america for support to israel.",
      "total_reactions": 9,
      "user": "ikemen"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "Plenty of great action but a bit formulaic.  I also get sick of these scenarios where the President has to decide between the lives of people close to him and the lives of billions of people.  Shouldn't this be a no-brainer?",
      "total_reactions": 1,
      "user": "martinex"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "This movie in my book gets a 10/10 for accomplishing what it set out to be, and ACTION movie. Forget the Oscars and Golden Globes ladies and gentlemen, this is a true action movie with the right premise and the right excuse to blow car up and shoot anything that moves. Yes the plot is unrealistic, but thats not what I expect from this movie. I wanted tension, suspense, action, and thrill and Olympus Has Fallen delivers in spades. If I had to choose between watching this or Argo, I would watch this. Dont get me wrong Argo was a good movie, but Olympus Has Fallen is more ENTERTAINING, and at the end of the day, thats why I watch movies, for entertainment. This is the Die Hard sequel I was waiting for. PS: thank you Antoine Fuqua for giving us some old school 90's action it was about time someone nailed this genre again",
      "total_reactions": 1,
      "user": "cell989"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "This is a Hollywood formula film.  Every couple of years they release an action movie with essentially the same plot because it's a tried and true formula that works.  Back in 1993 Clint Eastwood made a film called In the Line of Fire where he was an ex Secret Service man who didn't save the President from getting shot and gets a chance to redeem himself.  They basically stole that idea for this film.  This latest version is action packed and never boring.  Unfortunately it had the dreaded countdown timer at the end of the film that we've seen a thousand times where the planet is saved with only a couple of seconds left on the clock.  That is the main problem with films like this one  they are always unoriginal.  Most of the hand to hand combat scenes have the fast editing extreme close ups where you can't see what's going on.  The few attempts at humor were hokey and fell flat.  Still, the special effects are well done, the acting is fine, and the action frenetic.  Lastly, there is a lot of violence, so if you can't stomach that stay away.",
      "total_reactions": 1,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "Olympus Has Fallen. Some good things about it and some bad. The bad first, ridiculus plot with some very cringe worthy American propaganda, dodgy special effects and will easily be bettered by the upcoming \"White House Down\". However there is some good points with a great cast and some interesting shots from director Antoine Fuqua. The star however is the action which is crazy and surprisingly hard edged. Its like watching a reboot of an 80's Steven Segal movie and a potential future guilty pleasure!",
      "total_reactions": 2,
      "user": "allystew"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "Quick sum up:  Salt meets Rambo meets Mars attacks (Only the stuff blowing up).",
      "total_reactions": 1,
      "user": "criticscritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "Gerard Butler Goes for the \"Turkey\"",
      "total_reactions": 1,
      "user": "TastyJamProject"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "Only knowing a little bit about the film to start with (it has Gerard Butler and Morgan Freeman), I took the film with a pinch of salt. Now I'm not saying this is a brilliant film, because it's not, but it's still a great film to keep you giddy on the way home.",
      "total_reactions": 1,
      "user": "Kranitoko"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "this film is much better than I expected. Its extremely action-packed and has very interesting characters. America FTW guys! The most patriotic movie i've seen in a while.",
      "total_reactions": 3,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "Olympus has fallen is the first of the big White House action to pieces to be released this year, followed by White House Down later on. While there is plenty to see and enough action to please the masses, the film isn't without its problems.",
      "total_reactions": 1,
      "user": "StevenF"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "The plot is incredibly generic  Your typical enemy forces invade the US and now it's up to one guy to stop them all and save the day. Sort of a mix between Die Hard and Rambo but no where near as good as the two. The plot is very lacking and only explains the essentials, No real story to it, It's more of a crutch to help fill in where there isn't any action.",
      "total_reactions": 1,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "The Navy Admiral SHOULD have died before giving his code. The \"Madaam\" Secretary would have died before giving her code. \"Send in the Seals\"? They should have sent the Army Rangers... Ah well. Hollywood is seldom right. Still, a good action flick with a capable protagonist.",
      "total_reactions": 2,
      "user": "Finfid"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "Very good film.  I quite enjoyed it for an action movie and thought the actors did a great job.  A couple things could have been touched up on or more utilized, but nothing major and the ending could have been a little more extended but not much... Those are minor grips.  Otherwise, check it out.  Definately worth the price of admission (I went to an afternoon viewing of it)",
      "total_reactions": 2,
      "user": "Gamer4life1985"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "It's cliche-ridden in almost every corner, but enjoyable for what it is. Just turn off your brain. Starts off high-octane, but ultimately could have used more action. Not because it is utterly lacking, but because it has little other substance to offer. Oh, and if you are Korean, you are going to LOVE the ultra-bad \"Korean\" accents.",
      "total_reactions": 1,
      "user": "ndjn3979"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "Do Americans ever get tired of their own self centered patriotic BS? Apparently not coz they even made 2 clone movies (the other being White House Down). For us non-Americans most fun can be had from watching the white house get shot to smithereens, the president getting beat up and the military and secret service being portrayed as the bunch of incompetent little monkeys they are. They made this on a tight budget (70m$) by todays standards and you can tell that they skimped on the VFX (helicopters and destruction looks a bit CG) and on the script. Maybe the rest of the world was thinking what I was thinking coz outside of the US the film made little money. Hey, maybe consumers are getting smart and are starting to vote with their wallet. If this trend continues they'll maybe start making intelligent movies...nah, who are we kidding",
      "total_reactions": 1,
      "user": "Apemonkey666"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "its a good action movie with advanced gun fights and well written script.they were some loop holes such as even after Bulter resigned from secret service his access were not removed.Fight scenes and acting is quite professional.Certainly worth the money and time i spend.End is bit an american propaganda but its an Hollywood movie so deal with it.",
      "total_reactions": 2,
      "user": "Smee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "You are really going to have to suspend your disbelief with this film if you want to enjoy it. Its pretty obvious that a situation like this would never happen and if you can put this and a few flaws aside, its actually a surprising good action film. If Die Hard 5 was actually good, it would be this movie. Sure, some of the dialogue is cheesy and hit or miss and you can tell how hard Butler is trying to keep his accent hidden but these are just nit picks. Its a solid action movie if you can forgive the minor flaws.",
      "total_reactions": 1,
      "user": "Coletrain128"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "the first part of the movie was.......boring.but after 15 minutes the movie was very good actually,and it was very interasting and thrilling so it succeed to help this movie get a 9 out of me.",
      "total_reactions": 2,
      "user": "idohaker"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "\"Olympus Has Fallen\" was surprisingly effective  the effects were excellent, the action non-stop, and the acting strong from all the major players  and yes, I was surprised by this!  I read a review that trashed the dialogue  but it was kind of shooting ducks in a pond, as this movie is \"Die Hard In The White House\"  not \"Lincoln.\" It's a populist action thriller that delivered action and thrills...check your artistic pretensions at the door and take the ride  it was fun!",
      "total_reactions": 1,
      "user": "Johnrieber"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "It may be wholly unoriginal and occasionally outrageous, but those factors don't change the truth  \"Olympus Has Fallen\" is a suspenseful, thrilling, well-acted, and (Most importantly) fun action flick.",
      "total_reactions": 1,
      "user": "Compi24"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "This film will certainly get your patriotic juices flowing, and it's for that reason that Olympus Has Fallen is without a doubt one of the more satisfying films of 2013. Its plot is preposterous and borderline unbelievable, but thanks to a really great cast, you believe (almost) every bit of it. Gerard Butler, Aaron Eckhart, Morgan Freeman, Melissa Leo, Angela Bassett, Ashley Judd, Dylan McDermott, they all give convincing performances and really give the film a lot of credibility. Credit also must go to director Antoine Fuqua who directs the heck out of this movie; his aggressive approach really ups the stakes and makes OHF a hell of a thrill ride. I was surprised by the action/violence in this, it certainly earns its R rating... villains get what you think they deserve and I just had a great time with the film. The CGI is absolutely horrible, but this is a very fun movie that is worth seeing.",
      "total_reactions": 1,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "This movie was awesome!!!!!!!!!!! From start to finish you don't know what's coming. The action scenes were fantastic and the execution of the story was great. Morgan Freeman and Gerard Butler had great performances. Some people say that it was a ripoff of Air force one but in my opinion it was much better. The only tiny flaw was that at first the dialogue was kind of corny but it straightened out as the story progressed. Everyone go see this because you won't regret it!!!!!!!!!!!!!!!!!!",
      "total_reactions": 1,
      "user": "mds03"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "First of all, to hell with the reviewers on here that bashed the film because of the terrorist scenes. Did you not watch the trailer or read what the film is about? Stop playing politics. Tea Party morons upset over a film, Do us a favor, leave your ridiculous political opinions to yourselves and just stay home and watch Atlas Shrugged or old Ronald Reagan Youtube clips. Olympus Has Fallen is everything you want in an action film. Sure, The situation itself is incredibly unrealistic. It's total mayhem, but Damn its fun! I hope Bruce Willis is taking notes, After \"A Good Day To Die Hard\" he could use Antoine Fuqua for the next film. Daring, nonstop action. Wonderful to see Gerard Butler back as a Badass!",
      "total_reactions": 1,
      "user": "WayneThomas412"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Is this a Die Hard movie, yes.  Is there cheesy dialogue, yes.  Is there some sub par CGI, yes.  Is this a fun time, absolutely.  When people talk about brainless action movies this is what they mean.  Unlike movies like the Expendables or Die Hard 5 this film had a story that was at least interesting.",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "This film was great for me it was the die hard film we didn't get in February really good acting and action it was everything I wish for in a action movie. I would definitely see it again. See I have no idea why people are moaning about this film I think people are really angry recently every film what has been out recently getting awful reviews everybody must be on their periods or summit",
      "total_reactions": 5,
      "user": "kabilaking"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "Putting into mind that its fiction based on could be reality, than you can consider it as the first valid action flick this summer and could be one of the best this year. Gerard butler makes his comeback in his favorite genre as a serious warrior type image. all the rest played around him but played well.",
      "total_reactions": 3,
      "user": "asaddesai"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "The film was a lot of fun.  If you really don't over-think the movie, you're going to enjoy it.   Much better than \"Red Dawn\".  I would say if you enjoyed the movie \"Salt\", you'll enjoy this one.",
      "total_reactions": 2,
      "user": "creyes8519"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "My Take:",
      "total_reactions": 1,
      "user": "MyTakeRadio"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "The movie could have been a little bit happier and switched scenes more often. the movie wasn't too great but did have a lot of action and a good sense of humor in it",
      "total_reactions": 2,
      "user": "Meganfoxlover12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "I can't believe Hollywood became this pathetic weak story over done what  a waste of 2 hours of the weekend  this crew should be ashamed of them selves",
      "total_reactions": 2,
      "user": "DRT"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "This movie brings up memories from the past(Die Hard 1...), it's an ok action picture with decent acting, but it doesn't have single original thing, plot  little bit generic! Overall  good time.",
      "total_reactions": 1,
      "user": "PStakhiv"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "Although it suffers from a slow buildup, I found the action quite good and overall it had a nice Die Hard feel to it. The story suffers from some clichés, however, and I felt it difficult to believe such an attack would be so easy but after a while I was hooked.",
      "total_reactions": 1,
      "user": "S_C_S"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "A good action movie full of Gerard Butler's role is good I liked it and as always Starring Morgan Freeman doing another excellent Aaron Eckhart is not far behind as U.S. president",
      "total_reactions": 1,
      "user": "marioiker03"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "Great acting. Great effects. Great story. Quality film. The story kept me watching, and i nevere got tired of it. Very exciting. Cant wait til it comes out on dvd!",
      "total_reactions": 1,
      "user": "calebstamm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Very intense and very violent. Its a pretty good movie but it needs more story to it and a better plot. The action was very successful and the actors played good parts to the characters. Overall it was a good movie.",
      "total_reactions": 1,
      "user": "J-Force"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "\"Olympus Has Fallen\" 10 Scale Rating: 7.5 (Very Good) ...",
      "total_reactions": 1,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 6,
      "text": "Olympus Has Fallen is a decent action flick. The attempts by Gerad Bulter’s character to save the day are entertaining and engaging with some fun action and nice tension. The acting is good and the presentation in the film is well done. What stops this film from being anything more than that is the film being a little too long and generic rehashing various plot elements from Die Hard. In all honesty if you want to see a great action movie you are better off watching Die Hard because this movie is a cheap imitation of that film. Its not a bad movie mind it does have its entertainment but at times it feels like its trying to copy one of the greatest action movies of all time. Check it out if you are interested but at the same time you don’t need to go rush out and see this movie.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2013
      },
      "score": 2,
      "text": "A movie that seems to be a precautionary lesson about letting \"Liberal wussies\" be in charge of hostage negotiations and running a country (this coming from a Liberal to boot), rather than being about anything remotely believable. Brainless action, bad dialogue and idiotic logic from the US military and leadership all make the aforementioned real world organizations look incredibly bad. Terrorists send in a C-130 over American soil? Only send the jets when they're within spitting distance of Washington! The White House is under attack?! Have the Secret Service and police all walk across the front lawn and get gun down, rather than both sides (Not just the Terrorists) taking cover and using tactics to fight the battle. Terrorist has the president hostage and potentially have access to all of America's nukes, and demand the US military backs off from the White House? Cave! Gotta save the President over 300 million Americans and countless South Koreans right? The Terrorists start executing hostages? Cave! They want you out of the Korean area and off the North-South Korean DMZ so they can attack? Cave! Gotta save the President!!! The three codes needed to arm all nukes in America belong to the three politicians in the bunker, and they're being threatened? CAVE OF COURSE! Nothing bad could happen right? It's important to save three lives vs 300 million right? RIGHT?",
      "total_reactions": 0,
      "user": "RadarE33"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "I just watched on demand and this is totally the worst film I have seen in a decade. I watched right through 'til almost the end when \"the President\" gives a speech that is laughable, really embarrassing. Had to turn it off right then. It just breaks my heart that millions of dollars were wasted on this unoriginal and really silly premise. The writer(s) should be ashamed. The dialogue was simply dreadful. What a waste.",
      "total_reactions": 0,
      "user": "TheKiddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2013
      },
      "score": 1,
      "text": "I give this a one because of the fight scenes  they were done well. But the rest of the film was a silly, stupid, inane pile of doo-doo. There were some great actors, but they had nothing to work with, as the story is so paper thin, there is barely no character development at all. If you're looking for a really cheap thrill, then this is your ticket, but otherwise stay away. There are plenty of other action films that don't insult your intelligence like this film does.",
      "total_reactions": 0,
      "user": "jetbrown"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2014
      },
      "score": 2,
      "text": "The most generic, Americanised crap action movie ever. Yes OK it's all action and seems big budget, but the story and character development couldn't be any more generic. I simply cannot understand why anyone would watch this over playing a CoD game. It's predictable, run-of-the-mill and completely uninteresting. You've seen it before, and seen it done better. If you must watch a dumb American action film with lots of killing, watch the original Die Hard instead.",
      "total_reactions": 0,
      "user": "sinadoom"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "Olympus Has Fallen is the latest big budget action film from revolutionary Director, Antoine Fuqua. The film has a ton of stars and some great effects, but unfortunately it is very similar to a popular action classic. All is well in Washington, as the President prepares to meet with a delegation from South Korea. All of a sudden the capital is attacked and the White House is taken with some very important people still inside. The task of getting them out alive falls to one man, Secret Service Agent, Mike Banning (Gerard Butler). If you took the cast of the original Die Hard and had them re-shoot the movie, scene by scene, at the White House, you'd have Olympus Has Fallen. Normally I find Fuqua's take on the action genre, refreshing and original, but you wouldn't know it by watching this film. It is freaky how similar this film was to Die Hard, they even have some of the same twist, goals, types of terrorist, all that's missing is a short fat cop and a hand radio. Don't get me wrong, I did find the movie entertaining and Gerard Butler has really stepped up and taken the reigns as the lead you want in your action film. The effects are terrific and unlike Die Hard, this film has a ton of big named stars in it, that really do give the film some teeth. Olympus Has Fallen was a great idea, with a ton of stars, and the right Director. The film made a ton of money and gave us action junkies the edge of your seat entertainment we crave. If you saw Die Hard though, you're going to find many of the scenes familiar to the point of being ridiculous.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "I'm looking at the 41 metacritic on this movie and I'm not seeing why the score is that low. This is basically the darker and grittier version of Whitehouse Down. It's a solid action movie, and because it's R they shout **** a lot and there's a ton of headshots. It's grand if you're just wanting an action feature.",
      "total_reactions": 0,
      "user": "Lokathor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "Action movies can be good when there is also a plot going on, but this movie completely fails at this. The flimsy story is a secondary attraction to the non sop gun shooting and explosions. It is incredibly boring to watch.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "Olympus Has Fallen is an effective action movie. It's humorous, the lead character is immensely likeable, and the action delivers. Lower your standards a little for this and you'll have a good time.",
      "total_reactions": 0,
      "user": "Seriosity"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "\"Olympus Has Fallen\" exhausts itself even without the burden of originality. The White House is under attack, and John McClain still isn't available  he is still recouping from his recent disastrous installment to the \"Die Hard\" franchise. Everything in this movie, credited to writers Creighton Rothenberger and Katrin Benedikt, is seemingly directly taken from the action classic \"Die Hard\" (1988). Having a man on the inside is one thing  but to the bumbling idiots in authority, the rooftop adventure gone bad, the hero mistaking a bad guy for a good guy... it's a hostage movie alright, a storyline almost completely lifted from the 1988 classic starring Bruce Willis.",
      "total_reactions": 0,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "Decent action and effects. Acting is okay. Plot is ludicrous and the way the Secret Service and the Capitol Police were portrayed were... unbelievable and ridiculously stupid. Some of the effects were very obviously fake but thankfully only some since most were done fairly well.",
      "total_reactions": 0,
      "user": "Toffenuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2016
      },
      "score": 1,
      "text": "If you had any doubts that the US government forces are staffed by stupendous incompetent fools then this movie will dispel them easily as a rag tag band of Korean fanatics succeeds in overrunning the White House using the amazingly effective tactic known as frontal assault. Granted they have some inside help, but only a bunch of sheer incompetents would have failed to defend against it.",
      "total_reactions": 0,
      "user": "MeritCoba"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "A straightforward predictable action movie. Think of all the action cliches known to man, now throw them all together and restore Aaron Eckharts' face. You have Olympus Has Fallen. Not boring, but not exciting. Morgan Freeman and Aaron Eckhart do provide some relief from all the explosions and gunfights by giving good performances. But it's not enough to save the whole 2 hour movie",
      "total_reactions": 0,
      "user": "python2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "Olympus Has Fallen is a perfect blend of annoying and violent. To even prompt basic enjoyment out of this flick you will need to suspend disbelief by a crane, forget anything you know about technology, and sit casually by as practically all good sense gets trampled. If you are ready to balance a whole lot of mediocre on the head of a pin without expecting a collapse, this movie is for you.",
      "total_reactions": 0,
      "user": "ErrorTheRealist"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "Better than it has a right to be, given the outlandish plot, and the fact that the entire security force of the White House is shot to pieces, but our lonegun hero barely gets winged. The cast is uniform as they go through their paces, the ever resourceful Gerald Butler, the gruff Prez Aaron Eckhart, the stalwart temp Prez Morgan Freeman, and so on..nice to see Melissa Leo and Robert Forster (doing his best Robert Loggia) in supporting roles. And the action is well directed, and Mr. Fuqua keeps the tension well placed throughout. Just look out for giant screaming cliches (not one, but two machines of extreme destruction), and an out right steal from the Die Hard playbook, the bad guy posing as good. And do you think Butler saves the world with only 3 seconds to spare??? Don't hurt yourself guessing...",
      "total_reactions": 0,
      "user": "jamess"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 4,
      "text": "Butler is a good actor but the plot makes suspension of disbelief impossible, the action has nothing special and the ending is very predictable. Prefer to watch the Die Hard trilogy again.",
      "total_reactions": 0,
      "user": "Dimitris01"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "Good cast, really one of those action movies thats a \"one man army\" deal but then again it has good action scenes, pretty good concept idea, I didn't mind it all, the average action movie junkie would be enticed, and wet their whistle with pro America, pro government clichés. Americans would most likely dig this movie, I'm not American but i did enjoy it. definitely worth a watch.",
      "total_reactions": 0,
      "user": "Mk_Ultra"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "Antoine Fuqua's back catalogue is a bizarre mixture of intelligent film-making and mindless, yet enjoyable drivel. Olympus Has Fallen is firmly rooted in the latter, foregoing any smarts it could have had and coming out the other side as a ridiculously overblown action movie that I tried hard not to like, but was tough to completely resist.",
      "total_reactions": 0,
      "user": "HansFlicks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "If your a action buff your enjoy it but if you want a serious movie don't waste your time watching it because your wont enjoy it. Cheesy plot decent action and typical over the top bs type action scenes.",
      "total_reactions": 0,
      "user": "lobones0033"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "A decent class B action movie from the mid-90's. In 2013  looks like a pure comedy, really, except for some  propagandistic and dangerous moments (Middle-East celebrates the attack on the White House, Russia and China mobilize their forces, etc.). Brainwashing at its worst. As to the action, it's not bad, but too many violence and desintegrated civilians (to provoke the righteous anger among the audience, I guess). The rest is cliche, cliche, cliche. Cliche again. And again...And continuous insult on the common sense. Just to name the few (of quite a many)  cargo aircraft shooting down the F-22 interceptors, transport helicopters storming the AA emplacement, elite White House security guards  brainlessly rushing on machine guns, the apocalyptic Cerberus device, DETONATING, not just destroying, all nuclear warheads (what's the point of creating such a system, except for turning USA into the nuclear wasteland???), the top-secret military protocol, of which even North-Korean terrorists are aware up to details...Well. This movie's worth of a single run, but I urge you not to take it seriously. And I'm really disappointed in Morgan Freeman, who I did respect very much, especially for the quite intelligent \"Through the Wormhole\" series.",
      "total_reactions": 0,
      "user": "Tatarus33"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "This one has its problems.  The story drags at parts and a lot of the performances are underwhelming.  However, I dug the story, the action is decent and the movie has a great villain.  The film lacks a certain \"wow factor\" that other action films have but it's not a bad view.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "This was actually a lot better than I expected it to be. It had a lot of bloody violence, and the survival count of people that were taken hostage was 4. This was good fun, but definitely not for the squeamish.",
      "total_reactions": 0,
      "user": "AVTRlover41"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "HaHa North Korea so funny!",
      "total_reactions": 0,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "Overly dramatic; been there, done that. Yet, I sat through it fully entertained. Another movie suggesting that the White House has the security level of a fast food chain.  Butler knows action like Freeman knows drama. I do not particularly enjoy movies with unrealistic plotlines, but a strong cast certainly made the difference in this one.",
      "total_reactions": 0,
      "user": "film_bug"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "An idea clichéd to a point of no return, and acting (Freeman is pardoned, as is Eckhart), and the Koreans, rogue or not, are in no shape or form, threatening to us. The story itself destroys any creativity, and all the devastation cannot be recuperated from in just one day. There isn't really a happy ending out of all the people who died to save one man, and it's a disgrace that they even try at an optimistic conclusion for the waste of time and filming this movie took from Freeman and Eckhart, the only decent actors in the film.",
      "total_reactions": 0,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "The script is lazy and stupid with huge plot holes just to support the story and \"drama\". It seems like a good action movie only because of all the mass murdering at the attack. Then it had the chance to be a Die Hard remake but failed it. It's only merit that the evil terrorist guys wasn't Muslims this time.",
      "total_reactions": 0,
      "user": "HUNbullseye"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "This is one wild ride! It will be too much for some people (too much noise, too much blood, etc etc) but that's okay. If you're able to suspend your disbelief, Fuqua's pacing zips along so fast that you bounce over the plot holes. It's like a roller coaster you'll want to get back on as soon as it's over. Butler, Freeman, Basset, Eckhart, et al are terrific!",
      "total_reactions": 0,
      "user": "Firebala"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "Wow. After seeing both White House Down and Olympus Has Fallen, I can confidently say that though the idea is the same of terrorists taking over the Whitehouse, both directors (Roland Emmerich and Antoine Fuqua) made the movies extremely different.",
      "total_reactions": 0,
      "user": "AlexProductions"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Olympus Has Fallen is probably one of my favorite political thrillers of all time. The suspense, action, disaster sequences, likable characters, etc. makes for a solid film with little going wrong in it. A few \"why did they do that\" moments, with some tighter plot lines could've done the trick to make this better, but other than that, it hits the mark on all levels. This movie took me back to John McTiernan's 1988 action thriller \"Die Hard\". This movie had all of the Die hard characteristics we all know and love, and in my opinion, was better than the newest installment to the series! Unlike that film, this movie had tight spaces, a lone ranger in a hostage situation, and even went lengths to feature one of the villains pretending to be a good guy, and is offered cigarettes, just like in 1988. Gerard Butler puts on a solid performance, and leaves me wanting more. A bunch of witty one liners are packed into a superb script by Creighton Rothenberger and Katrin Benedikt. My favorite line: \"Here's a game we can play. It's called \"Go F**k Yourself\". You go first.\" A couple of funny moments and much drama and action make this an excellent thriller. And, to top it off, this movie has Morgan Freeman. Plus!",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "First, let me say that I truly enjoyed this movie. It was fun, fast paced, and overall filled with some fun twists and turns. The characters are interesting, and decently developed (i.e. they won't win character development awards but they are believable in the movie's context).",
      "total_reactions": 0,
      "user": "R4z3r"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "What are Gerrard Butler and Morgan Freeman doing in this movie?",
      "total_reactions": 0,
      "user": "Tarzan1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "Gerrard Butler, I salute you! Both Butler and Freeman make this an engaging, fast paced action movie work well.  Contrary to many incredibly intelligent reviewers (:D) I'm not of the opinion that every element of a movie should conform to the realms of plausibility  If only insurgency operations were executed as well as this! I'd like to agree with a few reviews that strike resemblances to the 80's action movie era, to any movie lovers who say all to often \"They just don't make em like they used to\".. it's worth a watch, and it's on Netflix!",
      "total_reactions": 0,
      "user": "k0ng"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2013
      },
      "score": 2,
      "text": "Olympus Has Fallen is a very horribly inaccurate movie that does not really make much sense how 40 north koreans can do that.  This movie had an AC-130 flown by North Koreans  just fly over Washington D.C. and the Air Force did not intervene until they were almost over the White house. Then the North Koreans had codes to SELF DESTRUCT/DISARM America's nukes not detonate (which is a difference) And had the U.S. pull all the troops out of the DMZ.",
      "total_reactions": 0,
      "user": "bryce7454"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2013
      },
      "score": 9,
      "text": "Very good acting, & great movie.",
      "total_reactions": 0,
      "user": "Peque93"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "Intense, action packed and fun, Olympus Has Fallen is a brilliant outing from director Antoine Fuqua and a treat for moviegoers seeking an entertaining blockbuster.",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2013
      },
      "score": 4,
      "text": "Well, that movie was a disappointment.  The potential was there for a good movie, the relationship with the President was well done, the lead character was believable and the attack on the White House was clever enough to suspend your disbelief.  And then it all fell apart terribly.",
      "total_reactions": 0,
      "user": "highlander_"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "Olympus Has Fallen short of a great finale. For the last scene reveals an incredible disrespect of tempo, form, and reality. Where is rhe Medic when you need it? Shouldn't the good all boys of the EMS had arrives to take care of the President rather than the President walking all the huge distance from the steps of the House to the ambulance?  Those last ten minutes makea the great movie that it was unsummonarble. There gpes another great movie down the piles of failure in the last secuence. One Star for that horrendous finale.",
      "total_reactions": 0,
      "user": "Metakrilato"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "text": "This film borrows heavily from Die Hard. It's about Gerard Butler, a Secret Service agent who acts as an inside man to stop a terrorist attack. Overall, this movie is well-acted, intense and enjoyable (which is enough for action junkies with little standards or expectations). For demanding viewers, skip this film.",
      "total_reactions": 0,
      "user": "kaizidokiller"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2014
      },
      "score": 5,
      "text": "Typical for Hollywood.. Countless other examples of action hero films that are much better than this one. I would recommend you to miss this film, not worth watching. I don't think there's much to explain about this film. Dull and trite, president in danger, one man army, saves president, happy ever after.. I would recommend you to walk out on this one. Adequate acting, but the main issue with the film is how it was executed and it's cliche plot. This film would have been better if the plot was original.",
      "total_reactions": 0,
      "user": "NickOrrey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2015
      },
      "score": 1,
      "text": "Actually thought I might like this movie since it was a moderate hit and I loved movies of this type like the classic \"Die Hard\" and the excellent \"Executive Decision\".  However, I had no idea it would be a cartoon which was immediately apparent from the start.",
      "total_reactions": 0,
      "user": "AxeT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "Simply the worst movie ever in the history of human kind.  I even made this account just to write about the magnitude of garbageness this movie was able to present.  Every scene is unrealistic and farcical to the maximum extent and as an American, I was truly distressed.  Frankly, I wanted to stop watching after the first 15 minutes but I had to see the terrorists get castigated so ended up seeing the whole movie in great dismay.  Hence a caveat, don't watch this movie.",
      "total_reactions": 0,
      "user": "uj3680"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "Don't be fooled, I waited a long time to watch this movie.  I looked and saw the ratings thinking it would be just an average movie-believe me the ratings are messed up.  Not sure why viewers weren't rating this movie higher.  Mind you this movie wasn't up for any Oscars nor should it have been, but still if you love non-stop over the top action then this is the movie for you!!  Based on current affairs this movie makes you think a little about waht could happen if we were under siege.  As a citiizen we just don't know how fallible our white house is??  Hopefully they would put up more safe guards than they did in the movie.  That said remind yourself this is a movie and yes some of the content was over the top, but I still give it a 9 because of the actors and the actresses involved, and for the top notch edge of your seat action.  Don't make the same mistake I did, if you haven't seen it give it a try.  Now I am all set to go see the sequel out in two weeks!!!!!!  I can't wait....................",
      "total_reactions": 0,
      "user": "horizonbts"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2015
      },
      "score": 4,
      "text": "If you really suspended disbelief you can kind of  go along with this movie. But it suffers with just poor script decisions such as plot, dialogue ect. it is very predictible, and well... stupid.",
      "total_reactions": 0,
      "user": "AaronDWasserman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2015
      },
      "score": 10,
      "text": "...............................................................................................................................................................................................................A Die hard in white-house but is great....",
      "total_reactions": 0,
      "user": "raciocinio"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2015
      },
      "score": 10,
      "text": "....................................Gerard Butler always do a great job behind the camera,as well as Aaron Eckhart and Morgan Freeman is clear that seems like Die Hard in white house so What.",
      "total_reactions": 0,
      "user": "sicrano"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2016
      },
      "score": 4,
      "text": "I wanted to place this review for placing London Has Fallen a review. So far the cheesiest backstory I've ever seen for a 2013 movie. At least it was better than London Has Fallen.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    }
  ]
}