{
  "mc_avg_user_score": 7.9,
  "mc_metascore": 38,
  "mc_mixed_rating_frequency": 34,
  "mc_movie_name": "Ouija",
  "mc_negative_rating_frequency": 74,
  "mc_positive_rating_frequency": 342,
  "mc_pro_critic_reviews": [
    {
      "critic": "Odie Henderson",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2014
      },
      "score": 75,
      "summary": "In the current economy, Monopoly makes a more appropriate board game upon which to base a horror movie, but for what it is, Ouija is better than expected."
    },
    {
      "critic": "Simon Abrams",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2014
      },
      "score": 70,
      "summary": "First-time director Stiles White's effective use of long takes and director of photography David Emmerichs's wide-angle digital cinematography make an otherwise generic teen ghost story unexpectedly atmospheric."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2014
      },
      "score": 70,
      "summary": "Ouija is confident, meat-and-potatoes horror, and that’s a lot harder to pull off than it sounds."
    },
    {
      "critic": "Farran Smith Nehme",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 63,
      "summary": "It’s endearing how this glorified haunted-house movie tries to reclaim all the old tools, and do so with a straight face and a PG-13 level of violence."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 60,
      "summary": "Given its double burden of being both a toy adaptation and a bloodless kiddie horror show, Ouija winds up being more fun that you might think, even if it's the sort of film you can't really take seriously for a second."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 50,
      "summary": "Though Ouija starts off evoking a nicely eerie atmosphere of dread, it ultimately goes too far, making the liminal space between the spirit world and this one all too eye-rollingly literal."
    },
    {
      "critic": "Kimber Myers",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 50,
      "summary": "The film is effectively scary, filled with plenty of jump moments and a few slow-burning scenes, but the scares aren’t enough to balance the poor writing and lack of imagination."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 50,
      "summary": "This silly but straight-faced supernatural thriller manages to elicit an occasional shudder in between cheap jolts and false scares, emerging as a feat of competent direction (by debuting helmer Stiles White) over derivative scripting (by White and writing partner Juliet Snowden)."
    },
    {
      "critic": "Kyle Anderson",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2014
      },
      "score": 42,
      "summary": "Within the pungent field of other wide-release scare jobs and films derived from cardboard-based time-killers for kids, Ouija stacks up relatively well, thanks to its look and a confident performance by Cooke."
    },
    {
      "critic": "Katie Rife",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 42,
      "summary": "It’s professionally produced but completely uninspired."
    },
    {
      "critic": "Andrew Frisicano",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2014
      },
      "score": 40,
      "summary": "It says a lot that the grossest moment involves a character flossing—no gag, just flossing. Likewise, the candy stuck in your teeth will be the only thing that lingers after the credits roll."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 40,
      "summary": "The most pressing issue with Ouija is that Stiles and Snowden cannot seem to write a single interesting line of dialogue. They volley between conversational banalities and whatever exposition might be needed to get the film to its next scary setpiece."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 40,
      "summary": "Cooke, a young Brit seen on TV’s “Bates Motel,” is strong as the diminutive brunette at the center of the interworldly fright-fest. Her charisma is almost enough to keep you from rolling your eyes at the script."
    },
    {
      "critic": "Brad Wheeler",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 38,
      "summary": "It is harmless, frighty fun for teenage audiences, but adults will leave theatres with their bejeebers intact."
    },
    {
      "critic": "Kevin C. Johnson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 38,
      "summary": "Directed by Stiles White, whose credits lean more heavily in the special-effect arenas, Ouija is bland, safe horror for those who like their scares nonexistent."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 30,
      "summary": "The ghost scenario that this boring, CW-ready, \"Scooby-Doo\" gang uncovers isn't nearly as shocking as the blasé attitude they have toward friends dying off."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 30,
      "summary": "What Ouija lacks in wit and originality, it makes up in volume — a trademark of the “Transformers” director Michael Bay, who is one of the producers."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 30,
      "summary": "In the absence of anything truly original in the screenplay he co-wrote with Juliet Snowden, director Stiles White vainly attempts to ratchet up the tension with a series of cheap jump scares fueled by loud noises that are the cinematic equivalent of shaking hands with someone wearing a joy buzzer."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 25,
      "summary": "A deadly dull and overly familiar movie about summoning ghosts that draws upon nearly every horror movie cliché."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 25,
      "summary": "Ouija has something wrong with it from the first five minutes."
    },
    {
      "critic": "Eric Henderson",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2014
      },
      "score": 12,
      "summary": "The film consistently settles for the cheapest shock devices and the most shopworn totems of our current neo-gothic moment in the genre."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2014
      },
      "score": 11,
      "summary": "Hasbro’s long-lasting occult board game gets its own starring role in a film that makes those other recent Hasbro plaything adaptations – namely \"Transformers\" and \"G.I. Joe\" – look like triumphs of subtly engineered cinematic magic."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 17,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "Outing has atmospheric scares in every jump scene. The movie is low on gore because it is PG-13 but the movie didn't have to be rated R and gory to achieve its thrills. The acting isn't oscar worthy but that is because the movie features young actors who serve their purpose. The actors haven't starred in many movies but a thriller such as this doesn't require world renowned actors. There are enough jump scenes in this movie if you are into that in a horror movie. I thought I would enjoy this thriller and I did. I expected it to be creepier and more psychological than it is. The trailer lead me to believe that the movie would be creepier and gorier. I was disappointed overall with the movie but it is still worth a viewing. Ouija sends creepy vibes to the viewer and there are some neat tricks that the director used in the movie. The characters are lead astray and once they are tricked this leads to their demise. A decent thriller with some drawbacks but no flaws that impair the enjoyment of the movie.",
      "total_reactions": 18,
      "user": "Propensity862"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 19,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Now I'm not the biggest fan of scary movies but I rather enjoyed this film. There was not a lot of gore, it was mainly things popping out of no where scares which I enjoyed. This film is better then the critics say.",
      "total_reactions": 22,
      "user": "JRichey13"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "The acting is not that bad and the movie had great ideas but he just falls in the clichés.The characters are all stereotypical and the movie is basic.But,somehow,the movie kept me entertain.",
      "total_reactions": 15,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "I have to admit I didn't see the twist coming, but everything else about the plot is unsurprising and predictable. It's not really a get-under-your-skin, make-you-afraid-of-the-dark kind of scary movie, relying more on jump/surprise scares than overall creepiness and scariness. Acting was okay. I don't recommend this.",
      "total_reactions": 3,
      "user": "Toffenuff"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "Terrifying, but terrible, Ouija is just another typical horror movie, with an unoriginal topic and phony acting, although it did hit it big in the box office..",
      "total_reactions": 3,
      "user": "TotallyEpicHD"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2014
      },
      "score": 1,
      "text": "I wouldn't call this the worst horror movie I've ever seen, but it's one of the worst of the year. There are countless jump scares, none of which were original or effective, and there was no suspense. The plot was also pretty predictable. The final act especially seemed very rushed and convoluted. This is the kind of movie that should only be watched at slumber parties.",
      "total_reactions": 18,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2014
      },
      "score": 0,
      "text": "This is the worst movie I have ever seen in my life. The actors were terrible, and the dialogue was worse. It was as if a bunch of high school children were given a large budget to produce a horror movie. It was completely amateur. There were no scares, the production value was horrendous, and the plot twist could be seen from outer space. I just hope everyone involved with this project is able to recover and continue having careers.",
      "total_reactions": 6,
      "user": "terrence0258"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2014
      },
      "score": 0,
      "text": "This was a terrible horror movie. It was predictable, boring, and cliche filled. There were little to no scares and the acting was pretty bad and the movie was just unoriginal.",
      "total_reactions": 6,
      "user": "thetvreviewman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "This is a joke right?, we just had a good horror movie called The Babadook, and now we got this mind finger of a movie.",
      "total_reactions": 2,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2015
      },
      "score": 0,
      "text": "The definition of what is wrong with horror films these days. What a terrible film! So cheap, so cheesy and unoriginal. This movie is only jumpscares and loud sounds, thats not scary its just a loud thing popping up! It's like they didn't even try, this film is a just a pure hollywood cash grab for dumb kids who don't know a thing about movies and only wan't to jump a couple of times. I don't usually rant about movies, but this is just an obvious case of Hollywood robbing people.",
      "total_reactions": 2,
      "user": "Urbanlistener"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2016
      },
      "score": 0,
      "text": "A horrible, awfully made, unscary horror film!!  It is filled with many false jump scares, awful special effects, and a awfully stupid twist ending!!!  Avoid this garbage!!!",
      "total_reactions": 2,
      "user": "Dyliebar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2016
      },
      "score": 0,
      "text": "I AM SICK AND TIRED OF JUMPSCARES!!!!!!. Jumpscares are cheap and lazy. If you like loud stupid noises that make you jump and are ridiculously stupid. You will love this movie but for most of  us its trash. Wait im not even done the acting in this mf is so damn bad, the story is bad, the makeup looks so fake, and boring characters that act dumb bc its a horror movie so everyone has to be stupid. One of the worst movies ever made.",
      "total_reactions": 2,
      "user": "MOVIECRITIC315"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "It is absolutely ridiculous and light. Despite, Ouija is an entertaining B movie, that you can stream online, with your friends on a Friday night, where you can also connect it to your TV and watch it with popcorn shuffled in your face.",
      "total_reactions": 5,
      "user": "HaithamB"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "From the writers Stiles White & Juilet Snowden writers of ' The Posession' and Boogeyman you think it maybe a good horror movie but i stand corrected it is. Even though it is confusing and it has some good scares and accidental scares by the characters friends which is the main problem about this movie also the characters and their idiotic choices between playing with Ouija board. In 2012 White and Snowden wrote The Posession which was a mixed attention from critics despite that fact that they did NOT control the rains to make a horror movie Posession was not scary in Ouija they controlled it elements of scares Ouija tries and tries to be the bigger thrills to bet the scary movies to come out in the past like Insidious.",
      "total_reactions": 6,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "This movie was one of the best movies of the year. Good old fashioned scares, suspense, and thrills. One has to wonder if the critics even saw the movie with the scores they gave. I was connected to the actors and to the point that in the first 15 minutes one of the actors was killed and it brought a tear to my eyes. You dont see or feel that way about most movies these days. Great Job well performed and acted. Its a must see movie that fits the time of year. But can be watched anytime.",
      "total_reactions": 14,
      "user": "bigfoot6463"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "Its good movie with a good script. Thumbs up for all the young actors. You did an amazing job guys. All the scenes was captured perfectly.  I'd love to watch it again and again :)",
      "total_reactions": 18,
      "user": "zainnaeem"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "\"Ouija\" 10 Scale Rating: 3.5 (Terrible) ...",
      "total_reactions": 8,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2015
      },
      "score": 2,
      "text": "Made from the ground up to take the money of the teenage date crowd. Every horror movie cliché is present. The locations, the deaths, and the jump scares all give it a \"been there, done that\" vibe. It's not scary in the slightest. Every now and then a movie like this will at least be mindlessly entertaining, but that isn't the case here. You've seen all this movie has to offer before and it was way better then. This is definitely for the young and the dumb.",
      "total_reactions": 4,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2015
      },
      "score": 2,
      "text": "If not the worst horror movie I've ever seen,it's probably in the top twenty for the worst movies I've EVER seen. Bland, boring, and uninteresting, this movie is riddled with poor performances and non-scary, cliche jumpscares.",
      "total_reactions": 4,
      "user": "NinthDoctorGuy"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "Otra película de terror que ofrece mas de lo mismo, cargada con un guion con huecos argumentales y demasiados errores, actuaciones medias y screamers baratos. No gastes tu tiempo y dinero en esto",
      "total_reactions": 8,
      "user": "JohnMasterL"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2015
      },
      "score": 2,
      "text": "I've wasted a few bucks to see Ouija or whatever the hell this thing really is. What's next Jem and the Holograms? Something tells me in my stomach that this movie has Michael Bay all over it. And it was (not as a director). I watched the movie and I fell asleep because the movie isn't that even scary at all. The casts was just playing a board game and then some strange monsters coming to haunt them. This is stupid. The dialogue, the acting, it's terrible. Does anyone remembers Witchboard from the 80's? I haven't seen that s**t in years. People should buy this movie out, awesome horror movie. As for Ouija? A poor excuse of yet another half-assed Hasbro movie based on the board game we truly remember.",
      "total_reactions": 4,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "The film is fairly well made with some decent scary moments, problem you've seen it all before and at a better level.  The characters you don't care about at all,  frankly by the end of the film the characters don't even care about their friends dieing.  I like Olivia Cooke in Bates Motel and she's fine here for what she has to do. Also if you think about the final twist it really doesn't work.  This film is a poor man's Insidious or Conjuring.  C-",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 2,
      "text": "A horror movie with no scares, no suspense, no thrills, no intrigue, terrible writing, terrible acting, and to top it off, none of it even make sense. I thought Annabelle was the worst horror film of 2014 but Ouija may overtake that title.",
      "total_reactions": 3,
      "user": "SolInvicta"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2016
      },
      "score": 1,
      "text": "One of worst horror films i have ever watched",
      "total_reactions": 1,
      "user": "JuanLuisGG14"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2015
      },
      "score": 2,
      "text": "One of the laziest horror films I have ever seen. Not only is the premise cliche the film feels like one massive  cliche after another until you get to the predicable cliche horror ending.  Not a single part of this film felt original it was a bunch of **** I have seen before just done worse.",
      "total_reactions": 2,
      "user": "AnarchyAus"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "Ouija is arguably my favourite movie of all time, rivalled only by Battle: Los Angeles and the Shrek trilogy. For what Ouija lacks in originality, it makes up for with a flawless plot line and endless jump scares that had me clutching my friends throughout the entirety of this showpiece. Some of the best acting i've ever seen, particularly the protagonist Luigi whose acting left me anxious, terrified and curious to watch more - the emotions I simply can't explain. Many people critique the quality of acting in Ouija - it's clear that these people are ignorant, unable to grasp the complexity and skill required to perform such parts as Debbie whose entire group of best friends are slowly killed by Luigi",
      "total_reactions": 1,
      "user": "phayes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2015
      },
      "score": 5,
      "text": "first of all the script had a big hole in it the old lady asked the girl if they play in a graveyard in the girl nodded her head yes when there is NO graveyard scene whatsoever in this movie the only rule they broke was not saying goodbye when they were done playing.  this movie is full of Cheap jump scares and is not really tension building for the dumpster happens it's like watching the remake of a nightmare don't see all over again that this one has a dead girl pumped with evil spirits.  after the  first séance scene the movie falls the part.",
      "total_reactions": 0,
      "user": "YoutubeTGW"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2016
      },
      "score": 5,
      "text": "The last two-thirds of Ouija is surprisingly entertaining, although in the 'cheap jump scares done with pretty actresses' kind of way. The film is a mess, but it knows it and makes the most out of it.",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "Ouija, si bien no es la película de terror del año, al fin y al cabo resulta interesante y de cierta forma un tanto atrayente.",
      "total_reactions": 0,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2016
      },
      "score": 0,
      "text": "Do not...I repeat...do not waste any time or money on this so-called horror movie.  It started off well enough and the final 15 minutes was like \"Well, how do we end this?\"  Ok, boyfriend comes swinging down from the rafters, rope around his neck.  Call the police?   No, let's stay in the house, look for little sis and ultimately have the older daughter stab mom.  Stupid stupid ending, and I felt ripped-off.  How this travesty was allowed to be released is beyond comprehension. First half hour was engaging...last half hour was garbage.",
      "total_reactions": 0,
      "user": "wadewilliams"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "It was another typical teenage horror movie. Same old formula but it was decent even though it was mediocre.",
      "total_reactions": 0,
      "user": "jinannn31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2016
      },
      "score": 6,
      "text": "worth the watch, some good scares, the ouija board has been in this world for so long with a scary backstory and this is the first movie that puts this in the premise. in an okay way..-",
      "total_reactions": 0,
      "user": "voxotto"
    }
  ]
}