{
  "avg_user_score": 7.0,
  "metascore": 65,
  "mixed_rating_frequency": 30,
  "movie_name": "Ouija: Origin of Evil",
  "negative_rating_frequency": 11,
  "positive_rating_frequency": 57,
  "pro_critic_reviews": [
    {
      "critic": "Sam Fragoso",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2016
      },
      "score": 90,
      "summary": "Equal parts horror masterclass and internal home-invasion thriller, “Ouija” is as chilling and nerve-racking as they come. It’s a sort of cinematic heart attack — irreparably damaging to the body and mind, with a slow recovery time."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2016
      },
      "score": 80,
      "summary": "The director, Mike Flanagan, who with Jeff Howard also wrote the script, demonstrates rare patience for horror fare as he builds toward the macabre."
    },
    {
      "critic": "Randy Cordova",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2016
      },
      "score": 80,
      "summary": "If anything, the movie's third act is the only thing that feels a bit a disappointing. The plot is carefully constructed, the performances are rich (both girls are excellent), the characters are believable and a sense of dread grows throughout. Heck, the movie is even great to look at, with its period sheen and slightly muted colors."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2016
      },
      "score": 80,
      "summary": "Infused with psychological complexity and nuanced characterizations, Ouija: Origin of Evil falters only in the final section."
    },
    {
      "critic": "Odie Henderson",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2016
      },
      "score": 75,
      "summary": "This is one overstuffed horror movie recipe, with a dash of “The Exorcist” and a spritz of “Ghost” among its tasty ingredients."
    },
    {
      "critic": "Calvin Wilson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2016
      },
      "score": 75,
      "summary": "Timed for the Halloween season, Ouija: Origin of Evil should have horror fans clutching their seats."
    },
    {
      "critic": "Katie Rife",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2016
      },
      "score": 75,
      "summary": "Flanagan has a couple of solid genre films on his résumé already; at this point in his career, it would have been surprising if Origin Of Evil wasn’t better than Ouija. It is better, though, in every conceivable way, from casting to story to atmosphere."
    },
    {
      "critic": "Randall Colburn",
      "publication": "Consequence of Sound",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2016
      },
      "score": 75,
      "summary": "Flanagan’s scares are so precise, so exquisitely timed, that they’re able to imprint the mind as much as quicken the pulse."
    },
    {
      "critic": "Kate Erbland",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2016
      },
      "score": 75,
      "summary": "“Ouija” is genuinely frightening and smart, the rare horror prequel able to stand on its own merits and deliver a full-bodied story that succeeds without any previous knowledge or trappings. However, in outfitting this particular haunted house with monsters to spare, Flanagan loses the thread of what’s really scary: Everything we can’t see."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2016
      },
      "score": 70,
      "summary": "Like The Conjuring and the many immersive spook-house thrillers inspired by it, Origin of Evil demands and rewards attentiveness, inviting scrutiny of its frames, study of its negative space."
    },
    {
      "critic": "Kim Newman",
      "publication": "Screen International",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2016
      },
      "score": 70,
      "summary": "Origin of Evil doesn’t stretch the conventions of teen-appeal spookiness too far, but is solidly put together, mounted with a pleasant conviction and runs to several fine performances and some decent scares."
    },
    {
      "critic": "Geoff Berkshire",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2016
      },
      "score": 70,
      "summary": "After an hour or so spent establishing characters worth caring about, the narrative starts to devolve, and the more the film circles back to the mythology of “Ouija,” the sillier it gets. Much like the characters at its center, this prequel can’t outrun the ghosts of its past."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2016
      },
      "score": 67,
      "summary": "Not so much horrific as it is just skeletons-in-the-basement creepy, this is a shuddery fun surprise for horror fans, who by the way should stick around until the closing credits are done for a special (if inevitable) trick or treat."
    },
    {
      "critic": "Brad Wheeler",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2016
      },
      "score": 63,
      "summary": "This is a prequel superior to its predecessor – we’re not bored with board-game ghoulishness yet."
    },
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2016
      },
      "score": 63,
      "summary": "While it's not entirely successful, this stylish shocker is a big step up from the earlier film."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2016
      },
      "score": 63,
      "summary": "Reaser, Thomas, Basso and especially the demonically playful Miss Wilson play the Mike Flanagan, Jeff Howard script like a fiddle."
    },
    {
      "critic": "Katie Walsh",
      "publication": "The Seattle Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2016
      },
      "score": 63,
      "summary": "For a horror sequel built around a foundation of genre trends, Ouija: Origin of Evil contains far more goofy-spooky fun than one might expect."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2016
      },
      "score": 63,
      "summary": "The film complements its goose-pimply frights with an unabashedly naked emotional gravitas."
    },
    {
      "critic": "Edward Douglas",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2016
      },
      "score": 60,
      "summary": "Ouija: Origin of Evil offers some easy scares and cheesy fun, but if nothing else, it gets points for not losing sight of its characters amidst those scares."
    },
    {
      "critic": "Stephen Kelly",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2016
      },
      "score": 60,
      "summary": "Unlike the stock teenagers of Ouija, the Zander family are likeable and convincing. Scares are still rudimentary, but rooted in a sharper script."
    },
    {
      "critic": "Matt Donato",
      "publication": "We Got This Covered",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2016
      },
      "score": 60,
      "summary": "Ouija: Origin Of Evil would have been better than Ouija with even a quarter of the screams evoked, which makes the tremendous jump in quality quite refreshing despite derivative storytelling."
    },
    {
      "critic": "Mike McCahill",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2016
      },
      "score": 60,
      "summary": "It’s still no scarier than any branded content, and perhaps only the most lukewarm slumber party would truly need it. Yet if you were to ask whether Origin of Evil offers a better quality of timewasting than its predecessor, my finger would hover inexorably over YES."
    },
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2016
      },
      "score": 60,
      "summary": "Origin of Evil takes a while to get going, and the demonic possession plot pretty much runs on rails. And yet there’s plenty to admire here: strong performances (‘ET’ legend Henry Thomas is a welcome sight as a kindly priest), top-notch jump-scares and some unexpectedly lovely, almost ‘Far From Heaven’-ish autumnal photography."
    },
    {
      "critic": "Christian Holub",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2016
      },
      "score": 50,
      "summary": "Effective horror relies on the actualization of some deep-seated cultural fear, but Ouija: Origin of Evil supplies only ineffective clichés and half-hearted attempts at franchise building."
    },
    {
      "critic": "Michael Ordona",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2016
      },
      "score": 50,
      "summary": "There’s nothing unique about the setup. But Flanagan and Howard’s script has charming touches, wringing humor out of characters rather than gags. Even the retro opening title card foretells its self-aware sense of humor."
    },
    {
      "critic": "Jane Horwitz",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2016
      },
      "score": 50,
      "summary": "Ouija: Origin of Evil is, somewhat unexpectedly, not that bad."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2016
      },
      "score": 7,
      "text": "Lulu Wilson's excellent performance pulls this movie to thrilling highs. Ouija: Origin of Evil is yet another horror riding off the success of Lights Out & The Conjuring 2. An old-fashioned atmosphere set nearly 50 years earlier from the original. The film certainly works as a stand-alone story, but never quite reaches the standards of 2016 strong showcase of horror. Ouija arrives perfectly for Halloween; horror fans this is a must watch.",
      "total_reactions": 2,
      "user": "busbfran"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2016
      },
      "score": 10,
      "text": "Mike Flanagan is an excellent director and he clearly showed his talent in this creepy horror film, the performances were great and the visuals were pretty well done, I actually liked the third act I don't know why many people complained about it.",
      "total_reactions": 8,
      "user": "SalvadorBosque"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2016
      },
      "score": 6,
      "text": "It was OK movie overall.",
      "total_reactions": 5,
      "user": "MarioGR"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2016
      },
      "score": 3,
      "text": "So apparently the origin of evil starts in the 1960s for some reason, how terrifying. A mother and two daughters run a séance scam which becomes all too real when the youngest daughter is inhabited by a spirit. And by that I mean crawling on the walls, scarily whispering at people and sitting in front of the TV with whitened eyes and her jaw hanging open. You know the usual stuff. At some point the script for the movie clearly ran out and everyone decided to just wing it with a bit of improv, and if that wasn't bad enough you're bombarded with endless jump scares quickly followed by a cut to a black screen for \"dramatic effect.\" This works no problem in a trailer but not the movie itself. Not recommended, seriously not worth your money.",
      "total_reactions": 8,
      "user": "Rebecca31"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2016
      },
      "score": 5,
      "text": "Comparing this to its poorly-done predecessor, this is actually done and built better as just your average movie itself. As a horror, however, still not trying at it. Good backstory, but terrible horror sequences. Still better than its predecessor.",
      "total_reactions": 5,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2016
      },
      "score": 7,
      "text": "It has a nice vintage feel similar to both Conjuring films, but pulls a lot of influence from them, maybe almost too much. However it's still executed quite nicely with solid performances and some genuinely solid scares. They kind of rush the ending and leave it rather grimly depressing but that is what leads into the original Ouija film from 2014 i guess. There are some really cheesy parts strewn in but if you just look at it for what it is you should feel satisfied enough. Definitely another effective horror film of this rare outstanding 2016 horror year.",
      "total_reactions": 1,
      "user": "TryASummersault"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2016
      },
      "score": 6,
      "text": "I didn’t see the first Ouija movie, and I thought this one was supposed to be a prequel and explain things. On the contrary, I found it mystifying and with many plot holes. Would I have been able to fill them if I had seen the first movie? That said, I thought the film was very well done (even though I couldn’t quite understand what was going on or who was doing what to whom) – beautifully photographed, very well acted, and nicely paranoid. I just didn’t understand why.",
      "total_reactions": 1,
      "user": "GinaK"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2016
      },
      "score": 8,
      "text": "Ouija: Origin of Evil is justice for horror sequels, it's scary, disturbing, clever, well-acted and the best horror movie I've seen in a while. Maybe Mike Flanagan's finest work yet.",
      "total_reactions": 1,
      "user": "papeadojhon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2016
      },
      "score": 7,
      "text": "Talk about a franchise doing a complete 180. 'Ouija' may be one of the worst horror movies ever, but Mike Flanagan saves this franchise through the use of a genuinely unsettling atmosphere and authentic scares.",
      "total_reactions": 1,
      "user": "SolInvicta"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2016
      },
      "score": 8,
      "text": "OUIJA Franchise Is Manumitted by Mike Flanagan",
      "total_reactions": 1,
      "user": "PipeC"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2016
      },
      "score": 6,
      "text": "Good until a cheesy third act! This movie is well made from a technical stand. I really like how the director captures the 60s style, fashion and mood. The acting is solid, especially the little girl. She's sweet and creepy, all at the same time. The first hour presents a nice build-up, but then something happens to start the last 30 minutes and it throws the movie off track. It's not so much the event itself but how everyone around it responds to it in an unrealistic way and the movie just gets silly from there. Still, the good definitely outweighs the bad and the special effects are awesome!",
      "total_reactions": 1,
      "user": "sandborn"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2016
      },
      "score": 9,
      "text": "First and foremost, \"Ouija: Origin of Evil\" may very well be the biggest surprise hit, in my opinion, of the year. I went from writing off this origin story because of how bad the first one was. Then giving it some respect because the thriller/horror mastermind, Mike Flanagan, was tagged to it. Who, might I add, directed the hit-or-miss \"Oculus\" and made the fantastic Netflix exclusive \"Hush\" (Click here for my review of it). Now, I am here making this review, in love with this movie and now this series. Mike Flanagan masterfully created an origin story to a series that was so investing and so eerily creepy that it, at times, made my skin crawl. Story alone, this film keeps the audience so curious throughout the film until the very end when it hits you full force with consistent terror. This is not simply a jump scare movie, although it has its moments, I have just grown immune to them. I found the slow burn creepy actions and mannerisms far more terrorizing than an attempt at catching me by surprise. In a sense, the film toys with the audience as they expect to be scared but right when you think it may happen, it pulls off the trigger. A fantastic element of which I applaud Mr. Flanagan.",
      "total_reactions": 2,
      "user": "Oberrated"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2016
      },
      "score": 7,
      "text": "It seems I'm on a winning streak here in terms of horror movies: this is the third film in the genre I've been to see in the last few months that I can say I enjoyed. The characters in this film are all believable (for the most part) human beings with human emotions, reasoning behind their actions (though that doesn't mean they make the logical choice by any stretch), and problems.",
      "total_reactions": 3,
      "user": "GerardistheWay"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2016
      },
      "score": 9,
      "text": "one of the best horror movies i've seen from this year, plot is good and thick, there's enough action in the second half to keep you exited and keep the adrenaline up. the first half is a good explanation for what is going on since the first movie did not give that much of an explanation this wraps up all the loose ends! definetaly check this out and the first movie aswell.",
      "total_reactions": 1,
      "user": "voxotto"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2016
      },
      "score": 10,
      "text": "Why is this movie not in Cine 1? I want to pay the higher price to watch it again. It was so captivating that My wife, and I didn't even get through our drinks.",
      "total_reactions": 1,
      "user": "Justhinking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2016
      },
      "score": 6,
      "text": "Mike Flanagan just gets so close yet again, yet falls disappointingly short. Oculus is still his best work, and the promise that both Hush and this prequel to a PG-13 board game prequel show, is that if given the right opportunity he might really be capable of a cold-blooded classic.",
      "total_reactions": 0,
      "user": "DirigiblePulp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2016
      },
      "score": 8,
      "text": "Uuija: Origin of Evil doesn't do anything to break the mold on the horror genre, instead they opt to write and interesting and capable horror film. A fantastic prequel to 2014's Ouija, the pacing of the story, writing and cinematography are all good enough that anyone who fancies horror or paranormal films should be more than content with what they are presented with.",
      "total_reactions": 0,
      "user": "kuehnau"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2016
      },
      "score": 7,
      "text": "The 1960's setting captured by Ouija: Origin of Evil is spot on. Everything about how this movie looks feels fantastic, from the camera work down to the old fashion cue marks, Universal logo and title card. The acting and characters is particularly good, with the film really taking its time to set up its story and protagonists. The dark, creepy atmosphere of this movie is definitely captured well, for the most part. Whilst there are some cheap jump-scares during 1st act, it becomes much more suspenseful and genuinely scary during the 2nd and 3rd acts. Whilst the end feels a bit rushed and out of place, its serviceable and in the end, Ouija: Origin of Evil is in fact, a solid movie.",
      "total_reactions": 0,
      "user": "HazzaGalla"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2017
      },
      "score": 7,
      "text": "Director Mike Flanagan has a real eye for horror and he has really began to develop his own unique style.  In this case we have a sequel easily better than its predecessor. B+",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2017
      },
      "score": 3,
      "text": "The movie started out okay, with a nice 60s setting and a decent slow-building creepy atmosphere.  Then it just went full-out ridiculous, which completely destroyed any creepiness it had built up.  I spent the last act of the film laughing and mocking the characters for behaving so weirdly.",
      "total_reactions": 0,
      "user": "tethysdust"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2016
      },
      "score": 5,
      "text": "This movie is kinda in that its so bad it's good territory, like the movie isint scary at all, some of the scenes that where meant to come off as scary actually are funny this is a weird movie.",
      "total_reactions": 0,
      "user": "sjulti"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2016
      },
      "score": 2,
      "text": "This movie is phenomenal if you consider, cliché and horror stereotypes some sort of revelation. Unlike Lights Out (that had a few elements of originality)'Ouija: Origin of Evil' follows a Mother who is running a scam fortune telling business and her two daughters who lost their dad recently. The reason I bothered to mention their dad died recently is because they mention his departure a lot, in every scene in fact. Just in case the audience forgot. The beauty of this film is that you don't have to retain any information from the previous scene because they just blurt out exposition during any moment of plot development anyway. The acting is OKAY but it's pathetic character arcs and the character's non existent personalities give the actors little to work with.",
      "total_reactions": 0,
      "user": "DoubleRB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2016
      },
      "score": 3,
      "text": "Is this supposed to be a scary movie? It felt more like a very dull/confused drama. Save your money and go see something else, anything else for that matter.",
      "total_reactions": 0,
      "user": "Captainwinky"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2017
      },
      "score": 10,
      "text": "If you want to watch or download movie",
      "total_reactions": 0,
      "user": "clarisaa"
    }
  ]
}