{
  "mc_avg_user_score": 6.5,
  "mc_metascore": 28,
  "mc_mixed_rating_frequency": 38,
  "mc_movie_name": "Pandorum",
  "mc_negative_rating_frequency": 68,
  "mc_positive_rating_frequency": 226,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "This was and is, a great movie. Living up to it's genre, it really sets you in the darkest corner of the ship it's placed in. Well scripted, awesome acting and surprising twists leave this movie with you catched into it. A must watch for Sci-fi thriller fans!",
      "total_reactions": 1,
      "user": "Petrovita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "Dark, some little terror, suspense, really good movie, good acting of Ben Foster and Antje Traue... forget it about bad reviews =S Hope its coming the second part of the movie :D",
      "total_reactions": 1,
      "user": "JZx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "Critics can go  themselves. Most of them have no idea how a movie should be and the fact that they are making a living out of this is just sickening. Just finished watching the film and came here to write a few words and got completely enraged by the  people calling themselves \"critics\" to write some sensible words. Tenuous? GO  YOURSELF.",
      "total_reactions": 1,
      "user": "Teleman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "I am deliberately against the critics on this one.",
      "total_reactions": 1,
      "user": "MetaCryptic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "LOVED this movie!  I couldn't disagree more with the critics.  It had strong acting, great action sequences, good special effects, creepy monsters, interesting plot twists, and a satisfying ending.  After it was over, I was left wanting to know what happened next.",
      "total_reactions": 1,
      "user": "Arturo888"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "Seeing the \"critic reviews\" for this movie were pretty bad I decided to voice my opinion about it in a more positive light, to make a long story short movies like this are not for everyone and doesn't hold your hand through it all the way. I don't think there's anything wrong in that as a matter of fact if you're doing a movie \"for everyone\" you're doing it wrong.",
      "total_reactions": 4,
      "user": "Deadly"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Amazing movie!!!!!!!!!!!! Came in under the radar....But its great. Intense, scary, great actors and a space ship full of monsters.",
      "total_reactions": 3,
      "user": "Dukegun"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "Vastly underrated movie. One of the best space films of recent years. Great story, with plenty of twists and a great ending, cool mutant design as well. Just another great example of how wrong the critics can be.",
      "total_reactions": 3,
      "user": "XxKingLeonidas"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "Pandorum is one of those movies which will split the audience right down the middle. There are enough things wrong with the film to get you distracted if you want it to, but there is a pleasant mix of great things,  that will make this film a classic. The movie is very reflective of the last 20 years of sci-fi, drawing inspiration from classic films but also with a strong computer gaming influence. It is far more subtle than your Hollywood film and is much more raw and independent in feel, and that's what makes classics. Like all great sci-fi, this film does not overwhelm you with technology and science, but draws you to a story about people and their circumstance. I will not be surprised if this film stands the test of time and each year grows a wider appreciative audience.",
      "total_reactions": 3,
      "user": "JonathanC"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "I found it pretty good, reminds me Dead Space videogame.",
      "total_reactions": 3,
      "user": "Adanedhel"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "I really don't know what movie the critics where watching when they wrote a review for this film, it is great, actors do a fantastic job, story was ok but the atmosphere while watching keeps you on edge and is great when you are home alone and have all the light off or down low",
      "total_reactions": 3,
      "user": "masterjohnson1"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "\"Pandorum\" is just a SF-horror flick where survivors run away from alien-like creatures. The question is, did they make it? Yes, they barely made it.",
      "total_reactions": 9,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "I'm not generally a big fan of horror but there is no scarier setting than space and I think this movie was excellent, the twists and turns were unexpected and I was genuinely surprised by some of them which doesn't seem to happen very often anymore. Worth seeing for sure, and as with many of the other user reviews I must say I have never disagreed with critics more, their comparisons to previous Sci-Fi films are lazy and poorly considered. Really I think it boils down to the fact that very few critics like sci-fi and they tend to look down on it. I would say if you are a sci-fi fan this is worth checking out.",
      "total_reactions": 4,
      "user": "lgnburris"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "The story of Pandorum focuses on the crew of a sleeper ship called the Elysium and it's inevitable journey through space to their destination, the planet Tanis, which is supposed to be another Earth-like planet. From the beginning of the movie it had me interested, as it tends to keep things very vague, dropping tiny bits of clues as to what is going on. It starts with Corporal Bower (Ben Foster) who wakes from suspended animation and finds that he cannot remember much, if anything, about what is going or where they are. The story takes him on a journey through the ship as he attempts to uncover what is going on aboard the Elysium. Although I do see many strong resemblances or homage's to a slew of other movies, I don't feel the criticism aimed at it is deserved. The flavor of Alien/s and Event Horizon come to mind, but from what I gather the similarities are more superficial than anything else. The cast is pretty decent, with Foster giving a solid and realistic performance in his role. Denis Quaid manages to convey his character of Lieutenant Payton effectively, giving a good performance as well, but really starts to shine towards the end of the movie. The token girl/love interest Nadia, played by Antje Traue, is sometimes shaky in regards to her delivery, but does manage to convincingly play her role as the toughened scientist. She manages to fight well, while not looking like a wafer-thin model like in some movies (cough, cough Resident Evil), and I find that a very good thing. I'm pretty tired of that stereotype and its actually more attractive in my view. Plus shes nice to look at. Anyway the only real character I tended to wince at was Norman Reeduss's Shepard. I dont know if they wanted him to play it that way, but he seemed a bit overdone, but hey, maybe thats what was asked of him or how he wanted to do it. Either way it seemed the least genuine for me. Overall I loved the ambiance of the movie and the pretty realistic actions and reactions of the lead cast to the events that transpire aboard the Elysium. The movie held my interest well, aside from a few hiccups here and there. One of those was some of the B-movie like techniques they used for the action scenes, which to me kind of detracted from the horror of it all. Some scenes seem a little too sped up, while others may have relied on a bit too much slow motion, but all in all the movie has a certain style that appealed to me. It aint Shakespeare, but then again, its not trying to be. Definitely worth a look.â",
      "total_reactions": 2,
      "user": "zombiehampster"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2011
      },
      "score": 9,
      "text": "My opinion has never differed so noticeably from critics' ones than now. Definitely one of the best sci-fi releases of the decade. The plot and the twists, at least the major one, is unpredictable even to me - I consider myself a critical and skeptic person. Summa summarum, a refreshing movie in an era of boredom. I am pleased.",
      "total_reactions": 2,
      "user": "Yliannos"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "Listen this movie was on a pretty short budget give them some credit it used like 1/10th of the budget of transformers so I mean they can't help for some parts to be a lil cheesy.",
      "total_reactions": 2,
      "user": "killzon32"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "http://devilmayhem666.blogspot.com/2011/09/movie-reviewanalysis-pandorum.html",
      "total_reactions": 2,
      "user": "DevilMayhem666"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "For me maybe the best sci-fi in the last decade, the only one which I enjoyed from beginning to the end",
      "total_reactions": 2,
      "user": "wladdim"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2010
      },
      "score": 0,
      "text": "This Movie was crap. Dark, poor acting and I watched it with no idea what was going on. Waste of time and money, don't bother. Crappy cheap syntho music, crappy cheap out of work or just starting out actors. 1",
      "total_reactions": 6,
      "user": "Kev"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2010
      },
      "score": 1,
      "text": "I was lured towards 'Pandorum' with the expectation of a good value sci-fi-horror. But nay, was this piss-poor-triteâ",
      "total_reactions": 4,
      "user": "Michael"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "PANDORUM is a dull rip-off of THE DESCENT, but in space. That is all.",
      "total_reactions": 1,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "cant disagree with the critics more strongly. This film has an unpredictable story, which is a lot more than I can say for most blockbusters that I have seen lately. The point of the film was to be a terrifying, atmospheric science fiction horror, that's what I went in expecting, and that's what I got, and I couldn't be happier. The film is full of visual subtlety, lots of cool looking dark scenes, and best of all genuinely scary cool looking monsters. There are some moments in this film that have been burned into my memory, because they were so disturbing, and original. The ending is also a really awesome surprise, which is always awesome to have in a movie. Kind of reminds me of a big budget version of a really good Outer Limits episode.",
      "total_reactions": 2,
      "user": "lilkillpappy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "One of the best Sci-Fi movies I have ever seen. Great cast, involving story, crazy action, scary moments, adventurous. A good movie to watch at night in the dark. Worth buying, entertaining enough to watch more than once.",
      "total_reactions": 2,
      "user": "CmdrSoCal"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2015
      },
      "score": 1,
      "text": "This movie was absolute trash. It's supposed to be a super serious, sci-fi thriller, but instead it's laughably bad.",
      "total_reactions": 2,
      "user": "Braddyapples"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "I would have given this a 8.5 but  wanted to counter the children who gave it zero. One of the better sci-phi to come along in a long time. Elements of I am Legend, Aliens and Event Horizon. Stunned the critics bashed this one, shows they don't have independent critical thinking skills. If you like sci, you'll like this.",
      "total_reactions": 0,
      "user": "movieman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "This film got an extremely bad rap.  The critics absolutely missed the mark on this one.  As a sci-fi fan, I was both frightened and intrigued.  This film works on all levels, even if it is somewhat predictable.  If you're looking for solid sci-f horror go no further.",
      "total_reactions": 0,
      "user": "conschobhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Top top film, as good as event horizon, sets up great for a follow up which i would love to see,and a great twist at the end. Really underted.",
      "total_reactions": 0,
      "user": "rcgpeake"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "Why did I never hear abou this film until now? Maybe this is the reason it did badly in the box office - where was the marketing budget? If this was a Hollywood film it would have been rammed down our throats until everybody knew about it! Those movie critics are so out of touch with what the general public likes it's unbelievable. If it's not up for Golden globes or Oscars they don't want to know. This is the best sci-fi action and ending i've seen in a while. If you liked Event Horizon or Sunshine - this is better - better more uplifting less pondorous ending. Great special effects and amazing set building - best \"spaceship\" set since Moon or Aliens. Really looked realistic.",
      "total_reactions": 0,
      "user": "geogan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Doesn't deserve the critics' harsh reviews. It's certainly not Citizen Kane but it's a fun and entertaining SF movie. I certainly enjoyed it and even rewatched it, even if it's not the most original movie ever.",
      "total_reactions": 0,
      "user": "Doniazade"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "This movie is a totally enjoyable science fiction film.  It has quality acting, an engaging survival/horror plot line, and was generally well shot and scripted.  I couldn't disagree more with the 28 metascore this has from mainstream critics.  If you're a geek, you will probably like this movie.",
      "total_reactions": 0,
      "user": "zer0sum"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "Why such bad critics? Ok its not a masterpiece but i think it was time well spent. The end opens the choice of a continuity  and all the plot seemed well balanced. Ok im a sci-fi maniac and may look to the other side when something its not polished enough but that doesnÂ´t seem the case here. Well i guess sometimes its the people word that counts and the people has spoken...",
      "total_reactions": 0,
      "user": "Manueltava"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "I think this movie is very unfairly treated by critics. I thought the basic idea of the film was very compelling and the twist at the end one of the best in science fiction.  There might have been a few hick-ups here and there, but overall, this movie is a real gem in the science fiction genre.",
      "total_reactions": 0,
      "user": "Rince"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "I pretty good thought-provoking and creative film. For reasons: http://www.screened.com/profile/handbanana/movie-analysis-symbolism-in-pandorum/118-5063/",
      "total_reactions": 0,
      "user": "DeviousBastard"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2011
      },
      "score": 5,
      "text": "I felt the film, was trying too hard, the plot twists felt forced and anti-climactic. More on the annoying side i felt. I knew DQ was gonna lose his mind or had lost his mind but they kept dragging it on, which just comes across as annoying. I felt the other members of the crew were stereotypical. Timid yet willing to push himself hero. The bad ass cold shouldered **** with a soft side. and the immigrant who can't speak english. What i did like was the mutants they felt like a sub species of human, that given the context of how long the ship had been there fit. the history and back story of earth and its end were interesting. It was alright for one sit through other then that i could recommend much better sci-fi cinema. Was fun for one ride.",
      "total_reactions": 0,
      "user": "zorakandbrac"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "Good acting, Great plot, Might have seen the ending coming until they opened the hatch and there was just BLACK. Oddly that moment was almost the most disturbing before the its revealed what happened. Didn't see the Dennis Quaid being the bad guy thing coming. Just good and enjoyable, it kept me interested and surprised me.",
      "total_reactions": 0,
      "user": "neuroitc-isopod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "This film does extremely well on story, and yet it supremely fails on it's entire concept. Are these creatures real or are they just a hallucination? The whole point is that we are not really supposed to know for sure, thus being caught in a state of \"pandorum\", but the film fails to offer more insight into this and instead just relies on scare tactics and thrills. Still, I enjoyed this film and it looks excellent on blu-ray!",
      "total_reactions": 0,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "Excellent and highly underrated sci-fi flick.  Ignore the critics who call Alien a classic and Pandorum crap because it's nothing if not hypocrisy.  Both are highly enjoyable and they are so for the exact same reasons.",
      "total_reactions": 0,
      "user": "MrPresident"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "Why critics, do you dislike this spectacular film so much? Why ruin its reputation just to agree with Rotten Tomatoes? I don't understand. This film incorporated everything you would expect and more - effects, plot, build up, characters, mystery, everything.",
      "total_reactions": 0,
      "user": "House0fWolves_"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "An interesting and well produced horror sci-fi flick, with surprisingly good practical effects and writing; the critics are far too harsh, well worth the rental.",
      "total_reactions": 0,
      "user": "Fatspud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "The idea is pretty good, but the realization is poor at times. I didn't like the monsters design (some space orks) and their strange movement. Also some plot stuff was not properly explained. Overall, an average alien-like sci-fi horror movie with low budget.",
      "total_reactions": 0,
      "user": "StaticSpine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "Critics need to be fired. They watched a different film or think sci-fi is only about special effects. This is a very good film, with a solid, coherent story that develops in a steady pace and makes up for the lack of expensive effects.",
      "total_reactions": 0,
      "user": "vmp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "I bought this movie years ago and never watched it until now and I am glad I did. It's honestly one of the better Sci-Fi films I have seen in the last several years. Very well acted and the plot is very interesting. My only complaint being the poorly done fight scenes. Aside from that, It's a fantastic movie and I'd love to see a sequel to it.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "Watchable suspense filled horror sci-fi with good production value and a great cast putting in effort alongside some pleasing visual effects work. Highly recommend!",
      "total_reactions": 0,
      "user": "Voodoo123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2015
      },
      "score": 9,
      "text": "The movie had it's flaws,it's plot holes and the movie was cliché.But, Ben Foster and Dennis Quaid gave really good performances and the movie was interesting.Action packed,interesting and overall really good, Pandorum is one of the most underrated sci-fi horror movies out there.And while it brings nothing new to the genre it's one hell of a good movie.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2015
      },
      "score": 5,
      "text": "A good stand alone sci-fi thriller. Not brain candy but good for mindless fun. The plot is unoriginal, and the story plays out as something between Star Trek, and Aliens but not as good as either. The ending was interesting enough but I really disliked all the pseudo-psychology stuff which is why I knocked it down a bit.",
      "total_reactions": 0,
      "user": "marc5477"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "Great original science fiction film. The plot's wonderfully woven and the acting's superb.",
      "total_reactions": 0,
      "user": "choomtabi31"
    }
  ]
}