{
  "mc_avg_user_score": 4.0,
  "mc_metascore": 32,
  "mc_mixed_rating_frequency": 22,
  "mc_movie_name": "Paranoia",
  "mc_negative_rating_frequency": 24,
  "mc_positive_rating_frequency": 9,
  "mc_pro_critic_reviews": [
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "Now it feels almost quaint, like a throwback. You watch it and, despite all the au courant techno geekery on display, you feel like you’ve stepped into a time capsule. It’s a nice feeling at first. If only the movie were better."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "The only real reason Paranoia is even remotely worth watching is the chance to see Oldman and Ford go head-to-head like two vipers thrown into a potato sack."
    },
    {
      "critic": "Bill Zwecker",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "The actors do their best. The problem here is simply a formulaic screenplay and less-than-inspired direction."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "This one is essentially “The Firm” with smartphones."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "There’s a scene in a members-only club where Wyatt and Goddard meet, giving the two veteran actors the chance to go eyeball to eyeball for a couple of minutes of barbed dialogue. It almost makes the movie worth it."
    },
    {
      "critic": "Sean O’Connell",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "There’s tension to be wrung from the premise, but Luketic is content to telegraph his movie’s juiciest twists, concentrating instead on applying a sleek visual sheen usually reserved for shampoo commercials."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "It plays more like a \"21 Jump Street,\" full of pretty people and a thumping soundtrack but offering little in the way of something to say."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Hemsworth, who is Gale Hawthorne in \"The Hunger Games\" and the brother of the Hemsworth who stars as \"Thor\", has maybe one arrow in his acting quiver - he can look engaged."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Paranoia has a promising foundation — betrayal, danger and corporate espionage are solid building blocks of suspense. But the movie turns out to be more exasperating than exciting."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "There's nothing wrong with Paranoia that a stronger director, livelier leading actors and several hundred fewer narrative conveniences wouldn't cure."
    },
    {
      "critic": "Stephen Farber",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "The filmmakers may have hoped to make a timely commentary on the amorality in our executive suites, but they end up merely restating the obvious. Maybe the whole thing would have played better as a corporate comedy, the kind that Doris Day and Rock Hudson made some 50 years ago."
    },
    {
      "critic": "William Goss",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2013
      },
      "score": 45,
      "summary": "Frankly, no one in this ensemble is done any favors by Jason Hall and Barry Levy’s screenplay, a “Duplicity” for dummies filled to the brim with double-crossing cliches."
    },
    {
      "critic": "Kimber Myers",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 42,
      "summary": "The bland, boring Paranoia does little to distinguish itself and isn’t good (or even enjoyably bad enough) to be passable even as Saturday afternoon cable fodder."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 42,
      "summary": "The film works only, if at all, as an unofficial Air Force One reunion, with Ford stopping just short of bellowing “Get off my jock!” during a pair of gritted-teeth encounters with Oldman. Some pleasures never go out of fashion."
    },
    {
      "critic": "Ian Freer",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2014
      },
      "score": 40,
      "summary": "Even a cast boasting Oldman and Harrison Ford can't salvage his dreary, contrived corporate thriller."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "Paranoia is ostensibly a thriller, but there’s nothing remotely thrilling about it. This slick, plodding bore is as exciting as watching somebody else tap out text messages."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "Ford and Oldman’s scenes together are Paranoia’s sole redeeming facet."
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "Director Robert Luketic’s thriller Paranoia has a host of problems, but the biggest seems to be that no one in it is nearly paranoid enough."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2013
      },
      "score": 38,
      "summary": "However, once you realize there's no \"pleasure\" to be had from something this wantonly dumb and idiotically constructed, all that's left is \"guilt\" - guilt that you actually spent money to see this."
    },
    {
      "critic": "Steve Macfarlane",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 38,
      "summary": "Robert Luketic's supposedly down-and-dirty corporate espionage thriller undercuts itself at nearly every turn by shunning any potential relevancy."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 38,
      "summary": "It is as slow, slick and superficial as the director of “21″ and “Killers” can make it."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 30,
      "summary": "I'm not going to get into the acting, because there's not much of it, frankly. No one is embarrassingly bad; no one is exceptionally good."
    },
    {
      "critic": "David Lewis",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2013
      },
      "score": 25,
      "summary": "A ho-hum thriller about corporate spying in the high-tech world, comes off as a lot more preposterous than paranoid, and it takes no more than a few frames for the eye rolling to commence."
    },
    {
      "critic": "Peter Sobczynski",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 25,
      "summary": "Although presumably meant to be a modern-day version of the classic conspiracy thriller \"The Conversation,\" Paranoia is so vapid that it plays like \"Antitrust\" sans the food allergies."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 25,
      "summary": "It galls me that Hollywood thinks we're shallow enough to swallow this swill. Or am I just being paranoid?"
    },
    {
      "critic": "Steve Davis",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 20,
      "summary": "You could drive an 18-wheeler through the substantial number of plot holes in Paranoia."
    },
    {
      "critic": "Ernest Hardy",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 20,
      "summary": "This is a film at odds with itself, wanting to be a 99 percenter rallying cry but wallowing in and fetishizing 1 percenter accoutrement at every turn."
    },
    {
      "critic": "Nick Schager",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 20,
      "summary": "The fact that Hemsworth is severely lacking in leading-man charisma also doesn’t help the pervasive overall incompetence of the film, which fixates on the perils and panic of our modern surveillance culture while itself proving to be borderline unwatchable."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 20,
      "summary": "Mr. Oldman and Mr. Ford are the only actors in the film, directed by Robert Luketic (“Legally Blonde”), skillful enough to navigate the yards of jargon-packed boilerplate in Jason Hall and Barry L. Levy’s thudding screenplay."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 20,
      "summary": "Paranoia’s twitchiness is like an actual twitch: it’s contrived and clunky, and you forget it in an instant."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2013
      },
      "score": 2,
      "text": "The idea is good and the cast is good, the problem is the next: All the movie is really terrible! The development is really poor, the script is bad, and the performances are really terrible (Gary Oldman and Harrison Ford do a great job, the problem is that the script is so bad, and they try to do all the possible to do something good). Paranoia is a box of good ideas but poorly executed.",
      "total_reactions": 2,
      "user": "MarkDetrel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "After he's fired from his giant tech company, Liam Hemsworth is secretly hired back to spy on their major competitor. Predictability ensues. The inevitable twists are not surprising. You at least expect some slick visuals or neat futuristic stuff. Expectations dashed. Hensworth makes a generically handsome but bland leading man. Harrison Ford and Gary Oldman add some seasoned performances. Overall, there's nothing about the script that's the least bit new or interesting and the laconic direction never delivers any suspense or…wait for it…paranoia.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "After making a name for himself in the Hunger Games, teen heartthrob, Liam Hemsworth got his first leading role in the corporate thriller, Paranoia. This film has a somewhat complicated plot to explain without spoilers, but I will attempt to do so. Adam Cassidy (Liam Hemsworth) is a low level employee at one of the worlds largest tech company. His boss has learned that their main competition, his former employer, is about to unveil a revolutionary piece of new technology, that can change everything. Fearing for his companies future, Nicholas Wyatt (Gary Oldman) decides to give Cassidy the opportunity of a lifetime, that is if he's willing to break a few dozen laws or so. Liam Hemsworth was terrific, giving a performance similar to the one Bradly Cooper gives in Limitless, as a guy with an important job that's in way over his head. Hollywood finds these good looking guys and the truth is that a lot of them have nothing to offer, but Hemsworth proves that he has the talent it takes to star on the big screen. In the film he's supported by a real all-star cast, that includes Harrison Ford, Richard Dryfuss, and Gary Oldman, all of whom do what they've been doing for half a century, making great films even better. The only reason this film isn't getting 5 stars, is the same reason it didn't do as well as it should have in the box office. Paranoia is about corporate espionage and at times, the business aspect is confusing and makes us feel as overwhelmed as Hemsworth's character does. Other than that, I can't find a thing wrong with this film, it is absolutely one of the best edge of your seat thrillers I've seen all year and easily earns the right to be called one of our must see movies!",
      "total_reactions": 1,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2013
      },
      "score": 1,
      "text": "Typical cliche rubbish.",
      "total_reactions": 1,
      "user": "Sethenan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "But the stakes seem small. Director Robert Luketic showed a nice hand at light comedy in Legally Blonde, but he has no feel for the tensions of corporate deception. The twists aren't surprising, the perils feel artificial, and even Hemsworth's chest gets a little ho-hum after a while. The most interesting aspect of Paranoia is the appearance of Oldman and Ford, who is looking especially grizzled but hasn't lost that twisted smile of menace. They're fun to watch, even though the movie's biggest mystery is how they got roped into it. Must have had something to do with answering their cellphones.",
      "total_reactions": 5,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "The main things missing from the thriller “Paranoia” are thrills. The leading man, Liam Hemsworth, is as good looking as they come and certainly Harrison Ford and Gary Oldman as former friends now out to destroy each other play their roles to the hilt. Richard Dreyfuss adds the sympathy, the only sympathy, to the success of Hemsworth who wants it all and Amber Heard supplies the love interest in a role that certainly doesn’t give off any thrills as to who will end up together.",
      "total_reactions": 3,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "In my opinion, this movie was pretty worth it, going against some reviews. Yes, some parts good be a little cheesy, and yes, sometimes the story line was slightly confusing. However, I still found this riveting and suspenseful and I would recommend it. It's not the best movie I've EVER seen but it was enjoyable and I really was glad I saw it. I'll admit, at times, I enjoyed it because of Liam Hemsworth's attractiveness, but I enjoyed it for the story, too. Harrison Ford also gave a good performance.",
      "total_reactions": 4,
      "user": "caroline2"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "Although the story line is weak, their is drama and the film is entertaining.  Harrison Ford give a good performance.  Direction is good and there are many scenes of New York business buildings which give an insight into how it all works.",
      "total_reactions": 5,
      "user": "gfny"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "Going against many other reviews, I will now say that this movie was, in my own personal opinion, worth it. I can't defend this movie against the accusations of being clichéd and unoriginal, because it IS. It really is and it's PREDICTABLE. I could see how the movie ended almost right after it started. Yet, I still found myself watching, which I guess means I am easily entertained. It honestly wasn't as bad as I thought it would be. It was actually pretty good, in my OPINION. I actually liked the acting in the film.",
      "total_reactions": 1,
      "user": "andrewgarcia732"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 4,
      "text": "The two richest and most successful tech billionaires in the world are biter rivals and constantly trying to outdo each other. Into their world comes a hot shot tech geek seduced by one to spy on the other who soon finds that his life is in danger as the two stop at nothing to get the upper hand. Sound exciting? Well, it's not. Its hard to care about either protagonist, and Liam Hemsworth is so bland as our hero its impossible to get excited. Oldman and Ford are obviously just there to pick up the cheque.",
      "total_reactions": 0,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2013
      },
      "score": 2,
      "text": "Nobody will know what is going on and nobody will care either in this horribly directed film. So many times characters are about to explain something and then they say nothing because the screenwriters didn't know what to say. Paranoia is a flashy high tech film that offers no intelligence, boring acting and terrible editing.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "This film is just a waste you have Gary Oldman and Harrison Ford and you create this really.  There's just nothing here you don't care about any of the characters.  Overall Ford and Oldman keeps this thing from a complete disaster, but it's close. D+",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "Short, sweet and to the point, this movie is a movie that takes 0 risk of any stake and can be forgotten within the ride home from the movie theater. Be sure to check out my YouTube channel \"TheMovieManLife\" for all things movies.",
      "total_reactions": 0,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "Paranoia isn't an absolutely horrible movie; it's just a pointless one. Once the story wraps up, what's the reason we watched it? None. It's full of pretty Hollywood stars and muddled screenplay, with no real message or commentary.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "Actors did a good job. Everything was good but i have this feeling that the last part of the movie was overlooked kind of impression. I mean, Ford bought the opposing company? its like something isn't right here.",
      "total_reactions": 0,
      "user": "spqwerty"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "Was looking forward to watching this movie, unfortunately was very Dissapointing, not the greatest performance by Harrison Ford, and Liam Hemsworth needs to take some acting lessons from his older brother Chris  Thor  The story line was quite confusing, making it hard to understand, all in all extremely Dissapointing",
      "total_reactions": 0,
      "user": "Robhomer123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2015
      },
      "score": 0,
      "text": "From one of the greatest books come one of the worst movies I've ever had the displeasure of watching.",
      "total_reactions": 0,
      "user": "JJthis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "\"Paranoia\" 10 Scale Rating: 3.0 (Awful) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "Paranoia is professional in every way and I really enjoyed watching it.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2016
      },
      "score": 2,
      "text": "Bottom line... if you want to enjoy Paranoia, there's nothing you can do about it. Whine to the filmmakers all you want if you want to do that because Paranoia is nothing but stuffed-up garbage.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    }
  ]
}