{
  "mc_avg_user_score": 4.6,
  "mc_metascore": 40,
  "mc_mixed_rating_frequency": 67,
  "mc_movie_name": "Paranormal Activity 4",
  "mc_negative_rating_frequency": 86,
  "mc_positive_rating_frequency": 62,
  "mc_pro_critic_reviews": [
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 70,
      "summary": "The film is heavily reliant on jump scares, but its best moments are the ones before them, when the tension builds without the benefit of escalating music to queue you in to the approaching shock."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2012
      },
      "score": 67,
      "summary": "The mythology has deepened, largely to the negative, and the formula is as rigid as the fixins of a fast-food sandwich-tastes the same in every city. But the effects are eternally reliable."
    },
    {
      "critic": "Andy Webster",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "Paranormal Activity 4 will please the fans, and that should sustain this low-budget, highly profitable franchise."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "This film's strong suit is that it finally feels contemporary."
    },
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "Catfish pair Joost and Ariel Schulman keep the franchise firmly on track with a satisfyingly scary fourth instalment."
    },
    {
      "critic": "James Rocchi",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "Paranormal Activity 4 may mean more of the same, but in a modern horror landscape too often made up of equal parts of gore and boredom and resigned straight-to-video, it's a chiller designed to be seen in a crowded theater, and that alone makes it superior to its peers."
    },
    {
      "critic": "Matthew Leyland",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "Aside from the usual self-slamming doors and flying bodies, there are enough creepy kids and hiding knives to distract from a plot that's increasingly mobile yet running on the spot."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "The ending steals actionably from \"The Blair Witch Project,\" the movie that helped spawn these first-person chillers."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "This is hardly reinventing the wheel, but it is serviceable, if you're looking for a few shivery communal scares."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "There's virtually nothing new in the dull Paranormal Activity 4 except for a modification in the method of documenting the spooky shenanigans."
    },
    {
      "critic": "Adam Markovitz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 42,
      "summary": "PA4 develops the story ever so slightly (not enough to satisfy fans) and delivers a few good scares (not enough to satisfy newbies); mostly, it plays like a overlong prologue for the already-in-the-works PA5. Here's hoping this is just the tension-racking lull before the next big scream."
    },
    {
      "critic": "Chuck Wilson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "Screenwriter Christopher Landon, along with co-directors Henry Joost and Ariel Schulman, make a truly lame attempt at establishing a supernatural mythology to explain all this, but their real energies go to amping up the jarring sound cues, darting shadows, and last-shot shocker (so goofily weird this time that you'll laugh out loud) that make this franchise a perennial crowd-pleaser."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "Apart from a hi-def night-vision gimmick, returning directors Henry Joost and Ariel Schulman don't take advantage of either upgrade."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "But the real problem behind Paranormal Activity 4 is that its entire raison d'être has gotten old; producer Oren Peli, who directed the first one, even included some gentle digs at the found-footage genre in his superior \"Chernobyl Diaries,\" released earlier this year."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "There's a point at which movies become only merchandise, and the Paranormal franchise may be heading for that nexus, that nadir."
    },
    {
      "critic": "Justin Lowe",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "Fairly mild in tone and riffing -- if not quite ripping -- off a collection of horror classics that includes \"The Shining,\"  \"Rosemary's Baby\" and \"Poltergeist,\" both the franchise's premise and its execution nevertheless remain rudimentary, with the narrative and character backstories representing more of a sketch than a fully realized vision of the supernatural world that Katie inhabits."
    },
    {
      "critic": "Geoff Berkshire",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "Less reliant on slow-burn suspense and larded with fake-out jump scares, this is the first sequel in the series that fails to advance the overall mythology in any meaningful way."
    },
    {
      "critic": "Chuck Bowen",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2012
      },
      "score": 38,
      "summary": "Paranormal Activity 4 sadly continues the series' downslide, most drearily with a mid-film twist that enables the filmmakers to go about essentially remaking the second entry."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2012
      },
      "score": 25,
      "summary": "They could have called this Paranormal Inactivity."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2012
      },
      "score": 25,
      "summary": "Paranormal Activity 4 is listless, dreadful and boring, an almost painfully inert and superficial ghost story that lacks specificity or scares. Time to turn the camera off, guys."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 20,
      "summary": "PA 4's best idea, besides reintroducing the slow-walking, statuesque Katie, is a strange video trick involving lots of little lights filling a darkened room. It's tough to describe, but the cameras, of course, capture a figure the characters can't."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2012
      },
      "score": 11,
      "summary": "This is one horror franchise that's burned itself out, and then some – not even the rare shock cuts to nothing much at all will startle anyone over the age of 8."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "Q:\"What horror should we watch and make my GF be afraid while I am laughing?\".A:\"Paranormal Activity 4\".It is hard for me to believe that after the first movie and the whole \"This is real footage\" lie people are going to actually enjoy another film of the Paranormal Activity series.As a horror movies fan I was not afraid or impressed.A few scenes kept me awake during the movie though.",
      "total_reactions": 7,
      "user": "LeonidasPeplis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2012
      },
      "score": 0,
      "text": "I hated this movie, I honestly have nothing good to say about it. The only other movie in the series I've seen is three and while i certainly didn't love it i admit that it least had a creepy uncertain atmosphere to it. All this piece of **** had was pointless jump scare after pointless jump scare and out of all 47 of them I think i only jumped once maybe twice. Worst movie I've seen all year and probably the worst \"horror\" movie ever",
      "total_reactions": 3,
      "user": "starscream97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2012
      },
      "score": 1,
      "text": "Really? I'd rather watch orthodontic surgery. If you are watching this you are either a desperate loner with nothing else to do, or you walked into the wrong theater. This movie made my wife jump out of her skin, but then again she's not that smart.",
      "total_reactions": 3,
      "user": "Oroiael"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "The jumpiest Paranormal Activity yet! Paranormal Activity 4 delivers a lot of jump scares and new features, such as: the kinnect, phones and computer camera. However, the other Paranormal Activities are creepy and gripping whereas this one just go straight for jump scares, if you like more of a \"you're going to have a nightmare\" type of film then this is not for you!",
      "total_reactions": 2,
      "user": "jennanana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "PLEASE STOP!!!!! This series has become a joke to scary movies. What started of as a turning point to horror cinema has now become a franchise that plain out sucks.",
      "total_reactions": 1,
      "user": "BrendanCogs99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2013
      },
      "score": 1,
      "text": "\"Hey Gav, wanna play burn the terrible and boring movie?\"",
      "total_reactions": 1,
      "user": "Gavin7887"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "\"While not quite on par with the first two Paranormal Activities, its was better than the third installment though. Its not gonna give you nightmares, but it does have some tense buildups and a pretty good finale, although i wish it was better.\"  B-",
      "total_reactions": 1,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2012
      },
      "score": 2,
      "text": "If you're after a theme park attraction where you jump on train and get some meaningless scares along the way, this one will satisfy you. But if you're actually after a \"movie\", you better go to a real theme park. I'm pretty sure I've been to some theme park attractions where the acting and the storyline was better than this.",
      "total_reactions": 5,
      "user": "bigboned"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 4,
      "text": "My favorite line came just after the movie ended:  \"This movie's gonna make me afraid of white women....\" which made me and the woman who said it burst out laughing.  It's a slightly different take on the series, but this fourth installment is not NEARLY as scary as the first two.  The third was just bizarre - especially the ending.  There's a shot at the very end of this film that's disturbing, but still not all that scary. I just felt there were so many opportunities for scares using the new filming conventions that they didn't exploit (video chat, the Kinect sensor, etc). And the car / carbon monoxide sequence was WAY too much like a hundred other horror films, which depressed me a bit. So yes, it was a pedestrian effort, but I did have fun with the opening night crowd which was properly amped up, so I'll stick with the four.  The true test of how much of an affect a horror movie has had on me is whether I\"m freaked out walking up the dark staircase in my place afterwards . In this case?  Not freaked out at all. Bum deal.",
      "total_reactions": 4,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 6,
      "text": "If you are a fan of the series, you are either going to love this film or hate it. Paranormal Activity 4 has no source of scares what so ever (even no jumpscares) and the film also lacks any paranormal activity at all, it's more of a quasi-slasher film. The film is also quite suspenseful though and will even shock you at parts. The film's writing is horrible; it doesn't explain anything, the characters are quite dumb, there are even plot holes too...and the ending, I honestly do not know what to say about the ending. The ending is ridiculous, over-the-top and utterly outrageous and will certainly leave viewers saying \"What the hell!\" and will leave fans furious. In the end, Paranormal Activity 4 is humourous and violent entertaining that is highly flawed and will certainly divide fans due to it's love-it-or-hate-it presentation. Also stay after the end credits, there is a surprise.",
      "total_reactions": 6,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "The film also follows its mysterious history, however, was one of the best movies between the three, with more frightening scenes, and with a final horrific, does not believe in the note on which gave, pra who liked until now you will appreciate this last.",
      "total_reactions": 4,
      "user": "Astronauta10"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "This is getting ridiculously repetitive. Everything but the final 10 minutes you've seen in the previous 3 installments. Loud noises and moving objects, thats what makes these films so \"terrifying\" its getting repetitive and they need to stop making these movies already, but of course they make money so a 5th installment is already confirmed for next october. Don't make this franchise like saw, they should've left it off with the 3rd. 3/10",
      "total_reactions": 2,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "First, I mean it's the worst movie of all 4 parts, but it's still a good movie. It has so many scares as in other movies paranormal activity. In the movie there are scenes in which you'll be amazed. I recommend it to fans of the movie.",
      "total_reactions": 3,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "best paranormal activity movie yet, they were all amazing actors/actresses i would definitely want them to make a sequel! everything was amazing about this movie. it made me jump throughout the whole movie so i think bravo to the directors! and it is 100% worth watching so! yeah watch it BEST ONE YET!",
      "total_reactions": 3,
      "user": "mileeeey"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "Paranormal Activity 4 just goes to show why, really, Hollywood shouldn't be allowed to let any film have a third sequel. Paranormal Activity has gone from a 'found tape'-style documentary horror with tension and jump scares, to a poorly written and entirely generic thriller film.",
      "total_reactions": 1,
      "user": "chemicalreaper"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2012
      },
      "score": 6,
      "text": "For 85 minutes I thought this was going to be nothing but jump scares and classic cliche story points. But I kid you not the final two minutes of this movie made me jump and the hair on my legs stand up it was so scary. And I am a straight 18 year old college male. If you see it in a crowded theater around Halloween with friends, its great fun. Otherwise I'm not sure you'll really get the full effect.",
      "total_reactions": 1,
      "user": "tropicAces"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2012
      },
      "score": 6,
      "text": "This was not so bad,it used IMAX well and it delivered a lot of scary moments.But there is not anything new in the Paranormal Activity universe since the second one.",
      "total_reactions": 1,
      "user": "rodrique"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "The scares were there, cheesy dialogue in parts, but that finale was intense.  This was my favorite film out of the four movies so far, and with the Facebook campaign centering around Jacob DeGloshi for PA5, it makes it even more eerie.",
      "total_reactions": 1,
      "user": "grandcrosssteve"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "I have never seen any other Paranormal Actvity films before but seein this is making me watch the other three. Its cary the first hour then you sort of know what to expect. I mean maybe when I see all the films the might be the same but until then good movie. Paranormal Activity 7.1/10",
      "total_reactions": 1,
      "user": "watithink123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "I am a huge fan of the paranormal activity movies. This one in my opinion is my 3rd favorite one. Saying this i do not mean it was bad, it was actually good, all of them are good. I just believe that the 3rd and 1st were better, while the 2nd wasn't better. The end of this was very well done. It was a scary movie to watch in theaters.",
      "total_reactions": 1,
      "user": "twiz522"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "i'm a great fan of paranormal activity 1 and 2, and this one is okay. the screenplay is the worst of the saga, but it has a lot of horror. mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm",
      "total_reactions": 1,
      "user": "LuisMatheusBC"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "This movie was crazy scary i was physically shaking holding my computer the end BOOM!!!!! Right in your face demon this movie is terrifying but otherwise one of the coolest horror movies of all time i don't know why everybody hates it its so awesome i recommend for people who like a scary horror movie BUT Not for kids thirteen and under the last 5:30 seconds are really intense",
      "total_reactions": 2,
      "user": "gameboy377"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2012
      },
      "score": 4,
      "text": "Short and simple this is the worst of the PA films. I enjoyed the first 3 for the most part as well, but here there are so many plot holes and very few scares until the final few moments of the film. There's some interesting ideas at play throughout the film too, particularly the garage scene and the finale. I really wanted to enjoy this film but I ended up annoyed and underwhelmed when I left the theater.",
      "total_reactions": 0,
      "user": "Greenmember"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2012
      },
      "score": 4,
      "text": "I saw Paranormal Activity 4 tonight and... it wasn't that very good. I still love the Paranormal Activity movies, all 3 of them. But Part 4 feels like \"Paranormal Activity 2\" all over again. It feels a bit strange on why a fond footage movie could get any more sequels instead of one. There's nothing new in Paranormal Activity 4. Same characters, different dialogue, but wasted a lot of time to scare audiences. I totally agree with the negative feedback and I don't think Paranormal Activity should not get a 5th installment. I think the franchise is fading away.",
      "total_reactions": 0,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2012
      },
      "score": 5,
      "text": "I almost wish the whole thing would've continued without any of the paranormal activity occurring. More than any of the previous installments, the characters are so likable here, you actually care what happens to them. All of the performances are terrific and the script is pretty solid dialogue-wise. Unfortunately, it isn't scary at all, and that is the point, right?",
      "total_reactions": 0,
      "user": "LetzTalkMoveez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2012
      },
      "score": 5,
      "text": "I've always been a supporter of the PA series, even through all the haters and what not. But I really didn't like PA 4. It was a lot of the same, but really most painful of all, it didn't explain much of anything. I would like to say that the ending redeems the movie, but it doesn't fully. It's an action packed 10-15 minute ending but it isn't enough to redeem the whole movie.",
      "total_reactions": 0,
      "user": "L4DLegend91"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "This movie is just bad bad bad. The worst one in the series and doesn't even pick up or get intense until the end. I hated I wasted my money on this trash, do yourself a favor and either redbox or Netflix this when it comes out.",
      "total_reactions": 0,
      "user": "Bucs65"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "Holy Christ this movie sucked so hard. No tension. No scares. The series keeps getting worst and worst. I'm happy I didn't pay to see it. I'm so angry on how bad this movie is...I wish I could just spit on it. I'm not exaggerating, definitely the worst horror movie that's been out recently.",
      "total_reactions": 0,
      "user": "Andre00x"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 0,
      "text": "Scam. That's what this so called movie is. I almost fell asleep halfway through. Uninteresting sub-plots and    bad acting make this my personal worst movie of the year 2012. Do not waste money on this.",
      "total_reactions": 0,
      "user": "Commando_NL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2012
      },
      "score": 2,
      "text": "Didn't we learn our lesson with the first two films? Didn't we? Didn't we learn that jump scares aren't scary and that likeable and smart characters carry a movie? Didn't we learn that plotholes shouldn't be in movies? Apparently not! And I counted how many jump scares they did in this film. How many were there? 20 through out the film. And at one point 5 happens in under two minutes. Thankfully there are people such as myself who recognize the fact that this movie is poorly made. And the people who paid to see this, I saw a free screening, I shame you. Its your fault you think jump scares are what makes a good horror movie and not good story telling, atmosphere, motivations, and actual story structure. Easily the worst film of 2012!",
      "total_reactions": 0,
      "user": "MetalMovieNerd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2012
      },
      "score": 1,
      "text": "Wow. Possibly the worst horror movie I have ever seen. I will go that far to say EVER. The story line lacks a plot, the jumps and thrills lack, well, horror, and the anticipation and the build up to the movie is scarier than the actual movie. Personally, I wish I hadn't have spent my money on this drivel.",
      "total_reactions": 0,
      "user": "Amber_Stevens"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2012
      },
      "score": 1,
      "text": "The fact that more Paranormal Activity movies have been made astounds me. The first one was only \"frightening\" near the end, and even that was more surprising/shocking than scary. Don't waste your money, wait for this to show up on Netflix/Redbox/DVD or TV even. Honestly, don't even waste your TIME watching this latest iteration. I actually walked out of the theater about twenty minutes in and requested a refund due to the garbage shown on-screen.",
      "total_reactions": 0,
      "user": "Toffenuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2012
      },
      "score": 2,
      "text": "Just a movie with fake jolts. and at the end is the only action..they should just stop trying to give it a story and give us real horror/suspence like what they did with there first paranormal activity..i dont give a f*ck about the story, i just want the sh*t scared out of me!! overall a blan boring movie..dont waste your time",
      "total_reactions": 0,
      "user": "Ryuzaki"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "Same old, same freaking old. The final 15-20 minutes of the film are okay, the rest of the film is plain boring and pathetic. I don't know why they keep making films like this, the first installment was good, no doubts, but they're not offering anything new now. This is the worst movie in the Paranormal Activity franchise, not impressed me in any aspect whatsoever. The name of the film is Paranormal Activity but it doesn't offer any kind of paranormal activity or even if it does, that's negligible because that won't give you any scares, how ironic is that! When the third film came out and I watched it, the first thing that came into my mind was, \"What could be worse than this?\". Today, I found the answer to that question after I finished watching this film.",
      "total_reactions": 0,
      "user": "theahsanhaseeb"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2012
      },
      "score": 1,
      "text": "It's really interesting because I went to see this film, wanting to get scared, wanting to jump. But, this 'scary' moving, wasn't even able to make me do that. As a watcher of the otehr 3 films and getting a little scared in parts, I was expecting to get scared for at least 5 minutes of the movie. But sadly this movie isn't even scary enough to do that.",
      "total_reactions": 0,
      "user": "Jnf17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2012
      },
      "score": 0,
      "text": "There was some hope that the chapter 4 had some survival after a not so badly received third chapter. But there is everything in this movie, unless some kind of innovation that can save you from your own formula (already extremely hit). The film is limited to 'fool' the public until more than half his scenes that something might happen to the apex of the intellectual degradation, which should be one of the worst final watched this year.",
      "total_reactions": 0,
      "user": "EduardoLuiz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "Not a bad film if you're watching it in the dark at home (not the cinema with screaming kids) but it feels like a bit of a cash-in more than anything else. Sure, it'll make you jump a few times and may even get you in that weird paranoid state for the rest of the night, but it's hard to ignore how unnatural and forced the handheld camera footage often feels, and the fact that three quarters of the movie centers around obnoxious teenagers. As I said, it's not bad, but it's nothing on the first Paranormal Activity and certainly doesn't warrant the planned fifth installment.",
      "total_reactions": 0,
      "user": "mako_psy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 2,
      "text": "Paranormal Activity 4 is another installment in the franchise, and has proven to me that they are just going to keep making sequels until they start becoming losing money (just like the Saw films).  I wish they would be smart and just make each movie different and original, but it seems they are trying to make some story here and it really is happening slowly.  I mean nothing happens in this movie, a few pop out moments happen but this seriously has nothing we haven't seen in the past three films.  I felt like I could see everything coming and although it has a few effective scares, it really doesn't change the fact that this movie is just lazy and doesn't bring anything new to the table.  It",
      "total_reactions": 0,
      "user": "BreakingBrad"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "This movie is a good example why movies should be left at just one. In my opinion, it is the worst yet, with absolutely no story present to speak of, one-dimensional characters, and more of the same old things. As a fan of the series (perhaps ex-fan now), I was really looking forward to this film, hoping it would redeem itself, after the awful attempt 3 made of saving the series.  The cheap scares and long camera takes are evidently getting old, with more people switching off. In terms of plot, I was eager to see how the main plot line of the previous installment would continue, only to be disappointed with more questions than answers by the end of the movie. My only hope is that the franchise will end sooner rather than later, no doubt in the traditional way of cutting any chance of a plot in the movie short. Although scoring it a 4 is poetic justice, I do believe it is quite a generous score, given the material.",
      "total_reactions": 0,
      "user": "AD_Phoenix"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2013
      },
      "score": 4,
      "text": "\"Paranormal Activity 4\" is easily the weakest yet in the series, lacking much of the innovation and fresh tactics of its predecessors and posing none of the answers it promises to deliver. This sequel was marketed to shed some light on the last movie's plot mess of a conclusion, but instead only gives us the same questions after 90 minutes of old hat sound effects, jump scares, and failed attempts at keeping the formula fresh. I'll give the film credit for its use of webcam surveillance, which although is likely not possible under these circumstances, does give us some new perspectives apart from the tired handheld video. But setpieces like a certain kitchen knife and the XBox Kinect are promising lodes of suspense cut short of their full potential, and the characters range from likeable (the main chick) to barely present and mostly moronic (the parents). It just feels more like the hollow shell of a \"Paranormal Activity\" movie, rather than what we've grown used to over the past films  so much so that, unless the next sequel proves otherwise, this franchise has likely proved itself to have already passed its prime.",
      "total_reactions": 0,
      "user": "WriteFilmLive21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "disapointed. I thought that this was going to be good and i was wrong the movie was not all bad the acting from the people was good but the plot and the scares let them down. Overall not very good 4/10",
      "total_reactions": 0,
      "user": "cool1707"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "The performances were good and the story was fine. The only problem is that there was no real paranormal activity up until the last 20 minutes of it!!!!!!!!!!!!!!!!!",
      "total_reactions": 0,
      "user": "mds03"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2013
      },
      "score": 2,
      "text": "The acting gives away everything not to mention it shows the same plot material as all the others leaving it to die as a not so terrifying collapse of the series.",
      "total_reactions": 0,
      "user": "TheWalrus2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "Paranormal Activity 4 does not advance the story much at all, making it the worst of the series.  I liked the first two and the third one at least advanced the story.  It's not awful, but you can probably skip part 4 and still pick the series up in part 5 and not miss a beat.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "A big disappointment for horror movie fans! There's one thing I hate about this year's installment: false advertising. When the poster and trailer came out with taglines saying that \"all will be revealed\" and \"all the activity has led to this\", I was actually excited to see this film. But after watching it at the cinema, I felt like I wasted my time and money. \"Paranormal Activity 4\" will leave you unsatisfied with an unresolved cliffhanger, very slow scenes, and lots of cheap scares. The acting was not good especially from Kathryn Newton and their reason for filming wasn't pretty convincing. Also, I'm disgusted that the series is starting to utilize CGI effects which ruins the movie's atmosphere. In a brighter scale, the methods for capturing the activity were smart just like its predecessors and there are \"some\" scenes that frightened me a little bit.",
      "total_reactions": 0,
      "user": "geeksterknows"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "of course it was better than the two first movies and worse than the third one. However, I liked that film because there was not again that boring family. The last scene was really frightening and the whole movie is fine.",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2013
      },
      "score": 1,
      "text": "This movie is like watching paint dry. NOTHING HAPPENS!? the whole movie is a waste of time and the jump scares are so predictable they don't work. A lot of the time I could not understand what the characters were saying because they whisper or mumble most of there lines. This movie is mostly staring at things walking or running past in the background but that's it nothing happens until the last 10 minutes of the movie.",
      "total_reactions": 0,
      "user": "TheRubixGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "This review was published on www.Pixcelation.com by Andrew Korkmas.",
      "total_reactions": 0,
      "user": "Pixcelation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "Awful horror nothing scary about it is the stupidest horror ever who ever got scared are whips you would fall asleep watching it thats how boring it is",
      "total_reactions": 0,
      "user": "Manutdrules"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 2,
      "text": "This was indeed one of the most ho-hum horror movies.  Most of the movie relied on cheap scares, and some of the actions in the movie was bizarre.  It borrowed a lot of elements from several different movies but ultimately could not place it all together.  Kathryn Newton was the ONLY good thing about the movie.  On the other hand, Matt Shively was an annoyance and one creepy guy in this movie.",
      "total_reactions": 0,
      "user": "benderrodriguez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "This was one of the worst things ever to be classified as horror ever. Can anyone honestly say that snapping a neck quickly and easily is scarier then dragging a person off camera then silence? No it isn't, it wrecks the pacing and doesn't freak the viewer out as much. This was more of a comedy to me than a horror, watching this series continue it's crash into reality. PA 2-4 summed up with 1 word, flashy. Each death is in plain sight and the jump scares are seen a mile away. This addition to the series only raised more questions than answered, like who the heck is Robbie? Why did Hunter get sent away to only get brought back again (since he was already missing after the 2nd movie they didn't need to posses him, they could have done that in grace period)? What is Toby's goal (I don't mean this to attract any attention to the story, just I'm pointing out that the story had its head up its own plothole)? They explained hunter had to kill Alex, they why did he never hurt her once? Also while on this topic, how did Toby posses Hunter without Hunter killing a single virgin (as stated by the plot)? Am I the only one who thought the mother sounded like she was saying \"weeeeeeee\" as she was dragged up to get killed? I wish I was kidding about that. Did anyone else say \"Here's Katie!!!\" when she was busting through the door (parodying a much better horror film)? Why did it take so long for Ben to get to the house to show that Alex was almost murdered by Toby? Why was there a password to access the footage there to begin with? What even was the purpose of Alex getting levitated by Toby because it was never brought up again? Why did they stop reviewing the recorded footage half way through the film? And finally the biggest question, how did so many people give this movie perfect reviews and completely miss all of these flaws? I only flinched once watching this movie, so it gets an honest and undisputed 1 out of 17 (17 \"jump scares\" only about 8 involved the demon)",
      "total_reactions": 0,
      "user": "TheTwistedKris"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "I don't see the point in making another installment. \"Paranormal Activity 4\" does not have any of the thoughtful ideas used in the previous three, and none of the cameras's positions were detailedly described. You also get random and unrealistic scares in this too, which just makes it really stupid.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2014
      },
      "score": 1,
      "text": "First of all i can't say that i was disappointed since i wasn't expecting much. The entire film is predictable  and downright laughable. There is no tension and the jump scares aren't effective at all. To be fair this was more of a comedy than a horror film.",
      "total_reactions": 0,
      "user": "Hatross"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "text": "Most frustratingly upsetting movie I've ever seen. Waste of time and money. I've never written a review before this one but I felt like I had to so people don't waste their time like I did",
      "total_reactions": 0,
      "user": "austinv"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Paranormal Activity 4 is a movie that will primarily be enjoyed by die-hard fans of the franchise, and I can safely say that I am one of those people. By now, you pretty much know what to expect, but this entry does have quite a few tricks up its sleeve. Unlike the first 3 films, where most of the activity occurs while the characters are sleeping, most of the supernatural stuff happens during the daytime while the protagonist is home alone. This does strike a bit of a different fear because for some reason, houses are always scarier when you're home alone. Another thing that makes this movie stand out is the \"Kinect cam\", which displays hundreds of little dots across the living room when all the lights turn off due to the infrared This makes for some really subtle scares that you might not completely catch on the first viewing. The scares are inconsistent mostly due to the fact that there are quite a few fake-outs in the first half of the film (cat jumping in front of the camera, book falling, etc.), but when the scares work, they're really effective. It's certainly not a high point in the franchise, but it's still a reasonably fun and sometimes scary movie.",
      "total_reactions": 0,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "for some reason when we saw the first paranormal: activity movie i felt this movie was full of dumb-idiotic characters that were trying to kill themselves. Writer/director/ editor/cinematographer of the first paranormal activity Oren Peli, the creator of this franschise tries to pull of lame effects that we can tell is fake but the movie pulls it off so well.  Paranormal 4 is a movie it has characters that yet again try to get themselves killed. I found this film scary (well its a paranormal activity its gonna be full of jump scares!) but it's ok this gets interested but it's the same movie again again again and again! the series should end here. Grade 1.3 D",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "Paranormal Activity 4 is a 2012 American supernatural horror film, directed by Ariel Schulman and Henry Joost, directors of Paranormal Activity 3, and written by Christopher Landon from a story by Chad Feehan. The film features Katie Featherston, who starred in the first film, and had cameos in the other two.",
      "total_reactions": 0,
      "user": "Marick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "Paranormal Activity 4 isn't that scary, but it's very suspenseful. It gives the franchise a modern twist without overdoing it, something that most modern horror movies fail at. Perfect for sleepovers!",
      "total_reactions": 0,
      "user": "MisterSushi7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2015
      },
      "score": 2,
      "text": "They could have called this Paranormal Inactivity.",
      "total_reactions": 0,
      "user": "MovieManiac83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2015
      },
      "score": 2,
      "text": "Esta cuarta parte ofrece mas de lo mismo, una historia confusa y poco interesante y unos sustos bastante malos, algo que me molesta de estas películas es que no se toman el tiempo suficiente para explicar todas las dudas que han surgido desde su segunda parte; ¿que relación tienen estas familias y estas historias externas con la historia original de Katie? no tengo la menor idea. No tenemos ninguna explicación y surgen mas dudas con lo que puedo concluir que ni siquiera los directores tienen idea de lo que están haciendo. Actividad Paranormal 4 no es mejor que su antecesora y sigue con la misma formula que las anteriores (ya saben... mismo final, mismos screamers...)",
      "total_reactions": 0,
      "user": "JohnMasterL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2015
      },
      "score": 5,
      "text": "Decent horror film in that specific genre of movies, some creepy moments, a bit of tension and suspense, but at that point in the franchise, you what will happen and when... You sure will find some frightening moments, but overall it is a movie tired of trying.",
      "total_reactions": 0,
      "user": "Urbanlistener"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 3,
      "text": "It needs to be said, my expectations weren't high for Paranormal Activity 4…well, high considering this is the fourth feature in horror franchise that's part of subgenre (found footage) quickly wearing out its welcome. I found the first three Paranormal Activity movies fantastically haunting with their minimalist approach to displaying the titular phenomena, building from oddities that could be rationalized to totally terrifying and unexplainable violence caught on tape. The locked perspective of their cameras similarly made me feel trapped within their frame, and directing team Henry Joost and Ariel Schulman—of Catfish infamy—took this found footage aspect to a terrifying new realm in Paranormal Activity 3. With these two back for 4, I anticipated not only an intriguing continuation of the franchise's growing mythos, but also some innovative new scares within the format. Unfortunately, the most shocking part of Paranormal Activity 4 is how far it missed the mark.",
      "total_reactions": 0,
      "user": "FilmMasterEd"
    }
  ]
}