{
  "mc_avg_user_score": 5.7,
  "mc_metascore": 53,
  "mc_mixed_rating_frequency": 98,
  "mc_movie_name": "Paranormal Activity 2",
  "mc_negative_rating_frequency": 51,
  "mc_positive_rating_frequency": 113,
  "mc_pro_critic_reviews": [
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2010
      },
      "score": 83,
      "summary": "Even when nothing is happening, the often dead-silent shots tend to grow scarier the more you look at them."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 80,
      "summary": "It delivers its considerable moments of terror in the same way the original film did. But it does deliver."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 75,
      "summary": "Demons of mediocrity, be gone! Here we have a shrewd sequel a touch better than the original."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 75,
      "summary": "What was scary once is scary twice, like a carnival funhouse remodeled with a few new mirrors and spring-loaded spooks."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2010
      },
      "score": 75,
      "summary": "Rarely is the second film in a horror franchise more frightening than the original, but Paranormal Activity 2 has more innocent victims and more scares than its predecessor."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 70,
      "summary": "More of the same, for all the good and acceptably routine that that implies."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2010
      },
      "score": 63,
      "summary": "And again things go bump and eventually yarrrragghhh in the night."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 63,
      "summary": "If you're looking for wicked fun this Halloween, Paranormal Activity 2 is the best goosebump game in town."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2010
      },
      "score": 60,
      "summary": "Unlike the original, Paranormal Activity 2's pacing is uneven; it builds slowly and effectively before rushing too quickly, and at one point not particularly coherently, through the climax. But the jolts, when they come, are bigger, causing actual physical thrills and chills, at least for me."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2010
      },
      "score": 60,
      "summary": "Even knowing what's likely to come-the doors opening on their own, the skeptical characters scoffing at metaphysical explanations, the unheeded warnings from paranormally gifted guests-doesn't make it any less nailbiting to watch."
    },
    {
      "critic": "John P. McCarthy",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2010
      },
      "score": 60,
      "summary": "Serves as both a sequel and a prequel, and the team Oren Peli has assembled deserves credit for beefing up and rounding out his original narrative without letting it mutate into something unrecognizable."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2010
      },
      "score": 60,
      "summary": "Without giving anything away, much of the excruciatingly teased-out tension here echoes the first movie without upping the ante."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2010
      },
      "score": 50,
      "summary": "Paranormal Activity 2 suffers from the excessive expository blah-blah that's so common in horror-movie sequels."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2010
      },
      "score": 50,
      "summary": "The clumsy and obvious byproduct of the financial success of its predecessor last Halloween, this movie has no reason for existing except to provide Paramount Pictures with a few extra shekels."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 50,
      "summary": "Frozen camera setups and blurry night-vision images raise goose bumps without the assistance of eerie music or showy effects, though the strain of stretching the gimmick to a second movie is palpable."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "L.A. Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 50,
      "summary": "Where \"The Last Exorcism\" was sustained by artfully balanced skepticism and a feel for character, Paranormal 2, putatively directed by Tod Williams, can only hold an audience with the understood promise of big jolts around the corner."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 50,
      "summary": "Anyone who has seen the original knows exactly where things are heading, with the result that the proceedings seem far more manipulative than unnerving."
    },
    {
      "critic": "Dennis Harvey",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 50,
      "summary": "Picture fares like most horror follow-ups, offering more of the same to somewhat diminished effect."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 50,
      "summary": "The principle suspense is wondering when the suspense is going to start, as you scan the darkly-lit screen looking for any hint of imminent horror."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2010
      },
      "score": 50,
      "summary": "A confident, cocky and often comic promenade down the same primrose path."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 40,
      "summary": "The impression is less of calculated ineptitude than of seasoned professionals (director Tod Williams made The Door in the Floor) playing dumb, as a checklist of household items-frying pans, endlessly shutting doors, a pool cleaner with a mind of its own-test viewers' reflexes."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 38,
      "summary": "An efficient delivery system for Gotcha! Moments, of which it has about 19. Audiences who want to be Gotchaed will enjoy it."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 20,
      "summary": "Paranormal Activity 2 sinks much lower than it needs to in order to get a rush out of us - and in the end, the rush isn't even that great. The movie puts us through the paces with minimal payoff."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "**** An evil ghost that harasses families-Paranormal Activity 1 and 2 in a nutshell.",
      "total_reactions": 2,
      "user": "Legals"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Well to start off it's definitly better than the first one. I did think the first was bad but clever for what it did on the budget. This is heart stopping. Every time it is night in the house you know that something is going to happen but you don't know exactly how. I believe the larger budget helped this time. It still has 'wooooh the door is moving but what is moving the door' moments and there are some plot inacuracies and confusions but apart from that I was definitly clinging to the person I was with during the final sequences. Awesome and very scary, just dont make a third one...please.",
      "total_reactions": 1,
      "user": "faulkman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "after this franchise got ruined with Paranormal Activity 3, 4 and The Marked Ones, let's talk about its real chapters. so, i love Paranormal Activity! it was just a simple found footage horror movie that had one camera placed in the bedroom to film what happens at night when everybody's asleep. it sounds boring but it was creepy and chilling as hell! so, it was a huge smash hit and it spawned 3 sequels, a Latin spin-off and a fifth movie that comes out later this year. but i'm here talk about the sequel that stays true to the franchise and the first movie, and that's Paranormal Activity 2. it's a prequel to the first movie that shows Kristi's family being haunted by the demon ever since their little son Hunter was born. and i really liked at how true Paranormal Activity 2 stands to the first movie. it's still able to make your hair stand up and make you go pale white, with goosebumps all over you. i swear to god, there were a few scenes in the movie were it got so chilling, that i was just shaking outta control. the first movie did that and this one did it too. now, to be honest: the movie seems to start up pretty slow. like there's nothing really happening in the first act and at the beginning of the second act. but then, when stuff start happening, it's a real **** nightmare for Kristi's family and it just makes your pulse throb. like i said, Paranormal Activity 3, 4 and The Marked Ones were pretty much the same thing, but they weren't creepy. they were just filled with jump scares that irritates the **** outta you. and that's why Paranormal Activity 2 is the best sequel in the franchise so far, cause it actually stays true to the first movie.",
      "total_reactions": 1,
      "user": "NikoZguri1997"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2010
      },
      "score": 2,
      "text": "Most of the film flips through the same static shots where nothing usually happens, except for a bump in the night or some \"paranormal activity.\"  The movie mostly takes place inside some ordinary house, which limits the creepiness and makes it pretty boring to watch.  Ooo, another still-shot of the kitchen...and nothing happens!  Again!  The characters are mundane and foolish, and the film never establishes a true connection to these people.  I really couldn't care what happened to these characters because I barely got to know them.  The plot is pencil-thin, and the ending is anti-climatic and not suspenseful at all - a HUGE wasted opportunity in what should have been the scariest part.  I am being harsh, but I honestly didn't jump out of my seat once.  There are some creepy elements, but the film failed to do what it was supposed to - scare me.",
      "total_reactions": 10,
      "user": "Joe-Cool"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2010
      },
      "score": 3,
      "text": "Trickery... It's nothing else. Not creative, not interesting. Lets make the audience focus on a door for 5 minutes... Do it for so long they are bored and feel tired, then ANYTHING can be done to shock you... Noise, movement and/or with any sound or shape. A total breeze for the film-makers and the first shock is just as lame as the last. I had more fun listening to reactions of different people scream in the cinema. Pretty solid acting however and they made everything believable, I just personally felt it was a waste of time/money.",
      "total_reactions": 6,
      "user": "Joe-UK-"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 6,
      "text": "Paranormal Activity 2 was okay and it's quite scary. I been scared the whole time just thinking about it,but I guess the sequel is more less than the original. It wasn't much as good as the first one,since the first one is really scary to watch and it's the most scariest film of all time. My biggest problem is that they spoil the movie with the teaser trailer and all I could say this is that why we're having a baby and a dog in the scene like this? People concern this teaser the whole time and it does sucked when the trailer shows the audience seeing the movie in green screen since last year. The characters are alright,but not much good as Katie and Micah does. I like the security cameras when they show the scene where the ghost is doing in six shots. It has some lame talking scenes that I didn't interested to hear,all we want is scaring,because we didn't care about the story. It does has the same setting as the the first one and it has the same dialogue too. But this one is the prequel,it tells the story where Katie meet the family and they got spooked in the house before the couple started taping the evidence. It did get scared in four moments with large sounds and it's quite silly in the movie,but I prefer the first one and this sequel is less than scary,not bad and it wasn't quite special.",
      "total_reactions": 3,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2010
      },
      "score": 8,
      "text": "This movie is an example of how a low budget film can acheive some glory.",
      "total_reactions": 2,
      "user": "tech953"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "A rare horror sequel that's every bit as terrifying as the original.  This film had me leaping out of my seat and instilled a palpable sense of dread in the viewer.  Surprisingly commendable for its ability to build on the mythos from the first, without becoming cluttered or ridiculous.  In short, it's tremendously scary and unbearably tense.",
      "total_reactions": 2,
      "user": "grindhouse83"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "Paranormal Activity 2 maintains the essence that it brought one year ago, offers the same scary but yet enjoyable entertainment, and manages to match up to its predecessor, but I still would give the original the edge.",
      "total_reactions": 2,
      "user": "brewcrewpride"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "Maybe the downfall to Paranormal Activity 2 is not allowing the proper spacing for audience reactions to the horror versus tying the story together, as well as the first movie did. Either that, or the story is just too incoherent towards the end. It was very hard to tell in a crowded movie theater. But the movie did have quite a few scares, which is what matters the most. It just ties up too quickly for comprehension which left my entire theater quite unsatisfied, but we did enjoy the ride along the way.",
      "total_reactions": 2,
      "user": "AaronM"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "Honestly  one of te best theatrical released horror films out today! From beginning to end on the edge of my seat. I love horror, I believe it to be an art and they really shot a great one with this paranormal Activity sequel. Smarter than the original and better... and i loved the original. Watch it tonight!",
      "total_reactions": 2,
      "user": "himortal7"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "The movie is definitely worth it...I thought it was wayy better than the first...I enjoyed the whole movie..., even though the ending could have been thought out better...Still good though..A must-SEE!",
      "total_reactions": 2,
      "user": "granoky"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "i would have giving this movie a 10 but the first hour is just to dull and boring and also the acting was the horrible not the worst i seen but its was bad enogh i know acting wasnt the supossed to be the best but they could have tried harder, but other then that the rest half hour or so will scare the crap out of you. it will make you jump or thats at least the people at my theater did haha",
      "total_reactions": 2,
      "user": "moviefreak12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "Absolutely terrifying. At first I was a bit uneasy, as the first half of the movie is very slow to get into anything, but as soon as things started happening, it was incredibly frightening. There are elements from the first movie tied into it, as well, which was nice to see; they expand upon the first film, even tie up loose ends we were left with. My only critique: will not do well in a household setting, just like its predecessor. You MUST see this film in theaters. Go. Right now. I don't care if you're at work/school/prison. Right now. And I'll know if you didn't go! o_o",
      "total_reactions": 2,
      "user": "GVirus16"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "Good story, and excellent story arc to link the two films together.  However, I'm sorry but there was absolutely nothing terrifying about this movie. The first version had more bone chilling moments, and a lot more scenes where one would be scared (not me because I don't get scared by movies) but after gauging the reaction from my partner, who scares easily, and the rest of the crowd, there were hardly any moments in this film that startled the entire audience, or even made my heart almost wan't to jump.",
      "total_reactions": 2,
      "user": "Th3Critic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2010
      },
      "score": 2,
      "text": "One trick pony.  I don't think unexpected loud thumps count as scary, they are lazy and uncreative, which is the basis of why this movie sucked.  The first Paranormal Activity had suspense and the thought that this may actually be real.  Now everyone knows it's not real so instead of trying some new scares they just regurgitated the same \"scare\" moments of the first one (loud noises, slamming doors, shadows, people getting dragged).  I'm not saying that it didn't make me jump (the Kitchen scene in particular was scary $hit) but towards the end it seemed to jump the shark and become comical.  The last 20 minutes I just kept on thinking \"Are you for real?\"  I think the sequel had potential but it was just too poorly done for me to care.",
      "total_reactions": 2,
      "user": "Fulchizzle138"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "text": "worst one out of all Paranormal Activities so far! my opinion but it is, acting is HORRIFYING, when Kristi gets dragged down the stairs it is VERY unrealistic! Only one scene made me jump, I was laughing at some parts.",
      "total_reactions": 2,
      "user": "jennanana"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "It's not a mystery, scale-wise, commensurate to the Star Child's true identity, or the origins of the Monoliths, filmically cosmic mysteries that Peter Hyams clarified in his rightfully maligned \"2010: The Year That We Make Contact\"(the sequel to the Stanley Kubrick masterpiece), but it's still anti-climactic, regardless of the differentiation in pedigree, when the filmmaker literalizes the once heretofore unexplainable materialization of a burnt family photo in Micah Sloat's attic, and in the process, ruins the most enigmatic moment from \"Paranormal Activity\", the Oren Peli-directed original. So now we know, to the detriment of the original film's mythology, that among the moving things and unexplained noises in the Sloat household, there was, in retrospect, some normal activity, as well, some debunking, some collaboration with the unseen forces, in which man is shown to be capable of an evil far worse than any demon. Daniel(Brian Boland) orchestrates a transference, acting on his Latino housekeeper's instructions(not only do they clean houses, they clean souls, too), Kristi's husband sets a photo of Katie on fire, and is presumably the one who does the planting. Let the picture in the attic just be; let the Monoliths be. So now we know: both sisters married jerks. Daniel probably sleeps on the wrong side of the bed too, a coward, just like Micah, who in \"Paranormal Activity\", sleeps on the side farthest away from the doorway, so should a demon enter the bedroom, given the positioning on their bed, Katie looks like the brave one, since she's the first warm body that the poltergeist would encounter. Micah, by all appearances, uses Katie as bait, a means by which the amateur filmmaker can get the best-possible footage of their unwanted guest attacking his girlfriend. In \"Paranormal Activity 2\", it's the baby who takes the brunt of the supernatural malfeasance, with only a German Shephard, the family dog, standing sentry; a German Shephard who is no Lassie, since he fails to make his owners understand that they have a situation far worse than Timmy being stuck down some well. He doesn't bark loud and long enough. Too bad \"Paranormal Activity 2\" wasn't one of those talking animal films, if it was, the dog could tell his human owners to get the f*ck out, now. Speaking of talking dogs, what would Scooby-Doo say? Probably something along the lines of, \"Ruh-roh. The baby is sliding across the side of his crib. This is scarier than the Blair Witch twigs.\" Poor baby. Nobody thinks to check the playback on the surveillance footage that details the 'round-the-clock nursery going-ons, even though the family reviews the mystery of the gallivanting pool cleaner, and also the slamming door which locks Ali(Molly Ephraim) out. As is the case in all horror movies since time immemorial, the people are kept in harm's way due to the advice of the rational one, the singular hold-out to the new reality that defies reason, who ends up getting everybody killed, because of his(it's usually a guy) unbending stance against the mounting evidence which points to escape as being the most prudent course of action. In \"Paranormal Activity\", the couple stays because Micah wants to finish his movie. In the sequel, there is no such egocentric(Micah is willing to risk his girlfriend's life for his own selfish reasons), albeit intellectual basis for the family to remain as housemates with the devil. Daniel is just a tool. When it's too late, he turns to Martine(Vivis), the Hispanic maid he fires for being too superstitious. Ever the tool, with Kristi beset in a catatonic state(and in a biting mood), Daniel still gives his housekeeper static, as he protests in disbelief at having to use a cross for the purging. So now we know the pretext behind Katie's true identity, and just like the Star Child, our understanding of the circumstances that made them who they are, while may be interesting in a cursory way, a gimmick to drive each respective sequel, it threatens the purity of both \"2001: A Space Odyssey, and to a lesser, but proportionate degree, \"Paranormal Activity\", as well.",
      "total_reactions": 3,
      "user": "Shiira"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "\"Paranormal Activity 2 is a Halloween treat it brings the chills & thrills and is scary and more compulsive than the original , Tho the build up to the \"final nights\" are slow, its worth the shockingly and frighting conclusion that will have you screaming\" .. A-",
      "total_reactions": 3,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 1,
      "text": "This movie was like watching a funny porno with slight rumbling noises throughout. The reason i called it a porno is because the only thing you give a damn about is the girls breasts. Oh by the way, the ending is spectacular you wont be angry at all. Its not like all of the characters die. Oh god i just gave away spoilers.",
      "total_reactions": 7,
      "user": "Seba"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2010
      },
      "score": 1,
      "text": "I went into the film with fairly low expectations, but the real thing was worse that I could have predicted. The whole film was just long periods of noiseless filler between loud noises, as though this passes as some kind of entertainment or fear factor. Nearly all the plot elements were as thin as tissue paper, me and my friend were able to predict throughout; loud bang in the next 5 seconds, somethings going to move in here, etc. I say plot, but there wasn't really one to speak of, it was more or less a series of non-sequential events with slight connections towards the end. Of the 90 minutes there's probably only 10 minutes of footage where something even remotely interesting is going on. To be honest I have absolutely no idea how anyone can be giving this film a rating of more than 2/10, unless they were involved with the film, are critics who have completely lost their integrity to a pile of cash, or have the mental prowess of a toddler. Perhaps my complete and utter cynicism towards the paranormal and my utter belief in the natural sciences doesn't help but I don't care. In fact the only time I was entertained was by the terrible effects, which made me laugh out loud.",
      "total_reactions": 1,
      "user": "Weejocky"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "A good scare movie, maybe this sequel is even better than the first. Definitely enjoyable. Another reviewer complains about the acting; sure, it was flawed, but the level of acting is not a reason why anyone should see this film. You're going for the suspense and the artful surprises, of which this film has plenty.",
      "total_reactions": 1,
      "user": "wrytyr"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "It wanted to help to explain some of the \"mysteries\" of the first film. I enjoyed the characters progress through the demon's hijinks as well as the nanny's interpretation of  events.",
      "total_reactions": 1,
      "user": "gknewell"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "This isn't scary. It's startling. There is a difference. Anyone that gets truly scared by this has some serious issues. A bunch of quiet followed by a loud noise isn't scary. There were, however, a few funny parts. The baby being pulled up the crib - funny. The fact that the pool cleaner creeped my girlfriend out to no end - funny.",
      "total_reactions": 2,
      "user": "AtrocityMarch"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "This is a good movie to see with a few friends if you are looking for a good scare. although this movie does have its really fun good bits its a bit slow with the scaring. which is quite bad because we are living in the 21 century meaning the kids these days want more action and horror and less full detailed story so if you want a horror movie thats pretty scary but slow at the same time then watch this movie and you will love it.",
      "total_reactions": 2,
      "user": "chelsea_rawrr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2011
      },
      "score": 3,
      "text": "Now this was better, I didn't have to give this movie a 1/10 like the last one. However, that doesn't mean that it was good. It was mediocre at best. The movie started off slow just like the other one, but jumped into the \"scares\" sooner. The scares, they weren't very good at all. They just sort of happened and they obviously weren't very thought out. Also; what the hell is up with this being a prequel, at the end, the possessed woman from the first movie comes to the house and kills everybody except for the kid. Just cause they were related doesn't mean she could walk all that way without someone seeing her. One last thing, why do they feel that they have to show shots of the pool every 10 minutes? Overall, this movie was better, but still not good enough to impress me in anyway.",
      "total_reactions": 0,
      "user": "gamefriek"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "Pretty much just like the first. I do enjoy how the first is incorporated into this one, so they happen simultaneously instead of back to back. It ended kind of abruptly, but was suspenseful throughout without even doing anything. It helped that the theater was full, but a good movie anyway.",
      "total_reactions": 0,
      "user": "dijavantewow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2011
      },
      "score": 6,
      "text": "The mbut not psychological fear as the 1st one succeeded in. But films like these are much better than other horror movies. ovie is alright. Its not scary at all as the 1st one was. I like the connection of the stories though. The acting is great, not bad at all. You will get bored 45 minutes in. The movie tries to build suspense but fails. Its mostly spooks,",
      "total_reactions": 0,
      "user": "andyeddy8"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 0,
      "text": "Incredibly boring in every aspect. I don't even remember the names of the characters, since a reason to care about them at all is never given. They're just bad actors trying to look natural, very similar to MTV's reality show stars. There is no suspense here--we get a massive amount of footage where *absolutely nothing happens at all*. The idea seems to be we're waiting for something to happen, and that's the suspense, since once in a while we get a...bump in the night, maybe. Not exactly frightening. The ending that it advertises as shocking is absolutely nothing. The original wasn't exactly a classic by any means, but this one is significantly worse. The movie is unsatisfying from beginning to end. Seriously, almost nothing happens at all. What does happen just isn't worth the effort to get there. Yeah, it ties into the first one at the end, but not in a way that really means anything at all. It's just thrown in there. There is no suspense, horror, or anything to keep you awake. It just repeats the same shots over and over, in which nothing happens most of the time. And you have to wonder, \"This is supposed to be frightening?\" when it isn't. Ugly stuff, totally boring, completely useless. Don't even rent it.",
      "total_reactions": 0,
      "user": "solutions10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2010
      },
      "score": 5,
      "text": "Paranormal activity 2 had the big hype as everyone though but it was okay and it's quite scary. I been scared the whole time just thinking about it, but I guess the sequel is more less than the original. It wasn't much as good as the first one, since the first one is really scary to watch... My biggest problem is that they spoil the movie with the teaser trailer and all I could say this is that why we're having a baby and a dog in the scene like this?   The characters are okay, but not much good as Katie and Micah does. I like the security cameras when they show the scene where the ghost is doing in six shots. It has some terrible talking scenes that I didn't interest to hear, at all because we didn't care about the story.  It does have the same setting as the first one and it has the same dialogue too. But this one is the great, it tells the story where Katie meets the family and they got spooked in the house before the couple started taping the evidence. It did get scared in four moments with large sounds and it's quite silly in the movie, but I prefer the first one and this sequel is less than scary, not bad and it wasn't quite special",
      "total_reactions": 0,
      "user": "RumAthwal_1200"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "didn't see either movie in the theater. i almost think its scarier watching it at home by yourself. maybe im missing the point but i still think that as far as horror movies go these movies are some of the scariest movies ive ever seen. p.a.2 is pretty predictable if you've seen the first but it still leaves you feeling very uneasy in the end. the one shining improvement this movie had over the last is a lack of an alternate ending, at least as far as i could tell. the alternate ending in the last movie destroyed all since of realism for me, and being that it was shot in home movie/blair witch style i consider it p.a.1's biggest downfall. this movie and a few others like it (p.a.1, the fourth kind, etc.) are the only movies i know of that illicit  this kind of uneasy nervous feeling, which is exactly what a horror movie is supposed to do.",
      "total_reactions": 0,
      "user": "jthompson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "I didn't go into this movie with particularly high expectations. I enjoyed PA. I thought this script was smarter and this movie was a little better than the first. Yes, it's slow. Yes, there are a lot of static shots. That's how things happen when you're at home and you hear something odd at night.",
      "total_reactions": 0,
      "user": "CriminalType"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 6,
      "text": "This was, overall just as scary as the first but I do have a bone to pick with it.  I think the movie should have had a completely separate story line instead of feeding off of the first one.  I didn't like how the two movies linked together.  It was predictable which in the first one, was not.  It was worth watching, I just didn't like the ending very much.",
      "total_reactions": 0,
      "user": "jdrandall38"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2010
      },
      "score": 5,
      "text": "Roger Ebert aptly identified the character of this film when he called it \"an efficient delivery system for Gotcha! Moments.\"  It is an enjoyable movie-going experience, but there is little substance to the development of the plot.  The pace is questionable, and the effect of ending is marred by this film's poor attempt at being both prequel and sequel.  With that said, the moments of shock and suspense might be enough to make this movie worth its ticket price.",
      "total_reactions": 0,
      "user": "jamesnotmercer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2010
      },
      "score": 4,
      "text": "I have to admit that I hadn't seen the first movie, and was even a bit fearful to see this attempt, but overall i enjoyed it.  The director's use of a documentary's \"authenticity\" works brilliantly in this case, although he relies too heavily on loud noises unexpectedly etc.  I  did find it frightening (at times) although I scare rather easily.  The film did not really get going for an hour, and from what I could gather, did a nice job of weaving the first movie into its plot.  It won't win any awards, but it gets the job done if you're up for a scary flick.",
      "total_reactions": 0,
      "user": "Jasonvita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2010
      },
      "score": 5,
      "text": "This movie was better than the first when looking at the scare factor. Though when you look at the story it is lacking. Showing the camera angles every time to drag out the movie even though there is only a single movement in the baby's room is pointless. Leaves no suspense like it is supposed too and they never caught on.",
      "total_reactions": 0,
      "user": "Ruler101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2010
      },
      "score": 6,
      "text": "I definitely liked this one better than the first one. This one had a plot that was moving and even though the first one came with more surprises, this one had more scary moments. Overall, I wouldn't watch this movie more than once.",
      "total_reactions": 0,
      "user": "TENCATIJA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "Sure, the sense of discovery you got from the first Paranormal Activity may have been diminished, but thanks to better pacing, a better script, and more engaging characters, Paranormal Activity 2 is scarier and better than the first. Let's hope 3 is good as well!",
      "total_reactions": 0,
      "user": "Moviebuffreview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "Tweaked scares and added characters to deserve better ratings but still no better and no worse than the first. Pretty much an upgrade of the prequel but still a good watch nonetheless.",
      "total_reactions": 0,
      "user": "PurpleUrp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 1,
      "text": "Seems like the writers of the movie still think that thumps and bangs is still scary! But obviously these writers must have no backbone at all if they think a bunch of noises is frightening.",
      "total_reactions": 0,
      "user": "Spyke"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "If you have to pick a scary movie and looking for more thrilling, I really recommend you not to pick this movie. If you had already watch the first paranormal activity you know what I mean. On the other hand this movie is pretty unique.",
      "total_reactions": 0,
      "user": "WaGyu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "â",
      "total_reactions": 0,
      "user": "monkeybrainspit"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "While this wasn't as unnerving as the first film -- which was genuinely terrifying -- once the action picks up in the second half, PA2 delivers one creepy moment after another, while skillfully weaving in and expanding on the storyline from the first movie.  A fun one to watch at night, alone, with the lights turned off.",
      "total_reactions": 0,
      "user": "CClark"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "The first PA wasn't bad at all, I liked it, but I enjoyed PA2 a lot more, some people say that the first one is better, but I, personally, think this one is a lot better, I won't say it's perfect, but it's good, you get more characters to care about, more suspense, more scares. To be honest, I expected almost nothing of this movie, but it really surprised me, it really caught me off guard. And I never saw this at theatres, I rented it one Friday night and watched it at home with low volume and it still scared the sh.. out of me. So, if you've seen the first movie, you already know what you're in for, and for those who haven't, be sure to check out PA first.",
      "total_reactions": 0,
      "user": "bluburn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "Even if it's a bit overlong and brings nothing necessary to the series, Paranormal Activity 2 is a sequel that surprisingly may be scarier than the first film. Pros: Even scarier than the first PA; the ending is shocking too; it's more or less a prequel, but it still works. Cons: Overlong; it's difficult to find any \"likable\" content about the series overall.",
      "total_reactions": 0,
      "user": "KendylKlownfish"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2011
      },
      "score": 4,
      "text": "For this sequel, the filmmakers decided to go with the idea that more is better.  There are cameras than just the one from the last movie and there are more characters than just one couple.  But more does not make better.  In fact, it decreases the suspense.  More means there is less 'alone' time for the characters.  Also, the fear is spread amongst more people; therefore, it is felt less by each.  The film Paranormal Activity scared the crap out of me.  There were long, static shots of a room and an occasional event.  This time, the long shots are much shorter and since there are multiple cameras, no room is the main focus like the bedroom was last time.  Furthermore, there was no build up to an event last time.  A door would slam or the sheet would rustle all without warning.  Now there is a low, rumbling bass noise which signals a coming event.  This takes most of the fear of anticipation out of the scene.  The plot is actually connected to the previous film but I won't give away how.  The idea of a sequel to Paranormal Activity is fine and the script works...but there is too much activity going on to make it truly paranormal.  If you haven't seen the first one, I highly recommend it.  Skip this one.",
      "total_reactions": 0,
      "user": "CitizenCharlie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2011
      },
      "score": 6,
      "text": "PA2 felt like it played off the first film way too much, even copying certain scenes almost identically.  It's creepy but rarely to the point of any real thoughtfulness or tension.  About three-quarters of the way in I found myself thinking it was becoming slightly ridiculous and even predictable.  The fright levels don't quite match up to the previous attempt, and the performances of the cast never reach the claustrophobic believability managed in PA1.  Having said that, it's worth a watch, albeit far less real and far more movie-like.",
      "total_reactions": 0,
      "user": "mjwilliams84"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2011
      },
      "score": 6,
      "text": "It has it's scares, just not as good as the first one. I feel scammed when i watched the ending. It was so rushed. But definitely  has to be a good scare movie.",
      "total_reactions": 0,
      "user": "jstrickler872"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "More of the same without the unknown factor of the first movie makes this a disappointing sequel and despite a few moments that may have made you jump there was very little here to shock or surprise. Although it tied in the events of the first movie well this could have been a much better movie if they could have made the \"activity\" less predictable.",
      "total_reactions": 0,
      "user": "rotku"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "Paranormal Activity 2 is a film, like the first, I originally disliked, but then decided to re-watch it and I enjoyed it, but the film, also like the first, lacks true horror and relies on jump scares and doesn't have the inch of creepiness the first one had. But besides though, I thought it was entertaining with better acting and characters than the first and with plenty of unintentional humour to be enjoyed.",
      "total_reactions": 0,
      "user": "BrandonB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "The paranormal activity movies are not for everyone but I have enjoyed them and have appreciated its simple but effective film making. The characters aren't the best but I had fun with its approach to the folk lore of haunting demons and its effective use of spooks and scares. Many scenes are intense and effective and its film makers have managed to turn its low budget weaknesses into strengths.",
      "total_reactions": 0,
      "user": "davenbettridge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "The way this movie was linked to the first was executed perfectly. Like the first, it had good scares and a lot of scenes that make you jump off your seat.",
      "total_reactions": 0,
      "user": "Jfilo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "While it's more of the same, Paranormal Activity 2 is one of those rare sequels where the director manages to get everything right -- in this case, the thrills, chills, and twist ending.",
      "total_reactions": 0,
      "user": "asjklas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2011
      },
      "score": 1,
      "text": "Awful, simply awful. 91 Minutes of my life i will never get back. About as scary and un-nerving as scooby doo, an hour and a half of watching still images of a kitchen and a swimming pool do not a good film make!",
      "total_reactions": 0,
      "user": "paulyh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2011
      },
      "score": 4,
      "text": "Although the movie does have some good scares that'll make the hairs on the back of your neck stand up, it does not live up to the original or build off the creepy premise.",
      "total_reactions": 0,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2011
      },
      "score": 6,
      "text": "In essence, more of the same. I can't be sure but almost everything that happened here happens in the previous PA film, which isn't a terrible thing if you enjoyed it. I found neither film scary, though one of the 'bumps' made me jump. The shame. Still, not bad considering its low budget - good for an evening's entertainment - still, it's quite nonsensical at times.",
      "total_reactions": 0,
      "user": "AlienSpaceBats"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "great thriller  even better then the first one. and the main reason is cause the of the multiple camerars as you saw evrything little movment. The ending was just awsome as it was one of those WTF moments. the acting was crap but if made up for in scares and its story fit perfectly into the first one. This is simplify one of 2010 best a must see.",
      "total_reactions": 0,
      "user": "moviesRawsome"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "Despite the poor reviews this sequel received, I actually thought it was okay. It tried to be the first film, but bigger. The ending disappointed me, and some of the sequences were pretty repetitive. The poor reviews, however, are understandable. Once you've seen the first instalment, the novelty of the franchise can somewhat wear off.",
      "total_reactions": 0,
      "user": "alexandergreen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "A couple of clever moments aside, this \"Activity\" doesn't earn the atmosphere it tries to replicate from the first genuinely frightening installment.",
      "total_reactions": 0,
      "user": "LetzTalkMoveez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "Paranormal Activity 2 seems to have just dropped some things behind that made the first installment a successful film but keeps you entertained and leaves you a tad bit freaked out.",
      "total_reactions": 0,
      "user": "IAmPhongNguyen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2011
      },
      "score": 1,
      "text": "If you think stomping noises and screaming is scary then it'll give you nightmares, but seriously the only scary part was the blaire witch scene (also known as the part where they went down the basement scene.)",
      "total_reactions": 0,
      "user": "infinityqs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "*UPDATED REVIEW!*Paranormal Activity 2 is a film, like the first, I originally disliked, but then decided to re-watch it and I enjoyed it, but the film, also like the first, lacks true horror and relies on jump scares and doesn't have the inch of creepiness the first one had. But besides though, I thought it was entertaining with better acting and characters than the first and with plenty of unintentional humour to be enjoyed.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "In my opinion, although still not convinced, I still consider this a small improvement compared with a few more scares, the film has a pace faster than the first. But still there are many slips and confusing scenes.",
      "total_reactions": 0,
      "user": "vini1904"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2011
      },
      "score": 2,
      "text": "I still remember sitting in theater wondering if I should leave. This was a horrible sequel to a great original. I found no character development and 40 minutes of this movie is extremely normal and boring like watching a horrible reality show where nothing happens. Don't waste your time on this movie.",
      "total_reactions": 0,
      "user": "GreatreviewDmac"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2012
      },
      "score": 4,
      "text": "The sequel to the 2009 surprise hit Paranormal Activity, doesn't quite live up to the expectations of its predecessor. Whilst the first film had a frightning and suspenseful buildup to its epic climax at the end, this flick provides uneven scares that kill the mood. The acting in itself was nothing to be desired. I know there's a third feature in the series and with a forth on the way (due to be released in 2012) I hope the , franchise can redeem itself. P.S. If a large family is introduced in the next installment I'm going to scream!",
      "total_reactions": 0,
      "user": "eTurkey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "I don't have much to say about this one. It wasn't bad, A little more hokier than the first, definatly not as scary, but still pretty entertaining for what it was.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "Using many of the techniques prominently featured in the original film, the sequel falls short of the same brilliance. It has its moments, but not enough to expand the series positively.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "This one is way **** scarier than number 1 and number 3 combined, this one is **** creepy and intense for the whole movie. If you hate on it, then your a piece of **** **** ass prick ****",
      "total_reactions": 0,
      "user": "ryanlopez1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 2,
      "text": "Once again another boring, dragged out film that offers nothing scary or to be taken seriously. The second installment is equally as bad as the first and  offers the same tricks.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "Seriously, this movie is a lot of things, but scary is certainly not one of them. Nothing happens that is worth giving two cents about. Devoid of anything that actually qualifies as a horror movie.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "\"Paranormal Activity 2\" is just a complete repetition of the first film. Its pacing is uneven and all we're getting here a couple more new scares that we did not see in the first. People who have seen the first film will have learned some of the tricks, and therefore the scares might not be as effective as the first.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2014
      },
      "score": 1,
      "text": "I actually really like the first paranormal activity. But this is just awful, it takes everything that made the first one great and doesn't use it. The pacing in this film is woeful, where in the first film it builds up slowly, so you absolutely poo yourself at the end, this film decides to have \"big\" scares throughout, which completely undermines the whole film and leaves you just bored to tears.",
      "total_reactions": 0,
      "user": "Satiricalewok"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2012
      },
      "score": 7,
      "text": "The sequel to one of the scariest films in history is basically a repetition of the first, we do finally get to delve a bit more into Katie and her sisters past, and the addition of other characters works well. It is clear a larger budget is present, we see more trickery that wasn't present in the first, but it just feels like a repetition with added back story, and even some of the story is the same. Still scary, but just good, not brilliant.",
      "total_reactions": 0,
      "user": "charlieW24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 0,
      "text": "I really wish I had never seen this film. It wasn't scary and nothing happened for around 45 minutes. That is far too long to watch a mechanical pool cleaner cleaning a swimming pool. Definitely the worst film I have ever seen.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2013
      },
      "score": 3,
      "text": "Paranormal Activity marks as the strange case, in which the sequel (ok, it's actually a prequel) is better than the original film. However, the 2nd part of the horror movie series is still a bad film. While there are some nice scenes and I like the fact that it's highly related to Paranormal Activity, it's still a cheap horror flick that culminates in another strange ending (it's nothing against the stupidity of PA's conclusion, but since those two are very related to each other, this one's also quite dumb.) Additionally, it takes itself 72% of the runtime to present the first jump-scare, which is a shame for a movie of this genre. And if that wasn't enough, all of the jump-scare moments are stupid as hell and I personally think that the vibe of these movies is very boring.",
      "total_reactions": 0,
      "user": "axelkoch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "Absolute dross. At least half the film is dominated by a myriad of hidden camera shots that show nothing of interest. It's an attempted thriller gone awry.",
      "total_reactions": 0,
      "user": "MouthofSauron"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "\"A great sequel \"",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "This film is okay, but the first film beats this and the third hands down. I felt like this film was trying to step it up from the first but in a way that took from what made the first film so scary. I personally found the first film absolutely terrifying, I don't think I've ever seen a film that shook me up in quite the same way. That was because it was all so subtle and relied so heavily on your imagination to make it work, and I just don't think the second film valued that as much as it should have done. Certain scenes were okay and pretty creepy, other scenes just screamed 'strings' at me which immediately broke my connection with it. Things happened in the first film that looked real and possible and the action built up, only to peak pretty much at the end of the film. I felt like this film started at that high and the smaller, subtle things from the first were brushed aside a little too eagerly. Overall, if you find these sorts of films interesting to watch then you'll probably like it regardless of its slightly more 'obvious' nature. It won't compare to the first but it's in no way a bad film.",
      "total_reactions": 0,
      "user": "Nixy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "The filming style is good and the jump scares are present, however there's no real frights to be experienced with the exception of the finale which is relatively scary.",
      "total_reactions": 0,
      "user": "Jack97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2012
      },
      "score": 2,
      "text": "How is this movie considered scary? How is nothing going on scary? How is a pool cleaner scary? It isn't! Somehow the director of this film manages to waste another hour and 30 minutes of my time of nothing happening. The only thing I can praise about this movie along with the first film is that Katie is scary when she is possessed. Maybe not Anthony Hopkins as Hannibal Lecter scary but still scary. But even then there's more problems; the most eventful moments happen in the last ten minutes. Why not flesh that out into a full length film? Its sickening that this is considered good filmmaking and I weep at this heinous state of film.",
      "total_reactions": 0,
      "user": "MetalMovieNerd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "Some of the scares were cheaper than expected, but it was frightening and entertaining overall.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2013
      },
      "score": 1,
      "text": "Loses its interesting terror from before, leaving this crap as a confusing and obvious not really happening sequel to the Paranormal franchise.",
      "total_reactions": 0,
      "user": "TheWalrus2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "It is terrifying, thrilling, good and scary, but not new, it is all cliche from the first movie, it adds nothing, just different place and time, the scares are renewed but still.",
      "total_reactions": 0,
      "user": "HaithamBayazeed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Way better than the fourth one. Not quite as good as the third one though. But extremely scary and it gets your heart pumping. Even when nothings happening, you will still be in a state of high anxiety.",
      "total_reactions": 0,
      "user": "mds03"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2013
      },
      "score": 3,
      "text": "Better then the last one but \"Scary bumbs and things falling\" ISN'T SCARY ANYMORE HOLLYWOOD. I mean this film again no plot just a haunting house story. Scary Movie is probably scarier then this, no it is scarier then this. If you watch this and you jump once then you are the weakest scariest punk in the world. Little harsh but true.",
      "total_reactions": 0,
      "user": "MarkMusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2015
      },
      "score": 7,
      "text": "PA2 may struggle in its first half with terrible structure, however once that nights rack up and the noises get loud, we discover a truly terrifying squeal that works well for a 2nd time around. Unfortunately the movies creepy atmosphere is lost and the movie relies more on frequent jump scare. But lets not forget the well told story that builds excellently on the 1st. Bring on more Paranormal activity!",
      "total_reactions": 0,
      "user": "busbfran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "It was better than the first one and wore than the other one. The plot continues and it gave me some quite good chills",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "\"PA 2\" is just a rehash of the first one, with nothing new to offer. But, the same formula as the first one (jump scares, implying rather than showing) goes in, and the product isn't that bad.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "This is clearly the best Paranormal Activity of them all. Paranormal activity 1 was Ok, but 3 and 4 sank to the bottom. The actors actually fell like there scared, I got scarred most of the time, always pointing out to my friend \"Look at that\" or \"Oh my god, Look!\". The ending was the most interesting part of the movie, sure it was Ok but was creepy. The movie had a good story line, believable actors, and some amazing screen shots. This is a must own movie. Must own!",
      "total_reactions": 0,
      "user": "TheEpicSheep"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2014
      },
      "score": 6,
      "text": "This film is focused less on storytelling and more on the horror, which most of the time it does not deliver on. I was not scared at all when I watched this, although I do have to give credit to the film makers for coming up with some clever paranormal sequences, boosting my score for this film.",
      "total_reactions": 0,
      "user": "SQG_Slasher"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "Paranormal Activity 2 almost scares you as much as it did the first film, and almost carries it to a more enjoyable level. The good thing about watching Paranormal Activity 2, is that it fits in splendidly with the 1st film, so instead of going onto a completely new story, it more or less works as a sequel, and makes a lot more sense out of the 1st film. So yes, the scares are there, even if they take their time, and it's brilliantly entertaining, but I couldn't help but wonder, if perhaps creating a sequel was at all necessary? Perhaps, in full, they should have just let the first film be.",
      "total_reactions": 0,
      "user": "Muddsjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "Paranormal Activity 2 is such a terrible movie. It's so incredibly boring, it's not even scary, and the only reason I rated the movie a 5 is because of the ending.",
      "total_reactions": 0,
      "user": "chw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "Paranormal Activity 2 brings back the same found footage style that the first movie had and it has a direct link to the first movie with Katie Featherston and Micah Sloat returning for cameos in the sequel. The budget was exponentially bigger for this edition despite the whole film taking place on one location just like the first film. I like the way that the film involved a true family rather than just a couple. That dynamic made the horror all the more terrifying. There are some points where the main character is switched around and it seems like the story would have worked better with one character being the focal point. It takes a little while for the movie to get going but I was completely engaged for the whole second half. All the characters manage to stay likeable which I could not say about Featherston and Micah Sloat in the first movie. The horror is very much the same as the horror in the first movie but I actually found it more scary than its predecessor. Paranormal Activity 2 is a good watch for any horror fan, but I insist that you watch the first movie before the second because there is some very important connections between the two films that really come into play later.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "Paranormal Activity 2 is a 2010 American supernatural horror film directed by Tod Williams and written by Michael R. Perry. The film is a prequel to the 2007 film Paranormal Activity, beginning two months before and following up with the events depicted in the original film.",
      "total_reactions": 0,
      "user": "Marick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Like most horror sequels, Paranormal Activity 2 is bigger and bolder than its predecessor, but more importantly, it's almost as good as the original. There are a couple more characters in this movie to make it a bit more interesting. The inclusion of the dog, for example, ups the creep factor whenever he's growling at something that isn't there. The scares and particularly the ending makes Paranormal Activity 2 a bit flashier and busier than its source material, but it's never so in-your-face that subtlety is compromised. The same pacing issues that were present in Paranormal Activity 1 are on display here, but if you enjoyed the first movie, you'll like this one.",
      "total_reactions": 0,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2014
      },
      "score": 0,
      "text": "Este filme não é de forma alguma assustador. A maior parte nem parece filme de terror, só no final que aparece alguma coisa. Anteriormente, só aparece o fogão em chamas e colheres caindo. Me poupe. Um péssimo filme.",
      "total_reactions": 0,
      "user": "f3l1p3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2015
      },
      "score": 2,
      "text": "Definitivamente no es mejor que la primera, la historia se siente demasiado forzada, es decir, intentan crear una saga donde la historia apenas y es disfrutable y ni siquiera es entendible, lo único e interesante y a la vez divertido y aterrador de la primera película se pierde completamente en esta segunda parte, ofreciendo mas de lo mismo, pero peor y aburrido a la vez y con sustos simples y poco originales.",
      "total_reactions": 0,
      "user": "JohnMasterL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "Regardless of how it performs at the box office, this much is clear: Paranormal Activity 2 is a mistake. The clumsy and obvious byproduct of the financial success of its predecessor last Halloween, this movie has no reason for existing except to provide Paramount Pictures with a few extra shekels. Although its release does not represent an outright insult akin to the one offered by The Blair Witch Project 2, its superfluous nature not only ranks this as a waste of time but diminishes the original.",
      "total_reactions": 0,
      "user": "MovieManiac83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2015
      },
      "score": 6,
      "text": "Decent follow-up to the first entry in the franchise. The exact same formula, but just less surprising. It's a cash grab, but it is still well made and enjoyable as popcorn flick.",
      "total_reactions": 0,
      "user": "Urbanlistener"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "We've seen it all before. Just last year, in fact, in the first Paranormal Activity. But, hey, people Trick or Treat every October, so why not see the same movie with slightly better production values? The first PA cost $15,000, real chump change. This one set Paramount back $3 million. Still cheap, but you see where I'm going. The first PA took us by surprise and became a huge hit. Naturally, it had to spawn a sequel. Gordon Gekko may reform in the Wall Street sequel, but Hollywood has never stopped believing, \"Greed is good.\" And PA 2 is good, at least in the sense of being serviceable for getting you squirming in your seat.",
      "total_reactions": 0,
      "user": "FilmMasterEd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2016
      },
      "score": 4,
      "text": "Don’t Spirits Ever Knock Anymore?",
      "total_reactions": 0,
      "user": "MovieMasterEddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2016
      },
      "score": 4,
      "text": "Having not seen the first one, things I say may be inaccurate, e.g., being original, etc.",
      "total_reactions": 0,
      "user": "Thatmoviesdude"
    }
  ]
}