{
  "mc_avg_user_score": 5.0,
  "mc_metascore": 36,
  "mc_mixed_rating_frequency": 23,
  "mc_movie_name": "Parental Guidance",
  "mc_negative_rating_frequency": 27,
  "mc_positive_rating_frequency": 32,
  "mc_pro_critic_reviews": [
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2012
      },
      "score": 75,
      "summary": "Parental Guidance is an engaging comedy that bridges multiple generation gaps, making it that rare movie that grandparents, their kids, and their kids can enjoy."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2012
      },
      "score": 60,
      "summary": "Crystal and Midler are such confident pros that their crack timing elevates even substandard material."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2012
      },
      "score": 60,
      "summary": "This is the first time in ages some of the old stand-up Crystal shows through, flashes of quick wit instead of Borscht-belt antics. Not to the extent that it used to in such movies as \"When Harry Met Sally ...\" (which was, ahem, 23 years ago). But better than you'd expect...Just like the movie."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "Parental Guidance is one of those intergenerational embarrassment comedies in the \"Meet the Fockers\" line, where children can enjoy seeing grown-ups looking ridiculous."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2012
      },
      "score": 50,
      "summary": "The pathos: considerable. The sight gags, involving Crystal puking chili dog on a kid's face, or the grandson with an imaginary friend peeing and causing an X Games skateboarder to wipe out: artless. The results: tolerably amusing."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2012
      },
      "score": 50,
      "summary": "In the occasionally funny but mostly facile '80s-style culture-clash comedy Parental Guidance, Billy Crystal, who now resembles a very cute puffer fish, plays Artie Decker."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2012
      },
      "score": 50,
      "summary": "It could be worse, and would be without Bette Midler or Marisa Tomei."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2012
      },
      "score": 50,
      "summary": "Perhaps anticipating an older audience, most of the lessons are one-sided, with the old-timers seemingly harming the children while actually saving them."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2012
      },
      "score": 50,
      "summary": "Parental Guidance is overly generous with regard to the silliness. However, it's not clueless. Crystal seems determined to give as generously as he gets. When a bully whacks him, Crystal covers the bully in vomit. Good for him."
    },
    {
      "critic": "Michael Rechtshaffen",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2012
      },
      "score": 50,
      "summary": "Billy Crystal and Bette Midler hustle to peddle the threadbare material that makes Andy Fickman's comedy a perfectly tolerable, if uninspired, moviegoing experience."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2012
      },
      "score": 40,
      "summary": "I can't deny I did feel fonder of my own family afterward, mostly because I know none of them would ever make me sit through Parental Guidance."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2012
      },
      "score": 40,
      "summary": "Lazy, smugly self-satisfied movie."
    },
    {
      "critic": "Leah Churner",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2012
      },
      "score": 40,
      "summary": "The actors deserve credit for the professionalism they bring to this stinker, especially Tomei, who plays it straight as a contemporary have-it-all-or-die-trying mom, and Midler, who's given little to do, but works up an amusing backstory about her days as a good-time gal on the evening news."
    },
    {
      "critic": "Brian Lowry",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2012
      },
      "score": 40,
      "summary": "The execution, alas, prevents this from being a genuine crowdpleaser, with the better moments (mostly of the schmaltzy variety) more than offset by the irritating and tedious ones."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2012
      },
      "score": 38,
      "summary": "The movie spends too much time wedging the couple into a May-December moment, where Crystal cracks nostalgic about the good old days. It's sweet, but it grows old."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2012
      },
      "score": 25,
      "summary": "Parental Guidance kicks off with a mean-spirited joke about an overweight woman and heads downhill from there."
    },
    {
      "critic": "Emma Dibdin",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2013
      },
      "score": 20,
      "summary": "The kids are charmless, the writing is bland, and the embarrassing jokes sound like nails down a blackboard."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2012
      },
      "score": 16,
      "summary": "Parental Guidance is the abysmal grandpa/grandkids bonding comedy he's (Crystal) been destined to make since he first started creating new comedy with an unmistakable old-person smell."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2012
      },
      "score": 12,
      "summary": "It's hard to know who exactly Parental Guidance was made for."
    },
    {
      "critic": "Tomas Hachard",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2012
      },
      "score": 12,
      "summary": "Andy Fickman's comedy offers a confused and flat portrayal of generational differences."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "OK. Fairly topica satire on rearing children. Mildly amusing movie making, more or less by the numbers, but warm hearted anyway. Flabby direction overall, with a sloppy script, only held up in the air by the usual Billy Crystal schtick.  Bette Midler is not really given much to do, which is a pity, because she injects a bit of soul and energy into her role as the grandmother. The kids are pretty good, the slapstick sequences less so. Marisa Tomei doesn't make a very convincing mom, but she does appreciably better than her erstwhile husband, who simply stands around in the background channeling his own inner hubby hunkiness - at the expense of any dialogue. In short, a family movie that does not rely on computer effects or frenetic film editing - but which should probably have been a little wittier and crisper in its comic delivery. Frankly, the imaginary kangaroo created most of the laughs.",
      "total_reactions": 1,
      "user": "Brutus54"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "It is hard to find a movie these days that one can watch and not see sex, violence, drugs or inappropriate language.  Having a younger child I rented this movie for our movie night and thoroughly enjoyed it.  The combination of Billy Crystal's comedian nature and real life scenarios had me laughing and comparing it to my own life. The little league game was spot on with the way they play it around the country and I feel is ridiculous. The movie was not high budget or have the action packed scenes that most people are looking for in a movie but what it did have was something more.  It had a kids sense of humor built into it so the young ones would stay interested and a plot that most middle ages parents and grandparents could relate to.  Yes the jokes and one liners were a bit on the childish side but that is how it was designed.  This is not a movie written for mature adult audiences but for kids so keep that in mind if you plan on watching it without children around.",
      "total_reactions": 1,
      "user": "jlapaczonek"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Decent, funny comedy, but nothing really special. Billy Crystal was very funny. The philosophy of old school vs, new school parenting had some good laughs, etc. But, it was just really average over all. Pleasant, but not memorable.",
      "total_reactions": 1,
      "user": "homer4president"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2012
      },
      "score": 1,
      "text": "This movie is full of crap! It is not funny at all it is so stupid. Some parts almost made me giggle out loud but the jokes were crap. In fact, they were so crappy that they made me laugh over its stupidity. Hate this movie a lot. Don't watch it.",
      "total_reactions": 4,
      "user": "BENNEB"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "We went with our kids and grandkids (ages 12 & 14) to see this film and all of us liked it. It's not great art, nor does it break much new ground, but it made us all laugh. Parts of it are over the top, but there are parts that feel genuine. I had not expected to like it, but I did in spite of myself. The short scene at the end of the credits is worth waiting for.",
      "total_reactions": 6,
      "user": "emkadv"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "From the opening scene of Billy Crystal doing his baseball radio schtick to the next scene where Bette Midler and friends are pole dancing, completely dressed, with a promise of cheesecake after, to the following scene where their daughter, Marisa Tomei, calls them reluctantly and asks them to come to their",
      "total_reactions": 3,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "Funny as hell I thought.  Crystal, Midler and Tomei are spot on. So what if the story is schmaltzy.  It made me laugh a lot.  What's a comedy supposed to do?",
      "total_reactions": 8,
      "user": "Lawgeek"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2012
      },
      "score": 0,
      "text": "Sad and stupid little movie. Billy Crystal must have naked photos of the studio execs in compromising positions. otherwise this film never gets made. I wanted to laugh but instead I was filled with a sense of loathing for Hollywood. This movie is worth seeing just to test your pain threshold. As a point of reference I also thought City Slickers was unfunny. Lighting your money on fire would be a better use of funds than investing in this garbage.",
      "total_reactions": 10,
      "user": "Oroiael"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2013
      },
      "score": 3,
      "text": "Crystal and Midler have both done great films in the past so what happened? Not much in this movie. Your typical crude in poor taste comedy, except this one is not funny either. Crystal's classic one liners over the situation around him are kept to a minimum and the life the kids have is less realistic than a cartoon. This movie plays out like a poor Adams Family sequel where the good actors were replaced by poor low paid imitators. The poopie song was kinda funny though so I bumped it up to a 3.",
      "total_reactions": 2,
      "user": "analogkid280"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "These movies are getting duller and this movie was a waste of 100 minutes. Sadly there is no comedy and would be better if they changed the story-line. Adam Sandler would make this movie better but the cast we never knew appears in the limelight. Terrible and no fun, the Trailer can not show the real things, practically ruined Flickman's career.",
      "total_reactions": 2,
      "user": "Annoymous1"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "epic",
      "total_reactions": 6,
      "user": "wearetheothers"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "epic",
      "total_reactions": 11,
      "user": "mickeyboy"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "This is a very nice family movie.  Gone With The Wind it isn't but Billy and Bette get along famously.  It only goes to prove that all of us have dysfunctional families and it's OK.  A nice way to spend some time with the kids in the movies.  Go and enjoy.",
      "total_reactions": 4,
      "user": "fantasy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "It's hard for me to hate on a family friendly movie with a sweet side like this one, especially when movies are getting super vulgar now days. But Parental Guidance fails to bring laughs and fails to hook you with it's emotional side. This makes the movie super boring. Add in the fact that this is aimed at families with kids of all ages and its failure makes it all the more sad. As much as it pains me to say Parental Guidance is not worth your time. You can safely pass on this one.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "The cast was terrific, especially Billy Crystal, who gave a very good performance, but with a script that is filled with mediocre jokes and predictable outcomes where everything goes wrong, Parental Guidance is mostly a generic family comedy.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "This wasn't as funny as I was hoping for but it was a pretty good film to watch with the family. Billy Crystal is great, as usual, and Bette Midler does a good job in more of a supporting role. Surprisingly, especially after my last movie-watching experience, the child actors in this movie were competent bordering on pretty good. The only character who really annoyed you was Marisa Tomei's. Speaking of annoying, that was really the drawback here. Like most modern day family comedies, this movie gets a decent amount of its laughs through pure annoyance. Not as bad as say, Meet the Parents, but it still have too many annoying parts. Overall, Parental Guidance is a decent family film but I wouldn't suggest it for most people.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2016
      },
      "score": 8,
      "text": "Now days, Billy Crystal doesn't appear in films as often as he used to, but for the right project and cast, he's always willing to remind us of why he's a household name. It doesn't matter if it's a raunchy comedy or a family film, his quirky and unique sense of humor always makes whatever he stars in that much more enjoyable and Parental Guidance is no different. On the surface, this is just another family comedy about Grandma and Grandpa getting in over their heads when they agree to babysit for the weekend. Add Crystal and Bette Midler to that and all of a sudden the film is taken to a whole other level. Everyone knows what to expect from both Crystal and Midler, but the real magic is their chemistry and how they play off each other, especially when you throw three unpredictable kids into the mix. Some of the scenes with the grandparents trying to use the modern technology or the kids taking advantage of the grandparents lack of respect for their parents strict instructions are truly laugh out loud funny. Yes, that's exactly what I said, it's a PG rated family movie, but it has more than a couple of laugh out loud moments. Parental Guidance is a film that the parents and grandparents will want to see for it's terrific cross-generational cast, but the kids will enjoy it too, for both it's old school and modern humor. It's the perfect rainy day weekend family feature film.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2014
      },
      "score": 4,
      "text": "Parental Guidance is a childish and generally bland comedy about grandparents and parents and their children. Bette Midler is good--so is Marisa Tomei... but little else is.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2013
      },
      "score": 2,
      "text": "Not only completely unfunny, Parental Guidance is repetitive, uninteresting and annoying. This new Billy Crystal family \"comedy\" is wrong in every sense. It´s frenetic, yet it has no rhythm. There are absolutely no gags in this \"screenplay\" with absolutely no structure. It´s filled with cliches; 5 minutes-in, you can guess what´s going to happen in the last scene. Basically, this film is garbage.",
      "total_reactions": 0,
      "user": "mmweiss"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "This movie is of course a dumb comedy meant for little kids. There's really no reason to watch it, but it wasn't as horrendous as I had feared.  Most of the jokes are pretty stupid and the characters can really start to grate the nerves at times.  I did like how the movie showed that modern children have no discipline, and Crystal's bewilderment at someone even mentioning Facebook or twitter was somewhat amusing, but these things can't save it from predictability, blandness, and annoying characters.  However, if you are forced to watch it, it won't kill you.",
      "total_reactions": 0,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "text": "Billy crystal in a crappy kids film? Seriously....... This was a really bad film. Very bad. It was not even a great kids film...... It's was  garbage. The end is predictable, the kids don't make everything funny and billy crystal sucks at being a grandpa. 0/10 for me. I suggest you stay away from this film...",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "Parental Guidance starts with promising first 10 minutes but finishes as dime-a-dozen family comedy. Good, clean fun and pulling some heartstrings along the way guaranteed.",
      "total_reactions": 0,
      "user": "Mr_Muumi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "An overall refreshing family comedy, Parental Guidance is a moral-filled and hilarious tale for all ages.  Billy Crystal and Bette Midler do a wonderful job as grandparents, and the children have memorable personalities.  There's also many laugh-out-loud moments and some nice insight on the importance of intergenerational wisdom and remaining close to your family, no matter what the circumstances.",
      "total_reactions": 0,
      "user": "blakewilson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2013
      },
      "score": 2,
      "text": "I had to come to this movie mainly because my friend was going and I thought it would be a nice funny movie. It turned out to be a very predictable cheesy movie. Not good!",
      "total_reactions": 0,
      "user": "blogfirstlast"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "I cannot stand modern critic's hatred for family comedies. This film has plenty of laughs, emotion, and outright charm to keep a family continually coming back for more. The acting is great, the laughs are outstanding, the characters memorable, even the emotional scenes are very well done. The kids in this movie actually do a very good job. My only real criticism is that the emotional scenes are packed in rather tightly near the end, but other than that this is an outstanding family comedy, and one that I shall come back to time and time again.",
      "total_reactions": 0,
      "user": "Memburg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "la película guarda un buen mensaje pero no una buena trayectoria.",
      "total_reactions": 0,
      "user": "Jmsbpp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 4,
      "text": "Has some enjoyable moments, but mostly just an ego trip for Billy Crystal's ability to make one-liners. Overall, it's forgettable and only manages to squeeze three or four laughs out of me. Not terrible, but pretty bad and one of Billy Crystal's worst movies.",
      "total_reactions": 0,
      "user": "GamingGuru365"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "Great movie for the family. It is full of humor and very heartwarming. I love that  the movie was very relatable to your own family experiences as well.",
      "total_reactions": 0,
      "user": "meganahernandez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2014
      },
      "score": 1,
      "text": "Billy Crystal's main attempt at comedy is his failure to move along with a new age, and his voice. A weak script, rather disdainful and annoying acting by the cast, especially Marisa Tomei. In fact, the family just seems to be the typical case of dysfunction, thus making the film a pathetic slapstick comedy, similar to Sandler films. It's boring, weak, and overall, unfunny to a serious point.",
      "total_reactions": 0,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "Funny and heartwarming comedy about kids, parents, and grandparents.  Realistic while exploring all the relationships such as mom & daughter, older mom & grown up daughter, grown up daughter with older dad, and the relationships each child has with his grandma and grandpa.",
      "total_reactions": 0,
      "user": "cement23"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2013
      },
      "score": 9,
      "text": "A really enjoyable movie. It's nice to see how the movie shows the distinctions between the previous and modern generations through quite witty comedy. It won't make you laugh out loud, but it'll keep you smiling the whole way through, save for a few excessively cheesy moments. It's story is also quite moving by implementing characters that all have a meaningful story to tell, and it makes you take a greater appreciation for your loved ones. Seriously, any movie that can do that in a positive way is worth a view, and Parental Guidance is one of them.",
      "total_reactions": 0,
      "user": "RhythmicReview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "i seen parental guidance to many times . But Billy crystal's ways of grandparent skills are funny also his old school methods . sometimes this movie gets old also some parts of this movie are stupid also the end .",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "\"Parental Guidance\" 10 Scale Rating: 5.0 (Mediocre) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "I don't know if it's reassuring or scary that in such an American film the kids seems to be UK-style victims of both health and safety rules and political correctness at the same time.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "An entertaining and amusing family movie. There are a few good jokes and the acting was good. I don't get the critics hate toward good movies sometimes. This isn't Oscar worthy nor was it ever meant to be. The whole idea of new age parenting styles vs. old school parenting was a very good idea. The kids are good actors and each bring there own unique personality to the role. Billy crystal and bette midler does a great job as the old school grand parents. This movie is not crystals best but he is still good in this. while the whole thing is very predictable and the actors are not given much to work with this movies is a nice relaxing Sunday afternoon type movie that is not anything outstanding but good clean well made family fun that people of all ages are sure to enjoy.",
      "total_reactions": 0,
      "user": "nahtan1244"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2016
      },
      "score": 1,
      "text": "Have you ever heard a \"Back in my day...\" joke? Like, literally any? If yes, this movie is one long one of those. And boy, does it get old fast. And if I hear one more person telling me to give it a free pass just cause it's only for kids...",
      "total_reactions": 0,
      "user": "TheLonelyCritic"
    }
  ]
}