{
  "mc_avg_user_score": 6.3,
  "mc_metascore": 51,
  "mc_mixed_rating_frequency": 8,
  "mc_movie_name": "Parkland",
  "mc_negative_rating_frequency": 3,
  "mc_positive_rating_frequency": 10,
  "mc_pro_critic_reviews": [
    {
      "critic": "Stephen Farber",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2013
      },
      "score": 80,
      "summary": "Engrossing, quietly revelatory, and often profoundly moving as it retells a story we only thought we knew."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "The chief virtues of Parkland are journalistic in the best sense."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "It does assemble a compelling collage from the experiences of several real-life witnesses to the event and its aftermath."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "A sobering, documentary-style film commemorating eyewitness accounts of what happened in the aftermath of the tragedy, some of them fresh as a new wound, all of them painful but vital to a deeper understanding of one of the darkest chapters in American history."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2013
      },
      "score": 75,
      "summary": "Parkland is a fascinating insider’s view of those fateful two days in November of 1963, when a president was murdered, his assassin was gunned down in custody and generations of conspiracies were born."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 70,
      "summary": "The writer-director digs deeply and with a marked sensitivity, capturing the desperate, heartbroken humanity of the time and the place.  But it is also a movie of frustrating stumbles — blunders that diminish what might have been a brilliant film."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2013
      },
      "score": 67,
      "summary": "Parkland adds no significant knowledge to history or conspiracy theorists, but such details as the way Zapruder’s scrunched-up eye pops wide open when he witnesses what will be forever imprinted on his retina and amateur film are vivid."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 63,
      "summary": "A film of modest ambition and workmanlike pacing, it breaks little new ground, either in form or content. Then again, that may be the point."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 63,
      "summary": "All of this is secondary, even tertiary material, even if much of it is interesting and even wrenching to behold."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 63,
      "summary": "The events of those days would have been better covered in greater depth in a miniseries, rather than a 90-minute movie."
    },
    {
      "critic": "Bruce Ingram",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 63,
      "summary": "It shouldn’t necessarily be the case that a film focusing on the collateral details of the shooting, after the fact, would feel dull and uninvolving, but this writing/directing debut by journalist Peter Landesman does, with the exception of a few particularly interesting revelations."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 63,
      "summary": "Bulging with period details and a large and busy cast, Parkland is well made and at times queasily fascinating. At others, it gives in to melodrama and the ticking off of facts."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 63,
      "summary": "Parkland is wildly uneven, although compulsively watchable."
    },
    {
      "critic": "Laremy Legel",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2013
      },
      "score": 62,
      "summary": "Parkland mines some interesting scenes, if not in an entirely coherent fashion, resolving as more of an interesting concept than a fully rendered and effective film."
    },
    {
      "critic": "Staff (Not credited)",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2013
      },
      "score": 60,
      "summary": "Dramatically it’s bitty, with, to paraphrase a great American newsman of the time, too much, too fast. But there is no denying how absorbing the tumultuous events of those four days remain."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "The acting is first rate, the story still heartbreakingly urgent. But ultimately Parkland plays more like a re-enactment than a film in its own right."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "Perhaps it’s inevitable that the movie works best not while we’re watching fictional recreations, but when we see real footage or hear actual broadcasts."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "Parkland finds a new angle on an exhaustively chronicled and debated subject by focussing on the grim practicalities of the situation."
    },
    {
      "critic": "Xan Brooks",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2013
      },
      "score": 60,
      "summary": "If the film finally doesn't tell us anything we did not already know, the approach makes a worn-out old tragedy feel supple and urgent."
    },
    {
      "critic": "Mike D'Angelo",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2013
      },
      "score": 58,
      "summary": "As vicarious, you-are-there re-creations of historical events go, it’s creditably workmanlike; whether that’s the best use of the dream factory is another matter."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "The most grievous sins here are sins of omission."
    },
    {
      "critic": "Godfrey Cheshire",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "Parkland expends lots of energy and expertise on re-creating these infamous events, yet it is so lacking in narrative purpose that many viewers are likely to leave muttering, \"Okay…but so what?\""
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "Because the film, which affects the style of “United 93,” offers no new insights, theories or important information, you’re left wondering why it was made."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "Those looking for some human interest in their human interest may be equally frustrated."
    },
    {
      "critic": "Chuck Bowen",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2013
      },
      "score": 50,
      "summary": "The Peter Landesman film's overt politics are minimal, aside from defaulting to the myth of John F. Kennedy as a martyr for...something."
    },
    {
      "critic": "Ella Taylor",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2013
      },
      "score": 45,
      "summary": "Awkward, incoherent and plodding."
    },
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2013
      },
      "score": 40,
      "summary": "A potentially gripping study of the fallout from the JFK assassination as experienced by his doctors, secret service agents and the man who famously photographed the incident is rendered tame by a combination of flat writing and overly busy storytelling."
    },
    {
      "critic": "Kate Stables",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2013
      },
      "score": 40,
      "summary": "Despite some affecting moments, the lumbering Parkland feels more like a well-researched magazine feature than an involving drama. As Billy Bob Thornton’s lawman says: “This was not supposed to happen.”"
    },
    {
      "critic": "Read full review",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "And so, as the solemnity of the enterprise is frittered away, you feel moved to ask: what is this film for?"
    },
    {
      "critic": "Pete Vonder Haar",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "It's in the film's second half that Parkland goes all Tony Romo and fumbles. Instead of becoming truly engrossing, it threatens to descend into unreserved melodrama."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "The tone never stops waffling, and nothing truly revelatory ever emerges about those terrible few days in Texas. What we’re left with is the Disney theme-park version of history — all waxworks and weepiness."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 38,
      "summary": "Sadly, what Parkland becomes is a crying shame."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2013
      },
      "score": 30,
      "summary": "Granted, Landesman feels an obligation to history, but there’s something ponderously obvious about the way so many of these scenes are played."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2013
      },
      "score": 20,
      "summary": "Oswald’s brother Robert, played by James Badge Dale, is the film’s only rational human being, and Dale makes you wish Landesman had written the entire film from his angle."
    },
    {
      "critic": "Oliver Lyttelton",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2013
      },
      "score": 16,
      "summary": "There's a pleasing egalitarianism to the film's history-through-the-eyes-of-the-ordinary-man concept, but the script rarely makes the case that their versions are compelling enough to warrant a film."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "This drama follows several perspectives around events in Dallas after JFK was assassinated. Among them: the hospital where Kennedy and Oswald were rushed, Zapruder and his famous film, the travails of Oswald's family, the FBI and Secret Service in the aftermath. It blends a hand-held documentary style and hectic pacing to tell a compelling story. The large cast is peppered with notable actors, including Paul Giamatti, Zac Efron, Billy Bob Thornton and Marcia Gay Harden, and they help focus the impact. This is not a straightforward narrative, but a montage of events. Still, it proves a fascinating (and for me, informative) look behind the scenes of one of the most memorable days in 20th century America.",
      "total_reactions": 3,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "A gripping and moving film focussing on the aftermath of the murder, not who did it or why.  Very humane in its portrayal of the people involved, with some memorable scenes  the two bloody operating theatre sequences, the men struggling to lift the coffin into the plane, Oswalds bleak burial.  Thankfully no conspiracy theries in sight.",
      "total_reactions": 2,
      "user": "bobnewsom"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "Possibly the most underrated movie of the year so far. It's not the most unpredictable or memorable film possible to be made about JFK's assassination, but very tense and much cleverer than I expected. The cast is not exactly flawless and far from all star, but very impressive. I never thought I would say this, but Zac Effron is the best actor in the movie. He perfectly conveys how scared and clueless the doctors treating Kennedy's wounds were. The plot is very similar, while it's not the most exciting story and moves much slower than the viewer would prefer, it's very intelligent and when it needs to be incredibly tense. Some scenes do feel out of place and totally unnecessary, they do not add to the story at all, but it's not enough to ruin the whole experience.",
      "total_reactions": 1,
      "user": "python2000"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2013
      },
      "score": 3,
      "text": "Pretty sure I almost fell asleep during this. Why was Zac Efron even in this? Who knows. What I do know is that I'll never get the time back that I spent watching Parkland.",
      "total_reactions": 2,
      "user": "CynicalJohnson"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2013
      },
      "score": 1,
      "text": "Parkland ISNT JFK. So, don't go in the theatre expecting an Oliver Stone expreriance. First of all, Billy Bob Thornton is the main thing that makes this movie, his excellent and speechless performance is compelling to the film and helps its cheesy cast. Zac Efron sucks, we know that right guys? In this movie he does bad and bad. That's all I have to say about this douche. Parkland is about the assasination of John. F. Kennedy, and how a guy named Zapruder filmed the brutal shooting. Oliver Stone's JFK was great but this movie based on the same substance and fails to succeed. More like a documentary, Parkland emerges into the killing into a horrible way and pukes at its story and direction. Zac Efron sucked but Paul Gimmati was good and Thornton was da bomb. This movie could have been handled but failed. The ending is sober and bitter and doesn't help either. Parkland is the worst president films ever made and fails at the box office. It's very rushed with a lot of stories. Not refreshing.",
      "total_reactions": 3,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2013
      },
      "score": 1,
      "text": "What a load of irrelevant crap!",
      "total_reactions": 1,
      "user": "Pavement"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2013
      },
      "score": 4,
      "text": "This movie was possibly the most \"Mr State The Obvious\" Minimalistic movie in the industry, it had a very \"heard this story\" type feel to it and i fell asleep about twice. Definitely not worth watching.",
      "total_reactions": 1,
      "user": "MRSM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "Based on Vincent Bugliosi's book, Four Days in November, the film Parkland chronicles the events following the assassination of JFK. What I liked about this film was how it tells a part of the story that isn't widely known. From the doctors at the hospital, working on the President, to the acquisition of the Zapruder film, Parkland goes behind the scenes to tell the untold story. I was also impressed with how the film managed to stick to the facts and not dwell on any of the conspiracy theories that surround the case. Zac Efron stars and really wasn't all that great. I think that Efron needs to stick to what he does best, taking his cloths off and making people laugh. While the film is kind of slow, I really enjoyed Paul Giamatti's portrayal of Abraham Zapruder, the man who filmed the assassination. Zapruder really struggled with releasing the tape to the media and the events he witnessed ultimately destroyed his life. Giamatti's portrayal of the man is supposedly spot on and truly deserves an honor mention. Parkland gives us a lot of new information about the events that followed the assassination of President Kennedy, but a lot of it are things the general public really aren't that interested in learning about. For a Kennedy aficionado, this film must of been eye opening, as for the rest of us, it was an interesting, non-bias view of history, albeit a little boring.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 5,
      "text": "A telling of the moments surrounding the assassination of John F. Kennedy. Parkland approaches the subject via Emilio Estevez's Bobby--whereas JFK never makes an appearance and the story is told through witnesses and those affected by the tragedy. Key opportunities were completely missed and prevented the emotion it should have deserved.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "Parkland shows how was the life of some people who were involved in the death of President John F. Kennedy. From the chaos, disbelief and horror at Parkland hospital that received President Kennedy (along with the disorder in the sad trip back to Washington with Kennedy's coffin), the suffering of who had the sad 'privilege' of filming great detail the murder, as the family of Lee Harvey Oswald took the stain to be related to the person murderer Kennedy. No shows ridiculous conspiracy theories, and focuses on the great historical or political moments, but shows us how, on any given day, these people took this unexpected horror. Not for nothing the best movie in the world, but it is certainly interesting to see this view of such an important and sad day in history.",
      "total_reactions": 0,
      "user": "Lord_Blacknemp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "This is an extremely average film that doesn't allow the audience to get past its paper thin amount of  character development.  I wish this film was as good as its actors. C",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Okay i find it pretty shocking that critics are picking on the film, this a film is a tearjerker. Okay we all know the JFK assassination story, but this film is dark and mysterious, it is a movie were you think you know what's gonna happen but you really don't.  Grade A",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2016
      },
      "score": 6,
      "text": "I am not that knowledgeable on all things Kennedy Assassination but I have heard that Tom Hanks is so I feel like this movie would be everything he would want people to see, feel, and know about the topic. It definitely showed me some things I didn't know and had a pretty good cast. Not too bad in my point of view.",
      "total_reactions": 0,
      "user": "Stargirl04"
    }
  ]
}