{
  "mc_avg_user_score": 2.5,
  "mc_metascore": 13,
  "mc_mixed_rating_frequency": 17,
  "mc_movie_name": "Paul Blart: Mall Cop 2",
  "mc_negative_rating_frequency": 198,
  "mc_positive_rating_frequency": 52,
  "mc_pro_critic_reviews": [
    {
      "critic": "Jesse Hassenger",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 42,
      "summary": "If anything, Paul Blart: Mall Cop 2 ups that sadness quotient, spending much of its opening proving that just because these movies are stupider than \"Observe And Report\" doesn’t mean they have to be less cripplingly depressing."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2015
      },
      "score": 40,
      "summary": "It’s not that the film is particularly loathsome, or that Blart is an overweeningly horrible character. What rankles is that he’s barely anything at all; a stereotype of a stereotype; a half-remembered punchline; a stomach with a moustache and wheels. As you watch the film, it’s already forgotten."
    },
    {
      "critic": "Gary Goldstein",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 30,
      "summary": "To his credit, director Andy Fickman (“The Game Plan,” “Parental Guidance”) keeps the inanity moving apace and there are a few chuckles to be had courtesy of the supporting cast. But, as is so often the case with big, star-driven studio laffers, “Cop 2” needed several more spins in the comedy punch-up machine before cameras rolled."
    },
    {
      "critic": "Kevin P. Sullivan",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 25,
      "summary": "Paul Blart: Mall Cop 2 does all it was created to do: exist."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 25,
      "summary": "Is it never funny? No, it’s not never funny. It’s just not funny nearly often enough."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 25,
      "summary": "Sequels are cynical by nature, but this one, with its casino product placement ad and director Andy Fickman apparently checking his text messages instead of trying to punch the limp gags into shape, is purely a paycheck. James may not deserve better, but the kids they’re pitching this to do."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 20,
      "summary": "In the past, James at least had likability on his side. He was a big, lumbering oaf, the ideal drinking buddy. But there’s an arrogance to the way he treats people here, particularly a gorgeous hotel employee he’s convinced is in love with him, that renders him strangely unsympathetic."
    },
    {
      "critic": "Andy Webster",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 20,
      "summary": "You won’t find much offensive in Kevin James’s slick, innocuous vehicle Paul Blart: Mall Cop 2. You won’t find much prompting an emotional reaction in general, so familiar are the jokes and situations. If Mr. James’s character thinks of safety first, so does this movie, to its extreme detriment."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 20,
      "summary": "Nobody was expecting much from Paul Blart: Mall Cop 2, but did it have to be this unimaginative and lifeless?"
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 20,
      "summary": "Nothing aired by WikiLeaks could possibly be more destructive to Sony’s reputation than the release of Paul Blart: Mall Cop 2, the sort of movie that goes beyond mere mediocrity to offer possible evidence of a civilization in decline."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 20,
      "summary": "While the original was no classic, it had a few mild laughs and the plus-sized actor displayed a certain buffoonish charm. Such is not the case with this painfully unfunny, slapdash follow-up in which the title character is so relentlessly obnoxious that you'll be cheering for the villains."
    },
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2015
      },
      "score": 20,
      "summary": "Given that it comes courtesy of Adam Sandler’s production company Happy Madison... it’s no surprise that Paul Blart: Mall Cop 2 is a lazy, witless, laugh-free experience. But even by their standards, this is a slog to sit through, so glacially paced that at times it achieves an almost zen-like level of anti-comedy."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "summary": "The humor level in the film is so moribund that it doesn’t even inspire groans or eye-rolling; instead, it figuratively puts its hands on your shoulders and pushes you deeper into your theater seat until you’ve been completely subdued by all the nothingness it has to offer."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "summary": "What’s most dispiriting about this garbage burger is its nonsensical characterization of Blart himself."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "summary": "James' everyman appeal is stretched to the limits here, like that polyester shirt he wears."
    },
    {
      "critic": "Christy Lemire",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "summary": "Think of the worst movie you’ve ever seen – a movie that didn’t make you laugh, didn’t make you cry, didn’t move you or change you in any way besides giving you the desperate urge to flee the theater. Think of a movie that was a massive waste of your time and money. Hold that title in your mind. Paul Blart: Mall Cop 2 is worse than that."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 3,
      "pos_reactions": 15,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "I went to the movie theater to cheer up with my favorite funny man Kevin James, this movie only assured the fact that i should kill myself  sooner. Next time i see a Kevin James movie, i am bringing a noose.",
      "total_reactions": 18,
      "user": "geyniga003"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 17,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "Wait, the movie was trying to be serious? I doubt it, this is one of the most critically panned movies ever made, and I don't blame them. This is the definition of godawful.",
      "total_reactions": 21,
      "user": "Annoymous1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "Paul Blart: Blah plot. Art? Pah! Abort.",
      "total_reactions": 15,
      "user": "skellys_pal_mat"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2015
      },
      "score": 0,
      "text": "No Idea why people love it but this movie is much worst than Grown ups 2 or maybe just like Grown Ups 2.",
      "total_reactions": 5,
      "user": "JohnKristofer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2015
      },
      "score": 1,
      "text": "Have you ever thrown up in your mouth? Remember when your grandfather soiled his 'depends' and how embarrassed everyone felt for him? Remember when you put down your most beloved pet? Blart 2 is worse than that. Sequels seek to make money, there's some weird justice when you go to see a sequel...you never get over your first meth high... you're always chasing it. Thinking of going to see Blart 2? Save your money and go on line and google 'Meth addicts before and after'. The after will be you coming out of 2. Just say no.",
      "total_reactions": 5,
      "user": "Frnchtoastjesus"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "Kevin James had it coming. Paul Blart: Mall Cop 2 is an abomination of fart jokes, clumsy writing and a cheesy plot. The whole movie is a joke. It was created so that our favourite mall hero, Paul Blart's 'Epic Saga\" could be continued. I enjoyed the first movie, better than that knock off Seth Rogen comedy, Observe and Report. See, Mall Cop 1, was not only funny, but it was more appealing to a wider audience, it was clean, and proved to us that comedies don't need swearing to make their point clear, example: Observe and Report. The sequel just kills my love for Kevin James and Paul Blart. Blart has lost his charm over the years, and boy, it shows, CRYSTAL CLEAR. So yeah, it's terrible, ignore it at all costs, make sure your kids don't force you either. Mall Cop 2 is like a really bad Kevin James movie, add that to a really stinky sock and add a stupid motor scooter to it, equals to a sequel. In about another 6 years, Blart will be back, but this time in a MENTAL WARD. That should have been the location where Director Andy Fickman should have gone when making this movie. Kevin James lost even the 1.2 % of respect I had for him, he is a goddamn president in Pixels! Pixels looks appealing, but it can be ruined, HINT: Adam Sandler and Kevin James together. Overall, this is a piece of horsesh*t, if you didn't figure out already, and yes, it should be panned by critics of how absurdly bad it is. Fu*k you Kevin.",
      "total_reactions": 8,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "I love Kevin James, but who honestly thought it was a good idea to half-ass a second Mall Cop movie?  The first movie was passable at best.  The premise isn't terrible, it's just the execution of everything from the script to the directing is so \"blah\".  Kevin James should look for better roles.  Taking jobs like this just to remind people he is still around comes off as more of a black mark on his record than credible experience.",
      "total_reactions": 4,
      "user": "SchroederRock"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2015
      },
      "score": 1,
      "text": "An utter waste of money, time, acting talent and room for better movies. The director, actors, producers and Columbia pictures can only hope that the world forgets about this flop soon",
      "total_reactions": 4,
      "user": "BlackTag666"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "If you want to laugh read the reviews, after watching this  movie I realized I was  robbed  ten bucks for the ticket, robbed over an hour of my life, and of my sanity. I seen the movie yesterday and couldn't write a review until today due to me being temporarily retarded. I would recommend going to a nursing home visiting Elderly senile people rather than seeing this movie.  it would be much more entertaining and free. I love king of queens, but this dude just can not make a funny movie and I feel bad saying that. If I honestly had to rate it I would rate it a one finger up!!  that would be my middle finger",
      "total_reactions": 4,
      "user": "Brandinoe25"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "WHAT THE **** This movie is beyond **** it's a ****ing travesty. Not funny,Kevin James being Kevin James and being too boring. I feel sorry for anyone who had the experience this.",
      "total_reactions": 15,
      "user": "flametail23"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "Aptly name Paul Fart Mauled Cop, just the ads alone get a big fat zero, too bad he can't get Leah Remini to do one with him. Because by himself and out of his stand up shows, he sucks. That laughter he hears is one gets from people seeing him naked, the line comedy isn't pretty is right but it doesn't have to be uglier than a snaggled toothed mangy dog.",
      "total_reactions": 11,
      "user": "KaienShiba"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "I really don't need to say anything...this is one of the worst movies ever made! This movie is pure s**t! This is even worse than the first one and that is really hard to do. Poor Kevin James, i you know that you can do a lot better...",
      "total_reactions": 7,
      "user": "Simpsons92"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "They should make ISIS terrorists watch this movie on repeat until they cough up the information. I think that is enough to explain the absolutely abhorrent film this is.",
      "total_reactions": 6,
      "user": "Enforcer122"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "The parts with Paul Blart being fat were the best. If I could give it a 15/10, I would. Better than the first with more finesse and comedic value. True cinematic masterpiece.",
      "total_reactions": 3,
      "user": "jsksjs"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2015
      },
      "score": 1,
      "text": "Can't say this surprised me.  The first one wasn't very good so why make a sequel, answer it's Happy Madison.  This film is the definition of unneeded.  F",
      "total_reactions": 3,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "this movie is about as good as having a dog take a dump in your mouth whilst you are sleeping. There is nothing good about this movie. It's not even memorably bad either, it's not even so bad it's good. The movie is just an absolute pile of awfulness.",
      "total_reactions": 3,
      "user": "loudross"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "Mario! Link! Samus! Pikachu! All of your favorite Nintendo characters are back, along with plenty of new faces, in the fourth entry in the beloved Super Smash Bros. series. With Super Smash Bros. for Wii U, parties of players can battle each other locally or online across stages inspired by classic Nintendo home console games. With a variety of control options and amiibo compatibility, the timeless Super Smash Bros. battles come alive.",
      "total_reactions": 5,
      "user": "BillClinton"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "Like every other sequel. They're bad. The first Paul Blart mall cop was okay. This one is just a mess. Every scene felt like they tried so hard. I respect Kevin James and all I could say that this could be one of the worst movies of 2015. Sorry Kevin but you should try next time. Hopefully Pixels the movie would at least be good.",
      "total_reactions": 9,
      "user": "DavidV293"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "If you barely enjoyed the first film for its wafer-thin plot line, slapstick humour and character development, then you might like to skip the sequel - the wafer just got thinner. However, if you found something chronically and bizarrely amusing about an overweight man segwaying his way round a shopping mall, with the same jokes played out over and over again, then you might find its worth a look. Sometimes if you crush a joke often and hard enough you get a few diamonds, and whilst I wouldn't want this particular franchise to go on forever, there are moments of genuine absurdity that had our family of four (with children aged 13 and 8) laughing out loud.",
      "total_reactions": 9,
      "user": "Kj1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "This was the biggest piece of **** ive seen in my life. After this movie was over I attempted suicide and then beat my wife brutally. Kevin James is fat.",
      "total_reactions": 4,
      "user": "doobielife03"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "When the jokes fall flat,  and the gags don't work also when James falls down they aren't funny! that's what you get when you watch Paul Blart: Mall cop. Star/co-writer Kevin James doesn't know how to time a joke or set up one, the jokes are flat,cheap and stupid. There is no plot! in the first one the action sequences suck  (the worst  i seen).It is hard to feel for  the character when the character is a jerk and poorly written.James tries no matter how hard he tries to make the audience satisfied, picture James in a race no matter how hard he pleases the everyone he fails yo finish the line to please the movie goers. The action sequences suck in this one even more, Sony reopens an unfunny  franchise that producer Adam Sandler's production  gets to ruin with sappy humor. Grade D-",
      "total_reactions": 2,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "Blart 2 was better than the first; it had more laughs. It was much better than Birdman, so it should win an Oscar.  Either critics don't see the movies, or they don't have a clue to give a fair rating. I look at the audience reviews to see a movie. Blart 2 is black humor, which I like; I had a lot of laughs, and so did the people in my theater. Screw the professional critics; especially those that gave Birdman any stars. Why don't the people who gave this movie a bad review, go see Birdman; the critics loved it?",
      "total_reactions": 2,
      "user": "tjake13"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2015
      },
      "score": 0,
      "text": "This monstrosity basically sums up Kevin Jame's career. If people would just stop paying Kevin James money to keep making movies he would simply go away.",
      "total_reactions": 2,
      "user": "coloradosnowman"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "This movie was a big disappointment to me. I really enjoyed the first one, and I thought that I would enjoy this one too, but it was largely unfunny. There were a couple of parts that made me laugh, but they were all in the trailer. In retrospect, the only funny parts in this were either in the trailer or were recurring gags from the first movie. Six years is just too long for a sequel. As was proven by other recent delayed sequels (Sin City and 300), some movies are just right were they were, and this was one of them.",
      "total_reactions": 7,
      "user": "bigtunaonfilm"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "I liked the part where he was fat and a cop and on a Segway and was a mall cop it was very funny I liked it because it was funny and made me laugh so hard because the jokes were good and it made me cry too at the sad parts. It was good.",
      "total_reactions": 3,
      "user": "Lachraug"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "This movie is so smelly, it made me feel like i needed to change my pants. I am no baby paul! why you movie make me feel like I Blart my pants?!?! Not cool! u Are a cop!? why you no help me?!? is this ferguson?? No! this is movie theetre! I hat u! blarto mc blart fart ! Makes sense why ur name rime wit fart! and shoping cart! or k mart! K mart sucks! so do u blart!",
      "total_reactions": 3,
      "user": "poopypants69"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2015
      },
      "score": 0,
      "text": "This is officially the worst movie I've ever seen at the cinema. From the incredibly bad jokes, to the poor and embarassing acting, and the dull and uniteresting storyline, everything in Paul Blart Mall Cop seems like it's been done by a 5 year old. It's ridiculous that these types of movies are even being done in this day and age. Horrible.",
      "total_reactions": 4,
      "user": "Razv"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "This movie is probably the worst comedy ever. All the jokes were flat, and the movie was way too long. Very boring and stupid, and is almost the exact same thing as the original.",
      "total_reactions": 4,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "The movie was very silly, yet made us and the theatre laugh continuously. The young daughter has the best expressions as her father overcompensates in his mall cop role. The movie won't win any awards, but it is very entertaining.",
      "total_reactions": 15,
      "user": "ledaumas"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2015
      },
      "score": 1,
      "text": "The continuation of the first part is horrific.",
      "total_reactions": 5,
      "user": "Nobilis1984"
    },
    {
      "neg_reactions": 35,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "My 9 year old wanted us to see this and I am glad we did.  We laughed through the whole thing.  Action packed and funny.  Better than the first one.  Loved it!.",
      "total_reactions": 42,
      "user": "movieguest"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "Movie of the dern year, Guiness material here, Kevin James is so dern dank and the acting was suspenseful and the comedy was Well performed! 10/10-frostfyre422",
      "total_reactions": 6,
      "user": "FrostFyre422"
    },
    {
      "neg_reactions": 55,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "The scenes where Paul Blart Mall Cop was on the segway were comedic gold! Paul blart is one of those movies you might have to see twice! invite the family because they will enjoy this light hearted film..",
      "total_reactions": 62,
      "user": "Apricot123"
    },
    {
      "neg_reactions": 41,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "I'd say it before and I'll say it again. Critics love to hate sequels, but people (including myself) don't give a rat's ass what they think. I know every critic love to hate movies produced or starred by Adam Sandler, big deal. Audiences and kids will certainly love Paul Blart Mall Cop 2 even if you just can't get a laugh bag. If you want to see why try up Cinemascore or something else. I know the jokes were the same as the first, but Kevin James is still my favorite actors that Adam Sandler just created. Stop with the bulls**t and go see this movie.",
      "total_reactions": 44,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2015
      },
      "score": 6,
      "text": "Its not THAT bad.  Its like a dumb Adam Sandler comedy, which I always like.  Im not expecting an Oscar performance, just a dumb movie to laugh at, which it does.  Its definitely not a \"good\" movie, but if you like Kevin James or Adam Sandler humor (I think Sandler is producer) you WILL like it somewhat.  (Not sure what people were expecting.)",
      "total_reactions": 2,
      "user": "3ebfan511"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2015
      },
      "score": 2,
      "text": "Paul Flarp Mall Blarp is the best commercial ever made. Running for an astounding 94 minutes, Blarp is a riveting feature starring Kevin James as boredom in an advertisement for a vegas hotel. As a bonus, when you spend money on your ticket, a part of your soul goes to hell to feed the infernal machine. Everybody wins!",
      "total_reactions": 1,
      "user": "Sammiches"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2015
      },
      "score": 1,
      "text": "The first half is of a totally depressed Blart, with a few depressing \"jokes\".  The is followed by a bunch of slapstick jokes and what someone thought was funny.  Not!  Don't waist your time.",
      "total_reactions": 1,
      "user": "trekkerman1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 1,
      "text": "Empty and very hollow sequel that's nothing to its far superior original which in itself was boring and appealed to people of low standards. Devoid of laughs and any since of good taste and film making.",
      "total_reactions": 1,
      "user": "dyshpo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 3,
      "text": "Completely trashes the first. Takes, beats it up, and throws it on the ground to make room for this film trash. Fans of the first will likely enjoy the second, but for the rest It's all to familiar.",
      "total_reactions": 1,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2015
      },
      "score": 2,
      "text": "I'm not going to lie, I enjoyed the original Paul Blart: Mall Cop, I thought it was fairly funny and I thought this was going to be more of the same. The film is so terribly written, it basically reverses all the things Paul Blart achieved in the first film. Kevin James tries so hard to be funny in this movie but it just isn't working here. I can't see how anyone can really like this film which is sad. This is a movie that just did not have to happen and they could've made a better effort, the whole film just seems lazy.",
      "total_reactions": 1,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "I watched this and would have left, but then I wouldn't have been able to write this. The first movie wasn't that good, but at least it was partially funny, this one had almost no funny moments, and has tons of other issues. The plot is another ripoff of Die Hard, the movie is way too silly, it's downright stupid, and it suffers from sporadic pacing.",
      "total_reactions": 1,
      "user": "tjman09"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "Okay so your telling me that Dredd doesn't have a squeal but Paul Blart dose...life can be unfair sometimes.",
      "total_reactions": 1,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 0,
      "text": "Ok def spam on this review!",
      "total_reactions": 2,
      "user": "Trillcosbey"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2015
      },
      "score": 0,
      "text": "Absolute comedic genius to a ludicrous degree. Criminally underrated masterpiece, which I wish would be able to continue into an ultimate climax in the hopefully inevitable third.",
      "total_reactions": 1,
      "user": "Jacktes"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2015
      },
      "score": 0,
      "text": "I'm genuinely not sure that any amount of marijuana can save this comedic oil spill. An actual mall cop could've produced, and starred in, a significantly better film...Paul Blart has saved the day one too many times",
      "total_reactions": 1,
      "user": "StonedCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2015
      },
      "score": 0,
      "text": "Plart Gart Smart Blart 3: The Awakening was the best movie I've seen since Grown Us 7{good thing master Kevein James is such a great comical Guennis! I laffed until I( started bleeding to death, and went to the hospital! Such fun movie!",
      "total_reactions": 1,
      "user": "smartmart"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2015
      },
      "score": 4,
      "text": "It seems like just about every unnecessary comedy sequel tries was too hard to get laughs by creating scenarios that are more absurd, louder, and more obnoxious than the previous film. That's not to say obnoxious can't be funny, but \"Paul Blart: Mall Cop 2\" is the perfect example of why it most often isn't.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2015
      },
      "score": 3,
      "text": "One of those movies that is meant to be funny on the basis that the lead actor is overweight. This is the ultimate generic movie, but it is not offensive sans you are not left with mental scarring, so I feel it deserves a few marks.",
      "total_reactions": 0,
      "user": "Amigian"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2015
      },
      "score": 2,
      "text": "Nothing more than a lazy attempt to make a movie. Don't know if it was intended to make you laugh or cringe but the film is beyond garbage. At least the Wynn Hotel had a nice advertisement.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "People appear to have it out for this movie. Either that or the producers of Paul Blart Mall Cop 2 have p***ed someone off so bad they've hired people to astroturf.",
      "total_reactions": 0,
      "user": "E71"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2016
      },
      "score": 0,
      "text": "I don't think I have ever given a movie a 0, which to me feels like it would be a black screen with the sound of babies crying.  I would honestly rather watch that for 2 hours than sit through this.  I could only make it half of the way through the movie.  More than that and I would have risked permanent brain damage.  On a side note just read a lot of the comments, they are much funnier than the actual movie.",
      "total_reactions": 0,
      "user": "mijxero"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2015
      },
      "score": 0,
      "text": "\"Oh, he's fat! Hahahahahahahaha! Now he did something dumb and he's overweight so that makes this super hilarious!\"",
      "total_reactions": 0,
      "user": "WolfLambert"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2015
      },
      "score": 1,
      "text": "I understate that comedies sometimes are dumb but this film exceeds the limit. Was so pathetic and dumb. I lost 1 hour of my life in this movie and i feel so sad cause that time never recover.",
      "total_reactions": 0,
      "user": "Jorfran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2015
      },
      "score": 3,
      "text": "The first half is horrible. I almost turned it off. The last thirty minutes or so was pretty funny. I'll give it a point for every 10 minutes of decent movie. Some pretty good gags in the last bit if you can get through the first hour without turning it off.",
      "total_reactions": 0,
      "user": "Chowda"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "It has been quite a while  since I saw a movie that made me laugh which did not focus on sex or swearing. Sure it is more a kids oriented movie but I really enjoyed some of its silliness.",
      "total_reactions": 0,
      "user": "Conjure"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2015
      },
      "score": 0,
      "text": "Ugh -- what is this? A godawful sequel, that's what that is. I don't know why Sony would do something as cancerous as producing an unnecessary sequel to an unnecessary movie. Perhaps it's because they desperately need money. They think they could make a good movie again but after Pixels and Aloha got panned, I'm not sure. But there's no good movie to be found here. No level in this cinematic abomination is redeemable in the least. The script is awful, the jokes come across as forced and random, the characters are something I couldn't care less about, the villain, particularly, is bland and not amusing, the direction is awful, the pacing is awful. Everything is awful in this movie, and I don't think any movie will top this as the worst movie of 2015. Stay away from this, and I mean it.",
      "total_reactions": 0,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2015
      },
      "score": 2,
      "text": "How is it this character of Paul Blart has become so unlikeable since he first showed his silly face in 2009. This movie is the exact reason why some movies just shouldn't have sequels.",
      "total_reactions": 0,
      "user": "WJS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2015
      },
      "score": 3,
      "text": "I'm not going to bother making a video review for ‪Paul Blart‬ Mall Cop 2. This movie is terrible. It suffers from the curse of comedy sequels which are being significantly worse than it's procedure. The acting is terrible, it has no flow to the story. It has cheap laughs (that admittedly made me laugh a few times) but for the most is unfunny to the bone.",
      "total_reactions": 0,
      "user": "Movi3R3vi3wer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2015
      },
      "score": 1,
      "text": "This is the exact same movie as the first one, except with an even shoddier script, even more generic characters, and even lamer jokes. But hey, at least it's in Vegas!",
      "total_reactions": 0,
      "user": "WheelzFourReelz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2015
      },
      "score": 1,
      "text": "One of the most depressing movies I've ever seen. Seriously, it's just a bunch of awful things happening to Paul Blart and him making an ass out of himself for an hour and a half. Also they try to make you feel bad for him but he's such an idiot it's impossible to care. I've had bowel movements funnier than this movie.",
      "total_reactions": 0,
      "user": "SolInvicta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2015
      },
      "score": 0,
      "text": "There are good sequels, then there are bad ones. Unfortunately we get another one with Happy Madison Studios making the not-so-likable character Paul Blart in his sequel \"Mall Cop 2\".   Kevin James plays in the title role yet again as one of  New Jersey's well known mall cops this time he is more annoying and obnoxious than ever. I don't think I have sat through a movie looking at a character more annoying than any of the other bad characters I have seen in other bad movies. Actor Kevin James has spoken out about liking this character (for whatever reason) and had the idea of making a sequel.",
      "total_reactions": 0,
      "user": "30Cents"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "This movie really digs below the surface to show the utterly depressing and remarkably unfunny life of titular character Paul Blart. Paul Blart is a mall cop, who is incredibly incompetent at nearly everything he attempts. Kevin James was perfectly cast as Mr. Blart, showing limited range, but owning the role amazingly. The acting was so natural it was as if Kevin James wasn't acting at all.",
      "total_reactions": 0,
      "user": "josh777"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2015
      },
      "score": 2,
      "text": "Paula Deen Mall Cook 2 had high expectations from the last installment and many people seemed to love it. The cooking was great to watch and the food looked really tasty. I was really glad to see her recover from her racist past ( ͡° ͜ʖ ͡°). The first movie followed the protagonist Kevin James aka Paul Blart roaming about the mall on his segway. How the thing didn't cripple under his weight who knows. The comedy was meh and im pretty sure no one asked for a sequel. Basically the same s h i t happens. His fat mexican daughter gets gang banged by criminals stealing some s h i t. Then pauly saves the day and gets no promotion or anything. His salary is probably equivalent to an indian man that runs a convenience store that sells mystery meat and c o n doms that more than likely have been tampered with. Its just not fun to watch. Thanks for the pepperoni pizza-yours truly-paula deen",
      "total_reactions": 0,
      "user": "Expired_Cologne"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2015
      },
      "score": 0,
      "text": "Pault blart mall c u n t 2 has to be the equivalent of watching a fat kid with downsyndromne dress up as a mall cop and run around trying to arrest family members around the house then they all have to clap and celebarate for him so he feels important.  This movies plot is god awful and eveytine i see paul c u n t on the segway i vomit a pool of blood on the floor. The plot is people are trying to rob a hotel of all of there paintings and a mall cop that weighs 298 pounds some how beats trained professionals. Dont see this movie save your money and spare you heart the trouble of watching this movie.",
      "total_reactions": 0,
      "user": "CGULLZ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2015
      },
      "score": 10,
      "text": "I would rate this 12/10 unfortunately I can only rate 10. This fantastic piece of cinematography has changed my outlook on life. I finally left my lonely dark sodden bedroom to become half the man Paul Blart could ever be. I left my wife after assuming she was only in love with me because she wanted a visa. Also I arranged to have my mum killed by a passing Milk Van, because safety never takes a holiday. Always bet on Blart xxx.",
      "total_reactions": 0,
      "user": "paulblartmallco"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "This was a lot better than I expected. A 13/100 is definitely too harsh. Kevin James was really good and I'd recommend it if you go for this sort of thing.  Overall a fun movie.",
      "total_reactions": 0,
      "user": "DanBurrito"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2015
      },
      "score": 10,
      "text": "I was very impressed by this film, indeed! The movie presented itself as a lighthearted comedy but I saw through that to the milky nougat inside. The relationship between Paul and his wife was very dark and I saw parallels to my own. I will never forget Paul Blart mall cop 2.",
      "total_reactions": 0,
      "user": "Kevin_James"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2016
      },
      "score": 2,
      "text": "A more appropriate title for this movie would be \"Paul Blart: Unfunny Cop 2\" and a more appropriate tagline for this movie would be \"Vegas has a new unfunny high roller who just doesn't get the funniness right.\"",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2016
      },
      "score": 1,
      "text": "The first movie was fun but it clearly did not need a sequel. Paul is angrier, not as much fun at all and alot of the jokes are overused. The film gets quite tiresome even with an hour and thirty four minute run time. I felt bad for the daughter because she seemed to get so hammerd by her way too overprotective father. The movie was horribly and is the perfect example of Hollywood being  lazy and not caring enough to make a good movie",
      "total_reactions": 0,
      "user": "nahtan1244"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2016
      },
      "score": 0,
      "text": "Never before have I loved a guy so much. I'm not gay, but I would be for Kevin James.  His acting in this movie was stunning and every time he speaks I just wanna make sweet roll love to him.  The other actors in the movie feel wooden in comparison to his stardom.  This movie truly is the embodiment of our generation as a whole.  The reason that I gave it a 0 out of 10 is because I thought there could have been more gratuitous butt angles.  They really missed Kevin James's true good side, if you know what I mean ;).",
      "total_reactions": 0,
      "user": "placebo55"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2016
      },
      "score": 1,
      "text": "This terrible-directed film tries to give fun to the audience, but it really fails with it's goofy actors and boring story. Kevin James did his best but he couldn't save the truly not-funny-results.",
      "total_reactions": 0,
      "user": "Futuredirector"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2016
      },
      "score": 10,
      "text": "The best anime i have ever watched. Amazing characters, amazing plot, some of the most pant-wetting hilarious jokes i have ever heard. Paul Blart: Mall Cop 2 is by far the best movie ever",
      "total_reactions": 0,
      "user": "LOTC"
    }
  ]
}