{
  "mc_avg_user_score": 5.5,
  "mc_metascore": 26,
  "mc_mixed_rating_frequency": 4,
  "mc_movie_name": "Pawn Shop Chronicles",
  "mc_negative_rating_frequency": 3,
  "mc_positive_rating_frequency": 6,
  "mc_pro_critic_reviews": [
    {
      "critic": "Chuck Bowen",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 63,
      "summary": "Wayne Kramer thankfully refuses to cloak his excessiveness in hedge-betting self-consciousness and the result is a gratifyingly disreputable B-movie blow out."
    },
    {
      "critic": "Glenn Whipp",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "Kramer, 10 years removed from his lone critical success, \"The Cooler,\" and writer Adam Minarovich aren't exactly aping Tarantino, if only because they don't have the talent or inclination to aim that high."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 38,
      "summary": "It’s coherent enough, but entirely too long and unpleasant when it could have been one brutishly edgy hoot after another."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2013
      },
      "score": 30,
      "summary": "\"Hee Haw” meets “Pulp Fiction” at the meth lab: That describes the style of Pawn Shop Chronicles, a hillbilly grindhouse yawp of a movie that belches in your face and leaves a sour stink."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2013
      },
      "score": 30,
      "summary": "Despite its noteworthy cast who presumably had some time to fill between better gigs, this is the sort of instantly disposable B-movie effort that Quentin Tarantino would have chucked in the wastebasket after a first draft."
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 30,
      "summary": "Director Wayne Kramer (Running Scared, Crossing Over) makes plain his cartoon-comedy intentions early and often via comic-book-panel-style title cards. The presiding atmosphere of over-the-top zaniness, however, is of a broad, banal sort involving little people, rampant nudity, and quasi-religious nonsense."
    },
    {
      "critic": "Peter Sobczynski",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2014
      },
      "score": 25,
      "summary": "The problem with Pawn Shop Chronicles is not the fact that it is a clone of \"Pulp Fiction.\" The problem is that it is a lousy clone."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2013
      },
      "score": 20,
      "summary": "The film doesn’t feel like a fresh riff on familiar tropes so much as a bad cover of Pulp Fiction."
    },
    {
      "critic": "Andrew Schenker",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 20,
      "summary": "Only one gag (involving a town’s rival barbers) sticks; the rest is just whistlin’ Dixie."
    },
    {
      "critic": "Gabe Toro",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2013
      },
      "score": 16,
      "summary": "It’s all very first draft, with a layer of supernatural permeating the events that suggests added attempts to connect three wildly disparate storylines."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2013
      },
      "score": 1,
      "text": "Director Wayne Kramer once tried to make an insanely over-the-top action movie, Running Scared (also starring Walker), which many admired for its sheer over-the-topness. But then Kramer detoured for the completely earnest (and awful) immigration drama Crossing Over, which proves a point: Kramer isn't going over the top for any honest, organic reason but rather as a cold, calculated exercise. It's the same with PAWN SHOP CHRONICLES, though this time he and screenwriter Adam Minarovich very obviously draw their empty inspiration from Pulp Fiction. So the movie is crazy and agitated and loud and full of left turns  and, yes, over-the-top  but these things don't add up to anything that could be called a good movie. There are a couple of shock-based laughs early on, but then the laughs dry up, as do the thrills and the tingles. It's just horrifying and soul-deadening. All of that said, D'Onofrio gives a very interesting performance as the slightly befuddled pawn shop proprietor.",
      "total_reactions": 1,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "Despite critics reviews, the movie totally makes sense. It's all about perspective. The main idea is that one cannot go out of his boundaries and what life gives him is what he deserves. The psycho-husband who wants justice all for his own benefit, ends tragically, killed by his own goal. The greedy ones, impersonated by meth-addicts, get killed by their aim  having all, ignoring the consequences of their acts. And \"The King\", left alone and dumped by his own material life, leaves himself in the hands of faith  the moralizing end. The purpose of this movie is to scream out loud that some things must be left how they are. All those philosophic ideas, mixed-up with a great cast, create maybe one of the greatest stories of this decade. A bit sloppy here and there, but hey, you can't please everybody as well as nobody can be pleased enough. (I'm really sorry for my bad English, it's not my native language and I have a hard time learning it)",
      "total_reactions": 1,
      "user": "deftaraul"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "The critics hated it but I dug it.  I liked the cast, the disturbing and very strange story and the character, despite being awful, terrible people, were entertaining in their own, unique way.  And how often are you going to see pretty boy Paul Walker as a racist moron?",
      "total_reactions": 1,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2014
      },
      "score": 4,
      "text": "TARENTINO storytelling, mirroring Pulp Fiction in every way except for originality. If you like Pulp Fiction, watching this will drive you mad as you will notice/recognize key elements brazenly ripped off.  It strings together seemingly unconnnected storylines  into a story. Just as Pulp Fiction, in this some of the storylines more interesting than others-certainly more humorous. Walker was good but his appearance short. Unfortunatly Frasier seems to get most of the play in the 2nd half of the movie which makes this movie even worse.",
      "total_reactions": 0,
      "user": "geedup"
    }
  ]
}