{
  "mc_avg_user_score": 6.6,
  "mc_metascore": 53,
  "mc_mixed_rating_frequency": 53,
  "mc_movie_name": "Penguins of Madagascar",
  "mc_negative_rating_frequency": 19,
  "mc_positive_rating_frequency": 90,
  "mc_pro_critic_reviews": [
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2014
      },
      "score": 88,
      "summary": "The screenplay by John Aboud, Michael Colton and Brandon Sawyer has a fizzy, pop-culture pizazz, tempered by a distinctly vaudeville sensibility. It’s smart, but not brainy; dumb, but never inane."
    },
    {
      "critic": "Walter Addiego",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2014
      },
      "score": 75,
      "summary": "There’s plenty here to tickle the kids, and that’s what counts."
    },
    {
      "critic": "Geoff Pevere",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2014
      },
      "score": 75,
      "summary": "Any kids’ cartoon that opens with narration by the mondo eccentric German filmmaker Werner Herzog is bound to bring comfort to hearts of certain parents in the house."
    },
    {
      "critic": "Christy Lemire",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2014
      },
      "score": 75,
      "summary": "The pacing is so zany, the jokes are so rapid-fire and the sight gags are so inspired that it’s impossible not to get caught up in the infectious energy of it all."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2014
      },
      "score": 75,
      "summary": "Frenetic and frequently funny, Penguins Of Madagascar represents the DreamWorks Animation franchise style — which boils down to self-aware, but naïve, talking animals who learn kid-friendly life lessons — at its most palatable."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2014
      },
      "score": 75,
      "summary": "Penguins of Madagascar is fun while it lasts, and then mostly forgettable except for whatever shake-your-head lunacy sticks."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2014
      },
      "score": 75,
      "summary": "In zany set piece after zany set piece, the movie sets itself apart as willing to try anything, do anything for laugh, and it succeeds more often than it fails, even when falling back on some creaky wordplay and the occasional over-emphasis on both fart gags and pop culture references."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2014
      },
      "score": 75,
      "summary": "As “cute and cuddly” as ever, and often downright hilarious."
    },
    {
      "critic": "Bill Zwecker",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2014
      },
      "score": 75,
      "summary": "From the opening frame right up to the whirlwind finale, you will be treated to non-stop action, clever dialogue and quite a bit of zany energy. If I’d fault anything about this fun romp, it’s that the filmmakers tried to jam-pack too much into one movie."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2014
      },
      "score": 70,
      "summary": "All Penguins of Madagascar wants to do is make you laugh at its silliness. It succeeds."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2014
      },
      "score": 70,
      "summary": "The decision to focus on the series’s comic relief has resulted in the loosest and perhaps funniest film of the brand."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2014
      },
      "score": 67,
      "summary": "A merry entertainment that never pretends to greatness, Penguins of Madagascar is all about antics, verbal and visual."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2014
      },
      "score": 63,
      "summary": "Parental units who manage to remain conscious through the kiddie-centric proceedings can either savor, or groan at, Malkovich's bespectacled Octavius barking punny, celebrity name-dropping orders to his minions."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2014
      },
      "score": 63,
      "summary": "It does well to put more focus on delivering a plethora of jokes, imitations, zippy repartee, and sight gags than its plot's familiar machinations."
    },
    {
      "critic": "Cath Clarke",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2014
      },
      "score": 60,
      "summary": "The film is frantic and silly and our biggest gripe is that all the penguins look the same."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2014
      },
      "score": 60,
      "summary": "Penguins of Madagascar is an injection of sugar direct to the pineal gland and woe betide any parent who tries to get their children to take a nap after seeing it."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2014
      },
      "score": 60,
      "summary": "All the glossy, kinetic animation and inventive action sequences get lost in the gag machine. The film throws jokes out like a tennis-ball machine on the fritz: gross humor, slapstick pratfalls, bizarre non sequiturs. The randomness does land a few laughs, but it's also exhausting."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2014
      },
      "score": 60,
      "summary": "A sassy script and good-natured voice work from Benedict Cumberbatch and John Malkovich should keep kids and grownups entertained over the holidays."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2014
      },
      "score": 50,
      "summary": "This is a joyless, frenetic film that is very rarely funny."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2014
      },
      "score": 50,
      "summary": "It is a perfect example of marketing driving the machine. It's also a profoundly silly movie that really isn't even trying to play by the conventional rules of family animation."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2014
      },
      "score": 50,
      "summary": "The pun is a gun for Penguins' writers. Not a sharpshooter rifle, but a machine gun that unloads a nonstop quip barrage, mowing down the real promise of this 3-D animation action comedy."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2014
      },
      "score": 50,
      "summary": "It’s a movie content to stay within the show’s comfort zone, changing things up mainly with flashier, 3-D visuals, a couple of which are dazzlers, and a theme that doesn’t connect in any notable way."
    },
    {
      "critic": "Calvin Wilson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2014
      },
      "score": 50,
      "summary": "Strives to be entertaining, but for much of its run time it is so emotionally uninvolving that even the smallest children might find themselves bored."
    },
    {
      "critic": "Michael Rechtshaffen",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2014
      },
      "score": 50,
      "summary": "While there are plenty of madcap antics to fill a feature, all that manic energy ultimately proves to be more exhausting than exhilarating."
    },
    {
      "critic": "Jeff Labrecque",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2014
      },
      "score": 42,
      "summary": "Aims primarily for the kiddies, racing from one frenetic action sequence to another like some haywire Walter Lantz cartoon."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2014
      },
      "score": 40,
      "summary": "What Penguins Of Madagascar needs is a roomful of ruthless editors to take jokes out of the script, particularly the ones aimed at pleasing the grown-ups in the audience."
    },
    {
      "critic": "Geoff Berkshire",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2014
      },
      "score": 40,
      "summary": "The graceful camerawork, precise editing and high-quality animation still can’t disguise the lack of imagination that went into the overall conception and the repetitive sameness that creeps into every bind the penguins find themselves in."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2014
      },
      "score": 30,
      "summary": "The story line, a sequence of very loosely connected events, sustains a state of almost pure brainlessness with its indifference to dramatic development and the dictates of logic, even the fantasy logic of cartoons. It’s as if most of the script had been generated by algorithms."
    },
    {
      "critic": "Simon Abrams",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2014
      },
      "score": 30,
      "summary": "Plays like a sampler of Dreamworks Animation's worst creative impulses: sugar-rush pacing, pandering meta-gags, and a slick, flavorless animation style."
    },
    {
      "critic": "Inkoo Kang",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2014
      },
      "score": 30,
      "summary": "The unfunny, unmoving, and uninspired Penguins never persuades us of its need to exist. Sure, there's a muddled lesson at the end, as tacked on as a Post-It on a piece of week-old cake."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2014
      },
      "score": 25,
      "summary": "A lazy, noisy ADHD-addled collection of animated clichés guaranteed to give anyone older than 5 a headache, even if you don’t see it in optional 3-D."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "One of the best movies of 2014. My kids liked it so much that they watched 4 more time. Everybody should watch it, because it one the best movies out there.",
      "total_reactions": 1,
      "user": "bmoney1234567"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "I had a wonderful time with this animated spin-off of the Madagascar films. Extremely funny throughout, I mean Laugh Out Loud Humor. It kept me entertained throughout. Love the penguins but my favorite is Private. LOVE PRIVATE!!!!!! just in my opinion a great and funny animated film for everyone in the family to enjoy.",
      "total_reactions": 1,
      "user": "jacobshoff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "All adults who care not for the simpler humor in life, kindly avert your eyes from this one--it's cute and fun and playful through-and-through. At 15 years old myself (and still a huge and unabashed sucker for animated movies) I watched this with my younger sister and we thought it was hilarious; we watched it about 3 times through just to fully enjoy the octopi's names, which (no spoilers) are puns. It's a family flick and we you shouldn't expect any groundbreaking twists or riveting storylines, fans of fluff and fooling around can get behind this fun Madagscar spinoff.",
      "total_reactions": 1,
      "user": "Skidberg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "This movie is completely underrated, I know the story  is weak along with the plot but the jokes make up for it and some good characters so it deserves at least an 8.",
      "total_reactions": 1,
      "user": "buttonscasper"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2015
      },
      "score": 4,
      "text": "Like 'Minions', this is an unnecessary spin-off about starring the comic relief characters from the original movies. It's sad that good characters like the penguins were tossed into this messed up movie, with 1-dimentional animals that are somehow spies and that have started their own secret alliance. The villain is strange, and the plot is ridiculous. Oh, well... at least it's better than 'Madagascar 3'.",
      "total_reactions": 1,
      "user": "YellowKirby"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "I'm here so early with a change of this movie right here. So yes, as we expected... it's staying to be a score of 7. It's just decent that it actually works as a Madagascar spin-off.",
      "total_reactions": 1,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2014
      },
      "score": 2,
      "text": "Sporadically amusing but otherwise hollow and over the top, the silly Penguins of Madagascar offers a derivative take on humour and thus, falls flat on its clichés.",
      "total_reactions": 4,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Three generations of our family went to see this together, my wife was wiping tears out of her eyes at one point, my son giggling away and my in-laws both laughed out loud on multiple occasions. I great family film that I would rate over any and all the Madagascar movies. Take the kids to see it and you may laugh more than they do. 'Kevin, Bake On'.",
      "total_reactions": 3,
      "user": "shcakup"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "The new Dreamworks animated movie is a spin-off of the popular but not so good Madagascar film series and it’s their 3rd feature of this year following Mr. Peabody & Sherman and the sequel to How To Train Your Dragon.",
      "total_reactions": 8,
      "user": "Pazzo7"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "This movie is funny start to end. A movie that kids will enjoy. The pace is crazy funny, the jokes are humorous. Sound Mixing was OK. this movie will make your eyes cry. And Don,t forget this movie. Replay Value: High.",
      "total_reactions": 4,
      "user": "IMAX500"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "The original 2008 film had the same name, but this time they're crossing the globe to prevent Dr. Octavius Brine from carrying out his evil plans. This is a fun foursome with lots of quick-witted banter. The energy never lags and the snappy one-liners are almost constant. For the grownups there are plenty of pop in jokes. My fave was the villain's orders that included movie star names, like: \"Drew! Barry! More power!\" (say it out loud). And it's true, Benedict Cumberbatch can't properly pronounce penguin. Stay thru the early credits for one final bit.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "Kids might be the only one enjoying the hilarious and adventurous penguins journey far across few beautiful countries in which the visual of the cultural backgrounds are presented extremely stunning as usual by Dreamworks. The spin-off of the Madagascar characters further continues the ridiculousness of the franchise but unexpectedly, the over-ridiculous screenplay has already been seen elsewhere, and it looks a little bit more silly for the elders. Although lighthearted, the paper thin plot that does not allow much of characters development and utilise the ideas from other animations by changing a small part here and there are unable to make the adorable yet naughty penguins to match the quality of the old times of studio's production, even any recent Disney's production, or to match Puss in Boots (spin-off of Shrek series). However, it is indeed a straightforward entertaining stress-free flick even if it falls short of generating powerful inspiration, love and emotion.",
      "total_reactions": 2,
      "user": "michael1208"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "What a disappointment considering the other great dream-works products...cliches and used up gags were unable to save a storyline that frankly was pathetic.  What makes it especially painful were a magnificent cast who's efforts could not save this disaster....now just maybe a 5 year old or younger might miss what us adults experienced...",
      "total_reactions": 2,
      "user": "JohnFree"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Ever since the Madagascar movies, I have been obsessed with the Penguins. I was so happy when their show came out and now we have a movie?! The movies was definitely no disappointment.",
      "total_reactions": 2,
      "user": "homer4president"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "i thought the movie was funnier then heck. everybody in the theater laugh a lot out loud. those penguins are just funny..  saw the preview of square pants sorry that is one i will pass on.  lots of cartoon type coming out here shortly most i will pass on",
      "total_reactions": 5,
      "user": "SHORTFINGER"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2014
      },
      "score": 0,
      "text": "This movie has totally unoriginal jokes and silly humor. You actually feel like the script has been forced out of writers at gunpoint. I usually don't write reviews for movies, but this one was bad enough to compel me towards writing it.",
      "total_reactions": 6,
      "user": "hemhedge"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 4,
      "text": "I love the Madagascar movies but this is just kind of boring and pointless. Sure it has its moments but the movie fails to entertain me. Like even the fight scenes were boring. I didn't really find it enjoyable but i'm sure the kids will like it. It's pretty much on my top 10 worst animated. Even though it had is moments this movie just doesn't deliver.",
      "total_reactions": 3,
      "user": "DavidV293"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "The Penguins of Madagascar is the Penguin scenes from the previous films and the Christmas short but extended into an 1 hour and a half. Surprisingly it never gets dull with the film constant moving from one scene to another with lots of energy and at no point is the original Madgascar crew missed as the penguins have always been the stars and prove they can carry the show on their own. Unfortunately, they are joined by a crew of not that interesting characters who weigh down the film following its first ten minutes. Even with this the film is still fun from the Dreamworks style humor involving an overlord of pop culture references and tons of other jokes that surprising don’t get on ones nerves. The film doesn’t do anything deep with the Penguins and at times the film could’ve used some heart but there is a lot of fun and energy among the core characters that keep the film from falling apart. Penguins fans will enjoy the film as they are finally getting the Madagascar film they wanted. Those who aren’t a fan of Dreamworks’ style of humor will probably want to skip this one. Its nowhere near quality of Dreamworks’ How to Train Your Dragon 2 but it’s a fun hour and a half that even with low quality writing and humor that somehow shouldn’t work still manages to be a step above most Dreamworks films.",
      "total_reactions": 1,
      "user": "Jacob"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "Some animated movies tell deep stories meant to teach kids something, while others simply want to make them laugh. \"Penguins of Madagascar\" is the latter. The jokes come at an almost non-stop rate. The plot is a cliché spy story.",
      "total_reactions": 3,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2015
      },
      "score": 5,
      "text": "While there are a few funny one-liners, especially the celeb names (Drew, Barry, more power! Hugh, Jack, man the battle stations! Nicolas, cage them! etc.) most of the movie just feels like it was written by a 5 year old, with 3 year old's being the target audience. It is just so dumb, and it neeeeeeeever gives you a chance to breathe. There's constantly something going on. Try to watch it with your kids (although I'd recommend just letting them watch it on their own).",
      "total_reactions": 1,
      "user": "Patrick94"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "It's seems like now days their are a lot of supporting character in Animation movie that just so popular by themselves that they just manage to have their own merchandise and now even having their own movie like Minions ( 2015 ) that will come to cinema this year from Despicable Me ( 2010 ) and now the Penguins from Madagascar ( 2005 ) and they already have their own TV-Series so that's quite amazing already.",
      "total_reactions": 1,
      "user": "FallsDownz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "A fun and exiting movie, that’s fails to deliver over long term. But I love the classic spy-action theme, and the movie is overall better than what I expected. The choice of voices are great, especially Benedict Cumberbatch. The story is acceptable but I can’t really relate to the characters and the movie doesn’t fit very well for me.",
      "total_reactions": 1,
      "user": "TheApplegnome"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "The Hunger Games - Mockingjay Part 1 had a more rich drama and romance, due to Katniss' preocupation of Peeta (that didn't appeared in both prequels, due that she was faking). Buy it had way less action. That sense of mistery, suspense, action that had especially the first one, and the second one, didn't appeared in this episode of The Hunger Games chronology. I give a 7/10",
      "total_reactions": 5,
      "user": "Luretuy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "A fun but definitely flawed film. The new characters are a bore and just feel like placeholders just so that the Penguins can do things. The Penguins are still charming, but given the fact that it has a \"been there, done that\" plot, it feels tiring and predictable as well (Not to mention that it also borrows elements from Despicable Me 2). It's also, in my opinion, too fast paced and doesn't really care about anything else other than the Penguins. Small children will be able more enjoyment of this one.",
      "total_reactions": 1,
      "user": "KENXAVI"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "Penguins of Madagascar is just another children's movie. It has some funny parts, some nice jokes, but it is mostly boring and very cliched. Any kid less than 10 years old will like it, but I can't say for anyone else.",
      "total_reactions": 1,
      "user": "Dokalu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "The Penguins of Madagascar es una película que, digamos, hace un buen uso de sus características para dar un buen entretenimiento tanto a niños como adultos.",
      "total_reactions": 0,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "The Penguins of  Madagascar is a funny and lovable film . All the actors did well. Those who are familiar with the TV series will hate certain things like penguins turning into monsters. The villain character was not great and the some portions could have been better. The final act was great.",
      "total_reactions": 0,
      "user": "movielove111"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2015
      },
      "score": 7,
      "text": "The penguins of Madagascar are the best characters in the franchise. We've been waiting for them to finally get a movie for a long time and now we finally have one. I enjoyed the movie. I thought it was really funny but there are a few flaws:",
      "total_reactions": 0,
      "user": "DanBurrito"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "Penguins of Madagascar is a faithful and delightful film adaptation the Nickelodeon TV show of the same name. Actually, this film was quite interesting, adventurous and fun! The movie contains the same Thea of suspense, action, adventure and laughable comedy from the previous Madagascar films as well as the TV series of the same name. Stop hating these four adorable little guys and be positive! To me, I was really waiting for a movie solemnly focusing on the four penguins and this film does a successful job bringing their charm and wit to the big screen in 92-4 minutes rather than 25-30 minutes. This is also a very good animation effort! Well done Tom, Chris, Conrad and Christopher! I also wanted to know more about the history of these lovable four spy birds and exactly how they came to New York City and had been living in Central Park Zoo, forming the Nickelodeon TV series ever since. This film is a story of friendship, finding family, teamwork, action and adventure, betrayal and all coated with cartoon comedy! Well done Eric and Simon!! Also there are some charming and heart touching moments. It's fun for the whole family! This movie is funny start to end. A movie that kids will enjoy. The pace is crazy funny, the jokes are humorous. Sound Mixing was OK. this movie will make your eyes cry. And Don't forget this movie. Replay Value: High.",
      "total_reactions": 0,
      "user": "toronto905"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2015
      },
      "score": 10,
      "text": "The plot is great, it is hilarious, the back story is makes sense and it helps me get to know the penguins bette. Nicholas, cage anyone who dose not like this movie.",
      "total_reactions": 0,
      "user": "Jollyjoe1000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "This movie was fun to watch and all of the Octo-henchmen with celebrity names was cute.",
      "total_reactions": 0,
      "user": "jinannn31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2016
      },
      "score": 6,
      "text": "A recycled idea, with simple interpretations, unpredictable story-telling, not-human characters and normal animation is the miepxed result of this unremarkable film. But, at least, is a great film for these good protagonists of a good thrillogy.",
      "total_reactions": 0,
      "user": "Futuredirector"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2016
      },
      "score": 6,
      "text": "“Penguins of Madagascar” promises a reasonable share of wit the minute it opens with a voice-over by Werner Herzog, in a sendup of his documentary on Antarctica, “Encounters at the End of the World.” That film posed the question of whether penguins could exhibit insanity. In the case of this spirited animated movie, the answer is assuredly yes.",
      "total_reactions": 0,
      "user": "MovieGeeks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "ok. The writing is just ok and the characters are ok. The climax is just good. I get it. But  the humor. I mean seriously. 90% of it was amazing. Remember...",
      "total_reactions": 0,
      "user": "Pikabrawler"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2016
      },
      "score": 10,
      "text": "Who cares if people hate this movie, or that it's weird? It's pretty funny. I grew up with the lovable Madagascar penguins and the animation in their own movie was breathtaking.",
      "total_reactions": 0,
      "user": "Bmeyer8"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2016
      },
      "score": 8,
      "text": "Getting their own episodes on Nickelodeon once, the penguins have gotten enough popularity to have their own movie. In terms of the plot, it's nothing to brag about. A silly villain with an even sillier plan to take over the world. It's entertaining as ever, however it's seems that they've forced it with a morale that's never been present until the end of the film. In terms of jokes, you just can't help but laugh. It's definetly a movie for your whole family.",
      "total_reactions": 0,
      "user": "wariothelegend"
    }
  ]
}