{
  "mc_avg_user_score": 5.1,
  "mc_metascore": 47,
  "mc_mixed_rating_frequency": 93,
  "mc_movie_name": "Percy Jackson & the Olympians: The Lightning Thief",
  "mc_negative_rating_frequency": 100,
  "mc_positive_rating_frequency": 115,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "The movie was a complete disaster!!! All Percy Jackson book fans loook away dont bother seeing it because its a waste of time, money, and a complete waste of rick Riordan's awsome writting skills. (which is the best thing since Harry Potter, Avatar, and CBS news!!!!!!) The movie went to fast, it didn't complete ideas it left out 3-4 main charecters, It completely switched around peoples personalities, changed almost the whole story plot, and to top it all off Chris Columbus should of chose the author to direct, pick the cast, and write the screen play by himself, and it still would of been better!!!!!!    a thumbs down movie for Colubus",
      "total_reactions": 2,
      "user": "shel97girl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "Cute, but slow and boring. While I love the theme, I never read the series. The movie targets the same age group as the books and hits the mark. Unfortunately, I'm not part of the demographic.",
      "total_reactions": 1,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2012
      },
      "score": 4,
      "text": "This movie has good and bad moments, mostly bad moments, that's why I gave a 4. I agree with other users with the cheesy acting of the characters. Cheesy acting really makes me turn off and sometimes it makes me don't watch the rest of the movie. It also has that immature element on the plot, which makes the movie childish than \"adult-ish\". But on the other hand, it does have nice special effects which lift the movie a little bit. But sadly, it is not enough to make the movie worthy to be called \" as good as\" the original book.",
      "total_reactions": 1,
      "user": "aaronpaul121"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2011
      },
      "score": 0,
      "text": "**** THIS MOVIE! **** THIS MOVIE! **** THIS MOVIE! **** THIS MOVIE! this movie is **** i mean **** i remember that back in 2010 when this movie came out i had read all the books all over again and invited a whole bunch of friends over to see it close to opening night. i was going to see sean bean, Pierce Brosnan and Uma Thurman portray my favorite characters in the book. and at the time i loved all three of those actors and actresses. then the movie started. it was all down hill from there.",
      "total_reactions": 1,
      "user": "coolgames101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "Let me start by saying that: Chris Columbus ruined what could be a great movie. Although the first two Harry Potter (both directed by him) were excessively long, they were pretty good films, so I was very excited about this version of Percy Jackson.  Well, the running time was shorter that I expected but on Columbus's hands the storyline was childish and the main characters were shallow.  But the worst thing about this film is the adaptation. Percy becomes stupid. Annabeth who is a brave and intelligent friend of Percy, becomes arrogant and snobbish. And Grover is used as comic relief. I think for other people who haven't read the book, the film will be ok. But for me, only the visual effects and main actors saved this film from a total disaster.",
      "total_reactions": 1,
      "user": "Potter17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2012
      },
      "score": 6,
      "text": "They didn't make the Percy movie the way they should have, but it still tells a good, entertaining enough story all its own. Definitely not Chris Columbus's best. If you want to see his triumphs, look for the first two Harry Potter films.",
      "total_reactions": 1,
      "user": "Aquophis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2013
      },
      "score": 2,
      "text": "This seems like a missed opportunity. I absolutely love the books and have read every one of them multiple times. The movie seemed to take the book, ignore some important points, and basically made the movie unappealing at best The main characters are wooden, and what they did to the story line is unforgivable.  This could have been the perfect movie but the directors managed to turn it into something that no one wants to remember.",
      "total_reactions": 1,
      "user": "BlatantInnuendo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "Percy Jackson & the Olympians: The Lightning Thief completely strays away from it's source material and replaces it with a very clumsy plot. It is also plagued with poor acting even if the movie is enjoyable and has the right feel of the book series.",
      "total_reactions": 1,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "Cheesy and childish at its best, but hey. It still helps you memorize all those Greek gods and myth.",
      "total_reactions": 10,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2010
      },
      "score": 0,
      "text": "This movie has absolutely no redeeming qualities qhatsoever to keep it from being the generic piece of **** it is. **** my life. This movie doesn't deserve to exist.",
      "total_reactions": 2,
      "user": "huffnat890"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 4,
      "text": "Warning:  very clunky dialogue and poor acting.  You have been warned.  Most special effects looked good, especially the boat crossing in hell, but some wasn't very smooth looking.  One particular eye rolling moment was when it was explained that the enemies of Poseidon's son cannot detect him on earth was because his stepfather has such bad body odor that it masks his scent.  Yes.  They actually say that in the film.  Like the kid never leaves home, or goes to school, without his evil stepfather in tow.  The film might appeal more to a younger age, and some special effects were good, thus the \"4\" rating.",
      "total_reactions": 2,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "The Director is Chris Columbus, who I called The Family Man, most of his works always contains family value. His previous works include: HOME ALONE (1990), MRS. DOUBTFIRE (1993), BICENTENNIAL MAN (1999), Two early HARRY POTTER series (2001-2002), and RENT (2005), which I loved about. In thiz latest movie, he adapted the first series of Rick Riordan novel. The story told about a common teenager just found out that he is the offspring of Poseidon, one of the Greek Gods (they called it: Demigod). Now is time for Percy to stop the war between the Gods, who demanding the Zeu lost Lightning Bolt. Percy stars by Logan Lerman. Lerman performs adequately on his character. Almost all the mythical characters appear in thiz movie. The other Casts are: Sean Bean, Pierce Brosnan, Steve Coogan, Rosario Dawson, Catherine Keener, and Uma Thurman. The script itself applied a little bit shallow and corny. Obviously, there are some weaknesses that I found disturbing. First, all The Customes on thiz movie is so ordinary and lack of innovation. I believe we already seen it, even on HERCULES TV episodes. Some of the settings also terribly executed, the training camp set (the place that Percy and other Demigods train) is clearly not in high concept. It seems to be, Columbus did not support by fine Production Designer Team for thiz time. In overall, thiz movie is so far from building a great franchise like Harry Potter. The fact, There are some copy-paste elements on thiz story, like: trio friends bond, the chosen one, magical gadgets, wicked step family, etc. America wants to have their own Harry Potter? They must try harder. Visit My Blog on JONNY'S MOVEE : http://jonnyfendi.blogspot.com",
      "total_reactions": 2,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2011
      },
      "score": 4,
      "text": "The Lightning Thief isn't bad. It has decent effects, okay performances, and can be fun for people who haven't read the book. But people who have read it might get a few thrills, but ultimately will be frustrated by the unfaithful adaptation that Chris Columbus did, and the ending which doesn't open a franchise as well as you would have hoped.",
      "total_reactions": 2,
      "user": "Moviebuffreview"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "I've been dying to see this movie when I read all five of the Percy Jackson books. too bad it was disliked by fans because it was a Harry Potter ripoff. thats alright, Chris Columbus. you gave this movie worth a try. bottomline: the actors are supporting, the visuals were nice, and the storyline is entertaining.",
      "total_reactions": 8,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "I read all five books of Percy Jackson & The Olympians. I must say it was a good collaboration of Greek mythology and modern events. I like the story as well as the characters. However, the movie was quite disappointing. I wasn't expecting anything in the movie but I was disappointed how the story changed. After reading the book, I was excited to see how the cabins would look like, the fight b/w Clarisse and Percy in bathroom, how Iris-messaging worked and a lot more things I would like to see. But the movie didn't even show it.",
      "total_reactions": 9,
      "user": "unliunliunli"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "One of the better Greek-myth movie currently. Cris Columbus is planning to do sequals so that could explain why the book and movie aren't similar. Really good soundtrack.",
      "total_reactions": 2,
      "user": "Vedo"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "Thiswas a good movie. :) I love the part at the end where Gabe gets turned 2 stone. :) this is a good movie. My 2 next 2 Eragon.:) M e and my sister Julia love this movie.",
      "total_reactions": 2,
      "user": "eragondragon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "The movie is okay, the movie does not follow the book at all either. If you think the movie was good, go read the book and then tell me otherwise. The movie should have stuck to the plot of the book, yes the movie plot was decent but the book's plot is much much better, Percy Jackson is explored much more in the books while the movies only give him a shallow approach. The movie fails to address some VERY IMPORTANT aspects of not only the first Percy Jackson book but of the entire series. I give the acting and special effects credit, they were pretty good but the plot is just not up to par. Maybe if the movie followed the book the score would be higher but it doesn't. The writer of the books Rick Riordan must be shaking his head in dissagreement thinking \"God, they really butchered my story\". Overall, The movie is a dissapointment for fans of the books and if you haven't read the books the plot might seem good to you but those of us that read the books know that this movie does not follow the books and is NOTHING compared to the books. My suggestion: Those who haven't read the book looking for an entertainment fix should watch but those that have read the story don't watch it because you will be pretty upset over it. There are certain books adapted into movies that are mindblowing (like The Godfather) but then there are movies like this that only share the name and nothing else.",
      "total_reactions": 1,
      "user": "Sachi"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "Logan Lerman along with the ensemble cast had an amazing movie. Dissapointed that the movie didn't follow the book well, but the movie was GREAT regardless. Logan is simply an amazing actor, and portrayed Percy perfectly. One of my favorite movies of all time without a doubt.",
      "total_reactions": 2,
      "user": "jillmacintyre"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2011
      },
      "score": 4,
      "text": "With a terrible pace, unconvincing actors, Percy Jackson brings us one of the worst adaptations of a book purchases big screen, read the book who really can tell how bad the movie is.",
      "total_reactions": 1,
      "user": "vini1904"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "This isn't exactly a great start for the movie series, but it is generally good. The story is okay, but it seems like there are a lot of plot holes within it. The special effects are okay.",
      "total_reactions": 1,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "I am a big fan of the Percy Jackson series. But what I found is that the movie isn't as interesting and as good as the books. Movies should give more fast pacing story plot and visual than books do. But I found the books are actually better than the movie.",
      "total_reactions": 1,
      "user": "eagle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "Beautiful animation and scenery with decent acting. It should be a great family movie. However, I found that it was quite different from the book and it slightly resembles Harry Potter. But it is still quite a good movie to watch and burn some time with.",
      "total_reactions": 1,
      "user": "Yoshipie"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "I just LOVE this movie and I really learned alot in this movie and I just really hope that they make another one (I really really want them to make another one!)",
      "total_reactions": 2,
      "user": "mybestfirned789"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "The story of the game follows the same exact plot as the book, so everything is still intact. The story is a well written story with believable voice acting and characters. I really liked the characters. They're full of personality and hilarious. The special effects are some of the best I've ever seen in a movie. The movie tells the story from beginning to end well. The movie is a bit of a surprise. This is one of the best movies based on books I've ever seen. I hope to see more from this in the future",
      "total_reactions": 2,
      "user": "Playstationguy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "Well, it totally ruined the book, and not that the book is a masterpiece or something, but it was a very fun and cool book to read, and the movie pretty sucks. It seems like Chris Columbus tries to revive his Harry Potter success, like he's regretting he haven't directed the rest (and better) Harry Potter films after the first and the second, whom he directed, and stayed enjoying its later success. First of all, Percy Jackson is not Harry Potter and never would be, furthermore, the Chris Columbus-directed Harry Potter films are the worst of the series. If the first Harry Potter film had any connection with the original book and succeeded bringing any of the book's magic on screen, than Percy Jackson failed. Chris Columbus changed the book plot a lot and made it seem like a cheap action-adventures-coming-of-age film, for the likes of teen heroes such as Edward Cullen. The cast is almost pathetic, instead of a 12-year old Percy Jackson, Columbus casted an 18-year old actor, a actor  who couldn't fit the original character, he's just acting flat. Uma Thurman appears here in her worst role since Poison Ivy in Batman & Robin (which is one of the worst films ever), I think she should retire from this kind of roles, the  wannabe-sexy villain ones, it's just don't work. Basically, the highlight of this movie is just a few nice jokes, most of them by Glover the satyr (who is an African-American in the film, in order to satisfy the politically-correct terms). I hope that there wouldn't be a sequel, and if Fox would ever decide to make another film I hope for best it would be a reboot and not a sequel, because Percy Jackson books indeed have a great potential to be a fantastic children-fantasy franchise, and not what Chris Columbus made it look like; it shouldn't be copied after Harry Potter's action-fantasy, and it shouldn't contain a coming-of-age drama, because the Percy Jackson books offers something different than this, which Chris Columbus may not realized.",
      "total_reactions": 0,
      "user": "Tom_Kurtz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "Percy Jackson & The Lightning Thief is, for the most part, good family entertainment. It's pretty visually spectacular, and features some clever and funny deconstructions of Greek mythology. The film features a cast of young-and-upcoming actors Logan Lerman, Alexandra Daddario and Jake Abel as the half-human children of Olympian Gods, the ever-entertaining Brandon T. Jackson as a satyr guardian and a multi-national mix of film and TV veterans playing Gods, monsters and mortals, including Sean Bean, Kevin McKidd, Steve Coogan, Rosario Dawson, Pierce Brosnan, Uma Thurman, Catherine Keener and Joe Pantoliano. With such a wide-ranging cast, the quality of the performances is also rather inconsistent. The youngsters Lerman, Daddario, and particularly Abel and Jackson do their jobs admirably, and keep the story grounded and human in a highschool-drama sort of way (despite the fact it deals with myths, monsters and deities). Thurman makes a effectively creepy and fun Medusa and McKidd, Keener and Pantoliano are serviceable but under-used as Percy's God-dad Poseidon, his caring mother and slimy step-dad respectively. Concerning the rest of the acting \"talent\" the filmmakers have brought in, things are a little less solid - Bean coasts as Zeus, Coogan appears to be reprising one of his less successful, and less funny comic TV creations as Hades and Pierce Brosnan's performance as centaur trainer Chiron is over-acted and bordering on parody. The film's story is diverting, and has some creative and eye-popping set-pieces, but it won't stay in your memory for long. It's never boring, but never quite glues you to the screen either. In comparison with director Chris Columbus' other work, it's probably better than the first two Harry Potter films, but never reaches the heights of his two Home Alone films, at least in terms of pure entertainment. It has moments of beauty, moments of humour, moments of genuine drama, but not quite enough of any of them. In short, it's slightly better than average. Though it won't blow you away, Percy Jackson & The Lightning Thief makes for an ideal Saturday afternoon film, with a few good thrills and a cosy family-friendly moral to the whole thing. As with Harry Potter, the series needs a more talented director like Alfonso Cuaron to take the reigns in order to break free from mediocrity.",
      "total_reactions": 0,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2016
      },
      "score": 3,
      "text": "Despite being occasionally enjoyable and featuring a committed cast that seems to be enjoying themselves, Percy Jackson borrows far too much from superior films and features many dumb moments.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "Nice CGI effects. Begins promising but misses all potential of being a good movie faster than someone can say Poseidon. Absolutely foreseeable plot. Did I already mention the CGI? Yes? That is all to say about it. If nothing else is on tv or no other movie available, okay, see it, but otherwise a waste of time.",
      "total_reactions": 0,
      "user": "SoylentHolger"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "A mediocre book series has been turned into a movie that is \"fair enough\". The actors don't resemble the characters at all, Percy is 5 years older than he is supposed to be, and the plot just doesn't fit with the series. Surprisingly, the movie is actually pretty good as a stand-alone. If you pretend the book series doesn't exist, this movie is one you'll enjoy.",
      "total_reactions": 0,
      "user": "Jboy2468"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2012
      },
      "score": 3,
      "text": "It has great, charming and witty performances from its leads, backed up by its solid supporting cast and has cool special effects, but it doesn't follow the book which makes it look cliche and silly. I give this movie 29%.",
      "total_reactions": 0,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "Strong 3 stars.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2012
      },
      "score": 2,
      "text": "I was observing a 7th grade English class this quarter and they were reading The Lightening Thief and I decided to read it with them. I loved the book and read the entire series quickly. However, I am glad that they are not planning on watching the move as a class because it is an abomination. Changing the storyline that far and entirely removing important characters makes this a serious disappointment.",
      "total_reactions": 0,
      "user": "Chief98"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "This movie is NOTHING like the book. The story has been completely changed - Grover has been changed from a funny, awkward, and lovable character to an annoying, unfunny, Jar Jar Binks-like \"comic relief\" character; Annabeth has been changed from a kind yet strong girl to an obnoxious, generic character; Hades has become the main villain rather than Ares; and there is no comradery or connection between the characters... at all. The movie tries too hard to be funny, but the jokes are forced, unnecessary predictable, and all around unfunny. The book, on the other hand, is hilarious. On the technical side, the special effects are... not bad, but not very good either. But enough pointing out the movies nagging flaws. On the positive side, it has some pretty entertaining moments (Minotaur and Medusa, anyone?) and the acting was decent. All in all, though, I give this movie a 5/10. As far as movies go, it's watchable and I'm sure people who haven't read the book will enjoy it. However, if you HAVE read the book, this movie rent-worthy at best.",
      "total_reactions": 0,
      "user": "FlutterPie93"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 4,
      "text": "I haven't read any of the Percy Jackson books, and I'm gonna say that this first film was a big disappointment. Yeah, I think I'm gonna stick with \"Harry Potter\" and \"Lord of the Rings\".",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2014
      },
      "score": 1,
      "text": "This movie is just terrible. Even if you don't consider the book, this is a dumb hero story that insults the viewer's intelligence. Event the famous actors performances are poor - but this is just because the plot and the dialogs are incredibly poor.",
      "total_reactions": 0,
      "user": "Barto"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "Chris Columbus, who directed the first two Harry Potter films so gracefully, has slipped bellow the bar here, draining all excitement and motivation from this mythological romp.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "I really enjoyed this second time around just as much as when I watched it the first time, and I can't help but still see the Harry Potter similarities and while it will never compare to that series it's still a great film. Lerman leads the way as Percy who is accused of stealing a lightning bolt. Its a little corny but definitely in a way that really works. The young cast definitely overshadows the older ones who make short appearances, but overall a solid film and I look forward to the sequel!",
      "total_reactions": 0,
      "user": "survivorfan989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Im a fan of the book series and now the movie (The only book I'd read is Percy Jackson (Not Harry Potter, Not Narnia, Not Twilight) only Percy Jackson). I for one though the acting, effects, and everything was better then Harry Potter, Twilight, Narnia, Hunger Games. I liked Logan Lerman from his old TV show. However I do believe they took a little too much things out the movie I still liked it way more then all those other movies. I also like Narnia's series better then Harry Potters. Watch it.",
      "total_reactions": 0,
      "user": "MarkMusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2014
      },
      "score": 2,
      "text": "This film just oozes suck, there has been no other than film that blatantly makes Twilight look half decent. All the performances were half assed, and the logic in the movie is dumb. And that's unforgivable.",
      "total_reactions": 0,
      "user": "Rem"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "el ladrón del rayo mantiene poco contenido bueno, es algo básico a lo cual destaco pocas cosas importantes............................................",
      "total_reactions": 0,
      "user": "Jmsbpp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2013
      },
      "score": 5,
      "text": "For me, this movie is a \"meh\". They sort of changed the story the book had and gave it something else it isn't. My suggestion about this, read the the book instead, but you don't have to \"not\" see this movie. Its not that bad, but just wish they sticked with original story.",
      "total_reactions": 0,
      "user": "savagejoe444"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Percy Jackson is a fun family film but with little content.",
      "total_reactions": 0,
      "user": "BrunoAD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "Good book, good film. It has some fails but the story and the effects are interesting. Really recomended for people that enjoy with mithology. Rick Riordan is a great writer, I recomend 100% to read his books.",
      "total_reactions": 0,
      "user": "IKAEs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "Definitely not as true to the high and mighty spirits of its books, unlike those such as the \"Harry Potter\" film series, but despite this, the film has the loving nature from its characters, specifically Percy and Annabeth. Though the story has the obvious CG effects that feel fake to audiences, it still leaves a somewhat enjoyable aftereffect and will leave most audiences satisfied. Though definitely not as well crafted as the books or other film adaptations already out there, \"Percy Jackson & the Olympians: Lightning Thief\" works with its undeniably charming cast and the jam packed action scenes that both the books and this film were able to accomplish.",
      "total_reactions": 0,
      "user": "jeff_reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "Since I'm a big fan of the book series, I was totally excited. But after a few minutes I couldn't believe it. They destroyed the fantastic world of Percy Jackson and Camp Half-Blood. Independent of the book, the storyline was ok... The actors are ok... Action ok... But it just broke my heart when I saw the movie. If you love the books DON'T watch the movie! To sum up the movie was worse than ok.",
      "total_reactions": 0,
      "user": "LadyFantasy19"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "I read all the books, and this movie is somewhat of a disgrace to the book. If you are going to make a movie   from a story that came from a book, at least make it like the book. The only thing that was right was the Locust Hotel, and that scene wasn't that great. Terrible acting. It could be a fan made film, with some extra CGI.",
      "total_reactions": 0,
      "user": "johannation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2014
      },
      "score": 4,
      "text": "The book isn't a bad read, but the movie falls way short of it. It's horribly plotted, horribly acted, and offers little redemption of any kind in the end.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2013
      },
      "score": 2,
      "text": "I know movies adapted from books aren't usually going to meet expectations for some, but this was just ridiculous. It skipped out on so many things that made the book good. The acting wasn't all that great, which I have endured over the course of years. It had no character development, and overall, a terrible movie.",
      "total_reactions": 0,
      "user": "cag11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2016
      },
      "score": 7,
      "text": "I know what you're thinking when you see the poster and the previews for this film: \"Harry Potter\" ripoff. Doesn't help much that the film is directed by Chris Columbus, who directed the first two \"Harry Potter\" films (which were both great. For those that want my thoughts, I'm probably only gonna review the \"Deathly Hallows\" films, since those are the ones I remember the clearest. Sorry). Even despite the obvious connections to the Wizarding World, \"The Lightning Thief\" is a film that works overall: it's visually amazing, it's fun to watch, it's exciting, and it's considerably well-acted overall. It's not the best thing you'll ever watch, and fans of the book won't be too pleased by how much different it is from the book, but all in all, if you know what you're getting into, \"The Lightning Thief\" is an overall entertaining film that's worth a good watch.",
      "total_reactions": 0,
      "user": "FreedomFighters"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "this movie does not do the source material any justice i can't believe the director of harry potter did this travesty they gutted the book removing all the good stuff and replaced it with generic boring  i would list all the things wrong with it but that would take to long the only things they really keep over from the book are the names, the bare bones basic plot of the story and that's it, a utter let down to any fan of the books as a stand alone movie it fairs better but not by much",
      "total_reactions": 0,
      "user": "MadCitic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2013
      },
      "score": 3,
      "text": "I really want to like Percy Jackson. I really do. But not only is nothing that I enjoyed in the books in the movie, the film also is an embarrassment to the literary saga. The complex characters I remember have been replaced by bland, dense fantasy archetypes. The acting, especially Lerman as the lead, is awful. Every character has been dumbed down and even Grover, who served as a major emotional support and friend to Percy, has been transformed into a typical comic relief who sprays one-liners and pop culture references without any thought or effort. Even the action sequences are marred by miserable CGI and the sheer lack of drama accompanying them. For a clear Harry Potter clone, it forgets to copy the drama and suspense that made the later Potter films so engaging. Instead, the viewer feels no concern for the characters as they are thrust into \"perilous\" situations. In the end, Percy Jackson feels wrong. Every scene, character dialogue, and CGI backdrop is a disgrace to the books that got teenage readers addicted to the fantasy genre and Greek mythology. It's just another child-pleasing action flick instead of an adaptation that fully conveys the ingenuity of its source material.",
      "total_reactions": 0,
      "user": "cbeers2513"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2014
      },
      "score": 1,
      "text": "being a great lover of the books i can honestly say that watching this movie made me wish that i never started it. from the very first scene to the very last nothing but the extreme simplification of the story was there. there understanding of the story in the book seemed to be the lightning bolt was stolen  you have to get it back. that was pretty much the only thing that they took from the book. the one thing that i just can't get over is the complete removal of ares from the story... i mean that is both integral to that story and to the entire rest of the series. it is beyond my understanding why the people who write these books don't understand what is necessary to keep the story intact. not to mention the whole unnecessary side quest to get the pearls. the fact is there was no legitimate reason for the careless disregard for a perfectly excellent story. overall i would advise that you not watch this atrocious piece of trash",
      "total_reactions": 0,
      "user": "junkdog8"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2014
      },
      "score": 3,
      "text": "so far i read lighting theif book which is terrible . i  percy jackson : saw sea of monsters movie which 100 % lot better then this movie . there's no good thing that happens in  this film . it is a okay film but sea of monsters was better",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2014
      },
      "score": 1,
      "text": "what is this **** i am a huge fan of the books, and me and my brother used to fantasize about a movie that would be really awesome and it ruined my life. when i watched this movie, i was the most pumped i have ever been in my entire life. and then: What have i just witnessed, the death of my life? Probably. It's like you are a Percy Jackson pirate, and you find two chests, one is the movie, one is the book. You open the book chest and they're are diamonds and rubies, heaps of gold. Then you open the movie chest hoping to be even richer? and you find the chest full of **** and with a single piece of rough amber worth twenty dollars. I felt  like the director didnt even read the book and here is why:",
      "total_reactions": 0,
      "user": "TheSilentOne"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "It was so bad, I went to the premier, barfed, and cried at the same time. Why Chris Columbus? You have killed us all with your horrible movie. It has so many differences from the book. It needs to follow the book you nerd. It sucked.",
      "total_reactions": 0,
      "user": "10987654321"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "Do you know who never went to school? Whoever directed this movie. It sucks. Balls. They have no idea that a movie is supposed to at least follow the plot line more than 5% of the time. Who would have such a large brain tumor, be so ridiculously, utterly retarded, have absolutely no intellect, and zero common sense? I feel sorry for them because they must be treated with condescension and pity by their \"friends\" which they earned by the money they illegitimately earned from unsuspecting fans of a book who wanted to see the movie. Seriously, NO ONE who has read the book would even remotely consider it above a -10/10. The only reason that I gave it a zero was that there was no lower option.",
      "total_reactions": 0,
      "user": "PJAXMOVIESUCK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2016
      },
      "score": 1,
      "text": "How f*cking stupid. If I hadn't been obligated and forced to see this POS in my classroom, I might have turned it off the second Percy started fighting a Gargoyle-like creature and his longtime friend all the sudden gained donkey legs. -__-",
      "total_reactions": 0,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2014
      },
      "score": 1,
      "text": "My friend told me that I shouldn't compare this to a book because they are both different but if only it were differently titled I would've believed the story was different.",
      "total_reactions": 0,
      "user": "KaleBishop"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2014
      },
      "score": 1,
      "text": "Right from the start of the movie it strays from the book. It follows the book very loosely. The book is way better. There was so much potential for a great movie and this film fell short. I wouldn't waste your time if you are the type of person who likes the movies to stay true to the books.",
      "total_reactions": 0,
      "user": "coldmix3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2015
      },
      "score": 4,
      "text": "Filled to the brim with cheesy effects, juvenile attempts at humor, an incoherent plot, and far too many deviations from the source material ruin what could have been a fantastic start to a franchise.  The Lightning Thief is forgettable to general audiences, but fans of the books will likely be disgusted.",
      "total_reactions": 0,
      "user": "SkyrimGuy935"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "Percy Jackson & the Olympians: The Lightning Thief completely strays away from it's source material and replaces it with a very clumsy plot. It is also plagued with poor acting even if the movie is enjoyable and has the right feel of the book series.",
      "total_reactions": 0,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 2,
      "text": "I have read all the books in the percy jackson series. This is an awful halfdone piece of **** This movie is not worth it.  It doesnt follow the book at the right places. Their business plan must have been: 1. buy license 2. read fanart 3. telll everyone they read the book 4. grab cash 5. bad sequal",
      "total_reactions": 0,
      "user": "UnderagedReview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2015
      },
      "score": 5,
      "text": "As a standalone, it works perfectly fine. No harm done that way if you look at it in this direction. The actor for Percy did a good job, the effects were alright and all that. But compare it to the book and that is were it fails. So hard. Outside a moderately accurate first ten to fifteen minutes, most of the film is completely made up and has nothing to do with the books. Not only that but the casting choices weren't that great either. The actress for Annabeth wasn't blond. Which she was blonde in the book. I have very mixed feelings about this movie as a whole. For many reasons beyond what I said here. The acting was good. I will give it that. But the adaptation part is just when I can't do it. But it is possibly the only Lighting Thief adaptation we will get. So let's deal with it.",
      "total_reactions": 0,
      "user": "morganstephens5"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "Percy Jackson is really not good the movie and the bad. this movie is stupid just so stupid and gover is so annoying almost all the charters are this movie sucks.",
      "total_reactions": 0,
      "user": "teddyluke"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2016
      },
      "score": 3,
      "text": "Before I get started with the review, I just want to say I really, really, really like the books. But the movie? Pfft, where do I begin? It has terribly wooden acting, ignores its source material, has terrible usage of terrible CGI, and almost ruins Percy Jackson. It is a complete and utter disgrace of a film, and should never have been made.",
      "total_reactions": 0,
      "user": "YellowKirby"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2015
      },
      "score": 7,
      "text": "Well, I enjoyed it but it was totally different from the books on a lot of levels. The main characters are supposed to be 12 (granted, Grover only looks 12 when in fact he's 34 or something but you get what I mean), Grover is supposed to be shy and a bunch of others. But it had charms... Grover, although far from the goofy, shy character we know and love is still the best character and some of the changes worked better for the screen. Still though-the second one was much better.",
      "total_reactions": 0,
      "user": "DanBurrito"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "what is the problem with this movie I found it enjoyable, so why is it that everyone else dose not like this movie. I was action pact and intense what else should you expect.",
      "total_reactions": 0,
      "user": "Jollyjoe1000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2015
      },
      "score": 10,
      "text": "Whatever people and all fandom say, it was a good movie just fans exaggerated and complained. Better than Hunger Games and Cathing Fire. Stupid fans, all they doing is denigrate movie and say \"Harry Potter wans't like that.\"",
      "total_reactions": 0,
      "user": "Blinkanddead"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "\"This movie doesn't deserve to exist.\"",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "If you have read the book, you probably dont like this movie. If you haven't, you might enjoy the movie, just like I did. I dont get why it is hated. The characters are great, the story is what the book is about, and the cgi is great. The movie does not have to be exactly like the book.",
      "total_reactions": 0,
      "user": "gameguardian21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2016
      },
      "score": 0,
      "text": "One of the worst movies ever. It feels so unloyal to the book series, the actors are too old, it's just a mess. All the good parts of this book aren't in this movie. What a disaster of a book adaption.",
      "total_reactions": 0,
      "user": "superbat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2017
      },
      "score": 2,
      "text": "Chris Columbus has been going downhill and has been making some pretty bad movies lately. Percy Jackson is poorly written with mediocre acting. Sadly I think the book is not much better.",
      "total_reactions": 0,
      "user": "reviewfrom19842"
    }
  ]
}