{
  "mc_avg_user_score": 3.4,
  "mc_metascore": 11,
  "mc_mixed_rating_frequency": 3,
  "mc_movie_name": "Persecuted",
  "mc_negative_rating_frequency": 32,
  "mc_positive_rating_frequency": 15,
  "mc_pro_critic_reviews": [
    {
      "critic": "Louis Black",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "Persecuted is a profoundly conservative, Christian ideological take, guised as a classic Seventies paranoid thriller. Certainly unique, this is another targeted release, specifically aimed at groups sharing its beliefs."
    },
    {
      "critic": "Christy Lemire",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2014
      },
      "score": 25,
      "summary": "While Remar does his best to resist the film’s melodramatic tendencies — to no avail, ultimately — Thompson is the only one here who actually grounds the proceedings during his few moments on screen."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2014
      },
      "score": 25,
      "summary": "A confused and confusing thriller."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2014
      },
      "score": 25,
      "summary": "The Lord works in mysterious ways but Persecuted works in blundering, obvious ways, straining a Christianity-under-attack theme through a dopey thriller."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 20,
      "summary": "The not so fair and balanced film might have made its religious themes palatable if it worked reasonably well as a thriller. But director/screenwriter Lusko shows no flair for the genre, his muddled execution lacking any sense of pacing or suspense."
    },
    {
      "critic": "Mike D'Angelo",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2014
      },
      "score": 20,
      "summary": "If Persecuted wasn’t such a dire thriller, its sweaty fear of pluralism (Obama’s “We are no longer a Christian nation” speech gets handed to Davison’s evil senator here) might at least be amusing."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "summary": "This terrible attempt at a political thriller for the religious right is aimed not at Christians in general but at a certain breed of them, the kind who feel as if the rest of the world were engaged in a giant conspiracy against their interpretation of good and truth."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "summary": "At a time when the world offers us no shortage of examples of what actual religious persecution looks like, for a film to indulge in this particular brand of self-righteous fearmongering isn’t just clueless or reckless; it’s an act of contemptible irresponsibility."
    },
    {
      "critic": "Tomas Hachard",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "summary": "There's no attempt to convince us that the world is being corrupted by people who haven't accepted the Gospel; it merely assumes we agree with that idea."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 2,
      "pos_reactions": 25,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "text": "Okay, look: if you can freely gather with dozens to hundreds of other members from your church congregation and freely drive down the street to a wide-release movie theatre that's freely showing an independently-produced film about how your religion is being persecuted, your religion isn't being persecuted.",
      "total_reactions": 27,
      "user": "Kas"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2014
      },
      "score": 1,
      "text": "Proudly Not a liberal, however I would also like to think I am not insane. Plot aside, the structure, filming and acting were so low quality it would have shelved before airing by the Lifetime/hallmark channel  if it was made for TV . As for the \"plot\" , it is nothing more than \"I am a victim\" fetishism.  There is no Christian message . With all the places in the world where people are persecuted, fueling paranoia about a non existent threat is a waste. I hope and pray that anyone who liked this movie examines their life, and seek help.",
      "total_reactions": 15,
      "user": "Athomeonarock"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "Sure it's hugely political. Gets on your nerves here and there but overall, wasn't that bad to watch.",
      "total_reactions": 4,
      "user": "OpFreeMan"
    },
    {
      "neg_reactions": 21,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "I'm a liberal who never saw the movie and I thought it was terrific! Why would anyone believe that the eight professional film reviewers who strongly disliked this film are all liberals who never saw it?  Oh, wait, it's because they ... believe.  No evidence necessary!  How blissful that must be!",
      "total_reactions": 26,
      "user": "alankk"
    },
    {
      "neg_reactions": 25,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "Nothing wrong with this movie. Great movie about not compromising your belief even when presented with an alternative that seems on the surface to be accepted by everyone else. Give us more movies like this.",
      "total_reactions": 29,
      "user": "jrhale62"
    },
    {
      "neg_reactions": 34,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "It's an excellent movie that liberals hate, that is why they are giving bad reviews and they haven't even seen the movie.  Remember folks, Progressives are enemies to USA and the Constitution!!",
      "total_reactions": 37,
      "user": "wiggy14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2016
      },
      "score": 3,
      "text": "I really disliked the movie even though at the beginning I felt it was going to be quite interesting when the main plot unfolded and they tried to blame the main guy for the murder of that woman. What happened afterward was mainly just boring, confusing and not that interesting to be honest. And the ending felt a bit random. I think it had lots of potential but ended up not fulfilling it.",
      "total_reactions": 0,
      "user": "Ralfbergs"
    }
  ]
}