{
  "mc_avg_user_score": 5.1,
  "mc_metascore": 40,
  "mc_mixed_rating_frequency": 6,
  "mc_movie_name": "Phantom",
  "mc_negative_rating_frequency": 5,
  "mc_positive_rating_frequency": 7,
  "mc_pro_critic_reviews": [
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 80,
      "summary": "In this classy, taut white-knuckler – largely shot inside a real-life decommissioned Soviet sub – Robinson asks us to consider more than the hypothetical possibility that the world nearly ended in 1968. He reminds us that we have no idea how many other near-misses may have happened in the behind-the-scenes history of the modern age and also, more troubling still, that long after the Cold War has faded into memory we continue to have difficulty telling the crazy people from the sane ones."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 75,
      "summary": "Much of what's contained in Phantom is at best speculative and at worst completely made-up. But, regardless of the accuracy, it makes for compelling viewing. Phantom is one of the best films of a lousy early 2013 release roster."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "Phantom is a relatively tight, gripping story told with efficiency that makes room for its fine roster of actors to explore old-fashioned ideas on honor and loyalty."
    },
    {
      "critic": "Michael Atkinson",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "Manly, sharp-edged submarine B movies don’t come along often anymore — so consider this Cold War off-white-knuckler a welcome blast of recycled air."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "Ed Harris in Phantom is like Steve Carlton with the Philadelphia Phillies in 1972 — delivering a wall-to-wall, amazing performance that's lost in a sea of dreadfulness."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "Intriguing, if uneven, thriller."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "Todd Robinson’s Phantom gives us a couple of things we haven’t seen in a while: the great Ed Harris and a Cold War submarine thriller. It’s not something you want to plunk down $12 for, but just diverting enough to check out when it arrives on Netflix Instant."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "The combination of tight close-ups and jarring camera work might require a dose of Dramamine. Better yet, give this movie a wide berth and check out a superb film set in a submarine, the 1981 classic \"Das Boot.\""
    },
    {
      "critic": "Stephen Whitty",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "In the end, The Phantom remains mediocre, with flat cinematography and crude dialogue."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "The crew doesn’t much look the part either, save for Schaech’s Stalin ’stache. Yet the movie does show the ability to get past this, even with the weight of all its narratively risky conspiracy theorizing. It’s a shame the intrigue has to get torpedoed by elements that mostly feel correctable."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "Robinson is undone partly by his own workmanlike touch as a writer, and partly by matters of casting. I like Harris, and he's quite moving here, but every time Duchovny reappears the overall energy level sinks to crush depth."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "Though pitched as a thriller, Robinson’s woefully underbudgeted film plays instead like a chamber drama, so simple and unadorned that it could just as easily be staged as an off-off-Broadway play without anyone telling the difference. And that isn’t entirely to the film’s detriment, either: With a cast choked with great character actors like Ed Harris, William Fichtner, and Lance Henriksen, less is sometimes more."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "To be honest, I can rarely recall any film, on any subject, that made less sense."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "Robinson manages some suspense, but the thriller’s ticking clock is a weak one."
    },
    {
      "critic": "Laremy Legel",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2013
      },
      "score": 42,
      "summary": "The idea of the film is certainly clever enough, it’s the execution that lacks finesse."
    },
    {
      "critic": "Mark Jenkins",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2013
      },
      "score": 40,
      "summary": "The newest model of the old submarine-from-hell picture."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 30,
      "summary": "Despite the world-changing ramifications inherent to the plot, the results are more tedious than thrilling."
    },
    {
      "critic": "Chris Packham",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 30,
      "summary": "The ensuing suspense story is a pastiche of familiar tropes—effectively paced, but without originality. And what is up with combinations of Ed Harris, water, and unbelievably hokey endings?"
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2013
      },
      "score": 30,
      "summary": "The potential for screw-tightening suspense gets lost amid the ineffectual dramatics in Phantom, a feeble fictionalization of a crucial but little-known moment when a rogue Soviet submarine brought the world to the brink of nuclear war."
    },
    {
      "critic": "Walter Addiego",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2013
      },
      "score": 25,
      "summary": "Heavy-handed dialogue, flurries of melodrama and a silly ending make the whole enterprise sink like a stone."
    },
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 25,
      "summary": "Todd Robinson's film is a third-rate submarine-set drama until, in its final moments, it sinks to fourth-rate."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "summary": "The dialogue is dreadful (though we are at least spared the usual hokey Russian accents) and the wrap-up ridiculous, the only mystery being why this peculiarity was ever greenlighted at all."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "Ed Harris stars as a washed-up Russian submarine captain (is there any other kind in movies?). His final mission includes a KBG agent (David Duchovny) with diabolical plans. None of it matters because this is one of the slowest, most talky war movies ever. Since it takes place in the small confines of the sub, tension should be built-in, but the only drama is provided by obnoxious ominous music and painfully portentous dialogue. Even worse, the action is often confusing If you enjoy Cold War sub conflict, you might find it worthy. Otherwise, stay above the surface. NOTE: Look for Johnathon Schaech hiding behind a giant moustache.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2013
      },
      "score": 2,
      "text": "The choice of new Friday movies went from “Jack The Giant Slayer”, which I was told to avoid, “21 and Over” which I didn’t have to be told to avoid, “The Last Exorcism Part 2”, and after avoiding Part 1 why would I bother? The only new movie that had any interest, more because of the actors than the subject, was “Phantom”, which is based on a true story about a Russian  submarine in 1968 planning to fire on a U. S. ship hoping to start World War 3 between China and the U. S. their biggest competitors. We were the only 2 people in the auditorium so it was like a private showing but that didn’t help much. It is a comparatively short movie--97 minutes--covering a lot but making it a little hard to figure out what was going on. At one point I thought one of the actors had been killed and there he was in the next scene, though in profile, and Allen had to tell me it was him. None of the actors use a Russian accent which is a blessing especially when it comes to scientific angles of what is going on. There are some flashbacks which aren’t clearly edited and neither is the ending. The director/screenwriter, Todd Robinson, isn’t exactly clear on what is happening when, or why, but most of the actors come through for him with Ed Harris doing the best job. David Duchovny seems out of place, not quite comfortable playing the KGB agent. The supporting cast is made up of many familiar faces who always give their all including William Fichter, Jason Beghe, Sean Patrick Flanery, Johnathon Schaech, Lance Henriksen and Julian Adams. They are actors that you will constantly ask yourself, “I know them but from where?” and are interesting to watch. Dagmara Dominczyk and Tessa Robinson play brief roles. In no way is “Phantom” in the same class as “Das Boots”  “Run Silent, Run Deep” or “The Hunt For Red October” but I have a feeling it is a better movie than the other ones that opened today",
      "total_reactions": 1,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "Don't see Phantom. It's not horrible but it's dull, boring and completely lacking in memorability. Not one character or plot-point sunk in, and I found my mind wandering throughout. The acting's okay for the most part, sometimes decent and stupid at others. There's a couple \"so bad it's good\" moments but they're short, sporadic and not worth seeing the whole thing for. The only reason why I saw it in the first place is cause it was my dad's turn to pick the movie, and because he's a veteran he goes nuts for any movie that involves the military, this being no exception. Just... don't see this. You won't be traumatized by outright badness but it's not worth spending your time and money on. 40/100",
      "total_reactions": 1,
      "user": "Mab_987"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "I was very excited to see Phantom because of Ed Harris but it seems like water adventure films do stink bad. Phantom was gripping in the middle but the pace drops at the end and then boom, The End. I like Ed Harris, but with this film he has disappointed me.",
      "total_reactions": 1,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2013
      },
      "score": 2,
      "text": "Ed Harris has a bad lead performance which is unusual for him, but more importantly its badly written and just all around stupid in every way.",
      "total_reactions": 0,
      "user": "TheWalrus2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "Thought the movie was extremely well acted, the scripting tense and tight and with a great forbidding soundtrack. Very pleasantly surprised by the film overall.",
      "total_reactions": 0,
      "user": "lghulm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 1,
      "text": "Phantom was a very incredibly stupid movie that was not anything besides confusing. Ed Harris, William Fichtner, and David Duchovny probably made a fortune by starring in something like this.",
      "total_reactions": 0,
      "user": "chw"
    }
  ]
}