{
  "mc_avg_user_score": 5.7,
  "mc_metascore": 53,
  "mc_mixed_rating_frequency": 67,
  "mc_movie_name": "Piranha 3-D",
  "mc_negative_rating_frequency": 51,
  "mc_positive_rating_frequency": 103,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "After seeing \"My Bloody Valentine 3D\", I was skeptical that a really good and campy horror film could be done in 3D without resorting to idiocy. Piranha 3-D does it.  It plays up the jiggle sex to the hilt, but it also has a heart courtesy of Elizabeth Shue and her screen family.  Ving Rhames is awesome in a limited role, and Christopher Lloyd is at his Back To The Future best.  But the money shots - the scenes of blood-and-gutsy gore are incredible.  Picture a girl's hair getting caught in a motorboat's propeller while a panicking teenager  in the boat tries to get the motor re-started. What comes of that scene will be stuck in my head for at least the night. But not what you would expect, mind you. It's a funny, funny movie.",
      "total_reactions": 4,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "Thankfully, \"Piranha 3D\" headed right into the \"campy\" territory that I was hoping for. The film is, flat-out, a blast. It's pure exploitation trash, but it nails it with deadly precision. Alexandre Aja has gleefully crafted a film so horrendously grisly and stupid, that to enter the film with tongue planted in-cheek is a basic requirement. \"Piranha 3D\", like Sam Raimi's recent \"Drag Me to Hell\", are not meant to be taken seriously, and would fall under the \"comedy horror\" category. However, the former contains gallons upon gallons more blood, and mutilations that would make any horror geek squirm. If you can turn off your brain for a while and enjoy this B-movie filth, it's a blast.",
      "total_reactions": 1,
      "user": "FrozenStar90"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "ok , this was a lot better than i thought it was going to be, i was suprised i enjoyed myself , definatly would recomend it and well the piranha are crasy, they rip everybody up and the 3D is a plus,",
      "total_reactions": 1,
      "user": "mau1133"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "This movie is very funny. Don't think of it as a real horror movie. Clearly a throwback to B-movies, and it was quite fun to watch. I laughed almost the whole movie, because it was so ridiculous.",
      "total_reactions": 1,
      "user": "dijavantewow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "Didn't  watch it in 3d. It was regular and i don't now how much i lost from movie experiance , but generalliy as someone who got a respect for Aja i'am quite disappointed. Ok the gore is all there , Aja filming style and 70's sense for humor too , but i expected something more memorable than summer  blockbuster hit. The main character is dull , his mother is ok but the rest of the cast ( Except for the Kelly Brook which is obviosly there for the eye candy moments) are quite irritant. There is a certain grindhouse feel in the movie which is also a plus but that's individual impression. CGI Pirahna's dont look so good at all , and their real potential is probably only there when watching in 3d. This is a rolecoaster ride first , and a good horror movie second which is a bad for Director who staretd with Heute Tension , and Hill have eyes remake. This movie is his downhill , that he started with Mirrors , but that doesnt mean audiences wont enjoy it. Fun and cheap.",
      "total_reactions": 1,
      "user": "JackRaid04"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 3,
      "text": "This movie was trash! I know sex sells but try to earn your money when making a movie. If this was trying to be the next Jaws it failed hardcore. I didn`t find it scare or funny. Watch this movie only if you have no other options. (You have been warned)",
      "total_reactions": 1,
      "user": "oblique15"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "\"Piranha 3-D\" is your average bloody-gore fest boobs-n-blood movie that only those who enjoy it will greatly appreciate.",
      "total_reactions": 9,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "Kelly goes wild, just not wild enough to get herself killed, or rather, punished by the filmmaker. The \"good girl\" may down a jigger of tequila, lick salt off the bare skin of a bad girl, then suck face and suck lime like a pro, but the good girl, despite her trampy conduct, does keep her top on. This is how we know she'll survive the Grand Guignol spectacle of the \"Saving Private Ryan\"/\"The Real Cancun\" mash-up that turns out to have a surprisingly feminist bent. Don't be distracted by all the blood and breasts, and more importantly, don't make snap judgements about the film's graphic violence and liberal dose of nudity; don't be fooled. The filmmaker has bigger fish to fry. This is hardly an empty-minded exploitation movie about the worst spring break ever. \"Piranha 3D\" serves as a critique on pornography; it shows how pornography works. Jerry O'Connell plays Derrick Jones, a soft-core pornographer(clearly modeled after Joe Francis of \"Girls Gone Wild\" infamy) who preys on young nubiles with the hope of getting them drunk, then naked, for his \"movies\". Against Jake's protestations, Kelly gets on his yacht, where she performs for the camera, but not until Derrick needles her a bit. When the piranhas go wild, the filmmaker makes a salient point about pornography's function, as bare-breasted women are literally turned into meat, slashed and severed, for the instant gratification of the fish(read: pornography's consumers). Initially, the nudity is pleasurable(great faces, great racks), since by all appearances, it's the women's choice to be nude, but when the violence starts to intervene on sex's behalf, the film suggests that appearances can be deceiving. After all, it's usually a man who holds the camera. As it turns out, the prehistoric fish are not old enough to spawn, so when Derrick's detached genitalia becomes fish food that one of the baby piranhas spits out, the filmmaker demonstrates the relationship between pornography and kids, who just aren't ready for D-cups, and C-cups, and etc. etc. etc. Ultimately, \"Piranha 3D\" indicts the audience, indicts them on the charge of being hypocrites for cheering on Derrick's appropriate manner of demise, since porn is a ten-billion dollar business. Pornography keeps the world spinning.",
      "total_reactions": 7,
      "user": "Shiira"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2010
      },
      "score": 3,
      "text": "This is not a horror film, it is exploitation. Although I'm a fan of 70's and 80's exploitation films, I didn't much care for this one. The various characters are either obnoxious or cardboard placeholders (or both), to begin with, and I could hardly wait for the killing to start. The teen angst/romance subplot was rote and meaningless. Part of what makes the old exploitation movies likeable is a low-budget, unpolished but earnest charm that is missing in this one. And fully the first half of the movie is a plotless \"MTV Spring Break\" dance party.",
      "total_reactions": 7,
      "user": "feardrinker"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2012
      },
      "score": 1,
      "text": "Yeah, I get it... Piranha is meant to parody the \"thing in the water\" horror genre more than being an actual horror film.  But the banner of parody does not excuse you from making a film worth watching.  After the one-millionth shot of gyrating twenty-somethings exposing themselves interrupted the already tissue-thin plot, my patience with this monkey business had completely evaporated.  By the time the real carnage began and the film gathered some modicum of steam, my mind was already elsewhere and couldn't be bothered to return.  When the credits rolled, I realized that I had watched 90 minutes of nothing and a surprisingly good cast had been completely wasted, as well as my time.  Not nearly as fun, campy, humorous or exciting as it pretends to be.",
      "total_reactions": 4,
      "user": "CooterPatooter"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "I agree with Steve Persall of the St. Pete Times 100%, and I'm glad he had the balls to call a spade a spade.  It's simply a flat-out fun, slick movie, with all the boobs and gore a guy could want on a late Friday movie! (though there were plenty of women in my screening who were roaring just as loudly as the dudes.)   And yes, they take full advantage of 3D when it comes to Kelly Brook's body parts, which is a great thing.  Jerry O'Connell as the Girls Gone Wild guy is spot-on.  And it's great to see Liz Shue back in action - she's ageless!",
      "total_reactions": 2,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2011
      },
      "score": 0,
      "text": "Piranha 3-D is a stupid, disappointing, poorly horror film. Honestly, the poster looks better than the movie. Although, I don't hate the actors who were casted in this god-awful film. I just hated there characters. Except a few. Well, when I seen the trailer, I was like, \"hell yes!\" so, I seen it on cable just a few days ago, and through out the whole film, I was seriously irritated and pissed off. Don't get me wrong, I know what the studio and the writers were trying to do, make a good horror 3-D film that teenagers will love. I didn't love Piranha 3-D. I was totally pissed with the death scenes and the choices that teenagers make in this film. Don't you just hate those movies when you realize there's I don't know when there's thousands of piranhas in the lake. You try your warn innocent lives but they just don't listen. Meh, I just hated this film. I'd rather be eating by a shark then a **** piranha. Seriously, don't rent or buy the dvd, cause your're gonna' realize, you wasted 82 minutes of your life that you'll never get back. You'll probably love it or probably hate it. Hey, if you love gore, nudity, dumb-ass teenagers. Then, hey. Piranha 3-D is a perfect match, for you.",
      "total_reactions": 2,
      "user": "JoeW"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "Anybody else have issues with a film that uses prolonged, gruesome death scenes for laughs? Filmmaking \"quality\" notwithstanding, when did cheap thrills become so repulsive?",
      "total_reactions": 3,
      "user": "videopat"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "This was a great COMEDY for fans of B-movies and all the terribleness and **** they contain.  2 thumbs up, watch while high if possible. This was my first time seeing boobies in 3-d, and that alone is worth the price of admission.",
      "total_reactions": 6,
      "user": "TFtf"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "AWESOME!!! Bloody, action-packed, hilarious, and full of gore and boobs!! And the 3-D is pretty impressive, too (you don't see that too often). It's fun seeing the piranhas jump at the screen and eat those poor spring breakers!! I highly recommend this movie. Word of advice: Don't bring your mom or kids. But bring your girlfriends so that they'll cling to you.",
      "total_reactions": 1,
      "user": "Bullet97"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2010
      },
      "score": 2,
      "text": "Man oh Man, do i miss the days when horror movies actually MADE SENSE. What a mess of a film this is. It simply does not know what it wants to be. At times, its a bad comedy,  a terrible horror movie, or even a damn porno flic. This movie will surely satisfy the male psyche, but for moviegoers looking for something thats at least relatable to, avoid this film at all costs. I only have one positive thing going for this film and its the 3D. One last thing, no wonder women think guys are disgusting perverts and their idea is without a doubt proven by this film.",
      "total_reactions": 1,
      "user": "Ricardo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2010
      },
      "score": 2,
      "text": "I went to this in what I think was the right spirit, expecting no more than a fun, dumb, guilty-pleasure movie. With promises of lots of gore and naked flesh, all in good fun, how bad could it be?  Sadly, it was just a complete waste of time. Not scary, not funny, not titillating, not so bad that it's good, just bad.  The 3D and cinematography was grindingly awful. Don't believe the publicity about how much care they took to do the 3D properly. They didn't and it's so bad it's a distraction. (James Cameron is right: do it right or don't do it at all.) The only people in the theater who seemed to be having a good time were the ones on screen. It was probably a blast to be in it.  To watch it though, uh, no.",
      "total_reactions": 1,
      "user": "Bruce"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2010
      },
      "score": 6,
      "text": "The movie was silly and exactly what you expect it to be. Gratuitous nudity, great gore prosthetics, and enjoyable groan-inducing dialogue abound. The 3D was acceptable and only added to the carnage. It was fun seeing Christopher Lloyd for his brief scenes as the local fish expert. Don't expect Shakespeare.",
      "total_reactions": 1,
      "user": "bicknays"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "I think the combined thrill and gore of the movie plus not to mention the hole teenage lifestyle thrown into the mixed help this movie become the next big thing since jaws.",
      "total_reactions": 2,
      "user": "Soccergirl1xoxo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "The only horror I experienced was watching kids at the box office buying tickets to Piranha 3D.  This movie is a massive mish-mash mess with no redeeming social value what-so-ever!  Shame on you Elizabeth Shue and Eli Roth for participating!  Your body of work reflects much better choices than this.  You should take your salaries, buy up all the prints and destroy them!  A perfect example of Hollywood deceit think; using the trailers to put a positive spin on a piece of celluloid trash!",
      "total_reactions": 1,
      "user": "TheUnpaidCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2010
      },
      "score": 0,
      "text": "Awful. The acting is terrible, the nudity is completely gratuitous, and Jerry O'Connell may have the most perverted, sexist, and flat out stupid role I have ever seen. The only redeeming qualities of this movie are the fact that they stuck Doc Brown in as a scientist, and the Brittish chick was insanely hot.",
      "total_reactions": 1,
      "user": "mgobluewill"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2010
      },
      "score": 0,
      "text": "Are there people enjoying watching a massacre? ... Yes! ... Is it because they have issues??? ... Possibly ... go watch a comedy or something ... it is more healthy! ....................................................................................................................................................................................................................................................................................................................................................................................................................................",
      "total_reactions": 2,
      "user": "dfdfdf"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2010
      },
      "score": 4,
      "text": "A movie so bad it's....bad. I can appreciate the fact that it's trying to be one of the \"so-bad-it's-good\" type movies such as some of Roger Corman's original work, but the problem is that most audience members that aren't familiar with said types of film will find this boring.",
      "total_reactions": 1,
      "user": "KarthXLR"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "Okay, this film was silly, campy fun. If you enjoy over-the-top horror movies with a sense of humor about themselves than this is a worthwhile picture to catch in the theater. There's tons of cheesey bad guys getting what's coming to them, chicks showing off their boobs and a handful of actual scares that will have you jump a bit despite yourself. Good cartoonishly gorey fun.",
      "total_reactions": 1,
      "user": "crankyerma"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2010
      },
      "score": 5,
      "text": "I wanted this to like this movie.  But I was underwhelmed.  Granted there is the first 3D nude underwater lesbian scene in fil history, but that scene was decidedly not sexy.  I thought the movie never had the right tone.  I wanted to laugh, but found myself groaning more,  I wanted a camp-fest, over the top, fun ride.  I got a movie that took itself a little too seriously, especially given the plot.  I did not hate it.  I just wanted it to be more.",
      "total_reactions": 1,
      "user": "StevieGJD"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2010
      },
      "score": 0,
      "text": "I've been inspired to post on Metacritic twice before. A cat-lover, I gave \"Drag Me To Hell\" (whose protagonist murders her kitten to ward off the gypsy's curse, unsuccessfully it turns out) a 5. I gave \"Date Night\" a zero since it did not have a single laugh. I hasten to post concerning \"Piranha\" in the hope that I may deter any additional movie-goers from seeing it. I shamelessly take comments from the critics, often out of their context, to identify exactly what I think about this movie: \"sick,\" \"exploitation,\" \"stupefying,\" \"schlock,\" \"disgusting,\" \"sick,\" \"gross-out,\" \"shameless,\" \"trash,\" \"ridiculous,\" \"gratuitous.\" This movie is mind-numbingly bad. It has no wit, no satire, no point other than to display females in various degrees of undress. If CGI boobs are your thing, \"Piranha\" has plenty of them for you. It is bad in every way -- plot, acting, script. It has gore, senseless, overwhelming, and near-eternal in duration. Save yourself the price of admission and two hours of your life, and do not go!",
      "total_reactions": 2,
      "user": "KennethA"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "Piranha 3D is pure trash but the violence and gore is actually funny that i enjoyed it to an extent. Stupid yes, acting pitiful yes, but a stupid movie, with terrible acting, that has fish biting off people's limbs never felt so enjoyable.",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2013
      },
      "score": 9,
      "text": "Somewhere near the end of Piranha 3D, as Ving Rhames was indiscriminately firing shotgun casings into the water and Jerry O’Connell was doing tequila shots off an eighty-five percent naked woman, I decided to award this film three stars. This may seem like an unusually high number of stars for a gimmicky b-movie about piranhas attacking drunk college kids in the third dimension, but I happen to find a certain amount of honor in a film delivering exactly upon its promises. Four stars, that would be ludicrous and two stars, that would imply Piranha 3D somehow disappointed. But three stars, that’s the right number for an aggressively pleasurable film involving cocaine, piranhas, inordinate amounts of nudity and Jerry O’Connell.  Sheriff Julie Forester (Elisabeth Shue) is a single mother in charge of the waters surrounding Lake Victoria, a seemingly quiet Arizona town annually invaded by throngs of douche bags and whores every Spring Break. Julie puts her seventeen year old son Jake (Steven R. McQueen) in charge of watching his two little siblings so she can skim the waters for, I guess vomit, but this Babysitting Diaries plan goes awry almost immediately. There are three problems. 1) An underwater earthquake has opened up a subterranean portal, releasing swarms of cannibalistic piranhas. 2) Porn producer Jerry O’Connell has enlisted her son as an impromptu location scout for his newest seedy film. 3) Nanny McPhee had a previous engagement, returning, somewhere else. Piranhas, like mastadons, like wildebeests and sometimes like boozed-up college kids on spring break, are ludicrous pack-traveling creatures who seem to lack long-term goals. They exist only in the moment to satisfy the most basic of human or creature desires. This strikes me as a bad strategy for planning one’s retirement but a totally reasonable way to spend a Saturday night. I fear the majority of reviewers will disagree with me, but fu*k them. Movies are about creating a story and telling said story in an entertaining or enlightening way. Never has a movie so overtly claimed to be about something and then been about that exact same something. Here are three facts about Piranha 3D: 1) A piranha tears a woman’s swimsuit top off. 2) Adam Scott rides around in a jet ski pretending to be Rambo. 3) I will likely buy it on sale some time late next year for between $6.99 and $8.99. If any of those hot facts made you roll your eyes, there are four other new releases opening in theaters this week for you to see.",
      "total_reactions": 1,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2010
      },
      "score": 6,
      "text": "Its fun, gory, boob filled, scary, and just grotesque. I LOVED IT. don't go to this expecting academy noms, but just kick back, rub your eyes, put the glasses on,  and cheer to the gore.",
      "total_reactions": 0,
      "user": "plus44boy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "Delightfully gory, good use of 3D, some quite amusing humor and in now way takes itself seriously or tries too hard. A great watch, would like to see again :D",
      "total_reactions": 0,
      "user": "fangaas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "Not in a very long time I have been subjected to so much gratuitous nudity and violence. And all in a fun and  laughable manner!!",
      "total_reactions": 0,
      "user": "skuz440"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "Surprisingly enjoyable. Some good gore, mostly CGI (some â",
      "total_reactions": 0,
      "user": "bassthing"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2010
      },
      "score": 6,
      "text": "Cheerfully idiotic 3-D nonsense throws so much blood, gore, and nudity into the faces (literally) of the audience that it makes Roger Corman's wonderful 1978 JAWS ripoff of the same title look like MY DINNER WITH ANDRE.  In the right frame of mind (preferably a little buzzed) this actually goes down quite enjoyably, especially with a cast full of pros (Elisabeth Shue, Jerry O'Connell, Ving Rhames, Christopher Lloyd) leading the way.  Oh, and good old Richard Dreyfuss cast in a cameo for pure the nostalgia's sake, still humming a certain tune that will be instantly familiar to all JAWS fans.  No pretentions, just good, nasty, R-rated fun.",
      "total_reactions": 0,
      "user": "Winstonoboogie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "The plot and characters are formulaic, the script could be wittier and some early underwater scenes are way too dark for the 3D to truly pop, but by mid-way it suddenly becomes a terrifically fun and gruesome movie.  Fans of gore and horror should have a blast.",
      "total_reactions": 0,
      "user": "grindhouse83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "great film funny gory never boring starts of slow but picks up toward the middle the acting was decent the gore parts were awesome lots of bloody parts overall a good time.",
      "total_reactions": 0,
      "user": "elmstreet10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "This movie is great! Many people who don't enjoy it don't realise that it's supposed to be an over the top campy movie. They also probably don't know what a campy movie is and were expecting a straight up horror movie. This movie is very gory and has tons of nude scenes. You see boobs about every 5 minutes except for like the first 15 minutes. The kills are great. The attack at the end is extremely gory and insane. I couldn't help but laugh during all the killings because they were so over the top. Perhaps the second goriest scene in film history (after Dead Alive). This movie is definantly a must see for gore hounds.",
      "total_reactions": 0,
      "user": "CaptainxBumout"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "Great up there with the best of this creature feature type movie, I will get the dvd when it comes out.",
      "total_reactions": 0,
      "user": "markuspd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2011
      },
      "score": 9,
      "text": "If you go to see Piranha 3-D for acting, cinematography or a clever storyline then I seriously question your thought process.  We all know what this movie is.  You either enjoy these kind of movies or you don't.  If you do enjoy naked girls and a lot of fake blood then you will love Piranha 3-D.  The special effects on the the piranhas themselves is a bit weak, and some of the jokes fall flat.  Overall though this movie is fun start to finish and as far as B movies go this is one of the better ones.",
      "total_reactions": 0,
      "user": "canadianrugby"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "\"Piranha for what it is , is a good movie & is an all out gory and extremely fun film , that makes us all never want to swim again , with the body count on high , and running a nice and smooth 90mins what better could you ..ask for? o wait its in 3D\"  .. B",
      "total_reactions": 0,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "Do you like gore? Do you breasts? Do you like fish? Well, then step right up for Piranha 3D, one of the best horror B-movies this side of the silver screen.",
      "total_reactions": 0,
      "user": "JustinSmith"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2010
      },
      "score": 3,
      "text": "This movie was boring. It lacked any good suspense. I left this movie feeling like they creators tried to make a comedy, a suspense, and a spoof at the same time and missed on all three. Did not like this movie at all. Some brief scenes with Christopher Llyod and an intriguing conclusion were the only thing that brought this movie out of the murky depths from which it came.",
      "total_reactions": 0,
      "user": "The_DirtyRabbit"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "Everything you would want from a film like this. Unbelievably gory and gratuitous. Every second of it is ridiculous, and the filmmakers clearly embraced it. And Adam Scott is wonderful in every role he plays. So adorable, even as a nerd.",
      "total_reactions": 0,
      "user": "Tony"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2010
      },
      "score": 2,
      "text": "I would rate this film a 0 if it didn't have Christopher Lloyd in it. Him aside, this film is complete crap. It just feels like the director thought it would be a 'good laugh' to make a terrible film that doesn't mean anything. The only good thing i heard about this film was that the CGI was great. CGI was only really used for the Piranha's. But to my disappointment, the graphics were actually abysmal. Nowhere near modern standards. Christopher Lloyd is the only good thing this movie has.",
      "total_reactions": 0,
      "user": "Matt23WG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "having seen the film in 3d at the cinema and recently on blu ray my opinion hasent changed.its a blast!its in exactly in the same vien as the original with its tounge firmly in cheek.gore check naked girls check plot well that dosent matter when a film is as entertaining as this.its exploitation pure and simple and its very refreshing to see a film maker make a film which dosent for once take itself seriously at all..bet joe dante would of liked to have had the budget of this one.",
      "total_reactions": 0,
      "user": "jellyduke2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2010
      },
      "score": 0,
      "text": "THIS MOVIE SUCKED! It was the most disappointing film i have ever seen!",
      "total_reactions": 0,
      "user": "Kletten"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "There are so many things wrong with this movie. This is a proof that Hollywood is running out of ideas. This is not a movie, it's porn. I can't believe that I wasted my time watching this. Plus, the sheriffs in this movie are so dumb. They tried to kill the piranhas with shotguns. Plus, the piranhas were seen approximately 20 minutes in the whole movie. The plot was terrible and cliche (a rejected guy who likes a girl, and all that crap). The characters were annoying and forgettable. You should have NO reason to see this movie.",
      "total_reactions": 0,
      "user": "scrieciu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2010
      },
      "score": 3,
      "text": "Nice girls, but thereÂ´s nothing more. At least, it could be funny. But it  wasnÂ´t. So much money, so much time, wasted on such a crap. Is there a need to see it in 3D?",
      "total_reactions": 0,
      "user": "Humprt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "It's immediately clear that this movie doesn't take itself too seriously, and that's what makes it enjoyable. It's got your gory Piranha kills, touches of humor here and there, tons of nude chicks, and an overall b-rated feel to it. It's just a fun ride from beginning to end that doesn't make a point to be the most mature thing out there, so if you don't take it too seriously your in for a good time.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2011
      },
      "score": 3,
      "text": "PIRANHA",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2011
      },
      "score": 3,
      "text": "What a annoying movie. In reality even can't call to this a remake of \"Piranhas\", it's like compare \"Dawn of the Dead\" with \"Dawn of the Dead (1979)\", after all they haven't nothing in commom with exception of zombies and shopping. These here only has the piranhas. And it sucks IMO.",
      "total_reactions": 0,
      "user": "jimmytancredi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2011
      },
      "score": 1,
      "text": "Garbage.  This is one of those SyFy monster movies ala Mega Python vs. Gatoroid but with a much larger budget.  It is also a direct Jaws rip-off and steals all of its other scenes from other decent horror films.  There is Richard Dreyfuss in a cameo roll singing \"Show me the way to go home\", the poster has a girl on top of the water with a bunch of piranhas right below her, and there is also the inevitable argument that \"we cannot close the beach now, this community needs the money!\"  Remember how Samuel L. Jackson died in Deep Blue Sea?  That method has returned.  The lead actor is a newbie with the name Steven R. McQueen, another rip-off.  It was good to see Elizabeth Shue, Ving Rhames, and Christopher Lloyd getting work again, but I think there is a reason you do not see Jerry O'Connell very much anymore, he even sucks in this movie.  It also has a pair of children who just yell and scream the whole time; that makes for pleasant movie watching.  My wife came home while I was watching this and joined me around the mid-point of it when the fish really get going.  She hates horror movies, but I tried to explain this was not a horror movie.  This is really making fun of horror movies and trying to use that tactic to make some money for itself.  The fish naturally choose spring break to start wreaking havoc and really, there was some sort of morbid satisfaction watching a bunch of frat boys and sororstitutes getting eaten alive by piranhas. Lessons learned:  you can kill a piranha with a shotgun (Ving Rhames), you can tase one to death (Elizabeth Shue), you can transform into a badass hero trying to save lives when you were just a nerdy seismologist diver a minute before (Adam Scott), and your silicone implants float to the surface after piranhas eat your boobs.",
      "total_reactions": 0,
      "user": "CitizenCharlie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2011
      },
      "score": 4,
      "text": "I watched this movie normally and I hope the 3D version made the movie a whole lot better as this was dire. The CGI was awful, the acting was worst and the movie seemed to go nowhere with characters appearing and dying without any development. It was billed as a comedy horror but I wasn't laughing!!",
      "total_reactions": 0,
      "user": "rotku"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "This film is so ridiculously enjoyable! An all-out gore-fest that never stops! I was literally stunned with some of the flesh-ripping effects. The story here is silly but it is kind of cool at the same time. In the first act, we are taken on an underwater adventure coupled with a very cool cameo in the very first scene. The cast is surprisingly strong and it is what gives this film the fuel for the Piranha \"fire\" that is unleashed. Although a conversion film, the 3D is spectacular and comes highly recommended.",
      "total_reactions": 0,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2012
      },
      "score": 1,
      "text": "Honestly, I didn't like the movie. But I have to give it credit for its \"Piranha are eating human body parts when humans swim in the water\" concept. At first, I thought that the movie will be superb. But when I saw it, it just had lackluster acting, a terrible plot and overreacted approach of the characters to a certain scene. It was a bad movie and I agree with some users that the poster looks better than the movie itself. So, don't expect too many great things about the movie just because of its poster because you don't know whether the actual movie is great......",
      "total_reactions": 0,
      "user": "aaronpaul121"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "Get your towels ready, itâ",
      "total_reactions": 0,
      "user": "mmmcogburn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "Sick, gruesome, but entertaining b-movie. I had some serious doubts about this, but it was fun to watch and sometimes laugh out loud funny. I can't recommend this to anyone, but if your looking for a bloody, horror, b-movie ride, look no further.",
      "total_reactions": 0,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "Killer fish, **** ass, and gore. \"Piranha 3D\" is the collective of everything great about a sexploitated B-movie. It's an over-the-top creature feature that never feels too self-aware or arrogant, but instead embraces all of its silly chaos organically. Never have I witnessed something that can be so clearly described as pure entertainment from start to finish.",
      "total_reactions": 0,
      "user": "LetzTalkMoveez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "there is art to be found in sex and violence. great movies have utilised those primal instincts of men to great effect. piranha is not one such movie. oh, the sex is there, and, to a lesser extend, violence, but this movie throws in one other factor in the mix that i don't like: gore. this movie is big on gallons of blood and chopped off penisses, and i don't like that, because it's too easy. it's just blood and guts, it requires no talent in filmmaking at all. i'm not entertained by oceans colored red with blood, but if you are, than this is just the movie for you.",
      "total_reactions": 0,
      "user": "bram29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "Piranha 3D is a fun, gory, entertaining and enjoyable remake that is soo-bad-that-it-is-good. Blood and nudity everywhere!",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2012
      },
      "score": 4,
      "text": "Not a good movie, but also is not all bad, it is reasonable, I thought the end was kind of unnecessary and inconsistent with the rest of the film, very little blood to the story, but manages to shock those who watched it and it counts a lot for a movie of terror.",
      "total_reactions": 0,
      "user": "vini1904"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "It is somewhat fun to watch. Its a little forgettable, but this typically offensive movie is somewhat unique.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "As long as you can handle the deliberately gratuitous gore, boobs, more gore and more boobs (the things I go through for the purposes of a review!),  Piranha 3D is a hilarious and enjoyable B-movie horror. It is probably the goriest film I have ever seen, but whereas the likes of Hostel cross in to 'gorno' territory, director Alexandra Aja provides horror and violence of the comedy kind.",
      "total_reactions": 0,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "Piranha 3D is one of them films you expect to be bad. You almost know it. But after watching the film i could not help but think how good it was. In fairness its no where near the height of Jaws, but it surely puts itself at second for best 'creature in the water movie.' Many wonder why the film has been recieving a positive response, and the answer simply is cause it is fun. Theres not much detail to go into here, but we actually care for these characters and the many stories is brilliant, and even the bloodless, boob filled first half of the film is entertaining for its pure shock value and laugh factor. But where the film shine is its second half, the tense scenes of trying to escape the boat, and finding the mauled body of a character whose still alive just no skin on his legs, is probaly the most disturbing of the film. We then cut to the fast paced craziness of what can only be described as the blood bath of trying to get out of the lake. Its just a really good time to watch, you cant fault the script and acting cause there even good enough, Piranha 3D is the sort of film you think I could watch again, or were genuinely on the edge of your seat, and for this genre of film is a rarity. Its by no means 2010 best film, but it is in a clear mile its most innocent, non caring fun fil , which anyone, over 18, could watch and will defintely thoroughly enjoy.",
      "total_reactions": 0,
      "user": "charliew1820"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2012
      },
      "score": 3,
      "text": "This movie is NOT WORTH IT... You only live once, don't waste your precious time... I get nothing from this, is purely wasting my time... I crack my blu ray disc and split it in two and then throw it away...",
      "total_reactions": 0,
      "user": "MaraGorgha28"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "Piranha isn't trying to trick anyone into thinking it is an Oscar worthy drama. It does exactly what is says on the tin and it does it well. Fast paced, it isn't particularly scary but I think that is part of its charm. Aja has produced a gem though making a sequel is a bad idea in my opinion. Everything about this film was fantastic including the different cameos and references.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "An extremely well-made porno. Watched it for the nth time. Never gets old.",
      "total_reactions": 0,
      "user": "btzneb92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "Piranha 3D is nothing more than a gory, nudity filled schlock fest that has nothing really great about it. However, that doesn't mean the film isn't fun to watch. The acting is better than expected, the CGI is mostly decent giving the size of the budget, and it never takes itself too seriously. I'd give it more of a 7.5 out of 10.",
      "total_reactions": 0,
      "user": "Captain_Kirk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "A good remake of terror Animal lovers should not miss. It's a little porn but everything else is fine. Entertaining, good effects, and a little gore (if not quite gore). I loved it.",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "Sexy, funny, bloody, and wild, Piranha delivers low class, roller coaster entertainment.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2012
      },
      "score": 0,
      "text": "\"Piranha 3D\" is sick. Just plain, straight-up sick. Instead of a simple, undercooked B-horror flick like I was expecting (I did not see any marketing for this movie), I was instead subjected to the most over-the-top and exaggerated ninety minutes of perverted adolescent pandering I've seen in my life. For the love of God, Michael Bay would be ashamed to have his name on this thing, and he dumped fat dead people down city streets in \"Bad Boys II\". When it's not insulting your genitals with shamelessly objectified nudity, or piranhas chowing down on penises and breast implants, it's bleeding your eyes with the most overdone gorefests ever manufactured on film. Am I really supposed to find humor in a bunch of spring break teenagers getting chewed, bitten, torn, ripped and shredded to the bone? Am I supposed to laugh when a girl breaks in half while being carried to safety, or when the camera looks over all the half-eaten cadavers? Am I supposed to be entertained when a half-assed villain devoid of any and all character or human relatability comes crawling onto a deck with meaty twigs for legs? No. Absolutely not. This is not entertainment, and it's disturbing to think that enough people were convinced otherwise to throw together this twisted piece of ****",
      "total_reactions": 0,
      "user": "WriteFilmLive21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "Not much to dislike about this movie. Boobs, blood, guts...it's a winner in my book. So much fun to be had with this film! Unfortunately they quickly made a sequel for this, but this first addition is good.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Everything in this movie is almost great except that a lot of nudity, porn stars...but if this movie took its self more seriously it would be perfect.",
      "total_reactions": 0,
      "user": "HaithamBayazeed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "Its what the people want. Refreshing and Good. Takes you on a joyride. Sadly the 3D was a waste. But was still a blast. When you watch you may may think death funny? but it really was. Funny and Good.",
      "total_reactions": 0,
      "user": "MarkMusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "Piranha 3D is that kind of movie that isn't self aware, it is the kind of movie that should be watched once and then trashed, of course, Piranha is a 3D movie that can't be watched in 2D it would make it worse for the viewer, with boobs everywhere, this isn't a movie it is a porn in water with tons of blood, on the bright side, Piranha is a movie that is so bad that it gives you a good time, but don't expect anything from this kind of cheap horror movie.",
      "total_reactions": 0,
      "user": "AReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "Both bloody and joyful. Piranha 3D brings us what we actually wanted from a killer fish movie. With strong performances from the actors, this movie is horror fans must see film.",
      "total_reactions": 0,
      "user": "Kevinxavier08"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 4,
      "text": "PIRANHA 3D delivers what it promises: gore and boobs, but doesn't realize that to be a good horror comedy you have to be clever in your attempts to spoof the genre, and well, in the end, sort of falls flat.",
      "total_reactions": 0,
      "user": "NFW"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "This a very bloody and gory movie that is about prehistoric piranhas? When I first heard of this movie I thought it was going to be an epic fail but instead I deeply enjoyed this movie",
      "total_reactions": 0,
      "user": "MissDrae"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "Piranha 3-D is actually a surprisingly good movie.Descent acting,great visual effects and gory deaths are the best things in this action packed 3-D remake.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "The CGI on this film is fricking cringeworthy. Holy crap it's bad, the piranhas look like blocks of wood squirming around with ketchup dropping out! WTF!!!???? And the film is unrealistic as **** All the people that died brought it on themselves and they should've fricken listened to the police instead of prancing around in a lake infested with piranhas. Stupid film.",
      "total_reactions": 0,
      "user": "YourOtherMother"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "This was great comedy however i think its too gory and the sensual scenes were too short jk! Anyways the movie was awesome comedy/thriller and horror as it spurrs horror of the depths.",
      "total_reactions": 0,
      "user": "anonymouslim"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2016
      },
      "score": 3,
      "text": "Абсолютно тупой, не смешной, скучный большую часть хронометража, не страшный трешак. Юмор, если он тут вообще есть... ах да, покусанный мужской половой орган крупным планом - это очень смешно! (нет). Спец-эффекты плохи. Пираньи местами двигаются ужасно не плавно, а какими-то рывками, да и сами ведут себя не как рыбы... а, они же супер пираньи... вау...",
      "total_reactions": 0,
      "user": "russiangamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "LOVED THIS. i actual jumped out my skin at the end haha! but overall great great film!",
      "total_reactions": 0,
      "user": "choomtabi31"
    }
  ]
}