{
  "mc_avg_user_score": 3.8,
  "mc_metascore": 39,
  "mc_mixed_rating_frequency": 54,
  "mc_movie_name": "Planes",
  "mc_negative_rating_frequency": 80,
  "mc_positive_rating_frequency": 33,
  "mc_pro_critic_reviews": [
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2013
      },
      "score": 75,
      "summary": "What Planes lacks in novelty, it makes up for with eye-popping aerial sequences and a high-flying comic spirit."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2013
      },
      "score": 67,
      "summary": "When Planes really takes flight, it can be boldly transporting. Other times, though, it feels like it's running low on jet fuel, full of limp characterizations and questionable set pieces."
    },
    {
      "critic": "Mark Feeney",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2013
      },
      "score": 63,
      "summary": "Planes has some wonderfully goofy, even ineffable, touches."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2013
      },
      "score": 63,
      "summary": "Often less really is more, and that’s why I can recommend Planes, a charmingly modest low-budget spin-off from Pixar’s “Cars’’ that provides more thrills and laughs for young children and their parents than many of its more elaborate brethren."
    },
    {
      "critic": "Dave Calhoun",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "There’s nothing groundbreaking about the animation or script. That said, the characters and story still offer low-key charms."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "For a movie about planes, a lot happens on the ground — those refueling stops can take forever. But the animators take advantage of the power of flight, packing the action sequences with daredevil runs. But it's a race, and a kind of sameness occasionally sets in."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "Director Klay Hall's embraceable, overachieving romp plays nicely as a big-screen feature."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Planes moves along quickly at a running time of 92 minutes, occasionally taking flight with some pretty nifty flight sequences. The animation is first-rate, and the Corningware colors are soothing eye candy."
    },
    {
      "critic": "Susan Wloszczyna",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Planes modestly succeeds. Very modestly."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Essentially Cars in midair."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Airplane buffs are going to have a particularly good time; each of the planes seems to have an obscure real-life counterpart. And pop-culture junkies will appreciate a few sly nods as well."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Elementary school-age boys may well be delighted, but it offers not a scintilla of stimulation for anyone else."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Planes has practically no visual distinction, it's a complete knockoff, but I think it'll get by with the kids."
    },
    {
      "critic": "Michael Rechtshaffen",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "While visually engaging, this production of Disneytoon Studios -- it was originally slated to go direct-to-DVD -- lacks the sort of character depth and dramatic scope normally associated with the Pixar brand."
    },
    {
      "critic": "William Goss",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2013
      },
      "score": 43,
      "summary": "A visually colorful but otherwise vanilla continuation of the series."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "DisneyToon Studios have borrowed so much from Pixar here, and yet they seem to have learned almost nothing."
    },
    {
      "critic": "Angie Errigo",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "A Pixney misfire."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "The characters may soar, but viewers’ spirits stay grounded."
    },
    {
      "critic": "Emma Johnston",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "Little ones will love the bright action scenes, but the lack of wit and humanity that makes exec producer John Lasseter’s best work\r\nso special will leave grown-ups feeling frustratingly grounded."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "Planes is for the most part content to imitate rather than innovate, presumably hoping to reap a respectable fraction of the box office numbers of “Cars” and “Cars 2,” which together made hundreds of millions of dollars (not to mention the ubiquitous product tie-ins)."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "On just about every other level other than visuals, Planes is dry, dry, dry. There's no verbal wit, no standout vocal performances."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "Planes was originally scheduled to be released straight to video. Although the smallest children might like bits and pieces of it, there’s nothing in the movie that suggests why Disney strayed from its original plan."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "It’s a pleasant enough expression of a series of familiar story beats, but apart from a few brief action-sequence moments, it could hardly be more rote or vanilla."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "Diverting in bits and pieces, but absent the heart, soul and ingenuity one associates with the best of Disney animation, the endlessly merchandisable picture could very well soar at the box office, but it won’t stick the landing where word of mouth is concerned."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2013
      },
      "score": 38,
      "summary": "Planes looks, sounds and feels like a direct-to-video project, which in an earlier age when people still bought DVDs it would have been. In theaters, it’s nothing more than a laughless 90 minute commercial for toys available at a retailer near you."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2013
      },
      "score": 33,
      "summary": "Perhaps one of the two already-in-the-works Planes sequels will crack one of these unholy machines open. That’d be about the only reason to return to this nose-diving franchise."
    },
    {
      "critic": "Phil Brown",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2013
      },
      "score": 25,
      "summary": "Despite gorgeous visuals from an army of Disney animators, the film is one of the weakest the studio has produced in years and deserved a bargain-bin DVD release."
    },
    {
      "critic": "David Hiltbrand",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2013
      },
      "score": 25,
      "summary": "The animated film has all the hallmarks of a straight-to-DVD project - inferior plot, dull writing, cheap drawing."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2013
      },
      "score": 25,
      "summary": "The film feels second-rate in every sense, from the quality of its animation to its C-list voice cast."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2013
      },
      "score": 20,
      "summary": "Little ones will stay engaged, but any kid old enough to fly unaccompanied will probably search for other in-flight entertainment."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2013
      },
      "score": 20,
      "summary": "What a clunker."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2013
      },
      "score": 20,
      "summary": "Can a plane jump a shark when it's already in the air? To Disney, that question is moot. It's so certain that Planes will make a mint in toys, if not in theaters, that it's already slated a sequel for next summer."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "Cars 2 meets Planes with a recycled plot and characters so one-dimensional, even the sub-Pixar animation style is enough to fill this abysmal cesspit to the brim of its 90 minute runtime. Even more obvious of a cashgrab than Cars 2, the upcoming sequel to this will likely continue Disney's tread in the money over quality production line.",
      "total_reactions": 2,
      "user": "Glitter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "Planes is an easy movie to hate, but if you put aside any preconceived notions about it based on negative critic and user reviews, it's not a total disaster.  The animation is excellent, it moves along quickly and there are even a few modest chuckles to be had.  But it is clearly time for Disney to leave the Cars universe and get back to telling fresh and imaginative stories.",
      "total_reactions": 1,
      "user": "BKM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "It's clear that Disney just phoned in this \"Cars\" spin-off. Everything I've typically come to expect from a Disney animated movie, like great plot, tons of humor, big name voice actors, and excellent animation, are all lacking. Animation is pretty great, but nowhere near the quality of a typical animated Disney movie. The plot has been done thousands of times before and it is almost completely devoid of any funny moments. It is also really hard to care about any of these characters, especially since the majority of them are irritating. The voice actors do good jobs, but they are mostly C or D-list actors, which is incredibly odd in my opinion.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "Pretty much a rehash of the cars movies with less interesting characters, but the same universe, the same types of characters and the same animation styles. I expect more.",
      "total_reactions": 1,
      "user": "BalicanBreeze"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "It's not a terrible movie, but it's a movie that you don't feel in any way shape or form. It's just a plain and forgettable movie with a predictable storyline and surprisingly some cheesy animation. Personally, I think this movie is probably the most underrated movie of the year. Be sure to check out my YouTube channel \"TheMovieManLife\".",
      "total_reactions": 1,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 2,
      "text": "Even my six year old blind daughter hated it. The worst part about it is that there was no story too the movie. And no development of characters what so ever",
      "total_reactions": 1,
      "user": "Lansdenrs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "What DisneyToon's (the creators of the Tinkerbell series) are able to accomplish in their most recent animated fare \"Planes\", are to have made  a visually beautiful animation film, with some slapstick humor that may appeal to the younger audiences. While \"Planes\" may succeed in this, and while it may be enough for some young children, the narrative does suffer. The film's narrative is downright predictable, and a little disappointing, considering that the \"Cars\" franchise used a lot of its universe to its advantage, while \"Planes\", uses its universe mostly for puns and stereotypes. While characters like Dusty, may be easy to root for, his story is definitely a little over the top cheesy as the film moves along; which ends up to be a sort of weird and awkwardly structured romance with Dusty and a Indian racer, with them flying around the Taj Mahal. Another thing to note is the film's humor, which would have benefited the film, but unfortunately doesn't work. Most of the humor depends on the characters, which, to me, felt a lot absurd, as many of the characters are a lot cliche to the type of underdog film this is. Though this may seem like negative criticism, the thing that \"Planes\" does well at is try to get your emotions through this underdog story, which I thought was well done. Though this may be the case, \"Planes\" has some heart, animation, and slapstick humor that can entertain, but unfortunately is pushed down with its mediocre narrative, absurd humor, and cliche elements.",
      "total_reactions": 1,
      "user": "jeff_reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "Not As Good As The Cars Movies But It's A Pretty Decent Spin-Off And It's Surprising As Well The Animation Is Nice, The Story Is Hit Miss, The Charters Are Either Funny Or Plain Basic",
      "total_reactions": 1,
      "user": "MrEpic012"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "\"Planes\" is what happens when Disney decides to flex their \"we own Pixar's properties\" muscles and build a sequel in an established fictional universe. A true travesty of a film, Disney's given us a Pixar-esque sequel that doesn't even hold a candle to the WORST Pixar films.",
      "total_reactions": 8,
      "user": "Captiosus"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "What planes lacks in humor and speech it doesn't do that well in animation. There are some very good flying scenes but I think the toys will make more money than the movie. This is not a movie you would rush to watch, only see it if you have some spare time.",
      "total_reactions": 10,
      "user": "MRbossFTW"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "Summary:",
      "total_reactions": 6,
      "user": "DisneyMovieRev"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "Parents, please dont pay a cent to see this film, a lot of the production was outsourced to India and shows, in spite of a number of capable north American studio that bid to do the work at a reasonable rates, the executives still chose to do this in India where they can pay an artist about 500 dollars a month.  If the savings were kicked back to the consumer this would be reasonable, but it isn't, they will charge full price, its just lines a few executives pockets and further weakens our industries and work force.  Dear Parents these movies regardless if they are made in north America make bags of cash, the small saving made by outsourcing art to India does  nothing but line a few individual pockets, and takes away from hard working families who are trying to make a living, and further more you the consumer will be given an inferior product, and still charged the full price. boycott",
      "total_reactions": 14,
      "user": "sniper99"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "I don't know why this movie is bad. Very good at Cars 1, then worst at Cars 2, then very worst at Planes. Maybe I can say like this Cars 1  Cars 2  Planes.",
      "total_reactions": 5,
      "user": "DeikuzanCrysis"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "At the end of the day, Planes is passable direct-to-video animated entertainment for kids  featuring action sequences that are more cinematic in their style  but the movie doesn’t deserve a theatrical release, when viewed as a whole. No doubt, many young moviegoers will still enjoy large segments of the film (especially if they see it in 3D), which may well be reason enough for some families to give it a look. Regardless, it’s difficult to ignore how Planes ends up feeling like little more than an (often) dull and nearly-soulless cash grab.",
      "total_reactions": 6,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2013
      },
      "score": 1,
      "text": "Much like Cars, Planes isn't firing on all cylinders. It's a direct to DVD feature that was upgraded to fill a release gap, a gap most people are currently wishing had stayed vacant. Crop Duster, Dusty Crophopper (Dane Cook) is sick of being a one job plane. Dusty wants to be a racer and with the help of his mentor Skipper (Stacy Keach) and a little luck he might just get to do what he wants. While it does try to at least make sense from a story point of view it doesn't mean its a good film. If all you want to do is make a story that makes sense you haven't really set the bar very high. However the director pretends that's all he needs and carries on regardless in the search for something that can  scrape the bottom of average. It doesn't. While the ride works its bumpy, cringe worthy and unoriginal,a trifecta of awfulness that added together makes Planes a horrific viewing experience. Dane Cook is surprisingly not offensive but the whole film is, it insults peoples intelligence as we are forced to watch Cars again.",
      "total_reactions": 4,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "Do you enjoy family movies full of fun and excitement? Do you enjoy clean, good hearted films full of wonderful characters and whimsical places?",
      "total_reactions": 2,
      "user": "Dankas_Turtle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "This is my first review, but I felt compelled to do so. I thought Cars was great. Unique story line, characters with depth, comedy, plot development. Planes felt like an hour and a half commercial. Nothing original whatsoever. The underdog has a dream, reluctantly gets mentored by grumpy old man who ends up learning new life lessons in the process. There's the dopey guy. The bad guy. The cute but unattainable girl. Then the underdog wins. Yeah, we saw it already, it was called CARS. I didn't laugh once watching Planes. They're really getting lazy and expecting us to like this uninspired garbage. Hmmmm... whats next? What action figures can they market at Walmart? \"Trains\" of course. What about \"Hot Air Balloons\"? A plucky Helium balloon dreams of floating around the world, so he finds a grumpy old man to mentor him, meets a dopey guy along the way, then a bad guy, and then he wins. Action figures coming to Walmart 5/20/14.",
      "total_reactions": 2,
      "user": "kauairay"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2013
      },
      "score": 0,
      "text": "Why do I ever going to see a Disney movie that has a full of C-lists actors like Dane Cook and not-so-mediocre (Julia Louise-Dryfuss and Teri Hatcher) actresses. Cars 2 was one of the worst sequels in a Pixar movie, but it gets much worse. Since Disney is still trying to open its wounds from past mistakes, they make a new movie called \"Planes.\" Sure it's not a Pixar movie, but when it comes to bad comedians, Dane Cook can't act and can't even save this Disney debauchery. If they said \"world of Cars\" then how come Cook be so stupid to be in a Disney movie? It's good for the kids, unfortunately, it's another side of bad things to come for the mouse house. Avoid \"Planes.\"",
      "total_reactions": 13,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "I don't get the hate for this movie. I understand the desire to hate it, mostly because it is a Disney Animation Studios spin-off of the highly underrated Cars series (which has a fair amount of unwarranted dislike and hate directed towards it as well) and as such is expected to be of Pixar quality which is itself not a justified thought since it is not Pixar behind this movie or even Pixar's animation team.",
      "total_reactions": 8,
      "user": "Troianman"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "Not good. It's just like Cars and it has nothing new to show us. Only little children under 7 will like it.  Awful and very bad. It's, well, bad!! My opinion: Do not  try to watch it!! Never!",
      "total_reactions": 3,
      "user": "JohnnyStephens"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2013
      },
      "score": 0,
      "text": "Hollywood propaganda machine to its finest  A movie glorifying the military, the veterans, the middle-class and classic all-american values. Where's Hollywood imagination? They're feeding ketchup to those kids, always the same ol' sauce.",
      "total_reactions": 5,
      "user": "sherbypaladin"
    },
    {
      "neg_reactions": 20,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "In 5 weeks this under-rated movie made US$79 mio including US$4.4 mio last weekend. ON YOUR PLANES CRITICS AS WELLS AS USERS!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "total_reactions": 21,
      "user": "franissavio"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2014
      },
      "score": 2,
      "text": "Cars was a wreck of a movie and this off shoot is just 'plane' boring. In a year when animated films have not been at their best this must take the dubious honour of being the worst one that I have sat through in 2013. It is derivative, un- funny and unbearably twee. Even more annoyingly it just never stops talking. Noise wise it is very full on, never pausing for breath and yet everything said is total gibberish. Very Poor!",
      "total_reactions": 1,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "If it was not for the abysmal 'Cars 2' and less then glossy 'Brave' recent Pixar releases would look like failers but thanks to these two let downs it makes 'Planes' shine in comparison. It was originally planned to be a direct to DVD release but Disney took the gamble and brought it to the big screen. Some may argue this was a gimmick to sell merchandise but the truth is kids owned toy cars and planes before Pixar came along and their is no doubt they still will when they are gone. This was defiantly the right choice and also clever merging it with the 'Cars' Universe despite not featuring any of the main characters from the Cars franchise.",
      "total_reactions": 1,
      "user": "smaug87"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "This movie is under rated I know not like cars but this is good for kids and me a big kid at hart and it shows that we can love the cars world again but I just wish it was well received",
      "total_reactions": 1,
      "user": "Adam201028"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "I can’t believe I’m saying this but this movie makes Cars 2 look enjoyable. Cars 2 didn’t get a low score because it was a bad film but because it was from a studio that was capable of more than an average kids film. This is just a straight up bad movie that I would not recommend watching to anyone outside of toddlers. Outside of some nice flying segments, nice animation on the environments, and decent theme this film has nothing to offer. The characters are boring and cliché and the story is unoriginal borrowing heavily from previous entries in the franchise and lacking the heart those films had (moreso than original Cars). This has to be one of the worst animated films I have ever seen because of how half assed it is. Do yourself a favor and avoid this movie. If you have kids show them another animated film that came out this year like Monsters University or Despicable Me 2 they may not be great they are far more entertaining for the family than this lazy production that was all money no heart (don’t believe me they already have a sequel planned, which they promote at the end credits).",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2014
      },
      "score": 3,
      "text": "This was a movie, that should of went straight to DVD or Blu-ray! Its a low budget movie and it shows in the animations! while watching the movie I felt like the studio just did the movie for the money.",
      "total_reactions": 0,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2014
      },
      "score": 4,
      "text": "Not as bad as I thought it would be. However, there is little original to this movie. Animation is more or less what you would expect for Pixar. Characters are rich and colorful. Voice acting is pretty good by all those involved. However, the script and plot is nothing we haven't seen a million times before, and done far better.",
      "total_reactions": 0,
      "user": "Rox22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2015
      },
      "score": 5,
      "text": "This is literally a poor copy of \"Cars\". Predictable, decent and boring at times, \"Planes\" is one of the animations, you wont watch more than once! BUT, its still a great choice for your kids or if you have enough free time.",
      "total_reactions": 0,
      "user": "SEROJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2013
      },
      "score": 3,
      "text": "I first heard about Planes in late July, then I saw a video game tie-in to the film, then I saw advertisements of toys and other children's items as a tie-in to the film, then I heard about a sequel, Planes: Fire and Rescue set for release in 2014. Then the film came out. And when I saw the film, it was crap. There is always some type of \"thing\" in every Disney film I've seen that just grips you and sometimes leaving you with a sense of satisfaction, this film does not have that. It seems like the whole purpose of this film is to make a franchise off of it, for profit. The animation says Disney, the story is very cliche and the characters have personalities that  you can find in any other underdog film. Kids will drag their parents to see it, have a good time and enjoy it, I know that much. But overall, this film is nothing but, something to keep you occupied for 92 minutes.",
      "total_reactions": 0,
      "user": "LWFYM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2013
      },
      "score": 4,
      "text": "Our young family are huge Cars fans and loving both films, we all were looking forward to Planes.",
      "total_reactions": 0,
      "user": "SuperstarVenom"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "\"Planes\" feels like a direct-to-DVD release (which it originally was) and is nothing really beyond a kids movie.  Disney took Pixar's \"Cars\" universe and took it to the skies and presented a lazy movie that kids will dig but adults might find boring.  The story is pretty standard stuff, the jokes are just a bunch of plane-based puns and some of the cast is great.  However, the main character is voiced by Dane Cook and, while he's subdued and not his usual \"if I yell my punchline people might find it funny\" self, he proves that he's not very good and lacks range.  In the end, Disney took a Pixar property and made it for little kids so they could sell a lot of \"Planes\"-based merchandise.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "A bizarre combination to get as much advertisement as possible into the shortest amount of time, most of the planes in this movie have their company logotype imprinted all over their bodies, the worst example of this is the American airline monstrosity that makes a appearance in this movie, while i give Disney credit tho, they came up with some unique designs for the planes, The worst part are the racist stereotypes, incarnated into appropriate or disappropriate form depending if you are racist or not. Overall if you have nothing better to show your kids, i´d guess this is better than letting them play with scissors, but there are tons of better child movies out there compared to this.",
      "total_reactions": 0,
      "user": "M8ass"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2013
      },
      "score": 4,
      "text": "Planes, the Cars spin-off, the result? A big disaster. It's very obvious, that Planes is an innecesary idea, Cars is the less succesful Pixar movie, and someone has the \"brilliant\" idea to release a spin-off of the franchise. The only good on Planes is the great animation, but the rest is like the movie, innecesary.",
      "total_reactions": 0,
      "user": "MarkDetrel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "not bad movie  was a good attempt  It would be great if it has a little more action and story  better visual effects too  overall a watchable movie watchable",
      "total_reactions": 0,
      "user": "aditya91"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2013
      },
      "score": 1,
      "text": "The Croods and Turbo managed to beat the combination Monsters University and Planes (although the latter was not Pixar). Luckily that is not Disney Toons and not from Pixar. Pixar already suffered too because after Cars 2 and Disney Toons and used to deliver bad sequels (Pocahontas 2 Tarzan 2 Cinderellas 2) but also managed some good (Tinkerbell, the movie Break Tigger and the movie). This movie is a descepcion and a very cheap copy of Cars only with Aircraft. The plot is typical and leads to a typical end, lack of charisma to the characters and the short duration (10 is longer than the Tinkerbell minutes). The only thing I liked was the animation accompanied by a good 3D. Do not go see it, if they want to see an animated let it go and wait for another animated film premiere is best.",
      "total_reactions": 0,
      "user": "JNOTR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "Planes es una película que puede resultar  de cierta forma como ver otra vez \"Cars\", pero desde otra perspectiva, y que no es tan sobresaliente pero sí un tanto sentimentalmente ilustradora.",
      "total_reactions": 0,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "\"Planes\" 10 Scale Rating: 3.0 (Awful) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "Just have one thing to say, this is one of the most if not the most underrated movie(s) of all time. I don't care if it is another racing movie with an already used story, I still love it to death.",
      "total_reactions": 0,
      "user": "Tbone413"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "If you just close your eyes and think about the movie for a couple of seconds, you would probably think that this is a Cars Ripoff.",
      "total_reactions": 0,
      "user": "AGN"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2015
      },
      "score": 8,
      "text": "This movie is a good underdog story,and why dose everyone hate this movie seriously, I do not see this movie as a fail and i do not know why everyone is is saying sucks.planes is a good movie.",
      "total_reactions": 0,
      "user": "Jollyjoe1000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2016
      },
      "score": 3,
      "text": "Everything about this is what I wanted to love about Planes. From the brilliant animation, to the great voice acting. Unfortunately, from the mediocre plot, to the already-tried attempt, Planes feels like something abandoning off from a plane and never coming back on that plane. Luckily, people say the sequel is better. I hope so.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2016
      },
      "score": 4,
      "text": "Planes should have never started this flight as it remains really disapointing. It is not better than cars. It also gets boring real fast, plus it doesn't have the heart that Cars had.",
      "total_reactions": 0,
      "user": "gameguardian21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2016
      },
      "score": 3,
      "text": "Planes has a recycled plot form Cars and its sequel. This is officially one of the worst Diseny films and doesn't deserve being on Pixar. Yea, it's colored and brings a very common message to young viewers, but not for teen and people viewers. It is also boring, predictable and not-funny enough for put the audience interested. This film tries to make unforgettable characters. But unfortunately, it totally fails.",
      "total_reactions": 0,
      "user": "Futuredirector"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2016
      },
      "score": 6,
      "text": "This and Planes: Fire and Rescue are the weakest of the Disney Films. But The film and it sequel should just jump a shark. This is really too depressing. Its animation is really pwned. The characters are not the characters from Cars. The rest of the film is just boring. Dreamworks' Shrek had better animation and graphics than this. For now, we will wait for Cars 3.",
      "total_reactions": 0,
      "user": "SimpsonFans"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2016
      },
      "score": 0,
      "text": "Cars 2 meets Planes with a recycled plot and characters so one-dimensional, even the sub-Pixar animation style is enough to fill this abysmal cesspit to the brim of its 90 minute runtime. Even more obvious of a cashgrab than Cars 2, the upcoming sequel to this will likely continue Disney's tread in the money over quality production line.",
      "total_reactions": 0,
      "user": "HomerSimpson12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2016
      },
      "score": 6,
      "text": "This and Planes: Fire and Rescue are the weakest of the Disney Films. But The film and it sequel should just jump a shark. This is really too depressing. Its animation is really disgusting. The characters are stupid. The rest of the film is just boring. Dreamworks' Shrek had better animation and graphics than this. I give Planes a 4/10 although they tried.",
      "total_reactions": 0,
      "user": "Tiber5"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2016
      },
      "score": 5,
      "text": "This and Planes: Fire and Rescue are the weakest of the Disney Films. But The film and it sequel should just jump a shark. This is really too depressing. Its animation is really pwned. The characters are not the characters from Cars. The rest of the film is just boring. Dreamworks' Shrek had better animation and graphics than this. For now, we will wait for Cars 3.",
      "total_reactions": 0,
      "user": "TiberCromwell50"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2016
      },
      "score": 5,
      "text": "This and Planes: Fire and Rescue are the weakest of the Disney Films. But The film and it sequel should just jump a shark. This is really too depressing. Its animation is really pwned. The characters are not the characters from Cars. The rest of the film is just boring. Dreamworks' Shrek had better animation and graphics than this. For now, we will wait for Cars 3.",
      "total_reactions": 0,
      "user": "KrabsAbs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2016
      },
      "score": 5,
      "text": "This and Planes: Fire and Rescue are the weakest of the Disney Films. But The film and it sequel should just jump a shark. This is really too depressing. Its animation is really pwned. The characters are not the characters from Cars. The rest of the film is just boring. Dreamworks' Shrek had better animation and graphics than this. For now, we will wait for Cars 3.",
      "total_reactions": 0,
      "user": "LostVisitor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2017
      },
      "score": 6,
      "text": "This and Planes: Fire and Rescue are the weakest of the Disney Films. But The film and it sequel should just jump a shark. This is really too depressing. Its animation is really pwned. The characters are not the characters from Cars. The rest of the film is just boring. Dreamworks' Shrek had better animation and graphics than this. For now, we will wait for Cars 3 to come out on June 2017.",
      "total_reactions": 0,
      "user": "ThisIsSparta666"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2016
      },
      "score": 6,
      "text": "Not a really funny movie at all. But the films may have a misuse of many records that Cars broke at the box office. Because of Planes being a box office bomb. I would just be off seeing Doug's Movie instead.",
      "total_reactions": 0,
      "user": "PAMA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2016
      },
      "score": 6,
      "text": "Not a really funny movie at all. But the films may have a misuse of many records that Cars broke at the box office. Because of Planes being a box office bomb. I would just be off seeing Doug's Movie instead.",
      "total_reactions": 0,
      "user": "Pama300"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2017
      },
      "score": 6,
      "text": "This and Planes: Fire and Rescue are the weakest of the Disney Films. But The film and it sequel should just jump a shark. This is really too depressing. Its animation is really pwned. The characters are not the characters from Cars. The rest of the film is just boring. Dreamworks' Shrek had better animation and graphics than this. For now, we will wait for Cars 3 to come out on June 2017.",
      "total_reactions": 0,
      "user": "Creepers200"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2017
      },
      "score": 6,
      "text": "This and Planes: Fire and Rescue are the weakest of the Disney Films. But The film and it sequel should just jump a shark. This is really too depressing. Its animation is really pwned. The characters are not the characters from Cars. The rest of the film is just boring. Dreamworks' Shrek had better animation and graphics than this. For now, we will wait for Cars 3 to come out on June 2017.",
      "total_reactions": 0,
      "user": "Enderman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2017
      },
      "score": 6,
      "text": "Not a really funny movie at all. But the films may have a misuse of many records that Cars broke at the box office. Because of Planes being a box office bomb. I would just be off seeing Doug's Movie instead.",
      "total_reactions": 0,
      "user": "MinecraftF"
    }
  ]
}