{
  "mc_avg_user_score": 5.3,
  "mc_metascore": 39,
  "mc_mixed_rating_frequency": 25,
  "mc_movie_name": "Planet 51",
  "mc_negative_rating_frequency": 51,
  "mc_positive_rating_frequency": 59,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "Planet 51 has good animation, an funny plot and easy-to-please moments, but has an very predictable end - and even children knows that, but stays a question in all heads, before the end: he stays there or he goes?",
      "total_reactions": 0,
      "user": "Pedro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2015
      },
      "score": 2,
      "text": "Planet 51’s recycled story, unlikeable/flat characters, and poor animation given advancements by Pixar and Dreamworks make this seem like it is a Direct-to-DVD or made for TV film it isn’t. The film’s script lacks any originality borrowing the loser becomes a hero story that tons of kids movies seem to use saddled with a generic love interest, generic villain, and tons of cardboard cut out characters. Outside of a charming Rover who despite some callbacks to Wall-e is the only charming character in the film with his lack of words and puppy like attitude. Unfortunately, the rest of the film isn’t so charming as it constantly relies on pop culture references, mainly of other sci-fi movies, ranking in at one per minute. The young children who see this movie will probably find it ok although I pity the parents who will be wanting to get inside their car rocket and leave the planet.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "If you are the sort enjoy watching movies for children, with your children, or simply movies with vivid, beautiful, and creative art direction, you'll enjoy this movie. Otherwise it simply isn't for you. It's humor is by no means racy, but some jokes may offend you if you are the easily offended type. While it does what it sets out to do, I wouldn't recommend this movie to most people, but if you do fit the profile of a person I specified earlier, I would recommend it.",
      "total_reactions": 0,
      "user": "phildog"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2011
      },
      "score": 3,
      "text": "Its a shame that this movie didn't use it's smart plot to a benefit or I would have given this movie a higher rating if it had a better cast and if it was funnier, but like I said it falls too short.",
      "total_reactions": 0,
      "user": "percy972"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2011
      },
      "score": 4,
      "text": "This family animated film was okay not great. The concept of the alien civilization being in the 1950s was dumb. Even some of the music from the 1950s by dumb pop singers was retarded. The acting was okay too. This movie is for kids only, not adults.",
      "total_reactions": 0,
      "user": "jAbMaN"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2011
      },
      "score": 4,
      "text": "This Is A VERY Uncreative Movie... The Voices Are Nah-Nah... But This Is Cute For Kids...",
      "total_reactions": 0,
      "user": "RogerSmith97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "While the 1950s/1960s references and setting are likely to fall flat with most kids, I thought the film was fun and brilliantly animated. My little nephew had no idea about the cultural era defined for the aliens, but he remained mostly interested from start to finish (which, for him, is quite a feat). This is by no means the cream of the animated film crop, but it's a far better experience than many reviews to date would suggest, and it's worth watching. It's a shame I never heard about it until nearly four years after release.",
      "total_reactions": 0,
      "user": "UndeadRufus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2011
      },
      "score": 3,
      "text": "Planet 51 does have a unique concept of an alien race in a 1950's flair environment, but the whole execution of the movie was a complete disaster. The story was quickly forgettable with humour so dull that Dwayne Johnson (voice of Charles T. Baker aka the Astronaut) couldn't save this animated feature to be highly entertaining. With a poor execution and only two scenes that will make you laugh, Planet 51 is at best to be a direct to video film than a theatrical feature.",
      "total_reactions": 0,
      "user": "TipsyMcBee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "PLANET 51 is a nice, little kiddie film that has many great homages to famous sci-fi movies.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2011
      },
      "score": 3,
      "text": "Planet 51 may have great animation, but the thin plotted story and uninteresting characters make it very boring. It lacks fun in a lot of ways. The premise was interesting, but was poorly executed.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2012
      },
      "score": 2,
      "text": "It has a very intriguing premise but the whole film is a wreck. With boring voice acting and bad animation along with it not being funny, Save your money and don't see it. i give this movie 19%.",
      "total_reactions": 0,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2012
      },
      "score": 4,
      "text": "Planet 51 is a poor animation movie. It haves a really stupid story, but sometimes it gets kinda interesting, sometimes, because this move is a let down. Even the animation is amateur and poor.",
      "total_reactions": 0,
      "user": "Cubixreviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2012
      },
      "score": 4,
      "text": "\"Planet 51\" is a letdown that isn't worth to watch. Yes, it haves a good 3d animation, but the story is weird and dumb, and It isn't kids film. This movie is more for teens, because it haves some sexual moments, that aren't graphically absurd, but really not for kids.",
      "total_reactions": 0,
      "user": "FilmReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2014
      },
      "score": 1,
      "text": "Bobo até demais",
      "total_reactions": 0,
      "user": "Iky009"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2016
      },
      "score": 2,
      "text": "It's a shame, because when this film's commercials and trailers were released, I had some faith in it. It looked kinda funny and, if nothing else, I expected it to be a decent children's film. \"Planet 51,\" however, is not decent, it's pretty bad. If not for the fact that it had a decent premise and that the trailers showed SOME PROMISE, this would've gotten a lower score, but as it is, the film is poorly animated, extremely unfunny, and as a whole, completely unmemorable and painfully dull. I'm telling you now, unless you just watched the film RIGHT NOW or looked it up on Wikipedia, there's no way you'll walk out of this movie knowing any one character's name. There's no way. This isn't even a fun watch on \"Bad Movie Night,\" just avoid it altogether. Even if your kid is begging you to let them watch it, don't.",
      "total_reactions": 0,
      "user": "FreedomFighters"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 2,
      "text": "Planet 51 is spaced out.",
      "total_reactions": 0,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "Planet 51 pays homage to the classic alien movies in which it references much from movies such as Aliens and 2001: A Space Odyssey, in which they are really fun and they keep an adult's attention. Personally, my list of favorite animated movies includes peculiar titles and not the usual classics, Planet 51 fits there perfectly.",
      "total_reactions": 0,
      "user": "HaithamB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2014
      },
      "score": 1,
      "text": "It's odd that before this review, the average user rating was 51. How ironic. Especially because it deserves a much lower score. I mean, it's pretty obvious what will happen.",
      "total_reactions": 0,
      "user": "bobthecow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "Planet 51 is Silly and ridiculous but its fun with some funny and sometimes stupid humours and reference.",
      "total_reactions": 0,
      "user": "JohnKristofer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2016
      },
      "score": 4,
      "text": "How am I keep on forgetting to make a review on this movie? Another piece of animation I am keep on forgetting... except this time, it isn't a piece of animation, it's a poorly-made animation trying to rip-off E.T only in reverse.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2016
      },
      "score": 4,
      "text": "Planet 51is not something to search for. The script lacks interest or wit or good jokes. Characters are boring and lack memorbillity. While the animation is alright, but the movie still could have been better.",
      "total_reactions": 0,
      "user": "gameguardian21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2016
      },
      "score": 4,
      "text": "the movie is cute, but it's so pasable it's a entertaining, but that means it's not the best animation movie of the year, it's funny and cute but predictable",
      "total_reactions": 0,
      "user": "PabloBird22"
    }
  ]
}