{
  "avg_user_score": 3.6,
  "metascore": 47,
  "mixed_rating_frequency": 78,
  "movie_name": "Poltergeist",
  "negative_rating_frequency": 107,
  "positive_rating_frequency": 33,
  "pro_critic_reviews": [
    {
      "critic": "Justin Lowe",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2015
      },
      "score": 70,
      "summary": "While Hooper favored shock value and jump scares, Kenan and cinematographer Javier Aguirresarobe construct far more fluid sequences as the camera glides and hovers over its subjects, reserving the most impactful shots for the climactic scenes, particularly a concluding sequence that’s particularly thrilling."
    },
    {
      "critic": "Clark Collis",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 67,
      "summary": "The only really frightening thing about the 2015 version of Poltergeist is how haunted it is by the original."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 63,
      "summary": "This serviceable remake sticks fairly closely and smartly to the same plot, with the same scary objects and even the line, “They’re here.”"
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 60,
      "summary": "The new Poltergeist is a pleasant enough diversion, better as a low-simmer suspense story than a full-blown effects extravaganza."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 60,
      "summary": "All in all there’s not much to complain about here, except that — as with a lot of revisited classics — the story’s not as revolutionary as you remember it. For veterans of the 1982 Poltergeist, it’s more like scary but pleasant nostalgia."
    },
    {
      "critic": "Phil Hoad",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 60,
      "summary": "It’s a shame Kenan can’t muster his own bit of gothic shorthand for post-credit crunch America, but the film still has a fluid, 3D-orientated immediacy."
    },
    {
      "critic": "Eddie Goldberger",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 60,
      "summary": "It doesn't reinvent the wheel, but Poltergeist is a solid, surprisingly effective chiller."
    },
    {
      "critic": "Mike McCahill",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 60,
      "summary": "Mostly it’s a scare machine, and in this respect Kenan’s is the more efficient telling, its VFX lubricating all that now creaks about the original."
    },
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2015
      },
      "score": 60,
      "summary": "Poltergeist, while entertaining, has more in common with slick, audience-goosing spookers like \"Insidious\" and \"Sinister\" than with the imaginative original."
    },
    {
      "critic": "Matt Glasby",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2015
      },
      "score": 60,
      "summary": "Very tame, but saved from the remake scrapheap by Sam Rockwell's surprisingly touching performance and a final reel that – briefly – takes the material somewhere new."
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2015
      },
      "score": 60,
      "summary": "Less a steadily escalating thriller than a guided tour through a county-fair-style haunted house, Poltergeist offers some quality jump scares, and Kenan has a knack for staging solid individual setpieces. But he proves weirdly incapable of modulation or mood setting here."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 58,
      "summary": "Poltergeist is professional and slick and entirely fine. It's also unnecessary in every way."
    },
    {
      "critic": "Kate Erbland",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 58,
      "summary": "There are some chills to be had here, but they taper out exactly when the action should really be ratcheting up, and the film’s tension burns out so quickly that it might as well have been sucked into an inter-dimensional portal of its own."
    },
    {
      "critic": "Jesse Hassenger",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 58,
      "summary": "The most retro thing about the remake is its specific, outdated utility: If anyone still patronizes video stores with hard copies, and if those stores don’t happen to have the original Poltergeist (or Insidious) in stock on a Friday night, this version might do the trick."
    },
    {
      "critic": "William Goss",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2015
      },
      "score": 50,
      "summary": "Makes largely cosmetic changes to the material without offering much in the way of distinctive frights."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2015
      },
      "score": 50,
      "summary": "There's something missing and it becomes apparent early on. The movie isn't scary - not even a little bit."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 50,
      "summary": "The remake grows less interesting as it goes, with final scares dipping into surprising lameness."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 50,
      "summary": "If you’re going to remake Poltergeist without the whole TV angle, \"Insidious\" already kind of did that. To be fair, this new Poltergeist isn’t anything special, either. But it’s not a travesty, and that feels like cause for brief celebration."
    },
    {
      "critic": "Fionnuala Halligan",
      "publication": "Screen International",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2015
      },
      "score": 50,
      "summary": "A good cast including Sam Rockwell and Jared Harris wander around sincerely in what feels, at times, almost a shot-by-shot remake, and at others, an obstinately wrong-footed exercise in dabbling with the narrative."
    },
    {
      "critic": "Randy Cordova",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 40,
      "summary": "Ultimately, the whole affair is forgettable. The original film was promoted with the tagline \"It knows what scares you.\" If there was a truth-in-advertising law regarding films, this movie's ad copy would read: \"Poltergeist: Meh.\""
    },
    {
      "critic": "Nick de Semlyen",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2015
      },
      "score": 40,
      "summary": "A disappointingly tame and unimaginative effort, which throws away much of what was best-loved about the original and fails to find worthy replacements."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 38,
      "summary": "Blase actors rob this of any prayer of being scary."
    },
    {
      "critic": "Brian Tallerico",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 38,
      "summary": "There are a few decent performances, a nice riff on the technology fears that drove the original movie, and a centerpiece of horror that works, but never once do you get the feeling that the people behind this remake are here because of artistic passion or creative drive."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2015
      },
      "score": 35,
      "summary": "Poltergeist ultimately plays like the most perfunctory of remakes, one born of rights ownership and title marketability rather than a burning desire on anyone’s part to do something interesting or provocative with a classic. The 1982 original remains unassailable, all the more so when stood side by side with its pipsqueak descendant."
    },
    {
      "critic": "Charles Bramesco",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 30,
      "summary": "Though the memory of Hooper’s picture haunts every frame of nü-Poltergeist, Kenan’s will fade unseen into the great beyond first."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 25,
      "summary": "To call Poltergeist laughable is not the same thing as saying it’s bad (although it is that, too.) It’s just that it seems less interested in scaring you than in making you chuckle. At least on that score it succeeds."
    },
    {
      "critic": "Clayton Dillard",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 25,
      "summary": "It's the cinematic equivalent of a pat on the back accompanied by a slap in the face."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "If you're stingy about remakes, stop reading now and stay far away from this movie.",
      "total_reactions": 2,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2015
      },
      "score": 2,
      "text": "The whole Modernizing of the movie makes it worse. The Teenage girl is very annoying complaining all the time. The CGI was horrible. As-well I'm not sure if this even a horror  movie. The 2 scariest things where this one jump scare and the CGI squirrel. This movie had no rime or reason to be made. Much prefer the original. It gets 1 point for Sam Rockwell, and 1 point for the fact that it looked like the tried.",
      "total_reactions": 2,
      "user": "IceShard"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "What makes a Poltergeist remake unnecessary is that recently movies like the Conjuring and Insidious gave me some Poltergeist deja vu. In those films a psychic showed up to help a family with supernatural problems and brought a team along to record their findings. Despite both being good films I already felt like I was watching two Poltergeist remakes.",
      "total_reactions": 1,
      "user": "Jim222001"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2015
      },
      "score": 0,
      "text": "My review does not contain spoilers, I clicked that by accident. Here it is ---  I have too many problems with this movie. First of all, it was just like the original. I mean, I understand it's a remake, but changing 3 things about it is not enough. You need to change a lot about it, and not make viewers think that they're watching the original. Secondly, the actors just give up on acting. Sam Rockwell tries so hard, but his acting just doesn't work for the film. The wife can't even act, and the kids sound like they're reading the script for the first time. The directing is less than average, and I'm surprised a studio like 20th Century Fox would even supervise this film. Making the same film that came out 20 years ago, just with flat-screens, is not OK. Third, the film just isn't scary. I am always scared during horror films, but the only part I was scared at was the clown scene. Finally, you shouldn't waste your money on this film. You will be as disappointed as me and the other reviewers are. It is a waste of time, and you'll be sleeping more than watching the film.",
      "total_reactions": 1,
      "user": "TheKavehJ"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "Good Remake that is close enough to the Original and less close to give some new story details.",
      "total_reactions": 6,
      "user": "ernie76"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "The only problem with this mediocre remake is that it fails to live up to its genre. I found only two good scares throughout the entire film, and both were cheap jump scares.",
      "total_reactions": 2,
      "user": "shooterboss"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2015
      },
      "score": 4,
      "text": "Is Poltergeist bad?  Not incredibly, which means it’s not as bad as I thought it was going to be, but I would hardly call it good and it’s fairly obvious when you are watching it that you could save your money and just stay at home and watch the original.  I would refrain from calling it a disastrous re-make, but I would hardly call it a good one!  Everything just feels a lot like you are watching the first film, but with a lot less!  What this film really needed was a better screenplay writer and a better director, because I think there was every possibility that this film could have been better.  As it stands, just see the original, there is really no need to see this one.  The effects are less good, the actors are less good, the plot’s less good, everything is just less good!!   That just shows the futility of this film and fans of the original need not apply.",
      "total_reactions": 2,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "Poltergeist, the remake of the 1982 horror movie by the same name, ingeniously re-invents one of the horror genre's most iconic films in history, and the film does it justice. All of the original feature's elements can be found in the new adaptation, with modern twists and new ways to convey the same scenes in order to still give the audience a fresh, unique experience. The film makes for a great date-night thrill, or a hangout with the friends. My own 'plus one' was wrapped around me like a classic long-arm velcro monkey toy.",
      "total_reactions": 2,
      "user": "OrdinLegends"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "I didn't expect to like this but I really enjoyed it! Great special effects and solid scared. Sam Rockwell was really excellent and the rest of the cast were all good. Apart from the cool CGI the visuals looked really great all round with some nice shot framing and colour grading. The script had a level of self-awareness that was fun and quite amusing but the horror was well done and more intense than your average family friendly film. I don't understand all the negative reviews, I thought this was very well done and really enjoyable.",
      "total_reactions": 2,
      "user": "erolsabadosh"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "Well the movie was maybe not scary but one thing is sure.It is a really fun and entertaining movie.Great acting by the main characters and great visuals are what makes the movie this good.Even the kids were not that bad.",
      "total_reactions": 3,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "Sticking almost religiously to the original, this version of ‘Poltergeist’ cuts down the lead-in and updates the visual effects to give you the most bang-for-your buck in terms of frights and therein lies the first problem, there’s just not enough build-up and time spent on the family dynamic before the weirdness starts, one of the strengths of the original, the result of which is that you’re not that emotionally invested in what eventually happens to them.",
      "total_reactions": 3,
      "user": "FilmPhonic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2016
      },
      "score": 6,
      "text": "Most horror movie remakes are downright awful. They usually fail to capture any of the magic of the original or bring any worthwhile new ideas to the table. That isn't so much the case here. It's got a few cool new ideas. but ultimately it's definitely not as good as the original. However rather than being awful what we have is more of a boring affair.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "*******************************************************************************************************************************************************************************",
      "total_reactions": 2,
      "user": "dollarsign"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "It does a good job at remaking the original that scared everyone back in the day, and still 2015...Poltergeist has impressed me. Fleshed out characters, better visuals, storytelling and genuine scares even if your seen the original. Pointless 3D and some disjointed scenes will be the major let downs. Poltergeist is back \"there coming\".",
      "total_reactions": 3,
      "user": "busbfran"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "Poltergeist is well - shot but not well - realized as a remake. It is not particularly bad, it is entertaining. However, one of the most enGROSSing sequences is cutout . . . you only had ONE JOB HOLLYWOOD!",
      "total_reactions": 1,
      "user": "HaithamB"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "ok so i had my doubt's about even seeing this movie from the start but on a slow boring day decided what the hell i will see it and it was definetiley the worst choice in movies i have made so far this year not that scary plane boring in some parts yea the little kid was a doll baby but that's not what i payed 12 bucks for should have went with my first gut choice  and skipped it all together not the worst i have ever seen but definetiley the worst this year' yes i saw mall cop 2 its a oscar winner compaired to this **** ' so i say skip it",
      "total_reactions": 2,
      "user": "chrismovieguy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2016
      },
      "score": 1,
      "text": "After a string of lackluster \"reboots\" of beloved favorite films (Robocop, Nightmare on Elm Street, Carrie, and the rest), I was dubious about this one from the beginning. The original is a contemporary classic that was groundbreaking for its time, and as long as you can ignore Beatrice Straight's gargantuan early '80s eyeglasses, it holds up well even today and never feels overly dated.",
      "total_reactions": 1,
      "user": "freeling10"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "This actually impressed me quite a bit. Going in, I thought that I was getting an almost shot-for-shot remake with a few modern touches (like a flat screen TV), but what I got was a modern re-imagining of a classic that only kept the basic plot. There were some really cool effects, like the world of the undead. Watching the movie,  I didn't find any technical errors, but there were probably plenty looking back. The issue to me was that what I thought would be the scariest sequences actually made me laugh, but they were still a good time. So if you are a fan of the original or the horror genre, this is a must.",
      "total_reactions": 2,
      "user": "bigtunaonfilm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "I recommend this film not for Horror fans simply because it's not particularly frightening but follows the tried and true jump scare formula which works well and thankfully they don't overuse it.",
      "total_reactions": 1,
      "user": "MiggyD"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "It's one of the better recent horror remakes but that isn't saying much. However, as a standalone B-horror midnight popcorn creepfest, Poltergeist can provide more than a modicum of entertainment.",
      "total_reactions": 1,
      "user": "SolInvicta"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "I went into this movie not having seen the original, so I'm not sure how this movie compares to it. But here's my opinion:",
      "total_reactions": 1,
      "user": "davidprice96"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2015
      },
      "score": 0,
      "text": "Honestly would have been better as a comedy and it was so meh that it was more scary when the ads started blablablablabla I'm filling space. Yoloyoloyolo hipsters bad child actors I like Pepsi yum yum budget 99cents I'm going to vomit now",
      "total_reactions": 4,
      "user": "Thatsliam"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2015
      },
      "score": 3,
      "text": "The 2015 Reboot of Poltergeist is a great example of why some movies are better to be left alone. Especially when it’s a great one, such as the 1982 original horror classic, Poltergeist directed by Tobe Hooper (Texas Chainsaw Massacre) and produced by the iconic Steven Spielberg (Jurassic Park, Jaws, Indian Jones).",
      "total_reactions": 1,
      "user": "ReysonPoint"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2016
      },
      "score": 3,
      "text": "The remake to the classic horror film continues recent trends of remakes in that is hard to match or even come close to the originals. With poor performances and scenes the \"the horror film\" is a disastrous attempt to replicate the raw of the classic film.",
      "total_reactions": 1,
      "user": "geo333"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "The basics are the same as the original: a happy family moves into a new house where the youngest is held captive by angry spirits. This time, the uncanny occurrences are ramped up, aided by computer generated effects and heavy-handed music. The family's plight is compelling (thanks to warm performances from Sam Rockwell, Rosemarie DeWitt and the kids) and there are lots of creepy surprises. There are even a few minor scares, even though the ending is more a noisy spectacle than a fright. It's not genuinely scary, but sometimes slightly suspenseful and mildly entertaining.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2015
      },
      "score": 4,
      "text": "The most pressing question that you ask yourself while watching Poltergeist is simply \"why?\". It seems redundant to remake a film in such a pedestrian manner when the original was just so...well, original! The cast do their best but they are fighting a losing battle, and the effects seem decidedly low rent",
      "total_reactions": 0,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2015
      },
      "score": 4,
      "text": "The original is one of my favorite film of all time, and I was looking forward to this reboot for quite a while...can they bring something new to the table? The answer is no. It's a remake that makes Poltergeist a pedestrian film. Every changes that they made were for the worst, and sure there were jump scares, but there aren't any in the scale of the original. It's hard to eclipse film makers at the height of their powers, namely Spielberg and Hooper, even more than 3 decades ago...a pointless remake in the end.",
      "total_reactions": 0,
      "user": "dharma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2015
      },
      "score": 2,
      "text": "What is going on?!!! Sam Raimi & Rob Tapert knows everyone loves Evil Dead, the classics with Bruce Campbell not the ultra-crud remake, so why do they produce dross like this knowing full well it is not what we want. Don't bother with this movie, that is the only way to send the message...and remember, YOU are making history!",
      "total_reactions": 0,
      "user": "Amigian"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "Poltergeist is not a very scary film and yet at times it is filmed well in making a scene tense. But when you have cheap thrills, mediocre effects and  below average acting, the result isn't very good.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "Weak, predictable and emotionless and moreover not even scare, this 1982 remake of the classic was far below what I really expected, poor Spielberg tried to repeat the formula of success and failed miserably.",
      "total_reactions": 0,
      "user": "Iky009"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "I honestly don't get all the gripe this movie got. Don't get me wrong, I still think the original was better (for its time) but I also feel the modern take was almost as good and that its only real problem is that it is a remake. If the original didn't exist, this movie would have been received better.",
      "total_reactions": 0,
      "user": "Rox22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2015
      },
      "score": 5,
      "text": "Would have been a better film if it was an original.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2015
      },
      "score": 5,
      "text": "I'm not against remakes, but when you make the exact same movie again without anything new then why waste the time and money.  I give you Poltergeist. C",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2015
      },
      "score": 4,
      "text": "Oh what a difference 30 years makes. The Poltergeist remake is almost 25 minutes shorter than the original, as though todays audiences didn't have the attention spans to get some character development before the jump scares and special effects kick in. Sam Rockwell and Rosemarie DeWitt are excellent actors, but they're given slivers of character to work with in sacrifice of the next plot point that has to be rushed to. LIke the recent remakes of Carrie or Robocop, they're not bad movies, just absolutely unnecessary.",
      "total_reactions": 0,
      "user": "jamess"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2015
      },
      "score": 5,
      "text": "Some interesting effects but other than that it really fails to live up to the original. Fans of the first one should watch this as well though, for the amusement alone.",
      "total_reactions": 0,
      "user": "madmax17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2015
      },
      "score": 9,
      "text": "This new poltergeist is effective... decent remake of the 80's version, is not as good as the original but still is frightening, creepy and certainly atmospheric. Better than i expected... very good performances specially Sam Rockwell as Erick and Jared Harris as Carrigan. The film have some bugs like the Terrible effects \"VFX\" , but still very well .. very entertaining. Out of the aspects we already knew in the 80's version shows us a new vision of one new state .. what is here what is not here. Very creepy and especially the clown attack scene..... really enjoy it.",
      "total_reactions": 0,
      "user": "skadosmen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "I a being very generous with a rating of six out of ten for several good reasons, my review is broken into good aspects and bad aspects.",
      "total_reactions": 0,
      "user": "Xerogamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2016
      },
      "score": 4,
      "text": "Poltergeist settles to be a by-the-numbers horror flick when it could have been so much more; the above average first two acts are followed by blown out action in the end which isn't scary or the slightest bit creepy.",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2015
      },
      "score": 3,
      "text": "The cast is good, the girl is a cute, the boy is ok, daddy and mom are perfect and everybody is wasted on this movie. This movie is a big lesson for all movie makers: don't remake classics again!",
      "total_reactions": 0,
      "user": "MXMXVRGMS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "If there's one thing this film remade is the story, we do not have a background of the characters like why did they move there or why they lost their jobs the script has zero explanation. This remake uses way to much cgi, it did empress me and it's unique but what made the original fun is it's cheesy old-fashioned 80's special effects I think if this remake could make it similar. Director Gil Kenan's direction is just slick if his visuals were close to Hooper's vision could made it work. Since Sam Raimi produced the film, I thought this movie was going to be gruesome but the movie is bland and if this was \"bloodier\" then it might of been fun to watch.The acting was good, the cgi was impressive but watch the original series. Positives: the film is scary and it's entertaining, the film was watch able it tries to be a cheesy B+ movie like in the original, but if you have good screenwriters and a proper director this might have been good. Let's talk about the closet what makes that scene good is it is mysterious and does show that under world in this modern remake it does show the world in a good way. The actress Kennedi Clements was good, but she was not good like Heather O'rourke. The characters names are changed? Really. The film was scary it made me laugh it made me entertained through out it was exciting. Grade C+",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2015
      },
      "score": 3,
      "text": "Just a bunch of predictable jump-scares i wasnt expecting much but even so i still was disappointed",
      "total_reactions": 0,
      "user": "Koperjanek"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2015
      },
      "score": 3,
      "text": "I'm scared. Just a bit. Then, I realized watching marathon of walkthrough video games on Youtube is scarier than this one single remake movie. I adore the creepiness of this movie but it's not scary. I think the screenplay was trying to be like Insidious, that makes me feel common thing this day. Well, I appreciate they're not doing any sanatic. I enjoyed the movie to the end.",
      "total_reactions": 0,
      "user": "RoraEst"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2015
      },
      "score": 3,
      "text": "Poltergeist is a remake of the 1982 film of the same name. I didn't have high hopes for this film from the beginning because Steven Spielberg is not involved after having a significant impact on the first film. I don't think anyone was asking for this movie because even the original film has grown old and doesn't seem as relevant as other horror films that are considered \"classic\". The 2015 version relies too much on the original and does not try to create its own legacy. Many scenes in the film are almost exactly the same. There are several cheap jump scares but none that make the film memorable. Sam Rockwell's performance was way to good for the film and this remake is not doing the original any favors.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "Dont see this movie, watch the original. Its farcical, the effects are laughable, unless of course you like cheap looking 3D zombie effects and children being rag dolled all over the place. Filled with jump scares, this move was as far from the horror Genre you can get without getting into Rod Stewards dressing room. One particular scene with the shadows was creepy, and may have saved the film from a negative review from me, but overall, it was a major disappointment, dont waste your money.",
      "total_reactions": 0,
      "user": "Unladenswallow0"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2016
      },
      "score": 5,
      "text": "I'm not sure why they found it necessary to remake this classic award winning horror film. I mean, I will admit this remake has its spooky, creepy and scary moments and the kids are quite good (I especially liked Kyle Catlett in the role of Griffin). Unfortunately, about two thirds of the way through, this film just veers off into the world of modern horror films and becomes nothing more than a mimic of the \"Insidious\" franchise, just to name a few.",
      "total_reactions": 0,
      "user": "WJS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2015
      },
      "score": 4,
      "text": "\"Poltergeist\" 10 Scale Rating: 4.5 (Mediocre) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "I never liked the original so the remake is a disappointing as it. If comedy is barely present in the new movie, horror is bigger, thanks to special effects and scary moments with a more real touch. Details of the supernatural world are amazing and Madison is a quite charming character so it kinda helps you getting involved with the story. The major problems of Poltergeist are in the script, which is told on screen in a rush and it's annoying to watch how things happen so fast, with such a poor development of characters. If you are a horror fan, you can have a few scary moments here but nothing unforgetable. If you watched the original of 1982, you might be surprised with the speed of events but you might be more scared too. It's your choice.",
      "total_reactions": 0,
      "user": "danipp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "The film is like more of the same.Watched the classic and comparing it to the remake is really really the same but  it has some changes making it predictable for people who watched the classic.The jump scares scared me once but the more the jump scares the more the movie isn't scary.The movie isn't bad but it is just not as good as the original.For those people who didn't watched the classic Poltergeist the may love the film but the those people who have watched it may feel like it is the same movie but not good as the classic.",
      "total_reactions": 0,
      "user": "JohnKristofer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "It's here... and it sucks",
      "total_reactions": 0,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2015
      },
      "score": 1,
      "text": "Two good things about this film : Sam Rockwell and Sam Rockwell. For the rest, this a shame to the original one. The movie is basically a short mess of laughably bad CGI.",
      "total_reactions": 0,
      "user": "Urbanlistener"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2015
      },
      "score": 2,
      "text": "Went into the theater not trying to compare it to the 1982 Poltergeist which ended up not being difficult because it was horrible. As a horror movie I would hope to feel uneasy or jump a few times, the parts that were supposed to be scary were so poorly acted the thrill was lost. A smear of comedy was about the only thing that made the 1h and 33min movie bearable. Boring. Dull. Acting was crap. Meh.",
      "total_reactions": 0,
      "user": "Sanastusa"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2015
      },
      "score": 2,
      "text": "If you haven't seen the original Poltergeist movie please, watch it. This remake is a horrible \"copy\" of the original which, is byfar one of the best ghost/fictional poltergeist movies ever made, besides the original movie called, Enity which is based on a true story. If you have seen the original Poltergeist movie, I will guarantee that this remake will not be worth your time to watch. Personally, I recommend EVERYONE to watch the original. I almost spent double the price to watch this in 3D and, I'm glad that I didnt.",
      "total_reactions": 0,
      "user": "LRBJR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 3,
      "text": "Though there were a few points where I cringed in suspense, I was more scared by the previews than the film itself. The parts meant to be \"scary\", weren't directed well. I understand it's hard to make a decent horror film, and a movie is only as good as it's worst actor. Overall, this was a decent movie. I probably wouldn't watch it again, but if you're scared easily and don't want to have a heart attack, this movies for you. 3/10",
      "total_reactions": 0,
      "user": "ReapingCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2015
      },
      "score": 2,
      "text": "This is probably the most ridiculous horror film I have ever seen. It's filled with nonsense cliches and lacks structure and logic. All the intended jumpscares were predictable and there was no gloomy atmosphere at all. The acting is quite poor, too. If there's at least some little thing to give a quiet applause for, it's the decent creativity with the cameras. I kinda felt bad for laughing for the whole time, but it really works better as parody than horror.",
      "total_reactions": 0,
      "user": "vuljami"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2015
      },
      "score": 1,
      "text": "Horrific remake and an even worse film. The main problem with Poltergeist (1982) is... everything. The special effects come out of my video game console, the acting seems mostly cardboard throughout the entire thing and the dialogue is just... awful. It's not remotely believable. They keynotes and highlights of the original are quickly rushed into the audience's spotlight and are given nowhere near as much significance as the original. The composition on the film's score is just atrocious - I feel someone dub-step Youtuber could have done a much better job. Avoid this film.",
      "total_reactions": 0,
      "user": "Jaxspazz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2015
      },
      "score": 1,
      "text": "This remake is exactly what I thought it would be. And that is bad. This is bad as a stand alone movie and a remake.",
      "total_reactions": 0,
      "user": "RobertOBrien"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2015
      },
      "score": 2,
      "text": "Couldn't watch it until the end, may be a good movie, but I doubt it...",
      "total_reactions": 0,
      "user": "Digipunk-X"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2015
      },
      "score": 9,
      "text": "I find the original version scarier, but the latest Poltergeist is worth the watch.",
      "total_reactions": 0,
      "user": "sexyanne"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2015
      },
      "score": 5,
      "text": "Ok movie on it's own. Terrible remake. All of the characters (even the secondary ones)  are blah or have no development. The modernization of the movie doesn't translate for better scares. It just makes it very predictable and hokey.  The plot is rushed and the story never really develops.  The get in the house and almost immediately are neck deep in ghosts.  I thought the best thing about the movie were the special effects and a very good twist creating scenes in the world of the dead.",
      "total_reactions": 0,
      "user": "VWilliams247"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2016
      },
      "score": 2,
      "text": "Whatever the original Poltergeist did outstanding, this Poltergeist comes to screw the original up to pieces and whine about more money to generate another remake popping out of our eyes.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2016
      },
      "score": 4,
      "text": "Bahhhh, muy floja esta película, pues al ser un remake de una película de culto de terror de los ochenta, no logra ni igualar a su predecesora, busca modernizar un poco la cinta a los tiempos actuales pero se queda ahí, y le quita un poco el encanto del cine de antaño.",
      "total_reactions": 0,
      "user": "raultrivino"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "3.6, seriously?! The original sucked. It was cheesy and the effects are awful. This is such a huge improvement and I love this film. It at least deserves a 6.5. Watch the film, love it, and people need to stop comparing it to the old film because it's got new elements and Sam Rami did a great job with it",
      "total_reactions": 0,
      "user": "calebowensmall"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "When this first came out last year, I refused to watch it at the cinema because of the atrocious reviews it received.  Now after watching it on Netflix I realized that I should never listen to reviews.  I cannot understand why it gathered the hate that it did, I loved it.",
      "total_reactions": 0,
      "user": "broyds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2016
      },
      "score": 7,
      "text": "Overall it was FINE movie. Very enjoyable.",
      "total_reactions": 0,
      "user": "MarioGR"
    }
  ]
}