{
  "avg_user_score": 5.3,
  "metascore": 47,
  "mixed_rating_frequency": 45,
  "movie_name": "Project Almanac",
  "negative_rating_frequency": 38,
  "positive_rating_frequency": 54,
  "pro_critic_reviews": [
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2015
      },
      "score": 75,
      "summary": "All of the young actors are committed, and director Dean Israelite has a good handle on the material, offering his own contributions to the time travel genre (like how violent the act itself is) while continually tipping his hat to what came before it."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2015
      },
      "score": 70,
      "summary": "On the whole, this is a good B-movie that hits it modest marks."
    },
    {
      "critic": "William Goss",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 67,
      "summary": "Despite the film’s largely hectic point-of-view, first-time helmer Dean Israelite credibly establishes a science-positive environment that ultimately results in less-than-intelligent displays of teenage impulsiveness, and the kids have a believably determined camaraderie as they only ever use the device together to get revenge on bullies, win the lottery, and snag backstage passes at Lollapalooza."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2015
      },
      "score": 63,
      "summary": "One of the advantages of time travel in a found-footage film is that it makes the chronology and causality so confusing that the problem of who’s shooting what becomes secondary. On the other hand, it doesn’t allow fast-forwarding through all the boring bits. For starters, I could have done with far less Lollapalooza."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2015
      },
      "score": 63,
      "summary": "Clever, funny but emotionally stunted. Like most teenagers."
    },
    {
      "critic": "Julia Alexander",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 60,
      "summary": "With references to other sci-fi films, however, it's obvious Project Almanac is aware of its genre clichés, strengths, and faults, and that makes for a genuinely fun time for film buffs."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2015
      },
      "score": 60,
      "summary": "Every generation gets the time travel it deserves. Project Almanac isn’t “Time After Time” (1979) or “Back to the Future” (1985) or “12 Monkeys” (1996), but the new release does turn out to be a surprisingly jaunty trip for jaded Gen-Y kids."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2015
      },
      "score": 60,
      "summary": "Despite the uncomfortable sexism and altogether predictable nature of the film, I’d be lying if I said it wasn’t modestly entertaining."
    },
    {
      "critic": "James Rocchi",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2015
      },
      "score": 60,
      "summary": "Even with all the teen angst and temporal alterations, the film stays fleet, funny and fast, especially as our leads figure out, through trial and error, how they can take advantage of their new abilities in ways large and small."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 58,
      "summary": "As a time-travel movie, Project Almanac pays fast and loose with its own fantastical rules, contradicting itself constantly."
    },
    {
      "critic": "David Hiltbrand",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "The premise, which initially has a certain interior logic, grows implausible and then nonsensical."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "Call Project Almanac a \"shaky-cam special\", and it's a damn shame. The resultant production, both shaken and stirred, transforms a potentially entertaining pulp time travel story into a misbegotten exercise in frustration."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 50,
      "summary": "If Project Almanac didn’t bungle it all with a shrug of an ending, it would be easier to recommend. Maybe someone with a time machine should go back and give the movie a do-over."
    },
    {
      "critic": "Susan Wloszczyna",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 50,
      "summary": "It’s enough to make H.G. Wells roll his eyes as he rolls in his grave."
    },
    {
      "critic": "Nicolas Rapold",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2015
      },
      "score": 50,
      "summary": "The wish fulfillment of time travel tends to be fun to watch, and the director, Dean Israelite, feeds on the friends’ giddy escapades for a while."
    },
    {
      "critic": "Thomas Lee",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2015
      },
      "score": 50,
      "summary": "High on fun but low on depth, Project Almanac is told entirely from the perspective of a video camera, which instantly made me regret that I had eaten dinner before the screening."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2015
      },
      "score": 50,
      "summary": "I know this is a teen-boy fantasy — it was produced by Michael Bay, after all — but the female characters in Project Almanac are lamely retro, little more than props in short shorts."
    },
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "The trouble with Dean Israelite’s film is that it’s far more excited about the shallow possibilities of cheating the fourth dimension than the infinitely scarier ones of messing it all up."
    },
    {
      "critic": "Martin Tsai",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2015
      },
      "score": 40,
      "summary": "With \"Looper\" and the fantastic recent release \"Predestination\" using the same plot device to explore existentialism, the potboiler Project Almanac feels like a leap backward."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2015
      },
      "score": 40,
      "summary": "Begins as a marginally fun diversion before proving to have nearly no interest in the possibilities of its premise."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2015
      },
      "score": 40,
      "summary": "Evaluated on the concept’s own terms, the script clearly could have used another do-over or two before Israelite and his cast took the plunge."
    },
    {
      "critic": "Brad Wheeler",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2015
      },
      "score": 38,
      "summary": "A Michael Bay-branded time-travel fiasco, made for teens and seemingly by them, too."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2015
      },
      "score": 38,
      "summary": "What was once fresh and innovative now is tired and overdone."
    },
    {
      "critic": "Simon Abrams",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2015
      },
      "score": 30,
      "summary": "Project Almanac could have been fun, but its creators don't seem to know what fun looks like."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2015
      },
      "score": 25,
      "summary": "The film delivers the same misogynistic, faux-modernistic jolts of trashy humor and labored plotting that typify the work of co-producer Michael Bay."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2015
      },
      "score": 4,
      "text": "Although I do respect that this film does acknowledge computer/electronic terminology, but this film is not great. Get ready for plot holes, a corny love story, extended periods of uselessness, and an ending that makes no sense at all. If you're expecting something like Back To The Future or Donnie Darko, this is not the film for you.",
      "total_reactions": 1,
      "user": "CMovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2016
      },
      "score": 1,
      "text": "The concept was pretty neat, but the execution was pretty dumb.",
      "total_reactions": 1,
      "user": "Mitchy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2016
      },
      "score": 1,
      "text": "Thoroughly un-enjoyable, the shaky camera style made it unbearable and confusing to watch, leave it in paranormal activity. Also plot-holes, supposedly he was attractive but my eyes beg to differ. The only mildly enjoyable part was watching the protagonists life fall apart as he finally got what he deserved, for wasting my time and hard-earned money on this so called 'movie'.",
      "total_reactions": 1,
      "user": "MaeWard"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2016
      },
      "score": 1,
      "text": "One word: Awful. There was no plot throughout instead, it was about a group of teenagers who struggled to use a simple camera and the shaky experience was more irritating than enjoyable. The nightmare continued when the protagonists also had no idea what was happening, similarly to the audience. The only enjoyable aspect of the film was when the credits appeared and the torment had finally come to an end.",
      "total_reactions": 1,
      "user": "SophieW"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2015
      },
      "score": 4,
      "text": "It's just not so hot - a wasted opportunity, really.  With such well-worn territory, you have to put your unique spin on it, but this movie really doesn't offer anything close.  I mean, Bill & Ted's Bogus Journey does a far better job of exploring the parameters of time travel. And the romance between the lead character and his crush is so tepid.  This is the second found footage movie I've seen in a year that has been insufficient (the other was the tornado flick - can't remember the name.)",
      "total_reactions": 7,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2015
      },
      "score": 3,
      "text": "A group of college students build a time machine and use it for things so petty and pointless you worry they have no imagination whatsoever. Stealing from every time travel movie ever made and falling short of all of them this will only appeal to 18 year old drunk kids on a Saturday night. The found footage concept is so badly utilised here that you start to think the filmmakers had given up on it half way through",
      "total_reactions": 7,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2015
      },
      "score": 0,
      "text": "Project Almanac is angsty technobabble for the first 40 minutes. The rest of the movie is a poorly written crap. The whole \"amateur found footage shaky cam\" thing is just annoying and beyond played out. The visual effects are boring when there are any. I am not left not caring about anyone in this movie.",
      "total_reactions": 3,
      "user": "Tugboat"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "No visual effects in this movie. The movie is boring.  Feels like an anti sci fi film...the story is lame and predictable.  The trailer is much better than the film.  These kids do nothing interesting with their time travel technology only really lame, super lame things.",
      "total_reactions": 3,
      "user": "evearcher"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "A lot of wasted opportunity, that said I still liked the movie and the unknown actors!  One thing that was annoying though was the way it was filmed-similar to Cloverfield and Blair Witch Project.  There are a lot of reasons most won't like it, but again I think the film still has merit and left you with a lot to think about.",
      "total_reactions": 3,
      "user": "horizonbts"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2015
      },
      "score": 0,
      "text": "Kids on crack (i.e. \"brilliant\" American high-school students) jumps around like monkeys and builds a time machine basically by invention of connecting cables between a device, a battery and hydrogen. Way to intelligent for most people to understand, you need at least triple PhD in physics. Silly uninspired love story makes everything go to hell, not the other changes to the past. Annoying footage as hell. If you missed it between the lines, stupid garbage.",
      "total_reactions": 3,
      "user": "Idiota150"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "I have been looking forward to this movie for a while seeing as i am a fan of time travel movies, but i feel that the potential here was wasted. The first half of the movie was enough to keep me entertained, and when multiple jumps were involved it started to add more depth to the film, unfortunately this bountiful story-line was cancelled out by a rushed ending that solved nothing and allowed the film to end with a cheesy line, completely ignoring all of the twists and turns that the movie brought up.",
      "total_reactions": 5,
      "user": "Filmwatcher123"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2015
      },
      "score": 3,
      "text": "Didn't realize this was found footage. Lost all hope when MTV films appeared at the start. Pointless highlighting everything wrong with this movie. The sister who was mostly behind the camera was way under used. They should should have had someone less easy on the eye behind the camera (like one of the friends). The science speak is completely nonsensical. They string together big sciencey sounding words with the hope of making it sound credible. Super predicable too. Thank a poor script for that. Acting was also sub-par. Laughed every time they almost cut each other off between lines. Stay away from this one.",
      "total_reactions": 4,
      "user": "ozymandias79"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 2,
      "text": "this movie is wretched. it has bland uninteresting characters, a week plot that has a million plot holes and has no reason to be a found footage movie. this story was so boring nothing happens and i couldn't have cared less about the characters and the ending was so bad i can't believe that there wasn't a rewrite. the only good point was the acting wasn't too bad but that's about it",
      "total_reactions": 4,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2015
      },
      "score": 3,
      "text": "I gave this movie a chance since I like time traveling movies. But the second a love story pop up I knew how the rest of the movie was gonna flow. They could of done something sweet with this college kids stumble on time travel concept, but it devolves into the standard teenage love story, only with time travel. If you want something on in the background while you're doing something else this is your movie.",
      "total_reactions": 2,
      "user": "GundamMars"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "This movie could have been Chronicle-level great if they just stuck to light fun stuff and avoided the complex time-travel stuff. So many things happened that made no sense like why did he have to go to his birthday to stop the time travel instead of stopping it before he found it earlier in the movie. I also dont understand that last scene with his father. Also the end made no sense with the 2 cameras and all. Overall, a lot of plot holes and confusing plotlines. Terrible but could have been really good.",
      "total_reactions": 2,
      "user": "chidime"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2016
      },
      "score": 0,
      "text": "Kiddie movie about time travel with teenagers who cant do anything right. Its completely uninteresting. No humor, no action, really bad plot, and a horrible premise. This is yet another dumb genius movie brought to us by a clueless writer and director. At some point they need to realize just how insulting such characterizations are to real smart people and that nailing this into the minds of the young and uneducated is absolutely not good for society. At the very least, make this a comedy like Back to the Future but no... this is just a monotonous mess. Teens discover a way to time travel... and like any brain dead moron, what do they do? Send themselves despite many failed experiments that proved how dangerous the attempt is to make. And what do they do with the time travel? Well of course... the most important thing in life is to go back to high school and humiliate a bully who picked on you... and go watch a decade old concert.",
      "total_reactions": 2,
      "user": "marc5477"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "this would have been a good movie if it was not in a \"found footage\" format as it basically makes you nauseous for 90% of the movie time.  seriously why would moviemakers think people will enjoy seeing the camera jerks for 1-2hrs?  blair witch project was a one-off which used this format well but all other copycats after it are just making the movie worse than it should be.",
      "total_reactions": 2,
      "user": "condythug"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "This movie certainly surprised me. Starting with high school kids may sound cliche, but was definitely worth watching it. How the characters seemed so real in the movie amazed me and how one mistake leads to a huge problem. This movie may show how simple it is to make a time machine, but they started almost already with a time machine. It only needed a few modifications and BAM, time travel. I could agree with others about the love story in the movie, but it wasn't a bad story. Just not a lot work put into it. What the kids did with the time machine was expected and predictable. Kids try to cheat the system and have a wonderful time partying. What can you expect? They are just mere high school kids. Don't expect them to change the world historically like saving Abe Lincoln or preventing WW2. That would just be pointless and boring. I do recommend this movie to young adults and above because it really is a good movie.",
      "total_reactions": 2,
      "user": "PoorManStanding"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Good story, good acting, no yawns.  I left the theater happy and thinking about the plot.   That is all I can expect from a movie.  If you like science fiction and the fantasy of time travel you might like this one.",
      "total_reactions": 7,
      "user": "ajs101"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "For the life of me I cannot understand why so many users and critics are hating this movie. This was in every way shape and form fantastic. The young cast was excellent, the script was excellently written, and it is one of the few movies I have ever seen that actually uses found footage the right way. I highly recommend this movie.",
      "total_reactions": 5,
      "user": "mrmonster"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "This movie is basically steins gate but worse in every way, however steins gate is an anime so people are most likely to fixated on preconceived notions of anime.",
      "total_reactions": 3,
      "user": "killzon32"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "I'm not a Michael Bay hater, but this movie was just okay. I was interested in the movie after seeing the trailer but the beginning and the end just weren't what I had hoped. However I'm sure lots of people will enjoy the movie. Its not a bad movie. I didn't have big expectations for the teenage cast at first but in the end they won me over. There were some parts of the film that I really enjoyed but the ending got a little to complex for my liking.",
      "total_reactions": 3,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "I believe that this is a good movie. The story was well written considering the fact that nobody here on Earth knows nothing about time travel and what it could be like to actually do it. So, the version that they planted it into the movie is a reason well enough to watch the movie and ask yourself the big question: What if it is like that. The special effects were a little lame, okay maybe decent but good. I only had one problem actually, and that is with the casting crew. These actors portrayed as high-school kids were kinda newbies here... That is it, folks.",
      "total_reactions": 3,
      "user": "moviecube"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 1,
      "text": "Project Almanac had an unsatisfying payoff, camera shots that are ripped straight out of Blair Witch Project and horrible acting. It's a badder version of Chronicle. The effects are good though.",
      "total_reactions": 7,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "While the film doesn't explore the possibilities that it should've and the found footage film style did live me nauseous on a couple occasions, Project Almanac is a decently entertaining movie that will relatively satisfy.",
      "total_reactions": 4,
      "user": "WheelzFourReelz"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "Project Almanac was a captivating movie.  The casting was good.  However, there were many major flaws.  The filming was terrible with the camera shaking the whole movie.  It was also very predictable, with  foreshadowing every major event.  The major reason why I disliked this movie is because of a huuuuge flaw in logic.  In the last ten minutes of the movie, the protagonist uses the time machine to go back in time.  While in the past, the protagonist meets his father and DESTROYS THE TIME MACHINE.  A normal person watched this and thinks the whole problem is over.  However, this creates a time paradox.  With the time machine destroyed before the protagonist can discover it, the protagonist never finds the time machine.  With him never finding the time machine, he never goes back in time to destroy the time machine.  With the time machine not being destroyed, the protagonist finds the machine, follows the story line, and destroys the time machine.",
      "total_reactions": 4,
      "user": "culver_eagles"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "An interesting study in the collateral effects of time travel and how an immature, love-struck teen makes all the wrong decisions for what he thinks are the right reasons. As interesting as it may be, it suffers from the same problem that all back-to-the-past time travel treatments do - it oversimplifies time-travel as a linear trope, and that will always lead to a disappointing story in the end.",
      "total_reactions": 1,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "The beginning bit where they were first messing around with time travel and trying to do things for selfish reason, is actually pretty funny, I genuinely enjoyed it.",
      "total_reactions": 1,
      "user": "Chaeote"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "This is a very good movie to see without ambition. It just a good plot with a very nice acting work and keep up tense until the end of the story. The only advice that i could make to anyone to want to see this is: watch it with your logic off... And you will enjoy it",
      "total_reactions": 2,
      "user": "espaciosalter20"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "What you expect from an MTV film that also involves time travel.  The film isn't all bad, but you'd think there would be cooler things to do than go to a concert.  C+",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "Absolutely wonderful movie.  It's well-paced with a unique take on time travel.  It also has a really satisfying conclusion, unlike most other movies of its kind.  Don't listen to all the other whiner nay-sayers.  Read absolutely nothing about the plot and watch it.  You won't be disappointed.",
      "total_reactions": 1,
      "user": "ClanPsi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "Well, it's not a bad movie. It's just the typical teenager drama that we see in every movie for teenagers, but combined with time travel which makes it somewhat cooler and different. It's nothing that's going to blow you away...",
      "total_reactions": 1,
      "user": "Dokalu"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "For once a movie produce by Michael Bay that didn't turn out to by the biggest stink pile of the year to my surprise.",
      "total_reactions": 1,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "So this movie is about a group of five high school kids, one who is the future of the MIT physics department (trust me the kid is crazy smart), that discover lost blueprints for a time machine the main character, David's, father had designed years earlier.",
      "total_reactions": 1,
      "user": "pats1212"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "Project almanac is a great movie of Time travel in that if offers a compelling story line with an intense. drama scenario that makes the film worth watching. However it has it flaws,but it gets undone by it's successes.",
      "total_reactions": 2,
      "user": "geo333"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2015
      },
      "score": 7,
      "text": "Surprisingly good movie. The story and the acting was great.",
      "total_reactions": 1,
      "user": "jigsmode31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Even though \"Project Almanac\"  has undeveloped characters and some issues, but this movie has entertaining effects mind blowing slow motion sequences. The cast for this film is a mild bad actors provided by producer Micheal Bay. Director Dean Israelite's vision and journey for this film is mind blowing and groundbreaking story. Grade B+",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "Movie had a lot of potential it didn't follow through with. Some plot holes but overall enjoyable. Would of liked it more it wasn't shot entirely in the \"found footage\" genre. They could have had both p.o.v's like a still cam too...",
      "total_reactions": 0,
      "user": "kaosnklutter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "This movie, in my opinion, is massively underrated. I can understand why some people may not like the movie, but I, despite knowing the flaws, enjoyed this movie. The visual effects are wonderful and realistic, as tape from cameras doesn't always come out picture perfect, and there will be glitches, and the fact that they made the camera glitch when the time machine made the magnetic field right before it transported people was very realistic in my opinion.",
      "total_reactions": 0,
      "user": "Scout523"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2016
      },
      "score": 6,
      "text": "Generally enjoyable. It takes a while to actually get going in my opinion but when it does it is quite good. Weirdly though in the end I didn't come away satisfied. I have no problem with the story as what happens is very believable. But still, I can't really recommend it to anyone unless they really like time travel",
      "total_reactions": 0,
      "user": "KleverViper"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2016
      },
      "score": 3,
      "text": "This film is not only full of plot holes but is also one of the worst of 2015. A awful love story and below average acting meets found footage format which as we have seen in many movie's the who found footage thing never works out. The plot is so cliche but what these kids were good at doing is acting like how normal teenagers would if they found out about a time travel device. There is a bunch of awful dialogue in the movie and a concert scene that goes on for far too long. I had low hopes going into this movie but I walked out disappointed. Such a shame",
      "total_reactions": 0,
      "user": "nahtan1244"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "I'll admit that for the first 15 minutes I hated it, and that was all due to the camera work. This is a found footage movie and it shows the shaky cam moments are irritating and some of the more adventurous angles are awkward and detract from the experience.",
      "total_reactions": 0,
      "user": "iamthewalrus26"
    }
  ]
}