{
  "mc_avg_user_score": 6.5,
  "mc_metascore": 50,
  "mc_mixed_rating_frequency": 11,
  "mc_movie_name": "Prom",
  "mc_negative_rating_frequency": 4,
  "mc_positive_rating_frequency": 17,
  "mc_pro_critic_reviews": [
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2011
      },
      "score": 80,
      "summary": "A highly entertaining original movie that's funny, touching and real."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "Will Miss Perfect fall for the Leader of the Pack? It helps that he's played by Thomas McDonell, who's not only a dead ringer for the young Johnny Depp but also has a comparable charisma."
    },
    {
      "critic": "Ella Taylor",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 70,
      "summary": "A good-hearted, perfectly watchable bonbon."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 70,
      "summary": "There are new tweeners every year. To them, the characters and plot devices in this perfectly competent film might well seem fresh."
    },
    {
      "critic": "Michelle Orange",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 70,
      "summary": "Prom has sweetness, nonthreatening conflict, and enough personality to distance it from the chilling anodyne of Disney's television vehicles."
    },
    {
      "critic": "Kirk Honeycutt",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2011
      },
      "score": 70,
      "summary": "The movie has a cheerful good nature and a solid cast of youngsters - including Aimee Teegarden and Thomas McDonell - but any resemblance between this and real high school is, of course, purely coincidental."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 63,
      "summary": "A predictable but painless pastiche of high school drama clichés that will give its intended tween audience a lot to squeal about -- and leave their parents reminiscing quietly about how good films from '80s icon John Hughes were."
    },
    {
      "critic": "Tom Horgen",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 63,
      "summary": "A fairy-tale teenage romantic comedy that makes \"The Breakfast Club\" look edgy. And that's just fine, because this Disney product does straight-laced fairly well."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 63,
      "summary": "The cast's newcomers mix and mingle with ease with the hardened alums of Disney and Nickelodeon TV series."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 63,
      "summary": "Prom has its modest delights, chiefly its young cast."
    },
    {
      "critic": "Brian Lowry",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2011
      },
      "score": 60,
      "summary": "An adorable cast ought to provide some appeal for tweens and tykes, though interest should gradually dwindle the closer one gets to actual prom-going age."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2011
      },
      "score": 60,
      "summary": "Fortunately, Teegarden and McDonell make up for the hand-me-down plotting with a sweet, unaffected chemistry."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2011
      },
      "score": 60,
      "summary": "Katie Wech's script is a carousel of reassuringly familiar plot lines, kept smoothly revolving."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "Some movies are in-between and inoffensive and harm absolutely no one. Prom is one of those."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "So strenuously inoffensive it makes Disney's \"High School Musical\" look almost racy by comparison."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "More interestingly, it's also kind of sweet in a contrived and fumbling first-kiss sort of way."
    },
    {
      "critic": "Sandie Angulo Chen",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "Nor will you find much excitement, tension or resemblance to actual teen culture in this whitewash of the quintessential rite of passage."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "That Prom plays as pleasantly and inoffensively as it does is due to the performances, particularly McDonell as the rebellious Jesse."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "Disney's Prom is to real high school what \"High School Musical\" was to \"West Side Story\" – all fluff, no edge."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 42,
      "summary": "It's the sort of film Robert Altman might have made if he cut his teeth working for The Disney Channel."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 40,
      "summary": "A movie that's so anachronistically mushy and awkward, it earns extra credit simply for being so innocent."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 38,
      "summary": "Here's a by-the-playbook movie if ever there was one."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 30,
      "summary": "A would-be tween-oriented hit so scrubbed and sanitized and not worthy of paying attention to that it can barely be said to exist at all."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 20,
      "summary": "These are boys and girls on their very best behavior, which doesn't sound like any prom you or I remember."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Prom, aww, pretty film. I love all the works that Disney do, and Prom is an excellent example. The trama is very funny, the characters, story, all is funny in this film.",
      "total_reactions": 1,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2011
      },
      "score": 4,
      "text": "It seems as though a writing team outlined the whole movie with plenty of characters and situations and simply forgot to add the actual writing and, more importantly, the heart.  You'd never want to see this movie a second time, like you would a John Hughes movie or even 10 Things I Hate About You or Can't Hardly Wait.  Teegarden's character is so flat through so much of the movie, only to open up a bit at the very end. And her parents??  Hank from Breaking Bad was so underutilized, and when he does his \"bad thing\", the wife has no reaction.  She can either be pissed or supportive, but she can't do nothing!  It's a cop out. Small point, but come on!",
      "total_reactions": 2,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "This was a great movie. This movie is a great family disney film its an instant classic i loved it",
      "total_reactions": 1,
      "user": "jordyboy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "Love this move it was a bit corny and predictable at times but it was a really good movie. Danielle Campbell was Simone Danielles and i think she did an amazing job at her role i also liked Nolan Sotillo as Lucas Arnaz and Cameron Monaghan as Corey Doyle they were nerdy but funny. I also liked the whole not being able to get a date to prom with Llyod (Nicholas Braun ) and as well i like the whole main story with Nova Prescott (Aimee Teegarden) a goodie two shoes who ends up falling for bad boy Jesse Richter(Thomas McDonell ) who turns out to be not so bad after all im not gonna say any mire but i giv it a good 9 out of 10 because i really enjoyed it so i recomend it to all you teenagers out tere take a date to it go out and enjoy thanks.",
      "total_reactions": 1,
      "user": "dubhead234"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "this movie was awsome it  made me really happy i eould defintily recommened it to couples and teens because im a teenager and i say it and i thought it was awsome so i recoomed it 100% so please go see it and enjoy it as much as i did",
      "total_reactions": 3,
      "user": "leafsfan234"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "The film itself is horrible garbage its like a full length film on Secret Life. It's lame and cliche with the dullest of dull acting. The only people that will relate to this film are people planning on going to prom within the few weeks after watching this film. However, Aimee Teegarden's performance shined brightly allowing the rest of us to somewhat enjoy the film. Her performance was so good that I would say this film gets a 2 without her but gains 5 points based strictly off her performance. Its enjoyable if you force yourself to enjoy it, as I did.",
      "total_reactions": 1,
      "user": "filmtrashreview"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 1,
      "text": "Garbage absolute garbage.  The camera man was never able to keep the camera in the same place.  The only thing worse is the story.  Unless you are a 13 year old girl avoid this movie like the sin that it is.",
      "total_reactions": 1,
      "user": "moviegrabbag"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2011
      },
      "score": 5,
      "text": "Incredible as it may sound, but the legacy of Jim Crow still insinuates itself in the rural towns of the Deep South that time forgot, perpetuated by racist holdovers from the not-so-distant past who were alive when the Brown vs. Board of Education of Topeka ruling was handed down in D.C., circa 1954. Effective immediately, cities all across America were mandated into desegregating their public schools, which represented the first major blow to the practice of state-sponsored institutionalized racism. Many hardliners were obviously not very happy, the very same people, extras, who years later came to the on-location sets of Alan Parker's \"Mississippi Burning\", uncannily prepared, toting old authentic Klan paraphernalia they had tucked away in their closets, basements, and attics, for future generations to admire. This genealogical consanguinity with familial incorrectness helps explain why there are parents of high school-aged children today who insist on two separate formal dances for the blacks and whites in boondocks such as Montgomery, Georgia and Charleston, Mississippi, just to name a few. The latter, a city in North Central Mississippi with a population about 2,198, became the subject of a Morgan Freeman-produced documentary called \"Prom Night in Mississippi\"(directed by Paul Saltzman), after the septuagenarian actor(a Charleston resident, and who was seventeen when Justice Earl Warrem read the monumental edict) offered to pay for a nonsegregated prom. To the ostracized African-American students residing in the Bible Belt, the provisions connatal to the Civil Rights Act of 1964 must seem like a joke to them, as it was to the black mob who burned their city down during the Watts Riots of 1965, as a way of dramatizing their broadening alienation from the values of middle-class America in the form of a militant-style protest. But in 2009, in Barack Obama's America, the humiliated Georgian students from Montgomery County High orchestrated no such display of civil disobedience. The young adults attended their black prom without incident. If only the real world was like a film. While the prom in \"Prom\" is worlds apart from the ideologically resolute formals that persevere in red state pockets like an unfortunate time warp, this family-friendly production smuggles in some incidental, but appropriating referential social commentary with a little \"Mississippi Burning\" of its own, when the fire that destroys the tool shed containing the school's prom decorations, just so happens to have been set(accidentally) by black(!) sweethearts, who forget to extinguish that last candle from a romantic dinner before leaving the premises. The culprits, Tyler & Jordan, are so suburban, so integrated with the predominantly white student body(like Stacey Dash in Amy Heckerling's \"Clueless\" & Jason O. Smith in Richard Linklater's \"Dazed & Confused\"), their skin color is basically a non-issue. (Likewise, Mei, the Chinese girl played by Yin Chang, probably doesn't speak a word of Mandarin.) Had there been a police investigation though, the otherness of the ebony-hued students would suddenly be foregrounded, but \"Prom\" just leaves the plot thread concerning the cause of the fire hanging, because had Tyler and Jordan been tied to the potential crime scene, the inevitable police interview would allow too much reality to seep into the filmmaker's utopian vision of a multi-ethnic high school. Had this occurred in Montgomery, there'd be the presumption of arson, and the innocent couple's counterparts would be charged with malicious intent. \"Prom\" never goes there, due in part that there is no \"there\" to go to. The diegesis is ideologically pure. Racism can't exist without the recorded history of Jim Crow. Everybody is colorblind at this school. Jim Crow never happened. When Tyler starts dating Simone, both Lucas, the girl's thunderstruck lab partner, and Jordan, the suddenly single alpha female, seem oblivious to the fact that they're on the outside looking in at an interracial couple. (Jordan comments about Simone's relative youth(she's a sophomore), not her skin color.) Alas, in the real world, people notice difference. It's human nature. In the John Hughes-produced \"Pretty in Pink\", Andie(Molly Ringwald) and Blaine(Andrew McCarthy) are the same color, and still they're talked about derisively, because they belong to different social classes. Talking about segregated proms, the film could use Long Duk Dong(Gedde Watanabe) from \"Sixteen Candles\" to add a little more racial diversity into the mix. (Look quick and you'll miss him: the token black.) \"Prom\" needs some racial diversity, too. When Tyler and Jordan are named to the royal court, the queen declines the opportunity to dance with the king, which in another film, would be a bigger point of emphasis. Tyler and Jordan, however, are not token blacks, because they're hardly black at all. It's like watching a roomful of beige people.",
      "total_reactions": 0,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "An ordinary Teen Romance ! Nothing to tell about the story , even a 5 years old can tell wats gonna happen . Nothing was amazing or awesome . But But But it was not boring . anyone can get through with it . Teegarden & McDonell;s chemistry was good .Campbell was so cute but her character was not good . she should have a better part .  No comment on Directing but if the story was more wide it would be a nice Teen-com ,",
      "total_reactions": 0,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "All the cornyness aside, this turns out to be a decent movie about prom. Despite so many different characters they all seem to get enough screen time.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "A well done Disney film for teenagers and is not like one of the unbelievable teen films of the last 20 years. The film itself is funny, realistic, and heartwarming I've never seen a film like this in the last couple of years with a sense of reallity and good clean comedy that doesn't promote drugs or alcohol at any levels.",
      "total_reactions": 0,
      "user": "Paul55donovan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "A very satisfying and watchable movie perfect for the family and friends.",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ]
}