{
  "mc_avg_user_score": 7.2,
  "mc_metascore": 70,
  "mc_mixed_rating_frequency": 89,
  "mc_movie_name": "Public Enemies",
  "mc_negative_rating_frequency": 51,
  "mc_positive_rating_frequency": 294,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "Honesty is a rare and often sought after trait in any individual, and when we see Johnny Depp portray one of the most notorious criminals in American history, we see exactly what Depression era bank robber John Dillinger was all about, upfront and straight to the point...honest.",
      "total_reactions": 3,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "The story wasn't the best, the action was great. Costume and accents where something new as I'm not a fan of the western style movies, but this was not that - it was a gangster style movie. Christian Bale did a great job for his character...",
      "total_reactions": 1,
      "user": "kingshahid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "I am not sure why this one is not more critically acclaimed honestly. Johnny Depp is fantastic here, as are Christian Bale, Marion Cotillard, and Jason Clarke. The direction from Michael Mann is great as usual and he does a great job creating great thrills and excitement here. At times, things can get drowned out in a hail of bullets, but for the most part, things are very tense and exciting. The cinematography is good, the costume design is very good, and the production design is very good. The script is also solid and gets the job done. Now, this is not the best gangster film I have seen, but it is a darn good one and a very entertaining and well done look at the last days of John Dillinger that is bolstered by great direction and acting. Overall, this one is not a great film, but is certainly a good one that did not deserve the mixed reception it received.",
      "total_reactions": 1,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "I rob banks,\" John Dillinger would sometimes say by way of introduction. It was the simple truth. That was what he did. For the 13 months between the day he escaped from prison and the night he lay dying in an alley, he robbed banks. It was his lifetime. Michael Mann's \"Public Enemies\" accepts that stark fact and refuses any temptation to soften it. Dillinger was not a nice man.",
      "total_reactions": 1,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "It's like if Leonardo Dicaprio spawned a lovely mix of Big Rigs Over the Road Racing and stuffed it into a pink guys anus. It made me so happy I went to see it, it made me play PayDay 2",
      "total_reactions": 1,
      "user": "Bethesda"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "Public Enemies is really just another forgettable Gangster movie, with the exception of Johnny Depp there really isn't very much to like about this film.",
      "total_reactions": 5,
      "user": "DyingBreed"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "Just a solid picture. Great cast. Cinematography was great. Micheal Mann has a very distinctive style and it really shows in the film.",
      "total_reactions": 2,
      "user": "j30"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2012
      },
      "score": 1,
      "text": "One of the worst cinematography I've ever seen. They cranked up the sharpen and contrast filters to 11. It is downright un-watchable on a smaller screen with the constantly moving camera and the messed up contrast. I had really hard time distinguishing between a the characters at the beginning, because you only see them for 1 or 2 seconds in dimly lit environments and the camera moves like a madman.",
      "total_reactions": 6,
      "user": "gd42"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2010
      },
      "score": 5,
      "text": "when i went to see this movie there was just something about it which made it not an enjoyable experience. the story was fine and well in sequence with the events that occurred in real life with a few changes. however there wasn't enough suspense provided especially since most people will have known what would happen. however the acting does save the movie in most points",
      "total_reactions": 2,
      "user": "Andy92"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2012
      },
      "score": 0,
      "text": "This movie isn't worthy of any score. Horrible directing. It went from weirdly quiet to loud obnoxious gun shooting. I hate it. I could have watched a decent syfy movie for 2 hours. Instead I suffered through this disaster.",
      "total_reactions": 2,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "The producers of this film would like you to think it is a modern version of the Untouchables, but anyone who has seen this film will tell you it's far from it. It's not that Public Enemies was a bad movies, but a lot of people panned it because they expected a lot more from a 100 million dollar movie, starting Johnny Depp and Christian Bale, and they have a point. The story was flawed right from the beginning because the true story behind it really wasn't that interesting. The filmmakers tried to get people to watch it, by saying that Dillinger and Purvis were comparable to Capone and Ness, but that's not true. In reality, they had almost no interaction with each other and in the movie, whenever they were together, all they did was shoot at each other. There wasn't any chemistry between them, because their supposed rivalry was a fictions element added to an otherwise true story. The film should have focused on infamous bank robber, John Dillinger, but instead it focuses on the FBI hunt for him and his life on the run, long after the bulk of his crimes had been committed. Johnny Depp portrays Dillinger in an attempt to go back to being a legitimate actor instead of a Disney puppet, and he fails miserably. This guy can be one hell of actor, when the role fits his personality, but John Dillinger does not. Depp is an emotionless mess of mumbled lines that almost completely destroy the film. Thankfully, Christian Bale was much better and far more interesting. Public Enemies had big expectations, an all-star cast, and a huge budget, but it turned out to be an average film. That's what had people so upset, because had this been an independent film, they would have been okay with it. The fact that Public Enemies was billed as the next Untouchables, but fails to deliver even a single memorable scene just destroys any credibility the film had going for it.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "I was looking forward to this because I'm a fan of both Depp and Bale (and yes; I recognized David Wenham, too!). All in all I liked the movie, but I also felt mildly disappointed. I had heard from people that \"Public Enemies\" is good, and maybe I expected too much.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2012
      },
      "score": 0,
      "text": "Some movies just seem bad right from the start and Public Enemies is one of them. The screenplay, acting, editing, music and the way the entire film was produced is idiotic. A typical gangster film with violence, horse racing and lots of death.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "In \"Public Enemies,\" stale characters are ultimately washed over by spectacular set pieces and brilliant digital aesthetics from the one and only Michael Mann.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2015
      },
      "score": 5,
      "text": "Now, I'm a sucker for anything set in the 30-50's. I just think that time period makes for great film. But this let me down a bit. There was nothing really memorable in the film that I can go back to and say \"I remember that one scene in Public Enemies where.....\". The film sort of goes from one action scene to the next with little time in-between to make you invest in, and really care about any of the characters. At the end I didn't really care who lived and who died. The final few minutes of the movie didn't have the emotional weight they should have. Nothing in the film really did. On the bright side the action and shoot-outs were pretty good though. If you're going to watch this expecting a cool action movie set during the great depression, then you'll probably like it. Just don't expect much else.",
      "total_reactions": 0,
      "user": "Patrick94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "Johnny Depp é incrível até como vilão,Christian Bale é excelente como detetive.",
      "total_reactions": 0,
      "user": "LoRevisor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "Public Enemies is really just a biography.",
      "total_reactions": 0,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "This is definitely one of Micheal Mann's most underrated movies, and here's why:",
      "total_reactions": 0,
      "user": "FelixKovac"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2016
      },
      "score": 9,
      "text": "Johnny Depp and Christian bale are good, the pacing is good, the sets and period detail are perfect.",
      "total_reactions": 0,
      "user": "choomtabi31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "A quiet, thoughful, almost dreamy meditation on violence, on work, on love and on death. It's The Insider with tommy guns.",
      "total_reactions": 0,
      "user": "avamiller21"
    }
  ]
}