{
  "mc_avg_user_score": 7.0,
  "mc_metascore": 36,
  "mc_mixed_rating_frequency": 35,
  "mc_movie_name": "Push",
  "mc_negative_rating_frequency": 28,
  "mc_positive_rating_frequency": 108,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "Watchable but basically just a rip off of The 4400 and Heroes with a much larger budget, bigger names and far less imagination and integrity. Worth watching if you have nothing better to do.",
      "total_reactions": 2,
      "user": "Sabrinna"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2013
      },
      "score": 3,
      "text": "While the action scenes are certainly flashy, the film is filled to the brim with lethargic performances, drab dialogue, and a plot line that's painfully inconsistent and short on rationality.",
      "total_reactions": 2,
      "user": "SuperheroMovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "Listen. It's not good. But it's entertaining enough.",
      "total_reactions": 1,
      "user": "johnnypollen"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2011
      },
      "score": 0,
      "text": "Is this the worst movie I've ever seen?  Probably.  I was hopelessly confused throughout.  One minute, Dakota Fanning is drunk, and the next minute, some guys are shattering people's eardrums by screeching incredibly loud.  It's just an overly strange movie with no substance whatsoever.  It's boring, stupid, and nothing but a waste of time.",
      "total_reactions": 4,
      "user": "back2schoolboo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2012
      },
      "score": 2,
      "text": "What a mess! Push is easily one of the worst action films I've ever seen! Between flat and unlikable characters to dull action, Push gets just about everything wrong. It's campy, it's silly, and painfully un-watchable. Push is much more confusing than it needs to be. In the end, it's just about a group of people trying to get a case before the \"bad guys\" get it. Put less simply, it's about people with a range of psychic abilities who are in a race against The Division (a powerful government that \"rules\" these superior beings) to find a case that contains a \"billion dollar secret.\" The plot makes much less sense on film. In specific, the plot follows a man named Nick (Chris Evans), who is just out of his teen years, and still doesn't really have a good grip on his ability (levitation). He meets a girl named Cassie (Dakota Fanning) who convinces him (sort of) to join her on a quest to find the case. Cassie herself is a \"watcher,\" someone who can see into the future. She draws what she sees, and based on what she sees, Cassie and Nick may not survive this adventure. As I mentioned previously, the plot is much more complicated on film. None of the abilities in Push are very cool, and none are very original. We get people who can levitate, people who can see into the future, people who can control your mind, etc. These are all things we've seen before. Been there, done that. The one new ability that Push has made is....screaming. Yes, believe it or not, Push's only innovative ability is the ability to scream. Granted, it's a scream that can destroy structures, people, etc., but in the end, it's just some creepy Asian guy screaming like a maniac. It's stupid and campy. And as if that wasn't bad enough, there are THREE villains with this ability. Push also doesn't know what kind of a movie it wants to be. Does it want to be a light, comedic action flick? A hard, heavy, end of the world film? Maybe an intelligent heist film? Push, unsuccessfully, attempts to do all three. As if I have to say it; this really doesn't work. The acting, though not awful, never gets much better than mediocre. And early on, the acting even seems a little clunky. As if Push isn't already bad off, it also suffers from an overwhelming number of obvious plot holes. And there is little characters development, if any. Most of the characters don't even have a definitive personality. The action scenes are usually brief, with no actual fights occurring. Just someone getting beat up, with a victor we can already predict. There are few exceptions. During the end, we get a long, action filled climax, but it's more tedious than exciting. And beware, the ending is a major cop-out. The one positive thing I can say about Push (aside from it's vaguely unique premise), is it's skilled editing. It shows snippets of future events than goes back to the past. The editing is just very well done, I'll give it that. Push is campy, tedious, cheesy, confusing, and stupid. It tries to be three different films at once, and character development is omitted entirely. Plot holes abound, action scenes are dull. Outside of camp value, Push has few redeeming qualities.",
      "total_reactions": 3,
      "user": "LandF"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2012
      },
      "score": 1,
      "text": "This is one of the dumbest movies I have ever seen, It was so dumb that I turned it off. Save yourself 2 hours of your life and don't watch this movie, the script was absolutely horrible, and the acting was bad.",
      "total_reactions": 2,
      "user": "natemedia"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "Push may not be for everyone with it's geeky government super power conspiracy plot, but if you somehow actually managed to enjoy Jumper, or you are like me and wanted to see it done better, this is a good choice.",
      "total_reactions": 3,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "WOW! This is a good movie, very entertaining, with lots of action! The storyline was a bit confusing at times thou, and it was left wide open as if a sequel is a given. Weather they do eventually make one or not is irrelevant. As of right now, I'm left wondering what happens, feeling like I'm missing a part of the story, and craving more!",
      "total_reactions": 3,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "I really hoped for this movie to be better. The story was a little shaky, as were the characters. More time and focus on one or both would have helped things along a great deal.",
      "total_reactions": 1,
      "user": "oxana"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "I love this movie. The plotline is interesting, the powers are cool, the characters are well developed, The actors did a great job, it was fast paced and action packed. What more can you ask of a sci-fi thriller?",
      "total_reactions": 2,
      "user": "atomzer0"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "Wow, now I am beyond convinced that critics simply can not be trusted. Push was f*cking awesome, the story was GREAT, the characters were well thought out, the acting was GREAT, the cool super power fight sequences were AWESOME, I'm not giving this a 10 to balance out the negative reviews, I'm giving this movie a 10 because it deserves it. F*ck the critics and go watch this, everyone should experience this movie",
      "total_reactions": 2,
      "user": "Patrick94"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Push is a great movie but you sorta got to pay attention because it's sorta confusing  The actors in it did a great job and Push has one of the best third acts I've ever seen  Over all really really really good movie.",
      "total_reactions": 1,
      "user": "HaloMan64"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "Don't listen to the reviews for this movie. This movie is a great time filled with interesting characters in a world that is as mysterious as it is intriguing,Push may not be for everyone with it's geeky government super power conspiracy plot, but if you somehow actually managed to enjoy Jumper, or you are like me and wanted to see it done better, this is a good choice.",
      "total_reactions": 0,
      "user": "rajdeepslather"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2015
      },
      "score": 4,
      "text": "I ran out wanting to know how good the movie was boring despite the hyper - power of telekinesis , it is brutal but no more say again that movie so boring !",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "It is so many super-powered beings in this movie that if you blink you will miss everything. It's very action packed with pretty good special effects.",
      "total_reactions": 0,
      "user": "jelenabiebs31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "It is so many super-powered beings in this movie that if you blink you will miss everything. It's very action packed with pretty good special effects.",
      "total_reactions": 0,
      "user": "choomtabi31"
    }
  ]
}