{
  "mc_avg_user_score": 7.2,
  "mc_metascore": 65,
  "mc_mixed_rating_frequency": 59,
  "mc_movie_name": "Puss in Boots",
  "mc_negative_rating_frequency": 15,
  "mc_positive_rating_frequency": 199,
  "mc_pro_critic_reviews": [
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2011
      },
      "score": 88,
      "summary": "Thanks to Banderas and his Corinthian leather purr and writers who know how to use it, \"Puss\" is the best animated film of 2011."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 80,
      "summary": "It's always a pleasure to find a family film that respects its audience all the way up the line."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 80,
      "summary": "A treat to experience visually (especially in lively 3-D) and verbally, Puss in Boots is a family film where the adventure and invention never flag and the tongue-in-cheek humor doesn't linger far behind."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2011
      },
      "score": 80,
      "summary": "A perfectly diverting romp that happens to showcase some of the best 3D work yet from a mainstream animated feature. Colorful, clever enough, free of cloying showbiz in-jokes, action-packed without being ridiculous about it and even well choreographed."
    },
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2011
      },
      "score": 80,
      "summary": "The results are so funny and irresistible audiences are bound to be swept away into this kitty's universe."
    },
    {
      "critic": "Jennie Punter",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "Puss in Boots is essentially non-stop dazzling action scenes loosely connected by a thin, predictable story of greed versus good."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "For a kids' movie, the humor, at times, strays a bit too far into grown-up territory."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "The story has just the right blend of child-centered silliness and winking adult humor."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "Even if they don't provide much lift, these boots were made for amusement."
    },
    {
      "critic": "Stan Hall",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "Puss in Boots isn't particularly deep, nor does it take itself seriously -- it just wants to seek glory, win affection and cash in. Done, done and done."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "The movie has a devilish wit that works for parent and child alike, and it moves like a bobsled. It's funny and fun, and if it's not up to Pixar level, it still represents the best of what the competition has to offer."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "Puss in Boots doesn't have and doesn't strive for the soul of a Pixar film, but gets pleasure enough out of its own characters and the way they move through this cleverly realized world."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 70,
      "summary": "Puss has his charms, but he is not as memorable a character as Shrek or Shrek's mouthy sidekick, Donkey. Consequently the story, which involves a quest for magic beans and golden eggs, feels improvised and diffuse."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2011
      },
      "score": 70,
      "summary": "A surprisingly delightful adventure romp."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2011
      },
      "score": 70,
      "summary": "However crass the motivation for its existence, Puss' origin story could easily stand on its own -- a testament to clever writing on the part of its creative team and an irresistible central performance by Antonio Banderas."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2011
      },
      "score": 67,
      "summary": "The seductive interplay of Banderas and Hayek, the barely recognizable vocal contributions of Galifianakis, and the Southern backwoods speech of Thornton and Sedaris all keep us attuned to the events on the screen."
    },
    {
      "critic": "Olly Richards",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2011
      },
      "score": 60,
      "summary": "Like most kittens, it's not always perfectly behaved, but at least this new Puss adventure doesn't have you reaching for the cinematic spray bottle. And thank goodness the spin-off does nothing to neuter the charismatic cat's appeal."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "Puss made his debut in \"Shrek 2,\" then did time in the two decreasingly funny sequels. Now he's got a movie of his own, and not a moment too soon."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2011
      },
      "score": 58,
      "summary": "As a sheer visual experience, Puss In Boots makes a great theme-park ride, a thrill-a-minute feast for the eyes and the semicircular canals."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "All in all, the 3-D animations wow without gimmickry, Banderas purrs without peer - and it's a cheerful movie."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Puss in Boots is beautifully animated (with 3-D that adds nothing), but the film is so mindlessly busy that it seems to be trying to distract you from the likable, one-note feline swashbuckler at its center."
    },
    {
      "critic": "Jaime N. Christley",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "For all the fuss, it dissolves almost immediately upon contact."
    },
    {
      "critic": "David Fear",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2011
      },
      "score": 40,
      "summary": "The pomo thrill was already wearing thin a few \"Shrek\" entries ago; here, the reliance on self-referentiality really risks coming off like yesterday's Purina."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2011
      },
      "score": 38,
      "summary": "Relentlessly mediocre cartoon."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "Puss in Boots is a very good Action Adventure film.  Some negative criticism comes from people who label it a Comedy and in turn to find out it's not bursting at the seams with laughter.  More like the chuckles are spread out little by little throughout the film which I did enjoy. If you do not compare this film directly to the Shrek movies, which bombards you with jokes and such, then I believe you will enjoy this movie more.    Another thing that stems negativity is that people believe there is too much adult humor for a children's movie.  That tells me that there are some people still out there that believe all cartoons are for kids, which is not the case.  Included are underlying mature themes that, I believe, is done tastefully.  Very good movie and highly recommended.",
      "total_reactions": 3,
      "user": "simpletaste"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "It's not one of the year's best, but it certainly is the year's most enjoyable return of Puss.",
      "total_reactions": 12,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "Fully entertaining for both the kids and adults, but it does not live up to the wit standards of the best of this class (like the original Shrek).   Still, better than anything else in the family genre in the last few months.",
      "total_reactions": 6,
      "user": "Audiowombat"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "Ever since Puss in Boots (Antonio Banderas) showed his adorable face and fighting spirit in Shrek 2, it was only going to be a matter of time before he got his own movie. Puss in Boots is simple, innocent, and takes the audience on a wild, adventurous journey from Spanish towns to the Giantâ",
      "total_reactions": 2,
      "user": "Sir_Brandon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 2,
      "text": "Unwatchable. This is what spin-offs are. Dreamworks wasn't content with 4 Shreks, they had to spin-off a sword-wielding feline. Alas, we get a **** version of Zorro - voiced by Zorro himself - complete with enough cat jokes and cutaways to milk-sopping to make me a dog-lover for life. Pixar is the unquestioned leader in animation not because of their animation so much as their storytelling ability and their integrity (i.e. not letting a mediocre spin-off tarnish their name). Miss this and go take in \"Toy Story 3\" for the 4th time.",
      "total_reactions": 2,
      "user": "Friskytiger81"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "Sharp, witty fun, this 'Shrek' spin-off is loads of fun. Personally, I found Puss to be a more enjoyable character than Shrek (I was a never a huge fan of the Shrek movies) and the cast is wonderful (especially Banderas). Animation is superb and the 3-D definitely adds to the experience (can't say that too often!). Kids will love it, highly recommended.",
      "total_reactions": 2,
      "user": "movieman24fps"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "Haha, what's there to say that's bad about this movie? From the start of the Shrek series, Puss was obviously that character everyone loved. With the smoothness of Antonio Banderas' voice with the hilarious actions of Puss on the screen, makes this movie great. See this movie.",
      "total_reactions": 2,
      "user": "zaxmazr"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "All I Can Is \"THE BEST MOVIE OF 2011 & CD ANIMATION\" ITS FULL OF LAUGHS AND CRYS....",
      "total_reactions": 7,
      "user": "RogerSmith97"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "Puss in Boots is very good spin-off and I enjoy this movie with great expectations to see it. First of, the story takes place were Puss becomes a legendary cat before he meets Shrek until later. Puss joins Humptey Dumptey and Kitty Softpaws to find the magic beans from the evil Jack and Jill and they must work each other as a team to get the golden eggs at the top of the clouds more like from the fairy tale of  \"Jack and the Beanstalk.\" Next, we meet the characters from the movie. Antonio Banderas returns the voice as \"Puss in Boots\", Salma Hayek voice as \"Kitty Softpaws\", Zack Galifianakis voice as \"Humptey Alexander Dumptey\", and of course \"Jack & Jill\" was voice by Billy Bob Thornton and Amy Sedaris. Those characters are fun to watch and they did pretty well such as Banderas and Hayek since they team up in \"Desperado.\" Most importantly, the animation was wonderful and I saw this movie once again in 3D. It's very beautiful and I can see the background that the 3D could take you anywhere and its done well since the animation brings 3D to see. In my opinion, this movie was fun, swashbuckling, and funny at the same time and this cat was awesome!",
      "total_reactions": 5,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2011
      },
      "score": 2,
      "text": "Mediocre cartoon. Too much adult humor. Too many things were just plain ridiculous. There are a lot of better kids movies. I think cars 2 was better than this movie and I disliked cars 2 as well. If you want to see Puss n Boots in a movie, just go watch Shrek, Shrek was good.",
      "total_reactions": 4,
      "user": "Princess_Peach"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "Fantastic graphic and action scenes. An ultimate catgasm. What's not to like? I like the fact that the role of Humpty Dumpty is included in this movie. Very well done. Although, I would like to know more about Humpty Dumpty's origin in this movie. Expectation fulfilled :D",
      "total_reactions": 1,
      "user": "adelezaaba"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "'' Puss in Boots '' is a good, fun, enjoyable movie to see, especially with your kids, if you have one. I like the fact that it doesn't rely with the Shrek movies. What I mean is that you don't have to see any Shrek movie to understand this film. The creators had done a terrific job developing the character Puss in boots's (his origins, etc). All the other characters were great. Every actor's voice matched perfectly with their character. Of course, we all know Antonio Banderas (as Puss in Boots), but even Zach Galifianakis (as Humpty Dumpty) and Salma Hayek (as Kitty Softpaws) did a wonderful job. The comic moments were cleaver, and they all had the perfect timing (essential in comedy). It also has that Mexican style, with the songs and all that. It funny for me, because in this movie (including Shrek) they make fun of fairy tales. So the creators put all type of stereotypes and representation for each fairy tale character (like Puss in boots is Spanish). This movie didn't lose that sort of '' humor ''. A thing that I founded interesting was, in some scenes, they splited the screens, to show different places at the same time. They made fun of that, which was cool. In general, it's enjoyable movie, worth a watch.",
      "total_reactions": 1,
      "user": "scrieciu"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "PIB astounded me not only with his voice but with his connection with Softpaws.  They've got to create an award for voice actor duets because A.B. and S.H. sparked a bonfire of joy like they did in the movie Desperado; where they actually had a moment of gratification in bed.",
      "total_reactions": 1,
      "user": "PurpleUrp"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "Your first question should be \"What do I expect from this Movie?\"  That makes a difference.  I think the humor was just enough to entertain, and the storyline was just enough to entertain.  This movie brought a little more than I expected...a biography, of sorts, of Puss in Boots.   The 3D effect wasn't mind-blowing, at all.  For me, the movie was entertaining and delivered enough to have me feel at the end that my $9.50 for the experience was worth it.  Once.",
      "total_reactions": 1,
      "user": "moviemonger"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "A fun, light-hearted romp throug the origins and adventures of Puss in Boots (the infamous feline from the Shrek series). I found the story to be much more engaging than expected. As always with Dreamworks the animation was spot on, and the venues in which this adventures took place were gorgeously rendered and varied as well. Many laughable moments are in store for anyone in the mood for some very subtle humor. Recommended for anyone with a heart for animation, adventure, and of course, cats!",
      "total_reactions": 1,
      "user": "yarr"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "This movie was just plain fun. Not as good as the first two shreks but better than the third and fourth. This movie was hilariois. Antonio Banderas does such a great job voicing Puss in boots. Absolutely hilarious. And Zach Galifinakis was very good as Humpy. I loved this movie, very fun and adventurous movie. 8/10",
      "total_reactions": 1,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2011
      },
      "score": 4,
      "text": "I enjoyed the first 20 minutes or so, but once the quest for the eggs begins it starts to really drag. I was pleasantly surprised that there were no Shrek tie-ins or references and the Sergio Leone and Quentin Tarantino homages were well done. All in all, not horrible, but certainly not the best animated film of the year.",
      "total_reactions": 2,
      "user": "acarmatt"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "Si je devais garder en tÃªte un personnage de Shrek (Ã  part l'Ã",
      "total_reactions": 1,
      "user": "avatar16"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "Fully entertaining for both the kids and adults, but it does not live up to the wit standards of the best of this class (like the original Shrek). Still, better than anything else in the family genre in the last few months.",
      "total_reactions": 1,
      "user": "choon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "Puss in Boots is another entertaining Dreamworks animated movie. Puss in Boots was what I expected - interesting characters, some great laughs (including the Shrek-like humor for adults only), and an interesting backstory. Unfortunately, no cameos from major Shrek characters. The star of the movie was definitely Banderas's Puss. If you liked the character from previous movies, you will not be disappointed. Salma Hayak as Kitty Softpaws was decent enough although not very memorable in any way. And finally, Zach Galifianakis's Humpty Dumpty will be a polarizing character in my opinion. If you thought Rumpelstiltskin from Shrek Forever After was a tad on the annoying side, I think you'll feel the same way about Humpty Dumpty.. Anyways, the story is good. The integration of former players in nursery rhymes and fairy tales is seamless. And the comedy is standard Shrek-style delivering lots of laughs for children and the occasional adult-only joke. The visuals are stunning. And the music is fantastic. It almost felt like an action-packed spaghetti western with a Latin flavor. I definitely enjoyed myself. I also talked to quite a few people afterwords and the consensus was that the children all loved it and the adults kept using the word \"cute\" in so many different ways to describe their feelings about the movie.",
      "total_reactions": 1,
      "user": "moviekretik"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "Besides being an occasional pleaser for non-fans, \"Puss in Boots\" will definitely entertain followers of the franchise, with the backstory of the titular character being told in a silly, and sometimes breathtaking, adventure. The film retains an annoyingly static amount of interest, sometimes plummeting, and suffers a lack of taste and dignity at other times. Unexpectedly though, there is a strong point in the writing, where there are scenes in the story that give hints to what will happen next without making the predictable boring. The action, travel and fight scenes are a definite treat; the film features top-notch animation of scenery. At the very least, seeing the movie will satisfy people's want to know Puss's story, and that enough makes it watchable and gives the watcher something to remember it by, but of course no one could forget Antonio Banderas's majestic portrayal of Puss. Final score: 78/100",
      "total_reactions": 1,
      "user": "DoctorET"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "besides me loving cats i really fount the trailer quite funny and i was Intrigued to know more and its amazing i did not expect it one bit and it was better than my expectaions from now puss in boots is an aboslute legend and its funny.",
      "total_reactions": 1,
      "user": "suckyourmum"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "Puss in boots is so cute and funny, i liked him when he was in Shrek and i did find him a lot more interesting than Shrek because he was so cute and funny. I liked the film a lot but i didn't think the quality was as good as it could be :)",
      "total_reactions": 1,
      "user": "Laurzie"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "This is obviously the BEST animated movie of the year by far. The story is GREAT, the animation is just AMAZING,  The only teeny tiny bad thing that is why I am giving it a 9 not a 10 is that there should be more characters like in Shrek.",
      "total_reactions": 1,
      "user": "monkeyshiner444"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "I had low expectations of this spin off film as it's lead character was little but light comic relief in the Shrek series, Well colour me pleasantly surprised then as the picture easily holds it's own against it's green counterpart. It's a fun jaunt deeper into the universe Dreamworks created for Shrek and the trip is a worthwhile one. A suitable amount of jokes for the young ones and a selection that will fly right over their heads for the rest of us. Take the kids and unlike most of the films you take them to you'll never find yourself yawning.",
      "total_reactions": 1,
      "user": "Drusus"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "This has got to be the best animated movie ever. It's cute, funny, and just plain addictive. Especially if you are a cat person! Certainly, can't wait for another one.",
      "total_reactions": 1,
      "user": "PinkiePie"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "The addition of the Humpty Dumpty character is a mistake and leaves Puss to carry the entire film. Puss in Boots, though entertaining, is a missed opportunity indeed.",
      "total_reactions": 1,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "Chris Millerâ",
      "total_reactions": 0,
      "user": "sreekiran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "For a film that did not need to exist Puss and Boots turned out ok. It took a different take on the Shrek world and gave us a decent action/adventure flick. While it times it can be fun and charming some slow parts and the lack of much for an older audience hold it back from being spectacular. However, the films action and adventure feel and somewhat unpredictable story, at least for me, make it a bit better than Shrek 4. If you are looking for something to show the kids that is fun and family friendly, excluding some subtle adult humor, Puss in Boots not a bad rent just do not expect to go gag a over it the way your kids will.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "Better then the third and fourth Shrek movies, and just as excellent as Puss's first appearance in Shrek 2! I never expected to see Humpty Dumpty go from being a random fairy tale character to a rather tragic character.",
      "total_reactions": 0,
      "user": "gm101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "As a cat lover I felt I couldn",
      "total_reactions": 0,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "Funny and enjoyable, also a good way to bring back Puss in Boots, some of the humor can be a little inappropriate so don't let the very young ones see, but if your looking for a good rental and like DreamWorks previous movies then this is a good choice.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "From the reviews I seen, I didn't exactly have high hopes. But I actually had fun watching this movie. If a sequel came, I would watch it definitely.",
      "total_reactions": 0,
      "user": "MichaelD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "Puss in Boots is funny, eye-catching animation but somewhat missing. \"Adult entertainment.\" It's for the kids, really work, but don't bring a date. It lacks of emotion.",
      "total_reactions": 0,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "Excellent spin off, good fun for adults and kids.  Was the first cinema trip my 18 month had ever had, and he actually sat still for the majority of it, which says something!  Superb animation, great voices and humour, just a lovely fairytale.",
      "total_reactions": 0,
      "user": "TheJaijo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "Thought this was good fun, but not nearly as good as it could have been. The Puss in Boots character is a great hero with fantastic comedy value but the lame villain and simplistic and predictable plot let it down.",
      "total_reactions": 0,
      "user": "DukeJon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "Puss in Boots May not be Dreamworks best Animation but its definitely not  bad . Puss in Boots is no where near Shrek 1 or 2 but its better then shrek 3 & 4. Characters impression was very impressive . Animation was Very good. Story was average ! The bean and the tree part was great but the ending was a bit shallow .  The story set in the western area doesn't go well for an Animation Movie . Though Puss in Boots was funny but it had some boring part. I did expected a lot more but it didn't disappointed me much !",
      "total_reactions": 0,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "Coming into this movie I expected to a childish bore feast. I was amazed by how good this movie was. It had action, humor, and a good ending. So take it from me a 17 year old this movie is for everybody not just kiddies.",
      "total_reactions": 0,
      "user": "josephbalentine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "The story may be a bit silly, but is very good and unpredictable for a cartoon. The ending is surprising and may leave you thinking for the rest of the night \"what the hell\". It is funny, too.   *look to the sides* OOOOOOH!",
      "total_reactions": 0,
      "user": "Jarbas6"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "Puss in Boots feels like Shrek 4. Both movies had great visuals and good action, but their stories felt somewhat empty. Puss in Boots however, does have a slightly better ending than Shrek 4.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 4,
      "text": "I've been expecting much more than what I've seen. If you have watched the trailer, then you can notice that all the jokes were in it (that is to say ... 3 jokes !), so it's a serious failure for what is to be a comedy movie. Apart from that, the storyline didn't blow my mind, yet it was rather good entertainment. Oh and I was about to forget : I don't think Puss in Boots is cute, but this is just my personal point of view ! When the movie is released in France, I won't bother spending around 8â",
      "total_reactions": 0,
      "user": "unijalo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "Funny, and Clever. May not be as good as Shrek, but it gets up somewhere. The idea was as good as i expected, dialog was good as well, but the many Cat puns had me shaking my head. if only they Tried to take more of a Subtle Adult humor take, instead of plainly childish.",
      "total_reactions": 0,
      "user": "PinkamenaPie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "Puss does not disappoint.  They have added a nice collection of secondary characters to allow the Puss to do his thing.  End plays out a bit like a Twilight Zone episode,  and might leave a few young ones a bit shocked.",
      "total_reactions": 0,
      "user": "TheJayman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "I thought it had a great story and was funny.Loved the cat that would cover his month and say ooohhhh every time they would kiss.got a little weird with the whole bean stock thing but over all I thought was good.",
      "total_reactions": 0,
      "user": "Pnhtwinz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "this movie is about a journey there is Humpty Dumpty(the brains) puss in boots(the aggressive) and Kitty Softpaws(the skills) that's what makes it a great movie, plus the jokes and excitement definitely go see this movie",
      "total_reactions": 0,
      "user": "smumites45"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "A few jokes meant for adults. Very stylish with the Spanish theme. Loved the way Zach Galifianakis portrayed Humptey. This is better for me than Shrek 2.",
      "total_reactions": 0,
      "user": "Racogo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "Puss In Boots delivers where other animated kids fail. It delivers humor for both adults and kids, as well as appealing to the common Shrek fan and cat lover. It you don't like a nice story with a good spin on folk tales then this is not the movie for you.",
      "total_reactions": 0,
      "user": "Zegilgamesh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "I thought it'd be an alright movie (at least a 6-7) but it was a lot better then I expected. Good voice acting by the casting, It was funny, and it was interesting to watch from start to finish. I think they could easily make a new trilogy of films behind Puss because he's a pretty enjoable character. I would love to see a sequel.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "Not too deep or anything but this is pure fun, enjoyment, adventure, excitement with lots of humor. Banderas was made for Puss in Boots. I had a good time.",
      "total_reactions": 0,
      "user": "khan2705"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "HA! You know what, I really liked it. I was a bit afraid that it was going to be a cheap side-story to Shrek and lose its original charm, but it didnâ",
      "total_reactions": 0,
      "user": "Nelly_JIca"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "â",
      "total_reactions": 0,
      "user": "AwesomeReviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "Perhaps the best domestic animated film of 2011 (in this reviewers opinion). Pros: The animation and voice acting is stellar. The action was also surprisingly good. Unlike some reviewers, I felt the movie was quite funny. Sure it was  cheesy, but in the way a good pun is.",
      "total_reactions": 0,
      "user": "EatToWatch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "Puss in Boots in a cute and funny spin-off that is in fact better than the last two Shrek films, it features great animation and it is enjoyable for both young and older audiences.",
      "total_reactions": 0,
      "user": "BBonasera15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2012
      },
      "score": 3,
      "text": "I was hoping that some of the magical humour of Shrek would be present in this offshoot film but I was sorely disappointed. I didn't even make it to the end of the film before I gave up. It's boring and the humour is sparse and not actually all that funny.",
      "total_reactions": 0,
      "user": "HorsemanUK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "Puss in Boots is an action/comedy movie which is worth to watch. The plot is great and the characters too. But it doesn't feel the great experience and humor of Shrek, but still this movie haves many funny moments. Even my favorite character is Puss in Boots, so I decided to watch it in cinema, so It is a worth watching movie.",
      "total_reactions": 0,
      "user": "Cubixreviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "Much better than Shrek 3 and 4 but not as good as the first 2 Puss in Boots is a successful spin-off. It still has the charm that the Shrek films had  and it appeals to an audience of all ages. It has it's funny moments and it's animation is simply beautiful. it is slightly lacking when compared to the first two Shreks but all and all it is a good film.",
      "total_reactions": 0,
      "user": "moonman1994"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Accion, aventura, diversión. Divertidos y sensuales personajes. Cómo siempre encantador, con ojazos y con estilo Antonio Banderas El Zorro. Un canto a la amistad.",
      "total_reactions": 0,
      "user": "jordi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "\"Puss in Boots\" is another DreamWorks movie, and really enjoyable. I was truly amazed from the visuals, and the plot was great. it brings you laughs,  but It's not spectacular.",
      "total_reactions": 0,
      "user": "FilmReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "A film that lives up to Shrek.",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "I understand that it's meant to be a kids movie but every scene in this movie is silly, why couldn't the movie be like Shrek where it's silly enough for kids to enjoy but serious enough for adults to enjoy too. When one character dies (I'm not saying who) I didn't care because throughout the whole film he had been annoying. Puss In Boots is enjoyable if your under 12 but if your an adult.......get a babysitter to take them instead.",
      "total_reactions": 0,
      "user": "python2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "An entertaining easy-going animation film with great cast and a hilarious character.Puss in boots was great",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "A very fun family film with the type of layered comedy that you want from this type of film. However, it doesn't have the same depth of characters as Shrek. That said, I thought the Jack & Jill characters were very good, as was the plot twist. I would definitely recommend this as an extension of the Shrek films and unlike other spin offs, this offers a new and interesting story and is deserving to be placed alongside the Shrek franchise.",
      "total_reactions": 0,
      "user": "TroyF3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "\"You made the cat angry. You do not want to make the cat angry!\"",
      "total_reactions": 0,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2013
      },
      "score": 9,
      "text": "This move was a perfect story behind Puss. It has a good character development with enough back story to understand what's going on. It even had a good set of actors which voiced the characters perfectly. It is defiantly one of the better animated movies I've ever seen.",
      "total_reactions": 0,
      "user": "cag11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2016
      },
      "score": 7,
      "text": "Even with the \"Shrek\" series being burnt out, making a spinoff based around Puss in Boots is not a bad idea. He was a pretty great character in the \"Shrek\" sequels, and he's probably more deserving of a spinoff than any other Shrek character. All that said, \"Puss in Boots\" may not be one of the year's best animated films, but it's certainly entertaining. It's beautifully animated, exciting enough, considerably charming, and definitely well-acted. Sure, it's not one of the greatest animated films in the world, and DreamWorks definitely has films with better writing than this, but all things considered, \"Puss in Boots\" is a fun animated film that should please kids and adults alike.",
      "total_reactions": 0,
      "user": "FreedomFighters"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "Puss in Boots is an excellent movie that developed an already interesting character with an interesting story. The story revolves around a quest Puss in Boots goes on with a childhood friend. Through his experiences during the quest, the audience can see a different side of Puss through his childhood and his relationships with others. Still a humorous weave of childhood tales, the story in this movie has a lot of interesting moments that, despite being intended for a young audience, still has layers an older audience will enjoy as well. Overall, I thought this was an excellent movie. I can't wait to see the next one and hope it comes out soon.",
      "total_reactions": 0,
      "user": "thompsgj"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2014
      },
      "score": 7,
      "text": "A nice spin-off based on the sidekick character of Shrek, has a lot of fun with the source material, I don't think the story is the strong part, but I guess it's not bad.",
      "total_reactions": 0,
      "user": "Delaforce828"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "I really enjoyed this one. Puss was always my favourite Shrek character so it's awesome that he got his own movie (plus a Netflix TV show). The film acts as an origin story for Puss, showing his first major adventure with Humpty Dumpty and Kitty Softpaws. The movie did not disappoint me, it was exactly what I had hoped for. I'm hoping that the sequel will show how he came to hunt Ogres, that's a story I'd like to see.",
      "total_reactions": 0,
      "user": "DanBurrito"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "Puss in Boots, as a spin-off from Shrek, contains what he got from his Shrek days. Although the story is somehow familiar at times, he's a bit adventurous with his adventures in this movie.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2016
      },
      "score": 7,
      "text": "Sure, it's package with a pleseant animation and with a memorable Shrek's character, but at this point Banderas' last delivery works better with Myers and Murphy. It has some enjoyable features but not at all. Dreamworks should have worked more on the dialogue and the sense of humor on the movie because it's seems more like a spanish-novel or something stricter than an animated movie. It's a very decent movie with ambitious-action parts but less fresh features and plot (67%)",
      "total_reactions": 0,
      "user": "DavidTejada"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "Puss in boots is a movie where our favorite cat in boots gets his own spin off. Its not as good as shrek, but it still has a good story, and great characters.",
      "total_reactions": 0,
      "user": "gameguardian21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "Simply the movie Puss In Boots deserved. Great action, fantastic comedy, charming characters, and a main character packed with a lot of badass-ery and too much charisma it almost cannot contain itself. One of the best spin-offs I've never seen. Check it out, you will not be disappointed at all.",
      "total_reactions": 0,
      "user": "Asancu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2016
      },
      "score": 6,
      "text": "A surprisingly fun film which doesn't rely on the success of Shrek to gain its plaudits. Despite spawning from Shrek, Puss in Boots manages to breed it's own world with it's very own characters. They are very familiar characters but the take on the fairy tales is original and a lot of fun. The script is tightly woven and links together well giving an emotional backstory that is worthy of the required character arcs. The animation is as solid as you expect from Dreamworks as is the A-list voice cast. It is potentially Humpty Alexander Dumpty that steals the show here who is well voiced by Zach Galifianakis. There are stumbles, especially after the halfway mark where it all threatens to fall to pieces but the final act does bring it back on track despite not hitting the initial laugh count. There are laughs, action, fairy tale and darkness and all comes together to make a thoroughly enjoyable film. Shrek it isn't quite but it certainly beats some of the poorer animation efforts.",
      "total_reactions": 0,
      "user": "KrissTolliday14"
    }
  ]
}