{
  "mc_avg_user_score": 6.2,
  "mc_metascore": 52,
  "mc_mixed_rating_frequency": 18,
  "mc_movie_name": "Race to Witch Mountain",
  "mc_negative_rating_frequency": 9,
  "mc_positive_rating_frequency": 24,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "This Movie is for the whole family nothing really interesting going in the movie.I enjoyed the movie with my family but the movie has a weak plot.The movie is fun to the whole family but not everyone would love it.",
      "total_reactions": 2,
      "user": "JohnKristofer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "The movie had good actors, the soon to be Hunger Games villain, Alexander Ludwig and well-known AnnaSophia Robb with Dwayne Johnson and Carla Gugino. Despite the acting talents, the story was boring.",
      "total_reactions": 1,
      "user": "sil3nt_nick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2012
      },
      "score": 4,
      "text": "While it surely is entertaining, the film is not very good. It provides for action, and plenty of it. It is mostly good enough action, but nothing one hasn't seen before. The story is somewhat intriguing, but ultimately rather flat and obviously cannot survive on its own without the action sequences. The effects were not quite as good as I hoped, and the acting was rather bad. I have to point out that Dwayne Johnson was atrocious in his attempt to act. The kids were much better, though they were no stars either. I don't know, it was entertaining but it was a typical Disney film that did not provide for anything that would make you even scratch your head and think, let along challenge anything. The villains are hyper-villains, the good guys are good, and The Rock is a good cabbie, who happens to be able to kick ass... ah, when unrealistic things are annoying me in a film about aliens, you know something's wrong. But, I guess it's ultimately worth for the action... or is it?",
      "total_reactions": 0,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "Not nearly as cheesy and bad as I expected. I have to say that Dwayne Johnson is starting to grow on me. For a Disney movie the plot was decent and the acting wasn't as bad as I imagined it would be. I don't have any real complaints so I will just leave it by saying for a family flick there are many movies that are worse than this.",
      "total_reactions": 0,
      "user": "jp992751"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "The rock did good here. The story makes some sense and there is plenty of action throughout. I can't recall any dull moments.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "The film is entertaining, with some good and bad special effects. The plot of the film is very original.",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "Race to Witch Mountain is a mildly diverting but forgettable family-friendly flick with no particular good things about it, but no particularly bad ones either.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "Race to Witch Mountain is a bizarre adventure. The action is good but not great and the overall premise is odd. Dwayne Johnson does well and the acting is pretty fair. Nothing bad or great I can really say.",
      "total_reactions": 0,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2015
      },
      "score": 5,
      "text": "A regular movie , the plot good , the bad, so boring it is, and the funny Sera that Dwayne Johnson will play babysit some kids from another planet? Who do crazy so he had to do that to Dwayne Johnson ?, That Funny.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2016
      },
      "score": 5,
      "text": "Race to Witch Mountain struggles itself for the ultimate ending which is ruined by the struggle of this movie. Most would love to praise Dwayne Johnson, but I wouldn't.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    }
  ]
}