{
  "mc_avg_user_score": 1.7,
  "mc_metascore": 28,
  "mc_mixed_rating_frequency": 6,
  "mc_movie_name": "Rage",
  "mc_negative_rating_frequency": 27,
  "mc_positive_rating_frequency": 2,
  "mc_pro_critic_reviews": [
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "A picture that isn't as terrible as its title suggests now as deep as its story aspires to be."
    },
    {
      "critic": "Jonathan Holland",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "There are some good ideas struggling to be heard, but they're drowned out by the contrivances, the gunfire and the screaming."
    },
    {
      "critic": "Mike D'Angelo",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "Rage actually has something to say about the futility of vengeance, though that doesn’t become apparent until a climactic revelation re-contextualizes everything. Unfortunately, getting to that sorrowful ending is a real slog."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2014
      },
      "score": 42,
      "summary": "Unfortunately, eccentricities are few and far between in the movie, with sleepy action that bungles its best ideas (like its potentially interesting twist ending) and finds Cage delivering one of his more moribund performances."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2014
      },
      "score": 40,
      "summary": "The movie is imprisoned by its Cage’s stiffness. All he gives us is strained, robotic seriousness. I’m not sure he even gives us any rage."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2014
      },
      "score": 40,
      "summary": "You may feel some anger if you pay to watch this. Or you may not, as Rage offers exactly what you think a Nic Cage movie called Rage would, except maybe for continually inspired lunacy."
    },
    {
      "critic": "David Hiltbrand",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2014
      },
      "score": 38,
      "summary": "There isn't an original frame or line of dialogue in Rage. It's strictly paint by numbers. Or in this case, plasma."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2014
      },
      "score": 38,
      "summary": "Rage lets us see where all the money was spent — on Cage, and on a noisy, metal-rending car chase through scenic Mobile. It’s head-slappingly dumb, it’s dull and even the novelty of filming outside of the over-filmed Los Angeles adds nothing."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2014
      },
      "score": 30,
      "summary": "Proficiently made but fatally unpersuasive in its portrayal of internecine gang warfare, this thuggish melodrama piles on the foreign accents and paint-by-numbers brutality, all served up with a grim, operatic self-seriousness that gives Cage’s antihero little room to maneuver."
    },
    {
      "critic": "Nicolas Rapold",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2014
      },
      "score": 30,
      "summary": "The hand-me-down showiness and sluggish storytelling by the director, Paco Cabezas, underline the monotony in this ordinary revenge thriller."
    },
    {
      "critic": "Gary Goldstein",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2014
      },
      "score": 30,
      "summary": "There's a late-breaking twist that might seem impressive if it didn't make all the previous mayhem feel so intensely pointless."
    },
    {
      "critic": "Glenn Kenny",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2014
      },
      "score": 25,
      "summary": "The reason he’s (Cage) the most interesting thing here is not because his performances is particularly intense or eccentric but because everything around him is so wretchedly dull."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2014
      },
      "score": 25,
      "summary": "Rage is another formulaic re-tread that needs its brakes re-lined."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2014
      },
      "score": 25,
      "summary": "There’s nothing wrong with being a brainless B-movie, but this one is funless and lackluster, a grinding mess of pulp clichés with dull characters, perfunctory violence and dim plotting."
    },
    {
      "critic": "Clayton Dillard",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2014
      },
      "score": 25,
      "summary": "Paco Cabezas's film is little more than a revenge relic pretending that the ethical treatise of David Cronenberg's A History of Violence never happened."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2014
      },
      "score": 20,
      "summary": "As for our leading man, he’s clearly just messing with us now. Who else would make a revenge thriller called Rage and then sleepwalk his way through it?"
    },
    {
      "critic": "Nikola Grozdanovic",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "summary": "Tired, lazy, incongruous, shocking and hilarious in all the wrong places, Rage is destined for the graveyard television slot, squeezed between infomercials for mops."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "Laying on her death bed, Paul McGuire (Nicholas Cage) promises his wife, that he will leave his life of organized crime behind to be there for his daughter. That all changes when a decade later his daughter goes missing. The gloves come off and McGuire connects with his old crew and goes after old enemies to find his daughter. This was an entertaining film, but I think it would have been so much better if it were less violent. I love violent action films as much as the next guy, but the story here calls for a more investigative approach, but all McGuire wants to do is beat people for answers. Nicholas Cage stars and is one of those action stars that never goes out of style. He's been going after the bad guys and surviving impossible odds for nearly three decades, becoming very good at it. Despite being an independent film, Rage has a huge cast with many notable names that really help the story along. In fact, with all the named actors in the film, I'm really surprised that Rage wasn't released in theaters. While being entertaining, Rage isn't anything you haven't seen before, as it's your typical who done it, with all the gun fire and explosions you'd expect from an action movie. The cast is experienced and very good, while the plot does have a back story and moves at a reasonable pace. Rage is one of those film where you don't really have to think and ultimately it is somewhat forgettable, but if you're looking for something to watch without having to think too much, than Rage is a perfect choice and it is currently streaming on Netflix.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "Also known as 'Rage'. My first question is what happened to Nicolas Cage, I did not like any of his recent movies. So it makes me think that his time is over. Once he was known as a good actor with the better appearances, but not anymore. This movie was average with a decent story and twist and freshly approached narration, but in the end it did not work. It is kind of a gangster story with a revenge theme. Thank god it did not go on the 'Taken' route. In a few parts I thought that way, then it took a turn moved to the other end with a reasonable end. It was very simple that tells the story of an ex con, who go after some men after his daughter was kidnapped. Kind of to say 'revenge is not after you, but you welcome it when circumstances are in chaos'. Anyway, this movie can be watched once, but don't force yourself because it's not worth.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2014
      },
      "score": 2,
      "text": "Avoid at all costs , it's a rip-off of *Spoiler Alert * Mystic River , but with bad acting and a silly budget . You know Nicholas Cage , a Hit or Miss actor , this one's a miss .",
      "total_reactions": 0,
      "user": "JalalBlack"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "After a slew of fantastic movies starring Nicolas Cage, our high school film club stumbled upon this massive pile of horse poopy. Jesus Christ, this movie sucks. Despite not being able to follow the horrendous \"plot-line,\" I was never able to actually enjoy Nicolas Cage's impeccable acting. The action sequences were lackluster and extremely sparse, with cinematography matching that of vine filmed on an iphone 3G. The climax of this movie left me breathless mostly because of how loud I was screaming about how poopy it was. This followed by a terrible ending that leaves many questions to be answered as well as no closure. The only redeeming quality of this awful movie, if I can even call it that, is that Nic Cage stars in it. Do not watch this please, dear god, do not watch.",
      "total_reactions": 0,
      "user": "Ragesucks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "While many users here are saying that this movie is the same as other Nicholas Cage movie or just another movie, I haven't seen those other movies, so for me I actually quite liked it. Of course, Cage did overact a bit, especially at those rage parts, but he has acted like that all the time, so if you want to see the movie you should know what you are going into anyway if you have seen his other movies which are this type. The movie had some plot twists which weren't that expected and the script was ok. If the acting would have been stronger it would have been a pretty solid movie. Not comparing to others, because I think it's just dumb, then you have to compare each movie to another each time. I think movie stands for it's own and as it's own it was an ok to watch.",
      "total_reactions": 0,
      "user": "Ralfbergs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2017
      },
      "score": 1,
      "text": "C'est un crève-coeur de voir l'un des meilleurs acteurs de sa génération -et de bien des générations- s'humilier (s'auto-humilier ?) dans des merdes pareilles. Le grand Nicolas aurait-il de graves problèmes de sous pour tourner dans un tel étron ? Voir Danny Glover dans ce truc n'étonne pas outre-mesure (un vieux, faut que ça mange) mais Nicolas Cage, bordel !",
      "total_reactions": 0,
      "user": "Broyax"
    }
  ]
}