{
  "mc_avg_user_score": 7.4,
  "mc_metascore": 56,
  "mc_mixed_rating_frequency": 6,
  "mc_movie_name": "Ramona and Beezus",
  "mc_negative_rating_frequency": 6,
  "mc_positive_rating_frequency": 30,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "From what I've heard this movie is based on a BEST-SELLING book. If that's the case I'm assuming the book is actually very good. But unfortunately this movie is mediocre at best. For most of the movie, there isn't that much happening really. It's quite boring. Just an ordinary young girl and her family going through their regular everyday routine. Nothing out of the ordinary happening. Yeah, the father gets laid off and it sparks drama in the family. But in this day and age and in recession, it happens to most people. Still nothing out of the ordinary really. In other words, the story is not very interesting at all. The daydreaming parts is actually the best part of the movie because it offers an accurate depiction of a child's imagination. Furthermore the daydreaming parts are the only part of movie where the story goes a little deeper. The rest of the story is very slow moving and isn't very deep at all. There are many EXCELLENT movies which consists of slow moving stories (like The Curious Case of Benjamin Button for example). But the difference is the story is very deep and original and keeps the audience interested. That's absolutely not the case with this movie.",
      "total_reactions": 1,
      "user": "BrunoM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "I was suprised how Selena Gomez could actually act throughout this boring, cheezy movie. She aced her part more than any other actor in \"Ramona and Beezus\". However, that's the sole good thing the film can boast about.",
      "total_reactions": 1,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "movie is predictable and cheezy but somehow it was good. I loved how they kept focus on ramona most of the time. I am not a fan of Taylor Swift but her song on this somehow turned out to be my favorite song. It is my most listened song in my collection.",
      "total_reactions": 1,
      "user": "Merdocx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "It is utterly predictable, but the film is surprisingly well acted by the young Selena Gomez, it is funny, and is undeniably sweet. I give this surprisingly good movie 78% of a good movie.",
      "total_reactions": 1,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "This movie was not great but it was not horrible iether. I like this movie because it replicates a actuill sister hood. Trust me I am ten years old and I have a 21 year old sister. She lives in Reno. I miss her but I do not miss living with her. It is actuilly fun being a only child and in this movie I think that is what both sisters want.",
      "total_reactions": 1,
      "user": "abduction"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "Ok, Ramona and Beezus, wow, beautiful and funny movie, the cast is good (except Selena Gomez), and their performances are great (except Selena Gomez), I think that this movie is for all the family.",
      "total_reactions": 1,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "I really like Selena Gomez's movies, and Joey King was too cute here. This is a cute movie, good for all ages.",
      "total_reactions": 0,
      "user": "choomtabi31"
    }
  ]
}