{
  "mc_avg_user_score": 5.4,
  "mc_metascore": 44,
  "mc_mixed_rating_frequency": 8,
  "mc_movie_name": "Rapture-Palooza",
  "mc_negative_rating_frequency": 7,
  "mc_positive_rating_frequency": 13,
  "mc_pro_critic_reviews": [
    {
      "critic": "Amy Nicholson",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 70,
      "summary": "Chris Matheson's script focuses its energy on small, wickedly funny gags, half of which Robinson seems to have sputtered out as improv."
    },
    {
      "critic": "Chuck Wilson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 70,
      "summary": "Always amusing, if never screamingly funny."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 50,
      "summary": "More irrelevant than irreverent, the unworthy script from “Bill and Ted’s Excellent Adventure’s” Chris Matheson might play to apocalyptically stoned college kids, but offers nothing in the way of broader social satire, suggesting the waste of a perfectly good Reckoning — not to mention the talents of a cast far funnier than the doom-and-gloom results suggest."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 50,
      "summary": "Silly enough for you? Did I mention that the immortal Ken Jeong of “The Hangover’’ plays God, who gets mighty pissed when hubby accidentally shoots Jesus out of the sky?"
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 50,
      "summary": "Rapture-Palooza has a promising setup and a cast with a good track record of bringing the funny, yet it never does live up to its potential."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 40,
      "summary": "An amusing premise yields few yuks."
    },
    {
      "critic": "Drew Hunt",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 38,
      "summary": "Its views on organized religion are so halfhearted and perfunctory as to make Kevin Smith's Dogma seem like a veritable master's class in theistic studies."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2013
      },
      "score": 38,
      "summary": "If you’re going to commit to a blasphemous stoner comedy mocking the New Testament prophesy of the coming Rapture, you’d better go all in. Because halfway isn’t funny."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 30,
      "summary": "The film overflows with inspired comic ideas that fizzle and die in execution like a marathon fireworks display of nothing but duds."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "I laughed a lot at this movie. Start to finish. Seeing Craig Fergeson",
      "total_reactions": 1,
      "user": "McCorpse"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "An amusing film, if not terribly entertaining. Let's face it; this is a film for a very niche audience -- former evangelicals who have left faith altogether. First of all, you have to have been an end-times obsessed evangelical to understand all of the apocalyptic references. Second, this film would be way too offensive to any current evangelical because of the language, alone.",
      "total_reactions": 0,
      "user": "cajun67"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 9,
      "text": "Pot smoking demons, \"fowl-mouth\" birds, and Ben of Seattle join together with Ben's girl, Lindsey, in battling the Anti-Christ, Craig Robinson, also known as \"Earl\".  If the movie just stopped there, it would already be a comic hit, but the jokes come dangerously non-stop with the evil Earl at the helm of the Rapture's aftermath.  It is true that a few quips are sophomoric and there are lots of 4-letter words, but that works in the context of a plot where wickedness envelopes the planet and those left behind adjust to the new norm with a bizarrely hilarious complacence.  Beware of this evil misadventure since you might very well laugh yourself to death! (I nearly did.) While this flick goes well with beer and buddies, it is not recommended for those who are convinced that the earth has corners and has only been around for 6,000 years.",
      "total_reactions": 0,
      "user": "Birt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "A solid cast and a promising, funny opening 20 or so minutes are all but squandered as soon as Craig Robinson's Anit-Christ officially makes his entrance into the film. It's not necessarily his fault, his foul-mouthed, man-child of a character is just severely underwritten, barely qualifying as a character and more a machine that spits out the same three lines ad nauseum, with only slight alterations to their structure. If he was a minor character, not a big deal, but Rapture-Palooza instantly becomes entirely about him the moment he steps on the scene. Craig Robinson deserves better material. Then again, no character in the film is particularly well-written (another victim of poor-writing is Ana Gasteyer, forced to screech and cry her way through some seriously unamusing scenes), but there are a few standout performers who elevate their one-note personas above their thankless characterizations. Rob Huebel, Thomas Lennon, Ken Jeong, and Paul Scheer are the only reasons to bother watching the second half of the film, as seemingly every funny thing the writer (Chris Matheson) could think of is frontloaded in the first twenty minutes. Paul Middleditch, the director, might deserve more of the blame though. His lack of experience with comedy and obvious over-reliance on his performers may be what truly undermined a decent script. In any case, a much better, similarly themed recent film to watch would be Seeking a Friend for the End of the World. If you need to watch Rapture-Palooza I would suggest only watching it if you're incredibly stoned, but it's instantly forgettable either way.",
      "total_reactions": 0,
      "user": "monosyllabical"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "Rapture Palooza is a movie with a sold cast but Robinson does not show us Bill and Ted's excellent adventure. Indeed, the script is stupid and does not live up to potential merits but I did laugh.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "I liked the cast in this film but the movie is just not as funny as it could be.  It has its moments but most of them are shown in the trailer.  It felt like the film had some promise and potential but due to a weak script that a whole cast of proven funny-makers can't make shine, the film doesn't live up to the the promise it had.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "If you go into this expecting a serious film then look elsewhere. The film has some of the best comic actors in this generation, Craig Robinson is brilliant as usual and the supporting cast are excellent especially the always funny and underrated Rob Huebel. Anna Kendrick is gorgeous and plays her character very well. It has it's problems and some of the jokes fall flat, especially the talking crows which got old very fast. If you like films such as The Other Guys & Hot Tub Time Machine then this could be the film for you. It's not as polished or as funny as most Judd Apatow comedies but it is a very easy and fun film, It's also well paced. In conclusion it's a good movie, obviously not for everyone. After seeing the low rating I went in with low expectations but I was pleasantly surprised. It wasn't marketed very well and that probably didn't help matters either.",
      "total_reactions": 0,
      "user": "cjdynamite"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2013
      },
      "score": 1,
      "text": "Given the seeming lack of commitment by the actors to give the story more life, it becomes a stupid attempt at satire! What's with the cursing crows? Chris Matheson could have at least researched more on the apocalypse, but then again where would the satire lie eh? Ignorance IS satire! This would have been a more acceptable fail if Paul Middleditch worked with some unknown actors. I mean, where's the fun in watching Craig Robinson ad-libbing the dialogue of a senseless man-child beast? And an emotional Ana Gasteyer from the time you see her until you stop seeing her  why is her character even there? And Anna Kendrick! That role should have been given to some struggling actress wanting to hit the big screen! Seriously! She is a great actor, and seeing her deliver this role with no sense of urgency is really unforgivable! The plot is going nowhere and the only performance I enjoyed was from John Francis Daley. At least his character is trying to make it through the apocalypse, and trying to save the one he loves. At least that makes sense. Oh and by the way, the whole movie is so passionately offensive in it's delivery of Christian theology.",
      "total_reactions": 0,
      "user": "Jaksil"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2014
      },
      "score": 6,
      "text": "The rapture finally happen but Anna Kendrick, her boyfriend and her family didnt get sent to heaven. Talking locusts,walking Wraith making them like pothead zombies and the occasional meteor shower are the few that plague Earth but its livable. The Beast A.K.A the Antichrist played by Craig Robinson wants to marry and basically sleep with Anna Kendrick. He gave her a choice to marry him or kill everyone she knows so she and her boyfriend came up with a plan.",
      "total_reactions": 0,
      "user": "nguyen_christo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2016
      },
      "score": 10,
      "text": "Great comedy, Anna and Craig are super awesome and pull off an amazing movie with a great supporting cast.  It is one of those rare movies I would watch multiple times.",
      "total_reactions": 0,
      "user": "bri_kurtz"
    }
  ]
}