{
  "mc_avg_user_score": 7.0,
  "mc_metascore": 56,
  "mc_mixed_rating_frequency": 82,
  "mc_movie_name": "Real Steel",
  "mc_negative_rating_frequency": 30,
  "mc_positive_rating_frequency": 229,
  "mc_pro_critic_reviews": [
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 91,
      "summary": "Real Steel is directed by \"Night at the Museum's\" Shawn Levy, who makes good use of his specialized skill in blending people and computer-made imaginary things into one lively, emotionally satisfying story."
    },
    {
      "critic": "Randy Cordova",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 80,
      "summary": "There's a little \"Kramer vs. Kramer\" here, a dash of \"Transformers\" there, and it's all topped with big heap of \"Rocky.\" But it's hard to argue with the results, because, at times, Real Steal is close to a knockout."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "If you can get past the ridiculousness of the setup - easy to do, because the posters make it clear this isn't a Woody Allen movie - it's pretty much impossible not to have fun."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "The movie is corny enough to remind you that boxing rings are square."
    },
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "It is earsplitting, crowd-pleasing, and, no doubt, 'bot-pleasing, too. If you told me I would get emotionally and viscerally involved in two machines punching the hard drives out of each other, I would tell you you were crazy. I would be wrong."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "By the time the two hour running length has expired, it's safe to say that Real Steel comes across as a legitimate crowd-pleaser."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "Real Steel is a real movie. It has characters, it matters who they are, it makes sense of its action, it has a compelling plot. This is the sort of movie, I suspect, young viewers went to the \"Transformers\" movies looking for."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "Like \"Moneyball,\" this is real movie making that packs a solid entertainment punch."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 70,
      "summary": "It goes through all the motions, properly and efficiently, and yet it's missing some core warmth. Watching Real Steel, I kept thinking of Brad Bird's retro-modern cartoon \"The Iron Giant,\" and of how that picture humanized a metal alien so effortlessly."
    },
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2011
      },
      "score": 70,
      "summary": "Although the marketing looks like \"Transformers 4,\" Real Steel is the real deal, a Rocky with robots that ought to have audiences standing up and cheering."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2011
      },
      "score": 70,
      "summary": "The uncanny thing about Real Steel is just how gripping the fight scenes are; Sugar Ray Leonard served as a consultant to the motion-capture performers responsible for pantomiming the machines' moves."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 67,
      "summary": "Real Steel falls somewhere near the intersection of elation and shame, essentially reworking the Sylvester Stallone arm-wrestling non-classic \"Over The Top\" for the equally ridiculous sport of android fisticuffs, and mostly getting away with it."
    },
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 63,
      "summary": "If familiarity is endemic to this feel-good drama, there's nonetheless also something to be said for competent amalgamation and regurgitation of tired genre tropes."
    },
    {
      "critic": "James White",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "Rocky with robots? It's not quite in Balboa's weight class, but Real Steel at least has some heft. There's barely a story beat among the beat-downs that you won't expect, and sometimes the saccharine gets in the way of the spectacle, but on the whole this is enjoyable family entertainment."
    },
    {
      "critic": "Forrest Wickman",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "When I was 7 and saw \"Over The Top,\" I saw no irony in its moniker, even during a slow-motion close-up of two battling hands. While Real Steel is similarly ludicrous, I predict it will play like a masterpiece with 7-year-olds."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "As it happens, this recycled reclamation of underdogs saga is neither as bad as it sounds nor quite as good as it could be."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "Based very loosely on a short story by \"I Am Legend\" author Richard Matheson, Real Steel in fact comes closer to road-bonding movies featuring children and hesitant papas: \"Paper Moon\" or \"Over the Top,\" say."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "Executive-produced by Steven Spielberg, the movie's special effects are seamless and far more cleanly cut than any of Michael Bay's hash. But the element that lingers longest is a subtle strand - also woven into last week's \"Take Shelter\" - of recessionary anxiety."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 58,
      "summary": "Real Steel is sci-fi without the science, and the fiction is strictly 20th century, straight out of Rocky knockoffs."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "The story remains sadly mired in botdom, which leads to some boredom. It's hard to look away from the ever-dazzling Jackman, but the sight of him hunched over the controls of something akin to a live action video game is not, in the end, much more exciting than the sight of your average teenager hunched over the controls of a Game Boy."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "When making a film for 10-year-old boys, it doesn't have to be good, necessarily -- just good enough. And that's exactly what Real Steel is: good enough."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "What it lacks is the human element. Charlie is more of a rat than a rascal, and instead of working hard to build and operate his robots, he's literally going through the motions."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "They should call this overloud, underwhelming movie \"Real Steal.\""
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "It's a combination that seems ideal for 10-year-old boys who adore violence, and could well be the cornerstone of the next DreamWorks franchise."
    },
    {
      "critic": "Staff [Not Credited]",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "It's an odd blend - a sentimental story in a futuristic world of brutal machine-maneuvered fights. There are some ringside thrills, but it's not a seamless mesh."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "An underdog drama with clanging metal-on-metal action, Real Steel feels scientifically programmed to claw at your heart while its battling robots, which have a semblance of human personality, drum up your adrenaline. That said, I'm not sure that the movie itself has more than a semblance of a heart."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Sugar Ray Leonard helped with the motion-capture, and it shows. Good stuff. But the tear-jerking in Real Steel is as shameless as its product placement. We're being hustled."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "A slightly soggy tale of father-son bonding, crossed with an action-adventure flick about high-tech battle-bots."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "I suspect a lot of what I found synthetic and sort of galling in Real Steel will work just fine with the target audience."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Lost's Evangeline Lilly remains lost, however, in this film role as Charlies's too-good-to-be-true romantic interest."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Jackman gamely does his best,  Levy keeps the kid just shy of insufferable and just this side of kid-appropriate in his behavior and language."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "This punishingly predictable tale will test whether sci-fi action fanboys can stomach having their cherished genre infiltrated by sentimental hokum about a down-on-his-luck dad and his spunky long-lost son."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 40,
      "summary": "In either a stunningly brave or misguided act of meta-absurdity, Real Steel, which is about a boy, his dad and the robot that changes their lives, actually feels as if it were made inside the mind of a kid obsessed with robots."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 38,
      "summary": "Real Steel is to action what the Anthony Weiner habit was to sex: It's so virtual, so distant from the thrill, that you wonder what the point is. Do you really want to pay to watch an actor playing a kid who in turn plays what amounts to a video game?"
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Real Steel is definitely The Real Deal . Its was enjoyable to watch , It was remarkable to see those robots fighting & its was incredible to feel this movie . Real Steel is an amazing Si-Fi film and best of 2011 of this genre(tie with Super 8).Another SS masterpiece. Hugh did superb,He was just freaking amazing and he really was the perfect choice. Dakota did better then I hoped .Also Eva , Olga and others did really good job . Effect was definitely Top Class.Shawn did and amazing job directing this. Now lest go to the End of the film .... Not what I expected and sorry but didn't like it , I want to see this kinda twist on other film but not in this kinda films . Another thing is that this movie was too childish . Not that I hated it but sometimes it was too much that certainly doesn't go with Fighting films but they did make it enjoyable . But Now I wish It could have been more mature , darker with more violence . But Real Steel wasn't boring for a second ....Enjoyed , Laughed , Saw the 2020 Bot Boxing so hell yeah I want to see A sequel and One after that ... \" Real Steel Trilogy \" how's that sounds hah !!",
      "total_reactions": 4,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "This film isn't the best ever made by a long chalk but it also is not at all bad, it's just mindless fun, if you want a film you don't have to worry about too much or over think about, just a bit of good old fashion fun, this is it.  Hugh Jackman is great in it too.",
      "total_reactions": 2,
      "user": "mrjeffsir"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Real Steel to me than a great movie, a movie that has the vibe and emotion from beginning to end .... It shows the friendship of a child and separated by a year, shows the difficulty in cohabitation, after the death of his mother ... Finally, animation, notes: 10. It was great fantastic, actors acting was great ... A film that keeps you in boredom ... However, I think I missed a bit of history, the film is attached to only two things, the child is with his father after years ... And the struggles of robots ... Otherwise the movie is very good ... and amazing!",
      "total_reactions": 1,
      "user": "Nicholasandrew"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Critics... pah! This is great fun... does what it says on the tin. Robots smashing each other to bits.  Yes it's got an element of the cheese factor, but that's what we really love in a big budget special effect bonanza.  Reckon the fact I have 2 sounds made the film all the more emotional for me... yes, I welled up a little.  Honestly, I was surprised by how much I enjoyed this film, escapism, adrenaline, tears and my head didn't hurt with having to over-think plot and storyline.  Solid 8.",
      "total_reactions": 1,
      "user": "TheJaijo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "just one word to describe this MOVIE when im seeing",
      "total_reactions": 1,
      "user": "Singgihsatch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "A man, who is lost in life connects with his son over the course of a summer whilst fixing and fighting robots.  Together they learn, love and find what they have been missing. Itâ",
      "total_reactions": 1,
      "user": "TruAlbino"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "Amazing visual effects, but a story that is too simple, rushed and without any development of the Characters; Hugh Jackman carries all the movie ass Bikerjames has written below - but I believe that the audience target was from older children and teenagers (beside their parentes, off course - ultimately movies are to have some good time watching them), and it has a nice message, and is a fun movie to watch.",
      "total_reactions": 1,
      "user": "Xborn74"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Ok Real Steel, the new Shawn Levy movie, what happen? The movie is really funny, have awesome effects, good performances, good cast, good trama. Real Steel is a good show for all the family.",
      "total_reactions": 1,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "\"Real Steel\" is real. It has the visual action with a cheesy but good story. A good entertainment to watch with your kids or family.",
      "total_reactions": 6,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "Here is what you get when you see this movie:  You get to be with moviegoers that will cheer and clap out loud (when is the last time that happened).  You get great fight scenes. Real life Rock'em Sock'em Robots. You get the desire to stand up and throw a punch yourself.  You may get a tear in your eye.  If you go with your son, you get to watch him go through every emotion in two hours then talk about every minute of it for the next two hours. You get to watch a very good movie and you get your monies worth.  Again, when is the last time that happened?  No academy awards with this one, but you'll have some priceless snapshot moments with your family.",
      "total_reactions": 10,
      "user": "Badgerbrad"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "I went to this movie with apprehension and at first wondered if I had come into the wrong show until I saw Hugh Jackman at the wheel of his truck. I was expecting it to be far into the future but soon found it was in a time similar to ours, the not to distant future. It's a relatable world with characters not much different to us. Real Steel was a pleasant surprise and had a Disney flavour, it's really worth seeing. It has a great story line, interesting characters and great robot fighting scenes. They were well-done and the Robots look so real and you would hardly  tell that it was all done by computer simulation. This movie is a heart felt father son story between and ex boxer Hugh Jackman and his son Dakota Goyo. I wouldn't be surprised is there is a sequel and I'd definetly go alone and see it.",
      "total_reactions": 3,
      "user": "ghotter"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "Here is an over-the-top idea to bring in a rock 'em sock 'em robot movie with Wolverine rather than Optimus Prime that many are overlooking from the trailers. Guess what, the movie was great and a lot of fun! I took the family and if the wife enjoyed it, then you know it wasn't that bad. The fights did remind me of Rocky and even a few of them seemed to mirror Balboa's fights, I was hooked into them no different rooting for Atom. My boy was loving every second of it. So if you want to be entertained, blow off the negative critics and go see it. That's what movies are about right, just enjoying it and not wanting everything to be grounded in realism?",
      "total_reactions": 3,
      "user": "Nundito"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "I am in a robotics team, so i might be a little biased towards robots, but i think this was the best fighting movie of the year!!!!!!! I was looking forward to this movie soo much, and it STILL beat my expectations!!!! It is a classic movie of a father getting to know his son better after leaving him alone with his mother and they are seeing each other for the first time because the mom died. However, the fact that the dad is a pro boxer and that he fights extremely high tech robots is a very good plot line. He is kind of a bum that is trying to earn money to pay off many debts, but he ends up getting a really cool son instead. If you like Rocky Balboa and transformers (mainly the robot part, not so much the transforming part), then you will think this movie is epic!!!",
      "total_reactions": 9,
      "user": "Ironmonger"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "My son at 10 minutes in: \"I LOVE this movie!\" :) Really well done - great fx, really good actors, good, personal story. Like a \"Rocky\" for kids. A good father-son bonding movie. :)",
      "total_reactions": 4,
      "user": "mgummelt"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "Real Steel has cool parts were the robots are fighting each other in the ring and neatest part is that they have one of those dramatic moments that makes it real to begin with. Although it does make this movie turns into Rocky and Rock Em Soc-kem, but it's good movie that brings the action of best visual effects and good acting. And there's nothing compare Transformers or Michael Bay has nothing to do with it, but Real Steal is cool!",
      "total_reactions": 2,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "This movie was just pure fun. Filled with awesome-looking robots engaging in eye pleasing fights. I loved this movie. Good story with great action. Hugh Jackman is one of my favorite actors. I was engaged from start to finish. Don't listen to the people complaining about it being predictable because isn't every boxing/sports movie these days predictable? Don't listen to the haters, because if you enjoy action, a good engaging father & son story, and lots of robots, then go see this movie now! You will not be disappointed if thats what you go in expecting and hoping. Fun and exciting film, 8/10",
      "total_reactions": 2,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2012
      },
      "score": 2,
      "text": "Either the majority of reviewers on here are HIGH, paid by  the studio or legitimately idiots.  I'm sorry but this movie sucked.  And not just in a silly, formulaic, seen-it-before kinda way.  This movie is bad from such a fundamental level that it literally pissed me off while I was watching it.  Let me clarify that I was excited to see this movie.  I missed it in theaters but it's always been on my list of movies to see.  So when I popped it in, I had no idea that by the 10 minute mark I'd be ready to rip my eyes and ears out.  The writing is atrocious.  I'm talking, abysmal dialogue, vague character motivations that seem to change on a whim, and probably the most annoying kid character ever.  So... an 11 year old is fluent in Japanese (because he plays video games, of course), a hip hop dancing prodigy, and the most innovative fight promoter/manager of all time.  That makes total sense.",
      "total_reactions": 2,
      "user": "Zack2981"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "I was hesitant to see this movie. Based on the previews, I had a pretty clear cut vision of what this movie was - a Rocky clone, but with robots! Robots! And Wolverine! These last two bits are important. Robots are awesome, right? And Hugh Jackman is awesome, too!. So, based on these two things alone, I bit the bullet and gave this movie a chance.",
      "total_reactions": 2,
      "user": "JTWStephens"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "A very good and entertaining movie. My husband liked it (he's a very critical person) and my 9-year old daughter loved it. Yes its unrealistic to us in 2011 but who knows what will happen in 2027. It's not a movie to take seriously but its what i call a \"fun\" movie. Watch out parents there's cursing throughout the whole movie including the little boy. That's something hollywood really needs to get rid of when it comes to cursing kids. My child would be disciplined if she curses like that. Besides that the movie is two thumbs up.",
      "total_reactions": 2,
      "user": "Veronicasamuel"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2014
      },
      "score": 0,
      "text": "Just seen it, and I absolutely hated the kid... spoiled / ruined / blemished / atrociously KILLED the movie for me. Go Hugh Jackman, Atom & Noisy Boy!  Robots Rule! But not in this movie.",
      "total_reactions": 2,
      "user": "Tasty"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "I was apparently WAY too old for this movie.  It was predictable from the opening frame.  Maybe a good family film to take your kids to but just didn't hold my attention the way Super 8 did which was also a family film.  Hugh Jackman carries the entire film as far as I'm concerned.  His model-looking girlfriend who is a mechanic (yeah right) is not used much and the kid is a little hammy at times.  Actually he's hammy most of the time.  Lots of preposterous eye rolling moments.  I looked at my watch a couple of times hoping it would end.  Also, Hugh Jackman plays a jerk who ignored his kid his entire life and couldn't even remember his wife's sister's name, and yet we're suddenly supposed to be cheering for him?  Now suddenly he's a good guy since he introduced his 11 year old son to the art of boxing and betting on sports?",
      "total_reactions": 11,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "This could've been much much better if they just made one adjustment - remove the kid. Seriously one of the most annoying child characters ever portrayed on film. This kid is a shining example of Gen Y at it's worst. All throughout the film I was left cringing at his dialogue and his motivation, this kid was just too much of an arrogant brat to sympathize with or even understand.",
      "total_reactions": 5,
      "user": "Melcher"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2011
      },
      "score": 4,
      "text": "This movie was below average. At some point it even felt like a parody, because the dialogue was so bad. I have to say I liked the idea of the movie - robots as boxers - but that was the extent of it. As for Hugh Jackman, I was amazed that he would be involved with this kind of movie with such a weak storyline. The robot fighting scenes where interesting and also CGI was great.",
      "total_reactions": 5,
      "user": "L490"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 1,
      "text": "I don't do movie reviews, but OMG, I can't believe the professional reviews (bought by Disney?), or the 7.9 by viewers.  1/3 of the way through the movie I asked my wife what the worst movie we'd ever seen was.  We agreed this was probably it.  We made it through to the end, but it is the weakest Disney effort we've ever seen!",
      "total_reactions": 8,
      "user": "dinka"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "One of my favorite movies, the movie is an instant classic in every way. Great to take the family to, with the gf, go with friends... all around a great movie. It has tons of action.... who in their right mind doesn't wanna see fighting robots? It has some lovey dovey scenes, it makes you feel as if you are a part of Atoms journey to greatness and it really brings you into the lives of the main characters. The critics are being REALLY harsh, there's no reason to give this movie any less then a 9. If the movie interests you at all, it's defiantly worth seeing on the big screen. I found myself cheering Atom on the whole movie and really felt as if I could connect with all the main characters. Can't wait for Real Steel 2.",
      "total_reactions": 3,
      "user": "VisiOn"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "This is highly likely the film of the year. It's a daft concept, Rocky with robots, but it works and it works brilliantly. The film maybe cliched in it's plot but you should already expect that the estranged father and son will make amends and win the competition etc. These are acceptable cliches they are the cliches that you will enjoy seeing and thankfully the ones that you don't like to see are avoided. There were many points where I expected a certain cliche to happen and then nope it was avoided, it shows their was care and consideration put into the making of this film. The film gives you what you want and is a totally great feel good film. The robots look fantastic and the boxing is edge of the seat stuff, you will really give a damn about Atom winning his fights. Jackman is great as always and the little kid in this reviewers opinion was excellent although kids can be make or break for alot of people so you'll have to decide for yourself. Fantastic film, you'll love every second. Only problems are gangsta COD player soundtrack and lots of product placement. Easy 9/10, go see it!",
      "total_reactions": 3,
      "user": "Ubermetalhed"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "I found the movie very likable 3/4 of the way, but then the movie became very childish at the end. The special effects are very good, probably the best ones I seen to date.",
      "total_reactions": 3,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2012
      },
      "score": 0,
      "text": "This is one of the worst movies I've seen this year.  The premise was interesting, the execution was not.",
      "total_reactions": 3,
      "user": "Spanky"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2011
      },
      "score": 3,
      "text": "\"Real Steel\" might be a success with 7 to 12 year old boys, who think that action without soul is cool. Robots get into the ring and duke it out forever. Special effects are nice. Unfortunately there is nothing interesting about these robots. They are just chess pieces inside a single square. The players are outside the ring, but turn out not to be interesting at all. The queen of Lost is lost. \"Wolverine\" attempts to be \"Han Solo\", but fails to both shoot first, and even shoot at all. There is a boy in this movie, someone kids can relate to, good with technology, able to remake a robot overnight in a trailer, add voice control and stuff like that. Normal kid. It could have worked if the story wasn't so overly sentimental. I think every major character shed  a tear close to the end. I did not. What \"Real Steel\" needed was some reality and some steel. Some kind of chaos would have been nice. Some conflict that you could believe. Well, \"Real Steel\" didn't work for me, but due to impressive animation I'm willing to give the movie 3 out of 10. I saw potential in this movie. Like at a moment when a robot hugs a kid, what would have happened if the robot had by accident squeezed a bit too hard? I guess it wouldn't have been such a cute movie, but could have raised the stakes from zero to something, at least. Maybe.",
      "total_reactions": 12,
      "user": "Sleeper"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "\"OVER THE TOP\" with Sly Stallone = Child Custody + Arm Wrestling",
      "total_reactions": 1,
      "user": "HazukiRyo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "So Wolverine trains a Transformer, so that he could box like Rocky Balboa, in a rock ' em sock 'em league ? Some viewers may say that the story is ridiculous and it looks like it's gonna be a sh*tty movie, but there death wrong. \" Real Steel '' is the perfect movie to go see with some friends and family on any occasion. It's a heart warming, great, awesome movie about robot boxing. Even if it's predicable, the film is still entertaining and enjoyable. You know when you see a recognisable actor, you have seen him before, but you don't know his name. Yeah, I'm talking about Kevin Durand (as Ricky) , that guy, which he plays a complete d*ck, like most of his movies. For some reason I wanted to specify that, because I finally know his name. Anyway, Hugh Jackman showed once again his good acting skills. I notice that there were a lot of mean, snobby, arrogant characters, but very few likable ones. Also, the robots battles were so anticipating and intense, that I really wanted Atom to win. The connection between Max Kenton (played by Dakota Goyo) and the robot (Atom) reminded me of the movie '' The Iron Giant '' (1999). You know what I'm talking about, that special chemistry (just not as intense). The special effects were amazing. It's an enjoyable movie, definitely worth to watch.",
      "total_reactions": 1,
      "user": "scrieciu"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "How to make boxing can be accepted by young children? In thiz case, the answer is REAL STEEL. The Director Shawn Levy cleverly turns the rough boxing matches into fun, passionate and enjoyable family adventure by presenting attractive and super-cool Robot figures. Levy is well-known for CHEAPER BY THE DOZEN (2003) and NIGHT AT THE MUSEUM (2006). For me, he seems to know how to roll the dice of excitement. Besides being effective in constructing believable and powerful Robot-fights, thiz movie has heart-warming story of father and son relationship. Charlie Kenton (Hugh Jackman) is a former professional boxer who turns out to be Robot-fight promoter, just met his 11-year-old son he never knew before, Max (Dakota Goyo). Instead of Charlie teaches life lessons to his son, Max. On the contrary Max has been inspiring his father how to win World Robot Boxing, but more than that is about how to win life. There are some encouraging and gratifying scenes. One of them is when Max and his Robot, Atom show their dance moves. On the other side, I can almost say thiz is probably the most humane character that ever played by Hugh WOLVERINE Jackman. While the father character looks troubled and typical anti-hero, but it is relatively effective to gain sympathy. Spoiler Alert! The final scene reminds us of first ROCKY (1976) where the hero did not have to win the match, but he certainly won the heart of audience. Max shows his big heart by saying -It sounds pretty good to me. The Robot with the heart? Awesome!",
      "total_reactions": 1,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "I think that the majority of the reviews for 'Real Steel' are not only harsh but smack of reviewer ignorance to the point where I even wonder if they watched the film. Yes it is a bit sappy, sometimes a little too much but it is a family movie for goodness sake. Take care when reading reviews from ragazines like the NY times (where the reviewer makes so many factually inaccurate statements about the film that it is obvious he did not watch the whole film) and pay attention to Metacritic. Spot on.",
      "total_reactions": 2,
      "user": "mcTwex"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2012
      },
      "score": 7,
      "text": "I was pleasantly surprised at Real Steel. I was expecting a Rocky carbon copy at best, and another Transformers instalment at worst. Yes, it does owe a lot to earlier boxing movies, the Rocky series in particular, from which it \"borrows\" entire story arcs, but it still manages to present enough new ideas to leave its own mark. At its very heart, Real Steel is a very human story about an estranged father and son growing to love each other through a shared passion, and through shared struggles. The film also has exhilarating action, interesting visuals which blend the futuristic with the retro, and an unexpected amount of decent laughs. Hugh Jackman does what he does best - playing another gruff streetwise smart-ass hiding a kind heart, and Kevin Durand makes a good villain, a rich and brutal Deep South scumbag. Everyone in the cast is acted off the screen however by the young Dakota Goyo, who looks a bit like The Phantom Menace's Jake Lloyd but has bucket loads of attitude and considerably more talent. Despite the film getting so many fundamentals right, you have to ask what the character of Evangeline Lilly's boxing club owner Bailey brings to film beyond bubbling romantic implications with Jackman's Charlie, you have to ask why the film needs to be over two hours long, and you also have to ask why Real Steel needs fighting robots at all. My guess is that the decision was purely mercenary, as the story would have worked just as well as a contemporary tale about a damaged father-son relationship that is healed through their shared experience with boxing.  But hey, robots beating each other to rust is cool, and you really can't complain much when the resulting film is this fun.",
      "total_reactions": 1,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2012
      },
      "score": 6,
      "text": "Real Steel is very predictable, has an annoying Justin Bieber character whom dances with robots and has a story with unnecessary 'conflict' stuffed in to fill each scene. The robot designs were so so and the story was meh. Real Steel is watchable and I didn't hate it but is uninspired.",
      "total_reactions": 1,
      "user": "davenbettridge"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "It's not the best action-thriller/drama in recent years, but it's not Transformers. It's a reasonably compelling -- and heartwarming -- story with a terrific cast and exhilarating fighting sequences as well as stunning special effects.",
      "total_reactions": 1,
      "user": "asjklas"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "I am 31 years old and I caught myself clapping at one point.  I love all sorts of movies and I believe they are meant to allow us to suspend reality for 2 hours.  I think our opinions on movies also depend on where we are at in our personal lives at the time we see it. I was looking to relax with a movie about boxing robots and I achieved that.  Real Steel is pure entertainment.  It will really surprise you and leave you smiling and feeling like a kid again.",
      "total_reactions": 1,
      "user": "matto"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "A really surprising win, i'd heard from just about everyone that it was complete **** then watched it with some mates, and bam, I am never trusting Sarah Ison again. It opens with \"All of my Days\" by little-known (but freakin amazing) singer Alexi Murdoch, who SGU fans will know from S1E3 \"Air\", with his (arguably, best song) \"Breath\" featuring at the end. The moment that song started playing, I could feel a win coming on, the plot is fairly stereotypical, in what i'd like to think is a bizzare threesome child, the parents of which were Rambo, Robots and Big Daddy, but its genuinely touching and with the exception of the odd cliche here and there, not at all unbelievable. The acting is top notch, with every major actor playing their respective roles with true feeling and commitment that's rare to find in mainstream movies these days, particular props to Dakota Goyo, who plays Hugh Jackman's 11-year-old son, and of course props to Hugh Jackman himself, who delivers another brilliant problems, Aussie Power FTW. Add to the that the brilliantly choreographed and animated robot punch-ups and some real hardcore **** Yeah!) moments, and there's a movie well-worth seeing. One particular flaw was the average score, while the little ditties in the background did suit the different moods, nothing was particularly memorable, but this is more than compensated for by the brilliant soundtrack, featuring several well-known songs that when used are used very well ---Final Verdict: 7.5 (-Rounded to 8)",
      "total_reactions": 1,
      "user": "DarkEnergon"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2012
      },
      "score": 3,
      "text": "Real Steel is a unique premise. Boxing has been stopped in favour of robot boxing and Hugh Jackman's Charlie is just trying to keep up. Along the way he is joined by the son he abandoned 9 years earlier. He is joined by him because his mother has died so he takes him on the road, showing him the world of robot boxing. The problem with this unique premise is that it never really makes sense. The script sweeps under the rug some major plot points (The death of the son's mother is mentioned literally once) and is packed with clunky lines and exposition. The cast is sub par with the worst offender being either Evangeline Lilly as Charlie's love interest Bailey or Dakota Goyo as Charlie's son Max who is remarkably reminiscent of young Anakin Skywalker (yes, its that bad). Jackman coasts through the movie on charm despite the fact his character really is reprehensible at times. However the action in the film is visually flawless with some great animation and effects with the robot fights being great to watch. The main problem with the film is that the main story doesn't start for a whole hour (much like S.W.A.T) as Charlie makes mistake after mistake. I get that its trying to show what kind of a man Charlie is but its just slow and pointless and could have been done in half the time.",
      "total_reactions": 2,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2012
      },
      "score": 4,
      "text": "I only need one line to describe this film:",
      "total_reactions": 2,
      "user": "YossGold"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Good film overall. Balanced in all sense, not tilm of the year, but a film that must to be seen soon or later (maybe in TV at last). Definitely is precdictable but after all sometimes we like to have the possibility to receive what we want to be given to us.",
      "total_reactions": 1,
      "user": "SirLouen"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "What a nice surprise Real Steel is. A movie with cold, ton-heavy steel destroying each other in a ring while maintaining a passionate and emotional story about a father and son reunion. It has big-budget special effects intertwined with a heartfelt family story. Itâ",
      "total_reactions": 1,
      "user": "Sir_Brandon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "Loved the movie.  Futuristic version of the original Rocky.  Nice tale of a father learning to be one.   I would recommend highly.  PG-13...there is some violence, but not brutal as in the Rocky Saga.",
      "total_reactions": 1,
      "user": "sunshinestnt"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2012
      },
      "score": 3,
      "text": "This is the worst movie I have seen that was actually trying to be a terrible movie, every aspect of this film is a complete  failure, film techniques are so basic, the music is crap, acting is garbage.  Also did i mention all the terrible ad placements hp or nokia. Not to mention if this were actually possible all the technology bad for the future it is trying to make sense but it just doesn't make any at all",
      "total_reactions": 2,
      "user": "hootis"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2012
      },
      "score": 2,
      "text": "Just bad so so so bad.  There is just so much wrong with this movie, but the kid is what really ruins it. His acting is bad, his character is annoying, and by the end I wish Hugh Jackman's character had sold him and this whole little adventure had never happened. As for the plot, if the reason robot fighting was developed was because people wanted more violence why wouldn't it be robot MMA? Another annoying thing is that it's   clear that Hugh Jackman's character doesn't know how to box a small but very annoying thing. Overall just a terrible movie.",
      "total_reactions": 1,
      "user": "Rhino3"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "Cheer,clap,shout, everything you will do when u will watch this movie. i am totally agreed with the comment by @Badgerbrad. \"You may get a tear in yor eye\". According to movie is movie is just Awesome..Watch it for sure to see what motion pictures can do..",
      "total_reactions": 1,
      "user": "subhadip1524"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "If I was ten probably I would have liked this movie. I cant really understand why Jackman done this movie. It doesn't suit him. No action no adventure nothing at all. Its like Rocky in a robot version, the weak but with heart robot defeats the ultimate undisputed one. I would not recommend this movie to anyone.",
      "total_reactions": 3,
      "user": "geo86"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "I cannot deny that it was entertaining, but it kinda disappointed me...",
      "total_reactions": 1,
      "user": "MickeyMickMic02"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2012
      },
      "score": 4,
      "text": "Story line malfunction and childish dialogue. The trailer presents Real Steel as hardcore action, not an under ten year old adventure, and don't even expect the \"fight for me\" ending to be any better, just nonexistent. (message me for my full evaluation)",
      "total_reactions": 1,
      "user": "tterch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2015
      },
      "score": 1,
      "text": "I **** love robots. I'll watch pretty much anything with them, but good god this movie is unwatchable. All the characters are unlike-able **** the story makes no sense, the pacing is **** This could be forgiveable, but you know how all the fights are going to go, so there is no tension, and forget any real boxing moves either. There is no excuse for even one of the many shortfalls of this movie. I'd rate this movie two stars, but I'm taking it down to one because how just how much terrible movies like this bring down the movies-about-robots genre.",
      "total_reactions": 0,
      "user": "phildog"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Real Steel is a knock out win.  With the heart of a champion and the humanity required to make a robot come to life, this movie is without a doubt one of greatest heaps of fun I didn't see coming.  I can't say that everyone is going to love it as much as I did, but Real Steel's ability to capture the imagination is hard to turn away from.  On top of that, the inevitable David vs Goliath moment is one that js hard to forget.  I can't remember an underdog movie that I enjoyed as much as this.  Highly recommended.",
      "total_reactions": 0,
      "user": "SchroederRock"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "Predictable, fun and with a heartfelt story but Jackman's acting let's it down. Young boy actor had a great personality and basically carried the film in my eyes, Surprised that Jackman's acting was so sub-par as usually enjoy him in pretty much anything. Disappointed.",
      "total_reactions": 0,
      "user": "beelzie14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "This utterly mediocre movie never makes you want to walk out in disgust but it never makes you want to see it twice either. Mixing elements of Xbox360 Kinect and Rockem Sockem robots for what I'm sure will be a profitable toy tie in this movie is ideal for kids the age of the star but adults may be bored at the predictable fair. They have parts from pro bots but never even upgrade this sparring bot. it makes no sense for him to win or for the deadbeat dad to come around to being a father but it's not horrible. it's not great either. It's just one big robot **** fight with a father son team. it was okay, take your kid to it.",
      "total_reactions": 0,
      "user": "tingle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "In the near future, for reasons that are only briefly alluded to, boxing has been replaced by the ‘Robot Boxing League’. A down on his luck ex-boxer (and now robot boxing promoter) finds out he has an eleven year old son and they attempt to take a discarded old robot to the top of game.",
      "total_reactions": 0,
      "user": "drlowdon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "A histÃ³ria Ã© ruim, mas as cenas de luta sÃ£o completamente contagiantes. Ã",
      "total_reactions": 0,
      "user": "Mateusq"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2011
      },
      "score": 4,
      "text": "Don't let my mixed reaction fool you, Real Steel was a real pleasure. It surpassed my expectations, and I must say, my expectations were quite low. This is one of the few movies which turned out better than its 'sobby' premise suggests, though slightly so. It was a 'people-person' film. It had a decent story line, that unfortunately fell prey to predictability, but still managed to pay off a bit. It also had a charismatic cast who you couldn't help but root for. The robot sound designs were fantastic adding weight and, most importantly, character to all these different types of boxing machines. On the negative side, it was a film that's only really good for the moment; it doesn't stand out much in any way. It fell victim to many cliches (as mentioned before) thanks to its by-the-book approach in telling the story. And most of all it wasn't very ambitious; in other words, it didn't strive to go beyond what it was meant to be; which was a mildly entertaining action flick.",
      "total_reactions": 0,
      "user": "lahaine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "The movie was amazing. At first i wasn't impressed at all but when the plot developed - it really got me going and wanting more. Even a tear from my eyes. This movie deserves all 10 from me.",
      "total_reactions": 0,
      "user": "sYs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "All around, \"Real Steel\" is made to be nothing else but fun. It's a good time, with a good and fun cast. You really will, and should enjoy this movie. That's what it was made for.",
      "total_reactions": 0,
      "user": "xXRenTyrellXx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "Avec Shawn Levy Ã  la rÃ©alisation (Treize Ã  la Douzaine, La PanthÃ¨re Rose, La Nuit au MusÃ©e), c'est ce qui me faisait le plus pleur pour cette rencontre entre Rocky Balboa et Transformers (mÃªme si les robots sont loin de leur ressembler). Fort heureusement, il nous livre son film le plus \"mature\". D'accord, le scÃ©nario est conventionnel et abuse, avec la photographie, d'une surdose de bons sentiments digne d'un film Disney. Mais Real Steel est le divertissement attendu, attachant et drÃ´le, avec en prime des acteurs charismatiques (le duo Hugh Jackman/Dakota Goyo fonctionne Ã  merveille!), des combats servis avec punch et des effets spÃ©ciaux bluffants. Un blockbuster de plus me diriez-vous? Sans doute. Il n'empÃªche qu'avec une Ã¢me d'enfant, le film est rÃ©ussi en son genre et permet de passer un agrÃ©able moment. En tout cas, je suis fin prÃªt pour un second round!",
      "total_reactions": 0,
      "user": "avatar16"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2011
      },
      "score": 6,
      "text": "Entertaining, but nothing more then that. Lack of content, acting a little bit turmoil, since they didn't had much to work with. Fighting scenes were interesting (exaggerated sometimes), and the kid was super annoying.",
      "total_reactions": 0,
      "user": "FIlmsareawesome"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "Skip-it - You already know about the dumb robot-boxing plot, but the actually-exciting, over-the-top, Hollywood action will pull you in if you're not careful. Skip this film -- even if it's on HBO.",
      "total_reactions": 0,
      "user": "RyanPratt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "i had the best time ever at real steel especilly because i watched it in vmax.it has all of these robots with trainers coming out with them. the good parts of the movie are when the bull fights the robot at the start of the movie [to many robots so i can not remember their names] wern't that many good bits . now to the bad bits. the first thing i didn't like was the dark scenes",
      "total_reactions": 0,
      "user": "reviewlover"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "this film stinks the plot has so many holes it. the acting is dire and wooden.  why do they persist on giving kids adult  dialogue? the kid says things that no kid would say. they said that humans get tired of watching other humans fight yet you got robots pummeling each other and squashing heads with crowds cheering. the kid an father have not seen each other for years yet they get on straight away no animosity and no withdrawn actions from the child. the movie is cliched and devoid of character development also the language used by the kid only goes to show what type of world we are living in now when directors are only encouraging children to be rude to adults but also swear",
      "total_reactions": 0,
      "user": "cpalmer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "Admittedly, the movie suffers from a somewhat predictable plot. However, that doesn't take away from the fact that it was a lot of fun to watch. The CGI effects were fantastic and the action kept me engaged the whole time, especially since the idea behind the movie was original. If you want to be a spectator for exciting robotic fights with great visuals, \"Real Steel\" is a definite must for you.",
      "total_reactions": 0,
      "user": "Shadow_05"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "This was much better than expected. Yes, it's a pretty daft plot and the father/son thing is a bit schmaltzy but there's no denying the director's skill when it comes to entertainment. Jackman is an engaging leading man and there are enough good jokes and exciting action sequences to put a smile on the grumpiest face. Terrific Friday night nonsense!",
      "total_reactions": 0,
      "user": "BobMcDevitt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "Rocky with Robots! It was packed with excitement and amazing visuals.  Cast was awesome and funny.  This is movie is definitely for all ages.  Though it doesn't make you think that much, it is pure entertainment.",
      "total_reactions": 0,
      "user": "chilango"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "Could have been better in a lot of ways but Real Steel fails to get the action and drama affect me. The action sequences just looks like a cartoonish fight night version of pacquiao and his rivals.The drama is corny and nothing that will make you cry. The 3D is great to see in IMAX but basically the film is just boring!!! Don't waste your time watching in IMAX, maybe it's worth to see in 2D.",
      "total_reactions": 0,
      "user": "infinityqs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "This movie surprised me. I thought I was going to go into the movie with just mediocre expectations only because I had heard just ok things about it; nothing great but nothing terrible. But as I was watching the movie, I found myself really enjoying it. It is just one of those feel good movies that I could not help but like.",
      "total_reactions": 0,
      "user": "absheffield23"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "Great Movie. Perfect Match of emotions, Robotic-Actions (very Importantly not over done) and some comic scenes.\"Real Steel\" is awesome. I did not expect this going in. It is more than just \"Transformers\" meets \"Rocky\" doing \"rock-um sock-um robots\". I saw Hugh Jackman on Jimmy Fallon talk about what made him enroll in the project. \"Real Steel\" beyond the visually astounding CGI glitz and spectacle is the touching story of father and son defining love and respect. Any movie that gets the audience involved in a positive way and leaving cheering is an excellent movie. It is like Rocky on adrenaline and with a whole lot better acting. Hugh Jackman, Evangeline Lilly and Dakota Goyo all have great performances. Dakota who plays the son really makes the movie, but all the actors performances are great.",
      "total_reactions": 0,
      "user": "moviekretik"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "I thought that the idea in Real Steel was bad but there was a lot more to it than I expected. It had a good story and great performances from all the actors.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "It was relatively ok, it could have had more action and a better plot and story line, acting was good and special affects were also great but I had a good time watching, its something older people and kids can enjoy together,",
      "total_reactions": 0,
      "user": "EPIXMAN15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "I was pleasantly surprised. I wan't expecting a blockbuster, and I wouldn't say that it would have won \"movie of the year\" from my envelope. The dynamic relationship that developes between the father and son was somewhat cheesey, and it detracted from time that COULD have been used for more white-knuckle fight scenes. The special effects were on par with what I was expecting, and yet the storyline only barely more than mediocre. Overall, I would recommend the movie...just don't expect an earth-shattering breakthrough",
      "total_reactions": 0,
      "user": "BlackFox0911"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "Not Bad. Seems like more of a child movie, as the sense of Robots who just punch and Jab eachother. I thought throughout the whole movie, that the effects were great, yet the storyline was lacking. not much was explained, and it felt like the journey jumped from beginning to end when the fights began. what, 1 real fight, then portions of a fight, then champion fights?",
      "total_reactions": 0,
      "user": "PinkamenaPie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "Really, sleeper? This movie is a great family movie. it has it's faults: it can be corny, and sometimes just has meaningless action, but overall, it is a feel-great movie! One tip: DON'T EVER WATCH IT MORE THAN ONCE!",
      "total_reactions": 0,
      "user": "oscarr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Before I watched Real Steel, I thought it would be a robot-version of 'Tekken'. From the beginning I realized that that wasn't the case, and that it does have a story. The story might not be as good as other movies, but this movie is awesome for it's kind because of the nicely made fight scenes and special effects.",
      "total_reactions": 0,
      "user": "Exi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "This movie was way better than I expected going in. The acting is outstanding, the story is interesting and pulls you in, the action and fighting scenes are phenomenal, etc. Honestly, it's essentially Rocky with robots. The only negative I have about the movie is that the premise is a bit silly but if you can look past that, this really is a fantastic film. The idiotic critics didn't find it to be a good movie but then again, they're rarely correct with any of their assessments. They tend to think unique, even if terrible, is better than great but a little cliche. I can't disagree more. This movie, outside of the robot element, has been told a 100 times before but it is still a strong movie in its own right and worth watching.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "I have no great love for boxing movies; I find that they have the same plot, pretty much (\"Rocky Balboa\" I watched and liked because of Milo Ventimiglia). Robot boxing, as an idea, seemed interesting to me (maybe it has to do with my love for the Transformers franchise), and Hugh Jackman, while not my favorite actor, didn't hurt.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "I dont care about what the critic's say..for me, what matters is whether I enjoyed the movie or not..and trust me..you will enjoy each and every moment of REAL STEEL..right from the careless Hugh Jackman..the Japanese Noisy Boy..Dakota's innocence..Evangeline's beauty to the ultimate inspirational friend ATOM..everything is cool about this movie..I really wanted somebody to replace Transformers..and this movie has done it..",
      "total_reactions": 0,
      "user": "rockstar283"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "This film is the reason I decided to do my own movie reviews. After hearing a review for this film from BBC Radio 1â",
      "total_reactions": 0,
      "user": "wildermovreview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "Hugh Jackman is awesome as \"Charlie\" a dead beat \"has been\" boxer, who has pushed his career & luck to its limit. Now a few years after retirement, he makes a living by betting on underground robot boxing. The way this works is someone controls a 1,000 lb. or more robot with a what looks like an I-pad with joy-sticks. The opening scene is \"Charlie's\" robot going up against a very large..... bull. Yeah, a bull. Every thing seems to be going well, but that goes down the toilet when \"Charlie\" got a little too **** with his robot & takes his eyes off the bull. The rest is history, after losing that bet & match Charlie decides to run out on paying the opponent. Something that will cost him in the future, but not before running into two guys who break him the news that his \"ex\" girlfriend just passed away due to cancer. Well Charlie & her had a son together, a son he's never met. The following morning, Charlie goes to court to basically sign over his rights as a father over to his ex-girlfriend's oldest sister. Only problem was that it wasn't that simple, the sister & her new wealthy husband were gonna take a trip to Italy for the summer. Which means Charlie would have to take care of him for the summer. Charlie agrees to do so, with the condition of $100,000. I told you  he was a dead beat, remember? So he basically sells his son for 100K. 50 now, then 50 at the end of summer when the sister & her husband returns. In comes \"Max\" the son he never met, & let me tell you. This kid charmed the **** out of me! Charlie & Max have such a tremendous chemistry together, that is over whelming at times. Back to the set up. Charlie takes that money & buys a robot named \"Noisy Boy\". This robot is Japanese & looks like the \"Shredder\" with Japanese symbols all over. He was a bad ass looking bot. Only Charlie being money hungry puts \"Noisy Boy\" in a underground main event fight, right away. The fight is pretty awesome, the special effects are very well done. So is the choreography. Of course \"Noisy Boy\" gets his ass torn apart, literally. So Charlie is right back where he started no money, & no bot. He & Max break into this junk yard for robots. There Max finds a \"Sparring\" bot named \"Atom\". A sparring bot is a robot that \"fighting\" robots beat on during practice, but \"Atom\" was different. That is what I'll leave you with. The film was very well made, the fights, the characters & most of all the robots were awesome. You will be cheering from your seat, I guarantee it. This film reminds me so much of the original \"Rocky\". About a fighter who fought against all odds with nothing but heart. I recommend this film to the entire family. \"Atom\" will have you swinging your arms like a boxer & cheering till the credits come on.",
      "total_reactions": 0,
      "user": "Creeper5150"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "Real Steel is a fantastic film, with great visual effects and amazing actors and I will highly recommened it to everyone.",
      "total_reactions": 0,
      "user": "Horsemad7009"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "As soon as the first of many electrifying robot battles in \"Real Steal\" went underway, I found myself instinctively recalling old memories that I didn't know I still had. I remember how I used set aside furniture in the living room to create space for an arena. I would gather my toys in that arena, and our gang would have some fun. I thrashed them all around, pounded them against each other, and flung them against the ruthless ceiling. Things would be cooler if my stuff could do more than just withstand nonstop hammering, but it was a restriction that my imagination couldn't handle.",
      "total_reactions": 0,
      "user": "AutiTakahashi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "Not comparing it to the Iron Giant or Rocky. Movie's CGI effects are the real deal.Fighting scenes and the concept is great but the story and acting is not that good.. i felt that in some parts movie became cheesy.Emotional scenes are really overdone,Not needed in some parts. I expected the movie to be great But it was good and could have been better.But if you are looking for entertainment there it is",
      "total_reactions": 0,
      "user": "moviebuff_420"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "Yeah, I'm comparing this movie to Transformers. Deal with it. Real Steel takes place in the near future, 2014 I believe, where robots have replaced humans for boxing. People still control the robots by a controller that looks like an technologically advanced version of the Wii U controller. Anyways, the story follows Charlie Kenton (Hugh Jackman), a former boxer, who got into robot boxing but seems to be losing his touch. When he finds out that his ex-girlfriend has died, he must take care of his child, Max (Dakota Goyo), for just a while before his sister in law comes back from Italy. During this time, Charlie buys another robot and it ends up getting getting pummeled. After a while, Max stumbles upon an old Generation 2 sparring robot, AtomÂ",
      "total_reactions": 0,
      "user": "Tall_But_Short"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2012
      },
      "score": 5,
      "text": "It's hard to knockdown a movie like Real Steel. Hugh Jackman is a genuinely good actor with a nice supporting cast surrounding him. The visuals are incorporated well that you don't think twice about them being around humans, and the fight scenes are well filmed. But when the actions slows and the humans come into the picture, it begins to strain its story with too many emotional highs and \"big\" moments. Worse still, it thinks its sly with these situations, which makes it seem a little shameless. It' not a bad movie, but its not the great movie it thinks it is.",
      "total_reactions": 0,
      "user": "AGGabriel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "This was no where near as bad as I first thought it could be and in my head all I could hear was the Rocky soundtrack but still, this film isn't amazing either. Parts of it were emotional, a very tiny proportion was funny and some bits were charming. A standard film made for children.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "This movie is legendary. It is everything you want in a family film and more. It has robots and intense fighting scenes but this film also weaves in a real sense of heart, humanity. It makes you laugh, cry, shout, snicker and say awww. Not only a movie that is filled with adrenaline, but also a movie with a great deal of heart. It is in line with great classics like Rocky, definitely a movie that you will want to watch over and over. I do not know what is wrong with the people who give it a low remark, i think they are insane or just plain dumb. The kids 10 years old, give him a break!! And bad acting, bad music, bad storyline?! What the **** is wrong with all of you?! The reader of my review, PLEASE trust me when I say that they are outta they're mind, it is an amazing movie and you'd be filled with regret if you didn't watch it. It is amazing and I applaud the ones who created it, thank you.",
      "total_reactions": 0,
      "user": "Aurora96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "56? Are you serious? Real Steel is one of my favourite movies. I know that it isn´t perfect, but it is a very good movie. There are a lot of better movies, but Real Steel is almost perfect.",
      "total_reactions": 0,
      "user": "Alanbrito2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "Great font of entertainment, and awesome adventure with little messages, perfect and adaptable for all ages, it's not a great and touching movie but is funny and have a great history.",
      "total_reactions": 0,
      "user": "BrunoZrZr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Very funny, heaps of action, altogether Real Steel is a great stay at home movie. It can trigger emotions, but straight away all that is whisked away by fighting, dancing robots. In conclusion, I would definitely recommend this to anyone wondering if it's worth it. Trust me, you will laugh out loud!",
      "total_reactions": 0,
      "user": "ArticleReader"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "Real Steel was more or less an average movie. While the story and characters felt undeveloped, it was quite entertaining watching the fight scenes. The acting was not bad, but was not the best neither. It was like a mix from Rocky and Transformers.",
      "total_reactions": 0,
      "user": "ag10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "it's a great movie with an usual story  i mean you can't see robots rustling everyday  and it was great idea for Hugh Jackman to Starr-in  after the boring x-men sequences  i loved the energy and the effort putting in this movie and definitely will watch the rest of the sequence if there is any.",
      "total_reactions": 0,
      "user": "ExKing"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "Did not expect to be giving this film a 9, but it's fun, exciting, and very easy to get emotionally invested.  Director Shawn Levy has a very spotty record, but this is his best work.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "Watch this movie! Good story, great action, minor story weaknesses... but overall an amazing action fantasy you'll enjoy... i give you 70% guarantee ,  7/10",
      "total_reactions": 0,
      "user": "SEROJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2014
      },
      "score": 6,
      "text": "I kept on waiting for a \"ghost in the shell\" plot that never materialized. I don't have a problem with the father/son story, but remote controlled robots as a big time event is too silly for me. Perhaps if they had gone a little closer to reality and featured a father/son robot story based on what has already been done in robot fighting, i.e. Battle Bots, and kept it small time I would have accepted it. But I really needed the kid's bot to turn out to be another Sonny, from I, Robot; or B1-66ER of The Matrix; or Andrew of Bicentennial Man; and to give that line of the story a lot of face time. At the end it seems clear that Atom, the robot, was indeed working autonomously but it comes too little too late. (Also, it's not super clear weather or not this is a robot with a human soul, or 'Ghost', or simply a learning computer AI being slightly evolved...).",
      "total_reactions": 0,
      "user": "birdmannavy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2016
      },
      "score": 7,
      "text": "I remember when this film first came out, I was in 8th grade and I was a gigantic fanboy of the film and I probably considered it one of my favorite films. Obviously, as I've grown older, my fanboyism has cooled down considerably, but all things considered, \"Real Steel\" is still a pretty good film. It's action-packed, thrilling, pretty well-acted, and decently written, and while it's not some spectacular, cinematic miracle, it's certainly an enjoyable romp. \"Real Steel\" is definitely an exciting film that's well worth a watch.",
      "total_reactions": 0,
      "user": "FreedomFighters"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "Good film for young audiences. The action-packed fighting scenes is incredible, the story/plot is good (and like what I said before, the plot is (kinda) for young audiences.",
      "total_reactions": 0,
      "user": "McFranz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2014
      },
      "score": 1,
      "text": "Really stupid movie. I was cringing and squirming in my seat for 90% of the movie because it was so cheesy and melodramatic and the only pay off for this were a few robot fight scenes which were at least entertaining (unlike the human story.) This is probably the most annoying child actor I've ever seen (yes even worse than Anakin.) I think I nearly shot myself in the head whenever that little brat decided to dance. Hugh Jackman was good though. What can I say? The guy is a movie star.",
      "total_reactions": 0,
      "user": "BigDamnHero"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "Real Steel is a good movie. Hugh Jackman is overshadowed by the kid Dakota Goyo. Besides the slomo, the silent shots and Atom losing, Real Steel had an excellent build-up but a weak ending",
      "total_reactions": 0,
      "user": "ZChong"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "Here \" Real Steel \" where is Hugh Jackman , and modern robot boxing match . jaj ! It has possibly been a good idea but a little interesting process , but fighting robots has been more interesting to finish .",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "What a very inspiring movie about a father and son relationship. It also offers a lot of great lessons. I truly enjoyed watching this film, plus the fact that Jackman is always hot.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "I have personally outgrew this film. The movie's just basically Rocky with Transformers over it. This isn't my type of taste in movies anymore as I find better movies to watch.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2016
      },
      "score": 3,
      "text": "Extremely disappointing I came into this film expecting robots boxing each other as Hugh Jackman acts as a manager,instead I got a infuriating kid,a uninterested Hugh Jackman and horribly done fights. Would not recommend.",
      "total_reactions": 0,
      "user": "AgentVenom117"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2016
      },
      "score": 9,
      "text": "This movie is predictable but awesome. Evangeline Lilly gives such a great performance.  No matter what you think of Lost, this movie established her as a real actress.  Dakota was good too.  They both carry the rest of the cast.",
      "total_reactions": 0,
      "user": "HatersWannaHate"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2017
      },
      "score": 8,
      "text": "I rewatched this movie today and it was better than before i watched the first time, sure its like rocky for robot, but it doesn't make it any worse, i'm a sucker for the underdog movie and this movie does that exceptionally well, Hugh Jackman is great in here and the 3rd act is breath taking",
      "total_reactions": 0,
      "user": "thedaywalker"
    }
  ]
}