{
  "mc_avg_user_score": 7.0,
  "mc_metascore": 60,
  "mc_mixed_rating_frequency": 58,
  "mc_movie_name": "RED",
  "mc_negative_rating_frequency": 22,
  "mc_positive_rating_frequency": 235,
  "mc_pro_critic_reviews": [
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2010
      },
      "score": 70,
      "summary": "All those guys are a blast, and the dark-hearted idiocy of Red is mostly quite enjoyable."
    },
    {
      "critic": "Angie Errigo",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2010
      },
      "score": 60,
      "summary": "Good fun, and though it breathes hard in the second half, the ensemble has charisma to spare."
    },
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2013
      },
      "score": 20,
      "summary": "The movie doesn’t have a funny bone in its body, clomping from one unoriginal set piece to the next with a head-scratching lack of urgency."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "\"RED\" is a occasionally-funny action movie with old guys like Bruce Willis comes out and shoots guns. I know, its monotonous and boring, but at least it's better than \"The Expendables\".",
      "total_reactions": 5,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "\"Red\" is a surprisingly funny comedy that has a great plot, that just leaves you wanting more. With what would seem a typical action flick story about ex-CIA agents, it is the surprise factor how good the film is, that really got me to appreciate it. The story is ok, but the dialogues are just extremely witty, especially John Malkovich's lines. That being said, John Malkovich and Mary-Louise Parker steal the show. By far the funniest of the cast, they are show-stealers, especially Malkovich with his stuffed (with guns) pig toy. Very creative, very entertaining, very funny, very action packed, and very good acting in the film. Highly recommended if you want a film that will make you laugh out loud for an hour and a half and not feel as if you've lowered your IQ. Great film!",
      "total_reactions": 2,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "Painfully average. The story is your average conspiracy movie shtick, the acting is middle of the line, the humor is hit and miss. How many more ways do I have to say this movie is just average?",
      "total_reactions": 1,
      "user": "KarthXLR"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "Fun and Funny flick! Plot and story line just plausable enough to keep you engaged. Worth the time and money for an enjoyable entertainment. No Oscars here, but what the heck, it's dinner, a movie, and a few chuckles.",
      "total_reactions": 6,
      "user": "BenMtt"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "Man, this movie is awesome! This is how you make an old-people action movie, Expendables!! I saw them film part of this in New Orleans, so I was pretty excited about this movie. But when I saw the first trailer with Helen Mirren with automatic guns and John Malkovich running after some guys with bombs strapped to his chest, I knew this was gonna rock, and it did!!! The entire cast seems to be having a blast, which just helps their awesome performances. I'm a huge Bruce Willis fan, and I wasn't dissapointed. The action scenes are awesome and cartoony, and the comedy had me rolling on the floor!! Overall, with a strong cast, clever wit and dialouge, and some awesome action scenes, RED is an awesome ride that blows this years other action movies out of the water!!",
      "total_reactions": 8,
      "user": "Bullet97"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "Enjoyable nonsense that sags a bit when pushing the far fetched story forwards, but the action is top notch, especially the frying pan scene and spinning police car. In the end it's a feel good movie which is better than The Losers, The Expendables and Salt, but nothing you'll remember in a year or two. If you like Willis, Freeman and Mirren, then you can't really go wrong. And Karl Urban is great.",
      "total_reactions": 4,
      "user": "wetwebwork"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2010
      },
      "score": 8,
      "text": "We are  already half way through the year and that means we are    already half way through the movie season, now I have pretty much seen all the major releases that have come out this year   some great like  \"The Social Network\",  \"Wall Street: Money Never Sleeps\", \"Brooklyn's Finest\" , \"Salt\". \"She's Out of my League\",  \"Inception\", \"Ghost Writer\" and many more. What has been most prominent this year are movies involving teams, out of this whole year I have seem maybe four films that have some kind of elite task force or mercenary group involved. From Sly Stallone's over the top explosion extravaganza \"The Expendables\"  to Joe Carnahan's adaptation of the cheesy 80's television classic \"The A-Team\"(Which I like to call them the  C-Team) to the adaptation of a highly unknown   comic book series \"The Losers\". These  films have portrayed  some kind of elite force that either has to clear there names(The Losers, A-Team) or battle some kind of greater evil afoot(The Expendables). Out of all three of these films the one I had the most fun while watching is the new action/comedy \"R.E.D.â",
      "total_reactions": 2,
      "user": "Lopez17"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2010
      },
      "score": 5,
      "text": "Action film with humour seems to be the latest Hollywood trend: Knight and Day, Killers, etc... The production is solid, and indeed there are a few funny moments and quite a bit of action it did not quite entertain me.  The cast is very charismatic and they have their moments, however the vehicle they are given is not suited for their talents.",
      "total_reactions": 2,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "You are never too old to make a great action comedy, and Bruce Willis and John Malkovich prove that in RED. This wasn't just another shoot um up kill fest with a story you've seen a million times. RED is action packed, but it's also clever, exciting, and hilarious. It's a fresh movie in a typically repetitive genre. Honestly they don't get much better than this!",
      "total_reactions": 2,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2012
      },
      "score": 1,
      "text": "Red deserves a red. This is movie brought together a bunch of old farts to do some action scenes. Bruce Willis needs to give it up and Helen Mirren looks like an idiot shooting a gun. This is was a waste of time. I guess they needed one more highlight before they all die.",
      "total_reactions": 2,
      "user": "csw12"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2010
      },
      "score": 4,
      "text": "Cute movie but totally predictable.  Never any suspense throughout the flick as you know where it is going 5 minutes into the flick.  How can you not like the old timers?  Nothing to write home about.  Forgotten as soon as you leave the theater.  Sort of like old timers day in baseball.",
      "total_reactions": 7,
      "user": "fantasy"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "Based on a graphic novel of the same name, RED  (Retired and Extremely Dangerous) follows a group of retired CIA agents who band together to find some answers after they are being picked off one-by-one.",
      "total_reactions": 5,
      "user": "BeTheBuddha"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2010
      },
      "score": 0,
      "text": "A dreadful screenplay that goes for a walk down the most commonplace of alleyways. A particularly bloated Malkovich was reduced to a cartoonish persona; Mary-Louise Parker was her usual quirky self, which not meant here as a compliment. Helen Mirren and Morgan Freeman were their usual selves, which is not too bad, but does not mean much anymore. It is almost like they have quit trying to act in their old age; like saying \"Here I am. I am Helen Mirren/Morgan Freeman\" is enough. Well, it is not. And, of course, it goes without saying that Bruce Willis's presence would be a more suitable at a greengrocer's than any endeavour involving acting of any kind. The man has the charisma of a paving stone. And its emotional range too. It really still surprises me that projects such as this still get greenlit. I suppose people with more money than sense need to have a target at which to hurl their children's potential inheritance.",
      "total_reactions": 7,
      "user": "spud"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2010
      },
      "score": 3,
      "text": "DO NOT WANT. This movie is bad on many levels despite the all-star cast. The main reasons are that the SUPER LOUD action is simply ridiculous and therefore boring, and the plot is not credible in the slightest. To elaborate, none of the characters here behave in a manner consistent with what a real person would do. They are exaggerated caricatures that come across as very shallow. Are these the kind of people you can agree with, much less cheer for? I hope not. An ex-CIA operative comes stalking (literally) out of retirement. Shows up in the home of a much younger, attractive, and apparently self-sufficient woman who somehow can't find a boyfriend. Why? Don't ask questions, it ruins the only chance you will enjoy this tripe! OK, so she puts up very light, almost comic faux-resistance to being kidnapped by her stalker, and when he finally reveals he's the target of an expensive full-team assassination plot by the good ol' gummint of the USA (why not just poison him or snipe him at his mailbox that he is shown walking to), immediately joins forces with him WITHOUT QUESTION. This former Social Security desk employee is now a fully-committed rebel acting against her government. Unbelieveable. And when she gets assault rifles pointed at her, or sees people blown up and shot, this former customer service phone-answerer does not bat an eyelid nor does she quiver in fear, but turns out to have the reactions of a trained infiltration agent. Credit given to audience for intelligence: 0. Next!",
      "total_reactions": 11,
      "user": "mobyslick"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "Sarah(Mary-Louise Parker) likes to curl up in bed with a book, and not for nothing does she read trashy pulp fiction(\"Love's Savage Secret\"), instead of something literary like, say, Susan Choi's \"American Woman\". After another day of drudgery in her cubicle, all the beautiful woman wants is a little romance and political intrigue before she turns out the lights. Who has time for meta-fiction? The popular/literary novel binary forged by the reading habits of this federal pensions benefits worker, propagates another binary, a filmic one: mainstream/independent(and foreign) movies, where \"Red\", a pulp movie, indirectly questions our preconceptions about literature, in which a paperback novel denotes that Sarah isn't well-read, that \"Love's Savage Secret\" is junk. Our scrutinizing begins the very moment when the reader discovers Frank Moses(Bruce Willis) in her house, as if the ex-CIA hitman stepped out of the pages from Sarah's book. After bounding and gagging her, Frank, in a sense, kidnaps this woman from ordinary life. Will she spy? Will she kill? Will she fall in love? As the old adage goes: Don't judge a book by its cover, so likewise, don't judge a movie from its poster. Due to its first-rate cast, \"Red\" is the perfect candidate to fight for the legitimacy of populist art, as John Malkovich, Morgan Freeman, and Helen Mirren help take aim at the identically titled Krzysztof Kieslowski masterpiece, aspiring to be what Elmore Leonard is to popular fiction, \"the fillet of the genre\"(described as so by the Jeff Daniels character in Noah Baumbach's \"The Squid and the Whale\"), the implication being that the so-called art house-side of cinema doesn't necessarily have absolute hegemonic control over movies for the masses. It was an assertion that the late film critic Pauline Kael(the democratization of art was her pedagogy) would make time and time again in the pages of The New Yorker, cognate to Stephen King's disdain for the literary novel/writer, the diffuse story, and its tyranny over the story well-told. (The EW columnist would champion Scott Smith's \"The Ruins\" over, for example, Paul Auster's \"New York Trilogy\", just as Kael hated Alain Resnais' \"Hiroshima Mon Amour\" as much as she loved Michael Schultz's \"Car Wash\".) So does it make a difference that its Helen Mirren blasting away at the bad guys, as opposed to some lesser actress with half her talent, and being half her age? Hell, yes, it makes a difference. She was the Queen of England, for god's sake; she was also the wife in Peter Greenaway's \"The Cook, The Thief, The Wife and Her Lover\", who in the most kabuki of gestures, cooks \"her lover\" and serves him to \"the thief\", her husband.   Killing is serious business, and Mirren(as Victoria), wields her machine gun with a steely concentration which suggests that she doesn't know the difference between Quentin Tarantino and William Shakespeare. In superlative genre fiction, the author is able to take a stock situation and make it, if not wholly original, then at the very least, not wholly routine. After a bullet catches Victoria on her thigh, the spot of blood that sullies the hit woman's pristine white outfit, somehow manages to look elegant, like a spot of tea on this venerable lady of stage and screen's garb. By far, Victoria is the most compelling character in \"Red\", and yet Sarah doesn't truly identify with her, because if this paperback reader did, she would pick up a gun and start shooting alongside the lethal femme. The contemporary reader, in general, lives vicariously through its characters, because as a whole, they are usually written with the anti-modernist sensibility of having to be identified with. Sarah just wants to observe, not participate, so since she never turns into a contract killer, neither \"Love's Savage Secret\", nor its transmogrifying adaptation, \"Red\", must be any good.",
      "total_reactions": 6,
      "user": "Shiira"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2010
      },
      "score": 1,
      "text": "I just cannot believe some of the reviews for this piece of absolute garbage. I had high hopes but 43 minutes in, and one too many exploding rogue agents later, by a returned grenade from no less the butt of a high-tech CIA gun swung ridiculously by john malkovich (who is just plane embarrassing), i gave up. No more!! This is a plot without an ounce of intelligence or originality, whose characters plod aimlessly from one sub par A-Team TV series set piece to another. I just didn't care enough about anyone or anything....please...do yourself a favour...Do ANYTHING else but watch this tripe.",
      "total_reactions": 6,
      "user": "trilby"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2010
      },
      "score": 7,
      "text": "This movie was awesome, I should this to any DC comic fan and Bruce Willis wanna be fanatics, his awesome and blends well with Morgan F. This movie certainly is on my top 10 movies of 2010!",
      "total_reactions": 1,
      "user": "GathGamer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "RED was a great movie from beginning to end. Full of action packed sequences and laughs, when your not at the edge of your seat watching, you'll be sitting back laughing. Great performances by Bruce Willis and Morgan Freeman, the only downside is that some actors really should quit action movies by a certain age.",
      "total_reactions": 2,
      "user": "Hikaru"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2010
      },
      "score": 8,
      "text": "Fun, humor, action and an exciting story make up this more-tame-than-Pulp-Fiction over-the-top shoot-em-up about a retired group of former government agents/killers who now are the targets of a government trying to protect an executive official.  Mary Louise Parker doesn't stretch much outside of her Weeds comfort zone, but Bruce Willis, who appears to look better with age, shows his appeal on screen yet again showing the tough-and-tender side he's become typecast as being.  His rapport with John Malkovich's character, Marvin, is priceless.  Oscar winner it is not, but RED is what movies are all about.  Pure entertainment!",
      "total_reactions": 1,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2010
      },
      "score": 6,
      "text": "\"Filled with an Outstanding cast of action superstars including Bruce Willis & Morgan Freemen , Red is a fun and enjoyable , sometimes silly and over the top mediocre film. But the wit , charm and Humor & decent action sequences make up for it in the end\" .. B-",
      "total_reactions": 2,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2010
      },
      "score": 7,
      "text": "Truly funny, entertainingly ultra-violent and satirically smarter than I expected, Red is everything you could want in  action movie staring 50, 60 and 70-something actors.  Willis is on his A-game here, and if you've ever liked John McClane you'll like Frank Moses.  The rest of the cast is solid as expected, with Mary Louise Parker surprising (me, at least) with her comedic chops.  The plot reveal isn't quite Dr Strangelove, but it's a well-placed zing at the military-industrial complex and gives a fun movie some added weight without weighing it down.",
      "total_reactions": 1,
      "user": "s1rude"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "The title is an acronym for \"Retired, Extremely Dangerous,\" which describes the trio of ex-CIA agents (Bruce Willis, Morgan Freeman and Helen Mirren). After a few threats on their lives, they team up to find out who's behind the conspiracy. While this is a deftly-crafted action flick, what makes it stand out is the dark comic spin. Add John Malkovich in his most hilarious role ever (who knew?) and Mary Louise Parker as a charmingly-funny neophyte and you've got a smart cast that knows how to deliver. This film won't make cinematic history, but it sure provides a damn good time!",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "Great action flick!  Perfect for a Saturday night.  This movie captivated me as much as Die Hard did.  Willis still rocks it.  Mary Louis Parker was a perfect fit in  this film.",
      "total_reactions": 1,
      "user": "moviehead"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "Despite its top notch cast, \"Red\" suffers mainly from a script that brushes over to many pot holes and develops characters that do not entirely click with each other, a lot of people will probably have a good time at it. Itâ",
      "total_reactions": 1,
      "user": "brewcrewpride"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2010
      },
      "score": 7,
      "text": "Exactly what you would expect--a fun, mindless action-comedy that greatly benefits from the talent of the actors involved. There are some great actions scenes, but most of the fun is derived from seeing actors like Helen Mirren and John Malkovich handling machine guns.",
      "total_reactions": 1,
      "user": "Tony"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "This movie is a lot of fun. It is a quintessential \"popcorn picture\" -- not a lot of substance, but it doesn't really matter because the cast is so fantastic. If you are looking for an enjoyable diversion of the type that Hollywood rarely makes these days, then I highly recommend checking this out. In terms of quality, it is miles above most summer blockbusters.",
      "total_reactions": 2,
      "user": "caligal"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "Great fun! My wife and I loved every minute of this shoot-em-up, from the pretty-good script to the decent acting, from the excellent action sequences to the subtextual references to American politics, the whole flick was enjoyable.",
      "total_reactions": 2,
      "user": "wrytyr"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "I really enjoyed this movie. It is based on a comic book so expect lots of \"over the top\" action sequences; apparently some other users didn't know this. Also, the acting is ok, but this movie being an action comedy, it is completely understandable. I highly recommend this for a Friday night. Please remember, this movie is an ACTION COMEDY.",
      "total_reactions": 2,
      "user": "Paint"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2010
      },
      "score": 6,
      "text": "The rating on Metacritic is pretty much spot on. The film has many interesting and original action pieces, yet they all feel very loosely tied together, with a lack of thought for the narrative to slot in. It has an effective use of casting yet Morgan Freeman is underused. It's pretty formulaic, yet it has just enough charm to keep you interested. The reviews give a good statement on the quality, yet for most of us, we'll be perfectly satisfied with it.",
      "total_reactions": 1,
      "user": "bigmolejack"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "This movie is everything the trailer suggests it will be.  A funny, somewhat campy romp where the old guys outwit the younger ones.  The funniest part for me was seeing Helen Mirren in her formal dress shooting at the enemy on a humongous machine gun on a tripod in a parking garage.  It just looked funny.  Malkovich played the eccentric quirky personality to perfection and had some funny lines.  The movie was not meant to be taken seriously, but instead be a good entertaining diversion and it succeeds.  I also thought Bruce Willis showed some of his playful side (ala moonlighting) that I haven't seen from him in awhile.",
      "total_reactions": 2,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "This movie was exactly what I thought it would be.  A roller coaster ride of action and comedy.  It has been a while since I have sat down and watched a movie that was just fun to watch.  All these nay sayers crying about realism and character plot should stay home on their couch and enjoy their Oscar winning selections.  For the rest of us that want to escape realism for a couple of hours and enjoy being entertained then this is the movie to see.",
      "total_reactions": 1,
      "user": "vanion2"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "You can't go into this movie expecting to have anything really thought-provoking or influential. So that negates a lot of the negative user reviews on here.",
      "total_reactions": 1,
      "user": "sadrans"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "You could say itâ",
      "total_reactions": 1,
      "user": "sonaranet"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "Comic-book based Action Comedy featuring Bruce Willis as a retired CIA analyst.  A hit squad are dispatched to take him out, for reasons unknown and so begins the adventure.",
      "total_reactions": 1,
      "user": "jediboy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2010
      },
      "score": 8,
      "text": "Sure it didn't have the BEST story or plot. But it kept me entertained from start to finish. John Malkovich stole the show, he was hilarious. If your looking for an enjoyable action-comedy, go see RED!",
      "total_reactions": 1,
      "user": "LFriesen101"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2010
      },
      "score": 0,
      "text": "simply awful..........................................................................................................................................",
      "total_reactions": 2,
      "user": "dmr"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2014
      },
      "score": 9,
      "text": "awesome but not better then red 2 !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "total_reactions": 1,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "The movie was great! Packed with action, hardly believable, but action non the less! Memorable characters, silly episodes, nice jokes every little once in a while, Can recommend that movie for those who are searching for a good laugh, as well as for those who enjoyed A-Team.",
      "total_reactions": 0,
      "user": "MikePushkin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "To enjoy this movie, you can't expect an action movie with a few small jokes. You need to expect over-the-top action sequences that are only half of the movie, with the other half being hilarious comedy.  If you have that mind-set before going to the movie, you're in for a delightful couple hours.",
      "total_reactions": 0,
      "user": "back2schoolboo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "I must say this film does exactly what it says on the tin; it’s brash, explosive and it also has some humour splattered about in there. I did like Bruce Willis in this one; some of his wise cracks put me in mind of his character David Addison in “Moonlighting” (an old TV show for those too young to remember it). I loved John Malkovich as the, almost paranoid, member of the team; he added some great comic moments. Helen Mirren was great (as ever), as was Richard Dreyfuss as the bad guy and Brian Cox. Also a mention fro Karl Urban who played his role with great aplomb; he’ll go far I’m sure. As to the film; well I enjoyed many aspects of it although I did find the age difference between Willis and Parker a tad creepy. Other than that, bring on the sequel! I found it a lot of fun and everything ‘The Expendables’ isn’t; well worth the price of the disc.",
      "total_reactions": 0,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "'Red' certainly isn't high-art, but it's an over-the-top, fun, funny, and decpetively smart (and well-acted) rollercoaster ride that utterly entertains from beginning to end.  It also happens to be one of the most kickass films I have seen in a long time.",
      "total_reactions": 0,
      "user": "jefequeso"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "I gotta say, I didn't find this film as good as I thought it would be. I thought it would offer more to action-comedy films, but ended up being another actioner with comedy, but the film does manage to hit that place in between being charming and brutally violent. The cast are brilliant. Short of The Expendables and Inception, this is probably the best cast list of 2010. Bruce Willis, Morgan Freeman, John Malkovich and Hellen Mirren as retired CIA agents, Mary Louise Parker (love her in Weeds) as Willis' love interest and Karl Urban as CIA agent, all acting at top notch form. Did the cast take badass pills during filming, because thats what they (bar Julian Mcmahon and Mary Louise Parker) seem to primarily be. Especially Willis and Urban, whom have a fantastic fight within the CIA headquaters. Props have to be given for Hellen Mirren, wielding machine guns and using turrets like she's been using them her entire acting career, as well as threatening Mary Louise Parker to \"kill her and bury her body in the woods\" should she break Franks heart. Morgan Freeman isn't actually in the film for much time, but the parts that he is in, he lights up the scenes, and manages to provide one of the films best moments, where Richard Dreyfuss gloats that he can't be touched and Morgan Freeman smacks him across the face. John Malkovich is definately the breakout star of this film, the shining star of this movie. From his first appearance, he proves to be the best character of this film with his wonderfully madcap attiude and his method of madness, including carrying around a stuffed pig that carrys a fold-up gun inside, which is also used to hit back a grenade at an enemy. The best scene in the film has to be the fight at the docks, with Malkovich proving rocket launchers can be beaten by a simple bullet. There's a brilliant pause after the enemy remarks \"Thats right, old man\" where Malkovich just stops and questions \"Old man?\" followed by him proving his worth and saying the line of the film, \"Old man my ass\". So all in all, Red may not be the most groundbreaking film there is, but what is there is undoubtably a fun ride.",
      "total_reactions": 0,
      "user": "roddersj04"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2010
      },
      "score": 4,
      "text": "This movie has your action stars (Bruce Willis & John Malkovich). Your Oscar winning actors (Helen Mirren & Morgan Freeman). Great! Now we can focus on the actual story. Wait a minute. The plotline is so simple and boring it kept me think of excuses to temporarily walk out of the theater. This is basically another action flick that has no important story, while only engaging the audience by impressive special effects, which are the highlight of this movie. The cast doesn't exactly work for this film and the script lacks intelligence. It soon becomes an ongoing action packed epic that just resists to end. By the end, I was wondering....Did the director use the explosive in this movie to accidentally screw with this movie so far that in the end there really isn't any importance to this movie at all? This movie was extremely close to becoming an ultimate disaster.",
      "total_reactions": 0,
      "user": "Film_Fanatic_15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2010
      },
      "score": 7,
      "text": "Red, retired extremely dangerous. Those terms are to describe Bruce Willis, John Malkovich, Hellen Mirren, Mary Louise Parker, and Morgan Freeman. The cast is very well known, three out of five won Oscars. But the cast has nothing to do with the movie's stylish direction with its **** attitude. The director has this **** attitude to direct a movie that's fun and enjoyable for both the audience and its cast. Considering that people in the cast is elite actors, this is kind of a fun project for them, something enjoyable instead of intense acting. That's what made the movie fun, the cast knew that this isn't that serious and they tried to have fun with it. We felt the charm of Bruce Willis and Mary Louise Parker. We felt cool when Hellen Mirren picks up a gun. And we felt disgusted when Morgan Freeman tried to score some booty. But most of all, we felt this is better entertainment than some big budget movie.",
      "total_reactions": 0,
      "user": "OscarPicks2010"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Wonderful action-packed, not-too-gruesome, just the right amount of comedy, just the right amount of so-sweet, the good guy/bad guy pros had just the right amount of steel, the side-kick was just the right amount of silly, the surprises were surprises, the gunfire had just the right sounds, the special effects were WoW!, it made me jump! when I was supposed to and go Ahh at the right moments, the breaks in the action came at the right times, and the bad-guy had just the right amount of good guy inside. The kiss at the end made me sign. Oh, what fun! Such a kick! A feel-good movie with Action. I really want to see it again :) Nice.",
      "total_reactions": 0,
      "user": "chicki"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2013
      },
      "score": 4,
      "text": "A predictable and dull action movie that plays off of its characters age, much like \"The Expendables\" just without all of the excitement. The attempts at humor fall flat, I could predict everything that was going to happen, and it's just not fun to watch. It has got some good performances, but overall that can't save the movie from being a waste of time. With all of the better alternatives out there \"RED\" really isn't worth your time.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "This movie contains high octane, great characters and some humor. The critics who rated this movie are definetely wrong because this movie is the best action movie since the Expendables i have ever seen.",
      "total_reactions": 0,
      "user": "peakchua"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "This movie was extremely well played, I have to admit even to someone like me who rarely like any movie I liked this one more then I thought I would. Its clash of action and comedy really made it a hit but not only that the well chosen actors in the movie fed my interest and kept me biting my nails beginning to end with the exciting graphics and action scenes. Now I would recommend this movie to anyone because I was able to watch it with my entire family and my kids loved it I had to dub out the profanity but there were hardly any swear words and my husband loved this movie.. I liked it. I think this is the first movie I enjoyed since I was a child;.",
      "total_reactions": 0,
      "user": "l_feso"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "This movie reminds me of tha good old action movies from the 80s... it even have a touch of the Die hard movie.. why isn't there more of these films... you cant always look at Oscar nominated suicidal depressing stuff.  Its a good cast as well and Mary-Louise Parker teams good with Bruce Willis as the innocent sexy girl looking for an adventure.",
      "total_reactions": 0,
      "user": "NinjaAsok"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "RED takes action films to a new level never discovered before. Pure badassness that will have any Michael Bay fan screaming in his seat is impressive but to do it without having an explosion around every corner as well as developing a story line that will let everyone else enjoy the film, is just 100% impressive.",
      "total_reactions": 0,
      "user": "filmtrashreview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2011
      },
      "score": 5,
      "text": "Not one of Bruce Willis' top movies.  Slightly boring, quite average and mediocre action scenes.  I felt like Bruce has done this kind of movie before, only this time it's worse.  I will recommend, however, to grab this movie from your local Red Box location, and know where else.",
      "total_reactions": 0,
      "user": "mbrownd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "the main plot gimmick of the movie never ceases to lose it's charm, and the actors give their best performances. of course, over the years, this kind of stuff must almost come natural to them now. now philosophical depth to be found, but a wonderful evening all the more.",
      "total_reactions": 0,
      "user": "bram29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "A decent action film. Unrealistic and typical \"Hollywood\" stuff but later on manages to develop a light story to go with it. Character development and actual backstory is very thin, but it manages to scrape by without feeling shallow.",
      "total_reactions": 0,
      "user": "sinadoom"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "Based on a comic book titled 'Red' (no capitals)  this movie adaptation doesn't really know what direction it wants its viewers to ferret out. While the action is self explanatory the film often confuses itself with the fine line between comedy and drama. Unfortunately the plot is simply dull although the characters themselves are cleverly layered out; if only they had something decent to do. Particular praise must be highlighted towards John Malkovich who is absolutely hysterical in his portrayal of a paranoid retired C.I.A. agent.",
      "total_reactions": 0,
      "user": "eTurkey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "Entertaining, amusing and a well-contained action flick. Good times all around. Didn't get boring for a second.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "Cool action movie with a typically linear predictable story. Nice movie for a silent sunday evening to chill down and only watch without thinking. Just enjoy!",
      "total_reactions": 0,
      "user": "JaySupertramp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "Red is, well, cool. Very cool. Maybe awesome. It's a great film anyway. Its got exciting, fast-moving and tense action sequences, funny moments that make you laugh out loud, good acting, good character building and a kinda nonsensical story-line, it doesn't really explain much, but you can tell it's more thought than something like Transformers. I could easily give it a nine out of ten, but it has a few minor problems scattered around.",
      "total_reactions": 0,
      "user": "skyminster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "I never, ever, ever would've expected to see Helen Mirren hold up a gun and take a perfect shot. Red manages to get Helen Mirren to do that... except it's an AK-47. And it's awesome, because Mirren can actually pull it off. Red is far better than the scummy action flicks all year long--and with an outstanding ensemble of actors.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "First off, this is a 9.25 out of 10. This has about everything. Action, comedy, it's real great. Acting is good. Everyone does a good job. Story and score are both really good. Overall this is a funny action ride that you should watch. It's really good.",
      "total_reactions": 0,
      "user": "Juanolo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "A great action comedy with great actors and plot, RED shows that even such \"peaceful\" actors as Morgan Freeman and Helen Mirren can be great action movie stars. There are two characters which stand out for me. Firstly, Malkovich's character is outright hilarious, he made a great performance playing that paraniod psycho. However, it's the Bruce Willis' main hero character that stands out in a negative way, in my opinion. Perhaps I'm just fed up with Willis, but his whole acting comes down to a constant ironic grin, calm voice and nothing more, so he's the only minus of the movie for me. In all other aspects, RED's awesome.",
      "total_reactions": 0,
      "user": "RealMuthaF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2015
      },
      "score": 2,
      "text": "An incredibly stupid film that tries to be like \"lol old people shooting guns\" throughout, RED falls flat on its face repeatedly. The acting is fine due to the very talented cast, but the plot is beyond dumb and the film, intended as a comedy, is never funny at all. Overall, this one left me largely speechless as I am unable to think of much else since practically all of it sucked. The acting saves it a touch, but that is not enough when the plot, writing, and crutches it leans on are all so dumb.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "I was pleasantly surprised about this movie. Even if the action looks fake here and there, you can still enjoy this movie very will because of crazy John Malkovich and Helen Mirren who are killing it in there. Bruce Willis is boring as always, but his supporting actors make a very nice cast together. No masterpiece, but worth your time!",
      "total_reactions": 0,
      "user": "axelkoch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "The whole thing with retired secret agents is pretty interesting, but the story seems pretty silly most of the time. On the other hand there is a bunch of great actors here. Overall, the movie is a bit boring, because it has very few badass action scenes and the comedy-oriented stuff is not that fun too.",
      "total_reactions": 0,
      "user": "StaticSpine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "It's the best action movie I've seen in my life! It is so good and fun! also has parts of comedy. I recommend it to everyone! Fewer women over 60 years ... In short: Not to be missed!",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "A fun outing to the theater.  It does not take it self to seriously but is not silly either.  The characters are all very interesting and loads of fun.",
      "total_reactions": 0,
      "user": "ACanadianCat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "It's not exactly as intelligent as it is almost mindlessly entertaining, but \"Red\" is still a worthwhile cinematic experience, with some interesting twists and turns scattered throughout.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "This movie is so fun, so cool, and so awesome! From the moment I saw the first trailer of this film, I knew it would be one heck of a fun ride. I loved it! Bruce Willis, Morgan Freeman, Helen Mirren, John Malkovich....the big star lineup of actors was enough to get me interested in this film. It's so awesome to see them do these kinds of roles, the roles that actors of their caliber and age don't normally do. The audience can see how much the fun the cast is having so they too take part in the fun. Red is action packed the whole 2 hours. The fighting and shooting...it was perfect! I really couldn't have asked for a more entertaining 2 hours. I highly recommend it!",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "Red is an excellent film with a perfect mixture of comedy, action, and thrills and spills. In addition to this, you get an intelligent script and some great acting (Malkovich in particular was brilliant). Highly recommended viewing!",
      "total_reactions": 0,
      "user": "Jimbo82"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "Red boasts shockingly comical violence, an unpredictable plot and is overall a brilliant film. The action is suitably balanced, with enough crazy and enough gritty to please everyone. The cast of big names deliver great performances creating a truly unique set of lovable characters. A fantastic action movie for any action fan, comedy fan, Bruce Willis fan, and their grandma.",
      "total_reactions": 0,
      "user": "iLightning"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "Red delivers the goods (action, explosions, fun,) senior style. It takes a handful of some of Hollywood's best actors and actresses, and throws them in a silly, goofy, CIA-style world full of car chases, bazookas, paranoia, and, of course,  action! And it has Morgan Freeman",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "I loved this movie the most for it's humour. The action was good. The casting was good. Helen Mirren did a fantastic job in this movie. Good movie but room for improvement.",
      "total_reactions": 0,
      "user": "rafingal23"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2015
      },
      "score": 2,
      "text": "Bruce Willis should maybe just retire. Its hard to hate on such an important action actor but he just can't do anything right at this time. Strong actors that are lacking in this movie and the humor is just so lame.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "Red is my favorite color. RED proves that my reds are effortless. RED is somehow getting a good score but at the same time could end up being in the mixed section.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2016
      },
      "score": 7,
      "text": "RED is a pretty good action movie with good casting and performances all around. It didn't wow me in any way but it was definitely an entertaining watch.",
      "total_reactions": 0,
      "user": "MasterRiley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2016
      },
      "score": 8,
      "text": "Fortunate blend of action and comedy, supported by dynamic roles of Willis, Freeman, Mirren and Malkovich. Good choice for a between day evening with the needly bag of popcorn",
      "total_reactions": 0,
      "user": "alejandro970"
    }
  ]
}