{
  "mc_avg_user_score": 5.6,
  "mc_metascore": 36,
  "mc_mixed_rating_frequency": 26,
  "mc_movie_name": "Red Lights",
  "mc_negative_rating_frequency": 10,
  "mc_positive_rating_frequency": 18,
  "mc_pro_critic_reviews": [
    {
      "critic": "William Goss",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2012
      },
      "score": 83,
      "summary": "The truth is, while Red Lights isn't terrifically scary, it is thrilling in other ways, constantly playful and often tongue-in-cheek as it works through the hokey conventions of the genre."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2012
      },
      "score": 67,
      "summary": "As a sinister ESP showman, Robert De Niro is corny and fun."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2012
      },
      "score": 63,
      "summary": "Red Lights also shows a director who knows how to construct a story and build interest, but at the end, it flies apart. I wonder if there was an earlier draft. I suspect most audiences would prefer a film with an ending that plays by the same rules as the rest of the story."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2012
      },
      "score": 60,
      "summary": "The movie muddles to a rug-pulling ending that doesn't, despite its efforts, shed new light on what's come before."
    },
    {
      "critic": "Adam Litovitz",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2012
      },
      "score": 50,
      "summary": "It works best when it doesn't take itself seriously, and some of the ways in which ESP is faked are briefly engaging, like short con games or magic tricks revealed. But, finally, the film doesn't offer the sense of release, or of surprise, that it seems to take for granted."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2012
      },
      "score": 50,
      "summary": "When its biggest trick is finally revealed, it is not entirely satisfying."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2012
      },
      "score": 50,
      "summary": "It's mystifying how such a muddled and silly movie drew the talented cast it did."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2012
      },
      "score": 50,
      "summary": "Before Silver hijacks the plot, Rodrigo Cortés's smart, talky screenplay and tense direction hold our attention, as much for the unpredictability of the story as the ease with which Sigourney Weaver and Cillian Murphy slide into their roles."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2012
      },
      "score": 42,
      "summary": "By the time the film reaches its convoluted, bombastic and preposterous climax, any sense of real magic that it once conveyed has utterly vanished."
    },
    {
      "critic": "Noel Murray",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2012
      },
      "score": 42,
      "summary": "Red Lights' setup is silly but fun, with a fair degree of self-awareness that the film's entire \"super-scientists vs. celebrity spiritualists\" premise is a hoot."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2012
      },
      "score": 40,
      "summary": "A lot of talent comes up empty in Red Lights, a thriller that doesn't thrill."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2012
      },
      "score": 40,
      "summary": "Much as I want to believe in Cortés, who is clearly talented and ambitious, there is just too much in Red Lights that encourages agnosticism."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2012
      },
      "score": 40,
      "summary": "Instead of adding to the experience, the picture's ill-conceived twists amount to a severe miscalculation on Cortes' part."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2012
      },
      "score": 38,
      "summary": "The storytelling proceeds in such a halting manner, with De Niro's speeches going on and on and on, that before long you'd kill for an easy scare."
    },
    {
      "critic": "Michael Nordine",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2012
      },
      "score": 38,
      "summary": "That all the good things--and there are several--Red Lights has going for it are ultimately in service of an ending that might even make M. Night Shyamalan cringe represents one of the year's biggest missed opportunities."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2012
      },
      "score": 30,
      "summary": "Red Lights reaches for a \"The Sixth Sense\"-style twist and whiffs it completely."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2012
      },
      "score": 25,
      "summary": "This is ultimately a movie about highly intelligent people in pursuit of trivial nonsense: At least Mulder and Scully caught a real monster every once in a while."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2012
      },
      "score": 25,
      "summary": "Gets sillier and sillier as it goes along."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2012
      },
      "score": 25,
      "summary": "Red Lights goes astray on so many levels that I gave up trying to figure it out before the end of the second reel."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2012
      },
      "score": 20,
      "summary": "Veering between tonal and narrative extremes, it's the kind of film that makes you long for the grim pomposity of something like \"Signs.\""
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2012
      },
      "score": 20,
      "summary": "A ghost-busting drama set in a world of mystics, mind-benders and various and sundry fake-psychic gobbledygook. But the weirdest thing is how all the fun gets lost in a bottom-drawer \"X Files\" story."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2012
      },
      "score": 20,
      "summary": "Never do you sense an overriding intelligence; Cortés once found laughs and shocks within the coffin-confined Buried, but here's he's got too much room to wander into realms of the ridiculous."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2015
      },
      "score": 3,
      "text": "What the hell happened this had an excellent cast, some decent performances and a pretty good plot that for once had a sceptic view of physics which not enough media does but it's all undone by an ending so bad I still can't believe there wasn't a rewrite. I can't even recommend for a so bad it's good quality it doesn't have that and it should be taught in film schools as the perfect example of how a bad plot twist ruins a movie",
      "total_reactions": 1,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2012
      },
      "score": 3,
      "text": "Sadly, it seems any filmmaker billing De Niro in their movie, now, isn't the least concerned with what the erstwhile acting legend does; casting him is supposed to be enough. Though such lionizing of a cinematic icon should be respected, and the actor himself should relish it, the billboard on which De Niro's face is plastered in \"Red Lights,\" of his character Simon Silver, once again avers with undoubtable certainty, that he is merely dress-up for any trash that happens to call his name by phone; even sadder, is the realization that the trash and the man are slowly becoming synonymous with each other. This is true, but De Niro's not all to blame. From the director of the claustrophobic thriller \"Buried,\" Rodrigo Cortes helms, this time, a psychological grabber starring Sigourney Weaver and Cillian Murphy as a pair of full-time scholars and part-time paranormal debunkers. Their belief, the ESP, the ghosts, apparitions, telekinesis, psychic surgical treatment, are only superficially eerie acts, filled with sleighted gags. And, that sums up the film too: loud sounds, seemingly spooky ambiance with its share of door-slam-shocks, levitation, crackling power outages and the all too familiar candle blowouts with people gathered around the dining room table, and many others you've seen before, its ultimately mostly all, a campy mess; a film laden with busting bulbs and magic tricks but little semblance to cohering characters and dialogue. Moreover, a movie about extrasensory perception, you'd think, would have some form of self-image and perception, but the only thing this psy-thriller \"grabs\" is a mirror, at which point it insists on shattering before it can take a look. Sure, not all is lost amidst the fragments--Toby Young as the parapsychologist and genre-connoisseur Weaver (she knows where the \"light switch\" is, per se)--but the characters all feel so stranded in the darkness with no exit anywhere in sight. Others, namely Young's on-screen girlfriend, Olson, appears only fitting in the picture insofar as to confirm Young's otherwise implied affinity for women, and incidentally to show the audience some respite in occassionally revealing a pretty face instead of a dark, cacophonous room. Also, Weaver, notwithstanding her valiant attempts to fulfill the script, can't circumvent her expositorily informative lines that don't do justice to the already dullness of some of her counterparts. Initially, the film does start intriguingly, at least cinematographically, with dramatic shifts in camera movement and delightful set-locations. But, one can't expect the scenery alone to help this shock-limper through the long-haul. Enter the aforementioned De Niro, who hides behind those big, black glasses, and further, those cosmetic cataracts (playing a blind, spoon-bending thaumaturge) and wears his fading reputation proudly; needless to say, De Niro should have taken a tip from his character and performed his own vanishing act--far, far away from taking this role. His Simon Silver-paranormal-superstar persona doesn't come across as mysteriously creepy, but rather desperate and frankly, not all that interesting. Additionally, in what has been called a \"mind-blowing conclusion,\" \"Red Lights,\" endows an ending that is sure to mix things up, but rather than having a twist that adds to what one already knows, it ironically pulls the rug out from under itself, and takes it a step further in nullifying that which its sleight-of-hand narrative had set out to explain in the first place; it makes the pervasive foibles of the film all the more intolerable and undeniably unforgiveable to the time ill-spent. This one missed all-too-many signs urging it to \"Stop.\"  Arguably the biggest turn-for-the-worse and misfire of 2012.",
      "total_reactions": 6,
      "user": "FDT44"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2013
      },
      "score": 3,
      "text": "A sad silly film. It really has no point. Nothing is at stake, it doesn't matter who is right or who is wrong. Is it the end of the world if we discover scientific evidence for paranormal activity? They make a really big deal out of the possibility of a bad scientific report being made, like it could change the world, but it's all rather silly, and has little to no suspense. There is some talent involved in the film, it is visually visceral, the actors have some inspired moments, in a way it forces you to feel emotions with its visuals and sounds, rather than having any real content to feel any thing about. You get two twists at the end which is nice, because one of the twists is very predictable. Over all a disappointment, because it had so much talent, but in the end lacked a good story, or script, or any real meaning.",
      "total_reactions": 1,
      "user": "lilkillpappy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2013
      },
      "score": 1,
      "text": "A poorly-designed, poorly-told story filled with robotic characters spouting clunky dialogue.  But for the semi-success of this writer-director's last effort (Buried 2010) this film would probably never have been made.  If you want a good movie to watch you won't find it here.",
      "total_reactions": 0,
      "user": "podriscoll27"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "Red Lights is an obscure thriller that attracts a lot of great talents, a genre that was popularised by 'Sixth Sense' a number of years back.  Slow burn plot, talky, with a twist in the end.  It;s done quite well here. Too bad nobody cares anymore.  It is actually meticulously researched by the Writer-Director, and while the last third went out like any other supernatural thriller out there, it does raise a lot of issues about paranormal activities, whether they are fake or not.  De Niro again plays the usual 'I'm sooooo creepy' routine that he is famous for.  It's the nuanced performances of the ever reliable Cillian Murphy and Sigourney Weaver that elevates this material.",
      "total_reactions": 0,
      "user": "dharma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "You see this too many times, a film starting off so well, only to unravel and fall apart so carelessly and predictably at the climax that its difficult to appreciate the film at all, simply because it worsens as the minutes tick on.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2016
      },
      "score": 7,
      "text": "Professor Margaret Matheson (Sigourney Weaver) and he assistant Tom Buckley (Cillian Murphy) have a very unique and interesting job. They travel the country trying to prove of disprove psychics, magician, paranormal researchers, and people in similar fields. They would like nothing more than to find the real thing, but so far, Matheson has only found one person she hasn't been able to prove is a fraud, and that's Simon Silver (Robert De Niro). She is terrified of the man, but he assistant doesn't know any better and wants to make a name for himself by going after the legendary medium. I am in utter disbelief that a film with a cast like this was direct-to-film, but all that aside, it's as good a story as you'll find on the big screen. What can you say about De Niro and Weaver that hasn't been said a million times before, but this film is almost like a passing of the torch, as Murphy got the majority of the air time. How'd he do, Cillian Murphy absolutely stole the show right out from under them, in what is easily his best performance to date. To be honest, this is one of those films I watched for the cast, I wasn't super interested in the story and at times it was painfully slow, but Red Lights has some downright creepy moments, and the ending will absolutely blow your mind. If you're the patient type who enjoys a great performance, this films for you, if not, you might want to skip this one, as it takes a while to get going, and gives you some things you really have to think about afterwards.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2013
      },
      "score": 4,
      "text": "Red Lights seemed like an interesting movie, because of the statement that proposes: every psychic is a fraud and there are many ways to expose them. This last thing is what Doctor Matheson and Tom Buckley do for living. So if you discover someone that apparently has powers, means that you are taking something for granted; here appears the idea of red lights, which are things that should not be there and will reveal you the trick. After all these, the film begins evaluating concepts like beliefs, religion, life after death, masses manipulation and credulity. The problem is that at the ending everything gets so distorted that becomes absurd. All the topics that the movie presents at the beginning are destroyed and what do we obtain? Purely crap. The story could have deepened with the concepts mentioned before or simply continue to where it was going. What a great disappointment, definitely Rodrigo Cortes cannot manage something like this. A story of enormous potential goes to waste.",
      "total_reactions": 0,
      "user": "NedRyerson1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "The only issue with this movie is the tone of the ending which is in total contrast to the tone of the movie. The director would have us believe that he is speaking from the point of rationalism and science only to reveal to us that his true standing is of belief and miracles in the final scene. Psychologically speaking that barrel does not hold water well. It would have been better if he held the same tone throughout the whole time.",
      "total_reactions": 0,
      "user": "Tara61"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2014
      },
      "score": 2,
      "text": "A pretentious mess of a film. It was such a promising premise and it went along greatly for the first third of the film, but as soon as Weaver's character is suddenly taken out of the picture in an almost even contrived manner, the film plummets at a shockingly awful rate. Seriously sloppy editing and pacing, pretentious monologues that make no sense and the final twist just makes the overall film drop like an anvil",
      "total_reactions": 0,
      "user": "Kayak"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "\"Red Lights\" 10 Scale Rating: 4.0 (Bad) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "The cast offers a great performance. What a nice thriller movie.",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ]
}