{
  "mc_avg_user_score": 6.6,
  "mc_metascore": 47,
  "mc_mixed_rating_frequency": 75,
  "mc_movie_name": "RED 2",
  "mc_negative_rating_frequency": 18,
  "mc_positive_rating_frequency": 121,
  "mc_pro_critic_reviews": [
    {
      "critic": "Bill Zwecker",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 88,
      "summary": "Red 2 not only delivers the action, laughs and thrills of the original — in many ways it surpasses it."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2013
      },
      "score": 75,
      "summary": "About halfway through Red 2, in the midst of all the laughs and action, suddenly Anthony Hopkins shows up, and he doesn't care one bit that nobody is going to notice his acting in a movie like this. He's going for the Oscar anyway."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 75,
      "summary": "The best thing about RED 2, like its predecessor, is its lightness of tone. Too many movies with comic-book roots come on too seriously, even when the comics themselves have a loose, fast, jocular wit about them."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 67,
      "summary": "Anthony Hopkins, new to the franchise, is introduced in a prison cell, in stir-crazy shades of Hannibal Lecter. At 53, Catherine Zeta-Jones is nearly too young for this stuff."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 67,
      "summary": "Like its predecessor, it’s a one-joke movie; the difference is that this time around, the joke is better."
    },
    {
      "critic": "David Hiltbrand",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2013
      },
      "score": 63,
      "summary": "In its long, punishing final act, Red 2 goes beyond its mandate as a lark to pose as a true action caper."
    },
    {
      "critic": "Odie Henderson",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 63,
      "summary": "I did my homework and watched the original \"RED.\" It was just as stupid as this movie, yet I liked it a little more."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 63,
      "summary": "Red 2 is one of those sequels that's easier to follow if you've seen the original but more entertaining if you haven't."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 63,
      "summary": "The film has its charms but the end result feels like warmed-over James Bond… and not even especially good 007, at that."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 63,
      "summary": "Red 2 goes down easily, from Marvin’s demented moments of relationship advice to Dame Helen’s tender and amusing “Hitchcock” reunion with Sir Anthony. There’s a knowing twinkle in their eyes, and in everybody else’s.\r\n“Yeah, we could’ve done a Bond film,” they seem to wink. “And it would’ve been a bloody fun one, at that.”"
    },
    {
      "critic": "Staff (Not credited)",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 60,
      "summary": "A fun, frothy return for Frank and his creaky commandos."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 60,
      "summary": "It’s never laugh-out-loud funny or inside-track smart, but in a summer full of bombastic failures, a lack of pretense is enough."
    },
    {
      "critic": "Justin Lowe",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2013
      },
      "score": 60,
      "summary": "Not that it isn’t entertaining, but the film's premise is certainly well past its “use by” date, resulting in another passably palatable sequel distinguished by a lack of narrative and stylistic coherence that could potentially underpin a really viable franchise."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2013
      },
      "score": 60,
      "summary": "While Bruce Willis, John Malkovich, Helen Mirren, et al. are still good for a few chuckles as a gang of superannuated government assassins, this globe-trotting action-comedy diversion applies a bigger-is-better philosophy across the board, upping the stakes, the firepower and the travel budget, but keeping real thrills and laughs at a modest trickle."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 58,
      "summary": "It’s nice to see oldsters cavorting in kaboom movies, but a little of this stuff goes a long way."
    },
    {
      "critic": "Kimber Myers",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 58,
      "summary": "Overall, this is an action-comedy that should be as full of laughs as it is explosions (So. Many. Explosions.), but there’s little joy other than letting Mirren be (super) sexy and Malkovich deliver a few good lines."
    },
    {
      "critic": "William Goss",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 54,
      "summary": "Every double-cross and ticking clock is familiar in the worst ways."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "No movie with this much ass-kicking should feel so lifeless. Nothing in Red 2 is actively offensive, but for the most part, it’s hard to really care for anything that’s happening to these characters."
    },
    {
      "critic": "Nicolas Rapold",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "What pops more than the gunfire are the line readings, where Ms. Parker, especially, but also Mr. Malkovich and Ms. Mirren, can give personality to standard action repartee."
    },
    {
      "critic": "Jamie S. Rich",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "Willis appears to have finally grown bored of his own shtick, and Malkovich spends most of the movie looking humiliated."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "Red 2 is much more of a mixed bag than it should have been."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "Red 2 is not just a bad movie, it’s bad karma. And the target audience of adult moviegoers who respect the names in its once-vital cast have a bull’s-eye on their collective cranium."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "There is a fine line between silly dumb fun and out-and-out stupidity, and “Red 2” crosses it one time too many."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "My favorite thing in the movie is the way co-star and Korean action icon Byung Hun Lee uses his feet of fury to hoist a paint can and send it flying."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "It’s all supremely silly stuff, and amusingly so, as long as you don’t stop to think about all those blameless officers and agents cut down in the line of mindless entertainment."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "A sequel that has some snappy interplay, typically courtesy of Malkovich, but mostly feels like a cast working to manufacture what came naturally the first time."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "Red 2, disappointing in so many ways, isn't torture to watch, in part because Mirren has even more to do than she did in the first installment."
    },
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "Dean Parisot, who made the delightful Galaxy Quest, has a funnier sensibility than the first movie’s director, Robert Schwentke, but he’s still defeated by a script that’s over-complicated and under-sophisticated."
    },
    {
      "critic": "Andrew Pulver",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "Like the first one, it's played for laughs in-between bouts of mayhem; most of the gags are off-target, though Mirren's Nancy Mitfordesque assassin gets a pretty good kill ratio."
    },
    {
      "critic": "Curtis Woloschuk",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "Returning screenwriters Jon and Erich Hoeber have penned a surplus of minor melees and major set-pieces."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "You can color me unimpressed."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "Any movie that gives Helen Mirren a chance to shoot really big guns, wear an ermine astrakhan and channel Bette Davis as Queen Elizabeth can't be all bad, and Red 2 isn't, though it comes close."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "As in the first film, the seasoned-pro cast provides the few fleeting pleasures to be found."
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 37,
      "summary": "The bigger surprise is just how clunky and unsatisfying this follow-up feels."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 30,
      "summary": "The focus is much more on Sarah, Frank, and their repetitive, ugly dynamic than on the giddy elements that made the first film trashy fun."
    },
    {
      "critic": "Adam Nayman",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 25,
      "summary": "How many Oscar winners does it take to save the world? Red 2 gathers together a collection of lauded thespians – from A(nthony Hopkins) to (Catherine) Z(eta-Jones) – and leaves them to float on a sea of action-flick clichés."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 25,
      "summary": "How bad could the boneyard be compared to sitting through this execrable piece of non-entertainment? Better dead than RED 2."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 25,
      "summary": "An awfully expensive and grossly extended Cialis commercial."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "Simply put if you are a fan of the first movie and how excellent it was done, then you will enjoy the same formula again with Red 2, its a wonder again with my attempt to understand critic reviews, I wonder how many of them purchase the same bagel, cup of coffee or meal from their favorite establishment. A movie like Red 2 needs to keep with the same formula as the first because it worked another movie that comes to mind is Taken and Taken 2, same formula used with Taken 2 and just as entertaining. Red 2 gets the job done even with a few scenes of absurdity, but coolness blended in, the movie is entertaining. Go See it.",
      "total_reactions": 4,
      "user": "pastor43"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "‘Red 2’ is so boring I couldn't wait for it to end. First, it has no focus: there are three villains and the main one appears after the middle of the movie. Second, it lacks plausibility, e.g. the protagonists break into the Kremlin through the wall of a toilet or kill all the guards in the Iranian embassy of London without any police chasing them. Third, the jokes are pathetic (the worst is the interrogation scene) and slow the pacing. Fourth, the characters have lost their charm and coolness: Frank has become an inexperienced boyfriend, Marvin talks like a marriage counselor and Sarah is incredibly annoying as she tries to seem smart and useful all the time. The cast is wasted here, 'Red' was much better.",
      "total_reactions": 2,
      "user": "Dimitris01"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "What is wrong with you people? Can't you just go enjoy a movie? Are you averse to having a little silly fun with comedy that is smart, witty, and not filled with fart-jokes and stupidly drunk people?  Do you have to be so analytical that you can't enjoy the movie? This was a fun movie-I kept saying I felt guilty smiling as I walked out.  It was FUN. Will anyone win an Oscar? Probably not.  But I had fun.  I always think the fight and action scenes are over-done and too prolonged in most movies and at times this one had the same issue. I enjoyed the characters, their banter and interaction and had a couple hours of escape time watching this movie.",
      "total_reactions": 2,
      "user": "sallou"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "If you didn’t see the first one (or don't remember), RED stands for \"retired, extremely dangerous.\" That applies to Bruce Willis and John Malkovich, who set out (with charming Mary-Louise Parker) to save the world from a special bomb. Along the way, they encounter Helen Mirren, Catherine Zeta-Jones & Anthony Hopkins. Watching this A-list cast fight and kill with efficient aplomb is the biggest draw. The action sequences are plentiful and entertaining, while the humor comes more from attitude than lines (and Malkovich's funny faces). This is an old-fashioned spy flick. It's not as good as the original or ground-breaking, but it's still plenty of fun.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Excellent movie!  It follows the same characters into their next adventure keeping the cool wit and exciting action sequences intact. This is what other movie sequels wish they could be.  If you like the first one, you will not be disappointed with Red 2.",
      "total_reactions": 1,
      "user": "JacksonB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Same type of movie as the first RED  if you were entertained by that movie you will be entertained by this one.  If you couldn't stand the first one, of course you won't like this one either.",
      "total_reactions": 1,
      "user": "Cailore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "Red2 was a great sequel. The Red cast-Os were true to form. Every action scene is on point! The comedy was hilarious and no creativity was spared. This movie is a Red Lovers Fix.",
      "total_reactions": 1,
      "user": "acrome"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2013
      },
      "score": 9,
      "text": "I really enjoyed the first film and was excited for the sequel--and it lived up to my expectations.  The movie takes the working formula from the last one and expands on it but doesn't try to reinvent it.  The core returning cast is still charming and have great chemistry together and the new players jump into the mix without any complications.  The humor is great, the action is exciting and the film is just pure fun!",
      "total_reactions": 1,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "Full of action, and has a lot of comedic tones to it, mostly by John Malkovich's role as the crazed Marvin. The love triangle within this movie really adds to the fun. It's hard to imagine oscar winning people in these roles, but they continue to surprise us.",
      "total_reactions": 1,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 0,
      "text": "Lazy, stupid, boring, and unfunny. What is going on with the state of movies these days? Have we forgotten everything about how to make a decent movie?  I'm thinking this must be made for very stupid children.",
      "total_reactions": 4,
      "user": "Qgal5kap"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "Red 2 is fairly entertaining, has some fine characters, also some funny moments. The best thing in it  is of course Anthony Hopkins  probably the best actor of recent time. Main plot isn't very good, action par is ok, overall it's slightly above average!",
      "total_reactions": 2,
      "user": "PStakhiv"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "It's in no way as good as the original, but Red 2 has a little more fun with its characters and the plot, since no introductions need to be made in the world of Frank Moses!",
      "total_reactions": 2,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "The plot of Red 2 is surprisingly convoluted, but plot here is about as important as it was in Grown Ups 2. The real idea is that there are worse things you can do than spend time in the presence of such luminaries as Malkovich, Helen Mirren, Anthony Hopkins, David Thewlis, and Brian Cox, as they goof around with this sort of material. The first Red had the same basic idea, too. But it also had a jaunty energy and some surprising visual flair, probably courtesy of director Robert Schwentke, an underrated stylist. Now with comedy veteran Dean Parisot (Galaxy Quest, Fun with Dick and Jane) at the helm, the new one is more about the jokes. It’s funnier than its predecessor, but also less human. Willis and Parker, who had some decent chemistry in the earlier film, are blander this time around. The script doesn’t give them much to do with one another besides bicker; otherwise, they seem to just be along for the ride. But there are some nice touches, too. As before, Malkovich makes for excellent comic relief, and there’s a mildly adorable ongoing romance between Mirren’s British assassin and Brian Cox’s ex-Russian secret agent. (Also, Dame Helen looks awfully fetching in camouflage.) But no movie with this much ass-kicking should feel so lifeless. Nothing in Red 2 is actively offensive, but for the most part, it’s hard to really care for anything that’s happening to these characters. The compositions are so drab that when the onscreen transitions come  in which the action freezes into a comic-book frame and then swishes toward whatever foreign destination our characters are headed next   the movie seems to be commenting on its own visual flatness. Oh, who am I kidding? Why even try? Old people! Guns! Chuk-chuk!",
      "total_reactions": 9,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2013
      },
      "score": 1,
      "text": "Must agree with all the other critics here, such a waste of A-list talent and just  throw  plausability  out the window, all your main characters are unkillable while everyone else falls like paper cutouts. As for the actors, all should be ashamed of how they compromised action-drama for their feeble attempts at comedy. All this is the director's fault, of course; this is the same guy that directed \"Galaxy Quest\" where the comedy did work because it was in the film's dna as a parody but this film is supposed to be action-drama, not a parody. And I'll call out Mary-Louise Parker for most disdainment since she showed no acting talent and couldn't even emote for what must be botoxed facial paralysis. Now I understand she carried the series \"Weeds\" but whatever acclaim she got for that doesn't make any appearance here. I saw this for no charge and still feel ripped off due to time invested.",
      "total_reactions": 1,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "Overall a good comedy. But, at times, it felt forced. Definitely more action then the original and the characters were pretty much the same as in the first one. If you didn't like the first, you won't like this. If you enjoyed the first. Go see Red 2.",
      "total_reactions": 1,
      "user": "JPG127"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "As far a sequels go, the usually don't work so well. This one surprisingly works. Grant it it's no \"The Dark Knight\" but for a movie like this, it's fun and enjoyable. Be sure to check out my YouTube channel \"TheMovieManLife\" and let me know what you think. Overall it's a fun popcorn movie to watch on a Saturday night.",
      "total_reactions": 1,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "An excellent action movie with rich and meaningful comedy. Every bit of the movie is interesting and it makes us laugh though they are too serious.....",
      "total_reactions": 1,
      "user": "ISHTIAK"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "\"Red 2\" 10 Scale Review: 7.0 (Good) ...",
      "total_reactions": 1,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2013
      },
      "score": 6,
      "text": "I found this to be much better than the first movie, which I didn't enjoy. Just like the first I find the humor to be much better than the action, so the much improved jokes are greatly appreciated. Once again John Malkovich steals the show and Lee Byung-hun makes for an excellent addition to the cast. So while the movie exceeds at humor and cast, it stumbles with it's action and plot. The plot is slightly confusing, familiar, and ends up going nowhere. The action is tolerable but nothing spectacular. All in all it's a decent action flick that surpasses it's predecessor, but fails to leave a lasting impression. Still might be worth a rental to fans of the original.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "Red 2 is a great sequel that recaptures the stupid, dumb fun of the original. So if you happened to like RED, then RED 2 will certainly satisfy. If you didn't like the first movie, however, RED 2 will also suffer the same fate. I had fun and Anthony Hopkins was a blast!",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "I thoroughly enjoyed this film. I liked the first and I wasn't sure how this one would compare and I actually liked this one better. Lots of action, HILARIOUS throughout and just a good time, can't ask for more. Definitely worth a watch, especially if you liked the first. 7/10",
      "total_reactions": 0,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "The first Red felt like it was a movie trying to find the best in its performers but not really taking advantage of the films interesting premise. Red 2 feels like phase two, a film that benefits from both a good story and some strong direction by Dean Parisot. When Frank Moses (Bruce Willis) gets dragged back into his past CIA life yet again when Marvin (John Malkovich) asks for his help. It isn't long before Frank and his girlfriend Sarah (Mary Louise Parker) are thrown back into the thick of it. Brimming with plenty of comedy, both loud and quiet, Red 2 is a fast paced action thrill ride with a good sense of self and a cast of actors who are clearly loving the experience. Willis leads a cast who have a good grasp of the inherent comedy in the films plot. Malkovich who was the highlight of the original shines yet again, mainly thanks to a costume department who dress Marvin in some of the most inventive and ridiculous outfits you can possibly imagine. A globe trotting adventure film as well as a comedy conspiracy film, all wrapped up into one excellent picture. Smartly written by Jon and Erich Hoeber, Red 2 is a wonderful treat but it does rely on crazy twists that are all too simple in their execution making for a rather dull and predictable final act that does make you laugh (one moment had the whole cinema in fits of laughter) but doesn't amaze due to the predictable conclusion. It's all good fun but it isn't quite the finished product, even if its an improvement on the first.",
      "total_reactions": 0,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2014
      },
      "score": 6,
      "text": "Red 2 continues to be the romp that began with the original Red, with the incomparable Bruce Willis, John Malkovich, Helen Mirren, Mary-Louise Parker—and with this second round, Catherine Zeta-Jones and Anthony Hopkins. The plot is convoluted and a little confusing, but there is a weapon of mass destruction out there called Nightshade, and the CIA wants to kill its very own Frank Moses (Willis) and his cohorts because they were vaguely associated with the secret project. The inventor of the secret bomb is a slightly senile professor named Bailey (Hopkins) who has been kept safely locked up in a sanitarium for over thirty years, Stalin-style, until he is rescued by the aging agents Moses and Victoria (Mirren). Although the ex-agents try to pretend they are retired, you can't keep a good spy down, and when called, they serve. And they serve with skill, talent, and dry humor in spite of their gray hair (or no hair) and wrinkles. They're more fun than James Bond.",
      "total_reactions": 0,
      "user": "ClariseSamuels"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "Although not as well constructed as the prequel, these senior action heroes still have gleeful somewhat appealing spy adventure. Like all the movies with collection of stars, RED 2 adds some familiar faces into the mix. Anthony Hopkins and Lee Byung-Hun are nice inclusion, they bring some novelty with nice acting and stunts. The story is far from impeccable, it's a bit rushed, contains too many half-baked plan of infiltration and relies more on firepower than the previous title. However, it is still decent and fun to watch as the cast seem to enjoy the mash, especially towards the end.",
      "total_reactions": 0,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "In 2010, DC Comics introduced the world to one of it's lesser known series, R.E.D. (Retired Extremely Dangerous). What I loved about that film was that it took old school action stars and put them into a modern action movie. The expectations for action movies are much higher today, no longer are they just chases, explosions, and gun fights. Today, people expect action films to have some kind of story, characters with personality, and even some humor. RED delivered all that and more and so does it sequel. Even though there are some bigger names in RED's second installment, the humor didn't play as big a role as it did previously and the story moved a lot faster. To some, this may have been a good thing, but for me, too much happened too quickly. I liked it better when we didn't know the characters or what to expect from them, when things were explained, and not just delved into. The first film made RED seem very original, but it's sequel really does play like a story that was adapted from a comic. Don't get me wrong though, while the second film doesn't compare to the first, it is still far better than some of the other action films released lately. You really can't go wrong in having an action film that stars Bruce Willis and John Malkovich, they seem to just be oblivious to the signs of aging and are as believable today as they were in their prime. Alone, this pair would have been terrific, but you add true legends of the screen like Anthony Hopkins and Helen Mirran to the cast, and honestly, I don't see how any movie fan would want to miss that! The acting is terrific and the story, while proceeding much too quickly, was still a pretty interesting one. I did really enjoy RED 2, my only wish is that they had slowed things down a little and let us catch our breathe.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "Typically sequels of this nature fail to bring any fresh and/or exciting looks into the realm of their first installment. Red 2 contains a similar formula, but manages to provide thrill after thrill.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "You walk into “Red2” knowing exactly what you are getting. After checking your brains at the door you lean back and observe the actors from how beautiful Catherine Zeta-Jones is to how much fun Helen Mirren appears to be having even to the point of playing a queen gone mad in one scene. There is John Malkovich playing crazy as only he can and Bruce Willis flipping off repartee as if he was back in “Moonlighting” only this time sparring with Mary-Louise Parker. First spotting Anthony Hopkins you may think Charles laughton has come back to life. With this cast it is hard to stand out but Korean star Byung Hun Lee, as a lethal body weapon, gets laughs with his ‘want my plane back’ tirade at Bruce Willis and Neal McDonough is ready to jump into the next James Bond movie as a villain extraordinaire.",
      "total_reactions": 0,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "One thing about this movie Is that it's incredibly boring. The first half is going nowhere and is a great cure for Insomnia. Then we meet Hopkins (who steals the show) and we get the ball rolling and you start to have fun but you realize the movie ends.",
      "total_reactions": 0,
      "user": "snazzyjuice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "An entertaining sequel that benefits from weak competition from other opening movies this weekend. I found it ultimately forgettable. Not that it was a bad movie per se, but I will not be calling my friends telling them what a great performance Willis makes doing something new and different. Hey, much better than the last Die Hard movie though. Much Much better....",
      "total_reactions": 0,
      "user": "analogkid280"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "A pretty average movie to be honest, not as good as the first. But definitely entertaining mainly because of the cast which benefits from names such as Helen Mirren, Anthony Hopkins and David Thewlis. Most of the jokes fail and you forget, but the ones that work are very funny and mostly come from Mary Louise Parker which is very different from the first movie where she just pulled faces and acted sarcastic. Bruce Willis has swapped with her and only has one facial expression throughout the whole movie.",
      "total_reactions": 0,
      "user": "python2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "Anyone who is a fan of the Red 1 will enjoy the sequel. It's got the same comedy style, action, fight scenes and clever dialogue between characters. In addition we see character growth (epecially for Frank Moses and Sarah), learn more of the main characters' history, and see the same familiar faces along with some new ones. The story lacks humour this time and is more serious but is still very enjoyable.",
      "total_reactions": 0,
      "user": "bm2759"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "It's an unrealistic action movie, and for that reason, it's walking on eggshells right off the bat. Again I have endured a film that lacks significant identity. It has just been thrown together in an untidy fashion in the hope of achieving something. However unlike action films of a similar quality, it is able to successfully incorporate comedy into the experience, and that on it's own can make a film. The story doesn't deserve recognition but the entertainment factor it delivers does.",
      "total_reactions": 0,
      "user": "callumjsouth"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "I loved the first Red movie so I have to say that I was excited for this movie, and the results? Well, Red 2 is awesome. I left this movie fully satisfied with the content. It just goes to show that older people still do kick ass and the Red franchise has not suffered one bit. You like action packed movies, watch Red 2, if you like the first Red movie, watch Red 2, if you like funny movies, watch Red 2. What I loved about Red 2 is that it did what most sequels fail to do, and that is take all you love about the first movie, polish it, and make it just the slightest bit better. Red 2 is an accomplishment and I am looking forward to its release on blu-ray.",
      "total_reactions": 0,
      "user": "RecycledAir"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "\"Red 2\" was one heck of a ride and I enjoyed every second of it. I went into this film feeling skeptical because I didn't LOVE the original but this film blew it out of the water for me. This film was surprisingly funny and had a couple of twists that you may or may not see coming. Every actor & actress was great, nothing out of place. I give this film a solid 8/10, worth seeing at the movies.",
      "total_reactions": 0,
      "user": "TheMasterCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "great action and interplay with a awesome cast...fun date night movie....both my wife and I liked it. the line play between the characters got laughs from the  crowd throughout the movie",
      "total_reactions": 0,
      "user": "tacoma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "The \"action packed\" sequel Red 2 returns with more explosions and entertainment, releasing July 19th. The movie begins with Frank Moses and Marvin Boggs meeting up in a local Costco where Marvin is warning Frank about danger arriving in the future and that he needs Frank to come help. After Frank refuses many times, we see Marvin get into his car and drive away. Nothing too out of the ordinary, until Marvin's car explodes and Marvin is pronounced dead. Frank pokes Marvin with pins and nails trying to get him to awake because he knows that he is once again faking his death but he doesn't budge. As predicted by most of the audience at the screening, Marvin is here to save the day when Frank and his girlfriend Sarah Ross are in danger.",
      "total_reactions": 0,
      "user": "AlexProductions"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2013
      },
      "score": 1,
      "text": "The slightly witty humor didn't make up for the terrible plot, the clearly predictable villains, or the terrible gun play. It was a waste of time watching this, just another formulaic action movie without any real moral or objective plot line.",
      "total_reactions": 0,
      "user": "contract"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2013
      },
      "score": 1,
      "text": "Very very long. Not particularly funny basically an all star cast running around in circles with very little in the way of surprise. I honestly thought it would never end at about the hour mark not exactly a ringing endorsement. What a waste of Anthony Hopkins.",
      "total_reactions": 0,
      "user": "ripleywasabadmf"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "When evaluating something, the most important is to realize what is the intended purpose of the subject, and considering that, this is a good movie. If you are looking for realism you won't find it here, this is the type of movie made to entertain, to be fun, to have action, and it achieves that just fine.",
      "total_reactions": 0,
      "user": "Motcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "\"Red 2\" was one heck of a ride and I enjoyed every second of it. I went into this film feeling skeptical because I didn't LOVE the original but this film blew it out of the water for me. This film was surprisingly funny and had a couple of twists that you may or may not see coming. Every actor & actress was great, nothing out of place. I give this film a solid 10/10, worth seeing at the movies.",
      "total_reactions": 0,
      "user": "Ontario53"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "I have not seen the first Red  thats ok if i did not see the first one because RED 2 kicks ass. Based on the comic book novel by Warren Ellis  and Cully Hammer i am a fan of Ellis's Work on Dead Space let me skip right to the point. There Back ! Starring Bruce Willis ( Sin City, Die hard ) , Mary Louise Parker , Jhon Malkovich , Helen Mirren, Award Winning Anthony Hopkins ( Hitchcock) , Katherine Zeta Jones , and Byung- hun lee who kick ass in the sequel. very talent actors,actresses. This will Moviegoers and Fans of Spy movies never forget the name\" RED \" 10 times better then James Bond movies are old then then today. Grade A+. Even if critics don't like picture watch anyway",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2015
      },
      "score": 6,
      "text": "Bottom line: I didn’t expect much from Red 2 and I wasn’t disappointed; it is funny at times and is, overall, a pleasant enough movie.",
      "total_reactions": 0,
      "user": "GregePorter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "A highly-watchable but stilted sequel that serves as a complacent sequel to the fun original.",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ]
}