{
  "mc_avg_user_score": 7.7,
  "mc_metascore": 40,
  "mc_mixed_rating_frequency": 17,
  "mc_movie_name": "Remember Me",
  "mc_negative_rating_frequency": 24,
  "mc_positive_rating_frequency": 159,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2011
      },
      "score": 1,
      "text": "[SPOILER!] Terrible - The main characters in this didn't bring it back all the way home for me - Ally is said in the synopsis to be the girl \"that lives life to the fullest\" but it wasn't clearly demonstrated in the movie. Tyler's supposed to be this rebellious, lost young man with a bad relationship with his father, yet Robert Pattinson only brings out a cold, emotionless character. The romance between Ally and Tyler looked so strained and fake - it didn't come across as real feelings, they both just looked too cold and heartless, especially in each other. The part where \"Tuesday September 11 2001\" was written on the chalkboard came as a huge shock to me and made my heart skip a beat. However using it as a way to kill off the main character just to end the movie in the last 5 minutes does not depict the real tragedy behind 9/1/1. Waste of my time, I'm so disappointed in this movie.",
      "total_reactions": 1,
      "user": "SShao"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2014
      },
      "score": 0,
      "text": "Good god, what a Terrible movie.  Horrible performance by Pattinson and the premise is just moronic. 3 people walked out when the \"twist\" came. Pierce Brosnan is poor also.",
      "total_reactions": 1,
      "user": "Jagged"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "It was simply a beautiful movie. I don't know why people would get offended by it. The whole cast did an amazing build up, you really, really felt for them. The movie just shows perfectly how can almost anyone can vanish and that you must care for the ones as if its the last day. The relationship between Tyler and Ally is just different from the other relationships they now show on some movies, it's not about only being attracted to each other, but to know them fully. I simply loved this movie.",
      "total_reactions": 2,
      "user": "RaysNBeanies"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2010
      },
      "score": 2,
      "text": "This movie had a lot of cliches and the ending was just a cheap and insulting way to get girls to cry. I thought it had a good script and good intentions but it comes off as just a quick gimmick. The acting was alright, but Emilie de Ravin was really good :)",
      "total_reactions": 2,
      "user": "Broken_Bones"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "When I heard that Robert Pattinson (one of my least favorite actors) was going to loss the fangs and the pale skin to play a regular human being in a movie that has actually moral meaning and a story not half-baked and dull to unlawful extremes I nearly fell out of my chair it was just too unbelievable, too unfathomable for me too comprehend Robert Pattinson is not the type you would exactly associate with a movie with this kind of deep subject matter the films story revolves around death, loss, suffering and violence all of which are very heavy themes and echo  sadly throughout the film.  I had no interest in seeing this even if it did have some of my favorite actors in it namely Chris Cooper and Pierce Brosnan (both of which are phenomenal in this film) it had almost been two maybe three months into this film release that I started to become interested in it. Especially after a news article surfaced about the film talking about the films twist ending my interest in this film soared. You see controversy surrounding a film always for some reason or another intrigues me. Allen Coulter's \"Remember Meâ",
      "total_reactions": 1,
      "user": "Lopez17"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "This movie was a fantastic movie, I was recommended it by many friends and finally decided to watch it. I was not disappointed at all. I find it funny what some of the critics are saying on here about how its just about some guy who has sex and ends up bullying little school girls, no, there is soooo much more to this story, it is a very hearth clenching one and the ending was completely unexpected. I just want to say that its funny how bad critics rate some films when the actual audience loves it, Makes you wonder why there is even Critics?",
      "total_reactions": 1,
      "user": "Benga1s85"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "Again, the casting is the ace in the hole for every movie, Robert Pattinson did a great performance as a rebel young guy. I should say I felt identified with \"Tyler\" because the bad relation with his father and the anger against every situation that warrants. At this part, the script is real but I comes predictable when everything goes well. Sad and dramatic ending. But still poor.",
      "total_reactions": 1,
      "user": "Nightian"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "This movie has all that is required for me to fully enjoy it and at the same time make my girlfriend think she's watching a girlie movie. I found RP to be quite good, that caught me off guard and makes me certainly look forward to cosmopolis. The movie had the right balance of boys/girls interacting with boys/girls, but also much more serious stuff. I'll watch it again.",
      "total_reactions": 1,
      "user": "VidsRule"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "i thought this was much, much better than the critics gave it credit for.  i was expecting a maudlin mess, with robert pattinson slouching about and mumbling, which he was guilty of in a few scenes;  and the boardroom fight was verging on ludicrous.  however, it was so well acted otherwise i found myself drawn into the story, and willing to overlook  the embarrassing (mostly pattinson) moments.  yes, it's manipulative, aren't all movies?  it had an indie feel to it that i really liked and i plan to watch it again. i like movies that capture new york's \"personality\", and this one did.",
      "total_reactions": 1,
      "user": "margo1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "This is the most underrated movie in recent years. I won't spoil anything, but I think the reviewers who are angry at this movie don't understand its intent. The ending of the movie is the essence of the movie; the movie's whole point. It's the kind of movie that needed to be made. There have been other movies that have tackled this topic, and very few have had the impact with it that this one had, and its because of its clever execution. Without saying too much, the issue tackled in this movie came across in real life the way it came across in the movie: shocking. By handling the topic in this manner, the viewer was able to feel the same emotions all over again. The movie was an in depth look at the life, struggles, and relationships of someone who experienced what happened at the end of this movie, and how it affected the people around that person, and it was executed in such a way that it came across to the viewers just like how it came across to that person's family. The only reason I didn't give it a higher rating was because of everything leading up to it. It wasn't a very well written script up to that point, although it had its moments. This had the potential to be one of the greatest movies of all time, as the essence of the movie was absolutely brilliant. However, up to that point, it was really just a typical teen romance movie. Had this movie had stronger character development and a more fascinating storyline, it would've been Best Picture worthy. I know that seems like saying if Mrs. Lincoln's husband wouldn't have been shot she would've enjoyed the theater, but the first two hours of the movie really aren't what the movie's about. The movie really is the last few scenes. Those scenes are more emotionally powerful, and make more of a statement than most Best Picture winners. Like I said: this is an idea for a movie that had to happen.",
      "total_reactions": 1,
      "user": "MichaelDN"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2011
      },
      "score": 4,
      "text": "This movie is very good. The only thing that ruins every little part of the entire movie is when robert pattinson dies. i felt bad for the little sister. that was her only other older brother. One thing that is good about this movie is that it interfeeres with the twin towers and that made me very emotional even though I did not lose anyone that day. The united states did. They lost hope.",
      "total_reactions": 2,
      "user": "abduction"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "Love the movie. Robert Pattinson does an outstanding job in this movie, it made me a fan of his, despite Twilight. Although it's a pretty slow movie, the ending is beautiful, and the more times I watch the movie, the more I like it.",
      "total_reactions": 1,
      "user": "AmyNozomi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Remember Me was a movie I will definitely remember. Critics can say all they want about the movie's ending being offensive, but I don't understand how anyone can have that opinion. The movie portrayed a tragedy. It did not belittle it, make it sound lighter than it really was. The story and its characters were intriguing, and each had their demons that kept you wondering what their past was. Robert Pattinson really shined in this movie, as did Emilie de Raven. I'm hoping that people won't disregard this movie without watching it because they don't like Twilight. Rob was phenomenal in this, much better than Twilight. But all in all, the movie was sweet, compelling, and very emotional.",
      "total_reactions": 1,
      "user": "ashley_"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "Remember Me isn't a horrible movie. it won't make you question the sanity of others, it's more or less of a romantic comedy that slowly descends into one of the most stunning ends I've ever seen (even though it may be predictable) I enjoyed Rob Pattinson (even though Twilight gets on my nerves- he's a good actor if he actually tries)    It's depressing enough to see someone die, but what could be sadder than 9/11 combined with a love story? You guessed it. I advise you to have your favorite comedy near you after you watch this. Pros: Great acting, great script. Cons: Too depressing. Diagnosis: See it.",
      "total_reactions": 1,
      "user": "JawsLaxerDrama"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2016
      },
      "score": 0,
      "text": "Really the ending is just hollywood exploiting 9/11 as some sort of plot device. It was completely unnecessary as any other cause of death would same the same purpose without being exploitative. I would be shocked if the people involved had any connection to NYC on 9/11. This was distasteful and the film belongs in the garbage heap as a result.",
      "total_reactions": 1,
      "user": "chris247482"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2015
      },
      "score": 3,
      "text": "Here's my message to the idiot who came up with the ending to this movie...",
      "total_reactions": 0,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2015
      },
      "score": 2,
      "text": "well i thought the movie was between 5 and 6 until the ending made my score plummeted to 2 then i thought what a cheap way to  end a movie and get more money, meh :(",
      "total_reactions": 0,
      "user": "VinceRocks123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2016
      },
      "score": 9,
      "text": "The things you will do in your life are insignificant. But it's very important that you do them.Basically is all you need from this film.",
      "total_reactions": 0,
      "user": "avamiller21"
    }
  ]
}