{
  "avg_user_score": 4.6,
  "metascore": 32,
  "mixed_rating_frequency": 31,
  "movie_name": "Ride Along 2",
  "negative_rating_frequency": 27,
  "positive_rating_frequency": 22,
  "pro_critic_reviews": [
    {
      "critic": "Calvin Wilson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2016
      },
      "score": 63,
      "summary": "As cop comedies go, Ride Along 2 gets the job done."
    },
    {
      "critic": "Kayla S. Samoy",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2016
      },
      "score": 60,
      "summary": "At best, Ride Along 2 is what you’ve seen in every other comedic cop movie. Nothing outstanding, but mindless fun."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2016
      },
      "score": 60,
      "summary": "Like your smartphone, it's a testament to the theory of interchangeable parts, a perfectly engineered product that, if you're charitable, you might also think of in terms of art....But every time I started to believe that there's some parodic impulse behind the filmmakers' recasting of clichés, Cube's character would punch a suspect in custody or commit some other violation of civil liberties that the film invites us to cheer."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2016
      },
      "score": 50,
      "summary": "The script by Phil Hay and Matt Manfredi gives you next to nothing for narrative complication and surprise, and a meager amount of verbal jokes."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2016
      },
      "score": 50,
      "summary": "It's simply a retread of the first Ride Along, a 2014 box-office hit,  and proof positive that a bigger budget doesn’t buy bigger laughs."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2016
      },
      "score": 50,
      "summary": "This franchise is lucky to have Kevin Hart in that role, and his manic comic energy is enough to make the sequel something other than a complete waste of time. But the genre is also stubbornly innovation-proof, and there’s not much new to see here."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2016
      },
      "score": 50,
      "summary": "You’ll have to be satisfied with a modest assortment of energetically comic moments here, because the story sure isn’t a reason to catch this encore, and neither are who-asked-for-’em cast additions such as Ken Jeong."
    },
    {
      "critic": "Jesse Hassenger",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2016
      },
      "score": 50,
      "summary": "The implausibilities, cop-movie checkboxes, and mildly wasted talent make Ride Along 2 lazy, but not downright loathsome. If anything, it’s perhaps slightly more amusing and agreeable than the original—a sign of how little that film’s seemingly surefire premise wound up mattering."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2016
      },
      "score": 50,
      "summary": "Ride Along 2 is the movie equivalent of a cover band. We’ve seen it all before, and often in much better films."
    },
    {
      "critic": "Kevin P. Sullivan",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2016
      },
      "score": 50,
      "summary": "Ride Along 2, which moves the action from Atlanta to Miami, plays more like a remake than a sequel."
    },
    {
      "critic": "Randall Colburn",
      "publication": "Consequence of Sound",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2016
      },
      "score": 42,
      "summary": "Hart, the firecracker that he is, has a fitting comedic (and crime-fighting) partner out there somewhere. But it’s not in the Ride Along series."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2016
      },
      "score": 40,
      "summary": "Shoddy and exhausted from the start, this painfully unfunny buddy-cop comedy lands with a plop in the January sewer of failed Hollywood castoffs."
    },
    {
      "critic": "John Hazelton",
      "publication": "Screen International",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2016
      },
      "score": 40,
      "summary": "With a script that’s about as inventive as the title, Ride Along 2 does little more than rehash the formula that two years ago teamed Ice Cube and Kevin Hart in an amiable if unambitious action comedy."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2016
      },
      "score": 40,
      "summary": "This laid-back amusement should not be misinterpreted as competent storytelling. Though some of the jokes land, that’s entirely due to the performances; there’s not one example of clever writing in the entire picture."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2016
      },
      "score": 40,
      "summary": "For better and for worse, it's neither better nor worse than the original \"Ride Along.\" That's because it's essentially the same movie."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2016
      },
      "score": 40,
      "summary": "With a storyline less challenging than that of a typical CBS crime procedural, Ride Along 2 is little more than a repetitive rehash of the original."
    },
    {
      "critic": "Susan Wloszczyna",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2016
      },
      "score": 38,
      "summary": "One of the loudest laughs arrives when we get to enjoy a scowling James re-imagined as a game character. Points for greater diversity in the cast as well, but, if there is a second sequel in the offing, please allow the women to be more than the sum of their body parts."
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2016
      },
      "score": 37,
      "summary": "The plot is paint by numbers, which puts pressure on the comedy to deliver. But it doesn’t."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2016
      },
      "score": 30,
      "summary": "Ride Along 2, which picks up not long after the first film ended, doesn’t mess much with the formula, except that everything feels more frayed and tired this time around."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2016
      },
      "score": 30,
      "summary": "Although the plot is pretty bare-bones, it’s propped up by plenty of gratuitous dialogue and imagery that do nothing to further the story."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2016
      },
      "score": 30,
      "summary": "The film’s most genuinely funny moment involves A.J.’s ringtones, which should perhaps come as no surprise — the stakes, and the laughs, are so small that Ride Along 2 was apparently designed to be watched on your phone."
    },
    {
      "critic": "Brad Wheeler",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2016
      },
      "score": 25,
      "summary": "Hart’s irritating character desperately seeks approval, but his idiocy is too much. The comedian makes Jerry Lewis look like Benedict Cumberbum – and if you think that line is funny, Ride Along 2 is your kind of jam."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2016
      },
      "score": 25,
      "summary": "As for this long, boring, violent sequel? Life’s too short."
    },
    {
      "critic": "Eric Henderson",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2016
      },
      "score": 25,
      "summary": "Like any serving of junk food, it seems engineered to give you that initial rush of satisfaction, but leaves you in a dead zone where the only thing you want is more of the same."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2016
      },
      "score": 25,
      "summary": "It’s a formula movie, which wouldn’t necessarily be a problem, except that it’s a sort of bad version of itself."
    },
    {
      "critic": "Stephen Whitty ",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2016
      },
      "score": 20,
      "summary": "Pretty as Bratt and Munn are, they're not distracting enough to cover up for the screaming Hart and grating Jeong, who seem to be in a race to see who can play a more annoying character. In the end, it's a tie — they both win."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2016
      },
      "score": 20,
      "summary": "Another tired, witless and potentially lucrative attempt to spin an exhausted buddy-cop template into action-comedy gold."
    },
    {
      "critic": "Read full review",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2016
      },
      "score": 12,
      "summary": "To call Ride Along 2 rubbish is unfair to rubbish, which at some point had a purpose."
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2016
      },
      "score": 0,
      "summary": "The entire film seems cloaked with a general vibe of “good enough.”  Embarrassingly cheap CGI effects, poor ADR, and slipshod, jarring editing are the technical failures that compound with the creative ones to indicate a movie that’s not just miscalculated, but seemingly committed to putting together, at its best, a deliverable product and nothing more."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2016
      },
      "score": 5,
      "text": "Typical comedy sequel that can't live up to the hype of the first movie, funniest moments were ruined by the trailer. Mediocre movie with not many laughs.",
      "total_reactions": 1,
      "user": "gab19"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2016
      },
      "score": 3,
      "text": "Check out the Formal Review episode on Ride Along 2and full review here:",
      "total_reactions": 1,
      "user": "TheFormalReview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "Ride Along 2 was a very funny movie. I enjoyed it and would recommend my friends to check it out. I really enjoy Kevin Hart. Would like to see more movies with him in it.",
      "total_reactions": 1,
      "user": "YSargeant"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2016
      },
      "score": 3,
      "text": "Ride Along 2 isn't worth riding on to the theaters to see. If Ice Cube and Kevin Hart can be good buddies, then it should only be the first one that's worth it.",
      "total_reactions": 6,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "A meager entry into the \"Kevin-Hart buddy comedy\" sub-genre, \"Ride Along 2\" is a stale, recycled cop caper that is rarely funny and filled to the brim with half-hearted performances.",
      "total_reactions": 3,
      "user": "Compi24"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2016
      },
      "score": 1,
      "text": "I get that people watch this for Kevin Hart and some people watch this to get entertained. I'm the second type of people. Kevin Hart is like Adam Sandler. He plays the same character as before and get this, he tried so hard to give you a laugh. Ice Cube actually made me chuckle a little because the insults he gave Kevin, felt like I was saying it to him. Anyways, Ride Along 2 is just terrible, childish, and unfunny (sometimes funny).",
      "total_reactions": 3,
      "user": "DavidV293"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2016
      },
      "score": 0,
      "text": "I would say \"Ride Along 2\" is Kevin Hart's funniest movie yet but that could be construed as hate speech. He seems like a great guy in interviews but not all great guys are funny or creative.",
      "total_reactions": 4,
      "user": "crankyerma"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2016
      },
      "score": 4,
      "text": "Oh great we get to see Kevin Hart be annoying and unfunny again in this Ride Along franchise [sarcasm]! I didn't think the first Ride Along was funny at all, yes it gave me a few laughs but I find Kevin Hart annoying and unfunny but Ice Cube saved the mediocre action buddy-cop movie. But now we have a sequel just what this stupid mediocre action-comedy franchise needs. Let me tell you that this sequel is not good at all, the gags are unfunny (but some do work). Ben Barber (once again played by Kevin Hart) a former high school security guard who is a month out of the police academy and a week away from marrying James' sister (Tika Sumpter). He wants to be a detective like James (played again by Ice Cube), his future brother-in-law, James reluctantly takes Ben to Miami to follow up on a lead that's connected to a drug ring. The case brings them to a homicide detective (Olivia Munn) and a computer hacker (Ken Jeong) who reveals evidence that implicates a respected businessman. It's up to James and Ben to prove that charismatic executive Antonio Pope (Benjamin Bratt) is actually a violent crime lord who rules southern Florida's drug trade. Munn and Jeong shouldn't be in this movie because both of them are talented, and they can't save this film either. Director Tim Story directs once again, and the direction is once again terrible. Bratt as the villain is okay, he did an okay job. Jeong isn't funny here, he deserves better material. If your a fan of the first one, go see it! But for the rest stay away, this film isn't worth the ride. Let's not hope their not making another one of these movies. 2 out of 5",
      "total_reactions": 2,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "Ride Along 2 does have its moments and Kevin Hart and Ice Cube have outrageously good chemistry as well as Ken Jeong and Olivia Munn, but the film is just too cliched and it's your regular buddy-cop comedy. The film is long, and the plot is the same thing in every single buddy-cop comedy. It isn't too much worse than the original, but I guarantee you that you've definitely seen this before.",
      "total_reactions": 2,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2016
      },
      "score": 3,
      "text": "Ride Along 2 is almost exactly like the first Ride Along - sure, it has it's standout moments, but most of it is boring and stupid. The film just can't grasp the viewer, and leaves them bored.",
      "total_reactions": 2,
      "user": "TheKavehJ"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2016
      },
      "score": 2,
      "text": "Ice Cube and Kevin Hart are both immensely charismatic actors but their talent far outweighs the weak material they have to work with in \"Ride Along 2.\" They are both way too good to be starring in such junk. This terribly unfunny movie fails on every level possible. It's not funny, it's not exciting, the dialogue is abysmal, the lame gags fall flat, and a coherent plot is nonexistent. By the time the movie picks up some steam with a shipping dock shootout, it's far too late for salvation. The whole thing feels like stale, sad, reheated leftovers. This ride quickly runs out of gas.",
      "total_reactions": 2,
      "user": "screenzealots"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2016
      },
      "score": 1,
      "text": "Movies really bad, save yourself some time and money. Made it 31 minutes before stopping because I'd had enough. Gave it a 1 simply because making a movie takes some sort of effort, in short, this movie is utter garbage.",
      "total_reactions": 2,
      "user": "jabawokie"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "I found this movie to be hilarious.  The entire audience seemed to agree with me as the whole theatre was laughing throughout.  Weird that it only got 15% from the critics.  I think it did it's job which was to provide the audience with laughs :D",
      "total_reactions": 6,
      "user": "tavisgordon"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "ok i really dont get why this movie is getting such bad ratings i mean i thought it was absolutely hilarious myself and come on people did u rerally expect it to be like the first if so then rewatch the first and let us enjoy it for what its truly meant to be a comedy meant to make u laugh and brighten your day i think it did its job myself i say go see it",
      "total_reactions": 3,
      "user": "chrismovieguy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2016
      },
      "score": 8,
      "text": "Like most comedy sequels, \"Ride Along 2\" tries to give audiences more of what they enjoyed with the first movie, only bigger. The situations Hart and Ice Cube get themselves involved in are crazier and more absurd this time around, but the real laughs still come from watching Kevin Hart's motor mouthed character getting shutdown by Ice Cube again and again.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "For Ride Along 2  bigger doesn't always mean better,but satisfying more the less.One thing Ride Along 2 did good no GREAT was Kevin Hart, the guy is just the best comedian in Hollywood and it shows in this movie and I guarantee Kevin Hart fans will not be disappointed, every time he steps on you just laugh and laugh although it feels he carries the weight of the film too much unfortunately the same things can't be said for the co-stars.Ice cube who plays as Kevin Hart's partner is just too dry at times and his seriousness doesn't always match with Kevin's wit although there were some fun moments between the two.Ice Cube and Kevin Hart just don't have great chemistry and some of the heart felt moments between the two felt cheap, same thing can be said about Oliver Munn who is the exact same character as Ice cube but she has tries to have a more comedic role which felt awkward and cringy at times with makes you go no Psylocke no(fingers crossed she won't do the same thing in X-Men Apocalypse), but all this can be ignored because there is a lot fun and enjoyment in this movie . This sequel outshines the original in the comedy as Ride Along 2 is Funnier and crazier although some of the jokes feel forced and lazy and the first half of the movie is rather dull but picks up fast.Ken Jeong is the best new character this movie has and he has some great scenes as well as Tika Sumpter who plays Kevin Hart's girlfriend who wasn't in the film as much but was good in the film as Ben's girlfriend.The villain in this film is rather generic and cliche but is a better villain than the first movie, but if you don't mind cliché villains you won't mind.So overal Ride Along 2 is not as good as the first Ride Along but is a satisfactory sequel, a good popcorn flick,if you're looking for something deeper in this film you won't find it as the film has weak character growth, but no  the less Ride Along 2 has great comedy, some wild action and if you can ignore some bad CGI and weak characters you will have a great time.",
      "total_reactions": 2,
      "user": "T-rodney"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "They both are getting closer professionally as well as family.",
      "total_reactions": 1,
      "user": "LeZee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2016
      },
      "score": 6,
      "text": "Not bad for what it is , As a partner cops making a movie with  Action, Comedy, Crime categorize you will find all the above  in it  , That part I liked more than the first one but can't rate it more :)",
      "total_reactions": 1,
      "user": "Q8MarrongGlace"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2016
      },
      "score": 4,
      "text": "Alright first of all no one ever asked for a sequel to the ride along movie. Secondly this one is worse than the first. This is just a rehash of the first movie but with different objectives. The chemistry between Hart and Ice cube is not good at all though they’re the best part in the movie. This movie isn’t funny at all most of the jokes were flat. It even had a terrible way of editing just like the first one. The only thing that was interesting in the movie was the car chase which was really unique and enjoyable. The villain was god awfully terrible and cliched.In the end Ride Along 2 is a very forgettable movie with Hart trying hard to make people laugh but at this point people are getting tired of kevin Hart’s comedic movies.",
      "total_reactions": 1,
      "user": "FarhanFiroz"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "This movie was full of mediocre action and senseless humor. Overall I enjoyed this movie. If you don't have a good sense of humor this movie is not for you. It's not worth a trip to the theater but definitley a rental",
      "total_reactions": 3,
      "user": "adasto85"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2016
      },
      "score": 4,
      "text": "A sequel that is about on level with the first film.  While the film fails to bring much new to the buddy cop genre, it has a chuckle or two so it's not completely unwatchable.  C-",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2016
      },
      "score": 4,
      "text": "Ride Along 2 is generic, unnecessary and predictable. However, it remains entertaining throughout and is funny if not hilarious at times. The chemistry between the two leads work here.",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2016
      },
      "score": 4,
      "text": "Ride Along 2 feels like a movie that no one asked for. It re-uses lots of humor and jokes from the first film. It still has it's moments like the first movie but they are few and fair between. It's got a generic story that you feel like you've seen before. If you enjoyed the first Ride Along you may enjoy this film. But sadly it doesn't really bring anything new to the table.",
      "total_reactions": 0,
      "user": "ToFewViews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2016
      },
      "score": 7,
      "text": "I quite enjoyed the movie. Maybe it is a bit similar to first part and I wouldn't say that it is unbelievably funny, but I do recommend it if you want to watch something fun without going into it too much.",
      "total_reactions": 0,
      "user": "Ralfbergs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2016
      },
      "score": 4,
      "text": "Ride Along 2 was much better than I expected, in that I casually chuckled more than a few times. Hart and Ice Cube are great, and I love Olivia Munn. This isn't good or hilarious but it's diverting enough.",
      "total_reactions": 0,
      "user": "InglouriousAndy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2016
      },
      "score": 2,
      "text": "It's no surprise that a buddy cop movie with Kevin Hart and Ice Cube isn't funny or entertaining in thr slightest. Much of the humor is dependant on slap stick and sex jokes and is usually forced. Ice Cube is playing himself again and Kevin Hart is playing that stubborn black elf character that he is known for. The movie struggles to find a story arc and is unsuspenseful due to each event being rushed into a January release sequel. The ending happened so fast that it almost seemed like the director didn't care to actually finish the project.",
      "total_reactions": 0,
      "user": "willm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2016
      },
      "score": 5,
      "text": "This movie is bad.But kevin hart was good in this movie and there were a few laughs. But this movie is unforgettable and most of the jokes were bad.So I give ride along a 5/10 it is ok",
      "total_reactions": 0,
      "user": "shadowguy654"
    }
  ]
}