{
  "avg_user_score": 6.1,
  "metascore": 49,
  "mixed_rating_frequency": 51,
  "movie_name": "Rio 2",
  "negative_rating_frequency": 29,
  "positive_rating_frequency": 77,
  "pro_critic_reviews": [
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2014
      },
      "score": 83,
      "summary": "Choosing any unwieldy subplot to trim from Rio 2 is tough, as they're each so vibrantly rendered."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2014
      },
      "score": 75,
      "summary": "The superiority of the musical sequences, and laziness of the writing, creates a dynamic where you find yourself wishing the characters would shut up and dance."
    },
    {
      "critic": "Bill Zwecker",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2014
      },
      "score": 75,
      "summary": "With a splashy Brazilian-themed musical score, top-notch voice talent and sharp-witted writing, the sequel to “Rio” is one delightful animated romp. It’s as good as the first one and sure to please both the kiddies and adults with its two-tiered humor."
    },
    {
      "critic": "Justin Lowe",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 70,
      "summary": "Under Saldanha's guidance, an extensive team of animators and visual effects artists elevates the 3D format to an alluring level, with character details, dense background imagery and often complex action and aerial sequences (including a requisite Busby Berkeley-inspired musical number) appearing effortlessly executed."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2014
      },
      "score": 63,
      "summary": "Rio 2 is not what I would call Amazon prime, but it’s got enough silly songs and daffy critters to keep the little ones happy."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2014
      },
      "score": 60,
      "summary": "Wonderfully animated and well-voiced, Rio 2 is nevertheless too much. Too much plot, too many issues, too many characters. But not too much music."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2014
      },
      "score": 60,
      "summary": "There's just nothing magical about the story, nothing that lifts it above its status as an agreeable song-and-dance movie, a laugh here, a laugh there, pleasant but overly busy, for seemingly no real reason other than to throw a few more set pieces at the wall to see what sticks."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2014
      },
      "score": 60,
      "summary": "Most impressive: the striking vibrancy of the animation. This is the rare movie that earns the extra cost of 3-D glasses."
    },
    {
      "critic": "Kate Stables",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2014
      },
      "score": 60,
      "summary": "The predictable plot gets an enjoyably venomous boost from Jemaine Clement’s revenge-obsessed cockatoo Nigel."
    },
    {
      "critic": "Angie Errigo",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2014
      },
      "score": 60,
      "summary": "A very unfocused, sporadically funny film, lifted by its (predictable) visual splendour."
    },
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2014
      },
      "score": 60,
      "summary": "The characterisation is feisty and memorable, the song-and-dance sequences intricate and colourful, and it’ll charm the socks off little people."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 60,
      "summary": "This hyperactive toon extravaganza has color, flair and energy to burn. But it’s the sort of relentless juggling act that finally proves more exhausting than exhilarating."
    },
    {
      "critic": "Stephan Lee",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2014
      },
      "score": 58,
      "summary": "There are fun moments, especially with Kristin Chenoweth’s vampy poison dart frog. But with more evolved films like \"The LEGO Movie\" and \"Frozen\" in the animated ecosphere, overstuffed and gag-reliant time-passers like the Rio movies feel like a dying breed."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "Rio 2 is a perfect example of franchise maintenance in place of storytelling."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "You wish Rio 2 had the smarts and the inventiveness to match its scattered bursts of ambition."
    },
    {
      "critic": "Susan Wloszczyna",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "Rio 2 has exhausted its limited amount of charm. Most regrettably, Rita Moreno appears in her first movie in eight years as Jewel’s overbearing Aunt Mimi but is barely allowed to make an impression."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "A tropical tornado of cadmium and cobalt, magenta and marigold, Carlos Saldanha’s frantic follow-up to his well-received 2011 animated feature, “Rio,” ups the ante on sound and movement but pays scant attention to story."
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "The movie feels at once too busy and too derivative. That’s no easy feat, but it’s also one sequel-makers probably shouldn’t aspire to."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "A little less agreeable and way more aggressive than its better begetter, Rio 2 has the overstuffed agenda of a movie that’s been focus-grouped to death."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "Rio 2 teems with colorful animated splendor and elaborate musical numbers, but its rambling, hectic, if good-hearted, story is for the birds."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "It’s fun in stretches, but also busily forced."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "It's a bright and fun movie, but also repetitive and overloaded with plot. A nice enough diversion, but not a necessary one."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "Rio 2 offers roughly the same approach to story and to story clutter as did the first movie."
    },
    {
      "critic": "Kevin McFarland",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "Like the first film, Rio 2 is almost oppressively bright, bombarding the screen with flashes of saturated rainforest colors and even a bird version of soccer (timed a bit too perfectly to the 2014 World Cup in Brazil)."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "If this sequel proves anything, it’s that more is not always better."
    },
    {
      "critic": "Jenni Miller",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "A strange combination of mental exhaustion and boredom."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2014
      },
      "score": 42,
      "summary": "You get the sense that Rio 2 wasn't thought through as much as it was quickly cobbled together as it went along, with a simple, clearheaded goal in mind: just make it good enough to warrant a \"Rio 3.\""
    },
    {
      "critic": "Daniel Green",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 40,
      "summary": "Rio 2's Amazon adventure finds its wings clipped by more tired and unnecessary subplots than you can shake a feather at."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2014
      },
      "score": 40,
      "summary": "Amid all the excess busyness, there are formulas within formulas."
    },
    {
      "critic": "Mike McCahill",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2014
      },
      "score": 40,
      "summary": "It's hard to ascribe much art or wit to a franchise that retains the services of will.i.am as comic relief – and a thoroughly inorganic talent-show subplot feels like another attempt to groom youngsters for life in the Cowell jungle."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2014
      },
      "score": 40,
      "summary": "This jumbled sequel, which was also directed by Carlos Saldanha, loses most of what made the first film such an infectious entertainment."
    },
    {
      "critic": "Louis Black",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2014
      },
      "score": 30,
      "summary": "All singing, all dancing, all color: Rio 2 is a modern, studio animation blockbuster spilling all over the place, rather than arching into the sky."
    },
    {
      "critic": "Chris Packham",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2014
      },
      "score": 30,
      "summary": "Rio 2 wants to be a musical, but instead of timing songs to, say, the emotional peaks of the characters, director Carlos Saldanha opts for high-intensity intervals of singing every four minutes."
    },
    {
      "critic": "Eric Henderson",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2014
      },
      "score": 25,
      "summary": "The net effect is a shapeless would-be diversion in which things just happen independently, a string of effects missing any cause."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "The first movie was a silent hit. One of the best animations on that year. Usually successful movies make comeback in sequels and I expected the 'Rio 2', but was not sure. 'Ice Age' series were the massive hit from the Blue Sky Studios. Other movies did not look like coming back in sequels. So 'Rio' gave them a chance to go on with a sequel. After this movie's success, now you can count on the 3rd as well. If it doesn't come then it will be a disappointment.",
      "total_reactions": 2,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2014
      },
      "score": 9,
      "text": "Ignore the critics reviews, what would they know ... they are not kids... Out of my five year olds mouth about Rio 2 in 3D... \"I loved it can we see it again\"... That is all that should be cared about, what the target audience thinks not a bunch of adult critics...  I am sure most kids would give this at least an 8...",
      "total_reactions": 2,
      "user": "Canucks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "Despite a rather silly ending, Rio 2 is a fun and really enjoyable film that does what a sequel should do; set itself apart from the original. While it doesn't top Rio, Blue Sky did a terrific job simply making a film that was just as enjoyable and just as visually appealing while not treading too much into the original film's template. They introduce new characters, pummel the animation into dazzling new heights and even throw in a three-way plot between Blu's push to be accepted by Jewel's father, Linda and Túlio's tango with deforestationists and Nigel's hilarious Tom and Jerry-esque chase for revenge with Gabi.",
      "total_reactions": 1,
      "user": "RazorEye"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "Story:",
      "total_reactions": 1,
      "user": "DemonicSoul"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "I was in the mood for a totally immersive sound score splashing, fun to follow plot of a grandiose 3D experience I had with RIO \"1\" but......... I nodded off during some middle sequences and bot even bored with some of the sub plots that were just too contrived to let me into them. I am a 74 yr old, 55 to look at, man who use to be in Hollywood 2D flat animation and have been totally blown away with the ever growing 3D industries expertise in the newer animation techniques, with still, 20/20 unaltered vision and the total range of hearing possible so I speak with a full theater patrons knowledge of what it is like to sit in a plush seat in front of a giant silver screen! I wouldn't ask for my money back but when this comes out for me to purchase the BluRay, I will know where I want to edit out the junk like hip hop scorings and lots of bad plots, which, will leave about 20 minutes and about 3 minutes of boring end credits.",
      "total_reactions": 1,
      "user": "Cinematic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2014
      },
      "score": 8,
      "text": "Rio 2 brings newly improved crispy and fleshy visuals than the original. It's story is great which deals family matters and relationship, the music is funky and lively, the voice casts is well-talented but the only thing that doesn't work out much is the hit-or-miss gags. Overall, it still enjoyable to watch at.",
      "total_reactions": 4,
      "user": "TheCoolGuy99"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "Apart from the star-studded voices and detailed animation, it is the musical numbers that are the icing on the cake in Rio 2. Especially, the absurdly re-jiggered version of Gloria Gaynor’s “I Will Survive”, sung by the poisonous pink frog Gabi. Rendered by Kristin Chenowet, it’s definitely worth a mention. Though the film is visually appealing and picturesque, the highlight of Rio 2 is the beautifully choreographed soccer game in which Blu finds himself at the receiving end. Coming from director Carlos Saldanha, who had previously delivered Ice Age, Rio 2 would definitely appeal to kids and adults alike.",
      "total_reactions": 4,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "I like enjoying the first \"Rio\" movie (which is just like the first \"Despicable Me\" movie). I think Rio 2 will be better as it is with \"Despicable Me 2\". I really want to see that movie during my graduation.",
      "total_reactions": 2,
      "user": "KNDNumbuh2008"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "Wonderful movie...waiting and hoping to get a 3rd part",
      "total_reactions": 2,
      "user": "SuperPras"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2014
      },
      "score": 0,
      "text": "An example of why great movies shouldn't have sequels. This overly boring movie, with dull dialogue, flat jokes and a plot that tries to keep us intrigued, but all that is does is the opposite.",
      "total_reactions": 3,
      "user": "RamonGuerrero"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2014
      },
      "score": 9,
      "text": "ok.................................................................................................................................................................................................................................................................................................................................................................",
      "total_reactions": 6,
      "user": "bruxo"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "rio 2 very good........................................................................................................................................................",
      "total_reactions": 7,
      "user": "ferishackers"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2015
      },
      "score": 3,
      "text": "Rio 2 will appeal to kids but that’s it. As always Blue Sky Studios turns out a sequel that while presenting beautiful animation has weak writing and serves as another soulless cashgrab to serve more intriguing and original projects such as 2015’s Peanuts. Most of the characters from the first film are there, the film tries too hard to be hip from pop songs, to technology, and shoves its environmental message down your throat. The tagline at the end of the film describes the number of jobs created by this film. While I’m happy tons of people were to find work it’s a shame it wasn’t put to better use as there is a talented team of animators on hand who deserve stronger writing to work with. Doubt parents will hate this as much as me but if you are dragged to this you can sleep through this one.",
      "total_reactions": 2,
      "user": "Jacob"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2014
      },
      "score": 4,
      "text": "I wasn't too thrilled with the first Rio, but I certainly expected more than this. It's got the excellent animation and top-notch voice cast that you would expect from a kids movie that's worth seeing nowadays, it's just missing the humor and charm. I'm sure young kids will get more than a few chuckles out of it, but older audiences like myself are better off letting the kids watch this one on their own.",
      "total_reactions": 2,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2014
      },
      "score": 1,
      "text": "No parent should bring their kid to this irritating horrible film. The music and jokes are painful to listen to, with a story that hardly makes any sense. One of the worst films this year.",
      "total_reactions": 2,
      "user": "csw12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "Certainly a beautiful film with seamless animation, but while it doesn't entirely fall into the sequel traps, it still has a very generic and basic story line with nothing new or unique to show for itself. However, it works perfectly for a kids film and has some nice contemporary morals.",
      "total_reactions": 1,
      "user": "InspectorJ"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "Why the hell everything in this movie's story was happening so fast? The final battle was just so easy without any drama! Jewel's father was like : \"who the **** are you Blue\" then\"thanks for bringing my daughter back\" and then \"you suck man, so weak and dumb\" later \"Ok i'll trust your plan, let's save the jungle\". And what the **** was happening to Roberto?! He was like \"Blue you're so lucky, Jewel's amazing\" then he's like \"if something happens to you i'll take care of your famly\" (that's when i thought that he would want to get rid of Blue) but later he went \"Blue's a good guy, i trust him\" and at the and, even though everyone thought that he was a true macho \"Omg i'm so scared, i'm the only ****in' scared bird out here!\". The story was so dumb and fast that i give it a 3/10 because it's stupidity made me laugh and also the songs were the only good part of this animation.",
      "total_reactions": 1,
      "user": "SEROJ"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "Whilst Rio 2 does have its moments of glory, for the most part it is a loud, unfunny, and irritating animation extravaganza which becomes mostly tiresome.",
      "total_reactions": 1,
      "user": "sammurphy66"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "What to do if you have not even idea what to do? Answer is just make second part of something.",
      "total_reactions": 2,
      "user": "komarhomester"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "\" Beautiful\". New Story = Brilliant finally. I have the first one its was amazing beauty. Starring Jessie Eisenberg (Zombieland) , Award Winning Anne Hathaway , Will i am , Jamie Fox , George Lopez, Jemaine Clement , Andy Garcia  and Kristen Chenoweth.  not so ok cast. I only watch Rio because duh  watching Blu and Jewel's adventure and the beautiful city rio. Now that Blu and Jewel are taking a trip to amazon with their children tells their in for a quite good adventure your right. the forest is beautiful this could be the be the best sequel ever !. Grade A",
      "total_reactions": 1,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2014
      },
      "score": 3,
      "text": "A tame and heartwarming story gets absolutely broken with this forced upon movie, adding mostly nothing but bland and boring characters. An excuse for a sequel.",
      "total_reactions": 2,
      "user": "Yaysuz"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2014
      },
      "score": 0,
      "text": "Events with no purpose, movie doesnt even make sense to my kids, would not reccomend spending your money to watch it, since the plot is repetitive and makes no sense.",
      "total_reactions": 2,
      "user": "Cevdet"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2014
      },
      "score": 2,
      "text": "I hate whamming on a kids movie but this is a terrible kids movie. It's not that much fun, the characters aren't as interesting as in recent animations and this actually got a sequel before The Incredibles did...what the hell? Years from now if I had to choose between showing my children Rio 2 or Toy Story, I would choose Toy Story because it's a far superior film and it even teaches you about family, friendship and doing the right thing. The worst animation since Ice Age 4.",
      "total_reactions": 2,
      "user": "Movi3R3vi3wer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "Bem mediana, a animação está longe de ser legal como a primeira. Mas, ainda não é uma perca total de tempo. Vale a pena assistir apenas para passar o tempo.",
      "total_reactions": 1,
      "user": "BlaKDemonaZ"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2016
      },
      "score": 0,
      "text": "Rio 2 more like Rio In2 the Garbge. What a complete Mess they have done I never saw a animation That was so bad that this, Ice Age 4, Strange Magic and Home are the worst animation movies ever.",
      "total_reactions": 2,
      "user": "Animationlover2"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2016
      },
      "score": 7,
      "text": "Rio 2 is your standard, animated kids film. Whether or not that is a good thing depends on the willingness to sit through a well animated film held up by a by the book plot about saving the environment and impressing relatives.",
      "total_reactions": 1,
      "user": "J2005"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2016
      },
      "score": 9,
      "text": "This movie was a lot better than the first. I loved this movie and I saw it when it came out. It was pretty funny and touching. A lot better than the first.",
      "total_reactions": 1,
      "user": "StannyCartvski"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "A dull sequel with a very predictable plot that you can see coming a mile away. A few good songs don't really make up for this. First film was a lot better.",
      "total_reactions": 0,
      "user": "DukeJon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "I’m not a huge fan of the first “Rio,” as I think it is a very straight forward movie with little to offer. It’s fun and all, but lacking in emotional punches.",
      "total_reactions": 0,
      "user": "AwesomeReviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2014
      },
      "score": 6,
      "text": "Animation was great and fun to watch. Story line was quite good and the dialogue was good also. I think that this is a good family movie with a lot to offer in the way of entertainment.",
      "total_reactions": 0,
      "user": "ricksroses"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "well i sat down and watched 'Rio 2'. so what did i think about it? it was actually pretty decent. i really enjoyed it, i thought it was a nice follow up to 'Rio'. the story of 'Rio 2' talks about Blu, Jewel and their family visiting the Amazon to find a bunch of other birds like them, and Jewel also gets to meet her dad and ex-boyfriend. meanwhile Nigel comes back to get revenge for what happen to him in the first movie. i liked how in this movie, Carlos Saldanha was able to keep the fantastic animation, funny characters and great comedy from \"Rio 1\" and it was really entertaining. the voice acting was good too: i thought Jesse Eisenberg was really good as Blu; Anne Hathaway also did a great job as Jewel; Jemaine Clement was a great pick for Nigel; Blu and Jewel's 3 little kids were really cute and Jamie Foxx and Will.I.Am were hilarious as Nico and Pedro. but does this movie have a down part? yea it does. \"Rio 2\" tries to make everything bigger this time, which means it really starts to run outta steam a little bit. some of the side characters were pretty annoying, the songs aren't as great or memorable this time and even though it still had hilarious scenes, i thought \"Rio 1\" was a little funnier and smarter. either way, \"Rio 2\" was still a really decent and enjoyable sequel with fantastic animation, funny characters, nicely-written dialogue and great music and comedy. like i said, not as good as \"Rio 1\", but i liked it and i'm glad i watched it.",
      "total_reactions": 0,
      "user": "NikoZguri1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2014
      },
      "score": 5,
      "text": "I loved the first Rio but the sequel is just a convoluted mess of side stories mixed together with the main plot. the animation was a true sight to behold especially in 3D but the humor and personalities of the characters were really dumbed down in comparison to the first with the exception of Nigel. altogether this was very disappointing. Not the worst sequel I've seen but certainly disappointing.",
      "total_reactions": 0,
      "user": "GreyMatter603"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "Rio 2 es una película que iguala o supera a su anterior entrega, con una muy buena adaptación de algunas obras muy conocidas, además de la carisma que ofrece su historia, logra ser una buen film animado.",
      "total_reactions": 0,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 5,
      "text": "Rio 2 was terrible. There's no story, but that's what happens when you make a sequel, like Grown Ups 2, Ghost Rider: Spirit of Vengeance, and Mad Max: Beyond Thunderdome.",
      "total_reactions": 0,
      "user": "chw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2014
      },
      "score": 4,
      "text": "I gotta admit that I enjoyed the beginning of the movie but as it transitioned to the end the plot was very obscure. Furthermore the characters are very lifeless, in other words there's no clear purpose as to what they should do in the movie compared to the first Rio, except the main characters. The songs were quite enjoying and it shows that it's really for kids.",
      "total_reactions": 0,
      "user": "KaleBishop"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "All the old characters and the voice actors were recovered from Rio, and new voice actors and the characters were well-chosen. The music was just as good (maybe more better) as the in Rio, and the story was good. the film was dubbed in Finnish well. I hope Rio 3 will come someday! or in series...",
      "total_reactions": 0,
      "user": "Pathea"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "\"it was nice and also the message really cute so we already lived this stuation last year in istanbul its called gezi park protest to me its similar. and as animation already it was too quality\"",
      "total_reactions": 0,
      "user": "gokseltuzun"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "Rio 2 (2014) is fun, adorable and entertaining. It works as a sequel as it follows up the life of Blu and Jewel after the first film. Sadly, in general it is much inferior compared to its first film in terms of concept and story line as it is not as meaningful or as adventurous as its predecessor.",
      "total_reactions": 0,
      "user": "hayashimegumi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2014
      },
      "score": 3,
      "text": "I like the fact that they made something other than more Ice Age, but Rio just doesn't work for me at all, it's still bland, unoriginal, and forgettable. Overall there's nothing interesting about Rio 2 other than the animation is pretty good.",
      "total_reactions": 0,
      "user": "Delaforce828"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "A truly engaging sequel! This is a true secret to a strong sequel: take off from where the previous film ends, thrown in new ideas for the plot to make it bigger and better, more colourful and vibrant and this creating a sole film into a franchise. Ignore the critics they are too serious. Rio 2 brings newly improved crispy and fleshy visuals than the original. It's story is great which deals family matters and relationship, the music is funky and lively, the voice casts is well-talented but the only thing that doesn't work out much is the hit-or-miss gags. Overall, it still enjoyable to watch at.",
      "total_reactions": 0,
      "user": "toronto905"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2016
      },
      "score": 4,
      "text": "I seemed in my opinion, the most boring sequel to Blue Sky. It has excellent animation and a bellisimos funds, but the story is confused, the script is stupid, there are too many characters and songs and the amount of cliches I could not stand in the cinema. If you liked the first, this is not the sequel you are looking for.",
      "total_reactions": 0,
      "user": "CriticFer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "it is a good sequel almost a good as the original.I like the new chicks.And the ending is climactic along with the soccer sequence,Overall underrated as a sequel.",
      "total_reactions": 0,
      "user": "Jollyjoe1000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "This sequel is lacking the originality that the first one had. Although it seems a bit fun to watch and a bit interesting to think about, Rio 2 will at least pull out some moments in the movie and then end it with a score of mixed thoughts.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2016
      },
      "score": 4,
      "text": "I think the main reasons why Rio 2 finished at awfulness were because the new cast and the complicated chemistry had. As Ice Age, the second deliver comes with fewer jokes and a forced cast and animation. Generally it was appalling because it hadn't nothing to show, just 90 minutes of pure boredom and uselessness.",
      "total_reactions": 0,
      "user": "DavidTejada"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2016
      },
      "score": 10,
      "text": "It was not as good as the first one in my opinion, but overall it is still a great movie. It could have been better in a few areas, but it is still definitely worth the watch. Personally one of my favorite animated movies. I would definitely recommend it.",
      "total_reactions": 0,
      "user": "LolaL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2017
      },
      "score": 8,
      "text": "This is a really great film. Voice acting was good,story was also good,and animation was great.Due to mixed reviews from critics I have to lower the rank.I recommend that you watch this movie.",
      "total_reactions": 0,
      "user": "slated289"
    }
  ]
}