{
  "mc_avg_user_score": 7.3,
  "mc_metascore": 57,
  "mc_mixed_rating_frequency": 43,
  "mc_movie_name": "Rise of the Guardians",
  "mc_negative_rating_frequency": 16,
  "mc_positive_rating_frequency": 190,
  "mc_pro_critic_reviews": [
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2012
      },
      "score": 88,
      "summary": "The shaggy, whimsical characters have a primal familiarity, as though they were developed by a tag team of Maurice Sendak and Walt Disney."
    },
    {
      "critic": "Olly Richards",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2012
      },
      "score": 80,
      "summary": "It's gorgeously designed, deftly written and frequently laugh-out-loud funny. For child or adult, this is a fantasy to get lost in."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2012
      },
      "score": 80,
      "summary": "It's a grand, colorful adventure, an escapist romp draped in tinsel. And, who knows -- if you're all good little boys and girls this year, perhaps it will also be the first installment in a new DreamWorks holiday tradition."
    },
    {
      "critic": "James Rocchi",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2012
      },
      "score": 80,
      "summary": "One of the best kid's films of the year, full of delight and action and charm and comedy."
    },
    {
      "critic": "Jody Mitori",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "The Guardians make a winning team that is a prime candidate for a sequel, just like \"The Avengers.\""
    },
    {
      "critic": "Stephen Whitty",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "A satisfying holiday treat for adults and children alike."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "While Rise Of The Guardians boasts a great deal of visual energy and amounts to a lot of fun, it's mostly lacking in that kind of depth elsewhere."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "There's an audience for this film. It's not me. I gather younger children will like the breakneck action, the magical ability to fly and the young hero who has tired of only being a name. Their parents and older siblings may find the 89-minute running time quite long enough."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "Thoughts become things. That's the message of Rise of the Guardians, a charming if slightly dark and cobwebbed animated feature about how believing in something makes it real, or real enough."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "Rise of the Guardians is an all-star addition to holiday movies lists but the real question is: Which holiday?"
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "Rise of the Guardians is enjoyable as a stand-alone adventure - not groundbreaking animation but a solidly entertaining 90 minutes for older children and adults."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2012
      },
      "score": 70,
      "summary": "As much as its premise may sound like the start of a bad joke, Peter Ramsey's movie preserves just enough genuine childhood wonder in its whooshing, high-tech theatrics to make it a delight."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2012
      },
      "score": 70,
      "summary": "Works so hard at celebrating wide eyes and naïve joy that it comes close to spoiling its own intermittent wonderfulness."
    },
    {
      "critic": "Chris Packham",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2012
      },
      "score": 70,
      "summary": "At times, it approaches some of Pixar's best."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2012
      },
      "score": 67,
      "summary": "It's all more lightweight-likable than exciting."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2012
      },
      "score": 63,
      "summary": "This does seem to leave room for bigger, bolder, more momentous adventures down the line."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2012
      },
      "score": 63,
      "summary": "With its fanciful razzle-dazzle, Rise of the Guardians is appealing, if slightly hectic, family fare."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2012
      },
      "score": 63,
      "summary": "This spirited enough yarn is sincere and heartening in its belief that our devotion to these youthful myths is healthy for our sense of wonderment."
    },
    {
      "critic": "Josh Winning",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2012
      },
      "score": 60,
      "summary": "More \"oooh… aaah\" than \"ho-ho-ho\", ROTG is so full of yuletide razzmatazz that only true Scrooges will have trouble stomaching it. If only Santa's workshop had given the script more of a tinker..."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2012
      },
      "score": 60,
      "summary": "Rise of the Guardians is adapted from Joyce's book series The Guardians of Childhood. But the occasional Joycean touch aside, it bears so little resemblance to the look and feel of its source material that it ought to be considered an entirely different beast."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2012
      },
      "score": 60,
      "summary": "There is a lot to savor in Rise of the Guardians, but sometimes too much of a good thing can be exhausting."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2012
      },
      "score": 60,
      "summary": "It has a great voice cast, a kinda-sorta interesting premise and the 3-D is effective, but somehow it just doesn't add up."
    },
    {
      "critic": "Xan Brooks",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2012
      },
      "score": 60,
      "summary": "If Rise of the Guardians is finally never more than the sum of its parts, the parts themselves have real appeal."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2012
      },
      "score": 60,
      "summary": "The characters and settings are attractively designed, and the vocal performances have real color and a sense of fun that gently undercuts the treacly sincerity of certain obligatory kid-pandering moments."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2012
      },
      "score": 58,
      "summary": "Too much of this movie, directed by Peter Ramsey, is more clamorous than inspired, and little kids might find parts of it too scarily intense."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2012
      },
      "score": 50,
      "summary": "The movie lacks a resonant center. The script seems to have been written by committee, with members lobbying for each major character, and the action, set in vast environments all over the map, spreads itself so thin that a surfeit of motion vitiates emotion."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2012
      },
      "score": 50,
      "summary": "Like most children's movies, Rise of the Guardians mimics the patterns of adult entertainment. Where is the magic in that?"
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2012
      },
      "score": 50,
      "summary": "From time to time, as Alexandre Desplat's insistent score surged yet again while the characters rushed by, I found myself wanting the movie to slow down. Some of these images are too beautiful to disappear so quickly."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2012
      },
      "score": 50,
      "summary": "Innocence and joy are threatened by the Boogeyman, and from there the plot comes pretty close to mirroring this summer's \"The Avengers\" movie. Mostly in a good way."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2012
      },
      "score": 50,
      "summary": "Even tots may emerge feeling slightly browbeaten by this colorful, strenuous and hyperactive fantasy, which has moments of charm and beauty but often resembles an exploding toy factory rather than a work of honest enchantment."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2012
      },
      "score": 40,
      "summary": "Dour animated adventure that aspires to holiday joy, but is as enjoyable as a sock full of coal."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2012
      },
      "score": 40,
      "summary": "The voice work sounds more quick-paycheck than impassioned, and the animation rarely rises above video-game cut-scene quality. As revisionist holiday fables go, you're better off watching Aardman's delightful \"Arthur Christmas\" than this lump of coal."
    },
    {
      "critic": "Leah Churner",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2012
      },
      "score": 30,
      "summary": "Kids who can stomach mixed holiday fare should be able to ride out this stereoscopic superstorm of snowglobes, Easter eggs, magic portals, enchanted crystals, moon worship, fruitcakes, matryoshka dolls, and lost teeth. Others may be confused."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2012
      },
      "score": 12,
      "summary": "I can't remember ever seeing such a spectacular implosion of a squad of all-stars as Rise of the Guardians. Well, not since Yankee Stadium in October."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "Average kid movie. My daughter asked why the movie was like all the other movies she had seen, and she's only eight. The plot is tired, though the film was beautiful artistically. Also, a bit too much action. It seems that today, kids are being fed nonstop action in films. One note, though, my kids, after watching this film were convinced that Santa Claus wasn't real. They went in believing and came out doubting. Mostly like the tattooed Russian bully posing as Santa in the film, didn't jive with their more innocent view of him. Strange. This movie was basically a pass for us.",
      "total_reactions": 6,
      "user": "Oroiael"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "Much more aimed at the kids then I anticipated, Rise is a gorgeous looking piece of animation but ever so dull with it. There's not enough humour for my taste and despite the set-up its played very straight. I'm sure kids will love it but it doesnt have the wider appeal of something like Shrek or Tangled.",
      "total_reactions": 5,
      "user": "reddave2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2014
      },
      "score": 3,
      "text": "Without a doubt this movie tries to be more than what it is. Dreamworks hit a new low with this film, and it shows in their completely annoying and idiotic character Jack Frost. Also while I understand that this is a children's movies, some of the dialogue is incredibly cringeworthy and the jokes come up empty. The animations are decent, but the idea of listening to Chris Pine's effort in trying to portray a clueless teen boy, it's just not worth it.",
      "total_reactions": 4,
      "user": "Rem"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "My brother (older) was excited about seeing this; he was disappointed, and he loves 'Despicable Me 2' more than just about any other animation movie. The characters are annoying and the film, while artistically stunning, lacks an interesting plot. The pacing for me is for me just like the voice of HAL from '2001' is monotone. Plus, the action is completely unnecessary in an animated fantasy about something that adheres to young children, for the most part. A lot of things could have been taken out and a lot of things added that could make this movie more entertaining and thoughtful.",
      "total_reactions": 4,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "This movie was beautiful to look at.  The characters were striking and vibrant in appearance.  The writing was never very clever or insightful though.  I think I would have loved this movie if I was under the age of 10, but their was very little that would entertain adults as well as children.  Overall it wasn't unpleasant, but I wouldn't really recommend seeing it to anyone either.",
      "total_reactions": 12,
      "user": "joe_the_human"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "I have to start by saying that i am a big fan of Animated movies. This movie is just Hollywood trash. It has the same CGI, actions and stupid jokes as the typical Hollywood movies these days with no sense of story or screenplay. The movie is just boring. They try to make you feel amazed by throwing some graphics but it is just boring.",
      "total_reactions": 5,
      "user": "Merdocx"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "The Movie is so bad in parts that it is funny, HAS SOME AWESOME ACTION IN IT THOUGH AND HAS A DECENT STORY LINE, not worth paying money for just wait till its on TV or download it, Average at best and the film has one of the best quotes of all time, \"If u hear the moon talking to u, Listing to it\", So bad that it is good.",
      "total_reactions": 7,
      "user": "ReubenIsAGod"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "Rise of the Guardians has a lovely concept about these imaginary childhood legends. It tells a fascinating new mythology about them. It sets out to be highly imaginative and thoroughly heartfelt. With these people making this film, there is no surprise that they succeeded to execute those ambitions. Though, the storytelling is a bit messy with endless action set pieces. Despite of those flaws, it's still whimsically magical and heartwarming.",
      "total_reactions": 6,
      "user": "shirshasg"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "Visually, the animation is outstanding.  Dreamworks already proved they were among the best animators with \"How to Train Your Dragon\".  The 3D is also excellent.  Unfortunately, the story fell a little flat and predictable for me.  The moral of the movie, \"It's real if you only believe\", has been done many times in movies, and as recently as \"Polar Express\" a few years ago.  Polar Express was a better movie for me than this one.  Still, the outstanding visuals kept my interest the entire movie and I recommend it on that basis alone.",
      "total_reactions": 3,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "I expected this movie to get the same lazy story treatment that Gnomeo and Juliet had, but it turns out to be much more. Its sorta the kids version of The Avengers. It has the heart of \"The Polar Express\" but with action like \"The Incredibles\". Theres even a deeper meaning behind the movie. Its about dreaming and believing as a kid so that you can succeed as an adult as well. If you liked holiday classics such as \"The Polar Express\" or \"Arthur\", then I think you'll enjoy \"Rise of the Guardians\".",
      "total_reactions": 3,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "Rise of the Guardians is an animated film of 2012 directed by Peter Ramsey.",
      "total_reactions": 3,
      "user": "Mad_Hatter91"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "A Christmas movie where the Easter Bunny, Santa, Sandman, the Tooth fairy and Jack Frost form a souped-up action team who protect the children from Pitch Black (the Boogeyman). It's better than it sounds on paper with great animation and voice acting but the story is very predictable with the obligatory happy end. The target adience is kids between 7 to 15 so I guess we can forgive them",
      "total_reactions": 3,
      "user": "Apemonkey666"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "The movie is very good for kids and adults. The story is interesting and the graphics it's so cool.",
      "total_reactions": 3,
      "user": "CreanDeBourivan"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "A reasonably fun holiday flick that feels at times a bit disjointed and a bit lacking in depth.   Certainly we can connect with the themes, but the movie fails to draw us into the \"magic\".",
      "total_reactions": 8,
      "user": "santiagodraco"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "Rise of the Guardians has really great action scenes. Visually striking, very entertaining but it's not so good in storytelling. A sort of Avengers set in school set, intriguing.",
      "total_reactions": 5,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "While unlikely to win any awards its a good kids movie with a good message.  The voice acting was actually pretty well done especially by Chris Pine and Jude Law.  If your looking to take your kids to the movies you could do a lot worse.",
      "total_reactions": 5,
      "user": "nightblade00"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "It wars really fun to watch and this is the holiday movies that children need. I really like this animated movie. It was visually great and if you have time to watch it, then watch it.",
      "total_reactions": 5,
      "user": "RobyLula555"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "i love love love this film. The characters,the story line, everything. Definitely a top film. Although it is aimed at children, this is totally a full age friendly film.",
      "total_reactions": 12,
      "user": "blondie_mcgee"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "For sure one of the most original, most interesting & best holiday movies I've seen. The animation is very detailed & the use of 3D effect is completely worth the extra couple bucks to see it in 3D. The story itself is rather interesting, but well written & well told. This movie may be one your kids want you to see, and while it does look kinda childish, some adults will appreciate the originality & story for sure. This movie is one of those movies that also builds up a great storyline that keeps you interested & the ending while not really that expected, does perfectly fit with the rest of the story.",
      "total_reactions": 4,
      "user": "SaturnPhoenix"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "Rise of the Guardians is a movie that will take you to your childhood, not only because of the characters, but also because of the topic that treats, which is the searching of your own being. This last thing is represented by Jack Frost, who is trying to discover his purpose in life and what he has to do; all this presented as his center, that he must find out in order to help the children of the world. The others guardians already discovered their center, which are wonder of Santa Claus, hope of the Easter Bunny, dreams of Sandman and memories of the Tooth Fairy. With all this things the children can have a beautiful life and be protected from their fears, characterized by the Boogeyman. These characters are very well constructed, because every single one of them has his own personality, which includes ambitions and worries, highlighting Jack Frost, Santa and Pitch. The only failure of this film is that falls into the typical struggle between good and evil and at the end it becomes totally predictable.",
      "total_reactions": 4,
      "user": "NedRyerson1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "I thought that this was the best animated film of the year...and I've seen ALL of the others. It had some of the most spectacularly beautiful design I've seen in ages and it also one of the few movies that really should be seen in 3D. The voices and characterizations are both fun and intriguing. The plot is poignant and can be thoroughly enjoyed by both children and adults of all ages. I think it didn't do as well at the box office because so many people were distracted by all the shopping, but I think it will have legs and will do better in the coming weeks!",
      "total_reactions": 3,
      "user": "cayomagnetking"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "While there are certain things in the film could have been handled better the stuff that is good in this movie is unbeliavblely good. The world of the guardians and their powers make this film enjoyable to watch. This is a great movie for kids and even adults to a certain extent and make sure you watch it in 3D because it only adds to the experience.",
      "total_reactions": 1,
      "user": "Jacob"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "\"While its not going to earn \"classic\" status, it still on more than one occasion gets the job done. Its the Avengers for kids, it has action, laughs and a great story. It reminds us all the fun it was to be a kid again & to never forget what's important\"  B+",
      "total_reactions": 1,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "DreamWorks once again proves it knows how to make an excellent looking animated movie while still maintaining the clever writing that brings the laughs. Surprisingly enough this is not only a movie that your kids will enjoy, but you will as well. Once again DreamWorks assembles some big names to create another astounding voice cast. The writing is excellent providing an great plot and tons of humor. It manages to harness that childish energy that reminds us why these fictional characters are so loved, and how much fun and joy it brought to believe in them. Animated kid movies rarely get much better than this outside of Pixar, but DreamWorks proves that it has what it takes to stand along side them.",
      "total_reactions": 2,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "First off, I love animated films. I thought this movie was really good as it gave us an insight how the Guardians work, even if it was a bit cheesy at times! And I'm fourteen and I loved this film so that just goes to show it doesn't matter what age you are, animation is always good!",
      "total_reactions": 1,
      "user": "TheCritic1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "Enjoyable but derivative, Rise of the Guardians is a typical Dreamworks' animated fare that kids will like, but will not resonate as well as their other works. If you want a better treatment of this type of story, then look no further than Dreamworks' own Kung Fu Panda or How to Train a Dragon.",
      "total_reactions": 1,
      "user": "dharma"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "I wished I liked this movie more. Honestly, it was a mixed bag. On the upside, the animation and designs of the characters and settings were unbelievably creative (especially the Tooth Fairy). All of the different worlds were stunning, including the villain's lair. I also like how Santa Claus, the Easter Bunny, Tooth Fairy, and Sandman were re-imagined. My favorite character would have to be Russian Santa voiced by, get this, Alec Baldwin.",
      "total_reactions": 1,
      "user": "Zal"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "One of the most underrated animated films of all time. May not be as visually impressive as I hoped it would be but I fell in love with the characters, They are simply too awesome not to like. It's rare that I enjoy a film as much as I did this one, I actually broke out smiling during the end and didn't stop until it was over, It's a very cute film that I am sure kids and adults will enjoy. The only negative thing I can say about it is that the plot is a little shallow, Dialogue isn't as good as I hoped it would be. However, I enjoyed this film so much that I can overlook that. I would highly recommend due to the incredibly likeable characters and how much originality the film has.",
      "total_reactions": 1,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "The best thing in",
      "total_reactions": 2,
      "user": "AwesomeReviewer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "While not one of the best, Rise of the Guardians will surely entertain the young and the young at heart with its likable characters and its action-packed scenes.",
      "total_reactions": 1,
      "user": "JrAgujaIsAGleek"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "This movie. The scenery and characters are very interesting and fun to look at, the story is very well done from beginning to... Middle. Near the end of the movie, it gets very cheesy. I won't spoil anything, but the story could have been better. This movie is entertaining, but overall slightly overrated by the users. It's an entertaining movie, nothing more, nothing less. I'll give it a 6 out of 10.",
      "total_reactions": 1,
      "user": "ectobioligist"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "Rise Of The Guardians is a fractured 3-D fairy tale",
      "total_reactions": 1,
      "user": "dante_finn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "this movie makes me wish I was able to believe in magic again. with a cool set of characters (Russian Santa) with colorful character designs and personalities. the story itself is pretty generic but its execution breaths new life into the formula. Jack Frost is a very likable character that you ill feel for. And Pitch is a very likable villain too the way he talks and moves and tries to get jack to join him is fun. This is a movie suitable for children and it'll have parents liking it along with them. If you have siblings or just want to see it out of guilty pleasure i definitely recommend.",
      "total_reactions": 1,
      "user": "MultiverseJumpe"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "Rise of the Guardians brings together all the characters that made our childhood wonderful and they are not at all as we were imagining them. But behind the funny personalities lies the responsibility of protecting the children and this combination makes the movie a must-see. The only bad part I could see was the story. It is too simple considering the potential of the characters.",
      "total_reactions": 1,
      "user": "knorbi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "OK, so I saw the trailers and I really wanted to see this, and it was good, but I`t just didn`t have the magic to to meet my expectations. Rise of the Guardians has a good message and I give it points for that, but the movie overall was nothing amazing.",
      "total_reactions": 1,
      "user": "oblique15"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "It's certainly no \"How To Train Your Dragon\" but it's undoubtedly one of DreamWorks strongest animated films. With fun characters, a reasonably good plot and some great visuals that make perfect use of 3D. It's definitely worth checking out.",
      "total_reactions": 1,
      "user": "Big_Moose"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "Was having trouble caring at first, but I guess I was drawn in by the visuals which were stunning. By the end I was completely engaged with the story as well.",
      "total_reactions": 1,
      "user": "bigtech"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "I went into this movie thinking it would be okay and came out loving it. While premise may seem silly, worked surprisingly well and you fall in love with all the characters. Jack Frost especially, who you realize it a much more complex character than he appears to be. Movie also shows itself to be more than just fun when at a few moments it becomes rather dark, which in a kids movie was great to see as an adult watching. Overall, a very very enjoyable animated film which is original, gorgeously animated, and definitely pulls you in. Highly recommended!",
      "total_reactions": 2,
      "user": "Jayuna"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "A decent holiday movie. Interesting and unique story and view on classic characters. Just a shame the story  felt a little too underwhelming. Animation is superb, voice acting great. Chris Pine is perhaps a bit too average sounding for the role. I never in a million years would have spotted Alec Baldwin, he is funny and more or less steals the show as far as the voice talent is concerned. Pitch Black is an interesting take on the boogyman character, but also a bit too non-threatening. Comes accross a more like a creepy accountant than a main villain.",
      "total_reactions": 1,
      "user": "Rox22"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Rise of the Guardians is a fun and exciting animated movie that both kids and adults will love, but it also feels like it has a story that has been done many times before.  We all believed in these holiday figures when we were kids, I loved thinking about Santa Clause or the Easter Bunny coming into my home and leaving me presents and eggs, and that is part of the charm of this movie.  The writers know that kids and adults all loved these figures at one point in their life, and so making a movie where they all team up to protect us actually sounds like a lot of fun.  The movie has a lot of likable characters and has a lot of heart, so you can believe me when I say that this is a very good film.  But I also felt like this kind of story has been done many times before and that I could predict how this movie was going to play out.  I saw \"Wreck-It Ralph\" a few weeks ago and it was one of the most original animated movies I have seen in several years, and that is what made it a terrific film.  This story is a lot of fun, but I just wish that they had tried harder to make it more original for the adults.  But I must also remember that this is a children's movie, and the children are going to have a lot of fun here.  This is pretty much an animated version of \"The Avengers\" since both films involve heroes all teaming up to save the world. I really enjoyed this movie and I had a really fun time, and despite my small problem with the story, this is still a good movie that people of all ages will enjoy and have a fun time.",
      "total_reactions": 1,
      "user": "BreakingBrad"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "The animation in this film was spectacular. However, the plot was quite boring for me, and was extremely cliched. The same general plot has been used many times in the past, and it wasn't like this movie executed it any better. The pacing had many problems, and the villain wasn't all that intimidating. This movie would get a 7/10 from me, simply because of its awesome animation.",
      "total_reactions": 1,
      "user": "Deniedavi"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "Amazing film I really enjoyed watching it. It's great how it brings well known and love characters to life and creates the feeling that they all know each other. A good all round fun family film. I could watch it over and over again. This film also gives a very good visual idea of the characters and the places they come from.  This movie also encourage team work and belief in yourself. I would give it a 30000/100",
      "total_reactions": 2,
      "user": "Snuggelsblue"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "imagine the avengers who meeting the child's world and it gives \"rise of the guardians\"",
      "total_reactions": 1,
      "user": "killian13"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "\"Rise of the Guardians\" may have some issues with pacing, but it's a visual wonder, and will delight a child's eye. The art displayed in the film is beautiful, and you sometimes cannot help to feel magical with your favorite childhood heroes on the big screen once again.",
      "total_reactions": 2,
      "user": "jeff_reviews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "I was born in the early 90's so I got to grow up seeing a lot of those old claymation films about Santa Claus, Jack Frost, the Easter Bunny etc.. so this was really cool for me to be able to relive my childhood in a way that's new and actually interesting for someone my age. The character designs are great, personalities are fun, and animation is gorgeous. Another thing I love is the deeply meaningful story underlying the protagonist in a way that is fitting for young children, but only truly comprehensible and appreciated by the more mature audience, keeping teenagers and adults entertained along with the children.",
      "total_reactions": 1,
      "user": "calmb4thestorm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "A fun and exciting kids flick with a lot of heart and soul. The only thing that surprised me was the portrayal of children as quite flippant in their belief system.",
      "total_reactions": 1,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "So far this movie has many things I liked, I liked the animation and the idea of Holiday icons being transformed into protectors of children. But I know several people, including my English teacher finds that idea absurd, but... I didn't think it was absurd at all. The characters were pretty much people I could sympathize with in real life. They all have strengths and flaws that make them believable, including North(Santa Claus) who puts kids on 'Nice' and 'Naughty' lists(tattoos) and Pitch(the Boogeyman who always felt alone). I also admire that rival- brotherly relationship with Jack and Bunnymund, they were funny and likable wherever they went, the part where Bunny gets furious at Jack was also pretty sad, it shows that their relationship was not perfect.  I also liked how Tooth Fairy(the only female Guardian) wasn't treated as just a love-interest or a refrigerator victim(Sandman instead) throughout the movie, she can be aggressive if anyone messes with her friends and family. The fatherly/or grandfatherly bond between Jack and North was also pretty loving, since Jack hasn't lived with his family for many years, North also guides Jack to find his \"center\" in which it makes him a Guardian. The relationship I loved the most was between Jamie Bennett(Jack's first believer) and Jack Frost, they were both like real siblings ever since Jack followed him around ever since that sleigh ride. Jack Frost was my favorite out of all the characters since he may be a trickster, but is a kind, heroic person, especially to children.",
      "total_reactions": 2,
      "user": "Pacifistcritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "This movie has a great feel to it. The voicing is incredible and brings the whole film to life. The visual effects are out of this world, everything down to the lighting, the colour and detail is out of this world. I have never seen an animation as beautiful and awe-inspiring as this.",
      "total_reactions": 2,
      "user": "Gobbledygoock"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2014
      },
      "score": 7,
      "text": "With the art style of William Joyce, DreamWorks Animation, it reminds me of Disney's Meet the Robinsons, and Blue Sky's Robots for its unique designs. The story is okay not great, but it works I guess.",
      "total_reactions": 1,
      "user": "Delaforce828"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "Visually delicious with an original and very dark story. Both for adults and kids. Stunning animation. Highly recommended. I loved it. I love lamp. Blah blah blah",
      "total_reactions": 0,
      "user": "JLLoren"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "Rise of the Guardians is an animated film of 2012 directed by Peter Ramsey.",
      "total_reactions": 0,
      "user": "kyle20ellis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "Rise of the Guardians is holiday treatment. If I want to watch this again for the holidays, I would want to any moment from now so I can feel good for watching such a movie.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2016
      },
      "score": 5,
      "text": "A movie that requires attention and logic. Dreamworks, trying to make a creativity animated movie, finishes with a confusing signification of Christmas-heroes. It's confusing and with no direction. At least the good news are the action moments. The animation is not a highlight (exception of Sandmand) and it leaves in conclusion such as so so movie .-.",
      "total_reactions": 0,
      "user": "DavidTejada"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2016
      },
      "score": 10,
      "text": "blondie_mcgeeMar 19, 2013",
      "total_reactions": 0,
      "user": "TiberCromwell50"
    }
  ]
}