{
  "avg_user_score": 5.6,
  "metascore": 50,
  "mixed_rating_frequency": 2,
  "movie_name": "Road Hard",
  "negative_rating_frequency": 2,
  "positive_rating_frequency": 3,
  "pro_critic_reviews": [
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 75,
      "summary": "I found Road Hard to be a low-key gem, a consistently funny albeit conventional story about a guy who’s almost always the funniest person in the room, and is almost always his own worst enemy."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 70,
      "summary": "While most likely to appeal primarily to the comic's die-hard fans — and there are still plenty of them these days, thanks to his hugely popular podcast — Road Hard offers genuine laughs while displaying real heart along the way."
    },
    {
      "critic": "Brad Wheeler",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 63,
      "summary": "Road Hard is funny enough, and if its hum is predictable at times, its humanness is a welcome zinger."
    },
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 63,
      "summary": "Road Hard, partly funded through crowd-sourcing, is an enjoyable picture. It's sure to appeal to Man Show fans, though it withers when compared to another recent film about a has-been comic directed by its star, Chris Rock's remarkable Top Five."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2015
      },
      "score": 63,
      "summary": "A mildly unconventional love story drags Road Hard to a most conventional conclusion. But Carolla gets a lot of stuff about his career choice off his chest, sometimes hilariously, in this hits-too-close-to-home comedy."
    },
    {
      "critic": "Dennis Harvey",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "This feature directing debut for Adam Carolla and frequent writing/producing collaborator Kevin Hench is an amiable, nicely assembled semi-autobiographical fiction that will please the former’s fans."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "It's the movie's slow drift toward happiness, though, when Bruce meets a widow (Diane Farr) with a sweetly razzing sense of humor that spurs a more refreshing less patently abrasive comedy from Carolla."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "Though Carolla and co-filmmaker Kevin Hench devise some funny situations — particularly, the one in which a newly divorced woman insists on coming back to his room — the overall feeling that comes across is one of sadness, and that seems intentional."
    },
    {
      "critic": "Randy Cordova",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "Supporting turns by Philip Rosenthal and David Alan Grier as two pals in the business are fun, but they can't prevent the movie's rather aimless nature or self-indulgent feel."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "Mr. Carolla’s wide-ranging résumé includes writing, voice-over work, talk-show appearances and a popular podcast, but it’s light on acting, and he shows why here, proving himself unable to perform the difficult trick of making a loathsome character sympathetic."
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "Carolla's stilted screen presence and groan-worthy zingers neuter any humor from Bruce's needy quest to return to the spotlight."
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 37,
      "summary": "You can make a movie that’s both sweet and crass; just look at Judd Apatow’s comedies. But the mix doesn’t work here, maybe because both the vulgarity and the cheesiness are so amped up."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2015
      },
      "score": 0,
      "text": "To summarize in a word? Crap. Perhaps the funniest element that you can get some shred of entertainment from is laughing at how funny Adam Carolla thinks he is",
      "total_reactions": 1,
      "user": "Xogo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2015
      },
      "score": 9,
      "text": "Road Hard rings true. It tells a story that has all the lumps and laughs you've come to know and love and hate about life. Adam Carolla is not a natural born actor and it shows, but he tries and tries and gives it all he has to make it work... and it works. Carolla is a love him or hate him kind of personality. If you don't hate him, you'll love this movie. Otherwise, just change your dial.",
      "total_reactions": 0,
      "user": "psychomuse"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2015
      },
      "score": 3,
      "text": "As an Adam Carolla \"fan\", I enjoy listening to his ranting on podcasts, sometimes, the essence of which is completely missing from the film, Road Hard.  On his podcasts and classic Loveline, when at his most entertaining and interesting, Adam Carolla is spontaneous and unhinged.  In the film he is quite the opposite, coming across as rigid; a stiff actor, indeed.  But it is not only the Carolla performance, but the entire film emits a wooden aura.  The film may have benefitted from a looser, improvisational style exhibited in a show like Larry David's Curb Your Enthusiasm, because of Adam's very similar comedic style and acting ability (or lack thereof).",
      "total_reactions": 0,
      "user": "jeggem"
    }
  ]
}