{
  "mc_avg_user_score": 6.2,
  "mc_metascore": 53,
  "mc_mixed_rating_frequency": 103,
  "mc_movie_name": "Robin Hood",
  "mc_negative_rating_frequency": 54,
  "mc_positive_rating_frequency": 176,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "Big, loud, and dumb, but it is entertaining in its own darkly humorous way. For anyone looking for the chummy magic of the old Rovin Hood, you may want to look somewhere else, but for a very well handsome and thrilling action film, \"Robin Hood\" is fine entertainment.",
      "total_reactions": 1,
      "user": "nboley08"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "Felt a much longer than it should've; and no punchline. It tries to do too much and ends up playing like a pilot for 'Robin Hood' the TV series - in which, hopefully, all of the many characters will be developed. Interesting that Ridley would create a film that looks like 'Gladiator' but fails to hit all the Gladiator,Brave Heart, etc,  plot points i.e. : protaganist established as hero, family of hero is murdered by villain, hero is made outcast/outlaw  by villain, hero finds love/faith/need-for revenge, etc, etc. While most of those things happen in the film, they don't flow coherently, in fact it's all very disjointed; and too many villains. And the end I was left with a feeling that Ridley was going through the motions on this one.",
      "total_reactions": 6,
      "user": "Karl2000"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "Epic, but what's the point of it?",
      "total_reactions": 10,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2010
      },
      "score": 1,
      "text": "If it reinvents the legend at all, one has to wonder why the legend exists in the first place.  The story and characters are painfully boring.  You've already seen all this action before, and the elements it borrows were selected from the bottom of the barrel.  Watch Kevin Costner's again instead.",
      "total_reactions": 8,
      "user": "EthanPeter"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2010
      },
      "score": 3,
      "text": "\"This movie i was expecting more , It was morally disappointing i expected way more from the Genius's behind Gladiator , Its way to long , It drags on more than it should and in the end your leaving with a Headache .. i actuall fell asleep at one point\" .. D+",
      "total_reactions": 7,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "I was both shocked and excited when we found out that Robin Hood was going to be rated PG-13. From the previews it looked like a Robin Hood version of Gladiator because both were directed by Ridley Scott and the main star of both is Russel Crow.  It wasn't exactly what I was expecting. It's more of an origin story of Robin Hood, whereas the previews make it look like the typical robbing from the rich to give to the poor. There were so many good things about this movie. The score is spectacular. I already bought the soundtrack. The acting is fantastic. The action is phenomenal, and it's a really good story. It did get a lot of negative reviews from critics, but I think that was mostly because the story wasn't what they were expecting and it's not as gay and marry as previous versions of Robin Hood. It is fairly violent, but if you can take that then I highly recommend it. I saw it twice in the 1st 2 weeks, and now I own it on Blu-ray. This new Robin Hood movie is serious and dark and gritty and awesome. The following is a comparison of the different Robin Hood movies to the various Batman incarnations:",
      "total_reactions": 6,
      "user": "Garr"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "In the 13th century of England, following the death of King Richard in France, Robin Hood and his friends travel back to Nottingham to bring the sword to Walter. As he makes a love relationship with Maid Marian, Robin learns that a man named Godfrey killed his father and must navigate the politics of France in order to avenge his father's death.",
      "total_reactions": 2,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2010
      },
      "score": 0,
      "text": "This movie is plain torture. One of... if not the worst movie of 2010 so far. Russell Crowe is in basically every Ridley Scott, and I've disliked only 1 or possibly 2 movies that they've collaborated on. This movie is plain awful. I'd rather watch The Bounty Hunter 3 times straight than watch a portion of this movie worthy enough to be crapped on. Just garbage.",
      "total_reactions": 7,
      "user": "mrcritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "Albeit, not the greatest of Ridley Scott's works, this action drama certainly falls well above the majority of the genre.  The strong cast harmonizes to bring to life a clever, though somewhat cliche, portrayal of the beginnings of the Robin Hood legend.  Well worth the time spent watching, I thoroughly enjoyed this film and would recommend to anyone looking for a nice cockle-stirring evening.",
      "total_reactions": 5,
      "user": "CunningLinguist"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "The most definitive Robin Hood made to date. The original classic, around 1939, was accessible to all age groups (though oriented toward the youth group), and was very entertaining, but this modern version is an example of great movie making. Keep in mind that all that is known about Robin Hood is that he may have been a robber known to help out poor people, but no one knows for sure who he was. The elaborate details in a movie are completely contrived. So, this version is totally different from others, and this likely upsets some viewers. This version is superb in all departments, in epic proportions. It is obviously a part I, and I look forward to the sequel.",
      "total_reactions": 12,
      "user": "drarthurwells"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2010
      },
      "score": 5,
      "text": "The story was good, being different from the usual Robin Hood stories, but that's about the only positive aspect of this movie. The actors played average, the lines were far to simple, the action and fight scenes were unrealistic and uninteresting. I expected much more from this movie.",
      "total_reactions": 6,
      "user": "Razv"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2010
      },
      "score": 2,
      "text": "such a bad movie, i would have to say it is the director, cuz u know the cast is good. well i was relly disapointed and i definitly donÂ´t recomend it",
      "total_reactions": 2,
      "user": "mau1133"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2010
      },
      "score": 4,
      "text": "a prequel that just doesnt do much . doesnt feel as fun or as intresting as the old robin hood films we've seen . little in the way of any charicter devolpment not alot of action eather. the acting is good but not much about this film really does any thing . i felt like scott was making cate blanchet more like rippley from Aliens this tough take no crap bad ass which felt so off. i felt like this was just half a movie of the story of robin hood . the movie pretty much end when it starts gettin alittle intresting . id rather wach the old robin hood with erol flinn any day over this film . it was wachable and eh so so but from some one like ridley scott id hoped for much better then this.",
      "total_reactions": 1,
      "user": "ArkonBlade"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2010
      },
      "score": 5,
      "text": "Robin Hood is okay movie,but it wasn't as good as the other Robin Hood films that expect it. The only problem is that why does Russel Crowe has a short haircut,just like him in Gladiator that is just the same character? Why does the characters are so over the top being so serious,it doesn't seem as possible like other Robin Hood characters? The action scenes are pretty good,but the miss part is that the action scenes are way too violence,slow motion that i wasn't so cool,and has too much edge scenes like the other Ridley Scott films. Only the original Robin Hood from the 30's more better than this,so just stick it to the original. It's almost short like the other 90's Robin Hood with Kevin Costner. But this movie wasn't much too special for me.",
      "total_reactions": 5,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "What a let down. Russell Crowe just seems to get worse in every film he's in. He peaked in LA Confidential and Gladiator but since then its been all down hill. THis film was jsut another reminder of that.  The story line was mediocre, the acting, wooden and the dialogue, boring.",
      "total_reactions": 3,
      "user": "Pete2584"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "A great movie from beginning to end. I am guessing that the majority of people that didn't like it probably just didn't understand it, because it is deeper and more complex than previous goofy versions of robin hood.  Definably watch this movie, but really pay attention to it, otherwise you probably wont get it.",
      "total_reactions": 2,
      "user": "lilkillpappy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2010
      },
      "score": 5,
      "text": "I didn't really care for it, was quite a long movie and it just never seemed to peak, it was just kinda flat the whole way through. I was really expecting more.",
      "total_reactions": 1,
      "user": "LondonTruelove"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2010
      },
      "score": 1,
      "text": "And the barrage of bad movies for 2010 continues!  It starts great, then tries to add every element of the typical movie - love story, one-liner humor, etc.  And where did the stupid kids with masks come from?  Give me the good ol' Disney one with Sir Hiss any old day over this junk.",
      "total_reactions": 1,
      "user": "DarthCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Tied for best movie of 2010 for me with Inception.",
      "total_reactions": 1,
      "user": "Smills91"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2011
      },
      "score": 1,
      "text": "What a huge disappointment, Ridley is reminding me more of Ron Howard with every release, no imagination no flashes of originality which are vital to hold an audiences attention and maintain momentum over such a well known and much used storyline. Bought the blu-ray version which I just rented the DVD.  Tv movie anyone!!!!",
      "total_reactions": 1,
      "user": "Raywater"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 4,
      "text": "From what I saw in the trailers for this film, I was expecting a fast-paced action flick. Sadly, the movie is far from it.",
      "total_reactions": 1,
      "user": "The_MOW"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2011
      },
      "score": 0,
      "text": "this is the most boring film in history, it does not tell the real story of robin hood, i got sleep 4 times watching this in a cinema, terrible",
      "total_reactions": 1,
      "user": "carlos28200"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 5,
      "text": "Mediocre, tepid, clichéd, trite. Despite having some actors whose work I usually enjoy (William Hurt, Max von Sydow), the film is littered with historical inaccuracy to the point of ridiculousness, characterization is very poor to non-existent but has some nice cinematography. Above all, for what it is, it drags on far too long. Good to riff over in a MST3000K style though.",
      "total_reactions": 1,
      "user": "AlienSpaceBats"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 2,
      "text": "The idea of this film was good, BUT. a lot of actors just seem to be reprising their roles eg Russell Crowe playing his Gladiator role in a Robin Hood outfit. It takes a lot for a film to make me want to walk out of the cinema in disgust, I did not walk out, but by the time I got to the last 20minutes I was saying to myself \"please please just end\" there was hardly any plot line to fall in love with and it just seemed a VERY empty film.",
      "total_reactions": 1,
      "user": "TheBlackMist"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2012
      },
      "score": 0,
      "text": "Wrong in every way: a protracted, predictable and cliched story, a seriously clunky script, appalling acting by a cast that should know better. An utterly pointless waste of time.",
      "total_reactions": 1,
      "user": "EricMexler"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2012
      },
      "score": 3,
      "text": "Miscasted to oblivion, predictable, terrible dialogue, one dimensional performances, the worst soundtrack I have ever encountered, simply boring, not one redeeming quality except for two action sequences, one of which which were unnecessarily unrealistic and exaggerated, Ridley Scott did the best he could with his camera setups, but proves he put his cast after visuals once again.",
      "total_reactions": 1,
      "user": "RedAFX"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2012
      },
      "score": 0,
      "text": "I watched this film quite a while ago, and for the life of me, I can barely remember any scenes of it, all I can remember is that the actor did not make a convincing main character at all. That, and the fact that it dragged on so long that I was actually bored watching it.",
      "total_reactions": 1,
      "user": "Garian"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "Robin Hood is visually brilliant and professionally acted. Ridley Scott is an expert of his craft and I look forward to each of his films; however, I do have one issue with Robin Hood. It's a bore.",
      "total_reactions": 1,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "For the last 588 years, a legendary story has been passed from generation to generation about a man, a man who stole from the rich and gave to the poor wit not thought to his own actions. This man  is the most legendary of all folklore heroes in fact the most legendary of all heroes he is  the man who inspire  comic book  like Batman, The Spirit  and most notable of them all   The Green Arrow. This man is called Robin Hood   a fabled hero, a legendary archer who gave up his position in the high life to help the less fortunate. However, we do not know that for sure. Many people do believe that an archer who went by the name of Robin Hood did exist while others deny the fact that the man ever did exist and believed him to be nothing more than a folklore tale meant to scare the king's soldiers and the sheriff of Nottingham. Ridley Scott (director of Black Hawk Down, Gladiator, Kingdom of Heaven, Thelma and Louise and Blade Runner) takes the oft-told tale of one man and his band of merry men and how they took on the system, how they became legends. How they took the country of England by storm and made a lasting impression on the history books and time itself this film is the story of that man this film is the origin of \"Robin Hood.â",
      "total_reactions": 0,
      "user": "Lopez17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "I half-expected to hate this gritty and mostly serious \"Robin Hood - The Beginning\", but the 156 minutes of director's cut were very entertaining. A great cast was hampered by a somewhat formulaic script (and some silly musical interludes) but this latest Scott-Crowe joint was the best thing they did together since \"Gladiator\". Kate Winslet commands the screen in all her scenes (as usual), Mark Strong is a strong and terrifying arch-villain (as usual), Matthew MacFadyen and Oscar Isaac are deliciously funny and demented as Sheriff and Prince John and even Russell Crowe isn't annoying and gives an earnest performance. There isn't much swashbucklery and standing on boulders in tights going \"a-ha-ha-ha-ha\" Errol Flynn-style, but who knows, maybe they are saving that for \"Robin Hood, part deux - The Outlaw Years\".",
      "total_reactions": 0,
      "user": "KundK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "Well, it is a good film. Nothing special, nothing out of the ordinary, just plain good. And, well, the title is somewhat deceiving. It is not really about Robin Hood per se, it is more about how Robin Hood became who he was. So, having different expectations of the film might turn people down, but I thought that it was just a good adventure drama, with a rather good cast. Unfortunately, I felt that Russell Crowe was miscast and Cate Blanchett wasn't really on her usual level. I guess that comes from a thinly written character, but nevertheless, not very impressive.",
      "total_reactions": 0,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2010
      },
      "score": 6,
      "text": "A decent Robin Hood movie. Although it mostly serious, I enjoy the little parts of humor with his Merry Men. There wasn't as much action as I expected, and that was quite disappointing. The trailers made it seem like an film with multiple epic battle scenes, but there wasn't fighting at all considering how much there could have been.",
      "total_reactions": 0,
      "user": "dijavantewow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "While not quite as good as \"Gladiator,\" this movie still felt very reminiscent to the classic from the year 2000. Great action scenes and a fun ride overall.",
      "total_reactions": 0,
      "user": "gm101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "I went in expecting little, and was easily entertained to the best Robin Hood to date.  Don't be fooled by the critic's reviews, this is a well thought out and enjoyable historical epic.  At times it can be a bit contrived, but overall the plot, characters, and especially theme ring true.  It is an origin story and a re imagining of Robin Hood.  One that he deserves.",
      "total_reactions": 0,
      "user": "Mattchew"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2010
      },
      "score": 6,
      "text": "The action sequences did not stun, the story was not very entertaining and overall, it really wasn't that impressive. Only when Cate Blanchett's character is introduced does this film take off, slightly, and the comedic chemistry between her Marion, and Robin Hood, make this film enjoyable. Definitely one of Ridly Scott's weaker films, but even that doesn't mean that it's a dud.",
      "total_reactions": 0,
      "user": "Judddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "This movie acts as a way to tell you how Robin Hood became Robin Hood, it has great action scenes, interesting plot, some humor, and surprisingly likable characters, this is one I would recommend seeing.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "Robin Hood is a fine origins story from Ridley Scott. The film is eminently watchable from start to finish and feels both epic and slight at the same time. Is it as good as the the old Kevin Costner 'Prince of Thieves' movie, though? Not a chance!",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "A new breed of Robin Hood from The Father of ALIEN (1979), Ridley Scott. Robin Hood as we knew before was decorous outlaw and great archer with tight pants, to rob the rich and gave it to the poor. I know Scott wants his version of Robin Hood to be different. He was described with different haircut and beard. In fact, Russell Crowe performed the character precisely with his previous character in GLADIATOR (2000), only different in outfit (pay attention on his attitude and body language). Cate Blanchett as Marion was not in bad performance. Blanchett, I monitored always gave extraordinary performances in almost all her films. I think for her to involve in thiz epic was a waste of talent. The famous eternal-villain of Robin Hood (as we knew), Sherrif of Nottingham (Matthew MacFayden) was not in focus by limiting his proportion on thiz film. In his stead was two-face traitor named Godfrey played by Mark Strong. In my opinion, he played the best performance in overall, along with William Hurt as King John chancellor. Mark Strong had been built a great villain image during these couple of years, a fine Gary Oldman substitute who also best known as convincing villain. The movie actually attached with unique and tremendous score. The final battle on thiz movie, I described it as Omaha Beach Attack in medieval version. It is like what we saw on opening battle in SAVING PRIVATE RYAN (1998), only with arrows and swords. The last four movies directed by Scott brought Crowe as his main character (include thiz one). It is also the fifth since their successful collaboration in GLADIATOR. Crowe never shows a lame performance. But once again thiz is really a copy-paste from Scott GLADIATOR, same Crowe acting, it is also about a warrior comes home after patriotic battle and a rebellion toward greed king and same conflicts too. Last time we saw Kevin Costner ROBIN HOOD: PRINCE OF THIEVES (1991), we brought home some memorable moments and its soundtrack still echoes until now. If public can accept thiz movie as a fair and fine movie, do not blame them (Scott and Crowe) if they back again to offer you another typical ones with same Scott directing and same Crowe acting either, maybe other time with their version of Batman or James bond or whatever. Should we let them do it easily?",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "I was pretty happy with this movie. It was well paced and written. Needs part II to finish. I've seen five diffrent tellings of the story and this was my favorite. Ridley Scott has a excellent record.",
      "total_reactions": 0,
      "user": "lowkey42o"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "If the plot described above sounds nothing like any Robin Hood film or TV show you have seen before you would be right. This is Ridley Scott's story behind the legend. It's certainly a fresh take on the well known character and I think Scott should be applauded for not repeating the same story of Robin Hood and his band of merry men running amok in Sherwood forest. The true story of Robin Hood is shrouded in doubt and conflicting myths but I think that Brian Helgeland's (L.A. Confidential) screenplay probably stretches historical accuracy to the maximum you may expect of an American-produced film of a British myth.",
      "total_reactions": 0,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "A Adaptação de Ridley Scott de um dos heróis mais interessante da história  fraca, sem rumo e desgastante, não vale muito a pena ver  uma droga enorme...",
      "total_reactions": 0,
      "user": "Iky009"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "It was good, but completely disappointing for Robin Hood! This just leaves me asking, are they going to make a sequel? If not why even bother making this? It can work as Robin Hood Origin but needs a sequel.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "It's decidedly overlong and often boring, but thanks to some memorable performances it is pretty delightful.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "How is movie anything under I wasn't expecting anything at of this movie I thought it was a Robin Hood movie using russel crows name and I was wrong I loved this movie it felt like a instint classic and I want more all the character in this movie where likable this movie is so under scored in my opinion this will be one of my most favorite movies",
      "total_reactions": 0,
      "user": "MrThehammer171"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "As bland as can be.  I really can't say too much about Robin Hood, it's just nothing.",
      "total_reactions": 0,
      "user": "mikeonkok"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "it's such a wonderful heart-touching story that i can't take my eyes off. This movie is undoubtedly superb, extraordinary thanks to the talented cast and the decent plot by legendary director Sir Thomas Ridley Scott. This film, you mustn't miss",
      "total_reactions": 0,
      "user": "PvtJackson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2016
      },
      "score": 6,
      "text": "In many ways it's a good film, quite fun at times. It certainly looks gorgeous. But in the end there's just too much dragging it down to be anything but mediocre. For one thing, what does this really have to do with Robin Hood? If anything, it just seems like a ten episode historical drama series that got cut down to two hours, and someone inserted Robin Hood in it for some reason. It's drowning in a sea of characters, none of whom get enough screen time to be fleshed out, or even give one the ability to tell them apart. Plus the historical illiteracy, and the obligatory Christianity is evil narrative, and you have a film that will be enjoyed once and then never seen again.",
      "total_reactions": 0,
      "user": "AliceofX"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "A quite interesting version of Robin Hood's legend. It's quite different from the original in a good way,because it didn't become boring and I didn't feel like I am watching the same story again, while they didn't destroy the story either. There is a lot of fighting and action going on and I especially loved that they involved a female character in the battle, it didn't seem like she was useless like in most films.",
      "total_reactions": 0,
      "user": "FilmQueen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2016
      },
      "score": 5,
      "text": "Robin Hood is my first time I went \"What was that?\" in front of a movie. Just watch the original adventures of Robin Hood as that's more adventurous than this movie and Ridley Scott made an adventurous movie look dull and disappointing.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2016
      },
      "score": 9,
      "text": "I've watched a lot of Robin Hoods in my lifetime and buddy let me tell you this is the best yet..Awesome scenery, acting, directing.",
      "total_reactions": 0,
      "user": "choomtabi31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "Ridley Scott’s grimly revisionist take on England’s most famous outlaw. Impressively made and serious-minded to a fault, this physically imposing picture brings abundant political-historical dimensions to its epic canvas, yet often seems devoted to stifling whatever pleasure audiences may have derived from the popular legend.",
      "total_reactions": 0,
      "user": "FilmClub"
    }
  ]
}