{
  "mc_avg_user_score": 5.9,
  "mc_metascore": 47,
  "mc_mixed_rating_frequency": 53,
  "mc_movie_name": "Rock of Ages",
  "mc_negative_rating_frequency": 39,
  "mc_positive_rating_frequency": 79,
  "mc_pro_critic_reviews": [
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "Doesn't require anyone to love metal, or even like it. It only requires us to laugh at it - and other exemplars of bloated '80s pop, from Starship to Journey - and it does so with a campy and attitudinous spirit that's hard to resist."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "As a means of non-participatory time travel and non-intellectual stimulation, it's successful. Toe-tapping and eye-rolling are equally forgivable. Rock on."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "The hugely enjoyable Rock of Ages is saved by its music, a tasty brew drawn from Def Leppard, Journey, Foreigner, Bon Jovi, REO Speedwagon, Pat Benatar, Twisted Sister, Poison and Whitesnake. It's near impossible not to rock along."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "The only problem is that the plot meanders when nobody is singing. If you're making the kind of movie where everybody in the audience knows for sure what's going to happen, it's best not to linger on the recycled bits."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 70,
      "summary": "Blessed with unstoppable energy, an undeniably bawdy sense of fun and Tom Cruise in backless leather pants, it takes songs you may never have loved and turns them into a musical that's easy to enjoy."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 70,
      "summary": "Seeing Tom Cruise swathed in leather pants and fake tattoos, as Axl Rose-style metal god Stacee Jaxx, is supposedly Rock of Ages' big draw. But the movie is much more fun when he's not around."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 70,
      "summary": "The thing runs more than two hours, but this is the sort of project that's indemnified against charges of excess."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 70,
      "summary": "Rock of Ages is an effulgent celebration of fakeness. It isn't trying to be real; it's trying to be faker than any fake thing has ever been before."
    },
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 70,
      "summary": "Blending a perfect brew of classic '80s songs, big laughs and rockin' performances, director Adam Shankman manages to make this film adaptation of the hit Broadway jukebox musical a red hot summer blast for people who grew up with glam metal - or just can't escape it on the radio."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 67,
      "summary": "Rock of Ages is nothing but a good time and sometimes less, slogging through the knee-deep hoopla of 1980s nostalgia at a jukebox pace."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 63,
      "summary": "A jukebox musical that's astonishingly cornball one minute, winkingly sardonic the next."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 63,
      "summary": "When Rock of Ages remembers it's supposed to be a cartoon, it's a noisy, sweaty, giddy ball of fun. When it suddenly develops a conscience or tries to process a thought deeper than \"I love rock 'n' roll,\" it trips over its own feet."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 63,
      "summary": "The movie has its cheesy pleasures, and some of them are even intended. I'm just not sure whether Tom Cruise's impersonation of Axl Rose is one of them."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 60,
      "summary": "Once you accept the utter and profound inconsequentiality of Rock of Ages, there's much to enjoy in it, from Zeta-Jones' capable hoofing (as a dramatic actress I find her deadeningly dull, but the woman can dance) to Giamatti's sly performance as a calculating, gray-ponytailed rock impresario."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 60,
      "summary": "Rock of Ages is an experience that will alternately leave you embarrassed and amused."
    },
    {
      "critic": "Olly Richards",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 60,
      "summary": "Like every one of its songs, it makes a lot of noise about nothing much and cockily straddles awfulness and greatness. It's enormously entertaining nonsense."
    },
    {
      "critic": "Jane Crowther",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 60,
      "summary": "Disposable, overly long fun best enjoyed with BFFs and a bevvie."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2012
      },
      "score": 60,
      "summary": "Fans of Moulin Rouge–esque repurposing will be in hog heaven. Everyone else will want to hop that midnight train going anywhere pronto."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 50,
      "summary": "Where this PG-rated adaptation of a hit Broadway show, adapted by Adam Shankman falls down is by being far too mild for its supposedly outrageous subject."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 50,
      "summary": "It looks like Disneyland and sounds, well, like a bad Broadway musical, with all the power belting and jazz-hand choreography that implies."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 50,
      "summary": "The only edge in the movie is represented by Russell Brand, who actually lived the lifestyle, but he's muzzled by a bad Liverpool accent and a gay subplot that's as insincere as the swaggering anthems by fatuous hacks like Foreigner, Starship and Journey."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 50,
      "summary": "Warning: If you have an allergic reaction to songs like \"Take Me Home Tonight\" and \"I Want to Know What Love Is,\" do not venture within 10 miles of this movie."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 50,
      "summary": "The movie, full of talented performers in search of a more propulsive vehicle, settles for workmanlike cover-band status, which makes this a cover-band tribute to a jukebox musical - a long way from true, trashy exhilaration."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 50,
      "summary": "Most of the numbers in Rock of Ages are flatly shot and choreographed, and they look as if they'd been edited together with a meat cleaver. With rare exceptions, they don't channel the excitement of the music - they stultify it."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 50,
      "summary": "Shankman gets enormously entertaining performances from Tom Cruise and Alec Baldwin, so much so that it's a problem: The movie's not about them."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2012
      },
      "score": 50,
      "summary": "Absent the infectious live-audience energy of Chris D'Arienzo's legit hit, this affectionate glam-rock-a-thon reps a visually bland staging of frankly insipid material, never tapping into the raucous, go-for-broke energy that would spin the show's cliches into gold, let alone platinum."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2012
      },
      "score": 40,
      "summary": "Unfortunately, like the Poison song says -- and, in many ways, like the decade itself -- it ain't nothin' but a good time."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 40,
      "summary": "What's not fine is the dead zone occupied by the monster of the piece, Tom Cruise's veteran rocker, Stacee Jaxx."
    },
    {
      "critic": "David Rooney",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2012
      },
      "score": 40,
      "summary": "He (Shankman) succeeds in draining most of the fun from a vehicle that was all about the winking humor of its flagrant cheesiness."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2012
      },
      "score": 38,
      "summary": "Shankman's staging of the numbers - especially the leaden choreography and hackneyed locations such as the Hollywood sign - was far sloppier and less creative than for his last musical, the vastly superior \"Hairspray.\""
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 38,
      "summary": "Don't stop believing. Just avoid clichéd musicals that try to capture the anarchic spirit of rock with trite commercial re-treads."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 38,
      "summary": "Rock of Ages gets too mired in plotty cul de sacs, manufactured setbacks and numbers that are all staged as show-stoppers. In the words of the Journey song that serves as a climactic singalong, it goes on and on and on and on."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 33,
      "summary": "This glossy musical, from \"Hairspray\" director Adam Shankman, is a shameless crowd-pleaser where cardboard characters use the most overplayed and ubiquitous hits of the 1980s to express the aching banality of their souls."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2012
      },
      "score": 30,
      "summary": "Rock of Ages withholds nothing and makes miracles seem cheap."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 30,
      "summary": "Though it has moments where it rises to fun-awful status, with a hideous giddiness that turns moviegoers into rubbernecking motorists at a crash site, it's mostly just awful."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 30,
      "summary": "Creating plot from lyrics, in this case, leads to heavy-handed literalism and limited creativity. The wall of music is amusing for a while, but grows into a loud, wearying assault long before the movie's two hours are up."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2012
      },
      "score": 30,
      "summary": "A cinematic event. It's not every day, after all, that you get to see two great American traditions - guitar/bass/drums rock music and Tin Pan Alley musical theater - so thoroughly, mutually degraded."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 25,
      "summary": "Oddly tone deaf."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 20,
      "summary": "Doubtless, like The Producers, it will be adapted back into the theatre, some time in 2017, at which time it will be even more bland and tiring."
    },
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 12,
      "summary": "If the Adam Shankman film's debasement of its subject into campy kitsch is the unavoidable fate of all culturally dangerous art, that doesn't make it any less palatable."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "summary": "I haven't seen a movie this bad since \"Battlefield Earth\" and \"Howard the Duck.\""
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "I was thoroughly looking forward to this after seeing ROA live on the Toronto stage. The movie is a major disappointment. Aaron Walpole was hilarious as Lonny on stage and Russell Brand was just plain flat here. Julia Hough was lovely to look at as Sheri but her version of sexy was \"Gleeful\" and she can't rock. The killer however was the general treatment of the music. 80s hairband music has to be raw and rocking. What the heck were they thinking by smoothing out all of the edges and autotuning all the voices? This movie production made me 'Stop Believing\".",
      "total_reactions": 2,
      "user": "fredinwhiterock"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "Let me start off by saying this is a musical. Don't expect a classic. If it's not your type of thing, this movie won't change that. Now that we got that out of the way I have to say that I actually liked it. It's starts off okay unfortunately. I'm not a big fan of people just singing a song  and every random person joins them. I know you're going to tell me that pretty much every musical do that, but no. The good ones have a certain thing that connects the people, what they want to say and the songs. Not randomly start singing just to sing. That said, it gradually gets better and to the point of me smiling when a song started. Tom Cruise is amazing on stage. I really believed he was a rockstar when he sang. His stage presence is amazing. If you're hoping to see the same rock of ages from Broadway to the screen, you are going to be disappointed. The story is different, and there are a few songs that weren't in the broadway musical. For the story, well it doesn't do anything new. You can pretty much tell what's going to happen, two young people with big dreams meet and fall in love  and you can guess the rest. But don't let that get in the way if you like musicals. I had a great time watching it in theaters. I give it a 7.5 because I still had a pretty good time. I don't regret watching it. It's not a classic by any means, but it is nonetheless entertaining and worth your time.",
      "total_reactions": 2,
      "user": "RenaissanceTM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "Rock of Ages. Even though I like all kinds of movies, Musicals aren't always my kind of thing. The only two I can actually think of at the moment that I liked and enjoyed was \"The Newsies\" and \"The Sound of Music.\" However, I became overly excited to discover that Tom Cruise played a rock star and actually sings in this 80's rock n' roll musical. (Big Tom Cruise fan in case you didn't already know.) The movie looked pretty good anyways - so I was more then down. A highly entertaining, feel good, 80's rock n' roll musical, with a fantastic cast and performances (both acting and singing) make \"Rock of Ages\" nothin' but a good time. The way I see it - Tom Cruise was a rock star long before this highlight in his career, but hearing him sing like a rock star only makes him more worthy of the title. And yeah, Cruise can sing, and he's damn good at it. All hail Tom Cruise the rock star!!!",
      "total_reactions": 1,
      "user": "xXRenTyrellXx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "While \"Rock of Ages\" is fresh in my mind from the 4:20 pm showing today at the Laemmle Claremont 5 at the Claremont Village (CA),  I walked out with mixed feelings on a number of levels.  First, let me state that the music was great and on key - true to the original renditions such as Stacee Jaxx (Tom Cruise)  hitting the right octaves with",
      "total_reactions": 1,
      "user": "gilpac"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2012
      },
      "score": 4,
      "text": "Good music, but the movie is very bad.",
      "total_reactions": 1,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "All I can say is that it was alright but not the best movie I have ever seen.  My friends dragged me along to see it and all I like was the remakes of brilliant rock songs which I like that is all I liked about Rock of Ages",
      "total_reactions": 1,
      "user": "Paulyd90"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "Just came from seeing Rock of Ages with Tom Cruise, Alec Baldwin, Russell Brand and many more. I have not seen the Broadway version, so I can't compare the movie to that, but I gotta say it was a HOOT. The music is rock and roll and largely from the 80s. I think that folks who are/have been into rock & roll and are between 40 and 65 now will get the biggest kick out of it. Not to say that folks younger and older than that won't, but I think that age range is the target audience.",
      "total_reactions": 5,
      "user": "SheriReho"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "I wasn't really sure what to expect from Rock Of Ages.  Being that I don't like musicals with the exception of Grease.  So what do I think of the soundtrack?  Was it what I expected?  No.  It was way better than I expected.  Not sure who actually sang and who lip-sync, but all the songs sounded amazing.  I caught myself jamming, tapping my foot, and at times rocking my head back and forth.",
      "total_reactions": 4,
      "user": "angelh55"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2012
      },
      "score": 2,
      "text": "If I ever get diagnosed with a life threatening disease, I plan to watch this again because it felt like a lifetime had passed from beginning to end.  I was well into this era and scene when it happened.  And I do love a good musical.  That being said, other than some good moments from Cruise who usually bores me, this movie is a snooze fest.  My kids took me for fathers day.  I was looking forward to it.  By about half way through I though the entire year of 1987 had taken place and we were all a little bit older.  This movie is just flat out awful.  A bore.  And I know it's supposed to be cheesy.  That was the ere and i get that.  But this was crap.  And my kids hated it too.  So you have 2 separate generations of viewers that had 2 LOOOOOOONG hours stolen from them.  Save yourself.",
      "total_reactions": 12,
      "user": "LeahAndNic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "I would give this movie a 6 only because of the fact that the plot is very slow and runs on thin ice the entire time, but Julianne Hough who is beautiful does a pretty good job, and Tom Cruise who has a good rock voice surprisingly made this enjoyable. I knew all the songs and was singing along to about most of them. I hated it but I loved it. Go see it in theaters.",
      "total_reactions": 3,
      "user": "a7xfan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "I have to agree completely with SheriReho's review. I also thought this would make an awesome Rocky Horror style repeat viewing movie.  Have a couple drinks, loosen up, wear some of your worst 80's apparel, and have a blast singing along.  No one will win an Oscar for this, but it AIN'T NOTHIN' BUT A GOOD TIME and I think that was the producers' intent.  Cruise, Baldwin, Blige, et al totally camped it up, and you could almost feel they had a kick making this. My biggest surprise was Russell Brand.  Normally I can't stand to watch him in a commercial, but he and Baldwin were the biggest scene stealers together. Yes, I'm in my 40's and grew up in that era, so the familiarity was wonderful. No, I don't think this is an E.T. type film that EVERYONE will love.  But how many musicals can you go see that you know almost all the words to all the songs before you see it? I loved that. (look for the cameos of some real-life 80's charttoppers too.) I am so glad I ignored the critics' reviews that said this was terrible. (Ebert gave like 4 stars to Prometheus, my daughter and her boyfriend saw it, and both thought it was boooring!)  So if you think you might like this type movie, a musical comedy based on 80's era rock songs, go ahead and see it.  If you're more into Kubrick, Coppola, or Tarantino, you may not want to bother. It's all a matter of taste, but to me, most of it was delicious.",
      "total_reactions": 3,
      "user": "silversprings63"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "This movie made me smile, loved all the 80's music took me back to high school!  Laughed at some of the cornines which I am sure was intended. This was great, it was supposed to be over dramatized which the 80's were actually that.  Loved Tom Cruise as Stacey Jaxx he did a great job of portraying what most of the bands and lead singers must have really been a lot like after all the intense partying!  LOL.  One critic actually said he was bored.  Idiot he really didn't get the movie then and took it way to serious.  Go see it, don't expect Gone With the Wind, have some laughs enjoy the over-dramatized era and characters, take a walk down memory lane if you lived it, if you didn't don't go see it you won't get it!",
      "total_reactions": 3,
      "user": "Storm2850"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "Wow, a new sorprise this year. I remember that when I watch the trailers of Rock of Ages I say: \"I wanna watch this movie\", but when the critics appear I say: \"oh no\", after I decide watch the movie, and the ressult: Other great musical, have much incredible songs, the performances are cool, the character amazing. I think that Rock of Ages is the Footloose of this year.",
      "total_reactions": 7,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "First off, this movie can not be fairly rated. Let me explain why. If the critics were a group of people over 55 years old and under 30, they wont even get it. If you are viewers and over 55 and under 30, you wont get it either. You had to live the era. I'm 47 give or take a year. I lived it and give it a strong 8. If it would have been all original bands and singers it would be an 11, off the chart. I will admit you feel like a goof ball almost halfway through the movie for even still being there then, BAMB, it hit key points of my life and what that time period meant to me. There were only about 17 people at the midnite showing. 5 of them were dancing in the isles and happy even when the movie was over. Most all 17 people stayed even through the credits just to listen to the songs as the played out. As everyone left I found my self sitting there with a tear in my eye for my own personal reasons. Yeah it was made cheesy, that is how it was meant to be you bu** hole critics. You will love it or hate it. Depends on your life experiences. I guarantee your jaw will drop a few times and you will just have to see it to believe me. Viewers even clapped at the end of the movie which I haven't heard in awhile. If you are in your teens I even think you will like it. 55 and over dont vote so this movie can at least get a fair review. Your vote shouldn't count. To the rest of us, ROCK ON ! ! IT WILL NEVER DIE FOR US JUST LIKE OUR PARENTS MUSIC THEY LISTENED TO WILL NEVER DIE. Don't prejudge this movie",
      "total_reactions": 18,
      "user": "bigfoot6463"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2012
      },
      "score": 5,
      "text": "It's hard to figure out what type of film they were trying to make here, but for those looking for a quick 411 on what to expect here's the bottom line: For the 21 and under crowd who enjoy such films as High School Musical and Hannah Montana - this might be right up your alley. For the over 21 crowd- if you're looking for a musical to see with your BFF, or GBF, or both and don't mind musicals geared more towards talented singing and less about story and plot then this will also fit the bill.",
      "total_reactions": 7,
      "user": "zendoa"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2012
      },
      "score": 5,
      "text": "The biggest surprise: this movie is funny (intentionally). Sure, there's a trite love story, but the supporting cast provides quite a few laughs. What takes up most of the time is a string of anthem rock classics sung by every member of the cast. Some are fun and successful (the best gay love song ever), but many are downright embarrassing. Tom Cruise, as the metal god, is sometimes swaggering cool, sometimes funny. Adam Shankman's direction/choreography is occasionally dazzling. Overall, this non-stop barrage of rock music videos succeeds on some levels and is simply silly on others.",
      "total_reactions": 3,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "Wake up, people!  Rock of Ages ROCKS!  I have never seen a musical more entertaining in my entire life!  Russell Brand, Alec Baldwin, Catherine Zeta-Jones, Diego Boneta and Julianne Hough all deserve credit for their work!  Thank you Lord!",
      "total_reactions": 3,
      "user": "kristofferson"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "This was by far the worst movie I have ever seen. I did not find the extremely blatant sex scenes (way past the point of suggestive) every 5-10 minutes, nor the excessive drinking, at all cool or entertaining.The whole group I went with was disgusted. Knowing that 13 year olds could see this movie is absolutely horrific...it warrants at least an R rating. The beyond low quality of the film leaves me quite disappointed in all of the big name actors & actresses involved. If you are expecting or hoping for a love story entertwined with the rock & roll artists of the 80s, know that this movie offers little more than scantily clad men & women, lack of clever lines, and a complete waste of time. Rock of Ages had lots of potential, but failed in all aspects. So glad there is a rating option of 0, it deserves nothing more. So seedy.",
      "total_reactions": 3,
      "user": "shoreshell"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "I love musicals, stage or movies. I",
      "total_reactions": 3,
      "user": "Kyle_Reese"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2012
      },
      "score": 1,
      "text": "This movie is a friggin' mess... really bad direction and awful choices throughout. The only performance that comes out good is Mary J the rest range from dull (Hough) to bad (Brand) to downright embarrassing (Cruise). I like Tom Cruise, and while I can respect his commitment here to the work he was clearly being ill served by the director. This is a very BAD movie. On top of the bad direction and \"High School Musical\" storyline you have some of the best rock anthems ever ruined by dreadful Pop arrangements - it's like \"Camp Rock\" meets Aerosmith. Stay home and listen the to originals cause there is nothing original in this entire film. BIG disappointment here, I was really looking forward to this.",
      "total_reactions": 5,
      "user": "actor2go"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2012
      },
      "score": 0,
      "text": "the worst film to come out this year, and possibly the past 10 years. Really long, and extremely boring. wanted to kill myself. someone should be sacrificed to make up for how incredibly horrible this pile **** is. Run as far away from this film as you possibly can, and if you see a dvd please light it on fire, and then take a dump on it.",
      "total_reactions": 3,
      "user": "lilkillpappy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2012
      },
      "score": 4,
      "text": "So this certainly wasn't a perfect film. Do not go in with high expectations unless you are specifically looking for a cheesy love story musical with bad acting and lackluster directing. Their were so many flaws with this film, acting being a big one, but it was just filled with awkward and cheesy moments. Some of the singing was just uncalled for, some of the actors just burst into song at random awkward moments. The positives of the film? Tom Cruise was awesome, great soundtrack, and some decent comedy but thats about it. I was very disappointed with this movie considering i went in expecting a hilarious musical with a great cast but it didn't work out so well. I would not recomend this film to anyone. 3.5/10",
      "total_reactions": 1,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2012
      },
      "score": 3,
      "text": "Tom Cruise tries valiantly, bringing all his",
      "total_reactions": 4,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "Sadly This Movie Is Less Than Perfect The Covers Are Ok This Will Be The Most Overated Movie Of The Year! I Am This Close To Giving This Movie A 5...'",
      "total_reactions": 2,
      "user": "GagaForGhibli"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2012
      },
      "score": 3,
      "text": "I give Rock of Ages a 3 because Tom Cruise was only in it about 30%. His portrayal of Stacy Jaxx, an aging Rock God, was the only entertainment to be had. As for the rest of the cast, they could have been replaced with more baboons like Hey Man, Cruise's side-kick who had better comic timing then them all. Our main characters, two glee high school drop outs, give as many  dispassionate rendition of hacked up hair-band songs as the script-writers can smash into their cliched scenes. They are shiny and pretty while spouting line after line of drivel trying desperately for us to like them, but in the end they are filler waiting for the next believable scene with Cruise. On the other hand, Brand and Baldwin have less then no charisma and bounce sad witless banter off one another like bouncing a ball off a wall. Skip this until Blu-Ray and then punch the forward button until Tom appears.",
      "total_reactions": 2,
      "user": "Cultskill"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "I don't love 80s music.  I don't love Tom Cruise.   I went to see this with low expectations, and was really, really surprised.  Tom Cruise is the soul of the movie, and he's awesome.  The movie is gritty, and the actors all play it real -- not campy.  There's three interesting love stories, which were surprisingly (somewhat) grounded in reality.  I think this one was too easy for ciritcs to bash.  It deserved far better reviews.  I hope it's a sleeper hit, with some legs.  It deserves it!",
      "total_reactions": 3,
      "user": "Louard26"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2012
      },
      "score": 4,
      "text": "When it comes to explaining rock and roll, only Pete Townshend, according to Jeff Bebe, lead singer of the fictional band Stillwater, can articulate its essence with any intellectual rigor. He believes in all earnestness that the poetry of sex and drugs will save the world. So did the filmmaker, once upon a time, as a cub reporter for Rolling Stone in his 2000 bildungsroman Almost Famous. By the 1980s, the seasoned journalist probably knew that mom was right: rock and roll was indeed the poetry of sex and drugs, but at least those artists stood for something; they wanted to end the war, unlike, for instance, Def Leppard, who probably had no aspirations of, for starters, ending the cold war. Ultimately, the music of the sixties was the poetry of social consciousness. Stacee Jaxx, however, we can reasonably conclude, has no thoughts on the Falkland Islands crisis, the closest thing to Vietnam, concurrent to his epoch in time. Rock of Ages is Lester Bangs' worst nightmare. This jukebox musical plays like a paean to The Industry of Cool, the label Bangs affixed to a music biz he saw that was, to his chagrin, being commodified. Still, despite whatever reservations one may have about the artistic bankruptcy of a banal hair metal band such as Arsenal, who in Rock of Ages, comes under attack by the mayor's wife, you still had to, as the Beastie Boys so eloquently put it, \"fight for [their] right to party.\" Jaxx has the right to pour sugar on whomever he pleases. Patricia Whitmore, unmistakably, is modeled after Tipper Gore, who in 1984 formed the P.M.R.C., the organization responsible for labeling records with potentially offensive lyrics, after the almost First Lady caught her daughter singing along to a Purple Rain album track, the incendiary \"Darling Nikki\". Aaaah, Prince. When it came to explaining rock and roll during the MTV age, nobody defended it better than Jello Biafra, who on an early episode of The Oprah Winfrey Show, faced Gore down, and charged the religious right-funded organization with \"play[ing] on the fear of parents too chicken to talk to their own kids.\" Being, supposedly, a liberal democrat, Gore's conservative agenda seemed at odds with the party's ideals, and her own roots. Coming of age in the late-sixties, it would seem inconceivable that Tipper had never experimented with drugs, or put the needle on the groove of The White Album. There had to have been a skeleton, similar to the osterological frippery in Rock of Ages, when the truth comes out about Patricia, who turns out to be a former groupie, hidden in plain sight within the gatefold sleeve of Arsenal's debut album, posing alongside Stacey, practically naked. Patricia, however, differs slightly from Gore, in that she may not necessarily be a Christian. A sort of veiled commentary, at the outset, is made on the Bourbon Room marquee, where it publicizes Bad Religion as the club's headlining act for the night. On a subtextual level, what foretell could that bad religion be? If Patricia's rendition of Pat Benatar's \"Hit Me With Your Best Shot\", in a church, no less, provides any indication, the bad religion must be Christianity. The couplet: \"You're a real tough cookie with a long history/Of breaking little hearts like the one in me,\" on the surface, shows the moral crusader addressing her long ago fling with Jaxx, but the lyrics can also easily be construed as a rebuke against God. Even more blasphemous than singing a secular song in a house of worship, is the application of the sadomasochistic theme inherent in the Benatar \"classic\" to Jesus' crucifixion at Golgotha. She's a Scientologist, just like the man who plays the archetypal headbanger. During Foreigner's Christian-sounding \"I Want to Know What Love Is\", Cruise sings to Malin Akerman's ass, then vagina, as they pantomime sex in a dressing room. The hyper-carnality of Stacy Jaxx, more than overcompensates for the Abba-fying of REO Speedwagon, when Dennis and Lonny out themselves, thereby appeasing Cruise's church, known for its promotion of reparative therapy. Christopher Hitchens was right. Religion does poison everything. Wasn't Rock of Ages supposed to celebrate rock and roll as a religion in its own right, a salve for the broken soul, like when Sherrie tells Jaxx, \"When my hamster died, your music really helped me through?\" Lester Bangs must be rolling in his grave. As a retort to the proselytizing activists cries of \"We're Not Going To Take It\", the film uses Starship's \"We Built This City\"(a band, and song, reviled by many) as an unlikely anthem that embodies the bacchanal genre's so-called spirit. Rock of Ages gets its history wrong. Boy bands didn't kill hair metal bands like Arsenal, and their real life contemporaries. Nirvana did. While Jaxx belts out \"Don't Stop Believin'\" to a sold-out crowd, in the real timeline, Kurt Cobain was checking out Green River at some tiny Seattle club.",
      "total_reactions": 0,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "This movie is awesome. Rock gods-check. CBGB's fail parody-check. Boy bands trashed and called out-check. Hot chick power groupies-check. A bus of Night Ranger fans singing Sister Christian-check. Genre discipline, killer sound, respect to LA' s last great music scene, and self-deprecating humor balled up with precision and aimed at the few people alive that actually get it-CHECK",
      "total_reactions": 0,
      "user": "R4wP0w3r"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "If it wasn't for the admittedly solid performance of Tom Cruise as rock star god Stacee Jaxx, I would have argued for the title to be 'Rock Bottom'...",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "Big time fun, saucy, loud, sexy, with creative twists on the music, dancing, and high camp.  From the beginning we are brought right in to the movie and stay there for the duration.  I am totally surprised so many critics panned it.  I guess they just don't like musicals, and fun movies.  I stayed away because of the reviews, then saw it by accident when I found the dvd in a box of stuff.  Wow, what fun.",
      "total_reactions": 0,
      "user": "foundationcitiz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2012
      },
      "score": 5,
      "text": "I thought Rock of Ages was supposed to be a good summer movie after I buy Lollipop Chainsaw, unfortunately I agree with the critics and I think Scientology wasn't the only one who causing this shame. The cast look great in Rock of Ages, but here's the problem. The musical numbers were too cheesey. Do you think Tom Cruise should idol his rock and roll persona from his Risky Business days and perform with rock legends like Alice Cooper, Bret Michaels, and Slash? Could be. But things haven't been change for the \"Mission Impossible\" star. Because of the failure of the box office for the movie, it was announced in July that Tom Cruise and Katie Holmes's marriage went kaput. First, it was Nicole Kidman and now Katie Holmes. The divorce was finalized and TomKat is no more. Well, I don't think Cruise's career is in jeopardy, I like Tom Cruise and he has every single minute when it comes to action movies, but Rock of Ages wasn't a good year for him. Hopefully, I could usually rent it on Netflix.",
      "total_reactions": 0,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "When i first heard about this movie, i can't help myself but to get so excited to looking forward for this movie. Why...? it's simple because i'm an 80's-90's entertainments lover (especially of course, its Music). And boy oh boy this movie didn't disappointing me at all. Almost 85% of the great music in the 80's appear in this movie from Journey, Guns, Jovi, REO and even Starship are all appeared in this movie. Bur for the fairness & objectivity, i must admit that the plot of this movie is just so-so just like all the 80's or Class B or C movie type, the acting its just so-so EXCEPT Mr. Tom Cruise. YES he is the savior of this movie he is Stacy Jaxx. Tom is successfully on delivering the whole persona of Jaxx or in general what the 80's rock singer personality looks like. And i'm sure what surprise all of us is that Mr. Cruise,  is actually has a good singing voice. Paul Paul Giamatti as great as usual in his antagonistic roles. The newcomer Diego Bonetta has fair share skill in both singing & acting and the rest again, their acting skill just so-so. The director, Adam Shankman can be safely said that he is quite successful on directing this movie but not as great as his previous work on \"Hairspray\" and to sum up all this review, i could say that this movie it's the Rock & Roll Version of Glee and if u also an 80's music lover like me, this movie is a must & i guarantee that this movie wouldn't disappoint u at all..  :)",
      "total_reactions": 0,
      "user": "marv316"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "Its a nice treat back into the rock music that made the genre famous. It might feel a little too long at times but the setup here is believable and acting very nice.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "Nobody wanted to see a movie musical anymore...that seemed to be the message that audiences were giving Hollywood in the last couple of years or so.  After going through a 'second' Golden Age of sorts with Moulin Rouge and Chicago as well as Mamma Mia, musicals are not performing well in the Box Office.  It's  too bad because Rock of Ages is actually pretty good.  Stand out performance by Tom Cruise is a highlight, with other cast members doing pretty good as well. Of course, the story is cliche but nobody wants to see a musical because of its storyline.  Give this one a chance on the DVD.",
      "total_reactions": 0,
      "user": "dharma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "For this to survive in the cinema, it needed the large ensemble cast for it to survive, and it needed the big stars to save it from being a completely bland and lacklustre attempt at a stage to screen movie, because it is all of the above, with very little shining moments in between.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "Ignore this review.   I was trying to review a the PC game of same title.  I will delete this space if metacritic will allow me, but it's not obvious how to do so.  I rated average user review of 6 to not affect the overall ratings.",
      "total_reactions": 0,
      "user": "fartheststar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "Rock of Ages is a film about the survival of Rock & Roll and the people who live it. It's a decent movie but it starts out with a really cheesy quality that plagues most musicals and makes it difficult to get into the plot. Most of that is due to the fact that the first part of the movie is centered almost entirely around Julianne Hough. While she is absolutely gorgeous, is a fantastic dancer, and is even a decent singer, her acting ability is essentially nonexistent. However, once you get into the meat of the movie it's actually quite enjoyable. Sure, the impromptu musical numbers popping in throughout the film sometimes feel a little ridiculous but the mash-ups that are done and put together really well and progress the plot along well portraying the feelings and emotion of the moment. Also, Tom Cruise' role as Stacee Jaxx absolutely steels the show. This was honestly probably one of my favorite Cruise roles because he was pretty hilarious but also it's a character we've never really seen before, not just from him but in general. There were some surprising roles by people like Mary J. Blige, Catherine Zeta-Jones, and Malin Akerman that I wasn't aware of before watching. There were also some unexpected cameos by Constantine Maroulis (former American Idol contestant and pop/rock singer), Kevin Cronin (of REO Speedwagon), and Sebastian Bach (modern metal God and former singer of Skid Row). Overall, I think rock fans will enjoy the film but I'm not sure how well most people would. Personally, I love rock and enjoyed it for the most part but there were even times, especially towards the beginning and end, where it felt like it just dragged on and on. There was even a funny part in the end where the lyrics of one of the songs covered stated how the movie goes \"on and on and on and on\" and that seemed like an accurate assessment.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "This is the musical story of a man, a woman, and a band. Two young folks meet in Los Angeles in the 80s. They both want to make it big. At the same time, a rock star is going to break up his band and go solo. The mayor is dying to close down the biggest club in town and take over the property. Good versus evil, freedom versus control- who's going to win? Yes, the movie shamelessly plays with your heartstrings and it's almost like a live-action anime, because you can see the plot points coming up Main Street, but the movie turns out to be greater than the sum of its parts. Tom Cruise is the whacked-out singer who constantly staggers around under the influence of something or other. The two young leads play their parts with believable eagerness. Mary J. Blige has a really good supporting role as the no-nonsense but kind manager of a gentleman's club. Russell Brand and Alec Baldwin play managers of the rock hall, who are trying to keep the scene alive. You may have to forgive the movie a bit of a muddled section in the middle, but overall, it has a lot of laughs, and will keep you rooting for the good guys to win.",
      "total_reactions": 0,
      "user": "Lokar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "As of writing this review I'm 17, I wasn't even thought of being born at the time this music came out however that doesn't mean I haven't heard some of it before and it doesn't mean that it isn't  awesome! So Rock of Ages is a film adaptation of a the hit musical that tells the tale of a girl who moves to Hollywood to become a singer, when she arrives she begins to fall in love, becomes and barmaid in a well known Rock n Roll bar. When her boyfriend becomes famous and they split for incredibly poorly justified reasons the boy goes on to realise that the music industry isn't what it seems and the girl realises that becoming a pole dancer wasn't such a good idea either. All this happens whilst Tom Cruise A.K.A Stacee Jaxx turns from drunk superstar to...sober superstar and whilst the anti-rock movement tries to shut down the last great bastion of rock and roll.",
      "total_reactions": 0,
      "user": "potatoes351"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2012
      },
      "score": 5,
      "text": "It's not horrible, It's pretty entertaining - if you are willing to switch your brain off... yeah I know that's cliche, but... whatever.",
      "total_reactions": 0,
      "user": "PaperThing"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "As I am waiting for the big",
      "total_reactions": 0,
      "user": "MrHannigan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "I had viewed the preview of the movie Rock of ages, and it seems like a really good movie to watch, even better than the movie Chicago. Tom Cruise, has been around in the movie industry for many years, and his acting always seems to amaze me. If none of the movie critics had mentioned his name, I would never known it was even him, that's how good of an actor he really is and may I add he looks damn good for a man who just weeks ago just turned the big 50. He looks the same and will never change, I think that. I also think Alec Baldwin is really, really a cool and so funny guy of all comedians. I had to take a really good look, because I did not know it was he, Alec Baldwin. The music scenes are really good and the punch lines are dead on to the point. Catherine Zeta, who is very pretty and a really good actress, is full of surprises. There is a host of big stars and very familiar faces in this comic/musical of a movie. Julianne Hough is a first time actress in her first big motion picture, great job kid, great job. Bravo",
      "total_reactions": 0,
      "user": "Lynette"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2012
      },
      "score": 2,
      "text": "Oh Tom Cruise, what happened to you? You may be a dick, but that dosen't mean every movie you're in has to be **** You used to make great movies! Why can't you make a good one anymore?",
      "total_reactions": 0,
      "user": "Madiman2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "This was a decent movie, that is as exactly advertised. Its basically a musical with Tom Cruise in the lead role. The plot was again, decent, leaving much to be desired from the random breaking out into song throughout the movie. Not a great, but still not bad.",
      "total_reactions": 0,
      "user": "tjacobs38"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "Russell Brand still sucks, and a lot of the movie is just pure plain awkward.",
      "total_reactions": 0,
      "user": "btzneb92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Yes, it's a musical and yes, It seems hokey at first. But if you are of a certain age, something about it works. It's the music you heard on the radio. It was the LA scene back then.  If you let go of your embarrassment, it's a lot of fun.  Tom Cruise does a great job as a specie rockstar. The rest of the cast is very good also.",
      "total_reactions": 0,
      "user": "Burbis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2012
      },
      "score": 1,
      "text": "You'll love it, if you are blind or deaf, the only good part was... who am I kidding? Terrible movie, it's a hardcore version of Glee, they didnt implement what Mamma Mia did which made it a good musical movie",
      "total_reactions": 0,
      "user": "Alexanderzx360"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "Rock of Ages is a blast! The music is great, Tom Cruise rocks his performance and Julianne Hough is stunning to put it mildly. This film is the Grease of the new generation. Its pure movie bliss and an instant classic. Bravo.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Don't get all the bad reviews. This movie's a ball if you like 80's rock- and I really don't get how anyone wouldn't like 80's rock. It's the best.",
      "total_reactions": 0,
      "user": "trevortalks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "Rock of Ages. What should I say? This is a great music drama! The film is slow but paces up till the ending,  I loved Tom Cruise as Stacy Jaxx and Russell Brand as Lonny. Both actors were great! But Rock of Ages isn't special because of the roll rocking cast, its good because of the story, the colours, the amazing performances and direction by Adam Shankman. Would buy on DVD.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "Even though I'm not a big fan of the style of music in this movie, I still think if your a fan of musicals than this is worth a watch.  It has its flaws, but it's entertaining enough and Tom Cruise gives a solid performance.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2013
      },
      "score": 2,
      "text": "A trivial and flat blend of more stupid rock and roll and metal cliches made by a director that evidently love techno music or hip hop. cruise is criminally abetter of this stupid game.",
      "total_reactions": 0,
      "user": "klieberung"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "I'm a big fan of movies and musicals. But when the two mix it usually isn't good. It seems they are always shot for shot remakes that somehow take the fun out (like Rent) and there are ones that try way too hard (like Les Miserables). This one is sort of in the middle with fun 80s music and an Ok story. It's just the acting and singing that makes this movie cringeworthy. Fun has its limits, these mainly serious actors make fools of themselves and many can't sing. The ones that can (like Hough and Diego I don't know his last name) are terrible actors. These things make this great musical a bad movie. The thing is they were so close because they had fun unlike many movie musicals. I'd say because of that it's worth a watch if you're bored but not in many other scenarios. Surprisingly, Cruise steals this by perfectly playing Jaxx. It really is a shame because this movie has good parts just it kills classic songs and makes characters look stupid. It's not the worst but it ain't good.",
      "total_reactions": 0,
      "user": "Thebazman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2014
      },
      "score": 3,
      "text": "The movie was terrible, they completely ruined all the good songs from the artists. It was like watching a Glee episode, for me the movie was an offence and the plot was really dull.",
      "total_reactions": 0,
      "user": "PfenderStrat621"
    }
  ]
}