{
  "mc_avg_user_score": 5.3,
  "mc_metascore": 41,
  "mc_mixed_rating_frequency": 41,
  "mc_movie_name": "Sabotage",
  "mc_negative_rating_frequency": 28,
  "mc_positive_rating_frequency": 39,
  "mc_pro_critic_reviews": [
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 88,
      "summary": "This brutal, bloody, dark and at times gruesomely funny thriller isn’t some David Fincher-esque mood piece where all the clues come together at the end. It’s more like a modern-day, Georgia version of a spaghetti Western."
    },
    {
      "critic": "Stephen Whitty",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 83,
      "summary": "So Ayer, the director of the new Sabotage, does it smartly, subtly, by keeping some of the Schwarzenegger totems -- the masculine power, the enormous armory, the drainpipe-sized cigars -- and raising the quality of the surroundings."
    },
    {
      "critic": "Chris Klimek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2014
      },
      "score": 70,
      "summary": "This is the disreputable, even disgusting diversion the Expendables pictures should've been."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 67,
      "summary": "There's a great sense of rot to everything as shot by Bruce McCleery, and David Sardy's score is propulsive and appropriately caustic. What ultimately works about Sabotage is the way it so unabashedly plays rough."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2014
      },
      "score": 63,
      "summary": "For most of its running length, Sabotage is a gritty, compelling motion picture with twists to make a pretzel envious."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2014
      },
      "score": 60,
      "summary": "For Sabotage, as good as it is in its first half, can’t keep it together."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 60,
      "summary": "You’re thankful when Ayer stops trying to artistically tart up this Peckinpah-lite tale of vengeance and just lets his leading man do what he does best: blow the bad guys away."
    },
    {
      "critic": "Matt Singer",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 60,
      "summary": "Sabotage’s mystery component is mostly dead on arrival, and poor Olivia Williams has the thankless job of carrying it as the no-nonsense detective searching for the killer. But as Ayer proved with his previous film, End Of Watch, he has a natural eye and ear for the ecosystem of law enforcement."
    },
    {
      "critic": "Leah Greenblatt",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 58,
      "summary": "You won't respect yourself in the morning, but you might have some dumb, lizard-brain fun."
    },
    {
      "critic": "David Hiltbrand",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 50,
      "summary": "This is the type of movie best enjoyed as a late-night indulgence on cable. Really late at night, when your eyes are still partially open, but your brain has called it quits."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 50,
      "summary": "The rest of Sabotage rarely rises to Schwarzenegger’s level, in large measure because the other characters (of which there are far too many) aren’t nearly as sharply drawn by Ayer and co-writer Skip Woods."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 50,
      "summary": "This is an extremely gory flick, with autopsy scenes to complement Schwarzenegger’s usual shoot-first sensibilities. After 30 years, it’s pointless to complain about the collateral damage in his movies, but here Schwarzenegger is taking vigilante justice to dark new levels that can only be reached via plot holes big enough for a Hummer."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 50,
      "summary": "Sabotage cannot be called a good movie, not with a straight face. But as an Arnold Schwarzenegger movie, it has something."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 50,
      "summary": "The movie wants it both ways: bloodthirsty revenge and some finger-wagging about the tactics."
    },
    {
      "critic": "Mark Zhuravsky",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 42,
      "summary": "Sabotage is perfectly acceptable by it's peculiar standards, the action skillfully rendered but the scarcity of character development and perplexing ethics make the picture an uneasy watch."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2014
      },
      "score": 42,
      "summary": "David Ayer’s latest, Sabotage, is a sloppy DEA whodunit, distinguished by its scatological humor and gore."
    },
    {
      "critic": "Amon Warmann",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2014
      },
      "score": 40,
      "summary": "Arnie completists will enjoy seeing the Austrian Oak in good form, but as a whodunit thriller Sabotage is found severely wanting."
    },
    {
      "critic": "Simon Crook",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2014
      },
      "score": 40,
      "summary": "A bloody, scuzzy, progressively preposterous whodunnit, blending old school and new wave to neutering effect. One chunky plus: the all-new Antihero Arnie."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 40,
      "summary": "Artificially jacked up to feel like mean but serious fun, Sabotage mostly flings blood, vengeance, testosterone and clichés to the wall to see what sticks."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 40,
      "summary": "Director David Ayer is using the blood and guts to make a point about the insane violence committed by drug cartels, yes, but the bloodshed is unrelenting and, ultimately, exhausting."
    },
    {
      "critic": "Peter Sobczynski",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 38,
      "summary": "This could well be the single most implausible film playing at your multiplex this weekend and bear in mind, \"Mr. Peabody & Sherman\" is still in release."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 38,
      "summary": "There's no sense of visual artifice to match the ludicrous pitch of the script, and subsequently, the film comes off as awkward and uncertain."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 38,
      "summary": "Stupid, sadistic, misogynistic, confusing, and more than a little ridiculous. Here’s the thing, though: It keeps you watching, if only to see how tortured the plot or characters are going to get. I’m not sure that “entertainingly awful” is a recommendation, but the shoe fits."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 38,
      "summary": "So Arnold Schwarzenegger has reached the shaky-cam-and-hoodies stage of his career. But it’s a bit late in the day for Arnold to try to get all indie and complicated."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 37,
      "summary": "Sabotage doesn’t exactly glorify violence, but it certainly does get off on it."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 30,
      "summary": "Sabotage isn’t any good, even if its jagged, jolting visual excesses and frenzied energy keep you awake, gasping and guffawing by turns."
    },
    {
      "critic": "David Rooney",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 30,
      "summary": "What's most remarkable about this big, dumb exploitation movie is how carefully anything approaching psychological texture appears to have been peeled away."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 25,
      "summary": "Indisputably the most violent film of the year and disputably the worst."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 25,
      "summary": "Watching this head-slappingly stupid movie is an exercise is seeing David Ayer sucked into the drain that Arnold’s been spiraling down ever since his “comeback.”"
    },
    {
      "critic": "Louis Black",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2014
      },
      "score": 11,
      "summary": "The violence is always vicious, the catalog of brutally attacked, pornographically bloody bodies is unending, and despite the abundance of action the film is terribly dull."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "summary": "Does this mean that Sabotage is a rich, morally complex story about the gray zone between good and evil? Hell, no. It just means it is a bungle."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "Arnold Schwarzenegger heads a gritty group of DEA agents who are being hunted down and brutally murdered. This was written/directed by David Ayer (End of Watch, Training Day) and it's shows off many of his best traits: hard-edged violence, dark dealings, witty banter and tons of testosterone (even in the women). The macho cast creates tuff, enjoyable characters with Mireille Enos (best known for \"The Killing\") hilariously hardcore and against type. The snappy pacing and sharp banter propel this film forward until the last third, which slows a bit before the final blowouts. Still, there's plenty to enjoy.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "The story, in itself, is not too bad. I feel they could have done quite a bit better in portraying the dialogue. Every other word starts with either an f or a s, the script is more or less generic. The characters are... lackluster, half of them are killed off before we really knew anything about them other than their partying lifestyle. It did not build upon half of the people we should have cared about. Really the best parts were the opening gunfight and the ending scene where he has finished what he sought after. It was just... not done well... The movie wasn't bad, but it wasn't what it desperately needed to be. I would wait for the dvd/netflix release.",
      "total_reactions": 1,
      "user": "Ansatsu83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "This movie is getting undeserving awful reviews. The dialogue at times is pretty trashy, but other than that Arnold gives a pretty good serious performance in this viscerally brutal action film full of intensity.",
      "total_reactions": 1,
      "user": "TryASummersault"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "Some people call them plot twists. I call it jumping the shark. This serious and violent film jumps the shark more than \"Sharkanado\" did last year, and that was a lot of sharks! By the end of the film I couldn't tell you if I liked this one or not? I still am not sure. The director tried to cater to the Arnold image but it feels shoehorned into a borderline horror fest thriller like \"Seven\" or \"8MM\". I did like it better than that campy \"The Last Stand\" from last year.",
      "total_reactions": 1,
      "user": "analogkid280"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "I am a huge fan of David Ayer both as a writer and a director! He first caught my eye with End of Watch, then once again with Training Day! What I'm trying to say is that Sabotage did not disappoint, he has delivered yet another classic that I am more than happy to add to my collection! Its brutal, its bloody, its deep and its thought provoking! Well done David! Keep up the good work!",
      "total_reactions": 1,
      "user": "chrisjones914"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "I love David Ayer. I truly do. However even a fan such as I can't deny that Sabotage is truly a crap fest. It is boring, sloppy, poorly acted AND directed and contains some of the most awkward dialog I have ever heard.",
      "total_reactions": 1,
      "user": "cryhardhumor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "Yes it's another mindless Arnold Schwarzenegger vehicle, but that doesn't mean it isn't fun. It's got a pretty entertaining story and a lot of fun shootouts that is guaranteed to please die-hard fans of action. Acting is pretty standard for a type of movie like this, however, some of the actors, such as Terence Howard and Sam Worthington felt a bit wasted, as they didn't get the screentime that they deserved. The most notable performance by far was Mireille Enos, who delivered an unexpectedly sinister performance. Overall, it may be somewhat forgettable, but for what it's worth, it's definitely entertaining throughout and not as bad as people and critics have been saying it is.",
      "total_reactions": 1,
      "user": "moviemitch96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "text": "A lot of blood and guts and an extreme amount of foul language. The theme was nothing new. The movie just didn't work as a whole. Also, A. Shwarzenegger, who I've enjoyed in more light hearted movies, was placed in a role which was not him. Way too serious for him.",
      "total_reactions": 1,
      "user": "oneof9"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "Wrong movie for Shwarzenegger. It is a gritty and gruesome action movie, and Shwarzenegger is obviously out of his usual element. It is a disaster. It is depressing watching him in this one. Nobody sane in mind would call Shwartzenegger in a movie like this.",
      "total_reactions": 6,
      "user": "ArkhamKnight"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "Sabotage has a few blind-siding plot twists that don't quite work, but for the most part this is a solidly executed and suitably sleazy genre flick. Arnold Schwarzenegger may not be the best thing in Sabotage, but this is the best film that he's done in a long time. Sabotage is far more effective than its action-centric trailers have suggested, with the film more a mystery-thriller that actually offers Arnold Schwarzenegger and the cool ensemble a chance to act and not just shoot guns.",
      "total_reactions": 8,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "A dirty and sleazy cop movie that's plot, while interesting, lacks intelligence. I pretty much pegged who did it shortly after the bodies started pilling up. Arnold's team might not be the most enjoyable bunch, but the man himself delivers. It's just a shame about all that terrible dialog, the worst of it coming from Olivia Williams character.",
      "total_reactions": 2,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "text": "I was really looking forward to a dumb night at the movies with the \"violent and brutal\" SABOTAGE featuring our former governor. Awnold is dweadful. The cast includes some major players--all given nothing to do. The script is awful, Screaming **** every other word is not wit. But worst of all, it is directed at a Downton Abbey pace. In fact, Downton is more action oriented. Much more!",
      "total_reactions": 3,
      "user": "LowbrowCinema"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 4,
      "text": "Arnold was great in it and it's uber violent in all the best ways, but it's also not an action movie. It's more of a mystery thriller that has some action scenes. All the characters and actors are wasted outside of Arnold though and the \"twists' and narrative are nothing special. I really like Arnold movies but this is probably one of the few I just can't get into.",
      "total_reactions": 1,
      "user": "StriderKiwi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "When will Hollywood learn that making your super awesome action hero suddenly loose accuracy, is not a good way to create suspense. Come on!! This was sad!",
      "total_reactions": 1,
      "user": "Qgal5kap"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2014
      },
      "score": 1,
      "text": "Schwacher Actionfilm.",
      "total_reactions": 1,
      "user": "Nobilis1984"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2014
      },
      "score": 1,
      "text": "This movie would have been better without casting Sugar as an African American.  I am tired of the Race Baiting; America will no longer tolerate it in any shape or form!  But aside from that, the movie has gore, the storyline is grim and there is really nothing to look forward to in the ending of this movie.  Just killing and more killing and then killing the people who were originally intended to be killed.  The movie is extremely vulgar and rude, nobody respects anyone in this movie.  It does have a brilliantly sadistic plot that will keep you linking parts of the storyline together long after you have wished you had never seen the movie...",
      "total_reactions": 1,
      "user": "Dragon_Fly"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "Finally - the return of real men on the big screen! The story had some suspense and a couple of good plots - so that was a nice surprise.",
      "total_reactions": 5,
      "user": "MichaelDudko"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2014
      },
      "score": 1,
      "text": "If you have a couple of bucks to just throw out....",
      "total_reactions": 1,
      "user": "yashdan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "Sabotage was a movie was so much potential but ultimately failed to live up to that potential because it had a ridiculous premise. ***SPOILERS*** The premise was that this elite, undercover DEA team attempts to steal $10 million from a pile of what appears to be hundreds of millions of dollars. They then blow up the drug cartel's money (as they were apparently instructed to do by the American government) and upon returning to get their $10 million later on, the money is gone. Now here is where the ridiculousness kicks in. The government and the cartel somehow seem to know exactly how much money was taken and interrogate the team for six months trying to get them to admit guilt. I'm sorry but that would be like a swimming pool draining but someone knowing that you took a cup of water out of it beforehand. It's retarded. Now, normally this type of stuff wouldn't cause me to take a movie with fantastic acting, dark and gritty action, and solid character development down to a 5/10 rating. While I thought the plot development was also crap, the premise ultimately hurts the movie because every single dramatic element and moment of suspense and intrigue in the entire movie is built entirely on that faulty premise. It is a damn shame too because this movie had Miami Vice (reboot) potential.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "Arnold is back, and at 67 years old he hasn't missed a beat. Sabotage is the Governor's third starring role since returning from his stint in politics, and it's easily his best one to date. Schwarzenegger stars as Breacher, the commander of an elite DEA swat team, who agrees to help his under appreciated team take part in the theft of millions of dollars, from a top cartel boss. The heist goes relatively smoothly, but when the team goes to retrieve their money, they discover that one of them double crossed the rest and had stolen the pay day. Everyone is upset and trying to figure out who it was, when the cartel shows up looking for retribution. As the cartel picks off the team one by one, the remaining members have to ban together to try and stop them, except this time, they have to do it knowing that one of them is a trader. Arnold isn't doing the crazy stunts or fighting scenes that he's become synonymous for, he's in more of a leadership role in this film, but he's still the man when it comes to action films. Here he's paired with the Killing's Mireille Enos, who as the only female member of the team, gives an amazing performance. I'm used to her always playing these quiet, reserved, troubled characters, and it was a real treat to see her break out as the wild girl on a team full of men. Sabotage is the rarest of Action films, as it is one with a great storyline, that is as gripping as any drama. The film isn't just about killing people and blowing things up, it has plenty of that, but in the case of Sabotage, there is a reason for all of it, and this film will really keep you on the edge of your seat.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2014
      },
      "score": 0,
      "text": "Utter crap. Pretty much every single person in this movie is annoying. The story is just there as an excuse for people to shoot each other. Total waste of acting talent, seeing as there are quite a few actors/actresses starring that I actually like. Oh, and the cursing, completely over-the-top unnecessary. And I'm not one to hate a movie just because of the amount of swearing in it. The Big Lebowski is one of my favourite films.",
      "total_reactions": 0,
      "user": "Patrick94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "Not expected this from the director. For a title called 'Sabotage' which had one of our times greatest action hero in it the story drags with lots of drama than stunts. Arnold Schwarzenegger is not young anymore and he's not capable of heavy stunts, but still he handled well those crucial parts. No doubt he was good, and also the direction, but the story was not well written. Especially the twist was so pale and the supporting characters were hyped better than the Arnie's, but failed to hold and deliver when the story needed them.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2014
      },
      "score": 2,
      "text": "I wasn't aware of this Arnie movie til my girlfriend downloaded it and asked,\"Do you want to see a new Schwarzenegger movie?\" This one was completely off my radar, and maybe it should of stayed that way. Sabotage isn't exactly a balls to the wall action film, there's a little bit of suspense thrown in for those of you new to that concept. Otherwise you've seen this formula before. Team of awesome \"specialists\" gets the blame for something missing/gone wrong, the leader is tossed, teams falls into disarray, leader comes back seeking payback, team gets killed one by one and there's something else, but I don't want to give it away. Trust me though when you see it it won't be anything earth-shattering. This movie falls on the dull side with boring dialog, Arnie isn't known for his acting chops, that mostly consists of cussing and insults. The action though is pretty decent, if you're looking for good gore in a  movie it's here. Firefights are done well and don't seem too unrealistic, although there's one scene that had me and my girl laughing cause the blood looked more like someone dropped a bottle of BBQ sauce on the floor. In the end though it's just a very dull and forgettable movie. Arnold looks very tired in most of his scenes and all the other actors were just not interesting. It's the action in this movie that keeps it from being a total zero, but even those scenes added together only amount to something under 10 minutes. If you can watch it for free give it a go, if you're gonna pay for it pass it up.",
      "total_reactions": 0,
      "user": "GundamMars"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "Not a terrible idea for the film but ultimately failed as a result of Arnold's poor acting, poor choices on behalf of the direct and the editor.  A story with potential but that's all.",
      "total_reactions": 0,
      "user": "AlexanderLuthor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "Excessively violent and unbelievably scattershot, Sabotage is a mind-numbing onslaught of extreme blood and gore that completely fails to offer anything more to its audience.",
      "total_reactions": 0,
      "user": "sammurphy66"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2017
      },
      "score": 2,
      "text": "With no brains and slow development this movies doesn't define itself and what it's supposed to be getting at one of arnies worse just full of bad acting a story you don't really care about",
      "total_reactions": 0,
      "user": "travellyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 3,
      "text": "Excitement is in short supply in \"Sabotage\", a movie that boasts a fine performance from Arnold Schwarzenegger but adds poor characterization and a surprising, unnecessary amount of violence.",
      "total_reactions": 0,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "With the exception of a couple of instances of gimmick editing and bad dialogue (forced humor) this is about as good as it gets in the genre it occupies.",
      "total_reactions": 0,
      "user": "bloodfoot"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "What a total disgrace!  Turned off halfway through!  Free from library, wasn't dumb enough to go see it much less pay anything to it.  Moron critics on here actually went easy on it!",
      "total_reactions": 0,
      "user": "AxeT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2014
      },
      "score": 3,
      "text": "Dang it Arnold...bad call. This movie was set to be awesome and BA as far as action movies are concerned. I expected it to be just that. I was disappointed and even disgusted at what I saw in this film. A lot of blood, violence, bickering, and swearing. Which you can get away with in an action movie as long as there is a net to fall on like a character that is actually very smart coherent and reasonable or sexy women or clever humor...of which there was none. It was all very vulgar, lowbrow, and just rude. There is only so much of that that can be taken without blemishing the movie. There was a definite guessing game that was kept alive as to who is behind what exactly, with a few holes but nothing too serious. But the end result was just disheartening and bleak. Nothing to hope for or look forward to. It is cool to see the governor getting swole and becoming the action hero we all love once again but its Just a dark movie that isn't really Arnold's type. Van-Damme or Segal maybe. But, come on.",
      "total_reactions": 0,
      "user": "BigZ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2014
      },
      "score": 3,
      "text": "I have to say, I wasn't expecting that much going into the movie. However, I did not expected to be as bad as it was. Unfortunately, Arnold Schwarzenegger is completely out of his element here. It is obvious throughout the whole movie that this was a script that was just not for him. Not even saying that the script is that good. In fact it's awful. Horrible dialogue with swears left and right. The amount of foul language and this movie is ridiculous and completely unnecessary. I'm no stranger to foul language, but it needs to be used correctly. For example in Quentin Tarantino's Django Unchained foul language was used beautifully. Here it's just there for the sake of being there. Almost everyone in this movie cannot act other than Arnold Schwarzenegger and Sam Worthington. The action sequences are fun and enjoyable. But in that way where it's just amusing to see people blow up and die. There was no real rhyme or reason to it and the action sequences were few and far between. All in all it was a terrible movie, with a terrible script, terrible acting, terrible plot, and two actors who did their best to carry the movie but no matter how hard they try there would be no saving this disaster.",
      "total_reactions": 0,
      "user": "CallMePaul"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2014
      },
      "score": 2,
      "text": "Why does Olivia Williams have to fake a terrible accent when The Schwartz doesn't? And what's with the editing? Did the wrong reel get dumped? The scene at Tripod's cabin made me wonder if I was slipping - were we 5-seconds behind the fight? But he saw him for a minute... It was mud. And the amazing writing at the cabin; \"It's beautiful\" -I thought she was being sarcastic.",
      "total_reactions": 0,
      "user": "Blairforce"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "No, this is not your typical Schwarzenegger action movie with tongue-in-cheek humor. This movie is nihilistic, gritty and has a much more realistic feel to it. Although Arnold is not one of the great character actors like Robert de Niro, I don't think he's miscast at all. His unusually dark performance works just as well as the ones provided by the actors playing his team mates who've been psychologically deformed due to their job. The story has a few implausibilities but also a number of twists that kept me guessing. The only thing I didn't like so much was the ending. It seemed a little out of place compared to the rest of the movie.",
      "total_reactions": 0,
      "user": "malibuboy93"
    }
  ]
}