{
  "mc_avg_user_score": 5.5,
  "mc_metascore": 34,
  "mc_mixed_rating_frequency": 23,
  "mc_movie_name": "Safe Haven",
  "mc_negative_rating_frequency": 21,
  "mc_positive_rating_frequency": 29,
  "mc_pro_critic_reviews": [
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2013
      },
      "score": 75,
      "summary": "A sentimental romantic thriller. But it’s a well-made sentimental romantic thriller, and that makes all the difference."
    },
    {
      "critic": "Anna Smith",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "\"Salmon Fishing In The Yemen\" and \"Chocolat\" man Hallström is an old pro at navigating this kind of undemandingly dramatic yarn and does a pretty fine job with Sparks' story."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "Safe Haven offers an unsurprising but not unsatisfying tour through recognizable Sparkville terrain."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2013
      },
      "score": 58,
      "summary": "Safe Haven is a species of Gothic chick flick."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "This one blends the scented candles of a daytime soap with the tamer aspects of a middling thriller. Some folks will bring Kleenex. Others will need NoDoz."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "The man (Sparks) is a cultural magpie, capable of borrowing from a 1991 Julia Roberts flick and M. Night Shyamalan in one fell swoop. He’ll never get an award for originality, but when it comes to rehashing formula and pleasing his audience, the man is a master."
    },
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "Not one of Sparks' best flicks (The Notebook is quite good) Safe Haven is marred by film cliches. It has an alarming number of throwaway montage sequences."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "Adapting the author’s cornball formula for a second time around is once-ambitious director Lasse Hallström (“Dear John”), who delivers a cinematic valentine you’ll be reasonably content to watch on a flight in a year or so."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "The picture-postcard location of Southport, N.C., is the film's strong suit."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "Hallstrom (“Chocolat”) makes the mishmash palatable, and romance mainstay Duhamel provides some sweet-and-salty charm, but there’s not much they can do with Sparks’ canned dialogue and Hough’s undercooked acting."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "It's Valentine's Day! Unrealistic romantic expectations are in the air! And Safe Haven does the unrealistic romance thing pretty well."
    },
    {
      "critic": "Stephen Farber",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "A thriller element that has not been present in earlier Sparks movies is designed to draw reluctant male viewers to see the picture, but they won’t respond with the same enthusiasm as his core audience of woozy romantics."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "Hallestrom and his screenwriters may be stuck with Sparks’ formula, but they take advantage of the geography, the leads and a couple of homespun supporting players – Robin Mullens is a wonderfully folksy owner of the seaside seafood shack."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "I like Duhamel, and in her first straight-up dramatic role Hough does well enough, though her singing and/dancing career thus far has trained her to oversell, as opposed to sell, as opposed to act naturally."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "Reading a Sparks novel allows one's imagination to enter the equation. Watching one of his stories adapted on screen has exactly the opposite effect: it neuters the imagination. This is soap opera, pure and simple."
    },
    {
      "critic": "Emma Dibdin",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "By the numbers even by Sparks’ standards."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "The movie’s not all bad. There’s palpable chemistry between Duhamel and Hough. The former particularly seems well-suited to this sort of thing: He has just the right amount of grizzled charm to be one of those wounded hunks Sparks likes so much."
    },
    {
      "critic": "Keith Phipps",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "Any residual charm evaporates when the third-act dramatics start piling up and a must-be-seen-to-be-believed final twist redefines the word shameless, even by Sparksville standards."
    },
    {
      "critic": "Miriam Bale",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "Duhamel is goofy and harmless, but unlike Ryan Gosling in “Notebook,” adds no texture or subtlety. Hough (“Footloose”), while photogenic, is similarly bland."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "Safe Haven plays out less like a love story than it does a two-hour audition tape Julianne Hough commissioned to land a lucrative lip-gloss-modeling contract."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 38,
      "summary": "It’s hard to argue with the title here – Safe Haven, indeed. This is all about safety in the Hollywood workplace. Why make a movie when making a Hallmark-card-with-dialogue is so much less risky?"
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 38,
      "summary": "A movie that passably ambles along in generic-melodrama mode before finally insulting audience intelligence one time too many."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 38,
      "summary": "If it can be said movies have personalities, I give you three words to sum up the basic core identity of Safe Haven: Bat. Bleep. Crazy."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2013
      },
      "score": 37,
      "summary": "Safe Haven is one of those Valentine’s Day confections that satisfy your sweet tooth until you get to their weird, off-putting center. The problem with movies is that you can’t put them back in the box."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 33,
      "summary": "The cutaways to this cop-on-the-edge plot are jarring and lacking in conviction, and when the whole tortured mess comes together in a twist-filled third act, Safe Haven becomes a full-blown calamity."
    },
    {
      "critic": "Melissa Anderson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2013
      },
      "score": 30,
      "summary": "Hough emits all the charisma of a personal assistant."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 30,
      "summary": "The leads project a sunny patina of wholesomeness and share marvelous tans, but beyond that, it’s a shrugging love match."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 30,
      "summary": "The weakest parts of Safe Haven are its action sequences, in which the illusion of reality is shattered by ham-handed editing, garish special effects and comic-book dialogue."
    },
    {
      "critic": "Laremy Legel",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 25,
      "summary": "Even when compared against other films that have been adapted from Nicholas Sparks novels, Safe Haven is terrible."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2013
      },
      "score": 20,
      "summary": "As ever with a Sparks story, the action takes place in a sugary vision of small-town America that does not correspond with the real world at any point."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 20,
      "summary": "This sloppy sentimental journey is long on beauty shots, short on depth and seriously intent on tugging your heartstrings. Indeed, it demands you reach for those tissues. Sob."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 12,
      "summary": "It goes without saying that Safe Haven is the whitest thing offered up for public consumption in the three days since Mumford & Sons won the Grammy for Album of the Year."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "summary": "I hate Safe Haven. It's a terrible thing to do to your Valentine."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "I usually do not like romance movies, but this one provided a good mix between action and romance. I thought the story line was very good and kept me guessing the whole time. I do not understand why the ratings are so bad, if your not just looking for love, but for some action with it, I would definitely suggest this movie.",
      "total_reactions": 2,
      "user": "KellyC"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "I am amazed how wrong most critics are at rating movies these days. Have they become so shallow and devoid of common sense? If you are a movie buff that likes a great family movie,great story, unusual setting, romance, drama, thriller with a surprise ending  go see it,  you will not regret it.",
      "total_reactions": 7,
      "user": "MDeffense"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "I almost missed a lovely movie because of the pitiful reviews.  The theatre audience even clapped at the end.  How many times do you witness that? I go to the movies all the time and rarely see that.  The characters are basically nice people you will like with one exception.  That's a relief in comparison to so many movies out there now.",
      "total_reactions": 3,
      "user": "Copernicus"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2013
      },
      "score": 3,
      "text": "It being Valentine’s Day weekend Hollywood, naturally, offers a romantic Nicholas Sparks film “Safe Haven” based on one of his many books.. In most films logic has to be left at the door but with this one also leave your brains there.",
      "total_reactions": 5,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2013
      },
      "score": 1,
      "text": "Safe Haven? More of crap haven. Unfortunately, this movie falls flat for me. There is just a bland love story, could you even call it love??? Jesus man, come on. The thriller part of it had no 'umph' feeling in it to boost the movie at. So I decided to say: F*ck it. A poor movie that falls flat.",
      "total_reactions": 2,
      "user": "BENNEB"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "The definition of haven is \"a place of safety\", so we have here a safe place of safety. This means that the girl is really really safe in the arms of her guy...which is good. But there are some tense moments before that is confirmed! Yes, all very predictable, but what exactly is wrong with that?",
      "total_reactions": 1,
      "user": "Proteus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "A somewhat awkward romance flick, but it's sweet. Dialog is clumsy at times, side-characters aren't developed, and the more tense action moments near the end of the film fall flat. Still it is romantic and touching even though some moments come across as goofy and weird. If you're looking for a movie to watch with your significant other this is a pretty good choice. It may not always hit the mark but when it does it's easy to recommend to fans of this genre. Even as someone who doesn't really have a taste for this kind of thing I found it enjoyable.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "A Nicholas Sparks adaptation unlike most of the others in that it can be at least at times a powerful film with actual characters and you know, purpose. When Katie (Julianne Hough) flees her hometown and takes refuge from her past in Southport she meets single father Alex (Josh Duhamel) and begins a passionate relationship while her past begins to catch up to her in the form of detective Tierney (David Lyons). Safe Haven is a decent love story that doesn't feel like the usual Nicholas Sparks drivel save for a final twist that almost derails the whole film. The film counts on Hough and she delivers a touching but hardened performance as a woman who has been through a brutal ordeal yet survived. Her isolation, while short lived is the main problem with the film thriving through character interaction, the time she spends alone drags and because of her secrets she prefers seclusion. Duhamel seems unsure in the role but has good chemistry with Hough so the overall feel is still there. The side characters are paper thin and take up valuable minutes of the film extending a picture with very little story. That's not to say its a simple film, in fact it tries to avoid being generic and formulaic although it only really avoids the latter. The film lacks anything special to make it unique so it comes across as ordinary. The director, having adapted Sparks' Dear John knows how to handle the melodrama rife in Sparks' books and in a way its what makes Safe Haven so light and easy to watch but it also means a film about trust, betrayal, death and fear is about as dark as an episode of the Tellytubbies. The film is so sweet at times its sickly and becomes nauseating. Overall the film is terrific in handling the characters and how they interact but it struggles and ultimately fails to surprise or impress upon the viewer any kind of originality.",
      "total_reactions": 0,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Safe Haven was exactly what I expected. It was a good movie with an interesting plot, sad parts, and solid acting. Unfortunately it wasn't as good as Nicholas Sparks' best film, The Notebook. Julianne Hough is beautiful and a triple threat but her acting, while capable, wasn't as strong as Rachel McAdams. Josh Duhamel did a solid job opposite of Hough and seems to have more potential as a breakout star. As for the film, the plot was interesting but it dragged quite a bit and had some areas that were just silly. Honestly, the best thing about this movie was the subtle twist thrown in at the end. It changed the meaning of some of the elements of the film and left you with a better feeling for the movie in general. Overall this was an above-average chick flick but it didn't have enough of the thriller element I was hoping for from some of the trailers. Nonetheless, I'm sure most women will enjoy it and some guys, if they are willing to watch it, will probably enjoy it as well.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "Movie is not that and bad also not that good.Certainly not worth to go to Cinema or buy a Blue ray.Anyhow movie has decent sound tracks at right scenes also camera work is excellent.Story id bit more of same to Lucky one.",
      "total_reactions": 0,
      "user": "Smee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "Safe Haven is NOT about women's independence. It's about the opposite. I would've liked to see a female helmer work this storyline, even a male director who at least sort of understood women.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "It's doing what a romantic movie is suppose to do but it leaves you hanging with its emotional gaze at love. Safe Haven is whatever a romantic movie fan loves but I think it will disappoint others.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "\"Safe Haven\" attempts to pull heartstrings using every trick in the great book of cliches. What we got here is a plot from paperback thriller mixed with storyline out of cheap romantic novel. The actors keep the predictable end result from falling flat on its face, yet the good moments are very few and much in between.",
      "total_reactions": 0,
      "user": "Mr_Muumi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "This movie is an okay romance movie that suffers from the crazy plot twists and only a few good actors. Julianne Hough is alright and Josh Duhamel does better here then in Transformers but the ending just ruined it. Its a good movie if u like romantic movies.",
      "total_reactions": 0,
      "user": "soren40"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "Safe Haven is just brutally boring mixed with awful plot twists.  There is solid chemistry Josh Duhamel and Julianne Hough, but the acting isn't sharp. D+",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "This movie is an opportunity to get in touch and feel your emotions and there are many times in the movie to do just that because it is so cleverly put together. The ratings should be much higher than they are. The movie is all about the human interactions that will cause you to feel what it is like to be the characters if you were in the same situations as they were in. I am a male and i cried at times, good thing the theater was almost empty and nobody saw me.",
      "total_reactions": 0,
      "user": "Espiancritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 3,
      "text": "Why do people still make movies off of Nicholas Sparks books? I just don't understand. But of all the Nicholas Sparks books, this one was the most ridiculous. I mean, Trying to combine romance with thrills, makes this movie fail miserably. No wonder valentines day movies suck soo bad.",
      "total_reactions": 0,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "This movie was everything I wanted on a Friday night after a busy day at work. It was another one of Nicholas Sparks' masterpieces that kept me enthralled the whole way through. I was kept on my feet the whole way through and the whole, 'Jo' storyline and ending was really something I didn't expect. Safe Haven is certainly a movie you should see. I give it a 10. Also, this website keeps changing my score from 10 to a 9.",
      "total_reactions": 0,
      "user": "TheREALdeal1990"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "I did watch this on valentines day and it was ok. Just okay because it started off just like a typical love movie and end like they all do. What trally saved this movie from being a complete fail was definetly the ending. I didnt expect it to end that way.",
      "total_reactions": 0,
      "user": "raulhaez9"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "Not sure why people are hating on this movie so much. No it's not the best movie but its not terrible. It has action along with suspense and romance. The writing was also good. I give it an 8",
      "total_reactions": 0,
      "user": "Lansdenrs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2013
      },
      "score": 2,
      "text": "This movie was very disappointing. There was little to complain about from Hough or Duhamel, but the story lacked much to be desired. It was simply unrealistic and shallow. Girl escapes an abusive relationship, finds her one true love within weeks, he promises to solve all of her problems, she takes the place of the mother who died of cancer and together they triumph over the past and everybody is able to move on without a scar on any of them.... Really? Sweet, yes, but what happened to creating stories about people, not ideals?",
      "total_reactions": 0,
      "user": "lehuggin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "My girls have read the book Safe Haven and told me how wonderful the book is.  Since I never seem to have time to read, I decided the next best thing was to watch the movie.  I enjoyed the movie but felt that it was another version of Sleeping With The Enemy but not as suspenseful.  I felt that the story line progressed too quickly at times and more background information could be given.  I also felt the love story took off relatively fast in the movie which seemed unrealistic to me considering the information that was given about each character.  With this being said I still enjoyed the movie and look forward to a time when I might have time to read the book!",
      "total_reactions": 0,
      "user": "JSnyder90"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "My new favorite, since A Walk To Remember and The notebook. I think it's even better than the notebook. Never thought der will be anything better than the two Until I've watched the SAFE HAVEN.",
      "total_reactions": 0,
      "user": "lyraM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "Ok, another film based on a Nicholas Sparks novel, Safe Haven isn't perfect, have some good ideas, wich are not fully exploited, but in the development some of these ideas has a great end, the performances are not perfect. but are good, Julianne Hough is for much the best of the movie, and finally the script, is acceptable. Safe Haven is a good movie, and it's better than the Nicholas Sparks movie of the last year (The Lucky One).",
      "total_reactions": 0,
      "user": "MarkDetrel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "This movie was actually good, it combines a comedy with a thriller and it works quite well. The ending was surprising  i did not expect it. This romantic movie takes a risk by adding thriller elements to it and it pays off.",
      "total_reactions": 0,
      "user": "SJ-ULTI-Reiews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "Nicholas Sparks tries to make his \" romance\" novel a little bit of a suspense and adds fight sequences,  is this suppose to make it better? .......... nope. Julianne Hough plays a woman who is trying to get away from her domestic violence past trying to get away from her crazy husband, moves to a small town then finds a guy how is a widow father of two children, then they both fall in love! but then her husband who isn't dead is a cop trying to find her.This movie lacks action  and its fight sequences sucks-yes i get it this movie is a romance/drama movie but apparently Sparks is trying bring a little murder/action into his book and into this movie; Director Lasse Hallström the  director of Chocolat and Sparks' previous adaptation Dear John apparently wasting his talents is back for more of Sparks' story, Hallstrom is apparently using his visions in a Nicholas Sparks' tradition oh yeah BOO!   this guy can't even direct a fight scene or any action sequence two fromulas which this movie terrible  The Writer:  Nicholas Sparks The Director: Hallastrom lacking vision  and for writer sparks is he doesn't know to make action well for guy who does to many romance novels you expect he would of failed. This movie apparently has a little bit of \" romantic cliche\". cliche number 1: Star crossed lovers, yes and there is a woman non stops complains about her love life when there litterally is the perfect man in front of her. Cliche #2 \" do you want to go canoeing with me ?  cliche.\" yes there is the annoying cliche i can't take in sparks' movies the boy asks the girl do you want to go canoeing with me girl: sure. meanwhile they have a good time, then when their done they kiss after the kiss there is ......... the rain cliche omg! i can't stand that haven't we have seen this cliche? oh yeah we saw this in the **** 'The Notebook' then they laugh then have sex. I can't take cliche's anymore. Nicholas Sparks yes the man is a good author its just can't we have a movie Sparks or his dumb screenwriters ruin it with his cliche's  stop with that! please. Grade C- Yes! the movie does have to many romantic cliche's but the ending was surprising, Finally Sparks did something different with his movie and the book. but the romance was creative the actors were ok.",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2014
      },
      "score": 2,
      "text": "At this point, you know what to expect. Seriously, each movie based on a Nicholas Sparks book is so unoriginal, even the books themselves have turned repetitive. Another thing I've noticed is that they always come out this time of year. Valentine's Day is supposed to be a time to share love between couples, not give the one you love an excuse to end the relationship.",
      "total_reactions": 0,
      "user": "warrenworld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "OK I am not a film critic, just an average Joe-yep a guy.  OK so I have a heart and got sucked into the movie.  Amazed that some of the critic's don't have a heart, yes it can be a little predictable and a little sappy, but thought the scenery, setting, chemistry, and plot made for a good movie.  Not to mention it does have some redeeming value as far as hitting on the subject of battered women and how sometimes it can be difficult for them to find a safe haven in real life.  I know because I have a sister who was in a similar situation.  For me it was a good movie hitting on all emotions.",
      "total_reactions": 0,
      "user": "horizonbts"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "This is my first review and I even registered extra for this movie here, because the critic score shown can't be the same movie I watched!",
      "total_reactions": 0,
      "user": "samerika"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "While a predictable chick flick, Safe Haven is never dull. It's not particularly good, either.",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ]
}