{
  "mc_avg_user_score": 6.7,
  "mc_metascore": 52,
  "mc_mixed_rating_frequency": 100,
  "mc_movie_name": "Safe House",
  "mc_negative_rating_frequency": 18,
  "mc_positive_rating_frequency": 147,
  "mc_pro_critic_reviews": [
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 88,
      "summary": "The action is contained within a coherent dramatic structure and the puzzle-box paranoia of spy-agency protocol."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 78,
      "summary": "Director Espinosa stages the endless action with a tremendous flair that recalls John Woo's grittier moments, and cinematographer Oliver Wood, who shot Woo's finest Hollywood moment, \"Face/Off,\" gives the whole violent show a downright brackish look that borders on the sublime."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 75,
      "summary": "A gritty spy thriller directed by relative newcomer Daniel Espinosa, and a film that -- despite the occasional misstep -- ends up being a taut, suspense-filled ride."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 75,
      "summary": "Safe House rockets along, taking a familiar formula and making it work - hard."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 70,
      "summary": "Though Safe House may be too violent and nihilistic for everyone's taste, it does have several crackerjack action sequences."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 70,
      "summary": "Essentially and very effectively a rollicking smash-and-crash chase movie that happens to be surprisingly well acted."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2012
      },
      "score": 67,
      "summary": "Movies don't come any brawnier than Safe House, and all that chaotic mayhem eventually beats the plot to a pulp."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2012
      },
      "score": 67,
      "summary": "Compared with a superior potboiler like \"Salt,\" which messed with your brain in entertainingly far-fetched ways, Safe House is action-movie porridge gussied up into a less-clever-than-it-seems mystery."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 63,
      "summary": "Safe House has two powerful performances at its core, a hectic plot, a huge body count and a mild sense of déjà vu amid the pulse-quickening tension."
    },
    {
      "critic": "Glenn Heath Jr.",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 63,
      "summary": "It'd be unwise to dismiss Safe House as merely a clone of Tony Scott's manically inclined vision."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 63,
      "summary": "Director Espinosa shoots virtually everything in tight but wobbly close-up, and the human and vehicular combat often brakes right at the edge of visual incoherence. Just as often the brakes give out completely."
    },
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2012
      },
      "score": 60,
      "summary": "Tolerably exciting spycraft, but stuck with a see-through plot. Washington and Reynolds are watchable, but not exactly stretched by these roles."
    },
    {
      "critic": "Kate Erbland",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 60,
      "summary": "Safe House isn't the most original of plots - it feels like a loose amalgamation of ten other spy flicks - but director Espinosa infuses his production with some bold choices, both in terms of technics and twists."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 60,
      "summary": "It's a decent February movie that smartly extends Washington's God-on-the-run character."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2012
      },
      "score": 60,
      "summary": "Too often Washington is made to simply sit and observe -- which is not a fatal mistake because he is such a good actor that even then he's worth watching. Worse, though, at times he's gone altogether. That's not the only flaw in the fairly straightforward thriller, but it's the biggest."
    },
    {
      "critic": "Karina Longworth",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2012
      },
      "score": 60,
      "summary": "[A] scattered but not totally disagreeable CIA conspiracy thriller."
    },
    {
      "critic": "M. E. Russell",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 58,
      "summary": "There are several things to enjoy here. The use of motel service-industry code words by the safe-house staff is dryly funny."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2012
      },
      "score": 58,
      "summary": "Safe House does altogether too good a job establishing Washington as a seemingly unbeatable adversary: He brings so much gravity to his role that Reynolds seems hopelessly overmatched."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "Safe House may strike you as a brilliant movie, provided you've seen fewer than, say, 10 spy thrillers."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "Worse, Safe House asks us to believe that Ryan Reynolds can outclass Denzel Washington in the art of being a hard-ass. Not on this planet, baby."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "A movie with a double-crossing intelligence plot that's so generic it's an irritating intrusion in a lively chase through the streets and shantytowns of Cape Town, South Africa."
    },
    {
      "critic": "John Anderson",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "Safe House is a sturdy enough thriller, but one that consistently defaults to the less interesting of its two lead characters."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "Swedish director Daniel Espinosa isn't as adept at chase scenes as \"Bourne\" director Paul Greengrass: We sometimes lose track of who's supposed to be where and which direction the bullets are flying."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "I'm not getting the most of his (Washington) charisma or enough of that million-dollar dental work. I'm not getting the joy, and I miss that."
    },
    {
      "critic": "Ben Sachs",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "Espinosa never conveys any sort of perspective on the material, as Scott does through his obsessive attention to production detail; the stylization feels empty, distracting from whatever simple pleasures the routine plot (involving double agents and stolen microchips) might have delivered."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "Crash. Kick. Stab. Punch. Talk (briefly). Smash. Chase. Screech. Shoot. Mumble. That's the wearying pattern of Safe House. Had \"think\" been an action verb, the movie might have risen above the knee-jerk excitement of the second-tier, \"Bourne\"-style spy thriller. But it never does."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "The pacing is uneven, the frenetic action is rarely suspenseful, the dialogue is neither witty nor intelligent, and the anticlimactic endgame drags out to an improbable conclusion."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "Terse and understated, this is a spy vs. spy tale designed to minimize talk and maximize action, not at all a bad thing in movies but over-worked to near-exhaustion here."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "In contrast with the fragmented kineticism of Paul Greengrass' \"Bourne\" movies, there's no existential dimension to the shattered-glass aesthetic here; it's just raw, chaotic action, inelegantly shot and staged but no less unnerving for it."
    },
    {
      "critic": "Ian Buckwalter",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2012
      },
      "score": 40,
      "summary": "It was only a matter of time before someone made a Tony Scott movie without Tony Scott."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 40,
      "summary": "Good actors like Vera Farmiga and Brendan Gleeson show up to bust balls and bark expository dialogue with check-in-the-bank-yet? proficiency. Add in a couple of dully pro forma narrative twists to keep you awake in between shots of distractingly exotic South African scenery, and you've got a first-quarter Hollywood release par excellence. Meaning not."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 40,
      "summary": "Safe House is a twisted claw of a movie, a picture so visually ugly that, to borrow a line from Moms Mabley, it hurt my feelings."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 40,
      "summary": "Safe House devolves into unexciting action scenes that feel left over from the \"Bourne\" flicks and are peopled with cloak-and-dagger stereotypes."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2012
      },
      "score": 25,
      "summary": "All of which makes me sad about Denzel Washington's disillusioning participation. I forgive him if the money was irresistible enough to pay off a mortgage or put his kids through Harvard, but Safe House is total junk, and he is one of the producers."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 25,
      "summary": "Safe House is an idea for a movie. It's a few blustery gestures in the direction of a story, with five good actors doing their best, trying to hold up the barest frame of an idea, while investing the surrounding emptiness with all the truth they can muster."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "Is it a great film?  No.  Does Denzel once again prove he is one of the most amazing actor's of his generation?  Yes.  Ryan Reynold's is passable, but it really is Denzel's film and he is able to turn a good script into a very good one.  Worth seeing alone for Denzel's performance.  Loads of action, lots of fun.",
      "total_reactions": 5,
      "user": "werecar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "Knowing that the critics gave it a lukewarm reception, I went in with moderated expectations, and I was pleasantly surprised.  Reynolds is not the typical nubie (he's more deliberated, focused, and cerebral), and Denzel does his typical solid job as the dramatic heart and soul of the movie.  The look of the film is fantastic, and the action sequences are exciting. The conclusion could have used some work.",
      "total_reactions": 2,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 6,
      "text": "In a complicated deadly game of international espionage things are rarely what they appear to be. Take the case of Matt Weston (Ryan Reynolds), a young man who, for all intents and purposes, appears to divide his time between his adoring French girlfriend (Nora Arnezeder) and a South African hospital. But if one were to pull back the curtain they would learn that Matt is actually a CIA agent who spends his time watching over a safe house, an assignment of painfully tedious monotony. In the new action thriller â",
      "total_reactions": 1,
      "user": "garethvk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "The film provides the great acting of Denzel Washington and Ryan Reynolds' poor talent. Although in some ways the film is entertaining, in other respects doesn' t exceed expectations. Safe House is an inconclusive film.",
      "total_reactions": 1,
      "user": "rydermusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "This was a fine action thriller with some, um, really thrilling action. Now I'm just typing words. Words words words words words words words words words words words words words.",
      "total_reactions": 1,
      "user": "JLLoren"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "What else could be said about Denzel Washington? The man has started in AAA titles for most of his career. We all know he's very selective of the roles he chooses & better yet, the co-stars he surrounds himself with. From big names like Russel Crowe to Ethan Hawke. He's very particular. So when I saw that his co-star in this film was Ryan Reynolds, I thought \"Hmmmm?\" & let me reassure you people, Reynolds delivers! Ryan Reynolds plays \"Matthew Weston\" a \"house keeper\" which is an agent for the CIA in charge of an interrogation house in the numerous locations all around the globe. Weston's location happened to be in Cape Town, South Africa. His average day is pretty uneventful, until one Friday morning agents bring in \"Tobin Frost\" basically the black version of \"Ethan Hunt\" played so well by Denzel Washington. Now up to this point all you need to know is that Washington was brought into the \"Safe House\" which Reynolds is in charge, to be interrogated for something he holds \"within himself\". PS: I'm trying my hardest no to give out too many spoilers in this review, but its pretty hard not to. Back to my review. All of a sudden about 12 heavily armed men bust into the \"Safe House\" & the massacre commences. Now Reynolds is pinned to a corner, he knows they want \"Frost\" alive & that he will die in the gunfire unless he does something.... & fast. From there on out the film shifts into \"hyper-drive\" & never lets off the gas. I really enjoyed the fast action pace of \"Safe House\" but most of all I was SUPER impressed by the performance by Ryan Reynolds. Not to take anything away from Denzel Washington but the man is like a fine wine, he only gets better with age. Reynolds on the other hand, has had bad films like \"The Amityville Horror\" & \"The Green Lantern\" I thought this guy really couldn't redeem himself after that pile of crap. I stand corrected, tonight proved that a great actor can make an iffy co-actor step his game up to a much higher league. Reynolds not only kept up with Mr. Washington, he challenged him. Not an easy task when you're talking about Denzel Washington. In closing I'd like to recommend this film to everyone who's looking to have a great time at the movies & loves an action packed thriller. Because \"Safe House\" is the \"Safest\" bet at the  movies, so far this year.",
      "total_reactions": 1,
      "user": "Creeper5150"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "First things first.... this is an action movie.  Nothing more, nothing less.  I was amazed at the hypocracy of just about every critic who reviewed this movie (the first critics reviews I read were from James Berardinelli, Todd Mcarthy, and Justin Chang).  Those 3 critics (among others) praised the most recent Mission Impossible movie, when that movie was similar to this one.  Similar in the sense that Mission Impossible had a crap story (like Safe House) and was all about the action.  I can't understand why they loved that movie, but didn't like Safe House.  Safe House's action is completely believeable, and is very intense.  There are 6 legitimate action scenes, all of which are gritty and suspenseful, which is much more than I can say for that crap movie Mission Impossible.  Safe House is meant to be an action movie.  That was clearly the goal of the director for this movie, and they pull that aspect off beautifully.  Critiquing a pure action movie for a poor story is fine, but it's pretty much the same thing as knocking a drama for not being funny enough.  Go see Safe House for the action, and if that's what you're expecting you won't be disappointed.  Denzel hasn't kicked this much a$$ since Training Day.  His character may not be as interesting as it could have been (same for Ryan Reynolds), but they have a solid chemistry together.  The story is pretty average at best, and the writing/acting is average as well, but I have to give this movie a lot of credit.  Action movies RARELY have good stories or character development, and Safe House is no exception.  Still, Safe House's action is relentless and exhausting.  It was definitely worth my time and money to turn off my brain a little to enjoy it.  To hell with the hypocritical critics.",
      "total_reactions": 1,
      "user": "keep_yr_bias"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "I liked it - even though I knew going in the general premise, it was just well done, and actually believable. Which is more than I can say for Mission Impossible, and for the critics who panned this movie while praising that one, you are most likely in the pocket of the big studios - I call you out - foul! MI is so beyond reality that I can't even watch them anymore",
      "total_reactions": 1,
      "user": "renegadex"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "A very solid action thriller, Safe House looked a bit Bourne-esque to me, with the plot revolving around CIA, with it being corrupt. its agents betraying each other and some \"social stealth action\" with main characters evading baddies using crowds. Washington and Reynolds' performance is outstanding, the plot is gripping, and it's a really good movie overall.",
      "total_reactions": 1,
      "user": "RealMuthaF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "A great film. The movie will have you jumping out of your seat every 10 minutes. One of Ryan Reynolds best performances (which isn't saying much) but it was still an enjoyable performance by him. Denzel Washington has once again proved that he is one of the best actors of our generation. This movie is definitely a must see.",
      "total_reactions": 1,
      "user": "BG3"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "The film starts out fast and rarely lets up. I found myself rooting for Reynolds the entire movie and against Washington, of course until the end. Both actors played their roles phenomenally.",
      "total_reactions": 6,
      "user": "bigceebin4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "I love the movie safe house, and I seen this one in theaters when it first came out. I think Denzel Washington did an awesome job, as a CIA agent who went rogue, and while on the run, he had met Ryan's Character and he gave him some really great advise. He  told Ryan's Character to not be so trusting in those he's working for, because they will stab him in the back and they did. This is Denzel's very best performance, ever, yes better than training day. I think when the famous Oscar's are approaching and the nominees are chosen and the movies are selected, this should be on the Oscar's number one list of best movies, and I also think no one should turn their heads away from Ryan Reynolds who also gave his best performance. If this movie isn't consider an nomination for best picture, I will never, ever, ever watch another award show forever. Especially the boring and ever so snoring Oscars. But watching those  who you really want to win, will definitely living things up all together.",
      "total_reactions": 2,
      "user": "Lynette"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "Awesome Acting, Ryan Reynolds does an outstanding job is this movie. Great and realistic fighting scenes. Big Explosions! You get right into the story.",
      "total_reactions": 2,
      "user": "EiiteDonkey"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "If you are 20 years old and have seen 30 hot pursuit movies then this move will be fantastic. However, if you have seen 100 such movies in your life then this will be boringly formulaic. If you are wanting to see the stunning Cape Town, rather go watch a travelogue.",
      "total_reactions": 3,
      "user": "Farrel"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2012
      },
      "score": 2,
      "text": "Yuck film......I mean the acting is good and the action free flowing but the plot is completely devoid of any originality.  I love an action flick as much as the next bloke but it tried to be too smart and failed and therefore failed as a film......Dont waste your cash.",
      "total_reactions": 7,
      "user": "OllieWillie"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2012
      },
      "score": 4,
      "text": "Denzel Washington snoozed thru this formula copycat of Borne.  Not much to see here with a totally predictable ending.  Wait for this one on free TV if you must see it.",
      "total_reactions": 4,
      "user": "fantasy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "Ryan Reynolds works for the CIA \"hosting\" a safe house in Cape Town. It's dull work until Denzel Washington (rogue ex-CIA agent) shows up as a detainee. After they're forced to flee, there's lots of chasing, lots of fighting and lots of jerky camerawork that makes it hard to see what's really happening. Washington plays his usual cool character and Reynolds gets to be sensitive and insecure. The plot is predictable and the action is never special. Although it's never boring, it's in no way special.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "If you haven't seen any of the \"Bourne\" movies, then you might enjoy this one.  The plot is completely stolen from \"Bourne\" which made the movie totally predictable for me.  Ryan and Denzel give it their all, but their performances alone couldn't carry the film.  I'm also getting more and more irritated at directors that insist on using the \"shaky camera\" technique.  Will this new shaky camera fad ever end?  I liked the locale where it was filmed but hope there is more originality if the series continues.",
      "total_reactions": 2,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2012
      },
      "score": 2,
      "text": "I wanted this film to be good but it was just exhausting. Denzel's scenes were left on the cutting room floor because they set him up as the master manipulator and then no manipulation. For some reason it turned into a Ryan Reynolds movie running around reacting. This isn't a Denzel film it is a Green Lantern without the costume set on earth without the aliens.",
      "total_reactions": 3,
      "user": "nameless"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "You donâ",
      "total_reactions": 1,
      "user": "CitizenCharlie"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2012
      },
      "score": 3,
      "text": "Good acting I guess. Its just that the movie sucks . Its no Jason Bourne. Its not even complicated. Its weak. Amazing how even with such good actors a script like this seems to slide past everyone.",
      "total_reactions": 2,
      "user": "MorriBey"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2012
      },
      "score": 1,
      "text": "I can overlook a lot of flaws for a good action flick.  But this movie is so flawed all the way through, there is nothing left to like.  How some reviewers can think that \"documentary style\" camerawork enhances filming is beyond me.  \"Safe House\" is shot like a shaky hand-held home movie -- maybe they did use a hand-held camera?  How else could they have gotten all the jiggling and swinging up and down, back and forth?  It's often hard to tell who's fighting, much less who's winning and how they're doing it.  I guess the shakiness and jiggling are meant to keep the audience on edge, but to me it's cheating to try to create effects that should come from the action with just an annoying, uneven camera.  It did keep me on edge, but in an irritating way, not an entertaining way.  This jiggling is kept up all through the movie -- not just in the chase and fight scenes, but also in offices and phone conversations, the camera just can't stay put.  There's not much of a plot, either, but this isn't essential in an entertaining action movie, which this definitely is not.",
      "total_reactions": 4,
      "user": "catzzz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "I was pumped to say that this is one of the best Ryan Reynolds films I've ever seen. Worth watching since we get to see Denzel and Ryan act with a load of action scenes.",
      "total_reactions": 1,
      "user": "ApocalypseGamer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "It's not like u won't enjoy it at all, but this talented combo could hv produced so much more w a helping of originality & innovation, instead of the formulaic, lone wolf vs. the big bad intel organization.  U've seen this b4, & probably done better.  If u think u know how it's going 2 turn out, ur right, u do.  Unless ur just a die hard Denzel fan, I'd skip this one.  Re-watching Hurricane would b an improvement.",
      "total_reactions": 2,
      "user": "MeanJoeGreen"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "It was a solid action movie that is helped by the Bourne like action and solid acting by Reynolds and Washington. However you can't help but feel that it's a Bourne rip off due to it's similar plot involving CIA corruption and similar action style. Also, I felt that the near 2 hour run time was pushing it far too much for a film that could have been told in an hour and a half.",
      "total_reactions": 1,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "In the beginning it starts out as an action filled  thrilling movie, but than it loses its excitement and it becomes a simple action movie which we have tons off.  The good actors performance like Denzel keep the movie running and stops you from running away screaming \"HELL NOOOOO!!!!\".  No more to say and i was still generous with the 3/10",
      "total_reactions": 2,
      "user": "deamonhunter"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "Good Movie. Good Story. Good Cast. Good Action. Excellent film, not something I would see if there was another 'better' option on, but there wasn't and I enjoyed it. :)!",
      "total_reactions": 1,
      "user": "orchid"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2012
      },
      "score": 2,
      "text": "What a disappointment! I don't see how Denzel Washington could associate himself with such a low-quality production",
      "total_reactions": 2,
      "user": "JAL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "Denzel Washington is a charismatic actor capable of delivering powerful performances.  In Safe House he brings us yet another solid performance, however not in the class of his Training Day stunner.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "A well made film with some nice stunt work and an awful lot of fight sequences; maybe a couple too many IMO. The performances from both Denzel Washington and Ryan Reynolds were pretty good, although nobody was particularly stretched. Plot-wise, I guess it was ok but it didn",
      "total_reactions": 0,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "I loved this movie. Denzel Washington did a great job acting, but I thought Ryan Reynolds actually out-acted Denzel in this movie. It started out very fast and kept going with the action. The plot wasn't the best but it was interesting and I'd like to see a sequel. I thought that the ending could have had more of a bang, but I was satisfied at least. Good solid movie.",
      "total_reactions": 0,
      "user": "TheChaser1985"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2012
      },
      "score": 6,
      "text": "So full of gun play that I swear I left the theater with GSR and blood splatter on my clothes.  Still, Reynolds and Washington made for an interesting odd couple approach to the usual paranoid spy-based shoot 'em up. Sometimes you're in the mood for one of these films... Had they cut some of the endless car chasing stuff in favor for the inner workings of how a safe house works? It would have given us a little breather.",
      "total_reactions": 0,
      "user": "hollyv"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "CIA agent Matt Weston (Ryan Reynolds) is stuck in a dead-end position looking after a safe-house in Cape Town, South Africa. When Tobin Frost (Denzel Washington) is brought into his custody he is given an unexpected chance to prove himself to his superiors.",
      "total_reactions": 0,
      "user": "drlowdon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "52 is an astronomically low score for this movie. I don't know if the critics watched the same movie as i did, but the movie i saw, titled Safe House with Denzel Washington and Ryan Reynolds was a damn good movie. Ryan Reynolds gave the performance of his career, i can now label him as an actor, after such horrible films like the change up, and the very disapointing green lantern film adaptation. Denzel Washington was of course Denzel Washington, badass, and another perfect performance to go in his book of superb films. Safe House will have you on the edge of your seat and throw you onto an action-packed ride you will love for sure. It will have you rooting for the good guy and the bad guy at the same time. It's pulse-pounding, action-packed, and VERY exciting. If you appreciate good movies, you will LOVE this one, go see this now, you won't regret it. 9/10",
      "total_reactions": 0,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2012
      },
      "score": 4,
      "text": "As a thriller lover i gotta say this movie really disappointed me. Nothing new . Seeing many films with same pattern was this was probably the worst. The story sucked so much. It wasn't like other Denzel Washington films.  I loved all his films but this one was him worst . Not his acting though . He did fine , so did Ryan . But the story and everything else just sucked . Direction wasn't that good either . It seemed just like a 2 hours long Bad TV Action Drama.",
      "total_reactions": 0,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2012
      },
      "score": 4,
      "text": "Not too much to say about this one ...",
      "total_reactions": 0,
      "user": "YossGold"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "Can't really go wrong with a Denzel Washington movie, even one as predictable as this one (this one is exceptionally predictable).  Ryan Reynolds does another decent job in a non comedic role.  The plot could have been flushed out better and the story could have been more original.  I think a monkey could have penned the story on this one: corrupt CIA agents double cross each other and innocent guy is caught in the middle---hope thats not a spoiler--considering i think its the theme of about 70 other movies.  The director does do a great job with pacing and making the movie particularly intense.  Not one you will fall asleep on.  Worth the rental or two hours on HBO.",
      "total_reactions": 0,
      "user": "nightblade00"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "Denzel Washington is one of the best actor out there. He elevates what can be considered a typical spy caper, action flick into something a bit more.  But this film has been done before, and its called 'Training Day'. Once it focuses on its characters, Safe House is pretty good. But there's just too many generic action set pieces in between.  Ryan Reynolds again is saved after gosh..how many flops he's in. He's a GREAT supporting actor, but not a good leading man.  Don't expect this film to rock your world or anything...",
      "total_reactions": 0,
      "user": "dharma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "According to cinemas, when spies get in trouble, they always have assortments of safe houses just waiting to be temporarily populated, free of all pursuers at least until the next scene. As Safe House would say it, instead of only a vacant house, there's actually someone watching over the house called housekeepers and not always a thrilling job. Matt Weston (Ryan Reynolds) is an agent in charge of a safe house in Cape Town who is unsatisfied with his low ranking job. It will soon change as Tobin Frost (Denzel Washington), a high value target for selling vital information is captured and brought to his secure residence.",
      "total_reactions": 0,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "The acting was phenomenal and the fighting and action sequences were really well done. Unfortunately, there's also a plot and it was terribly cliche from beginning to end. This movie felt almost like they took the stories of all the other movies in the genre and took all of the common denominators and made the plot based off of that. I also wasn't a fan of the way the movie was edited together. The massive amount of quick cutting didn't make the movie more intense, it just made it annoying to watch. There was definitely some entertainment value here but the flaws stood out too much to really get entrenched into the story, which was pretty weak anyways.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "Denzel Washington is one of my favorite actors, and anyone who follows him knows that he is pure intensity. For that reason, he is usually best paired with someone who is charismatic, but in this film, he's paired with Ryan Reynolds, another intense actor, leading to a very straightforward and inflexible film. Safe House is your typical C.I.A. inspired action film, that features a wanted traitor turning himself in, in order to escape the men he's doubled crossed. The names and places are different, but the story is the same, lots of fighting and corruption, traitors and double agents, it's nothing new. The intensity in Safe House is just off the charts, as there isn't one second of comic relief. The movie starts intense and just continues that way until the end, which really does an injustice to the always strong performance of Washington. The fact of the matter is that this film could have been an interesting one, had Washington and Reynolds had any chemistry whatsoever, but they were basically the same person, on opposite sides of the table. Chemistry in a film like this is really everything, even in a film like Unstoppable, another straight forward and highly predictable film, it was entertaining because of the chemistry between Washington and Chris Pine. All in all, Safe House is an average film, without much of a supporting cast. It's two hours of chases and gun battles, over the same stuff that all these other films are based on. It's a textbook example of an action movie, with nothing else. It is forgettable and isn't unique in anyway, just the same thing you've seen a million times before.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "It was nothing special. Entertaining, for the most part. Denzel Washington's character was an interesting one, and he also played him well. I kind of saw the 'twist' coming, as I didn't expect Denzel to be the bad guy. Overall, it's an OK movie.",
      "total_reactions": 0,
      "user": "SHO1BANG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "Decent story and acting, ruined by intentional technical carelessness. Shakycam is evident throughout the movie, continually reminding you that there is someone holding a camera. Film grain, of all things, is everywhere. Several scenes or actors are shot completely out of focus. This sort of hipster-esque discarding of any decent filmmaking abilities has destroyed many recent movies, this being another victim.",
      "total_reactions": 0,
      "user": "dwforbes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "I don't know what I expected from this film, but this definitely wasn't it.  The best way I can describe it is that the writer/director lacked confidence in the story (for good reason, it's pretty bland) and tried to overcompensate by trying too hard to be clever.  The acting is passable, but there was no real sympathy for any of the characters, and I really didn't care what happened to any of them.  Disappointing.",
      "total_reactions": 0,
      "user": "Erika22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "Angels:",
      "total_reactions": 0,
      "user": "sesostris"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "I always love denzel washington. He plays a great hero character,and also makes a great bad guy. Here he's some of each, which is interesting to watch, but also confusing to the plot. Most of the movie i felt like i was trying to catch up with what was going on, between the hyperactive shaky camera chases and spy technobable..lots of people talking about 'clearences' 'black ops' etc..by the end of the movie you wonder what it was all about, and why the characters felt it was so damned important. You wish a movie like this had something a little more directly threatening  hanging in the balance, like say, a nuclear bomb or poisin gass cloud or something. Safe house is mostly a bunch of shadowy figures barely identified running around killing each other for some information on a disk of some sort, which could be embarrasing to some other people we don't know about, and therefore may or may not be worth money. At the end of all that chasing and bloodshed the payoff seems so blandly inconsequential you wonder how so many people had to get killed in the first place. And speaking of the killings,  the director seemed fixated on cheap jump scares over and over. If you're watching the movie and two people are speaking casually, watch out, there's a shooting coming. So many people were surprised by bullets when they weren't looking that i left the theatre thinking they could have alternatively titled this !!BANG!!!: the movie.",
      "total_reactions": 0,
      "user": "smirky"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "I've been to the movie theater, and I just got home from watching Safe House, and I actually thought it was pretty good. Judging from how good I felt the movie was, I was kinda shocked to see it only scored 52 here on metacritics, so I decided to register and give my 2 cents. The movie on its own was really good, I liked the plot, the way the movie was shot (the shaking camera, despite seeing people bad mouthing the movie because of this), but the actors really helped to lift Daniel Espinosa's work - both Ryan Reynolds' and Denzel Washington's acting.",
      "total_reactions": 0,
      "user": "Ahlgreenz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "Yes, many of us have seen such flix before but this is somehow refreshing in its gritty authenticity. Lots and lots of fighting with several twists and turns accentuated by key 'splosions, it's a good time for guys - keep the kids and chix away.",
      "total_reactions": 0,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "Safe House surpassed expectations- due primarily because of the effortlessly charismatic work of Denzel Washington. The Cape Town locale was a highlight, the ultra-kinetic, frenetic camerawork reminiscent of Paul Greengrass films. The supporting cast is excellent as well (Brendan Gleeson, Liam Cunningham, Robert Patrick, who of course plays an amoral character, to name a few), even if their roles vary in significance and are alloted limited screen-time, their mere presence add to the enjoyment of the film. The opening chase through Cape Town and the infiltration of the first designated 'safe house' are well directed and thrilling sequences. Safe House is a cut-above as far as action films go. 7.5.",
      "total_reactions": 0,
      "user": "JacobDunstan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "A really simple film, not is for anything, but when I watch the trailer I think that Safe House be like the bad action films of Jason Statham, but is a lot of better, Safe House is an okay film, no is bigger but is okay.",
      "total_reactions": 0,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2012
      },
      "score": 6,
      "text": "It doesnt have a substantial plot and channels a lot of Alias spy drama done years ago but I do think that the movie is very well acted by Ryan Reynolds showing great emotion and Denzel Washington showing great wit.",
      "total_reactions": 0,
      "user": "MattJenki"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "Denzel Washington and Ryan Reynolds are known A-Listers that do their part in this movie, but yet even they cannot hide this failed attempt of a Bourne-like thriller. The plot lacks the creativity of anything that has been done before and every scene in the movie besides the action scenes are not perfected to keep the audience interested at all. It's hard to imagine a film like this being boring, but such is the facade when the characters are not developed enough and you feel nothing when Ryan Reynolds says a tearful goodbye to his girlfriend.",
      "total_reactions": 0,
      "user": "racketracer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "This film was decent. The acting by Denzel Washington and Ryan Reynolds was pretty good and the action sequences were the best part of the movie. The script played a little thin on the edge but other than that you should see this movie.",
      "total_reactions": 0,
      "user": "a7xfan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "Not a masterpiece by any stretch but I enjoyed the performances of both Denzel and Reynolds. Denzel was especially good as the jaded black ops veteran gone rogue while Reynolds had the enthusiasm of youth down. The action was good but ultimately the twists were a bit predictable.",
      "total_reactions": 0,
      "user": "PTamp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "Set in Cape Town, Denzel Washington and Ryan Reynolds are the two CIA operatives, past and present playing cat and mouse with each other in Daniel Espinosa's first major US film. The film was shot in location in Cape Town, and this was obviously something that Espinosa felt keen to impress on the viewer, who is reminded this perhaps once too often with stunning shots of the area. It almost felt like the location was selected for this purpose first and the plot made to fit second. Equally strong performances from both Washington and Reynolds keep the viewer engrossed throughout the film in between the hit and miss action sequences until the slightly formulaic ending. Overall a fairly routine spy thriller that ticks all the boxes without setting the world alight.",
      "total_reactions": 0,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "Pretty good movie. Action was cool. Story was solid. No real complaints. Washington was awesome as usual. No need to get into the details. See this movie if you like action, CIA, or spy movies. Acting makes the movie worth it.",
      "total_reactions": 0,
      "user": "theoffice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "this film was something i wasn't expecting to be good but it surprised me quit a bit. the acting was good and the writing of the scrips was OK but the escaping should of been worked on and the fighting scenes to short. def give it a 7.5 but not as good as it should of been. this is short review but over all its something to see if u like watching these types of movies.",
      "total_reactions": 0,
      "user": "RedMoon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "In some instances, having a good idea of how the movie is likely to go can be a killjoy; then, all that can make that movie watchable, if it indeed has a predictable ending, would be very good and relentless action, in the case of action thriller, or extremely interesting characters in a psychological drama. This movie is by no means the latter, but as an action thriller, the former, it does provide almost non-stop action, once the basic prologue scenes are done. Denzel Washington plays the role of Tobin Frost, a veteran intelligence operative who is wanted as a traitor by the US, since he went off the grid ten years prior. He resurfaces after getting his hands on the most incriminating bit of information, the kind that would ruin the careers of high-ups in international intelligence, including the CIA. Not since his role as Creasy, in Man on Fire? did I find myself cheering for the bad guy, who, after all, is not as bad as the system. Frost seeks refuge at a US consulate in South Africa, to dodge assassins; he is moved to a safe house where the CIA hopes to extract information from him. The minder of the safe house is Matt Weston, played by Ryan Reynolds; he was bored out of his mind until he got call into action. He has all the skill sets to be an operative and has been preparing for that. When the safe house is besieged by the same assassins, Weston is left to deal with Frost. All the while at CIA headquarters, the team that heads the safe house operations starts budding heads with other CIA sections and from that point, the story becomes rather predictable. Yet, the characters of Weston and Frost, in addition to those of Barlow, played by Brendan Gleeson, and Linklater, played by Vera Farmiga, sort of keep you interested in watching the rest of the action. The supporting cast of Farmiga, Glesson, Sam Shepard, Robert Patrick and Ruben Blades certainly adds a bankable element to the production. Washington and Reynolds do justice to their roles; their characters are compelling enough.There are no big surprises plot-wise, but it's actually that tried and true paradigm of corrupt security intelligentsia that we find comfort in seeing again in the throw of much action. Why make up a nonsensical plot when we are already sold on a given premise? I got what I expected and watched it for that reason; I'd be hard pressed to be too negative. I'll go out on a safe ledge and recommend it to anyone who enjoyed Man on Fire.",
      "total_reactions": 0,
      "user": "HomeReviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2012
      },
      "score": 4,
      "text": "very poor effort and I kept nodding off as the plot was poor.... also the camera work is truly awful but denzel is good as always ....... ryan reynolds not too bad either ....",
      "total_reactions": 0,
      "user": "mickser50"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "Safe House is a nicely crafted action/thriller, whose style is reminiscent of the Bourne series, but ultimately the frenetic action sequences and unspectacular plot make it a mere exercise in genre rather than a stand out movie. Washington and Reynolds do fine work here, but they aren't given much chance to actually take it further than any standard star vehicle. And when the film is over, there really isn't any emotional resonance, just some feeling of exhaustion because the action scenes themselves seem uninspired and tiring, rather than exhilarating and pulse-pounding. It's not that Safe House is a bad movie. It is far from it. It is merely unspectacular.",
      "total_reactions": 0,
      "user": "TheDRauch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2012
      },
      "score": 7,
      "text": "Director Daniel Espinosa adds nothing new to Safe House that you haven",
      "total_reactions": 0,
      "user": "BryceHoogland"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2012
      },
      "score": 7,
      "text": "It's not the best action movie out there, but it manages to do it's job. Keep you, the viewer, entertained for 2 hours. It's faults: A very boring first half.",
      "total_reactions": 0,
      "user": "snazzyjuice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2012
      },
      "score": 7,
      "text": "Saw Safe House over the weekend. It wasn't a ground breaking action movie but it was still really good. I liked seeing Reynolds not as the bad ass guy with all the answers but as the rookie who had no field experience. It was fun watching him become more confident in himself and slowly getting to the same level as Denzel. Real star of the movie was South Africa though. It looked amazing. If they do a sequel I think they've set up a much more interesting plot than they had with this one.",
      "total_reactions": 0,
      "user": "CBeckman25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "Serviceable espionage action-thriller with a first-rate cast. It brings nothing new to the table, but it is an enjoyable ride. Denzel, as always, is enough of a reason to watch this.",
      "total_reactions": 0,
      "user": "Seriosity"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "A solid thriller that could have followed the same plot and just as easily been a solid comedy. Midnight Run anyone? The biggest issue I have with Safe House is also the most confusing one. Why is Denzel Washington, one of the most talented actors of his generation, wasting time on this half rate USA Network worthy CIA flick?",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Good action movie. Do not expect philosophy, only pure action.  Both actors played extraordinary.",
      "total_reactions": 0,
      "user": "cilincescu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "I passed on this to watch a silly movie Rango a week ago. I watched it this week and it turned out to be a decent movie but didnt make me feel bad for passing it up the week before. I geuss what Im trying to say is if you have another option don`t be afraid to go with it.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "Safe house is one of those movies no one can really hate or dearly love, but it's enjoyable none the less. With a good story and interresting characters, this makes one of the better action movies from its year.",
      "total_reactions": 0,
      "user": "Duskspark"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "An exciting and well acted film.  Denzel Washington gives his regular strong performance and Ryan Reynolds who is hit and miss in this case it is a solid double.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2013
      },
      "score": 5,
      "text": "The movie is okay, but it seemed a little bit overstuffed, like it was trying too hard to be more than it is. But Denzel Washington plays a CIA agent gone rogue pretty damn well.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "22/11/2013",
      "total_reactions": 0,
      "user": "scottyb37"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "Tobin Frost: \"I'm already in your head\".",
      "total_reactions": 0,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "With a small amount of tweaking, Safe House could have been a knockout thriller. Instead, we have a film that shares the same notions as my school report cards: ' ...has potential, just needs to focus'.",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ]
}