{
  "mc_avg_user_score": 6.4,
  "mc_metascore": 65,
  "mc_mixed_rating_frequency": 146,
  "mc_movie_name": "Salt",
  "mc_negative_rating_frequency": 50,
  "mc_positive_rating_frequency": 249,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "Like \"Jerry Maguire\", \"Salt\" could have been the usual blockbuster with a obvious script/formula if it wasn't for Angelina Jolie's surprisingly good performance.",
      "total_reactions": 4,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2010
      },
      "score": 6,
      "text": "Jolie is oustanding and the action is passable, but overall, Salt is an amplified action thriller trying so hard to be something more profound that it does end up being trying indeed.",
      "total_reactions": 1,
      "user": "FitriAmirrol"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "This movie has alot of action  but it wasn't as good as i expected. I thought that this was going be one of her best movie, well i was wrong. This movie isnt that good. It has a lot of action but it wasnt action that caught my attention and I knew what was going happen since the beginning. The screenplay was okay. They could have did a better job on it. I love Jolie but this movie wasnt near one of her best.",
      "total_reactions": 1,
      "user": "iamtrent424"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "The more we run, the more they chase. It is what happenned to Evelyn Salt. Since Mat Damon BOURNE IDENTITY (2002) which is using more advance believability approach in runaway espionage tale, now everybody wants to be Bourne by running, jumping, shooting, fighting, car-chase, motorcycle-chase, you-name-it and it all happenned in one action-packed. Couple examples which using the similar patterns are: John Travolta FROM PARIS WITH LOVE (2009), Tom Cruise KNIGHT AND DAY (2010), Ashton Kutcher KILLERS (2010) and now it is Jolie turn. The story follows Evelyn Salt (Jolie) who has been instant-accused as a Russian spy who may be able to jeopardizing the national security. The Director is Phillip Noyce, the man behind THE BONE COLLECTOR in 1999 (also with Jolie). The camera angle is dynamic, especially in action sequences. Yes, the movie is full of twists and turns, even sometimes the story just go by itself without proper explanations, leaving too many questions and missing links. That is the uniqueness of the plots! The story is intriguing. It is successful to make us stay put in our seat by expecting what is going to happen next. To let Jolie fuses into action adventure like thiz is like releasing the fish into water, it is what she does best. Jolie is still the focus, shines among her mysterious partner (Liev Schreiber) and plain-straight boss (Chiwetel Eijiofor). If someone complains about how absurd thiz narratives has become, it is simply arguable and it all happens to every modern action movies. One thing for sure, Jolie is back with some kiss-ass moves, to show us she is definitely one of the most comfortable action heroines in our time. Thiz SALT is happened to be sweet more than you think it is.",
      "total_reactions": 1,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "It's true. I'm an Angelina Jolie fan for all the wrong reasons. For my taste, she is at her best playing an action heroine and oozing sexuality. Make it a spy thriller and you can pretty much bet that I'll be first in line. In my opinion, there are two ways to evaluate any film. You can consider its technical elements and the precision of its actors, or you can just ask yourself if you enjoyed it. Well, I'm going with the latter this time, and I enjoyed the hell out of Salt.",
      "total_reactions": 1,
      "user": "sailoraide"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 4,
      "text": "There was a lot of action, as well as twist and turns. Angelina Jolie is a tough ass, as usual, but while salt was definitely entertaining to watch, the storyline was a dry, done, and out-dated. I mean Russian spies in 2010?!? Come on... It left a lot to be desired.",
      "total_reactions": 1,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "(Que deep, gritty, movie-trailer-guy voice) \"This summer ... Bourne has had a sex change ... and he's making the same movie like before ... but not so good\"",
      "total_reactions": 10,
      "user": "mark"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2010
      },
      "score": 5,
      "text": "Don't give me wrong, this movie had a lot of action. But it was a little bit confusing and kinda ridiculous.  For a minute, she's a Russian, then she's the good guy and all the way around. It's that kind of movie that you don't want to see again. The only fun part of the film were the actions scenes. The rest was non-sense crap.",
      "total_reactions": 4,
      "user": "scrieciu"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 3,
      "text": "The entire movie builds up to the final twist ending that offers very little payoff. The movie is simply not enjoyable. It started out promising, and had the potential to be so much more, but really falls short. It has a few decent scenes, but it's definitely not worth your time.",
      "total_reactions": 3,
      "user": "AJackson729"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "This is my first review for metacritic, so I'm sorry it's negative. This movie made me feel old.. In the first 40 minutes I wondered what the point of all this running about shouting was. It all just seemed a bit silly and pointless. In fact, frighteningly it reminded me of a Bruckheimer film where running about, shouting, leaping onto and off things with lots of explosions and impossibly gorgeous women are stock in trade. Although I have never been a Jolie fan particularly, I kind of thought she was respected as a serious actress. Here, she looks like Megan Fox's auntie. This movie may have salt but I guess I was looking for a little balsamic dressing.",
      "total_reactions": 3,
      "user": "ThatLuxton"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "Angelina is in her element and a tour de force. Thoroughly enjoyed this flick -- impossible plot and all. They tee'd it up and I can't wait for Salt 2.",
      "total_reactions": 6,
      "user": "Mangogrove"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2011
      },
      "score": 0,
      "text": "I've not HATED a movie soo much in a long... Strike that... EVER! My intelligence was under as'salt from the first to last frame. I will admit that my inability to supend disbelief when my b.s. meter is pegged is my hang up but,  I was insulted for having seen it. What a steaming pile.",
      "total_reactions": 2,
      "user": "gunnyart"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "One of the worst action movies I have ever seen. It was like watching very cheap old Hong Kong made fight \"masterpieces\". I was laughing at myself at the end that i waisted my time and money for this. No Plot no engaging acting not even little humor absolute rubbish from start till finish. The only puzzling is such a high score in both Critics and Users reviews. For those how actually understand the art of movie making DO NOT BOTHER. Have a good lunch instead.",
      "total_reactions": 2,
      "user": "parenekau"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "I don't understand the low ratings some movies get because for my money this was the best of it's kind this year. I'm not a Jolie fan, like anything with DiCaprio and a couple of others their name makes me think twice before going to see any movie they're in. But she did a great job here with a story that could have been far worse than any 24 script. The sleeper premise is far-fetched but if you can get past that it's a very entertaining film with more going for it than stunts and action. But since it's a summer movie there is plenty of both. I guess we need a break from reality and a trip back to the bad old Cold War days was almost a relief. I saw lots of happy faces leaving the theater after this one.",
      "total_reactions": 5,
      "user": "miked"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 3,
      "text": "The worst movie I've seen in a long time. The script isn't well thought out it's extremely sporadic at the end you just dont even end up caring. This movie is poorly executed how can somebody take that much of a beating without a scratch? me and my friend were the only people in the movie theater to see this and we both can agree it was a major waste of time and money.",
      "total_reactions": 3,
      "user": "Colossus"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "This is the most ridiculous movie of all times, is the worst action movie that I've seen. Simply it is so absurd, so meaningless, so stupid. I wasted my time and my money",
      "total_reactions": 3,
      "user": "Curioso"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "It was a high-octane action film that was throughly entertaining. The plot was absurd at times, but the cast makes it intruiging enough for you to invest on all the B.S. happenning, especially Angelina Jolie. She is great as always, and she really owns the character of Evelyn Salt. A 7.5/10.",
      "total_reactions": 1,
      "user": "Harbinger"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "Really enjoyable film.  Paced well, flashbacks make sense, motivations are clear, action scenes are not fully believable, but fun none-the-less.  Jolie is a splendid actress, Liev Schreiber is a fine actor and the rest of the cast was very good.  Many movies suffer from inattentive casting, but this one was spot on.",
      "total_reactions": 1,
      "user": "lkusa"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2010
      },
      "score": 3,
      "text": "A film that in the middle makes you to watch the clock all time does not worth the money or the time.",
      "total_reactions": 1,
      "user": "Attricus"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2010
      },
      "score": 2,
      "text": "All movies need to be reviewed relative to their prospective audience.  If one reviews \"White Chicks\" for example, one has to be aware of the movie's intended purpose and place in the minds of its audience.  With that in mind, even as the archetype summer blockbuster with a shallow plot and enough explosions to run a demolitions company; Salt was deliriously unbelievable verging on the parodistic.  There so many better summer movies to see, explosion and shallow plot and everything.",
      "total_reactions": 1,
      "user": "MovieDoc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2010
      },
      "score": 2,
      "text": "At the very least you can count on Ms Jolie's beauty to get you through a film, right?  Sadly as it was with Tomb Raider her looks alone could not do the trick.  Instead the close shots of her seemed patronizing with respect to her cardboard acting.  Everyone in this film was cut in 2D and I found very little engagement.  That's just the acting, the plot and action sequences I thought were even worse.  Don't get me wrong, I love suspending my reality for a few hours, but this is best done when they have engaged me in a story where the people's emotions are related to the protagonist's plight.  I can turn my brain off like the rest of them and watch a summer popcorn flick and have very little standards in this regards.  That said Salt did not even make that mark.",
      "total_reactions": 1,
      "user": "campbell_group"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2010
      },
      "score": 3,
      "text": "I did not like this movie. It was unbelievable in so many instances. There was very few parts of this movie I enjoyed. If you want to make an action movie way over the top stop using aging stars a perfect example was Die Hard 4. I read these reviews but some how don't believe it deserves the score. I like Jolie but believe all her films are rubbish (Except original sin back in the day.)  Mindless unbelievable action and that ending....",
      "total_reactions": 1,
      "user": "kris2fur"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2010
      },
      "score": 3,
      "text": "Despite Roger Ebert saying that this film has large enough holes in the plot that you could drive the whole movie through them, metacritic assigned his review a score of 100. Maybe this can give you an idea of why this whale of a film has achieved its metacriic score of 65.",
      "total_reactions": 1,
      "user": "cyclecrit"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2012
      },
      "score": 1,
      "text": "I simply can't believe the favourable reviews for this derivitive Female-Bourne nonsense. The stunts, fights and set pieces are utterly ludicrous, as is the plot - none of which makes ANY sense if you think about it for more than a minute (an example: we are expected to believe that a woman will watch the man she loves die horribly in order to maintain her 'cover'  when she has within her power the ability to take apart methodically the men who are holding him hostage and cover her tracks in the process? Another example: Salt displays Bourne's preternatural foresight, but didn't manage to see ANY of this coming until she was 'activated'/set-up?). Obviously the filmakers have circumvented this by simply not giving the audience an opportunity to think about the plot by freneticly jumping from one death-defying cliff-edge punch-up to another for nearly two hours. This is a film that requires you to simply turn off your brain as we are expected to believe that an anorexic-looking waif of woman can outwit the Russians, the Americans and shoot, karate-chop and punch her way through what, at times, seems like the entire US governmental apparatus, intelligence services and military complex. This film is so over-the-top it's dissappeared into the stratosphere - but not in a good way.",
      "total_reactions": 1,
      "user": "Famousdog"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "This movie has plot holes the size of Manhattan, is believable as the easter bunny, but apart from that, its a fairly decent action movie, of te \"summer blockbuster\" kind. Essentially a popcorn flick, don't see this if you're looking for an intelligent, well-contrived plot. The comparison's with the Bourne movies are not good, mostly because the Bourne movies wre a lot better. Nonetheless, if you want to see a mindnumbing action movie this one does nicely.",
      "total_reactions": 2,
      "user": "M_Alex"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "If you simply miss seeing Angelina Jolie on the big screen, this movie is for you! She's like a breath of fresh air. The movie's a reminder of her strong presence, professionalism, and daring nature. But you may ask what about everything else in the movie? Umm, did I mention that Angelina Jolie is in it? She rocks, and that's really all that matters in this movie.",
      "total_reactions": 1,
      "user": "AaronM"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2010
      },
      "score": 8,
      "text": "When somebody accuses her of being a KGB sleeper agent, Evelyn Salt goes on the run and attempts to clear her name. But it becomes somewhat clear that Salt is actually a sleeper agent and was trained by russians when she was very young. But as a trained operative, Evelyn Salt has some ideas. It quickly turns into a plot that has many twists and I was impressed by how Salt kind of became the new Bourne, just by being able to do something quickly and the sharpness of it. With Angelina Jolie, it also provides the film with slight seduction but doesn't actually make the film better. What maked this movie interesting to watch is what seems to be million dollar question is \"Who is Salt?\" By the end no one knows for sure, and ends on a perfect cliffhanger that sets the stage for a Salt 2. The movie is intense and action packed from the start and definitely one of the best of the summer.",
      "total_reactions": 1,
      "user": "Film_Fanatic_15"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2010
      },
      "score": 3,
      "text": "Salt's basic and predictable plot really undermines the film's potential to do more with its lead role, Angelina Jolie. Though the star gave it all she got playing a Russian spy, she wasn't enough to save the film from its wrong pacing style and ridiculously bad plot. Being trained as a Russian spy since she was a little girl, Evenlyn Salt lived a secret second life all this time. She's married and has a dog. But she worked in the CIA, so I guess that's something. Given that Angelina Jolie played the role, we have high expectations that she'd pull it off with lots of dramatic scenes. And that's exactly what we got. From the moment that she was being tortured in North Korea to the moment when she killed her spy partner, she was great. But given the fact that every spy movies starts with an undercover life and being captured at the end, Salt adds nothing new to the genre.",
      "total_reactions": 1,
      "user": "OscarPicks2010"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "First before I review this movie can someone tell me who's team she's on. I'm sure she switched sides at least ten times during the movie, which in case you were wondering made the movie a little confusing. The action I like and at least she always switched sides with a bang or a assassinated leader. Although I'm afraid they made a mistake trying to make another movie. First of all what is the title going to be? Pepper? Rosemary? and second I'm not sure if I can stand any more quadruple agents.",
      "total_reactions": 1,
      "user": "Creviewer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2011
      },
      "score": 2,
      "text": "Yuck. Ebert says it has holes big enough to fly a 747 through (or something like that) and still loved it? The execution (pun intended) of the plot is so inane it's insane. Jolie (how could anyone that beautiful be less beautiful as a blonde?) is, what, the Terminatrix? The Bionic **** Goddess of Geopolitical Revenge? Please please please let there not be a Salt Two!",
      "total_reactions": 1,
      "user": "10sne1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2013
      },
      "score": 1,
      "text": "Jolie kicks everybody 's ass with her 50kg/110 pounds, while doing totally impossible stunts. That sums it  all up...Oh was there a script somewhere? I did not notice.",
      "total_reactions": 1,
      "user": "oliver1h"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "Plot was outdated but fast-paced action didn't allow you to dwell on that aspect.  If you're looking for more depth there is none; just take it as face value as a spy/action movie and enjoy the ride.",
      "total_reactions": 0,
      "user": "steven"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "Phillip Noyce, Kurt Wimmer and Brian Hegeland's \"SALT\"  was one of the year's most hotly anticipated films  everywhere you looked you saw  the promotions for this slick and over-the-top action thriller  from director Phillip Noyce(Rabbit Proof-Fence, The Quiet American), screen play writers Brian Hegeland(L.A. Confidential, Robin Hood) and Kurt Wimmer (Equilibrium, Law Abiding Citizen). \"SALT\" is a kind of ripped form the headlines type of action thriller seeing as it is taking its main plot and premise from a news story about a women who accused of being a Russian spy. \"SALT\" is a standard order thriller with amazing action sequences and death defying stunts the only thing that sets this film apart from other action movies is the fact that it has a seasoned and highly professional star in the lead role, a veteran action director who knows his way around action sequences and conspiracy thrillers. But the plot to this movie seems to be mired in an over abundance of action sequences and chase sequences and to add on top of all that the film clocks out at a measly 1hr. 39 min which leaves little for character development or story development but truth be told does a  movie like this  really  need all that? I don't think so. This film is more reliant on its action, stunts, chases, and Angelina Jolie's excellent performance as Evelyn Salt. This film has so many plot holes that you could drive a semi truck through it  is the epitome of over the top action  with each and every sequence delivering one brilliant filmed yet  outrageously implausible stunt after another. All the while, the audience is sitting there in awe at the stylish and gritty action that laid out for the audience. \"SALTâ",
      "total_reactions": 0,
      "user": "Lopez17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "A decent action spy movie with an ultra-capable female heroine somewhere between Bourne and (closer to) Nikita with an outrageous story involving the assassination of Russian AND American president and starting a WW III with nuclear strikes on Iran and Mecca. Leave your brain at the entrance and, if you like this kind of fare and you are willing to suspend your disbelief, you will have fun. Final assassination is really a sight to behold although with Kurt Wimmer 's script (Equilibrium, Ultraviolet) you must expect some serious close combat badassery verging on supernatural.",
      "total_reactions": 0,
      "user": "KundK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "Their are parts that i loved. The movie is great but thats not the point. I felt it was very rushed. The movie..2 hours long..felt like it was a 30 minute show you usually see on tv. Not saying not to see it(see it) but this movie was very rushed and now their's going to be a second movie based on the ending of her running away from the cops. So waste your money on that exactly what these producers planned to do.",
      "total_reactions": 0,
      "user": "Beats"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "Sit down and enjoy the ride, ask questions later. Absurd plot, average dialogue, but some really great action, especially when in cinema. Jolie is good, just like Liev Schreiber, who plays just as big as a role as his female counterpart. Looking forward to Salt 2.",
      "total_reactions": 0,
      "user": "sido88"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "Let me just start off by saying that the trailers for Salt do it absolutely no justice and make it look like the most generic of forgotten identity action movies. Salt  is much more than that. Due to seeing that trailer around 50 times, my expectations were deflated but truthfully those expectations were never very high. I sat and watched as every minute my negative thoughts for this movie before I saw it were washed away and I became immersed in the action. If you are like me and were close to writing it off as garbage, think again.",
      "total_reactions": 0,
      "user": "FilmTrout"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "In Salt, Angelina Jolie plays a character once written for Tom Cruise. If you've read anything about the movie over the course of its multi-month media blitz, you've probably read that. Primarily this tidbit is used for publicity. But to ignore the impact this sex-swap had on the film itself is to miss the importance of Salt as a potential launch pad for a new breed of action heroines. More: http://cinewise.blogspot.com/2010/07/salt-2010.html",
      "total_reactions": 0,
      "user": "dubmc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2010
      },
      "score": 6,
      "text": "Several action sequences stitched together with a very loose plot to boot. I went into this thinking it would be a watered-down version of the Bourne trilogy. Instead it a murky action movie with a lot of shouting. Don't expect to be excited to  priapic proportions.",
      "total_reactions": 0,
      "user": "Rienye"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2010
      },
      "score": 6,
      "text": "This was a total \"girl power\" movie.  I didn't like it very much at all, really it could be helped a little with more realism.  Like seriously she shouldn't be owning everyone throughout the entire movie.",
      "total_reactions": 0,
      "user": "Jawcl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "If you take one of the Bourne movies as the standard for this genre, or possibly earlier conspiracy/espionage films like Day of the Jackal, then this movie is unable to generate a score that is in the upper half of distribution based on quality.  All of the attributes necessary for a great conspiracy film - convincing storyline, protagonist with whom to strongly identify, technically amazing yet believable plotting, and energizing action - is missing in this film. Weak characterization, a failure to convincingly make the plot believable, and kind of soulless action in a lot of places.  I had to really concentrate to stay engaged, but never was able to.  The movie simply doesn't lift the viewer up into the action and story, and I think it is because the nature of the story - an implausible cold war/terrorist cell strategy to destroy the US - isn't all that great.  Plus, the movie feels like an origin story - we are basically given a story that will justify 2 more movies later.  We learn why Angelina Jolie will ultimately work alone, why she cannot trust anyone except one person in government, and so on.  In that sense, maybe the payoff will come in later installments, but this one was a disappointment.",
      "total_reactions": 0,
      "user": "scunning"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "Bourne has a lot to answer for, this time its a good thing, as-long as you don't stop to think about what is happening (in which case you will quickly figure it all out) even the plot matches the \"top shelf\" action which only enters the ridiculous once or twice...",
      "total_reactions": 0,
      "user": "Flint"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "Wildly improbable plot, wildly improbable action sequences, wildly improbable wigs on Angelina Jolie. Still, kind of enjoyable. Jolie puts a lot into these action roles and her face, as always, is mesmerizing.",
      "total_reactions": 0,
      "user": "Lyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "The movie is to damn predictable, there are plot holes and always feels like you've seen it before but it is enjoyable. The plot is fast and angelina Jolie is stunning. This summer has had poor movies this is not one of them.",
      "total_reactions": 0,
      "user": "kk10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "This film was incredibly enjoyable. I wasn't expecting much after reading many average reviews. The film keeps you guessing right up until the very end \"Who is Salt?\". The ending leaves a path open for a sequel, which I very much hope happens.",
      "total_reactions": 0,
      "user": "Igonge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "Fun roller coaster ride of action and suspense. Quite obviously not based in reality but quite believable if you were to picture it in the Bourne universe. I will be picking it up when it gets released on BluRay.",
      "total_reactions": 0,
      "user": "EnSabac"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "\"Salt\" may start off with some clunky storytelling, but once the action takes off (which it doesn't take too long to do), it's a senseless joyride, finding a niche between \"Bourne\"-style realism and \"Mission Impossible\" inanity (yes, a mask is used at one point in the movie). Of course, the driving force is Angelina Jolie as Evelyn Salt, a CIA agent who is accused of being a Russian spy. Salt is altogether a static character, but shifts in narrative constantly make our view of her dynamic, no knowing whether to pin her as hero or antihero, and Jolie plays this ambiguity to perfection. The movie itself isn't perfect, though - to me, occasional plot holes made it more confusing than \"Inception,\" and the idea of a Cold War carry-over in this day and age is somewhat laughable. Still, the movie plays its thrills right, and character of Salt fulfills what she was written to be - a bona fide action star.",
      "total_reactions": 0,
      "user": "ryancarroll88"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "Angelina Jolie in a tailor-made role that strays away from Lara Croft or Mrs. Smith. The film itself is a breath of fresh air and itâ",
      "total_reactions": 0,
      "user": "shlugalug"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "Salt may not be the most original film in terms of its plot, but it is definitely done right for the most part. This is mainly due to Angeline Jolie being such a great strong actress for this kind of film and the movie itself keeps you interested all the way through and may give you a surprise or two in its plot depending on how many films you've seen of this kind, of course.",
      "total_reactions": 0,
      "user": "Sonicphoto"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "a lot of fun.  keeps you guessing which side salt is on and what her real motivations are.  some nice twists. its unpredictable and that's what sets it above most action films.  Jolie plays the character well.  although you have to suspend your disbelief that such a physically thin woman could beat up all those big guys.",
      "total_reactions": 0,
      "user": "sr_81"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "The bad things in this movie were Mrs. Angelina Jolie performance. I'm a fan since  Mr. & Mrs. Smith and Changeling, but I felt like I was watching Lara Croft and Fox (\"Wanted\" movie) expressions. In example: She can't avoid the same smiles, neither reactions like leaning her head on the wall when things are getting worse. And the script.",
      "total_reactions": 0,
      "user": "Nightian"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "Salt is definitely a film worth watching. I don't know why anyone's saying it's bad because it's really good. Sure, somethings were strange and unheard of (to me) like a pipe-fire extinguisher-tissue-alcohol rocket  launcher.",
      "total_reactions": 0,
      "user": "libno"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "With Wanted and now this on her resume Angelina Jolie is the undefeated female action star.  She exudes movie-star charisma, physical prowess and has the acting chops to pull off the more emotionally charged scenes.  Forget the risible Lara Croft, this movie is fast-paced and entertaining.",
      "total_reactions": 0,
      "user": "grindhouse83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "Although it wasn't one of my favourite movie's ever I still did enjoy. I thought Angelina Jolie was very strong in it but I found the many 'twists' in the plot confusing at times and at the end was a bit baffled. Although I say this I would recommend it as it was enjoy just not particularly remember able.",
      "total_reactions": 0,
      "user": "Sazzers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Great movie! a must see! definitely not predictable. a great experience its almost like an action and a mystery movie put together. great twist at the end!!",
      "total_reactions": 0,
      "user": "peoplewhomatter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "Just what a mindless summer movie should be. Lots of great stunts, a story that's just interesting enough to keep you going between the blowups and bullets. There's no depth, don't get me wrong, but it's a nice way to spend a few hours in the air conditioning while shoving down the popcorn.",
      "total_reactions": 0,
      "user": "kabloom"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "watched the film and loved the action! don't get me wrong, it is a film I would not hesitate to watch again...but... there are some gaps in the plot! what is really the use of the scene where Salt after her release in N.Korea is talking with her husband saying he should have petitioned for her as 'now they know who he is'...we learn that Liv Shreiver's character asked her to get close to the person that became her husband.OK! but if the script was clever enough, they would have used this sub-plot more effectively given what is revealed about Shreiver's character in the end...it does not make sense that Salt's husband is just killed...",
      "total_reactions": 0,
      "user": "attikonsinefil"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 4,
      "text": "I was not moved by the fact it was Jolie, and without that care - this movie was not what I had expected when I heard the movie was about espionage. The movie would have been better had they avoided the love aspect. Jolie is not the person for this movie. The movie became overly unrealistic.",
      "total_reactions": 0,
      "user": "kingshahid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "This was on a par with the Tom Cruise M.I. films.  The action was well done.  AJ is a credible action heroine (though I doubt she could take out some of the monstrous guys her character did). i thought the plot was interesting, though not terribly realistic:  CIA operatives are going to believe a Russian spy over a trusted agent and then let the spy escape?  It still was a fun ride.",
      "total_reactions": 0,
      "user": "StevieGJD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "A fun if slightly absurd movie, although the end sucked.",
      "total_reactions": 0,
      "user": "tghm1801"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "In SALT, the best action thriller of Summer 2010, Angelina Jolie proves her talent in a leading role originally written for a man.",
      "total_reactions": 0,
      "user": "SecretAgentGal"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "The plot could have been written by a 10 year old, the acting is mediocre at best and the \"special effects\" are, by no means, special.  Need I say more?",
      "total_reactions": 0,
      "user": "CunningLinguist"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "A fantastic action movie as expected, but surprisingly the movie also had a great plot and unexpected plot twists. one of the most entertaining movies of the summer.",
      "total_reactions": 0,
      "user": "mdm99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "I'd really like to give this a 7 1/2 but the meter won't let me.  What's not to like here?  The Russians are back as the Free World's arch enemy, Angelina Jolie has found her niche as the action hero of the next decade (Take that Terminator! Move aside Jason Bourne!  Ripley, meet Salt!), the momentum is non-stop and the plot is over the top--but not TOO far over the top.  This is just a fun movie that no one should take at all seriously.  And what a hoot--Jolie as a guy!  Talk about suspending reality!  Too, too much fun.",
      "total_reactions": 0,
      "user": "T-Pity"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "As a fan of James Bond, The Bourne series and other well-written, acted and action-packed spy thrillers, Salt definitely ranks up there.  While it isn't the strongest performance ever by Angelina, I'm not sure who else is suited for this kind of character.  I've heard they are making a sequel and are trying hard to get her to return to the role.  I hope they work it out.  I enjoyed the grit and action so much in this film that I'm hooked enough for at least one more movie.",
      "total_reactions": 0,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "It had a nice premise but lacked the execution that the any of the \"Bourne\" movies exhibited. Overall, it was a decent movie. It just fell short of creating a franchise, which it easily could have done.",
      "total_reactions": 0,
      "user": "TheCylon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2010
      },
      "score": 4,
      "text": "\"Salt is a sophisticated mess , it tries to hard to be the next Bourne movie , its clichÃ©d , unrealistic , and plausible. Angelina Jolie gives it her best but her best is just not good enough. I Enjoyed the last 20mins then the entire 1hr 40min movie ....\" .. C-",
      "total_reactions": 0,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2010
      },
      "score": 6,
      "text": "Bourne style script and action that literally never ends - just like the film itself. I guess we have to wait for the next installment of the film to find out what happens in the end.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2010
      },
      "score": 5,
      "text": "Jolie really is great, but the happenings are just so unbelievable and cartoon-ish that I was never able to completely suspend my disbelief and just couldn't get into it. Did I mention Jolie is great?",
      "total_reactions": 0,
      "user": "nohobobo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "Great action sequences and sound work, but the story was nothing fascinating. It is worth seeing and is certainly an enjoyable two hours, but don't expect anything more than a fun thriller.",
      "total_reactions": 0,
      "user": "Tony"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "I'm not saying its a terrible movie, but its just wasn't that good. the plot and character development weren't compromising, but the acting wasn't that bad and the action was kind of enjoyable. so, I'm gonna give the director five points since he was this close of making this movie so good and it was worth a try.",
      "total_reactions": 0,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 6,
      "text": "The film moves at a decent pace for the most part, but gets kinda silly towards the end. Which is a shame as it's quite the thrill ride on the big screen.",
      "total_reactions": 0,
      "user": "Flapjack"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "wow what a movie. great action, plot, acting just wow. The backflashes i though where corny and could have been made better though. This one movie i wish they will make into a franchise because i will definaly be in line to see the next one and the next one after that.",
      "total_reactions": 0,
      "user": "moviefreak12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2010
      },
      "score": 6,
      "text": "I miss star vehicles. Watching Salt I was reminded of the impact a great star can have on even the silliest of plots or add to the storytelling with whistless fascination in such a profound way.",
      "total_reactions": 0,
      "user": "Mornington"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "Salt is a great movie. It's full of action sequences, interesting story and phenomenal acting by Angelina Jolie. The plot itself takes a turn once or twice and keeps you hooked until the end. If you have to compare this film to any other out there, I'd say 'The Bourne Identity' gets real close. Though if I have to name anything that's negative, well... it's a movie you watch once... after that the fun is gone since this movie is based on surprises and excitement only. Also it's nothing new, we've seen films like this before.... but don't get me wrong, 'SALT' is still very enjoyable.",
      "total_reactions": 0,
      "user": "SGRevan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "One of the better movies I've seen in a while. Anyone who gives this less than an 7 or 8 shouldn't watch movies anymore, just go and hide in a dark hole b/c you're worthless to society.",
      "total_reactions": 0,
      "user": "LondonTruelove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "It's not just another spy movie but another movie with a lot of story in it. Angelina Jolie's character has to run for her life when people find out she's a Russian spy, while she has to complete her missions as well. The stunts and action may bores people for a while but Jolie manages to save the flaw by her acting. What is much to my relief is the movie has enough changes of outcome that are easy to understand and not only focused in the ending. Obvious snoozy talking scenes look shortened but brings a lot of meaning to leave more space for the action. Thank God!",
      "total_reactions": 0,
      "user": "consumer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2011
      },
      "score": 4,
      "text": "Salt tries hard to be a action packed government conspiracy movie with tons of plot twists, but in the end fails do to the fact that I really never cared about anything that was going on, the plot is laughable at best and completely predictable, and the characters are downright brain dead, and the action scenes which are the best part of this movie end up being nothing we haven't seen before, honestly I really can't find anything that makes this movie worth your time, you can safely pass on this one without a second thought.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2010
      },
      "score": 6,
      "text": "While the movie was somewhat stimulating as far as the plot and special effects are concerned, I was most curious as to how they were going to end it.  In that respect, I was thoroughly disappointed.",
      "total_reactions": 0,
      "user": "deserthaze"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2010
      },
      "score": 6,
      "text": "Nice action, but hoped it would've been more cerebral.  As it is, it's predictable through and through.  Not sure why Hollywood folks think that some \"action\" compensates for a reasonable plot.  Common there writers and producers, we've seen all this stuff a gazillion times over.  Some theatrical animation and computer effects aren't impressive anymore.  It's not like we don't know that the actors don't jump onto cars on freeways or outrun explosion waves.  Something new and more inventive would be nice for a change, once in while.",
      "total_reactions": 0,
      "user": "ReverendD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "Good story line, lots of action, and excellent pace.  A couple scenes were predictable but they're far outweighed by all the surprises and plot twists.  Action was less than realistic but who cares - it's the story and the non-stop action that makes it a good ride.   Just relax and enjoy.",
      "total_reactions": 0,
      "user": "enigma13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Woeful. Just a bad version of Bourne, but with a chick in place of Jason Bourne. The only exception being that it's even more inaccurate and unbelievable.",
      "total_reactions": 0,
      "user": "Waltzaroo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "The only reason why I watched this movie was because someone told me that it was similar to Inception in that you don't know which side the main character is on at the end. After watching it, I start to wonder if the guy actually saw Inception, because they're not really comparable at all. Some really nice action scenes and if you can ignore large chunks of the storyline you'll actually have quite a bit of fun with it. Even if you try to watch the movie at half speed (which will give you a headache) you still wont be able to figure out where the story is going to take you, which would be a good feature if that story would reach a good conclusion. How many ways are there to say that this movie has obvious gaps in it?",
      "total_reactions": 0,
      "user": "XuDavella"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "A so, so action film. Enjoyable enough with an exciting twist at the end. The genre has been done so many times that it becomes hard to do something different with it. They've tried with this film and succeeded a little bit.",
      "total_reactions": 0,
      "user": "Triatsila"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "This is James Bond becomes Jane Bond.  She can win 3 on 1 fights.  She can save the world.  And she can look great doing it.  The world is safer with salt.",
      "total_reactions": 0,
      "user": "The_orud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "I am an avid Angelina Jolie fan, but this film's plot was ridiculous and poorly executed. I actually fell asleep while watching this and woke up toward the end. The best element of Salt is Angelina Jolie's amazing stunts. Otherwise skip this one.",
      "total_reactions": 0,
      "user": "lyric555"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Fast, edgy, tense, amazing!!! This film was an absolute knock out !  Angelina Jolie was the perfect choice for this film. I a lot people I know complain because they that this film was  unrealistic, but I say boo to them because this film lived up to the hype in my opinion and kept me on the the edge of my seat!!!",
      "total_reactions": 0,
      "user": "MrC3030"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2011
      },
      "score": 6,
      "text": "Whilst the story flies in every direction it can think of, this is a fun and entertaining thriller that fits right into the popcorn evening we all love to have.",
      "total_reactions": 0,
      "user": "TargetF209"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 4,
      "text": "The story is pretty strange... too strange for me. And, well yes of course, the Russians are still the enemies. A very unbelievable movie, 2 stars for a little bit of action, a little bit of originality (yes the evil win... wait, do they?) and a little bit of Angelina...",
      "total_reactions": 0,
      "user": "Sickz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Salt was my favorite action movie in the past few years. Action packed from start to finish with some interesting twists. Angelina was suited perfectly for the role and excelled. It was great to see a female lead in a somewhat Bond style thriller. Jolie showed her grit and knack for handling danger similar to her days as Lara Croft.",
      "total_reactions": 0,
      "user": "Peter_Labose_LA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "I really liked this, one of the better action movies I've seen in a very long time. Angelina Jolie is great in her role as Evelyn Salt, and the film leaves you wanting more! A sequel please!!",
      "total_reactions": 0,
      "user": "alleyt1989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2011
      },
      "score": 6,
      "text": "Salt was a very exciting action packed movie.  The storyline has been done before but they added details and twists that made it interesting.  The only negative thing was that it was unrealistic in some parts, such as when she escapes from the CIA building and her ability to beat the crap out of 20 or 30 professionally trained soldiers.  I understand it's a movie but it could've been a bit more realistic.",
      "total_reactions": 0,
      "user": "bottafff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "SALT: basically the female Jason Bourne? Quite possibly actually. Angelina Jolie delivers a very solid and action-packed performance as Evelyn Salt, a CIA Agent who goes on the run after she is accused by a Russian defector as being a Russian spy. It's nothing ground-breaking as we have seen this before but its very entertaining as there is some genuinely incredible action sequences. The story is somewhat confusing at times to say the least yet somehow intriguing as you try to work out just who Salt is. The area where Salt does deliver is in the entertainment. Whether its the action sequences or the element of surprise and excitement it is a throughly watchable film. As i've said before SALT is certainly nothing fresh its been done before, Bourne anyone? Ofcourse the intriguing element is the story and background and that makes it ever so slightly different but also given the fact its a female its a very good alternative from the macho, muscle assassin on the run. All in all Salt is a hugely enjoyable film with plenty on offer and while the story is far from straightforward its certainly worth a watch plus with the way the movie ends I think its natural to assume this isn't the last time we'll be seeing Angelina Jolie as Salt, this movie may well kickstart another franchise!",
      "total_reactions": 0,
      "user": "Rosco"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "A well acted and entertaining movie if you can put aside the obvious plot holes, the outlandish acts the main character can seem to perform and still try not be too disappointed by the obvious twist which you see coming from a mile away.",
      "total_reactions": 0,
      "user": "rotku"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2011
      },
      "score": 6,
      "text": "A fun action flick that is fairly strong in storytelling, but it has more holes than a sponge. Jolie exhibits nothing new here, and we are treated with watching her character evade inescapable capture and detainment. Yes, I was rolling my eyes here and there, but I can't say I wasn't entertained. The film has echoes of The Long Kiss Goodnight, but unfortunately it does not fare as well as the aforementioned. It's perfectly aligned for a sequel and I might see it, but if it is entitled \"Pepper\", I won't exactly be the first in line at the theatre.",
      "total_reactions": 0,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 6,
      "text": "Salt has enough working for it to be watchable and entertaining. There is a lot of far fetched nonsense that makes up much of the action and drama, the story is ridiculously implausible and you'll have to turn your brain off to enjoy (which is not an excuse for an average movie). Angelina has never really impressed me in her movies and while the movie is not bad, is still not intelligent enough for me to take her seriously. The movie is what it is, and is worth the time, but it wont make a lasting impression.",
      "total_reactions": 0,
      "user": "davenbettridge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 5,
      "text": "Sorti en mÃªme temps que Night and Day, Salt dÃ©Ã§oit autant que le film avec Tom Cruise. Pourquoi? Tout simplement par le fait que ce film sonne le dÃ©jÃ -vu, chaque rebondissement Ã©tant peu imposant car Ã©tant prÃ©visible au possible. Et le \"pire\", c'est que le film de Philip Noyce repose essentiellement sur les Ã©paules d'Angelina Jolie, nous servant une mise en scÃ¨ne assez plate et un scÃ©nario aussi sobre que brouillon. Mais il faut bien reconnaÃ®tre que Salt se montre bien plus dynamique et rÃ©ussi question action que Night and Day. Et pour cause, nous avons lÃ  un film sans temps mort qui enchaÃ®ne des sÃ©quences Ã©nergiques mille fois vues mais toujours aussi divertissantes Ã  regarder. Salt : un film sans prÃ©tention, vite oubliable, qui se laisse nÃ©anmoins regarder sans dÃ©plaisir. Mais il est vrai qu'Angelina Jolie mÃ©ritait bien plus...",
      "total_reactions": 0,
      "user": "avatar16"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "Salt is a decent action film, similar to the Bourne series. But despite the action-packed blockbuster thriller feel, it lacks polish when it comes to story and characters. It's like the entire film changes in the last 20 minutes, and it doesn't end properly at all. Throughout the film you never really understand whether the main character is \"the goodie\" or \"the baddie\". There was a lot of potential for a good story given the premise, but it was a missed opportunity.",
      "total_reactions": 0,
      "user": "sinadoom"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "This is an enjoyable movie, it is thrilling throughout with good action scenes (thanks to a usual good performance by Angelina Jolie)  The plot is also very interesting and has a satisfying ending.",
      "total_reactions": 0,
      "user": "AlvaradoKTA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "Salt is one of my favorite action films Angelina Jolie of course, delivered a powerful performance and Liev Schreiber also did well in his role. Salt had me on the edge of my seat when I seen it in theaters. The rest of the audience also loved it at the end there was even some applauds. Hope to see a sequel someday!",
      "total_reactions": 0,
      "user": "Night_Hawk_2012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "This film was average at best. It had a nice ending and for that I gave it a positive score rather than a mixed one but really this film is mostly the same as nearly every other espionage based action film.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "This movie has so unbelievably many turns of events and thats what makes it so great. It's illogical and makes many of the usual hollywood action movie mistakes, but the surprising thing is: no one is who you expect them to be here. And that makes it worth watching!",
      "total_reactions": 0,
      "user": "axelkoch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2012
      },
      "score": 1,
      "text": "I tried to enjoy this one, but all I got from this movie was a bunch of questions -- really, a lot of them. (i.e. Wasn't there a better way to \"activate\" Salt other than Orlov turning himself in and telling the truth to CIA? If Salt was supposedly (as the movie tries to make us believe) set up by this Russian guy, why does she try so hard to get away, making her look even more suspicious? What does her husband have anything to do with the \"Russian setup\"? Wouldn't it be easier for Salt to \"assasinate\" Russian president if they kept it a secret? Did the Russian president agree to be killed for the whole plot? Did Salt know that Ted was a sleeping agent like her? If not, what was the whole point of sneaking into the Whitehouse bunker when she changed her mind? Why does Salt go so far to kill Ted when the president is alive? Why would Russia want to bring US down in these days, when cold war has been over for decades?[Let's save this one if I'm bringing in too much reality into movies] Is agnt Peabody the only one who can possibly know that Salt saved the day? Why does Salt have to go through dark knight thing when there is enough evidence --fingerprint at Orlov's-- and she can prove she did what she meant to do?) It seems to me, the story was squeezed and twisted way too much just for the sake of looking cool.",
      "total_reactions": 0,
      "user": "segullsarc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "'Salt' is a very fun movie as long as you ignore logic and the laws of physics and just settle down for a fun ride. Even though the film feels serious in tone and doesn't follow the over-the-top formula that films like 'Wanted' do, there is still a lot of entertainment value to be had here as long as you know what you're expecting.",
      "total_reactions": 0,
      "user": "Captain_Kirk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 2,
      "text": "Salt is a mess. The plot is confusing and flawed and the characters go undeveloped. In this sort of film, you need to root for the hero, Jolie in this case, and I found myself not caring.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "This movie really surprised me; it's much better than what I thought it would be. I went into this movie not really knowing what it would be like, but it turned out to be great. This is an action packed thriller that will have you on the edge of your seat the whole time. Is it predictable? A little, but there are just enough surprises to keep you thinking. It's not the most realistic story, but it works for the type of movie it is. Many people probably will rip all over this film because it's not perfect, but it does it's job, and I see absolutely nothing wrong with that.  It is more than entertaining! I highly recommend this movie.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "Stupid movie that makes absolutely no sense. AJ is unbelievable as a Russian sleeper agent. Its a movie for joe public and people who are politically ignorant. Its basically AJ running through different scenes killing people or running away from explosions",
      "total_reactions": 0,
      "user": "raporgi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "Salt is completely implausible, yet it must be said that Jolie plays her role almost perfect. The nature of the film and the way the story unfolds itself makes you want to watch this movie more than once.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2013
      },
      "score": 1,
      "text": "this is a total piece of crap with one of the worst final ever,how the  angelina jolie acept this paper,this movie is a total cliche,at least it isn't a so patriot movie as i thought.",
      "total_reactions": 0,
      "user": "joao1198pedro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "Angelina Jolie is an interesting study and I believe she belongs to that class",
      "total_reactions": 0,
      "user": "Denstar51"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2015
      },
      "score": 6,
      "text": "Angelina Jolie at its finest in this absurdly over-the-top action flick, loved how badass her character was, but I have to admit the ridiculous plot and preposterous, if entertaining action moments do vex me, to the point I lower my score. The characters aren't also all that interesting, but the slick direction and Jolie's performance is already enough to compensate, in my opinion.",
      "total_reactions": 0,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "Mindless generic movie that got more and more annoying with each scene. The plot, characters, acting, stunts and fight scenes were ludicrously stupid and unlikable. Angelina Jolie beats & kills American & Russian agents/police like a T-X character. Nothing in the story is believable or makes sense and Earth to Hollywood, the Cold War ended years ago.",
      "total_reactions": 0,
      "user": "chance111"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "Even if the plot doesn't make quite as sense, it is still VERY entertaining. From the first few scenes, I knew this was gonna be good. Angelina Jolie really delivers, and this is a very fun thriller. Story wise, however, wasn't as good, and too many plot twists to make this confusing.",
      "total_reactions": 0,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "The action scenes of \" Salt \" and the good performance of Angelina Jolie, had a good detachment , but the movie as boring and not fueun good complement to what I wanted from this film , but likewise good job of Angelina .",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "Kept me interested the whole way through, with lots of twists! And that handrail scene tho, omfg.",
      "total_reactions": 0,
      "user": "choomtabi31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2017
      },
      "score": 0,
      "text": "This movie was an utter disappointment for me. The plots were not properly executed, there were many loopholes and the story was boring to be honest. The problem with these commercial films is that their whole purpose is to make money out of amateur movie goers rather than make something that should critically make sense.",
      "total_reactions": 0,
      "user": "ammeoo"
    }
  ]
}