{
  "mc_avg_user_score": 6.3,
  "mc_metascore": 30,
  "mc_mixed_rating_frequency": 62,
  "mc_movie_name": "Saw VI",
  "mc_negative_rating_frequency": 42,
  "mc_positive_rating_frequency": 111,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2010
      },
      "score": 6,
      "text": "A definite improvement over the last, Saw VI equalizes gore and heart, and although I feel horribly disgusted with myself after the credits roll, my 90 minutes were thoroughly and persistently entertained.",
      "total_reactions": 2,
      "user": "FitriAmirrol"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "I expected \"Saw 6\" as my final Saw movie. Turns out the movie is better than its prequel; it has the theme of blood, gore, horror, a appropriate (but still Cliched) plot twist, and redemption. Bravo Mr. Greutert!",
      "total_reactions": 5,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2010
      },
      "score": 1,
      "text": "\"Do you want to play a game\". No thanks Jigsaw I`ll pass.",
      "total_reactions": 4,
      "user": "Javed12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "SAW VI is a well-directed, but not well-acted SAW sequel that is one of the best films in the franchise!",
      "total_reactions": 1,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "Other Saw series concentrates only how to make more violent and more blood-fleshing; however, Saw 6 shows more psychological traps and dillema between life and death.",
      "total_reactions": 0,
      "user": "Paul_Yoon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2010
      },
      "score": 6,
      "text": "the traps in the previous movies were even more gorier than the first three and people were like paying attention watching those trap scenes. anyway, Saw VI wasn't excellent, but its so good it is also grisly.",
      "total_reactions": 0,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "It was ok. The acting was decent and the traps no longer relied on just violence but they actually meant something to the person who was being tested. Sadly though the entire plot is just a poor take on a real issue and it doesnt fit well in the Saw world. Its a decent addition to the franchise but nothing really special about it.",
      "total_reactions": 0,
      "user": "asylumspadez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2010
      },
      "score": 0,
      "text": "stupid scary too bloody movie -.- , this is even worse than the final destnation that is even the same people don't want these goddamit awful movies  ,...... All things considered, this was the worst Saw movie yet",
      "total_reactions": 0,
      "user": "Motwera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "This is by far one of the best in the Saw series, the plot is awesome, my only complaints are that Hoffman isn't as enjoyable as John was, and the ending was a little confusing, but it's by far one of the best Saw movies so far.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2011
      },
      "score": 6,
      "text": "The whole franchise is an endless merry-go-round- a detective is found alive, kidnapped by Jigsaw, and put into another one is sick, twisted but fun as hell to watch games.There's nothing wrong about that, it's just when you continue to make installment's to a fran, your supposed to make them more exciting,fresh and still fun-not increasingly dull.",
      "total_reactions": 0,
      "user": "thecurber"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2011
      },
      "score": 3,
      "text": "Eh it was ok. While Tobin Bell once again shined in the parts that he was in, The acting (besides him) was pretty average. The traps were lame and not that interesting, The film wasnt scary at all. It was pretty generic if you ask me and it was a poor take on a realistic issue. Really disapointing overall.",
      "total_reactions": 0,
      "user": "spadenx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "People bash the series as it continues to go on, they judge it based on its pieces, without seeing the whole thing. If one piece (movie) isn't what they wanted or expected, they give up on it, and they have no idea what they are missing!",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "Solid acting through out. The plot was a terrible take on a real life issue and while it was interesting to see how it would be handled in Jigsaw's world, It was simply poorly executed. The traps werent made for shock value (something I liked), They were made to truely test the man who was being tested (He was a higher up in a medical insurance company and he constantly refused coverage/help to people who needed it, His actions resulted in the death of a man who had coverage but he used a loophole in the coverage to get out of paying for his treatment and the man ended up dying). It was a decent horror film at best though.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "Ugh this is still happening...and it didn't even finish here!! If the nest film isn't the last one I will hang myself, I used to love this series but now its just taking a dump and shoving it in my face. Ok so SPOILERS Hoffman is Jigsaw and that guy whose name I forget totally died at the end of the last film, now he is going after John Kramer's life insurance broker who refused to fund his potentially life saving operation or something. You know what this is **** stupid I just quit with this film series.",
      "total_reactions": 0,
      "user": "potatoes351"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "Now, this was unexpected. I didn't expect \"Saw VI\" to be a big step up from the previous two. It's true though. The plot made some sense and had some decent twists. The acting can easily be seen as wooden in some places and the story does have some holes, but what more can you expect after watching two previous movies that are twice as worse?",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "And excellent penultimate movie in the Jigsaw Killer franchise. It featured a new protagonist. Hoffman's legacy, awesome traps and the best ending for any Saw movie by date. This movie should have got a higher metascore shame.",
      "total_reactions": 0,
      "user": "Annoymous1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "Much improvement from the previous two. The story is better with less flashback and more concentration on a game. And the game actually makes sense this time and is also more creative. At the end I actually cared if the person lived or died which was different from Saw IV, V. However, due to it being just an average story line and similar to what we have already seen I cannot give this any better then 61.8 out of 100.",
      "total_reactions": 0,
      "user": "spollard"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "Saw VI focuses on a story of helpfulness and revenge, so it has a meaning. Nevertheless is the movie booring after awhile and the traps can't really improve this situation.",
      "total_reactions": 0,
      "user": "MichMart"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "Okay, okay... this movie's alright. It's not the best saw movie ever made, but it's also not the worst one ever made. The acting is okay, and the traps aren't that bad. It can get a bit boring (as the fourth and fifth were), but towards the end, it'll get you at the edge of your seats. I actually didn't think it was THAT bad, but it's not that good, either. I really liked the first three.",
      "total_reactions": 0,
      "user": "deadrising"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "May I see you starting to climb a little. The film is not the same as the previous two films. Anyway, I think I have a very high expectation from a series of seven movies.",
      "total_reactions": 0,
      "user": "Marick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "\"Saw VI\" is a great return-to-form for the franchise. It's intense, interesting, and bloody: everything I expect from a Saw film. The overall premise of the film is somewhat strange for the Saw franchise, and it didn't feel like it fit with the rest of the films. Nevertheless, it's a great sequel, and I'm glad the series can raise from the dead.... that is until Saw 3D came out.",
      "total_reactions": 0,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2015
      },
      "score": 4,
      "text": "As the health-care debate rages on, let it be known that Jigsaw, the sinister puppetmaster played in life and beyond by Tobin Bell, favors a robust public option. (This, in the world of political punditry, is what they call a “game-changer.”) It isn’t in character for the Saw movies to embrace topicality, but at this point, anything that can help distinguish one entry from the next counts as progress. Since the first Saw came out in 2004, Lionsgate and a limited group of artisans (the writing team of Marcus Dunstan and Patrick Melton have turned out the last three, and VI director Kevin Greutert edited all the others) have been giving audiences exactly what they expect, while keeping an eye on the company ledger. Adding a layer of social significance isn’t the worst strategy for a franchise that keeps piling on the convoluted mythos, yet hasn’t changed its risible mix of mechanized death and tongue-clucking morality. Each one plays like a very special episode of Fear Factor, or Extreme Makeover: Self-Mutilation Edition.",
      "total_reactions": 0,
      "user": "MovieManiac83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2016
      },
      "score": 2,
      "text": "Will the Saw franchise end? Not with this one, but we'll know when it'll exactly get terminated so we don't have to see a bunch of (not) scary clichés all over the place anymore.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    }
  ]
}