{
  "mc_avg_user_score": 2.6,
  "mc_metascore": 11,
  "mc_mixed_rating_frequency": 44,
  "mc_movie_name": "Scary Movie 5",
  "mc_negative_rating_frequency": 259,
  "mc_positive_rating_frequency": 60,
  "mc_pro_critic_reviews": [
    {
      "critic": "Andy Webster",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 30,
      "summary": "Marlon Wayans’s satire “A Haunted House” got to “Paranormal” first, and for a much smaller budget delivered bigger laughs."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 30,
      "summary": "This latest installment of the horror movie spoof franchise is mainly notable for its Charlie Sheen/Lindsay Lohan cameos."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2013
      },
      "score": 25,
      "summary": "Not that there’s all manner of comedy craftsmanship demanding study here, but the movie does seem to be a funny jumble of contradictory impulses."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 25,
      "summary": "This is a horror movie that’s really a supposed comedy; she’s (Lohan) a supposed comedy actress who’s actually scary."
    },
    {
      "critic": "Darren Franich",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 25,
      "summary": "Somehow, it actually looks cheaper than \"Paranormal Activity.\" It's less funny, too."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 25,
      "summary": "Scary Movie 5 aspires to timeliness, but its comic sensibility is so groaningly retro that the film features a series of tributes to The Benny Hill Show and its signature ditty, “Yakety Sax.”"
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 25,
      "summary": "Scary Movie 5 comes up short in every way imaginable."
    },
    {
      "critic": "Neil Smith",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2013
      },
      "score": 20,
      "summary": "That every jibe lands woefully wide is no surprise, though we’ll give leading lady Ashley Tisdale credit for giving her all to a film that mercifully won’t be around long enough to do any lasting damage to her post-High School Musical career."
    },
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2013
      },
      "score": 20,
      "summary": "Lacking a single honest laugh, this is shoddy by comparison with the other Scary Movie sequels… which throws it in a pit with Transylmania, Breaking Wind and Stan Helsing."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 20,
      "summary": "Luckily, folks like Snoop and good sports like Sheen and, yes, Lohan, break up the monotony. Until, like an undead beastie, the boredom and dumb jokes come roaring back."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "summary": "If you think three months is an impossible amount of time to write and produce a feature film, well, it is."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "summary": "Audiences not inclined to laugh at the sight of a baby’s head catching fire are encouraged to at least chuckle at the various gags made at the expense of Jody and Dan’s housekeeper (a game Lidia Porto), who satisfies many of the picture’s comedic-target prerequisites by being plus-sized, hysterically religious and Latina."
    },
    {
      "critic": "Laremy Legel",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "summary": "Scary Movie 5 is so massively un-enjoyable, a hate crime against cinema, a ringing indictment of the depths commercialism will go to in search of the lowest common denominator."
    },
    {
      "critic": "Leah Churner",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "summary": "SM5 tanked opening weekend, which may toll the knell for this property."
    },
    {
      "critic": "Pete Vonder Haar",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "summary": "Scary Movie V murdered my capacity to feel joy."
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "summary": "Lazy, boring, vile and tragically unfunny attempt at a horror-film spoof."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 3,
      "pos_reactions": 20,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "The movie is absolutely unwatchable. I hope they never make another one of these horrible movies again. Please save your cash and watch something that's worth your time like 42.",
      "total_reactions": 23,
      "user": "rancor"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 16,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "I've had about enough with this stupid series. It's not funnny at all and Charlie Sheen is one of the worst actors ever. Scary Movie was good and it should have just been its own film. The series needs to END!!",
      "total_reactions": 22,
      "user": "TheWalrus2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "Scary Movie 5 is silly but entertaining although it is stupid, it is a fun dumb time. One thing I liked in this movie besides it delivered some laughs, it has a good way in connecting the spoofs, like how Black Swan is in Paranormal Activity? And how Evil Dead has a place in the movie, I give it a point for that!",
      "total_reactions": 3,
      "user": "MovieGoer14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 1,
      "text": "Without Anna Faris this movie totally sucks!",
      "total_reactions": 2,
      "user": "Jacobparker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2013
      },
      "score": 2,
      "text": "There was one good joke and it was only in the preview. I loved the first two but after that they actualy became almost scare in how awful they are. What the hell...",
      "total_reactions": 1,
      "user": "bjinman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "Absolutely awful, I went with some friends and 2 fell asleep, that's how bad this movie was. I can't think of a single good thing to say about it. It's about time that the Scary Movie franchise was brought to an end as it will only get worse.",
      "total_reactions": 1,
      "user": "Yorkshireman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "same as the whole series the directors an producers are trying to make it as worse as possible. The actor should take a nap or go for drama classes...",
      "total_reactions": 1,
      "user": "abhinab"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 3,
      "text": "As a fan of the Scary Movie series, this movie was very disappointment. It make me laugh a few times, specially the part of the lesbian sex, but most of the jokes are forgettable and senseless. I didn't had the chance to saw this movie because I read the mediocre reviews, but I saw it because Halloween is near and I usually make a marathon of Scary Movie series, but I wasn't expected it was tooooooooooo bad. The plot is mediocre and senseless, how can you make a movie taking Black Swan's plot and Paranormal Activity's plot?",
      "total_reactions": 1,
      "user": "sebastianglz"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2013
      },
      "score": 1,
      "text": "Got stuck watching this movie because another theater was leaking.",
      "total_reactions": 16,
      "user": "Vorch"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "Even by Scary Movie standard, this one is horrible. I have quite a low standard when it come to comedy, especially spoof/parody movies. This is one is just god-awful. I think the movie just has no clear direction whatsoever. The jokes are all over the place. No zinger in any ways. I'm very very disappointed.",
      "total_reactions": 4,
      "user": "Maxxie1129"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "text": "This is the last time I will ever see a parody in theaters. I really like the Scary Movie films, but after 2 it kinda gets a few step backwards. But this one KILLED everything. Both Scary Movie and parodies in theaters all together. Anyway you look at it, it is horrendously awful. The jokes were more painful than funny, I wish I left the theater before it ended. If you like these type of films, trust me, you don't want to watch this. Also, for those who defend this film and say \"You people are too stupid to be entertained by good humor.\" So if we're stupid for hating this movie, then you are RETARDED for loving it. I've seen parodies that are so much better like Spaceballs, Robin Hood: Men in Tights, Young Frankenstein, Airplane, Naked Gun, even the first Scary Movie is better than this piece of sh*t.",
      "total_reactions": 4,
      "user": "billruller"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "Just no. We've seen too many \"Scary Movie\"'s come out to the big screen, and they got bad, and then worse.  This movie is not funny nor is it entertaining.",
      "total_reactions": 4,
      "user": "UtopianStuff"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "Blatantly rips off jokes from elsewhere (and can't even do that right). For instance, mixing up the bum probe with the mouth probe? That's a complete copy and paste of a scene from \"Idiocracy\". It's not homage, it's not parody, it's shamelessly trying to make money by stealing somebody else's joke. And they couldn't even make the joke funny. Absolute bottom-of-the-barrel worthless garbage. Do not go anywhere near this.",
      "total_reactions": 6,
      "user": "Gloone"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "This is the worst movie I've ever seen in my entire life and the fun part was that I actually paid for this crap. I went to the theater to spend some time with my friends and we all got depressed by the extremely childish, stupid, humour of this trash.",
      "total_reactions": 3,
      "user": "jinkuro"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2013
      },
      "score": 1,
      "text": "These are the sort of movies that make me wish i lived in a cave and only used the word 'ugh'.  I just can't believe someone actually pays to make them or pays to go and watch them.",
      "total_reactions": 3,
      "user": "dougaussie"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "What a bullsh*t  year for comedy this has been. I hope This is The End can, ironically, save us. Utter garbage. Why the f**k is Mac Miller in this movie.",
      "total_reactions": 3,
      "user": "SimpleMethod"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "You know what, I had it with this Scary Movie V crap. All 4 movies were very entertaining, but where's Anna Farris? Charlie Sheen and Lindsay Lohan are two of the biggest douchebags of Hollywood and as you can see, the Scary Movie franchise needs to die. I mean, DEAD as in zombies eating people. Razzies, take another note for \"Worst Picture, Actor, and Actress.\"",
      "total_reactions": 8,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 4,
      "text": "The movie is okay, but not as funny as the previous installments I always liked the first, because of how it separated itself from traditional comedies, but this movie goes in the ranks of 'Vampires Suck' and 'Movie 43'...just clones of what  was funny. In my opinion, go see 'A haunted house', they beat 'Scary Movie' to the punch with the 'Paranormal Activity' theme and it has that Marlon Waynes charm.",
      "total_reactions": 4,
      "user": "LWFYM"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "text": "scary movie 5 is a pathetic exsuse for film making. the first scary movie was lagetly funny but the sequals have been  this movie has an old formula that has been used way too mutch and pop culter refrences that aret clever or funny. hounistly this is a lazy pice of crap filmaking. These spoof/satire films are becoming old and not funny at all.The acting, dialoge, direction is tarrable in the film. When i saw the trailer for scarry movie 5, i wosent exspecting much but man this movie sucked more than i entisapated. please stop making these movies hollywod, becouse thay are owfule.",
      "total_reactions": 4,
      "user": "brandar98"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "Just let scary movie die, 5 is a horrible abomination and is just embarrassing to be honest, even for scary movie standards, I'm feeling that scary movie will not die, i'm thinking it will be the call of duty of the movie industry, no matter how crappy it will always have fans that eat it up, let's just hope they don't make a new one next year, don't support this, this is the prime example of dumb movies for the dumb masses.",
      "total_reactions": 2,
      "user": "TheNotuJP"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2013
      },
      "score": 3,
      "text": "It wasn't horrible but it wasn't quite good enough to pass off as decent. I mean some of the jokes made zero sense and the movie acted like we were suppose to die laughing every time it randomly mentioned something inappropriate. Just because something is perverted doesn't necessarily mean it's funny. The absolute worst part was watching Snoop Dog aka Snoop Lion and Mac Miller walking through the woods looking to steel some Cannabis........................... and trust me, it's painful to watch them both try to be funny because they weren't in the slightest. Although the movie had some good moments, overall all I can say is..... seriously?",
      "total_reactions": 2,
      "user": "mds03"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "A quick review if you will, but what else did you expect from the fifth (and may god have mercy on our souls if this isn't the final) installement of the scary movie franchise?",
      "total_reactions": 2,
      "user": "joey-clemenza"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "I don't ever rate movies this low.  Usually I can find some sort of positive in any movie; this is clearly the exception.  It's not funny, all it is is 90 minutes of 'oh my god why did they put that in, did they think it was funny?'",
      "total_reactions": 2,
      "user": "OnAnarchy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "I went to see it last night and honestly the most worthwhile investment I made there was with my soda. I cannot begin to describe how stupid this movie was but I'll give it a shot. It was like the once esteemed writers decided to make a movie so bad that they idiot masses would eat it up, which from the 19 positives here and the approval rating of 79% on Rotten Tomatoes would signify that they were successful. That's the scary part. The funniest moments of this movie either involved Molly Shannon or Vacuums or Train Tunnels. It's pretty bad when the bloopers make you laugh 60 times more than the whole movie, and you only chuckle. I am so sorry that the comedic genius that is Molly Shannon will have this on her resume. I suggest that she omit it. To clarify, Im the kind of person that can't even get through the old Evil Dead because of the tree scene, nevermind the new one but at the end of the night I was wishing that I had spent my $8.50 on the Evil Dead. Please do not make the same mistake I did. Don't encourage these bastards.",
      "total_reactions": 2,
      "user": "SunnyDragon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2013
      },
      "score": 2,
      "text": "Too bad to put into words. 2/10",
      "total_reactions": 2,
      "user": "TTWR"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "From beginning to end it is an exercise in failure.",
      "total_reactions": 2,
      "user": "Dire_effects"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2013
      },
      "score": 1,
      "text": "It's funny, it's weird, it's ridiculous, it's stupid, it's....horrible!!! The appearance of Linsey Lohan, Ashley Tisdale didn't approve Thisssss. This series should, no, OUGHT TO, need to end",
      "total_reactions": 2,
      "user": "jonathanminh22"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 3,
      "text": "Worse than all of the previous entries in the series but I've seen worse movies I guess. The funniest part was the scene with Lindsay Lohan and Charlie Sheen and that was only because they were making fun of themselves. The rest was hardly worth my time let alone my money.",
      "total_reactions": 2,
      "user": "S_C_S"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2013
      },
      "score": 2,
      "text": "What is it about these movies that makes them so funny? Dated pop-culture references, stale raunchy jokes and horrible, horrible acting just make these films kinda lame. What more can I say? I can't wait for Scary Movie 6 and 7.",
      "total_reactions": 2,
      "user": "Geologist"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "text": "Scary Movie 5 is the cinematic equivalent of a slap in the face. Virtually EVERYTHING about this movie is so horribly done, even Tommy Wiseau would be embarrassed.",
      "total_reactions": 2,
      "user": "Scout_Man799"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2013
      },
      "score": 1,
      "text": "Extremely poor excuse for a film. It's filled to the brim with childish gags and (at best) mediocre acting and only served to remind me of the dreadful failure that was Disaster Movie.",
      "total_reactions": 2,
      "user": "Samuelcd"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2013
      },
      "score": 5,
      "text": "-------------------------------------------------------------------------------------------------------------------------------------------------------Still a better love story than twilight.",
      "total_reactions": 2,
      "user": "Mattydigs"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "It's the worst of the five, so I'll get that out of the way, but it's still an entertaining film and it's definitely not the worst of the spoof films that are out there. Some of the actors are back from the past films but all playing different characters. They blended a number of films together quite well and while it had its funny moments it also really missed the mark on a lot of jokes. It's going to get bagged out regardless and only fans of the series will probably enjoy it like I did.",
      "total_reactions": 17,
      "user": "survivorfan989"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "So many \"comedy geniuses\" have gotten to \"Paranormal\" way before this film. Scary Movie stopped being entertaining when they decided to make a 3rd one, then a 4th one. And now with this 5th one, I'm sitting here literally saying Eff this. I can't believe I wasted money on this. Anybody who thought this was even remotely entertaining, have terrible taste in movies. Only C-List and below were in this movie. And fan boys, sorry to break it to you, Lindsey Lohan and Charlie Sheen don't even approach the B-List. Sucks. That's all I have to say. It sucks terribly.",
      "total_reactions": 5,
      "user": "ClayMerritt"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "This movie was terrible, my brother chose the movie for his birthday over watching evil dead. After the movie I told that he made the wrong chose, and I was wanting to watch evil dead. I say that you should not watch this movie. The director should be ashamed of himself for making this movie!!!",
      "total_reactions": 3,
      "user": "Chef"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2013
      },
      "score": 1,
      "text": "Not good at all, this is my first negative review, and a waste of my money. I don't recommend it to any one as it as not funny nor scary. Acting was terrible, and i think you should watch something else.",
      "total_reactions": 3,
      "user": "Boombox_Display"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2013
      },
      "score": 1,
      "text": "Hey guys, look, these kinda unrated movies can be funny enough. Take American Pie for instance. But this movie is just horrible! Horrible! I've had enough of these stupid parodies mashed up together. What a waste of money, this is! Give me half of the money you spent creating this movie, and I'll make you something better than this!",
      "total_reactions": 3,
      "user": "ArkaMukherjee"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2013
      },
      "score": 2,
      "text": "If it was actually meant to be a scary movie, then it was meant to be a horrible film. All you see is crude stuff and a VERY horrible end to a stupid movie. Parody for Paranormal Activity is not funny, and I thought Scary Movie 4 was bad...",
      "total_reactions": 3,
      "user": "Annoymous1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2013
      },
      "score": 1,
      "text": "Beating a dead horse...with half a loaf of Wonder Bread..that's all that I picked up while watching this poor excuse for a movie. I, I-I don't even know what to say here, it's just gotten pathetic and needs to stop. If you want a good laugh with the classic Wayan's Brothers, go out, rent A Haunted House and you will get something three times better than this trash.",
      "total_reactions": 3,
      "user": "Jefrock766"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "Once you accept this is mostly slapstick comedy, it turns out to be really funny. I found myself laughing hard many times, cause the jokes where ridiculously funny and beyond the usual border of taste. I liked \"haunted house\" too, but there were too few jokes. Scary Movie is trying to be funny every 10 seconds and i think it delivers every second or third joke... and many of them are really badass. It´s not the best out of the franchise, but i´ll rate it a 7.",
      "total_reactions": 8,
      "user": "krishna"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "Scary Movie 5. Holy cow. Wow. I had so much high hopes for this raunchy slapjack comedy but oh no, it sucked bad. REALLY BAD. First off, it looked like I was watching A Haunted House not SC5! The spooky spoofs are Evil Dead, Mama, The Cabin in the Woods, and Paranormal Activity 4. Now, I noticed that some of the scenes in the trailer were not in the movie like the ballerina scene where the baby is \"confiscated\" on the man- the mother is telling her the story but in the movie she is telling her boyfriend or something. I hated this movie for only one reason, its comedy. It isn't funny, you know! Just cancel this series! I have seen that every single director that makes a Scary Movie's Movie always ruins its reputation! In this case- Malcom D Lee director of the super funny Undercover Brother. Sorry, dude.",
      "total_reactions": 4,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "Is it the worst of the five yes",
      "total_reactions": 4,
      "user": "justapayne"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "Personally, this movie was enjoyable and I really had a lot of fun while watching, and while I can \"understand\" many people saying that it's horrible, I want to start saying that this \"movie\" isn't like the \"OTHERS movie\" (aka, disaster movie, epic movie, horror movie, etc), and people should know that at least, because while THOSE were horrible and not even funny, this one had at least a minimal amount of thought behind the scenes and it was actually fun to watch. And really, is this the worst movie ever? Remember that, if you're giving this movie a zero, you're actually saying that the Twilight movies are BETTER! Think about that. But rants aside, I don't think this movie is that awful, and if I had to pick a position, this is probably the third best of the franchise. Although, yes, it has flaws. For instance I didn't like that they removed Anna Faris, which was sooo funny...but oh well I liked the new actress enough and I liked the others too (I missed Brenda though). I didn't like also how the story wasn't focused on just one main scenario, but across two or three all together instead, making a lot confusion to follow the story: sometimes it's Paranormal Activity, sometimes Evil Dead, sometimes another. It's just not focused enough on certain aspects, unlike other Scary Movies (for example, SC3 was focused on The Ring, and SC4 was focused on The War of the Worlds). The jokes also weren't exactly stellar in comparison to the previous movies...but really liked how stupid they were, because while they weren't exactly genius, they were just freaking funny. Immature? Yes. Silly? Yes. Idiotic at best? YES at least it wasn't filled  with really bad puns, stupid pop culture references that usually made no sense...and singing jokes? But yes, these jokes aren't as good as the previous Scary Movies, but they are FAR superior than the ones present in the \"OTHER\" Movies. At least they made me laugh. Honestly, I will never understand how this movie was bashed so hard, and probably never will: it's not horrible, but it's not even great, but it's not worth all that bashing in my opinion because at least it took some planning and some effort. I'm not gonna defend it anyway, mainly because, like I said, it has flaws and maybe it should have more focus on some parts, more funny jokes, and the old actors back, but as it is it's NOT horrible, but still a bit of a disappointment. But is it worth the zero? My answer is no. If you're a fan of the old Scary Movies, you probably won't really like it as much, cause of the stupidity of the jokes and the lack of focus on the parodies; If you hated the \"OTHER\" movie series, you might like this a bit more, since it has better jokes. Best advice, however, is to see for yourself, and hate/enjoy it for what it is: a parody flick.",
      "total_reactions": 5,
      "user": "vahn"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "i thought that it was funny it could have been funnier like the previous installments and it could have been longer but overall i enjoyed it good movie 7/10",
      "total_reactions": 14,
      "user": "cool1707"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "I thought this was going to be really bad and i think if it was a longer movie i would have got tired of it but there were a few good laughs and with it being a short movie it did not have time to get on my nerves its worth a watch but don't expect to much and you will be ok.",
      "total_reactions": 8,
      "user": "scoley"
    },
    {
      "neg_reactions": 32,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "I originally had low hopes. But it turned out it is the best one yet on the franchise. To get some of the jokes you have had to see some of the paranormal activities and black swan. I would recommend seeing evil dead and mama before you see it but you don't have too.",
      "total_reactions": 36,
      "user": "joef123"
    },
    {
      "neg_reactions": 16,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "It's a stupidly-funny movie, these parody movies are so lame, so sick of it already well i am not. They did a justice doing a parody of Paranormal Activity, especially Black Swan. Ashley Tisdale's poor performance made it a more laughable and formulated at its finest. Scary Movie 1 is definitely the best & Scary Movie 2 is the lamest. 1 THUMBS UP!",
      "total_reactions": 18,
      "user": "Khen01"
    },
    {
      "neg_reactions": 17,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "For a movie that has uber-crap reviews, its actually not that bad. There are parts that made me laugh out loud, as well as some scary parts, which were welcome. The good parts definitely outweigh the bad. 9/10",
      "total_reactions": 19,
      "user": "bfisch2514"
    },
    {
      "neg_reactions": 27,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "Where's bear grylls?",
      "total_reactions": 30,
      "user": "Badbartboy"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "Seriously, who does even rate this kind of movie??????????????????????????????????????????????????????????????????????????????????????????????????????",
      "total_reactions": 11,
      "user": "franissavio"
    },
    {
      "neg_reactions": 24,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "First of all I thought the movie was going to be lame but i really enjoyed it. It's better than scary movie 2 but not as good as scary movie 3 or 1.",
      "total_reactions": 25,
      "user": "shuy"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "First off, let me just say that it's almost like re-watching \"A Haunted House.\" Which is kind of weird, but I'm not going to say that it's terrible, but it wasn't one of the best in the series either. This one didn't really impress me like Scary Movies 1 and 3. But it wasn't as bad as the second one. I say it's kind of at a tie with the 4th Scary Movie. The movie struggles to keep us entertained with it's cheesy humorous spoofs on movies like \"Paranormal Activity\" and even \"Inception\". It has its humorous moments, but still, the humor lacks the cheesiness from Scary Movie 1 and 3. Plus, there was some bad acting from Ashley Tisdale, Ben Cornish and surprisingly, Simon Rex. Puls, the Charlie Sheen and Lindsey Lohan scene wasn't as funny as I thought it would be. Overall, it has its moments, but still lacks the good quality humor that I was looking for.",
      "total_reactions": 3,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "I mean if you go into it thinking you just want a couple of laughs you may or may not like it, but eh whatever its a Scary Movie film nothing spectacular. Hey a hell of a lot better then Avatar and Hunger Games. Anna Faris really shouldve stayed her Ashley Tisdale was okay.",
      "total_reactions": 3,
      "user": "MarkMusic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2013
      },
      "score": 1,
      "text": "The only things scary about this movie are the bad acting, stupid jokes that fall flatter than a lead balloon, and the fact that it even exists to begin with. We all know that few movie franchises ever pull themselves back from the dead and survive. Scary Movie 5 is trying desperately to stay funny and cool, but only trips on it's own stupid comedy, and stabs itself repeatedly and slowly to death with it's own reputation as a old franchise that is trying too hard.",
      "total_reactions": 1,
      "user": "TheZebra"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2013
      },
      "score": 3,
      "text": "I remember the previous Scary Movie's to be reasonably funny but this one was just awful.The comedy in this movie is so predictable.I did not laugh once in fact I yawned while watching this movie.If you laughed during this movie you deserve death.The people who acted in this film are not bad actors at all,some are actually pretty good but they did a terrible job with this movie!",
      "total_reactions": 1,
      "user": "YinYanReshiram"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "I pissed my pants it was freaking funny!! What is with all the hate. Apparently nobody sees a good movie when they see one. Hope they make another one. Ashley Tisdael was so hot.",
      "total_reactions": 6,
      "user": "MovieMan12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "If you are a guy and want to see this, with your girlfriend, don't! I did it and during the whole date, she kept saying how auwful the movie was! To be honest, in some parts, it could had been better, but I really laughed. Scary movie 1,2 and 3 were the best. After them, 4 was good and 5 mediocre, in comparison with the rest. I laughed at the top of my lungs, at some moments and let's just remember, that this is a parody! It is made to humilate bad thrillers! So a bad plot, bad performances, bad direction are all in the schedule! Definetely, some parts of the movie were unwatchable! Not only, they were not funny, but were so lame, that you wanted to shoot yourself. The fact is that overall, it was good. Just good. Yet, I have to say that I watched it, only because ''Iron Man 3'' was full and there wasn't any other movie, at the cinema. I got stuck with this and it was good up to a point.",
      "total_reactions": 2,
      "user": "enfer99"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "this is awesome your all smoking snoop dogs massive joint right now I cant even tell why so many of you people don't know what comedy is plus all the people hating probley didn't even see the movie they just said Lindsey lohan, Charlie sheen=crap",
      "total_reactions": 1,
      "user": "moneyisaac"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "Esto más que una deshonra es una vergüenza total y sin sentido, no puedo creer que haya perdido 1 hora y 20 minutos de mi vida viendo esta cosa que se hace llamar película. No hay nada absolutamente bueno, ni una vez me reí con los \"chistes\" de esta película, hasta da vergüenza ajena saber que hay gente que tenga una mente así y este libre para crear (ojalá que no) más bazofias como esta maldita porquería. Scary Movie 5 no merece ningún consuelo ni perdón, no merece a la audiencia, no merece respeto, no merece gracia y ni siquiera merece ser vista. Esta película es una maldita pérdida de tiempo valioso que puedes utilizar en cualquier otra cosa (por ejemplo jugar Grand Theft Auto V). La peor bazofia del año está aquí, no la veas y si la ves hazlo solo, porque sino tus amigos y tú morirán de la impresionante vergüenza ajena que produce esta \"película\". Cero y desprecio total.",
      "total_reactions": 1,
      "user": "Fedelca"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "i liked when regina hall was in scary movie . but this movie is funny  and retarted in two ways . if they make scary movie 6 please god make it funny and put regina hall in it also marlon wayans .",
      "total_reactions": 1,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "Just like the rest of the series, the humor here is juvenile, crass, and low-brow. However if you're willing to turn off the part of your brain that must take everything seriously you'll find plenty of stupid humor to laugh at. Admittedly I am pretty easily amused, but this movie provided plenty of moments where I was rolling on the floor. It may not be the best or the smartest entry in the series, but I still found it to be pretty hilarious. My total score is a 9.2/10=Amazing.",
      "total_reactions": 2,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2016
      },
      "score": 2,
      "text": "Despite being slightly more watchable than Scary Movie 2 and having a few nice references here and there, Scary Movie 5 is mostly an unfunny bore that cannot reach the low(ish) par of the other films.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "text": "Wow, this movie is really dumbfest! Please don't pay them your money so they won't butcher other movies by this insulting dung anymore! Main contender for worst movie of 2013! This crap made for dumb people by dumb people, I'm sick of it",
      "total_reactions": 0,
      "user": "PStakhiv"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "text": "The movie is the worst  that I've seen .",
      "total_reactions": 0,
      "user": "MysteryHoodedM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "text": "After the first... maybe 3 minutes? I wanted to walk out of the theater. It was inexcusably bad. The Scary Movie franchise gets worse and worse as more come out. The cover up of celeberties  Snoop, Mac Miller, or Charlie Sheen did not hide the fact that the comedy in the movie was beyond poor. I laughed maybe twice.",
      "total_reactions": 0,
      "user": "Freemann098"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2015
      },
      "score": 3,
      "text": "It would be hard pressed to produce a worst film than Scary Movie 5. It is a horrible abomination on almost every level and just flat out embarrassing to even look at. You will feel like you died inside every second the movie passes by.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2013
      },
      "score": 1,
      "text": "Why are there five of these stink bombs?  I can't believe the same guy who made the very funny Airplane continues to make such horrible decisions.  The only positive is that the movie is only an hour.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "I actually liked the Scary Movie franchise, but after seeing this one I hope they just end it. The only redeeming qualities of this movie were that it had some funny parts, such as the Black Swan parody. I felt that there was not much focus on actually parodying scary movies, and too much on movies like Inception and Stuart Little. Other than the Black Swan bit, which seemed to be well thought out, the rest of the movie was filled with pathetic attempts at humor. I think it's time to just end the franchise, and the parody cow has been milked enough.",
      "total_reactions": 0,
      "user": "arnyftw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "I expected so much from this movies, even more after watching the previous 4 movies that where so good and i laughed like crazy, but this one blown everything, i really expected this movie to be so good! But ended up being a big disgrace and left me so sad about thee loss of quality from the previous movies, not even half of the previous movies Scary Movie 5 has. Shame on the people who ruined this series! But i recommend you to see all the other 4 before watching this piece of crap that is almost un-watchable.",
      "total_reactions": 0,
      "user": "SilentINU"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 2,
      "text": "A sad excuse for a movie. As far as I am concerned, the series is dead. Except for a couple of ridiculous scenes that actually managed to make me laugh, this is an embarrassment to cinema.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "It saddens me how people still pay to see movies like this. None of the 'Scary Movie' films are good, but this one is just terrible, and compete directly to 'Movie 43' for worst movie of the year.",
      "total_reactions": 0,
      "user": "Murozaki"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "I enjoyed seeing Charlie Sheen and Snoop Lion on screen but Scary Movie 5 is pretty awful. I'm ashamed to have laughed at the worst jokes because of how bad they really were. It's like having your favourite movies of the past few years ruined. Watching people get smacked on the head is funny the first few times but drilling it into the movie was a huge mistake. You expected it to be horrible and it was. Here's waiting on the next 5 scary movie entrances that are sure to come.",
      "total_reactions": 0,
      "user": "M0vieAddict"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "this is not a good movie..do not watch it! it contains no funny parts and as we all know it slapstick comedy is the lowest form of comedy! god dammit who the hell makes such movies???",
      "total_reactions": 0,
      "user": "kirito_critic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "Gets one, for the One good seen it had with snoop. Otherwise Worst movie ever!!! It's like they didn't even put any effort into it, didn't laugh a single time",
      "total_reactions": 0,
      "user": "henneph"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "Compared to the first two \"scary movies\" Scary Movie V is atrocious, insulting and looks as though it's been written by a 5 year old whose parents spend their days humping and shooting up. The non stop racist jokes are appalling. I really can't see how this movie was allowed to be made. And the spoofing of Cabin in the Woods and Mama was just lazy. 1: Cabin in the Woods was already a parody and 2: the Mama storyline was taken verbatim. This film isn't even good enough for a stoner",
      "total_reactions": 0,
      "user": "Navz6289"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "I must agree with most reviews; \"Scary Movie V\" is not exactly worth your money, but that doesn't mean it's not worth your time. If you're expecting a story driven comedy drama with superb acting that will leave you with an \"awe\", this is not it. If, however, you're looking for a parody that brings some ridiculous laughs, it is all that. The movie cracked me up at some points due to its dry and stupid humor, which isn't a bad thing at all! (Yes, especially you had me laughing, \"electronic toothbrush\"...) As someone who enjoys the best of movies, I have to agree that this one was fun to watch too, as long as you start seeing it knowing you'll have to rely on your immature state of mind.",
      "total_reactions": 0,
      "user": "Duskspark"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "Each and every film of this series has become progressively worse but this one takes the cake...and then uses the cake to make a bad slapstick joke before ending with a tired pop culture reference and fart joke.  The parodies in this one are either lazy, make no sense or are filled with humor so bad that it makes sophomoric humor look intelligent, witty and sharp.  The acting is atrocious and, overall, the film is an incredible waste of time.  \"Scary Movie V\" is so bad it is capable of robbing the viewer of being able to ever feel happiness again.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "This series has completely run out of steam. It used to be a horror movie inspired spoof flick, but now, it's just a clumsy piece of slap-stick production. The cast was also poorly chosen in this one. They just can't do without Faris.",
      "total_reactions": 0,
      "user": "film_bug"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "This was OK, and it did get a few laughs out of me, especially scenes that spoofed movies that I have seen. It was a good way to waste an hour and a half. I liked it, but I think that the last one was funnier. The poster wasn't entirely truthful about all of the movies that it spoofed.",
      "total_reactions": 0,
      "user": "AVTRlover41"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "This movie would have been funnier if Regina Hall and Anna Faris were in it instead of Ashley Tisdale. Because of the casting error, I think the jokes fell flat. Or everyone is just tired of \"Paranormal Activity\" spoofs.",
      "total_reactions": 0,
      "user": "BWETMatangi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2013
      },
      "score": 4,
      "text": "The lowest form of comedy. Scary MoVie fails at being funny, fails at being enjoyable and fails at having a story. They couldn't even manage that! However it does succeed at not being boring. Although that isn't exactly very hard.",
      "total_reactions": 0,
      "user": "python2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2013
      },
      "score": 2,
      "text": "Shut this overly stupid unfunny piece of garbage off after 15 minutes.  Fall flat jokes, stupid dialogue, worn ideas.  Pure trash. Unwatchable.  I fell sorry for you if you enjoy movies of this standard.",
      "total_reactions": 0,
      "user": "Xanifur"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "Hate me, but I kind of enjoyed this. The only reason I saw this fifth installment in a movie series I never heard of was because my friend said it was the funniest movie ever. A bit inappropriate and the strings for flying effects are obvious, but giving this the score it's been getting is an exaggeration to me. Jason Friedberg and Aaron Seltzer are directors that spoof popular ones, and I haven't seen any of their movies but I really think they have yet to make a movie that shows off their real talent. Yes, they didn't direct this one, but they were a part of it. And hey, at least this isn't as creepy as Vampires Suck seems nor as immature as the upcoming Starving Games.",
      "total_reactions": 0,
      "user": "InverseCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2013
      },
      "score": 2,
      "text": "Scary Movie (2000) is a classic spoof movie, and was a very promising entry in the series, after three not-that-bad sequels, I was excited for Scary Movie 5, after the long hiatus. Before it came out, I did some research on IMDb, and saw the low 5.3 rating, on par with the last 3. Although, the Metascore was much lower, but I expected it to be. One major thing I noticed was that this movie would not feature Anna Faris, and their was a new director, whose filmography was terrible, but I looked on the bright side. When I saw this in the theatre, I was appalled. It didn't even feel like a 'Scary Movie', it felt like someone shoved a flaming metal Lego in my eyeball. This movie was complete sh*t, and even people in the theatre were as quiet as rocks, and they were teenagers! This movie was short,p and stupid, and it parodied sh*t movies. The only scene that was SLIGHTLY amusing was the opening scene with Snoop Dogg, and even that was stupid as f*ck. This movie TOOK A SH*T all over the original. 2/10.",
      "total_reactions": 0,
      "user": "Lelandskell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 0,
      "text": "This movie is a piece of sh#t, and it's the worst \"Scary Movie\".",
      "total_reactions": 0,
      "user": "PmLvgn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2013
      },
      "score": 0,
      "text": "This \"Movie\" is probably one of the worst Movies I've ever seen. I wouldn't even call this comedy, because it's just pure garbage. The \"Jokes\" are old and not funny at all. Please end this horrible series  Even the first one was just okay in my opinion.",
      "total_reactions": 0,
      "user": "Muffiman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2013
      },
      "score": 1,
      "text": "Not wearing the latest style utilizing highly recognized horror movies old and new, the unique horror movies that use this are: Mama, Infernal Possession, La Cabaña and Paranormal Activity terror. This was coming since last giving that put Wars worlds, here on Planet of the Apes (R) evolution, The Black Swan, Inception and for a moment to put the book \"Fifties shades of Grey.\" I did not laugh. Ashley Tisdale disaster. Little participation by many as Mike Tyson, Charlie Sheen, Lindsay Lohan, etc.. There are many scenes that made me laugh in the trailer that they had not. It shows that not Anna Faris.",
      "total_reactions": 0,
      "user": "JNOTR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 2,
      "text": "A mesma piadinhas em graça que acompanharam a série nos últimos filmes porém esse filme bate o cúmulo do ridículo nas alturas se tornando desagradável.",
      "total_reactions": 0,
      "user": "Iky009"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "This movie is awful, I mean this makes the originals look like Spaceballs, or Hot Shots, the only barely entertaining part of this movie is the cameos of Charlie Sheen, and Lindsay Lohan, think about that.",
      "total_reactions": 0,
      "user": "Leo9127"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "Garbage just plain garbage. Horrible story line. Some funny parts along the way but most of the laughs feel forced and fake. I'm embarrassed to say that this is part of the scary movie franchise",
      "total_reactions": 0,
      "user": "MissDrae"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "Please, just stop making these movies. They are not funny nor entertaining. They've become jumbled messes of loose plotting and thrown together dialogue. This has to stop!",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2014
      },
      "score": 4,
      "text": "Scary movie series were famous for spoofing other great movies. It all began with a decent first, then sequel after sequel declined its originality as well the fun parts. This fifth movie was below average, had some of the good guys in guest roles and that did not bring the movie upwards. I don't know what's with the Snoop Dogg and Mike Tyson's cameo, anyway the movie was almost crap.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2014
      },
      "score": 1,
      "text": "No just no. the scary movies are just **** to **** every time there is new one.This one is by far the worst, i don't know if they can do worst because it's not even funny once and i ******* hate this movie.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 0,
      "text": "Now I have always loved this series, at least the first 3 films, but this is just so bad. It's not stupid funny like the others, it's just stupid. Tisdale is respectable in this film, but the plot sucks. What made the other 4 films better was that their main film that was being parodied was one everyone saw, not everyone has seen Mama, it wasn't a huge film in the box office. The jokes are stale, and any moment when a little bit of comedy shows it's face, it is immoderately lost among the pure crap that is Scary Movie 5",
      "total_reactions": 0,
      "user": "Jamison12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "text": "unbelievable how **** **** this movie is. how the **** you **** up that Franchise, even the 4th one is solid and then is this retarded    ****",
      "total_reactions": 0,
      "user": "iCronic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2014
      },
      "score": 3,
      "text": "Scary Movie 5 was terrible. Not funny at all, and when it was, I would only partially chuckle. I wouldn't chuckle entirely and it wouldn't make me laugh at all. Basically an Adam Sandler \"comedy\".",
      "total_reactions": 0,
      "user": "chw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "I don't usually give movies a zero but this movie is an exception. In my opinion, the Scary Movie series should have stopped at 3. The jokes are stale. The casting was horrible and the plot was terrible. Time for this series to stop.",
      "total_reactions": 0,
      "user": "rafingal23"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2014
      },
      "score": 0,
      "text": "Full of crap. Yeah, first movie was good, but Scary MoVie not even close to the \"good\". Lay down and look at the ceiling, that will be more entertaining.",
      "total_reactions": 0,
      "user": "BekoTuran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "Scary MoVie was so stupid, so stupid it was funny. The stupendous comedy is the only reason the movie is a 4 out of 10. Vacuums snorting cocaine, LMFAO.",
      "total_reactions": 0,
      "user": "REDWOU"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "Scary Movie 5 me dejó un poco sorprendido, esperaba una película mala que contendría un débil atractivo, sin embargo (y para mi sorpresa) fue otra historia.",
      "total_reactions": 0,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "Definitely not as bad as I thought it was going to be. That being said, Scary Movie 5 is a generic spoof comedy with generic jokes that are derived from its predecessors, but do generate a few chuckles here and there. Overall I would not recommend this movie to anybody. 4/10",
      "total_reactions": 0,
      "user": "BB_Critic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2015
      },
      "score": 1,
      "text": "Roteiro fraco e personagens que não impressionam fazem de Scary Movie 5 um dos piores filmes de comédia já lançados até então, Ashley Tisdale é o único motivo deste filme não receber nota zero nesta avaliação, pois apesar de seu papel não convencer se conseguem boas interpretações, e certas piadas funcionam (de forma precária) com a mesma, porém fora isso, o filme é uma vergonha para qualquer admirador do gênero ou da franquia.",
      "total_reactions": 0,
      "user": "LucasTReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2015
      },
      "score": 2,
      "text": "The worst of the saga Scary Movie (by far ) not caused me any laughter and new actors didnt had any joke. A small note to the participation of snoop dogg that still made ​​me smile a little.",
      "total_reactions": 0,
      "user": "FrenziedPanda99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2015
      },
      "score": 3,
      "text": "Very, very disappointing. I'm a fan of the Scary Movie series (besides Scary Movie 2) and was very disappointed by this entry. I even enjoyed Scary Movie 2 more than this atrocity! If anything, this movie got a couple of chuckles. At least in Scary Movie 2, there were scenes that made me laugh for longer than 30 seconds. This one, only got a couple chuckles. It's sad.",
      "total_reactions": 0,
      "user": "NinthDoctorGuy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2016
      },
      "score": 1,
      "text": "To pretty much sum up Scary Movie 5, it's by far the most unoriginal parody sequel spoof everyone will see in a theater near you or in a DVD everywhere you go.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2016
      },
      "score": 3,
      "text": "HORRIBLE",
      "total_reactions": 0,
      "user": "Pachekovisk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2016
      },
      "score": 7,
      "text": "While I rate other scary movies a 10 this one gets a 7 and why? Well the jokes are good and acting is okay but in the middle of the movie it just gets boring and the jokes don't have charm.",
      "total_reactions": 0,
      "user": "GamecubeLover"
    }
  ]
}