{
  "mc_avg_user_score": 6.9,
  "mc_metascore": 34,
  "mc_mixed_rating_frequency": 5,
  "mc_movie_name": "Scenic Route",
  "mc_negative_rating_frequency": 0,
  "mc_positive_rating_frequency": 9,
  "mc_pro_critic_reviews": [
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 75,
      "summary": "It's no \"Taxi Driver\" or even \"Open Water,\" but Route has enough attractions to warrant the trip."
    },
    {
      "critic": "Rob Staeger",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "Kevin and Michael Goetz's direction emphasizes the remoteness of the setting. The howl of the desert wind and the unflagging hammer of the sun are the backdrop for every bad decision, lending them a plausibility they wouldn't have in comfort."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 60,
      "summary": "The movie becomes a survival tale and is more successful in its grueling, slightly crazed second half.  The Goetzes do a better job capturing the terrain's physical extremes and the challenge of endurance than they do depicting a relationship."
    },
    {
      "critic": "Gabe Toro",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "For Scenic Route, it doesn’t seem to be the journey as much as the destination: seeing two sorta-friends wailing on each other feels like the shortcut a better movie never made."
    },
    {
      "critic": "Mike D'Angelo",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "Duhamel and Fogler play off each other nicely in the early going... The arguments and contrasting worldviews are banal, but the relationship feels genuine."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "The first half of Scenic Route is basically a filmed play, and not an insightful one. The more surreal second half takes on a moodier edge, but the switcheroo ending is cutesy to the point of annoying. Fogler impresses with some brooding edge, but neither he nor the location photography is enough to recommend you join him on this doomed trip."
    },
    {
      "critic": "Inkoo Kang",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 30,
      "summary": "While the narrative spins in place, Kyle Killen's script throws out one uninspired gambit after another to extend the film to feature length, eventually climaxing with dual endings, both contrived."
    },
    {
      "critic": "G. Allen Johnson",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 25,
      "summary": "Sometimes indie pictures like this, with over-the-top acting and outrageous situations, are meant as a calling card for its creators - a chance to show their wares to others in the industry. So calling all producers, there is one tour-de-force performance in Scenic Route: the makeup team of Brian Kinney, Sara Robey and Maia Wagle. Admire their work, and bring earplugs."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 20,
      "summary": "An awkward, long-winded mash-up of therapy session, horror movie and survival tale with pretensions of psychological depth."
    },
    {
      "critic": "Scott MacDonald",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 16,
      "summary": "Digital projection has made it easier than ever to get no-budget movies onto theater screens. That might sound wonderfully egalitarian, but it mostly just leads to more shoulda-gone-straight-to-DVD clunkers like Scenic Route."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "I thought it was a really good ride, maybe some will think it slow but if your dialed In to what these guys are saying you'll see a real life story. Great job all around, writers, actors, and all who got this to the finished product.",
      "total_reactions": 1,
      "user": "Brokenspoke"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "It was a slow-paced movie but it was enjoyable if you know what's really going on, but over all the movie was still fun. Great acting and Good but slow story",
      "total_reactions": 0,
      "user": "mikka_nikaa2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2013
      },
      "score": 6,
      "text": "The main actors do a very respectable job of portraying the tension between them.  And I love the  minimalism of the film, which is mostly set on a stretch of desert road over the course of a few days.  The payoff was not what I expected, and not as good as it could have been.  Overall, this was an interesting look at what people are really like when you remove all the niceties.",
      "total_reactions": 0,
      "user": "himeeg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "With all the independent films today, Scenic Route packs a refreshing dose of originality and superb acting. Making good use of the surroundings and situations, the film really pushes the bar of human thought and really examines how much one can take.",
      "total_reactions": 0,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "Scenic route takes a few different routes itself. The film has comedy elements, drama and a survival plot to it and, while it is not a great film, it succeeds in all three of them pretty well.",
      "total_reactions": 0,
      "user": "ryanneevman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "\"Scenic Route\" 10 Scale Rating: 5.5 (Decent) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    }
  ]
}