{
  "mc_avg_user_score": 8.3,
  "mc_metascore": 69,
  "mc_mixed_rating_frequency": 73,
  "mc_movie_name": "Scott Pilgrim vs. the World",
  "mc_negative_rating_frequency": 65,
  "mc_positive_rating_frequency": 856,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 12,
      "pos_reactions": 43,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Absolutely fantastic!  There is a reason I believe that Edgar Wright is THE best film director we have today, and SPvTW adds to it.  Wright fully captured the essence of the gamer/gen-Y crowd and the modern teen comedy.  Creativity oozes out of it. It's a movie that isn't afraid to not take itself seriously.  I can definitely see how a critic or viewer would give it a low score, because they just don't get it.  It doesn't interest them.  It's ok!  It won my heart.  I smiled the whole time.  If you love games, subtle humor, any of Edgar Wrights past films, teen comedies, or fresh ideas...Go see this film!",
      "total_reactions": 55,
      "user": "Billyliar87"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "Best surprise of the summer. This movie rocked, and I'm not even a gamer, comic book guy, or a musician. Plain and simple, Scott Pilgrim vs. the World was cool, awesome, and creative. Maybe a pre-requisite for this movie is to have seen any other Michael Cera movie. Because seeing this scrawny guy fight and kick butt was a blast! Every battle was quite fun and I was well-entertained.",
      "total_reactions": 8,
      "user": "AaronM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "Let me put this lightly: if you were born and raised on video games, or are even familiar with games like Zelda, Street Fighter, and Mario, you will enjoy, if not love, this film. The fast paced editing wrapped around the surprisingly good performance by Micheal Cera, supported by a great cast and excellent music make this a great watch.",
      "total_reactions": 1,
      "user": "KarthXLR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2010
      },
      "score": 6,
      "text": "If ever there was a fine example of style over substance, look no further than SPvTW. Not that this detracts from the film as an experience, but it does lack the flesh of Wright's previous work. The characters are mostly likeable and well played, although the script is lacking in certain areas. There may be points throughout the films duration when you wonder \"Do I care as to this films conclusion?\" such is the lack of depth to the storyline, but it still carries great production values and presentation - enough to last the course of one film, at least.",
      "total_reactions": 1,
      "user": "ReReview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "Scott Pilgrim vs. the World is quite a odd, funny, and likable movie, with references to video games, and likable characters (except Ramona she was annoying), this a great movie with only a few design choices holding it back from all it could be.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "Really an excellent movie. If you grew up in the 90's this movie probably carries a lot more meaning and humor, but I can see this appealing to anyone. You can't really pin the label comedy on it either, the movie really contains humor, drama, and action. The video game theme really ties the whole movie together, it moves fast, its really flashy, you can really sympathize with the characters, and by the end you feel like you've gained something. Very few films 2000-2010 are this inventive and break the mold as much as this film did. This is the first movie i've genuinely enjoyed A LOT in a year or so. highly recommend to anyone",
      "total_reactions": 1,
      "user": "dubstepbreaks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "Scott Pilgrim is a good graphic novel series. Normally when books get turned into films, it ends up worse than the book. However in this case, the graphic novels are good and the film is excellent.",
      "total_reactions": 1,
      "user": "PolisKanin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "The Movie is over the top,Silly,dumb,stupid but in a right way,it is also hilarious.This movie is worth to watch with friends with awesome visuals and a good laugh will surely be there.",
      "total_reactions": 1,
      "user": "JohnKristofer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "Much more watchable than I expected it to be. I thought the director might try to transform Cera in the typical alpha male, but I'm glad that side of him was restricted to the fight scenes. As my pal KK mentioned after the film, unlike directors of many action films, Wright made the contests  less a \"blur\" of violence and more a very linear, easy-to-follow experience that is artful and interesting.  The women in the film are uniformly excellent - except for Knives - I could have used less of her fawning.  And some serious props to Brandon Routh and KIeran Culkin - it would have been a lesser movie without their hilarious performances.",
      "total_reactions": 10,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "Anyone seriously criticizing SCOTT PILGRIM for lack of believable romantic development, narrative, etc. is missing the boat. This is neither drama nor comedy--rather, it's an homage to, and riff on, a subculture and a period in time, so heavy with visual spectacle that it'll make you queasy at the same time you can't stop gorging yourself on it, and topped with a low-calorie sauce of Humor Lite.",
      "total_reactions": 9,
      "user": "leahzero"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Go watch this, you will not regret it!",
      "total_reactions": 9,
      "user": "Phillipz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "So clever. So funny. So perfect. Edgar Wright understood the comic and captured its sweetness, nothingness and meaningfulness in the movie. I loved the mix-in of comic book panels. Michael Cera pulls it off. Kieren Culkan stands out as Wallace.",
      "total_reactions": 4,
      "user": "Granite"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "As a massive fan of the graphic novel series I couldn't wait to watch Scott Pilgrim. Not to mention I love Edgar Wright as a director however no matter how much i love the film it has its major shortfalls. The biggest problem I found was that all 6 books have been crammed into one 2 hour film meaning a lot of detail has been cut out, some of the story had been changed to fit in with the cutting out of content which I felt was wrong and it was all over too quickly. I could not think of a better Scott than Michael or a better Ramona than Mary, the rest of the cast was excellent and great acting. Unmissable but not as good as the books",
      "total_reactions": 4,
      "user": "potatoes351"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Just amazing. It may not follow the comics perfectly, but SPvTW is truly an epic win. Winning characters, hilarious dialogue, flashy visuals, everything about it is amazing. Thank god they didn't put this in 3D. Otherwise my head would explode.",
      "total_reactions": 14,
      "user": "SPfan678"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Holy crap this was amazing. Completely aimed towards hipsters and comic/video-game nerds, but anyone could watch it and have a great time.  The crowd was great opening night... laughed with everything and just fun to be around.  If you havent seen this movie yet, read the comics then GO SEE IT NAO.",
      "total_reactions": 7,
      "user": "pianomanrd91"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Fantastic fun. So long as you like to have a good time, you should. Bring some friends, grab some icees, and enjoy the show. Seriously, this is a silly movie. Don't have your head in your ass, just go to have a good time and watch Scott kick some evil ex-boyfriend/girlfriend ass.",
      "total_reactions": 10,
      "user": "Raphael"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "The movie is a mind-f#$%ed world that it looks like a video game! Scott Pilgram Vs. The World is an entertaining movie that shows action with great stunts that the character is fighting like a champion to face against all people that refer to Mario from \"Super Mario Bros\" and Link from \"The Legend of Zelda. Michael Cera did great as a character named Scott Pilgram and he's more funny in many other films. The characters are so interesting,I really love Mary Elizabeth playing as a hot girl with different colors in her hair named Ramona Victoria Flowers and she did a good role. So does the other characters and I like the way they acted like their in a video game to face against Scott Pilgram. It has alot of joustings everywhere in scenes,where Scottt is fighting a villian with jump shots  and facing each other. The vissual effects are very interesting and more updating around the place and it has funny words and subtitles in the movie like that. So I hope that you will enjoy this movie,it's very good,very funny,and the movie has a good perspective based on the comic book for the fans. Enjoy this movie and it's a mindless fun and push the start button to play as Scott Pilgram and begin!!!",
      "total_reactions": 9,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "It had a amazing, stylish and unique presentation coupled with a great cast, light-hearted comedy and romance, which is topped off by over-the-top kinetic action sequences. It was a throughly enjoyable experience. A very good and fun movie.",
      "total_reactions": 6,
      "user": "Harbinger"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "I don't have televisions so I missed the hype.  I haven't read a comic book in fifteen years and (unfortunately) both my thumbs tend to lock up from previous injuries so video games aren't a part of my life (except for online poker and scrabble).  All that said, I thought this movie was adorable and technically proficient.  The only real question should be how effective is it in the film medium to consistently and irreverently poke holes in the fourth wall (look it up if you must).  Not many films can pull this off without stealing the energy out of a scene, and even fewer can do it and add multiple levels of texture and charm.  This film is NOT an exercise in depth, it's the opposite.  It's an experiment in the relative unimportance of all thing pop culture.  Here no one is trying to figure out anything or learn something new, it's just an internally laconic, externally  hyper active cycling through the the various digital entertainment streams which construct the world through which young people attempt to relate to each other.  It's channel surfing, while gaming, while IMing, while occasionally replying to the voice coming from your ear bud.",
      "total_reactions": 3,
      "user": "skantea"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "Creative, witty, and visually striking. Scott Pilgrim is a blast to watch and I picked up even more subtle jokes and pop culture references hiding within  scenery in the second viewing. Maybe the best comedy of 2010?",
      "total_reactions": 3,
      "user": "Zorgly"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "This was a visually amazing film, and considering that this film is based on a 2D video game, I have to say I was very impressed by the storyline. The acting was just ok ,but I enjoy all the different characters and their abilities. Great film!!!",
      "total_reactions": 3,
      "user": "MrC3030"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "Funny everywhere. But Cera is a bit of a bore sometimes, other than that I pissed myself of laughter just simply watching this movie.",
      "total_reactions": 3,
      "user": "Dylanmc12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "Just a charming, funny and quite awesome Movie about a nerdy guy fighting for the girl of his dreams. Transporting an important message about the fight of life.",
      "total_reactions": 3,
      "user": "Verdugo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "Wow! What a great movie. Comedies like these tend to not settle well for me, so I was very skeptical about this one. I gave it a shot and it did not disappoint. I absolutely loved this film! A smart, unique film that cannot be missed. I love the way the video game sounds and comic book images were incorporated. It truly sets this film apart. I must mention the dialogue; a great script with perfect lines at the right time. So hilarious! \"You punched my boob....prepare to die, obviously,\" \"You made me swallow my gum. That's going to be in my digestive tract for 7 years.\" At times, the clever, bizarre, quirkiness of this film left me in a state of confusion as to whether or not what I was watching was literal. However, in this particular film, the confusion is part of the joy of watching. It's oddity is so brilliantly executed that the seemingly ridiculous story makes for a very good film. I absolutely loved it!",
      "total_reactions": 3,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "One of the most unique and entertaining visual experiences I have seen. Edgar Wright adds yet another fantastic movie to his ever impressive filmography.",
      "total_reactions": 3,
      "user": "Longbottom94"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "First things first, it was Not a cut and paste of the books.",
      "total_reactions": 20,
      "user": "hyperwant"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Amazing film. I went to see the midnight showing with about 16 friends and not one of us left the theatre disappointed. It truly is a fun movie, so much so that I don't think there was a single part during which I was not smiling. Granted, there are some minimal things that one should consider. This movie is NOT for everyone. Edgar Wright clearly made this film with a target audience in mind; but that's okay. If you go in with an open mind and expect to have a good time, you should be pleased. I stress the fact that some people may not like this movie; those who are not in sync with their inner geek or are under the age of 25 (it's an incredibly fun movie, you don't necessarily have to be a geek or hipster to enjoy it!) will probably find it best to spend $10 watching something else. As others have said, if you're a fan of Wright's older work this should be up to par if not better. I have no doubts that this film will be a cult hit in the years to come. The actors are great, the music is fun, and the fight scenes are pretty epic. 15/10, can't wait to watch it again.",
      "total_reactions": 10,
      "user": "Phantasmal"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Absolutely fantastic! There is a reason I believe that Edgar Wright is THE best film director we have today, and SPvTW adds to it. Wright fully captured the essence of the gamer/gen-Y crowd and the modern teen comedy. Creativity oozes out of it. It's a movie that isn't afraid to not take itself seriously. I can de",
      "total_reactions": 5,
      "user": "insanitycheck_1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "Whenever Michael Cera is in a movie, there is always a connection between the Independent world and mainstream media.  In other words, Cera usually stars in movies with an \"Indie\" theme but is geared towards the general audience (i.e Nick And Norah, Juno).  In this case, Edgard Wright's (Shaun Of The Dead, Hot Fuzz) Scott Pilgrim Vs. The World explores the world of pop culture using a combination of video games and indie rock.",
      "total_reactions": 5,
      "user": "RyanGee"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "I am about to list words that describe this movie. Amazing, revolutionary, groundbreaking, mind-blowing, creative, original, action-packed and hilarious!! I saw it at a midnight showing, and my entire world was changed!! The tagline's \"An epic of epic epicness.\" I'm here to say that the tagline doesn't lie. The haters may think that its random and stupid!! Well, you people are wrong! Edgar Wright is an amazing director!! From the very beginning with the Universal logo turned 80s video game, to the final battle, this movie is endlessly engaging, extrememly original, and so freaking funny!! Michael Cera usually plays an insecure little nerd. Here, he plays a butt-kicking video game addict!! Mary's is perfect as the mysterious but sexy Ramona Flowers. Kieran Culkin steals every scene he's in as Scott's hilarious gay roommate who always wakes up with one or more dudes in his bed. Ellen Wong's great as Scott's stalking 17 year-old exgirlfriend. The exes, especially Lucas Lee, Matthew Patel, Todd Ingram, and Gideon are great!!Anna Kendrick, the members of Sex-Bob-Omb, and everyone else is pretty good, too. And that was just the cast!! The dialouge is very clever and freaking hilarious!! Also, the film is brilliantly directed by the great Edgar Wright, who showed us with Shaun of the Dead and Hot Fuzz that he could direct some neat scenes, proves with this movie that he should be up there with George Lucas and Zack Synder. The video game battles are exciting and thrilling!! The video game references are cool, too. An honorable mention goes to the choreographer, Bill Pope, who along with the great work he did on this, also did the Matrix movies, the Spiderman movies, and some Jackie Chan movies. The bottom line is, this movie is unlike anything ever made!! Action-packed, hilarious, and with a good heart, you'd be a fool to miss this movie!!!",
      "total_reactions": 7,
      "user": "Bullet97"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Very original and lots of fun. I've been incredibly disappointed by the movies of 2010; it's been a bad year for movies. This one doesn't redeem the entire year, but it helps a lot.",
      "total_reactions": 6,
      "user": "Daniel"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Quite possibly the best comic book to film adaptation made so far. The differences between the comics and the movie are perfect across each medium to the effect that both are similar yet independent experiences of each other. Most characters were well cast, though some supporting characters were not as well performed by the actors as the main cast. This is a movie I will enjoy over and over again.",
      "total_reactions": 6,
      "user": "DBal"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "A brilliant film that uses comic book and video-game logic to make even the most tired themes fresh and palatable. Though filled to the brim with obscure video-game references and Canadiana, the movie has enough sight-gags and charming characters to keep all but the most closed-minded from being alienated.",
      "total_reactions": 6,
      "user": "MyNameIsNobody"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "\"Scott Pilgrim vs. The World\" is ridiculous and unpredictable. That's why I loved it.",
      "total_reactions": 6,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Movie pretty much was better and much different than i expected. It helps that it doesn't try to be anything more than entertaining and visually-stunning, which it most certainly is",
      "total_reactions": 4,
      "user": "opennoise"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "A fantastic adaptation and a great film that can be appreciated outside its painfully indie-comic source material.  Brilliant and inventive visuals, well designed sets, an ace script, and impeccable cast makes the manic pop-culture mayhem go down easily for anyone who didn't know that Pac-Man's name was changed from Puck-Man.  It's wonderful to see a film that is comfortable in its own skin and then delivers such unique virtuoso entertainment that multiplies upon repeated viewings.",
      "total_reactions": 4,
      "user": "shinhito"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "one of the best movie I saw in years! very original and fun. But for my suggestion is to read the books before going see the movie. I went with one of my friend that didn't read the book and I think I was more enjoyed than he was , and he was! The only problem is that this movie is not for everyone, you have to be a little geek to understand all the jokes and I'm probably sure that my parents wouldn't like this movie. The visuals effects are amazing and all i have to say is they made a great adaptation.",
      "total_reactions": 4,
      "user": "Menekis"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "An amazing film with ingenious creativity. This movie simply transcends the videogame/comic genre and creates a utopian vision of cinematic brilliance. It is extremely visceral to watch and is idiosyncratic in its humor. It is like no other film and revolutionizes what a film can consist of. It is somewhat reminiscent of Inception due to it somewhat abstract concepts. Great film.",
      "total_reactions": 4,
      "user": "valiantpacifist"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Edgar Wright was already one of my favourite directors after being responsible for Shaun of the Dead and Hot Fuzz. He has established himself further into the good books with Scott Pilgrim vs The World. I knew as soon as I saw the 8-bit version of the Universal Pictures logo that this would be an awesome film. Michael Cera was the ideal person to cast as Scott Pilgrim in my opinion. He didn't come across as somebody he is not and the dominant side of his personality only came out in the fight scenes and that is how it should have been. The editing and the motion graphics/special effects were amazing and added a lot to the film. The opening titles were representative of what the movie was going to be like and it didn't disappoint. It's original, creative and most importantly humorous. There are many ways you can read into the film in regards to the theme and message it is trying to get across but it is, to me, about the extent an innocent geeky teen male will go to, to get the girl of his dreams. Ramona Flowers was hot too, even if she didn't seem to care too much about Scott throughout.",
      "total_reactions": 4,
      "user": "JamesNWA"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "I'll admit, I didn't like the idea of Michael Cera in a lead role. He plays the nervous, kinda-wimpy role in each of his films, and thats good as like a sidekick, or a co star, but didn't think he could pull it off. Then came Scott Pilgrim I'll spare any plot explinations, as you probably know of this already, and get straight to the reviewing. The video game references are lined throughtout the film, from the 8-bit Universal logo to the defeated villians turning into coins. This film proudly shows its roots, along with animated sequences that look like they've come straight out of the comic book. The evil exes are quite formidable foes, but Lucas Lee has to be the best one, purely because of Chris Evans' portrayal (can't wait to see his Captain America) its a shame Lee isn't on for longer, cause every sentance that escapes his mouth is a riot, but he wasn't on for much longer in the comic, so it fits perfectly. We gotta give a big hand to the supporting characters. Knives Chau's obsession over Scott doesn't border onto annoying, and she goes to great lengths to win back Scott, even (failingly) dying her hair Ramona blue. Kieran Culkins character has to be my favourite character of the entire film, from his texting of Scotts life to his sister, to his coming onto the sisters boyfriend, he cannot go through an entire scene without brightening it up or spouting a funny comment (especially at Sex Bob-Ombs rival band) Gideon Graves is quite the formidable villain, I won't spoil the evil things he does but they fit when this film is setting him up to be the final boss. The fight scenes are brilliantly done (especially with Swords involved), the character moments are sweet, the humour is pitch-perfect, the characters are fantastic, and the evil exes are quite menacing. Scott and Ramonas romance is so lovely. Here, it seems to be a mere fling of the moment, while in the books its more of a serious relationship, and yes, parts have been sacrificed but i think Edgar Wright chose wisely. Kudos to Scott Pilgrim VS The World, and of course to Michael Cera, a great choice for the lead",
      "total_reactions": 4,
      "user": "roddersj04"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "Pretty awesome stuff. Scott Pilgrim had a lot of heart, humor and kick-ass fight scenes. The final battle seemed to go on longer than it should have, but otherwise the pacing was great. Also, Scott's gay roommate was one of the funniest and most charming new characters I've seen in the movies recently. But the other characters are good too. Overall a great movie.",
      "total_reactions": 2,
      "user": "DeVr33z"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "Scott Pilgrim vs. the World was flat-out hilarious. The only place it looses points is with a touch of somewhat redundant humor and the stagnant flow of the plot in the latter half of the movie. However, I think most shortcomings are made-up with the original and artistic depiction of Scott Pilgrim that stays true to its comic roots. I would definitely recommend seeing the film, especially if you enjoyed Hot Fuzz or Sean of the Dead.",
      "total_reactions": 2,
      "user": "tyler_hess"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Other than feeling a little rushed in some areas, Scott Pilgrim proves to be one of the summer's best films and a great ride. Get your butt in that theater!",
      "total_reactions": 2,
      "user": "Maciech42"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2010
      },
      "score": 6,
      "text": "This movie is quite random because it presents so many themes and it goes at such an incredible speed that is easy to get lost. But the main problem with the film is that it fails to unite the fantasy with the reality. The movie starts with real life normal events until Ramona appears and all this fantasy starts to occur and suddenly Scott becomes powerful with no particular reason. It's not that the idea it presents are fun, they are and the movie definitely offers a lot of comedy. But sometimes it just exaggerates too much out of proportion it's fantasy and forgets that they are still in the real world.",
      "total_reactions": 2,
      "user": "Sonicphoto"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "\"Scott Pilgrim\" had such promise, the hopes and dreams and of comic geeks and video game nerds (such as myself) wanted it to be awesome. What was given to us was a film that starts off extremely slow, is fraught with awkward acting, and wallows around in a plot-less daze for the first half. Thankfully it picks up in the end with some very juicy actions scenes, and well placed references to gaming pop culture. The ending seemed a bit artificially attached on to make way for sequel turf, but overall, a good friday movie.",
      "total_reactions": 2,
      "user": "Bigboy1138"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Not only is this movie fantastic, epic, and awesome, it is everything else you can possibly imagine being a nerd in a generation filled with texters/internet junkies/video gamers, and just nerds in general. Anyone who always wished that movies were more like video games, well here it is folks. In pristine form. Not only is the movie consistently funny and hipster-approved, it is also something that will set the bar for new movies aimed at gamers. Some people didn't like it sure, because they didn't get it or whatever. But who cares about those squares. This movie rocked. Period",
      "total_reactions": 2,
      "user": "kewlgaynerd"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "It's funny, cute, stylish, nerdy, musical (not a musical, but musical as an adjective), and sometimes surprising. My co-watcher and I loved it. I seemed to laugh at some things she didn't find amusing, but  these moments were rare and probably due to my solid grounding in video-game subculture. Other than those few instances, video-game knowledge was not necessary. It's a great movie, although not perfect. I'd definitely see it if I were you, to put it plainly xD we both decided on 8.5, and we're generous, so 9.",
      "total_reactions": 2,
      "user": "Acropolis"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "Best video-game movie ever...Amazing visual style...nice story, good characters, great music. For all of you who enjoy video games, comics and that kind of stuff is a must-see movie, satisfaction guaranteed",
      "total_reactions": 2,
      "user": "hdosorio"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2010
      },
      "score": 8,
      "text": "A fun time for everyone, and it will bring back old video game and comic book memories for adults. A hilarious film that may end on a low note, but the movie itself is a huge high note!",
      "total_reactions": 2,
      "user": "mrcritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "Life is a video game, whether you think about it or not. There's always that princess we need to rescue and there are those baddies we need to defeat. And you know, it couldn't have been better said than with \"Scott Pilgrim vs. the World\" This movie is awesome. Epic, even. (mind the Snagglepuss comment). What I think makes this movie work is that they portray this entire film like a video game, right from the opening \"Universal\" shot performed in 8-bit. I mean it, they do the music Nintendo style. That I found to be funny. The movie starts off with Michael Cera as Scott Pilgrim, even though he's playing him like Michael Cera. I'm not his biggest fan since he's played the same character in every movie from \"Superbad\" to \"Juno\". Yet, despite this, this is his best role. He's still the meek geek, but he grows a pair and kicks ass. Anyway, he's the bassist of an indie band called \"Sex Bob-omb\" (just work with me) who's currently dating a 17-year old high schooler named Knives. However, they put everything in a cross between video-game and comic book aesthetic. Anyway, while they're dating, he meets Ramona, who's sort of an indie Princess Peach. She was a damsel in distress without really being so much as a damsel in distress. Anyway, word goes out that they're going out, and now Scott has to fight her seven ex's, which is used as an implication gag as Michael Cera keeps thinking she meant ex-boyfriends. (Let's just say she was curious.) Anyway, he fights them, and every time they're defeated, they turn into coins and add up points like an arcade game. As the movie goes on, it turns out that Ramona isn't the only person with evil ex's. Scott has some of his own, and they keep coming back to his life. You have a rock queen who sort of looks like Renee Zellweger, a sarcastic ginger who's the drummer in his band, of course Knives (but she's not really evil), and I don't know if she is an ex but the sarcastic girl from \"Funny People\". But Scott doesn't fight them, he must fight Ramona's, which range from rock stars to ninja queens. My favorite evil ex had to be Chris Evans, who plays a skateboarder-turned-actor. He just played his character in such an awesome light that he even makes him talk like Clint Eastwood. My least favorite is probably the vegan one, who tries to tie not eating more than just meat to being awesome. Yeah, PETA's not high on my list, but oh well. The best part about this whole movie are the video-game style fight scenes. You actually have the Street Fighter \"vs.\" in the middle of the two, and everything is as over the top as a video game. In fact, I saw this movie to be a \"Super Mario Street Fighter\" sort of thing. Scott had to fight five guys and a girl (much like the Koopas, which also one was female) in a form of Mortal Kombat. Heck, they even did a cat fight like Mortal Kombat with a giant mallet. I'm not joking: Ramona pulls a giant war hammer out of her purse. But my favorite part of the movie also dealt with my least favorite ex: Scott Pilgrim challenges him to a bass battle. YES. A BASS BATTLE. As a bassist, my mind was blown. In fact, the music was also pretty cool. If you were to take away the video game look and feel, it would be a romantic comedy...probably without the comedy. So it'd be like everything else. So kudos to the director for giving us something with which we're familiar and telling it to us in a way we've never heard it. What I didn't like is how incredibly ridiculous certain things were, even for a pseudo-video game. There's this one evil ex who makes a big deal about being a vegan that when he drinks a coffee with half-and-half, two cops of vegans take his powers out of nowhere. Out. of. nowhere. In the end, he faces Bowser: Ramona's evil ex Jason Schwartzman. I won't tell you what happens, but the second chance card gets played like only a video game would. He doesn't have much other than he's the head of a record label, but who cares? He's the final boss. Since I never read the graphic novels, I really don't know much about the source material, but from what I do know it seems like the movie's faithful, so if the novel is as epic as the movie was I'll consider reading it. Bottom line: this film is awesome. It's fun, funny, great editing, cinematography, a bit ridiculous at times, but it's a video game worth playing, and you're always rooting for the hero.",
      "total_reactions": 2,
      "user": "movieg"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "Its got it all whether its humor, action, and randomness, even a sprinkle of romance. It also makes tons of references to video games. This movie lets you unleash your inner nerd!",
      "total_reactions": 2,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "An excellent adventure if not taken seriously. Great acting, catchy songs, hilarious jokes and amazing special effects lift this film into the A-list. I think I just found my new favourite film of all time.",
      "total_reactions": 2,
      "user": "DoctorWho"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "I put off this movie for so long and I finally got around to watching it and I am glad that I did. It's pretty  enjoyable. Absolutely loved Culkin as Wells, He was awesome. Just a very entertaining movie.",
      "total_reactions": 2,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "I find the critics handing out low scores in the media are the old, wrinkly, haggard, grumpy types that will sit through reruns of \"lost in translation\". The boring types basically.. That's why I've stopped reading critic reviews entirely and just stick to public opinion. Looks like the public agrees this film is gold. Not every film has to be serious for you to enjoy it. I loved the video game/pop culture references and the comic book style effects. The story wasn't that bad either, something you'd find in a video game having to defeat a number of bosses before getting your prize in the end - the beautiful girl. Well done Edgar Wright..hope we get a Scott Pilgrim 2!",
      "total_reactions": 2,
      "user": "Charade"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Whoever claims that this movie is bad, go back to watching your awful Oscar-winning films that pretend they have a story when they don't. Movies don't need to have action scenes or explosions to be good, but they also don't need to act like they're smarter than the audience and don't need to act like they have a plot when they don't. Scott Pilgrim Vs. The World had some of the best writing and directing in film since Tarantino made the Kill Bill movies. And the acting has humanity and actual emotion in it unlike whatever wins best picture at the Academy Awards. As much as people aren't going to want to admit it, Scott Pilgrim Vs. The World is one of the few movies in recent memory that is relevant, like-able, watchable, and is legitimately hilarious. And that is a testament to how good movies can be!",
      "total_reactions": 2,
      "user": "MetalMovieNerd"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2013
      },
      "score": 4,
      "text": "I started out fairly enjoying this movie. It had a cool premise and stayed true to it's roots but the more I watched it the less I liked it. The characters just started to not be likeable. Michael Cera's acting wasn't fun to watch and I could really care less. The girl he was after (Ramona)  just didn't seem worth the effort. I just had no feelings while watching the movie. Maybe I didn't enjoy it because it's my was my ex's favorite movie but I just stopped enjoying it midway through.",
      "total_reactions": 2,
      "user": "sammietee"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2011
      },
      "score": 3,
      "text": "Side characters more interesting than main, Cera playing as same as always, stupid and rushed plot - all dragging this movie down; Nothing new or special in this movie.",
      "total_reactions": 13,
      "user": "Hectic3006"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2010
      },
      "score": 1,
      "text": "Just like others before me, I am a gamer. I enjoy manga, comics, reading up on the game industry, etc. Obviously I could be categorized as a person who would enjoyed this film, but this film was horrible. It was not due to the gaming references or the corny one liners littered throughout the movie, but rather, the love story itself that was carelessly woven for Scott and Ramona. It's not the emotionally moving, heart felt, passionate sort of love that would move anyone. In fact, it felt selfish and obnoxious. I really felt bad for Knives who seemed more likeable than Ramona, and better fit for Scott. The other characters were barely worth mentioning aside from Scott's gay room-mate who, at-least, brought some comic relief. Either way, the main character himself, Scott, is flat and uninspiring. And the story only got worse whenever the 7 ex-boyfriends were thrown in for good old mindless showdowns that have absolutely nothing to do with what this movie really is: a romantic comedy. Let me repeat this: This is not an action movie. It's for Twilight-look alike, wannabe gamers that give the rest of us a new reason to be ashamed. Maybe one day, someone can make a gamer inspired movie that doesn't make us all look like selfish, unappealing, attention deficient pre-teens.",
      "total_reactions": 16,
      "user": "AMT6400"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "Brilliant movie. I love watching movies with unlikely hero's and creative use of genre's. Had me glued to the plot and dialog the entire time. Highly recommend.",
      "total_reactions": 5,
      "user": "Croy70"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "An absolute delight. Visually compelling and though tuned to a particular fan base (that i happen to be apart of) I found to be hysterical. One must have a true love of video games and music diversity to get all the little ins and outs of the movie so even though my parents and the lot are sure to be baffled by this movie, it pulls straight from my childhood and puts it on the screen brilliantly. Directing and acting was superb across the board. Faithful to the graphic novels interpretation by movie standards and will be a must have when released on DVD. Leaving a good movie you want to quote good parts, and this one was so overwhelming it was hard to choose. I'm in lesbians with this movie.",
      "total_reactions": 5,
      "user": "Vashramire"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2011
      },
      "score": 3,
      "text": "If you check my account you will see that im a bit of a gamer. That being said, this movie is a stinker. The whole video games sketch as special effects just looks lame. If you dislike cheesiness like in the Twillight series then you will sure as hell dislike this. This ones a stinker folks.",
      "total_reactions": 5,
      "user": "Iqbal"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "The first time I heard about this movie I thought it was a joke. I thought that this movie sucks, but then I realized that I was wrong... very wrong, absolutely totally super wrong, and till this day I thank God for that. To get to the point    THIS MOVIE ROCKS, KICKS ASS, DEFEATS BOREDOM, and just like the GREAT MAN SAID (user Billyliar**): \"Wright fully captured the essence of the gamer/gen-Y crowd and the modern teen comedy\". So if you want to get the whole picture just read Billyliar's review. If you watch this film you wont regret it.",
      "total_reactions": 5,
      "user": "Falling_Hammer"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2011
      },
      "score": 0,
      "text": "This is a pure unadulterated CRINGE FEST from start to finish. It is a pretentious arty/farty emo annoying musical pile of poop. My toes curled throughout and we had to admit defeat and switch it off half way through. DO NOT WATCH! This is my number one most hated film with LOVE ACTUALLY a close second.",
      "total_reactions": 5,
      "user": "Doyouvoodoo"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Seriously, anyone who thinks this movie is **** or anyone who tries to make themselves sound smart 'cause they use really offensive words, or really correct literacy, can go to **** Hell. I hope I speak for more than half the fans that saw this movie the day it came out, like me, when I say this is the best damned movie that I've seen this year with Michael Cera as the main character, since Superbad! Sure, the movie is pretty fake, maybe faker than the Hudsucker Proxy, but that just makes it even funnier, somehow (LOL)! The original comic from the mind of Bryan Lee O'Malley made into a MOVIE?! What in Jesus' name is smarter! Robin D. Cook, Jennifer Euston, and Allison Jones were very careful for their choices for the cast and must be as smart as Steven Hawking or Bill Gates! Metaphorically speaking, of course. But, still, some of the huge fans of Scott Pilgrim vs. the World must be thinking, \"What's to hate about this movie?\" Thank you for reading!",
      "total_reactions": 6,
      "user": "CoDFather"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2011
      },
      "score": 0,
      "text": "Terrible, just, terrible movie. Sorry but not my type of movie and I don't see why anyone would like it... There are like no funny scenes and the plot was retarded as it was unrealistic as hell and wasn't funny",
      "total_reactions": 6,
      "user": "pwnage332"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2010
      },
      "score": 6,
      "text": "The movie was certainly enjoyable. It kept a very fast pace, and kept the watcher very involved. However, the jokes rarely hit, and the plot started to drag towards the middle. The movie seemed to struggle to find ways for pilgrim to defeat each successive \"ex\". I did find that it was a surprisingly creative movie (whether or not that can attributed to the graphic novel is debatable) and the somewhat big name actors, although playing minor roles throughout the movie, did provide the movie with a needed boost when the plot began to thin. I gave this movie a 6 because it was a solid movie going experience that managed to defy the normal constructs of a coming of age romantic comedy.",
      "total_reactions": 3,
      "user": "ballinbeastauto"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "I'm pretty new to this series. I just read the comics about 2 weeks before seeing this movie. I must say, this movie does what Watchmen accomplished for me: provide a fantastic representation of the characters and stories while still being able to tweak the experience for regular audiences to understand. Thoroughly hilarious and beautiful. Now why would I not give it a 10? Despite its closeness to the source material, I personally felt that after the defeat of Evil Ex #3, the connectivity to the other Ex's was sped through very quickly, especially the Katayagi Bros scene. The fight scene itself was pretty awesome, considering it was another chance for the audience to get a piece of audio pleasure with the band, but they never really got too in depth into the Ex's. Other than this fact, taking out many of the minor characters was definitely understandable. In the end, I left the theater with a smile on my face which is what I really wanted.",
      "total_reactions": 3,
      "user": "Steve"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "Pleasantly surprised!  The cast was great, the video game and pop-culture references were funny and fit the story (and style) well, and overall it was one of the most enjoyable movies of the summer.  I haven't seen a movie that quite grasps both video game and comic book aesthetics as well as Scott Pilgrim, and it marks yet another great movie from director Edgar Wright.  It may not be a \"deep\" movie, but it's a hell of a lot more fun than bland comedy remakes and big-budget action movies.",
      "total_reactions": 3,
      "user": "walrusgod"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "Scott Pilgrim vs the World, this film is an original action-comedy filled with nostalgia moments that adult gamers would be entertained by. Though, it's not for everyone, considering its referential humor and overall 'geek' appeal, this is a solid film meant to please its intended audience with an significant amount of laughter with epic proportions.",
      "total_reactions": 3,
      "user": "Joshua_Jamaar"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Scott Pilgrim vs. the World is FANTASTIC. I love the comics and could not be happier with how this turned out. Now, it must be said that when it comes to retelling the story as it is presented in the comic, it does not directly follow it. However, I had absolutely no issue with the things they changed. When it comes down to it, this movie does the best job staying true to the ATTITUDE and the FEEL of its source material out of every movie I have ever seen where I was also familiar with both the book/video game/graphic novel/comic. Scott Pilgrim is a dream for a male (and many females, I'm sure) in his early twenties who grew up with a Super Nintendo. All the characters are spot on.. from Scott to Knives to Ramona and everyone else. Precisely how I would have envisioned them while reading the comics. The various video game reference are spectacular, and there are even some other great surprise references that I won't mention because it make it all that more exciting when they come up. If you think the idea of demon hipster chicks and vegan police sounds pretty funny to watch, or if the thought of an epic of epic epicness (great tagline that captures it perfectly) sounds pretty wicked, I would say you need to check this out.",
      "total_reactions": 3,
      "user": "hurumble"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "The stream of consciousness style is done perfectly as to progress through the story with just enough random insanity to be hilarious and endearing, while also keeping the story coherent.",
      "total_reactions": 3,
      "user": "jpoh"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "A truly fantastic adaption of the comics, Scott Pilgrim is directed and acted almost perfectly. Each character fits their role to a T, and the numerous all feel fresh and interesting. The fact the movie blends comedy, romance, and action without any one feeling weakened by the other two is fantastic. The movie does a masterful job of cutting down the story to a manageable length, which, when looking at the sheer quantity of source material, is more than a little impressive. The movie isn't entirely perfect, as the fights against Roxie and The Twins are both slightly flawed.  However, the movie is close enough to perfection to warrant a 10. Brilliant acting, action, comedy, and romance. What else could you possibly want?",
      "total_reactions": 3,
      "user": "itseverywhere"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Scott Pilgrim Vs. the World is easily the best film I have seen this year and probably one of the best I have ever seen. The characters were all engaging and funny, the dialog was witty and charming, and the comic book effects added a nice dose of charm. The movie also scores  extra points with gamers for all its references. A must see.",
      "total_reactions": 3,
      "user": "LinkMaster111"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "This movie is all kinds of amazing. I was really looking forward to this movie prior to its release, but now i just want to keep going back to watch it. If you spend more than 2 hours a day on the internet chances are you will greatly enjoy this movie.",
      "total_reactions": 3,
      "user": "Ergo"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "This movie is so much better than The Expendables if you're debating which movie to see, see this especially because it isn't doing so well in the box office and it should.  The previews for this movie don't do it justice, its funny, unique, and highly stylistic.  the cinematography is reminiscent to that of Speed Racer but unlike Speed Racer its more funny and has a cool story that is anything but ordinary. If you love video games, comic books and good music you'll love this movie if you don't like any of those things i think you'll still like this movies.  My only advice to you is that you go in with an open mind this isn't you're average comedy.",
      "total_reactions": 3,
      "user": "folk_tylore"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "I've been waiting Michael Cera to play this role ever since Arrested Development.",
      "total_reactions": 3,
      "user": "austenite"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "The movie stays, for better or for worse, relatively loyal to the comic books, keeping the same sense of humor and references. Most of the more shallow 'lessons' of the comic book along with the insubstantial banter between characters that's typical of the character's demographics are preserved for the movie. A few of the more important lessons of the comic books involving acceptance of the changing nature of life and responsibilities (an especially poignant realization for modern youth between 20 and 30) are unfortunately placed to the wayside for time//market constraints. In a way this movie is just like Watchmen. If you read the comic and loved the comics, you will love this movie. If you haven't read the comic, chances are you will be confused by this movie. If you've read the comic and hated it, you will hate this movie.",
      "total_reactions": 3,
      "user": "CoolieNinja"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "A simply stunning movie in both its visuals and over-the-top action scenes. The story is insanely easy to follow, but also completely insane on the same note. If you enjoy your imagination being put to the test and a wonderfully action-packed love story, Scott Pilgrim vs. the World is a must-see.",
      "total_reactions": 3,
      "user": "threeivalor"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "I've got to say that this was the most fun I've had at the movies in a long, long time.  You often get heavily marketed films telling you that critics say it's an important film, or it's amazing, or any number of snobby film critic words.  This was just a great time.  I've long since given up on rating films based on how \"great\" of a film they are and concentrate on how much I am entertained.  Scott Pilgrim vs. The World is extremely entertaining and the only reason I didn't give it a 10 is that very few films should ever be rated at the extreme ends of the scale.",
      "total_reactions": 3,
      "user": "wisaaka"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "This movie was so fun to watch.  It's so entertaining and fast-paced, I don't think anyone could ever be bored.  I kind of got the feeling from it that people who see it will absolutely love it or absolutely hate it, but you really don't need to love comic books or video games to love it.  I'm not really into either, but it was just so clever, entertaining, and funny, that it really doesn't matter.  I think it's quite brilliant how the comic book is translated into a movie.  I loved how the quick little scenes were just like single comic book frames.  It was really well done.  The movie is very incredulous, I did find myself asking \"Really?\" a few times, but you have accept that this movie is far from reality, and enjoy it.",
      "total_reactions": 3,
      "user": "kristen58"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Amazing! By far one of the best movies i have seen all year! The cast is perfect and the game-style action keeps you active and roaring for more. I was expecting a less than great film but what i got was totally unexpected. It is for a younger crowd (don't take your mother) as it has more modern humour. This is not a usual movie format (videogame) but i believe that Edgar Wright has aced this movie. A must see!",
      "total_reactions": 3,
      "user": "DylanBarclay"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "First and foremost, if you're not a nerd, don't watch the movie! That being said... You can really tell Director Edgar Wright worked hand in hand with Brian O'Malley on making this movie be as true to the 6 volume graphic novel as humanly possible. Mr. Wright's inherently British style of directing (e.g. Shawn of the Dead etc...) translates wonderfully to an American (read Canadian) movie designed for the Ritalin generation. There is certain something about this movie that gives you the sense that that actors just LOVED doing it. Every Ex battle is brilliantly crafted, visually and aurally stimulating. I know that I personally have seen the movie numerous times and I know I'm not the only person waiting with bated breath for the Blu-Ray release.",
      "total_reactions": 3,
      "user": "zolite"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "I have to be honest, this movie was way better than I thought it would be, the movie followed the comic book  really well, from comics 1-5, Edgar Wright knew how to put this movie together so it would be, AWESOME.",
      "total_reactions": 3,
      "user": "pelusa423"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "\"Scott Pilgrim\" is some sort of godsend to any guy between the ages of 17 and 25, and will probably be the most unique movie to hit your local theater this summer (stylistically, at least, for people who are gonna hound me about \"Inception\"). For a movie that manages to be nerdy, trendy, absurd, hipster and even touching, the pacing and editing are spot on, and Michael Cera's deadpan will be sure make you laugh this time around (even the milieu of savvy video game/indie jokes should at least entertain the unfamiliar). The setting is also perfect - the overblown story takes place in modest Toronto, though a Toronto where no one breaks the age 30 barrier and high school seems eons away. I'm a bit worried this direct exclusion of age groups is a factor that will deter a large portion of the movie-going crowd. For that certain demographic, though, this movie is the perfect remedy for boredom and is a great cap-off to the summer.",
      "total_reactions": 3,
      "user": "ryancarroll88"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "I went into Scott Pilgrim thinking that I wasn't a nerd. I was wrong. Scott Pilgrim is not only a movie only enjoyed by nerds but it can also be enjoyed by casual gamers - my friend Isabella thought it was hilarious. She doesn't play games. She understood 1-up and other nerd jokes. Its fun for everyone i think.",
      "total_reactions": 3,
      "user": "critical-critic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "Edgar Wright's first Hollywood picture is a fun, frenetic movie experience.  Aided by a superb cast, good music, and terrifically insane visuals and sound design, this is a unique comic-book movie for 2010, only bettered by the superior Kick Ass.",
      "total_reactions": 3,
      "user": "grindhouse83"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "The cast is great, the storyline is ok, the dialogue is clever and funny, and  the visual effects are some of the best you'll see this year. I can't recommend this movie enough.",
      "total_reactions": 3,
      "user": "j30"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "Director Edgar Wright brings Bryan Lee O'Malley's famed comic book character to life with \"Scott Pilgrim Vs. The World\". The movie, of course, tells the story of Scott Pilgrim (Cera), a young musician who must battle all the evil exes of the girl of his dreams, Ramona Flowers (Winstead). First off, try not to take this movie too seriously - because it's not. If you walked into this movie expecting a tour-de-force tale of love, passion, and perseverance you'd be sorely mistaken. This movie is not meant to be thought-provokingly philosophical. It's meant to be fun - and boy is it fun. I had a pretty darn good time watching \"Scott Pilgrim Vs. The World\". The most entertaining quality of this movie is it's special effects. Granted most of it's CGI, it doesn't hinder the entertainment value. I only wish I would've seen this movie on the big screen - it would've been exponentially more fun to watch. Another great quality of the film is that it features a wealth of tongue-in-cheek throwbacks to some of the classic video games of the late 80s and early 90s. A lot of video game cliches make their appearance in this movie and I (being a nerd) found them highly entertaining to spot. The acting is what it is. It's not really anything worthy of note, but it fits the bill for the overall tone of the movie. The same goes for the script, which, for most of the movie, should not be taken seriously. Wright also employed a lot of CGI to really make the film feel like a comic book. I feel that a lot of these techniques were really fresh, innovative, and even, at times, funny. In the end, Edgar Wright's \"Scott Pilgrim Vs. The World\" remains an impressively entertaining adaption of the popular comic book series.",
      "total_reactions": 3,
      "user": "Compi24"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "I noticed a lot of people liked this movie but for some reason it was a flop. Well I think I might be able to shed some light as to why. First, Michael Cera is a one trick pony. Being the geeky kid trying to gain the love of the hot girl has been overdone for him. Second, the hipster video game thing only appeals to a small number of people.  I'm one of them and this movie was not impressive. The story was trite and silly with unfunny characters who pop in a few good one liners every now and then. The fighting was original and entertaining but did not fit. It seemed like it was thrown in for this-looks-cool reason. The video game references were cute but more silly than artistic. Which is what I can say for the movie as a whole. It tries to be artistic but it all just comes off silly. Just because there's nothing quite like it doesn't make it a good idea.",
      "total_reactions": 14,
      "user": "Libra85"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2010
      },
      "score": 3,
      "text": "Outside of the razzle-dazzle effects, which grow old by battle #3 (Brandon Routh), the movie has no substance.  I never cared one iota about any of the characters and by #4 couldn't wait for it to end.  There were a few laughs here and there but over all this is a stinker with sprinkles on top.",
      "total_reactions": 18,
      "user": "A7sus4"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "This movie wasn't bad, well not the whole thing. I used to like Michael Cera until noticing that he can only play two types of characters, His youth in revolt one, and the sad little puppy of a dolt he plays in every other movie. WHile he was charming in Superbad and to an extent in Juno, he is plain out annoying in this movie as a loser fighting for a girl that doesn't even seem to care about him at all. All of the fights that people were hoping were somewhat fun to a point and then had idiotic ending sequences (not counting one involving a vegan). However some brief moments of sunshine can be seen through Ramona near the end of the film, the music in the film will make you want to rock out, and Kieran Culkin is not to be missed as Scott's gay roommate Wallace Wells. Overall this movie is enjoyable until a certain point, and that point may be adulthood.",
      "total_reactions": 15,
      "user": "Chonquist"
    },
    {
      "neg_reactions": 21,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "Are you kidding me? This movie is a commentary on what most individuals see the young generation in the United States as; whiny, hopped up on video games, and way too involved with themselves. Wright decides to alienate movie goers not familiar with the graphic novel by bombarding the screen with bright lights and colors, while forgetting to develop characters and story into something the average movie goer can connect with. Unless you left your house playing video games to go see this movie, and then immediately after the movie went back to your Zelda game to see if you could complete it before your Mom came downstairs to tell you it was bedtime, even though you are in your 30's, this movie is not for you. The one redeeming quality was the soundtrack was pretty enjoyable. The Sex Bom-Ombs were a quirky ode to punk and alternative rock, while the theme of underground \"independent\" music played a nice backdrop of normality and reality to Scott's world of self absorbed nerds and cliches.  Seriously, what was this movie about? The only thing I took away from it was that if this is the \"game changer\" that so many reviewers think it is, we have a bleak future of movies ahead of us.",
      "total_reactions": 28,
      "user": "zebertas"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2011
      },
      "score": 1,
      "text": "Terrible unfunny movie for hipsters and closet nerds. Cant believe this hype on this trash. The only people who would think this movie is funny are 5 year old's.",
      "total_reactions": 8,
      "user": "Dorrbecker"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "It is hard to believe that this movie lived up to the hype.  I don't even remember how long ago I heard about it and wanted to see it immediately.  I loved it.  I could pick apart stupid stuff, but who cares.  It is wild and crazy with only a couple slow parts.  The funny thing is that my whole family went...from grandma & grandpa to youngest nephew and we all laughed are ***es off.",
      "total_reactions": 4,
      "user": "tdkDallas"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "A great adaption of the graphic novels yet it still manages to be unique and fresh. The movie is full of hilarious moments and I would highly recommend it!",
      "total_reactions": 4,
      "user": "rickytheleaf"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Loved every minute of this movie. It has a great cast of interesting characters, great visual style, great action sequences, is hilarious, and is one of the best movies to come out this year. You shouldn't miss this.",
      "total_reactions": 4,
      "user": "Metalhead"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2010
      },
      "score": 4,
      "text": "I guess I didn't get this movie.  Perhaps I would have gotten it, and I might have like it better, if I had experience with video games and/or was familiar with  the graphic novel.  As it was, I found myself bored at times.  Therefore I recommend that you skip it unless you know modern video games.  Maybe it gave this 60 year-old some sense of what it is like to be a 17 to 23 year old nowadays?  But I'm not sure that is worth the price of admission.",
      "total_reactions": 4,
      "user": "mandm1951"
    },
    {
      "neg_reactions": 15,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2010
      },
      "score": 4,
      "text": "Sorry guys, I just could not catch on to the cleverness in the movie that everyone is claiming. I think its the cleverness in the visual effects that this is where its receiving its praise from. Honestly, its another example where its all style and no substance. Same atmosphere of Avatar, where its great visuals serve as a substitute for its clumsy storyline. To watch my review of this film go to this link: http://www.youtube.com/watch?v=UIH8WX1Kx2E. I LOVE METACRITIC",
      "total_reactions": 19,
      "user": "Ricardo"
    },
    {
      "neg_reactions": 32,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "First off, I love comics, videogames, music, and action movies, which everyone says is a prerequiste for seeing this movie. Just because I like those things doesn't mean I'm going to like them trivialized and thrown into a Gen-Y blender. It was a romantic comedy with annoying, eye straining visual effects. Also, it's some of Michael Cera's worst acting to date. He's still playing the same part he's been playing since Arrested Development. Don't believe the previews! This IS NOT a kung fu/action movie. It's a romantic comedy that makes a few trite references to videogames. As a big fan of Mr. Wright, but not of the source material, I was a bit apprehensive, and I can see why. It just came across as a jumbled mess.",
      "total_reactions": 40,
      "user": "leonsk"
    },
    {
      "neg_reactions": 49,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2010
      },
      "score": 3,
      "text": "Jesus Christ! When will you people learn... This movie is rubbish.",
      "total_reactions": 61,
      "user": "Leinad177"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "This movie is hilarious and the ultimate late Gen X' er early Gen Y movie, in the tradition of Tank Girl (if you're under 25, you won't appreciate this as much as someone in there 30's). This movie is like what \"The Wedding Singer\" was to people in their late 20's early 30's in 1998, GREAT!!!, because you were there, you understand the jokes fully.",
      "total_reactions": 6,
      "user": "Jodie"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2010
      },
      "score": 0,
      "text": "Where to begin. How do films like this actually succeed in this day and age? The acting makes you cringe. It follows a simple hollywood layout. It's predictable. And i ask you, what is this modern day obsession with a geeky persona being so 'cool'. It's mindnumming. Such a typical American film - designed for plebs and half-wits.",
      "total_reactions": 14,
      "user": "Alex6"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 6,
      "text": "\"Scott Pilgrim vs. the World\", with all due respect, is like an \"Existenz\" for dummies; it's as if Allegra Goodman(the game designer from the 1999 David Cronenberg film) sold out and designed a game for kids, a game called \"Ramona's Seven Evil Exes\". The world that these people(avatars, really) exist in, can only be the world of virtual reality, where a guy like Scott Pilgrim(Michael Cera) can stand toe-to-toe with anybody, since brawn is irrelevant in the gaming world. Pilgrim embodies the gamer, the stereotypical gamer who plays video games in order to feel powerful. Whereas most films of this ilk require that the hero should train before going into battle, Scott defeats Ramona Flowers' first ex(Matthew Patel, played by Satya Bhabha) without any training, and with relative ease. A narrative preliminary, a trope that was used as recently as John Turteltaub's \"The Sorcerer's Apprentice\", exists in \"Scott Pilgrim vs. the World\" too, but it exists extra-diegetically. The training that enables Scott to defeat all of Ramona's exes is part of the film's backstory, translated into video game parlance, backstory means programming, and herein lies the difference between video games and movies, as \"Scott Pilgrim vs. the World\" suggests the interactive quality of the former, because the avatar(the bassist for a rock band(or is that \"Rock Band\"?) and unlikely ladykiller), needs a gamer to do the fighting for him. Nobody on screen seems especially shocked that a man with Scott's physique turned out to be so adept at one-on-one combat; their cipher-like non-reactions to Scott's prodigious fighting ability adds to the virtual reality feel of the diegesis. Everybody comes across as pure character, rather than actual people; puppets being controlled by puppetmasters. While Scott looks like an underdog, he doesn't come across as one, since vulnerability is integral to the underdog's makeup. Instead of shedding blood, the vanquished emit a monetary spray of quarters. Instead of rooting for flesh and blood characters, \"Scott Pilgrim vs. the World\" has the moviegoer rooting for the imaginary gamer, whose wish for a life is fulfilled, as Scott walks off with the girl of his dreams(personally, I would have chosen Knives). In \"Existenz\", the world that Allegra creates goes beyond mere simulacrum, which gives the player the notion that he's getting a life. When Scott says, \"I'm getting a life,\" the film is quietly breaking the fourth wall, because those could be the words of the gamer who lives vicariously through the character he's manipulating.",
      "total_reactions": 8,
      "user": "Shiira"
    },
    {
      "neg_reactions": 16,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "An absolutely terrible adaption of the comics. They pretty much got evertyhing wrong about what made the source material so great. Michael Cera is a terrible choice for Scott.",
      "total_reactions": 17,
      "user": "Brosman"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "Awesome!!! The funnest movie i've seen all year. besides it being a little too long, it is a hyper film with a great cast. So who cares if michael cera acts the same in every film, if something works then u keep doing it. look at will smith's comedy. and besides, he kicks it up in this film. so disappointed its not getting the recognition it deserves. This is totally my number 2 this year.",
      "total_reactions": 3,
      "user": "plus44boy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "SAW SCOTT PILGRIM TODAY!!!, THIS MOVIE IS!!!!.....meh.",
      "total_reactions": 2,
      "user": "kidcoyote"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "I haven't read the comics and had no idea what to expect, but I was pleasantly surprised with this funny, original, hyper-kinetic, innovative, game-like and hipster/nerd-friendly movie. Like \"Crank\" and \"Shoot 'em Up\" did for action movies, this one sets a high standard for all upcoming indie/geek comedies. Pure pleasure.",
      "total_reactions": 1,
      "user": "KundK"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "A thrill ride from start to finish. Scott Pilgrim vs. the World is an inventive, colorful, wild hybrid of various elements, with rocking performances by literally all its players. It's new and will definitely scare some tight-minded viewers away.",
      "total_reactions": 1,
      "user": "FitriAmirrol"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "like the books, it is imperfect. But it just makes the good bits even better. Kieren Culkin stands out  as Wallace Wells, and the cast are perfectly, well, cast as the the characters from the comic",
      "total_reactions": 1,
      "user": "mbagely"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "the pacing was a bit off in the beginning, but the movie picked up and maintained the action at a good clip for the last hour.  the teen/20-something romance story was a bit meh, and it was difficult to actually like or care about any of the characters, primarily becasue none of them had roles that required acting ability.  however, the action and combat scenes were entertaining, funny and visually stunning, and this was the reason why i wanted to see this movie. overall, i enjoyed it and recommend it for those that look fondly back at their days playing far too much nintendo.",
      "total_reactions": 1,
      "user": "trajanus"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "Directed by a personal favourite and confirmed homeboy of mine, Edgar Wright, Scott Pilgrim is the tale of a sociable and likeable, if not somewhat introverted, Scott Pilgrim as he lovingly falls head over heels for one Ramona Flowers. Of course, as it is in real life, you must defeat a girlâ",
      "total_reactions": 2,
      "user": "FilmTrout"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2010
      },
      "score": 4,
      "text": "Scott Pilgrim... is a really tough one to critique... on the one hand, the movie is unique and imaginative â",
      "total_reactions": 6,
      "user": "Deconstructor1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Just saw this. And it is my favourite film ever. Edgar Wright has done it again, it's fast, funny, and action-ey? It's just a brilliant movie with brilliant characters that do brilliant things, it's the most epic movie i've ever seen. And the video-game nods just add to that!",
      "total_reactions": 1,
      "user": "ManicMorris"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "HOW TO WATCH \"SCOTT PILGRIM vs. THE WORLD.  Get yourself an over-priced whopper sized soft drink along with a gut buster bucket of fake butter drenched popcorn, find a seat that's not torn in an area where your shoes don't stick to the floor, suspend your disbelief and leave your preconceived notions at the door and settle in for a cinematic rollercoaster ride worth every penny you've spent!  Hats off to the best edited film in years. The fun is not knowing where this film is going and the quick cuts and fast pacing will leave you as high as Michael Cera is tall.  You don't need to know the books or the back stories.  Just sit back and let the magic flow over you.  DON'T MISS IT!",
      "total_reactions": 1,
      "user": "TheUnpaidCritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2010
      },
      "score": 4,
      "text": "Scott Pilgrim vs the World is interesting and creative, for the first half of its run. After that the peformances dwindle to nothing as the screen explodes with colors, flashy effects, and cartoonish fighting. None of which is terribly interesting.",
      "total_reactions": 3,
      "user": "PSardinas"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "Basically: Directing, well Edgar Right's style shows very well and is suited very well for this type of film, the narrative is an easy job to understand as the story is fairly simple, plus the dialogue is basic.",
      "total_reactions": 1,
      "user": "rdavies"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "At last! Found a movie that entertains perfectly. Loved the way they presented comic and games mixture story. If you are a non-gamer or one who just likes adult comedy or emotionally unbalanced or just some sarcastic critic then this movie might  not be for you.",
      "total_reactions": 1,
      "user": "Gari"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "Scott Pilgrim vs. the World blends video games, comic books and rock music into a unique generational classic. Comedy, love, heartache, catharsis and epic fight sequences are all deftly handled by director and cast. That's a lot of balls to juggle but Scott Pilgrim vs. the World makes it look effortless. Basically speaking, if you grew up playing NES, reading comics or listening to indie-rock (as I did) then this movie is absolutely unmissable.",
      "total_reactions": 1,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "This film has been hyped to the heavens. It's nothing at all special. Michael Cera seems to have been type cast as a high pitched lanky boy. You wouldn't be able to tell the difference from Scott Pilgrim Cera and any other Cera film. Nothing in the film has stuck with me, no funny lines have been embedded into my head. It's utter tosh in my opinion.",
      "total_reactions": 2,
      "user": "Triatsila"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2011
      },
      "score": 4,
      "text": "The visual style on the movie is great, but the lack of explanation and poor storyline just makes it absolutely boring. Perhaps those who actually read the comics can understand what's going on, but I simply could not.",
      "total_reactions": 2,
      "user": "Brackmann"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "I can't say I really understood what the hell was going on, but nevertheless this movie is definitely a fun, wacky adventure that doesn't really take itself seriously at all. I can't claim to be a fan of Michael Cera, because he just annoys me, but I definitely can say I surprisingly enjoyed this film.",
      "total_reactions": 1,
      "user": "CursedKnight187"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "GREAT FUNNY ASS MOVIE I LOVE THIS MOVIE SO MUCH!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!   great script and great acting.  and very good action scenes",
      "total_reactions": 1,
      "user": "lovemusic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2011
      },
      "score": 4,
      "text": "As a life-long gamer, I was pegged by some friends as the target audience of this movie, despite the fact that I did not get a good vibe from the trailer. I watched it yesterday to see what all the fuss was about, only to be disappointed. I really wanted to like the movie, but I just couldn't.",
      "total_reactions": 2,
      "user": "napstrpsx"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "The plot looses its original premise on the half-way of the movie, becoming silly and ridiculous. Still, \"Scott Pilgrim Vs. The World\" is funny, fast-paced and original, and if you are looking for fun you should not miss this. It's pure joy!",
      "total_reactions": 2,
      "user": "Potter17"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "I think that we can all agree on one thing to say about Scott Pilgrim vs. the World: This is the first great video game movie. The funny thing is, the film not based on a video game (it's actually based on a popular comic series.) This film is something that made Uwe Boll spontaneously combust. Michael Cera is the main cause of this being awesome, blending his dorky cliches with Keanu Reeves's badboy action star persona into a perfect remedy. among the other great performances include Jason Schwartzman and Kieran Culkin, among others. The visual effects are so beautiful and retro and sweet, they make Avatar look like Wright's Shaun of the Dead. Just check out the greatest underrated film of the year and maybe of all time.",
      "total_reactions": 1,
      "user": "buellerbueller"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "I quite enjoyed Scott Pilgrim, thought it uh, did a rather good job adapting all six volumes of the comic book into a two hour theatrical experience. That's a lot to cover, but they got the real gist of it.",
      "total_reactions": 3,
      "user": "Delta_Assault"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "What a wonderful surprise. Edgar Wright captures such an essence of creativity and all out ridiculousness to bring us Michael Cera in this super-comic tween fest all together and rolled in with flashy colours and glitz to form Scott Pilgrim vs. the World.",
      "total_reactions": 1,
      "user": "StevenF"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "This film, was KICK ASS. It was funny, comic like and had some AWESOME fight scenes. I like the fact that it was set up like a comic book with a POW or KASLICE effect when someone punched something. 8 outta 10",
      "total_reactions": 1,
      "user": "dryyoshi7"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "For the first time agreeing with the user score. Scott Pilgrim vs. the World is a very fun action-comedy that is clearly not for everyone. There's a reason why it bombed and I'm not sure if I should be recommending the film. Personally it was a lot of fun and I liked it very much. I don't think its one of my favorites but it is a film I will watch again if I feel like it. Edgar Wright did not disappoint and I'm sorry I missed out on watching it in a cinema. If you're a full blown adult with no nerdiness at all you may find this movie confusing and dull but if you enjoy videogames this film is a strong recommendation.",
      "total_reactions": 1,
      "user": "thescifijovian"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "FINALLY! A movie that makes me happy to live in this generation! \"Scott Pilgrim vs. the World\" is probably one of the most unique, fun, amazing films I've EVER SEEN! Makes me happy just thinking about it.",
      "total_reactions": 1,
      "user": "ScarTissue1990"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Scott Pilgrim is honestly one of my favorite movies. It's witty, funny and full of hilarious references to video games and other parts of pop culture. This movie is romantic and extremely quirky as well. No one can say that Scott Pilgrim vs. the World isn't extremely unique. Sure it's not perfect but it is certainly a movie I can watch over and over again and enjoy each time!",
      "total_reactions": 1,
      "user": "moonman1994"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "I really didn't think I would enjoy this film after seeing the trailers but I thought it was fantastic. I enjoyed the comic-book stylings and, for once, thought that Michael Cera played his character just right. He seemed to overcome his usual timid self to produce a great display. The villains were also played really well. The plot was a bit silly but it worked extremely well. I am very glad that I watched this film. I don't normally enjoy off-beat comedies but I thought this one was very, very good.",
      "total_reactions": 1,
      "user": "dev92"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "This is a great movie that is like being in the middle of a video game.  Edgar Wright steps out from his normal routine to display a sense of style that is really exciting.",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "This is maybe my favourite movie, it's soooooooo fun and creative. I watched it many, many times and i really enjoyed. I recommend it to everyone! GREAT MOVIE!!!!!!!!",
      "total_reactions": 1,
      "user": "RobyLula555"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "You can't put a genre on this movie. Music? superb. Visuals? fantastic. The dream movie for anybody who loves comic books, can't talk to that one girl or wants to fight for their relationship. The cast is solid as are the boss battles which flow smoothly. Cera and Culkin carry this tale to the end with their own character quirks and problems. A male version of twilight hyped up on buzz and action and certainly a favourite of my movie catalogue.",
      "total_reactions": 1,
      "user": "M0vieAddict"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "Allow me to explain this movie: It first starts out kinda slow, the first 10 minutes are a bit boring and you could swear you're watching one of those independent love films, but then right at the 15 minute mark... BOOM! This movie just slaps you awake and throws all these awesome images at you (in a  good way). The humor was great, the characters were awesome and the fighting was some of the best damn fighting I have ever seen in comic book movie.",
      "total_reactions": 1,
      "user": "Xulnogo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "This movie is WAY better than I thought it was going to be!The story is great,all the characters are awesome and the movie makes you feel like your watching a real life Nintendo game.",
      "total_reactions": 1,
      "user": "ICEExMagic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Although the movie lacks the two iconic Edgar Wright actors, Pegg and Frost, this movie does not disappoint.  Wright's first two movies were quite cartoony, this movie is over the edge when it comes to that.  During fight scenes, Scott and his opponent throw powerful punches and are not scratched.  This movie has plenty of eye candy throughout which make the overall experience enjoyable.  One problem with this movie is that it is hard to make unpredictable.  Wright takes this issue and throws it out the window.  The plot has plenty of unpredictable twists that will keep you glued to your seat.  The acting in this movie is phenomenal.  Michael Cera delivers and the wimpy hero and Ramona brings a strong performance as the female protagonist.  This movie is best described as a real-life video game action comedy mashup.  Overall, Wright hit it big with this movie and he shows that you do not have to like video games to like this hilarious movie.",
      "total_reactions": 1,
      "user": "dinklsoons"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Edgar Wright's film Scott Pilgrim Vs. The World is based on the comic book series of the same name. The film, unlike most, is a lot better than the book series, which is surprising because the books are awesome, making this film incredible.",
      "total_reactions": 1,
      "user": "McLaughlinViews"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2013
      },
      "score": 3,
      "text": "Wow.  I have no idea how so many people like this movie as it's mediocre at best.  Yes I'm a nerd too.  Yes its neat that they referenced some video game stuff.  Is that really supposed to be enough for me to root for a total ass of a main character?  From the start, this guy has a girlfriend who really loves him, and he ditches her all the sudden cause he likes some other girl more from having a short conversation with her.  We also learn that he was dating the drummer of his band and ditched her too for some reason.  Not to mention he learns that the new girl he wants is a whore.  Doesn't matter, he really likes how she looks or something so he sticks with her.  Seriously?  Random video game references are enough for everyone to ignore the fact that the main character of this movie is a total  jerk who doesn't care about any of the women who have miraculously cared about him?",
      "total_reactions": 2,
      "user": "InsaneSamurai"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "I absolutely love this movie. I was never bored with the action, comedy, and the heart it had. I don't really care about the low scores for this movie but I think it deserved more than a 69 rating. I love playing video games and the classic ones too so this movie was really fun to watch because of the video game style. Michael Cera does seem to repeat his nerdish personality in movies but it works for him and it makes the movie more enjoyable. I also like how Jason Schwartzman acted in this movie along with Kieran Culkin. This movie is awesome.",
      "total_reactions": 0,
      "user": "Comasi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "Truly an excellent movie, maybe not so much if you're over/around 40, not that i'm trying to be ageist but the movie just has a very laid back, modern comedic feel to it. SPvTW knows it's place in the world and doesn't pretend to be an oscar contender, which honestly only adds to the charm. Plot is all over the place, visuals/effects are really cool, and the weird thing is that despite all the mad effects, deranged bad guys and all round shininess, i found myself relating to this more than any movie i've seen in a long time.",
      "total_reactions": 0,
      "user": "nunchuks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Fantastic move, lots of fun and a great little story.  This one fits in perfectly with Edgar Wright's previous catalogue, and really does the comics justice.  Excellent use of music in the film as well, with a great score.",
      "total_reactions": 0,
      "user": "technologic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "A great feel good film, all the way through its original style and likeable characters seem to drag you into this wierd and wonderful world where it seems as if, like true to games, the good guy should always win. The way the film makes you want a certain thing to happen at every 'confrontation' and changes your view on the world we live in is great. If you are feeling a bit down, or just want to feel good, go see it because after the end of it all it's pretty much summed up by 'Who cares what people think? Life is too short.'",
      "total_reactions": 0,
      "user": "MarkStringer96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "If anyone knows Edgar Wright, you'll know he's famous for directing Hot Fuzz and Shaun of the Dead which are insanely funny. His film Scott Pilgrim is also funny but also it's creative and experimental. Scott Pilgrim is based on the comic series which plays out like a video game (both in the comic and the film). I liked how different it was and they used some of the original comic book for some of the montages. I didn't like Wright's choice of Cera as the title role, I felt awkward watching him sometimes and if they had someone else in the lead role, I might have liked it better. I praise Kieran Culkin's hilarious performance as the gay roommate Wallace, who at times had me in stitches. It's definitely worth a watch.",
      "total_reactions": 0,
      "user": "shlugalug"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "If you're a comic fan who truly appreciates the characteristics of a comic going into a film then you will enjoy this, no doubt about it. With what appears to be Pokemon-style battle scenes and captions, along with character titles and colourful cinematography, Scott Pilgrim Vs. The World should have it's own category of awesomeness. It's retro, with a rocking soundtrack and the occasional sound effect you should all know if you were in the Super Mario World generation.",
      "total_reactions": 0,
      "user": "Vicki_t2702"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "Thee Day i watched this was not a good day. and this movie completely turned it around. I was pretty pissed off that day, and from the start i had this big grin on my face that never died. i loved it. I was laughing so hard and the action was awesome. The video game-style editing made it even more epic. And Michael Cera was cool for once and Ramona Flowers... i can see why he fell for her (she's hot).",
      "total_reactions": 0,
      "user": "MetalMan95"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "One of the most enjoyable films i've seen since i can remember! I could not believe how cleverly it has been edited and the music was off the hook. Hilarious in literally each scene.",
      "total_reactions": 0,
      "user": "ILLKILLALLOFYOU"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "For me Michael Cera has overstayed his welcome. After the positive reviews for the film I decided to give the movie a chance- I enjoyed the film but Michael, as has been the case with Jack Black and Will Ferrell, needs to lay low for a while- and maybe he will have a comeback, but it may be to late.",
      "total_reactions": 0,
      "user": "6foot2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "A half hour into SPvTW, I took a breath.  \"Spectacular.\"  That's what I thought of this film by the 30-minute mark.  However, by the end credits, I was fully aware that the cinematic masterpiece that I had just witnessed was something more than a spectacle for temporary enjoyment- it was a creative tour de force that will (if we're lucky) shape films to come for years.  I was completely engrossed in this wonderfully artistic journey from start to finish- and this is coming from a card-carrying member of the Anti-Michael Cera Club.  No more.  If there's any justice in the film world, SPvTW is the first step on the road to inspired, multisensory storytelling.",
      "total_reactions": 0,
      "user": "Lacksagoo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "I loved how this movie was filmed as if it was a video game which added to the fantasy feel of the whole thing. The plot was basic but it worked really well in telling the story of 'Scott Pligrim' and his love for 'Ramona Flower'. The unrealistic fighting really worked in adding a great deal of comedy to the story.",
      "total_reactions": 0,
      "user": "Jems"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "I didn't know what to expect going into this movie.  It turned out to be the most enjoyable movie of the year for me.  It might be too fast paced for some but I loved it.  One of the things that suprised me was how well special effects were used throughout the movie.  Also, whoever did the casting deserves an award.",
      "total_reactions": 0,
      "user": "canadianrugby"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "This movie was pretty awesome and funny. It followed most of the comic book and had so many video game, movie, and comic references. I enjoyed watching it and would recommend to anyone. (I saw some negative reviews too, I don't understand why either, the movie made me laugh and it's been a while since a good movie has come out)",
      "total_reactions": 0,
      "user": "OxyFenix"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2010
      },
      "score": 6,
      "text": "\"Scott Pilgrim is an Amusing Satire , and Pays Great Homage to the classic \"era\" of video games. It also has a nice Original Flow to it , But it moves to fast , Your always one step ahead of Scott , and its beyond predictable , But hey at least its Funny\" .. B-",
      "total_reactions": 0,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "Truly imaginative direction, funny and quirky dialogues and if it was not for the over the top ending it would be a brilliant film indeed.  Great casting and music add to the attraction of the final product.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Director Edgar Wright's first feature film without his cohorts Simon Pegg and Nick Frost, proves that not only is Wright a master of his craft, but he can also make a great film with a fresh cast.",
      "total_reactions": 0,
      "user": "JustinSmith"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "http://mashupmash.blogspot.com/2010/10/scott-pilgrim-vs-world.html",
      "total_reactions": 0,
      "user": "Kingmush"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "Absolutely fantastic from start to finish.  The only downside to the movie is that it may not resonate with everyone, leading to very hit or miss opinions.",
      "total_reactions": 0,
      "user": "SeekerDarksteel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "A fun movie that will mostly appeal to the Sega Genesis era of gamers. Loads of funny dialogue and silly but fun fight scenes. I found Cera dull and unconvincing as the romantic lead and Winestead seemed bored and detached throughout but Culkin's dialogues stole the show. Wonderful soundtrack too.",
      "total_reactions": 0,
      "user": "grendel082"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "An epic of epic epicness, certainly. Best film of the year, Edgar Wright has done it again. Look out for my full review at http://www.youtube.com/PulpVideos in November.",
      "total_reactions": 0,
      "user": "Kapowgiraffe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "I loved this movie, it was very entertaining and such an action packed yet funny and cute love story. Not straight from the graphic novels but I The ending although different from the graphic novels was excellent. It was well done and the casting was fantastic, the characters actually looked straight out of the graphic novels. Such a modern comedy for teens today. I defs recommend it. LOVED IT.!",
      "total_reactions": 0,
      "user": "Kandraa"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "This is one of the best films I've managed to watch all year! On the front of it an Adventure, Romance, Action, Comedy, Fantasy film sounds like its trying to be too much too all things, but this is not the case, its a clever witty film which is classy slick and a very polished comic book to movie transition probably one of the best in that genre. It has the subtle British comedy which is becoming a trademark of all of Edgar Wright's films and he must be one of the best current modern directors. The subtle nuance's and all the links to other films just add to it and it never seems to be ripping anyone off. Its also a great bow in Cera's filmography as its a slightly different role to what he seems to be getting typecast into.",
      "total_reactions": 0,
      "user": "MartyJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "In short, a 2+ hour movie often with a fast forward Schizophrenic like pacing because of the amount of material they had to get through, with a bunch of what the general public will see as \"obscure\" references. I salute Edgar Wright's attempt to cram 6 books into one movie as if he knew a sequel was highly unlikely for such a bold Indie project, however choosing such a fast pace does effect the movie in bad ways, the main reason being it limits the appeal of an already unique movie even more then if the story had the time of a sequel to develop. Scott and Ramona as characters suffer the most from the pacing as the movie almost completely removes the book story aspects of addressing their pasts, coming to terms with their mistakes and the new responsibilities of adulthood, reducing Scott to little more then a Jerk Jock and Ramona to little more then an indecisive whore. It's the biggest flaw of this movie, what we get instead is characters typical Hollywood style, the main characters magically becoming better people by the end of the movie with little explination and it's I think one of the main reasons for so much hate towards the movie because they have basically watered down the entire point of the story. True the movie is still crammed to the brim with bold in your face visuals, Anime/manga and videogame references at every turn, when it's not overdone like the pointless peeing scene it's an impressive sight to behold, but it's assumbing you can actually recognise the references to appreciate them. For casual movie watchers who have no idea what hadoken, frag, kawaii or other similar lingo means, the movie will leave them scratching their head in frustration around barely even 10 minutes in as they try to follow the fast paced story. The only way they could possibly connect is reading the books first, which I consider a failure, as the film should be able to draw audiences in on it's own merits. No matter how you feel about this movie, it's doomed to a 'cult classic' fate at best, in some ways similar to twilight, but with a fraction of the movie goer profits, which is a shame because the Scott Pilgrim universe has more depth then those glorified vampire romance fanfictions. If Scott pilgrim vs the World is 'self absorbed', then by that logic the Twilight Saga thinks it's the greatest love story ever told.",
      "total_reactions": 0,
      "user": "skaiser"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "Unique fresh and all around enjoyable movie. Don't expect to be moved but it's a movie you'll enjoy the living crap out from start to finish. It's a breath of fresh air that anyone can enjoy",
      "total_reactions": 0,
      "user": "FadeOutAgain"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2010
      },
      "score": 7,
      "text": "\"This movie is made of win.\" If you are familiar with this term and it is more than just a gramatical error in your eyes, then chances are, you fall within the target audience of this movie.  To be more clear, you are obsessed with internet, anime, and videogame society.  I cannot give this movie the 10 that I would like to based off of my satisfaction alone however, as if anyone outside of this niche audience were to watch this movie (such as my wife) will not get it and will hate it dismissing it as juvenile. If however you do fall in this audience you will love it, you will laugh at all of the references as they will hit you in ways that you didn't realize a movie could.",
      "total_reactions": 0,
      "user": "Axlthehunter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "This movie was the **** I loved it from beginning to end... Probably kinda weird for most people but perfect for me cuz I was born in 82' and was totally into nintendo when it first came out.... gamer for life. Can't wait till it comes out on blu ray!",
      "total_reactions": 0,
      "user": "vramir3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "Itâ",
      "total_reactions": 0,
      "user": "BarryA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "Original, funny, great plot, well acted, awesome cinematography.  You get the point.",
      "total_reactions": 0,
      "user": "sody2001"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "This is easily one of the most imaginative movies to ever exist in history. I knew before watching that I was in for something different, but my mind was completely blown away. Anyone actually trashing this movie is clearly an idiot. This is an experience you need to have, I can't believe I waited this long to see it myself, I should of had this taken care of a long time ago when it first came out. Because its now one of my all time favorite movies. You watch a movie and get something out of it, but that is usually the same thing... and what Scott Pilgrim gives is truly unique, So I urge you to see this film.",
      "total_reactions": 0,
      "user": "Oracle420"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "Great movie indeed, it was everything I was hoping for and then some. Anyone that does not like this movie simply does not get it at all, either because they were born a generation too early or because they were born without a sence of humour. Seriously how can anyone not like the awesome mindless fun that is SCVTW. It is well acted, very funny and never boring. Sure the actual story is not great but that is not the point of the movie at all, the movie is about the comedy and the action. I recomend this movie to anyone born in the last 30 years and with a good sence of humour",
      "total_reactions": 0,
      "user": "Dare2Blink"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "Scott Pilgrim is an awesome invention in film making it's fast ,it's cool,it's funny.",
      "total_reactions": 0,
      "user": "Tejas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "This movie was without a doubt one of the best movies of the summer. Who knew Michael Cera still had it in him to crack jokes that can still make the audience laugh. I was able to attend a sneak preview with a packed crowd. One of my friends that went with me was expecting the movie to be a complete waste of time, but after he was blown away and wanted to see it again. Everyone in the theater was cracking up and even making those \"OHHHH\" sounds whenever Cera would land a great punch or a (surprisingly awesome) fight scene would occur.",
      "total_reactions": 0,
      "user": "Thumbsupguy90"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "What makes the movie really enertaining is the fact that the story is told like a comic book. With every scene suddenly changing with barely any sense of a crescendo that moves the film from a boring start to a \"Laugh Out Loud\" purely entertaining romantic/action comedy. With Scott Pilgrim having to defeat Ramona's seven evil ex's before they can date, which in the movie we only see him fight 3 or 4, and Michael Cera's always playing the same role which is a shy person and never says what's really on his mind, fits the role quite perfectly. It definitely is super light on the romance, which in way makes the movie even better. Scott Pilgrim vs. The World is definitely one of the funniest comedies in a long time, or as in the tagline \"An epic of epic epicness\".",
      "total_reactions": 0,
      "user": "Film_Fanatic_15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "This movie is not for everyone, but it's perfect for who it is for. If you went to the movie you're either really into Comics/Games/Music or you went with somebody who is. The former who really respond to the goofy male protagonist with a passion for hanging out and kicking exaggerated butt for a cute girl are few, but this movie is made for them. Us.",
      "total_reactions": 0,
      "user": "Fortinbras"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "This is a AWESOME movie and definately a watch for REAL gamers out there. This movie is really funny in my opinion and a great homage to the novels, BUT, I hate the deleted scenes they took out and REALLY should have kept in, also how much of the story they took out kills alot of story. Even though this, this movie is great and would get anyone into Scott Pilgrim!    P.S. This movie is SUPPOST to be silly ppl...we seriously need more movies like this released.",
      "total_reactions": 0,
      "user": "hydeks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "Scott Pilgrim boasts a slick, gamer/comic influenced style that really flows well with the story. The soundtrack is amazing and feels so right with the material, and the actors are top notch. This one is  worth the watch, heck the buy!",
      "total_reactions": 0,
      "user": "Rumblebeelove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "This is one of the year best movie. They did a great job with the effects and edited. Great screenplay and acting in this movie. A very good comedy-romance movie. This movie was very entertainment. It started off kind of slow the first fifteen minutes but it pick up. This is a very good movie to get for dvd and bluray.",
      "total_reactions": 0,
      "user": "iamtrent424"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "The whole thing is like a video game brought to life. It has a good premise hilarious jokes and the acting is marvellous. Video game fanatics will dig the hell out of this.",
      "total_reactions": 0,
      "user": "Tetsuo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "This movie was freaking awesome.  FREAKING AWESOME.  There hasn't been one movie ever made that affects gaming references like this one and also follows along with how we act at the same time ever!!  There's so much more to this review that I could put but I don't have time so that's about it. It's Awesome.",
      "total_reactions": 0,
      "user": "Stealth032"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "What is the password? Umm,.. Whatever! That is the attitude of 23-year-old Scott Pilgrim. By watching thiz film, amazingly I feel like back to become teenager again, with my skate board under my feet and baseball cap on my head. It tells about Scott Pilgrim (Michael Cera) who has a new girlfriend, Ramona Flower (Mary Elizabeth Winstead). Now, he must defeat seven Ramona evil ex-boyfriends in video game style duels. Meanwhile, Scott is also playing in a band called Sex Bob-omb with his friends. The movie directed by Edgar Wright who brought us SHAUN OF THE DEAD (2004) and HOT FUZZ (2007). He is always able to make any comedy to be smart one. On thiz latest feature, there are some unique and hilarious characters, such as: Scott gay roommate Wallace (Kieran Culkin), the annoying Scott ex-girlfriend Knives (Ellen Wong) and Ramona Indian silly ex-boyfriend Matthew Patel (Satya Bhabha). Even more, the movie is surrounded by refreshing Cameo appearances from Anna Kendricks, Jason Schwartzman, Chris Evans, Thomas Jane and our last Superman, Brandon Routh. Michael Cera seems to be a perfect choice for Scott Pilgrim, he does not even have to act so hard for being Scott character. Mary Elizabeth Winstead delivers some cool punk-girl character successfully. The movie apparently based on the first three series of six black-and-white comic strips by Bryan Lee O Malley. The Art Direction is so different and attractive. They use comical fonts to emphasize the sound and the fighting scene is one of my main attentions. The fight scenes are mind-blowing with those graphics and animations, yeah it looks ridiculous sometimes, but surely well-choreographed. Once again, the only way to comprehend thiz movie is by letting yourself being young again. Just to recall how we enjoy adolescence by just living in our own world. Once in awhile, all of us were Scott Pilgrim and only us Vs. The World. Welcome back to MTV generation. For me, thiz movie deserves to receive 1Up and 1000 Combos!    Visit My Blog on JONNY'S MOVEE on : http://jonnyfendi.blogspot.com",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "Totally irrational. But an innovative, fun, and fast-paced ride between video game, comics, and young people romance.",
      "total_reactions": 0,
      "user": "juliankleiss"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Great movie, people bashing it really aren't looking at the right spot (as a hint its not about character development). its a great topical comedy and it flowed seamlessly from semi-realistic into full on video game mode.",
      "total_reactions": 0,
      "user": "lightslash53"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "After seeing the trailers for this film I initially thought it looked like one of the worst movies made... then after seeing so many good reviews for it I finally convinced myself to rent the dvd.. and thank god I did, I can't believe I almost missed out on watching such a fun crazy film.. remember it is based on a comic so it's not the most realistic movie made but damn I probably never enjoyed a film so much, it's kind of a crazy movie actually, everything was excellent, from the soundtrack to the visuals, from the directing to the acting. A must see for anyone who likes to have a good time!",
      "total_reactions": 0,
      "user": "sumsar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2011
      },
      "score": 6,
      "text": "Interesting mix of computer gaming and kung fu movie with over the top action scenes and a weird concept of a love story. Although it sounds like a car crash waiting to happen, once you don't take it too seriously it does make for an entertaining and enjoyable movie.",
      "total_reactions": 0,
      "user": "rotku"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "This is my favorite movie of all time.The books are better but thats only because they are longer.Its funny, romantic, and it has action.I also love that it has alot to do with Nintendo especially Legend of Zelda.",
      "total_reactions": 0,
      "user": "M-Rod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "Most original movie ever made. Incredibly entertaining and hilarious. I wish more than anything that more people would have gone to see it, because I want a sequel!",
      "total_reactions": 0,
      "user": "Joross"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "Part 2",
      "total_reactions": 0,
      "user": "KeeferBishop"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "Okay, this movie clearly has some flaws / isn't perfect, however I found this movie to be creative and infectious.  The theatrical trailer made me want to never me caught dead in a theatre where this film is / was being shown, but now after having seen it I realise how poorly movies can be presented. (I admit I expect way too much, but it's hard not to when you have trailers like Super 8- a bit of a letdown; and Inception- letdown city)  In this day and age where movies like 'Clash of the Titans', 'Jonah Hex', 'The Other Guys' are afoot, this film more or less saves the day.  Sure you have films like Social Network and Black Swan in the same year (which were both great), but this movie offers a new direction that is unique and fun.",
      "total_reactions": 0,
      "user": "GMU"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2014
      },
      "score": 5,
      "text": "Scott Pilgrim was certainly entertaining in parts but I couldn't help coming away a little disappointed, particularly since I also recently watched the excellent 'Kick-Ass'. Although this film has a similar comic book style it did not have the same level of humour, despite the many pop-culture references, and the action scenes certainly did not match the best that film had to offer (such as Big Daddy fighting through the warehouse).",
      "total_reactions": 0,
      "user": "drlowdon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "Hmm..  Entertainment Weekly called this:",
      "total_reactions": 0,
      "user": "schnide"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "This Movie is a injoyalbe ride from beging to end a nother masterpiece by the great Edger Wright this movie was problie the best movie of 2010 Kick Ass is a close 2nd.from the begining to end this movie effects and Comedy will keep you hooked. and the main character Scott almost perfictly repesents what a guy wants after a big brake up with a long time girlfriend. and this movie has a lot of injoyable rewatch moments almost just like a Graphic Novel it based on if you go back and rewatch and maybe you'll notice somthing you didnt at first",
      "total_reactions": 0,
      "user": "metbobobo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "This movie bugged me at first, with its indier-than-thou scene, but by the end I was totally won over.  It's just great fun all around, with a large ensemble of characters of true depth that hold your interest, lots of laughs, great music, and dazzling fight sequences.  One of the best movies of 2010.  Can't wait until they turn Edgar Wright loose on a Marvel title.",
      "total_reactions": 0,
      "user": "rumi17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "SP was a movie on release that really resinated with me. The young mans struggle with love, rock, imagination, competition and growing up was something that I found myself really connecting to in many ways. I often had imagined in my mind many of the things that come to life in the movie while growing up. Having seen the movie many times now I can certainly see that the film isnt perfect, the girlfriend character Ramona is a bit of a bore, and Scotts relationship with Ramona isnt as deep as what it should perhaps be. The pacing also becomes in the later part of the movie a struggle going from fight to fight. The story of the book is more concerned with the comedy of Scott growing up and finding his way in life over a 2 year period and not the condensed fighting that the movie concentrates on. The visuals and sound are nothing short of brilliant and succeed at the highest level. The comedy is also entertaining and there are some great lines and movie moments. I wished that there was that extra 10% of this movie to make it a great film, but what it is good non the less. Thumbs up!",
      "total_reactions": 0,
      "user": "davenbettridge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "This movie had me from the opening 8-bit re-imagining of the Universal theme to the countdown to the closing credits.  Scott Pilgrim vs. the World is two hours of nostalgic video-game fun with awesome battles, goofy characters, and even the occasional hilarious line.  Michael Cera does what he does best, the geeky guy falling for the hot girl, and Mary Elizabeth Winstead does the aforementioned hot girl perfectly.  They're backed up by Kieran Culkin, whom I think was probably the funniest character of the film, and several short but great appearances by Anna Kendrick.  The only flaw that Scott Pilgrim might have is that it can never be taken seriously, so much so that it never even takes itself seriously... but that's the entire point of the film.  It's meant to be two hours of pure, delightful enjoyment, and that's exactly what it is.",
      "total_reactions": 0,
      "user": "CRL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "BEST MOVIE I'VE EVER SEEN! This movie is just so amazing. In case you don't know, \"Scott Pilgrim\" is a Graphic Novel Series. It has 6 books and they are all wrapped up into this movie!. and man it is groundbreaking. i Enjoyed the books and even more the movie. The cast is just perfect, they all fit in so perfectly. and many people criticized Michael Cera for playing Scott but after reading the Books and watching the movie over 10 TIMES! I honestly can't think of anyone doing a better job than he did. Everybody else from Kieran Culkin to Mary Elizabeth Winstead were great. Edgar Wright the director did an AWESOMETACULAR job. The pacing is perfect, the action scenes, the comedy, it was right ON!. Mostly everything from the books Transcended onto the movie except for a few scenes and characters. BUT nothing to BIG. THIS MOVIE IS ONE that you'll probably never see again, or maybe you will. ITS ORIGINAL AND PERFECT. If you're a fan of Scott pilgrim Books THEN YOU'LL LOVE IT! 10/10 THE MOVIE OF MY GENERATION. MY INSPIRATION TO BECOMING A FILMMAKER!!!!",
      "total_reactions": 0,
      "user": "destroya1art"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2013
      },
      "score": 4,
      "text": "The visual novel that this movie originates from tells a witty, quirky, engaging coming of age story. What it was made out to be, however is a romantic comedy action flick. If you expect(ed) more from this film, do yourself a favor and watch the Scott Pilgrim vs. the Animation (it's four minutes long), and if you've liked it, just read the novel instead.",
      "total_reactions": 0,
      "user": "Dont"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "Scott Pilgrim succeeds where Kick-Ass failed. Yes they share the same wink-and-a-nod style of humor. Yes, they both push effect to ridiculous extremes. Yes, they both try way too hard. But what Scott Pilgrim has is a corny thing to root it in the hearts if its audience: love. Love for every cheesy moment of nerdy quirks that it celebrates, and love for its own characters and dickish protagonist. Where Kick-Ass mocked itself while still trying to appeal to those who wanted it to celebrate what it was. Scott Pilgrim is in love with itself and all those who love it in return. Technically, that would make it smug, but when a film can honestly say the line \"Once you were a ve-gone, but now you will be gone\" do you even want to complain about that.",
      "total_reactions": 0,
      "user": "J-Shap"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "This is one of my all-time favourite films. Any criticism attributed to this film is just unacceptable, because it's a fast-paced, funny, adventurous movie. Pretty much every single character gives a razor-sharp performance, even if they have just two lines. Michael Cera proves his comedic brilliance once more, Jason Schwartzman (apparently the nicest man in the world, according to others) shows how well he can be an evil bastard, and great comedy turns from Chris Evans and Brandon Routh are the icing on the cake.",
      "total_reactions": 0,
      "user": "alexandergreen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "Its nice that they tried something new with this movie, there really hasen't been something this different in a while.  I suppose some like it some don't, it was a nice concept but the actors and storyline are just terrible and i couldn't wait for it to be over.",
      "total_reactions": 0,
      "user": "hootis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "Honestly, I've seen this movie about fifteen times, and every time I see it I find a lot of Easter eggs, as if playing a video game, this movie has comedy, love, action, a great script and the most beautiful soundtrack I've heard in my life, this film does not deserve a 10, deserve a 100 worth of 10.",
      "total_reactions": 0,
      "user": "Lord_Angeluz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2015
      },
      "score": 2,
      "text": "Scott Pilgrim vs. The World is a film adaptation of one of the most successful teen novels of all time. The story and film have gained an almost cult like following, and I had to see what all the fuse was about. The truth is, that this particular films represents everything that is wrong with our society and youth culture in general. Scott Pilgrim is the kind of guy who likes to label everyone and everything, but worse than that, he rants in circles, using constant innuendos, that only a fourteen year old would understand. The story isn't even that unique or special, as the film moves at lightning speed, which is slightly slower than the speed at which it's star, Michael Cera, delivers his lines. I really felt as though my head was spinning, with a mix of slang and new terminology, that simply didn't make any sense to me. As far as the story goes, it's just another modern love story, featuring a lovable loser in love, which was completely unbelievable. The reason is Michael Cera, who seemingly plays the exact same role in every film. He's this nerdy, uncomfortable guy, trying all these awkward ways to get girls to fall for him, and it never works, possibly because he is one of the most feminine and closeted actors out there today. I generously gave this film 1 star, because I actually did enjoy Scott Pilgrim's band, but aside from that, this film is a complete waste of time. It's star is unbelievable, it's story is overly complicated, and the dialogue is arguably the worst I have ever heard. Scott Pilgrim vs. The World may be your teenage daughters favorite movie, but if you're older than sixteen, you're going to want to skip this one.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "No es una pelÃ­cula que estÃ© proponiendo como primera vez algo, simplemente estÃ¡ articulando lenguajes de diferentes expresiones: comic, videojuegos, cine; y lo hace en un equilibrio a resaltar. ReseÃ±a del filme en http://cineplacebos.webnode.es/news/disfrutando-de-la-juventud/",
      "total_reactions": 0,
      "user": "CinePlacebo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "Certainly one of the weirdest films I have ever seen, Scott Pilgrim vs. the World is also one of the most entertaining and well made films I have seen. Once I got over the general weirdness of it, the film really took off for me and above all, is incredibly fun, but most importantly, it is well made. Edgar Wright's style is very abrasive here, since he basically just made it a video game/comic book that was made into a movie, but it really has a very cool and unique look to it that really made the film true eye candy at times. The characters are all pretty well written, though there are some things that really did not work writing wise and I do wish the script was better at different times. The acting was very good from everyone, really loved Mary Elizabeth Winstead and Anna Kendrick here, in particular. While very, very odd, Scott Pilgrim vs. the World is a shining example of Edgar Wright's talents in the director's chair.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "Edgar Wright is easily one of the best directors out their, his films are always, energetic, bold, funny and just a whole lot of fun, to goofy fight scenes, great characters and amazingly witty dialog",
      "total_reactions": 0,
      "user": "ReubenIsAGod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2016
      },
      "score": 10,
      "text": "This movie is a must-see for anyone into gaming/arcade culture even in the slightest. You have absolutely no idea what's going on in the 20 minutes, which sets up a great non-linear structure that eventually does narrow into a linear one. However, the awkward erratic comedy keeps you focused as to what's happening on screen rather than predicting what's going to happen later on in the movie, at least for the most part, as there's a few hints as to what generally tends to conclude a comedy movie. A very late review on my part but definitely one of the best feel-good movies I've ever seen.",
      "total_reactions": 0,
      "user": "Garian"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2016
      },
      "score": 6,
      "text": "Scott Pilgrim vs. The World is brilliantly edited like Edgar Wright's Cornetto trilogy and has unique visuals and fight scenes that really dazzle. But the film's humor doesn't land for me personally, which is surprising given that Shaun of the Dead, Hot Fuzz and The World's End are some of my all time favorite comedies.",
      "total_reactions": 0,
      "user": "Jack97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "Um dos filmes mais divertidos do ano de seu lançamento",
      "total_reactions": 0,
      "user": "Iky009"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "As a hardcore gamer and total comic book nerd, there is no way I was going to skip this movie. Is this movie stupid? You're damn right it is, but you know what? So are most of the other movies that Edgar Wright directed, and those were all awesome. This, my friends, is another one of his masterpieces, sure to make you laugh uncontrollably for at least five minutes.",
      "total_reactions": 0,
      "user": "ZombieAxeHero"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2015
      },
      "score": 9,
      "text": "A video game inspired explosion of romance, comedy, art and fast paced action. Scott Pilgrim vs the world is one of my favourite films of all time and deserves so much more praise from critics",
      "total_reactions": 0,
      "user": "TrilobiteG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "Two words to describe this movie: NEVER BORING. While the characters' deliverance of the lines may seem hammy, the editing in the movie is among the best of the year. If you have any love for video games or the dating scene, I suggest this movie for you. The songs covered in the movie are also well done as os the performance of Kieran Culkin as Wallace, who made me laugh everytime he made an appearance. The movie is quiick, on point, funny, and full of badass.",
      "total_reactions": 0,
      "user": "Rem"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "Scott Pilgrim vs. the World was actually a pretty good movie and it was way better then what i thought it was going to be. After hearing good things about the movie from multiple people i decided to give it a watch. Seeing that the Director is Edgar Wright the guy that brought us Shaun of the Dead, Hot Fuzz, The World's End and soon Marvels Ant-Man i should have giving it a chance a while ago. I had just seen this movie for the first time last year when i bought it on blu ray and this is only my second time watching it. I just dont like Michael Cera all that much as he is always the same in all his movies this movie though makes him tolerable. There are so many hot women in this movie Mary Elizabeth Winstead, Anna Kendrick, Aubrey Plaza but i just absolutely love Mary Elizabeth Winstead she is simply gorgeous especially in this movie all the different hair colors she has and her facial expressions were super cute. Chris Evans part in the movie was hilarious i loved the part when he is walking off the bus and the Universal Studios Theme music starts to play that was too funny. The concept was great and it played out pretty well and the fighting was also kickass. Thomas Jane and Clifton Collins Jr. as the Vegan Police was so random but i found it funny because i know the actors.",
      "total_reactions": 0,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "Scott Pilgrim vs. the World seems more like a video game than a movie (and that's the point), and it literally makes no sense, but it's quirky and funny enough to be watchable.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "I loved it so much now i am a huge fan the story everything thing is AWESOME in i hope we see a 2nd one. This is for music fans,gamers and movie fans one to bee seen",
      "total_reactions": 0,
      "user": "Adam201028"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2016
      },
      "score": 3,
      "text": "Basically, Twilight for boys. Completely average and ugly teenager being loved by two awesome girls and having fantastic adventures with a lot of action. Well, at least it has some kind of humour going for it. That's something, I guess...",
      "total_reactions": 0,
      "user": "Kalasanty11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "A fresh take on comic book films, and a true homage to the 16-bit video game culture. Scott Pilgrim is a Canadian boy in a band who finds love in a girl, but first he must battle her exes to win her heart. I admire Edgar Wright's originality and guts to take on a project that could have gone horribly wrong.",
      "total_reactions": 0,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "Unique, fun and very entertaining, Scott Pilgrim vs. The World is a very stylish video game adaptation that is incredibly fun to watch. Despite some clichéd scenes, Edgar Wright injects the movie with a sense of wild modern humor to make it a memorable watch.",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2016
      },
      "score": 10,
      "text": "This was such a schlonky movie and I loved it. It literally had everything that could satisfy your inner dweeb with video game references, action, tons of comedy and a tad bit of romance.",
      "total_reactions": 0,
      "user": "bfoore90"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "I absolutely love this movie. The story is amazing, and can be loved by anyone ages 14-30 (and older), and the couldn't of picked better actors to play the characters from the books. Highly recommended.",
      "total_reactions": 0,
      "user": "chem64"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "One of my favorite films. Full of energy, visuals, black humor, white humor. Video Game turned into a movie. Great soundtrack. Anti-hero movie favorite.",
      "total_reactions": 0,
      "user": "Christian0205"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "This movie is a shock for the senses. The fast paced action and comedy rarely leaves you able to even look away to do something as small as check your phone. The characters, good and bad, are all hilariously overblown in the most enjoyable way. Nerd or jock, you just needed to be a child at some point to get lost in this movie.",
      "total_reactions": 0,
      "user": "DirtyDave"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Unique, fun and very entertaining, Scott Pilgrim vs. The World is a very stylish video game adaptation that is incredibly fun to watch. Despite some clichéd scenes, Edgar Wright injects the movie with a sense of wild modern humor to make it a memorable watch.",
      "total_reactions": 0,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 9,
      "text": "This movie is a perfect example of a movie which isn't made for the masses. All the references towards old-skool arcade games, comic books etc. make this movie hard to watch for people not into that scene or who didn't grew up about 15 years ago.",
      "total_reactions": 0,
      "user": "hystrix"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 9,
      "text": "I want to give 10/10 but I could not do it. The movie is some of the most awesome things in movie history. The story is deep on many levels and the fighting scenes are unmatched. The humor works very well and there is no bad actor or performance in the entire cast. The only negative point were the first 20 minute of the film. It started slow and with some awkward scenes. Many people (some of my friends too) turned away from this movie and missed probably one of the best movies ever made. Because of this I give 9/10 (The mentioned negative point is sadly valid enough).",
      "total_reactions": 0,
      "user": "Kai82"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "Fantastic. Brilliant. Risky. Beautiful. Superlatives. Humor is not only driven from the incredible dialogue, but from the way the film is directed, edited, and presented. Absolutely see it. Especially if you would be happy to know Cera played Final Fantasy 2 song on his bass!! Critics love it too!",
      "total_reactions": 0,
      "user": "awkwardMEOW"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "Bro, this is essentially the best film ever made. It doesn't have everything in the books, but if it did then it would be way to long so that's to be expected. This film will have you filled with excitement with every battle to come.",
      "total_reactions": 0,
      "user": "sonic4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "For fans of all things geeky around the world, this film is for YOU! Comedy, action, romance, video games, music; \"Scott Pilgrim vs. The World\" has everything you could ask for. It very quickly became my favourite film after watching it and I could watch it over and over again without ever getting bored of it; the same way that you could watch the same episode of Friends for the 'nth' time and find it as hilarious as the first.",
      "total_reactions": 0,
      "user": "massey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "This s a fun, inventive, and amazing film. It is ambitious, epic, dazzling, and tries to maybe do too much. It doesn't fully succeed here, but there's so much that is great that it is easy to bypass what little flaws there are.",
      "total_reactions": 0,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Scott Pilgrim is based off of a comic book series, set protagonist being Scott pilgrim, who is part of a band named \"Sex Bob-omb\" who falls in love with Remona Flowers, knowing he didn't have much chemistry with Knifes Chao he pursues Remona until she acknowledges his love for her. However after sleeping with her, Scott finds out that about the \"seven deadly exe's\" she brokes up with. In order to prove his affection towards Remona, Scott has to defeat the seven deadly exe's.",
      "total_reactions": 0,
      "user": "Signas501"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "Scott Pilgrim vs The World is one of the most original films that i seen",
      "total_reactions": 0,
      "user": "AwesomeRaider"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "The most usual movie but at the same time very creative and artistic.Add to that the humorous story that is well acted by all the cast. In the end Scoot Pilgrim vs The World is a solid unique movie.",
      "total_reactions": 0,
      "user": "geo333"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2016
      },
      "score": 8,
      "text": "What makes \"Scott Pilgrim vs. the World\" much better than your average comedy flick is it's playful structure and design. I love it when films take risks and play with the narrative. This film is worth the time.",
      "total_reactions": 0,
      "user": "PetitBikini"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "Let me put this lightly: if you were born and raised on video games, or are even familiar with games like Zelda, Street Fighter, and Mario, you will enjoy, if not love, this film. The fast paced editing wrapped around the surprisingly good performance by Micheal Cera, supported by a great cast and excellent music make this a great watch.",
      "total_reactions": 0,
      "user": "aadityamudhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2016
      },
      "score": 7,
      "text": "Scott Pilgrim just seems enjoyable to watch. Let's watch him fight the world to win his girlfriend's heart. Yeah, that's very original... any who, this story just seems entertaining to watch.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2016
      },
      "score": 10,
      "text": "Scott Pilgrim vs the World is an indie adaptation of the popular comic, which is actually one of the greatest movies about games ever made, which will make you long to pick up that old NES console and remember gaming as a child, those brought up in the generation of 8-bit consoles. Well, after a while, it strays from the comic a little, but they have chosen only the best bits to keep.",
      "total_reactions": 0,
      "user": "Thatmoviesdude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2016
      },
      "score": 0,
      "text": "It has been several years since I last sat through the slog that was Scott Pilgrim vs the World. And to this day I still hear 'fans' of the movie talk about how it's the greatest video game movie ever made. This isn't true. And if you choose to watch the movie, you will see that nothing is good about it. It's awkward, stilted, not funny, and offers nothing of value. It can't even be considered so bad it's good. It's just bad. Although I am primarily a video game critic, and an exceedingly popular, well known, and respected one at that, I feel as if I step forward to call this movie's fans for what they are: Hipsters are who are trying to pretend to be nerds. Let me give you an example of what this terrible film does. So Scott is hanging out with his bros and his lesbian girlfriend or whatever and his psycho high school girlfriend pops in up in the window. The Zelda item theme plays. This is supposed to be a bad thing, why is that jingle playing now? It makes absolutely no sense and was clearly only thrown in because hipsters love Zelda, even though they don't play the games. A better video game movie? Probably Wreck it Ralph. Or maybe even the Super Mario Brothers movie. Even that film had Bob-ombs who did what they supposed to do. Scott Pilgrim is not worth anyone's time. It's an unfocused mess that doesn't really have anything going for it.",
      "total_reactions": 0,
      "user": "CodyCoyote64"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2016
      },
      "score": 9,
      "text": "I absolutely love this movie. If you love video games and movies about video games, then this is the right one for you. I absolutely enjoyed Edgar Wright's style with his blend of action and comedy. In fact, I liked this as much as Shaun of the Dead (another one of his films) if not more. The action was fast paced, the story was pretty decent, and the movie was funny and thoroughly entertaining. Even if you're not into the whole gaming scene, it's still possible for anyone to enjoy this movie regardless. If you haven't seen it, I definitely recommend it. :)",
      "total_reactions": 0,
      "user": "rei07"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2016
      },
      "score": 7,
      "text": "Whenever Michael Cera is in a movie, there is always a connection between the Independent world and mainstream media. In other words, Cera usually stars in movies with an \"Indie\" theme but is geared towards the general audience (i.e Nick And Norah, Juno). In this case, Edgar Wright's (Shaun Of The Dead, Hot Fuzz) Scott Pilgrim Vs. The World explores the world of pop culture using a combination of video games and indie rock.",
      "total_reactions": 0,
      "user": "TheArchetypes"
    }
  ]
}