{
  "mc_avg_user_score": 4.1,
  "mc_metascore": 30,
  "mc_mixed_rating_frequency": 47,
  "mc_movie_name": "Seventh Son",
  "mc_negative_rating_frequency": 69,
  "mc_positive_rating_frequency": 39,
  "mc_pro_critic_reviews": [
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "By-the-numbers, generic plots no longer work and that, unfortunately, is what Seventh Son delivers. Impressive set design and visuals, excessive CGI, and a loud score from Marco Beltrami can't fully compensate for bland character development and a predictable narrative that rushes along on a linear trajectory."
    },
    {
      "critic": "Glenn Kenny",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "Surprise! One doesn’t want to damn the movie with faint praise by saying “it’s not that bad,” but that’s kind of the most objectively accurate description of it, in all honesty."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "To its credit, despite a rough start (witch burning and all that), Seventh Son does not succumb to misogyny."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "Seventh Son is brisk and unpretentious, though the fact that these two qualities can be considered remarkable probably says more about the state of modern genre filmmaking than it does about the movie itself."
    },
    {
      "critic": "Thomas Lee",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "The result is a movie that serves as little more than an excuse for Moore and Bridges to camp it up."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "It’s a thoroughly incoherent, generally inane and surprisingly entertaining tale of witches and monsters and what legendary film critic Joe Bob Briggs calls “beast fu,” all set in a sub-Tolkien, sub-“Game of Thrones” pseudo-medieval universe."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "Seventh Son is not a good movie, but it’s also not a pretentious one, and I call that a fair trade."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "The film is overstuffed, but it’s swift and unpretentious, barreling through a non-stop series of action setpieces without pausing too long to take a breath. The busyness doesn’t eradicate the clichés, much less enrich the film emotionally or thematically, but there’s no time to think about them when Bodrov and his screenwriters, Charles Leavitt and Steven Knight, are moving along to the next sensation. It’s transporting in that sense, and that sense alone."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 42,
      "summary": "Though the film sat in drydock for a year, partly so technicians could convert it to 3-D, it looks as dull as it sounds."
    },
    {
      "critic": "Kyle Anderson",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 42,
      "summary": "(Bridges) has a tendency to make mistakes, especially when it comes to science fiction and fantasy titles. He has followed up the minor disasters that were \"R.I.P.D.\" and \"The Giver\" with Seventh Son."
    },
    {
      "critic": "Ken McIntyre ",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "A swollen budget, a mini-Big Lewbowski reunion, and top-notch digital effects fail to enliven proceedings in yet another ho-hum dragon chaser based on a YA novel."
    },
    {
      "critic": "William Goss",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "This swords-and-sorcery throwback has little imagination on display, instead doubling down on computer-generated flair to pass the time."
    },
    {
      "critic": "Julia Alexander",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "Seventh Son is indescribably disappointing because it could have been a refreshing treat for genre fans. After spending years in development, the final product is laughably abysmal, and perhaps worst of all, utterly forgettable upon viewing."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "This rambunctious swords ’n’ sorcerers fantasy flick has grubby, pseudo-medieval CGI style to burn, but precious little in the way of anything new to add to this sort of genre storytelling."
    },
    {
      "critic": "James Rocchi",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "Seventh Son tells a story of dragons, witches, ghosts and ogres, but the most fantastic thing about it is the idea that someone thought this lumpy, bumpy and swollen sack of tired tropes and cluttered CGI would attract audiences."
    },
    {
      "critic": "Kerry Lengel",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "Seventh Son is recommended only for the most far-gone of fantasy addicts, for whom it will serve as a sort of methadone. It won't exactly satisfy, but it will tide you over until the next season of \"Game of Thrones.\""
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "Director Sergei Bodrov’s movie is based on a kids’ book in which Tom was a 12-year-old, and the actors wisely pitch their performances to a young crowd."
    },
    {
      "critic": "Jordan Mintzer",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 40,
      "summary": "If anything, the movie offers up the guilty pleasure of seeing Bridges and Moore duel it out in front of countless green screens and a few stunning Canadian backdrops – two great actors clawing at each other with magic staffs and fake fire, trying to survive in the netherworld of heroic kitsch."
    },
    {
      "critic": "David Hiltbrand",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 38,
      "summary": "If the Brothers Grimm had devoted themselves to farce rather than scary fairy tales, they might have produced something like Seventh Son, a whacko sword-and-sorcery exercise."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 38,
      "summary": "Moore goes into operatic mode as Mother Malkin, a nasty witch who morphs into a menacing winged dragon. The worst performance, however, belongs to Jeff Bridges as a marble-mouthed, curmudgeonly knight named Master Gregory."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 38,
      "summary": "The only question that’s worth considering in Seventh Son is whether this all-star B-movie is bad enough to cost Julianne Moore her “Still Alice” Oscar. And the answer to that is, “Not really.”"
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 30,
      "summary": "Seventh Son not only offers no new spin on its bland, by-the-numbers story, it also fails to deliver any generic pleasures; I’m not sure this movie could even keep a young child engaged."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 30,
      "summary": "If nothing else, it’s amusing to imagine what [Mr. Bridges] and Ms. Moore chatted about between takes and how each managed to keep from cracking up, more or less."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 30,
      "summary": "Given the fine past work of its many parents, there was clearly potential here, but as delivered, Seventh Son amounts to nothing short of a creative miscarriage."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 25,
      "summary": "Torching “witches” is the one part of the story that has some historical basis, and adds an uncomfortable edge of misogyny to this otherwise empty fantasy."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 25,
      "summary": "Seventh Son moves at a fairly quick pace and has a sense of humor about itself. That doesn’t mean it’s thrilling, or funny. Just that it’s a quickly forgotten pile of junk."
    },
    {
      "critic": "Elise Nakhnikian",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 25,
      "summary": "As is often the case in films like this, Seventh Son is at its weakest when it tries to leaven its brink-of-disaster gravity with a little nerdy humor."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 20,
      "summary": "Seventh Son would hardly be the first film to use \"strong female characters\" as a means of waving its misogyny under the radar, but it’s seldom carried off as depressingly as this."
    },
    {
      "critic": "Simon Abrams",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 20,
      "summary": "Jeff Bridges's abysmally campy performance may be the worst thing about disposable sword-and-sorcery fantasy Seventh Son, but it's also the only memorable thing."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "summary": "I know it's early, but Seventh Son may actually be the worst movie of the year. It will most certainly be a contender. The medieval/fantasy/action/drama/romance hits pretty close to a perfect 10 on the egregious scale."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "summary": "It is a staggeringly bad film, made up of lots of faulty pieces."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "summary": "Nothing in Seventh Son is compelling, interesting or noteworthy, though you can feel the strain of the filmmakers attempting to set up a potential franchise."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "This less than enthralling fantasy film plays out like a mash-up of The Lord of the Rings and Hansel and Gretel: Witch Hunters without any of the original splendor.",
      "total_reactions": 1,
      "user": "SnowDay"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2015
      },
      "score": 3,
      "text": "Seventh Son is the latest pile of trash to come out this year. Unoriginal, boring, horrible acting and a movie that makes no sense. At least the visuals kept your eyes from closing.",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2015
      },
      "score": 2,
      "text": "Overall I really disliked Seventh Son, it was so boring.   It had a script of a film that I had seen a hundred times and it’s been done better before and it wasted a brilliant ensemble cast.  How you have a film with Julianne Moore and Jeff Bridges in and you don’t get a decent performance, I will never understand, and it is a sign of poor directing.  The 3D was laughable and I think actually impeded the film I was watching and the action sequences were really varied in quality.  It’s a very bland, very forgettable film and if I haven’t forgotten about most of it in a week, I will be amazed!!  I won’t be surprised if this film turns up in my worst films of 2015 list, although it is way too early to speculate on that. The ending of the film eludes to this becoming a franchise PLEASE NO!",
      "total_reactions": 1,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "At the beginning, the movie seems promising. But as the movie goes, the plot become weaker and weaker.",
      "total_reactions": 1,
      "user": "rudman88"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "Fantasy adventure films have always had their place amongst the realm of cinema, when I was young I loved fantasy adventure, films like: Conan, Krull, Beast Master and alike. These days though I feel as though everything that gets released in the genre are recreations of plots done to death and were done much better, sure the special effects in the 70’s and 80’s were nothing compared to what they are today but that’s what made those films so great, those little special effects. These days CGI is king and a lot of the time is so over used that it leaves nothing for our imaginations to grasp hold of.",
      "total_reactions": 1,
      "user": "Insideabanshees"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "Fell Asleep...................................................................................................................................................",
      "total_reactions": 1,
      "user": "Jade97"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "This movie is one of the most clichéd, unoriginal stories ever made in the history of cinema. An evil is going to destroy the world, but it has to wait for certain weather event to happen for its powers to be fully loaded; and there’s only one person that, for some stupid reason, can destroy it and save everything, but he needs a master because he is not yet ready to fight that evil. How many times have we seen that before? It’s just so dumb, anything you can predict that is going to happen based on previous similar films, happens; there’s no one single unexpected twist, and there’s absolutely nothing new. The script is very laughable at. They don’t even bother in explaining why the main character is so special. The only reason they give to us is because he is the seventh son of a seventh son (and another stupid reason that I don’t want to spoil), and that’s it. I don’t even know what Jeff Bridges, Julianne Moore and Djimon Hounsou were doing there, but it’s definitively bad for their curriculum.",
      "total_reactions": 7,
      "user": "Dokalu"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "i loved this movie.  i have no excuse, maybe it was Jeff Bridges voice which i cannot replicate but it worked for me. i usually trust the viewer reviews more than the critics for some reason. still, i thought this was better than Jupiter ascending, which i forgot the next day. i love scifi and  fantasy and special effects. i cant say this was the greatest movie but i did just like it.",
      "total_reactions": 7,
      "user": "harsubagh"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "If you were going to see Seventh Son after reading The Last Apprentice, then don't. This move has almost nothing in common with the book other than similar names. One of the worst book adaptions I've seen yet.",
      "total_reactions": 3,
      "user": "frozenfrostfire"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "I went to see this with my two daughters, one of whom read \"The Spook's Apprentice,\" which was the basis for the movie.  All of us liked it very much, including the daughter who read the book.  In fact, she said it was the best movie she's seen in months, much better than the last two, where we made the mistake of trusting the \"professional\" critics, who rated them quite high.  I simply do not understand the bad user ratings, unless there is some attempt to appear sophisticated by aping the critics, who don't review movies with the same approach us average users do.  I make my judgements based on whether the movie justified my admission fees.  This movie did so.  The special effects were, as is so common now, flawless.  The acting was good, and the plotline explained what this user needed to know of the backstory.  I give it a solid 8 out of 10 as a good action adventure romp that provides a good release from the cares and stress of daily life.  I recommend keeping an open mind and giving this one a try.  It's sure better than \"Black Sea,\" which left me wanting to ask for a refund.",
      "total_reactions": 5,
      "user": "cpodom"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "From pathetical acting to pathetical screen writing to pathetical plot, Seventh Son is truly the bottom of the barrel when it comes to fantasy films. However I will give it points for the unintentional comedy.",
      "total_reactions": 6,
      "user": "cryhardhumor"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 2,
      "text": "Seventh Son has great action scenes and A list acting. But this boring, rushed book adaptation, cannot be saved, even by Jeff Bridges at his best. Seventh Son plays out like Lord Of a The Rings meets Gladiator. Director Sergei Bodrov, mixes with his elements, for a movie, not worth watching. I thought this movie would be different, but how much can you expect from book adaptations. SS is a wasted opportunity, Bodrov's vision of the book is clunky and flawed.",
      "total_reactions": 4,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "Whatever potential this movie may have had was covered in excessive, repetitive and bad CG, a narrow clichéd story with completely uninteresting characters outside of Master Gregory and his apprentice (Who's name I cannot remember). I rolled my eyes so hard when the protagonist was talking about how he would \"get out of there\" and \"make something of himself\". Visions?? Really? How original, the protagonist has visions. Sigh, I know 3 of the characters names, Tusk, Mother Malkin, and Master Gregory. The rest are apparently unimportant. I left the theater with more questions than anything. Where do Gregory go after everything? Why did every witch burn away and showcase bad CG upon death? The movie wasn't all bad but there nothing really good and I laughed about twice. Only the young would find any enjoyment from this, assuming they haven't seen a million other movies with the same plot.",
      "total_reactions": 4,
      "user": "IllusivemaN7"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "Its not that bad guys lol. I think the story seemed interesting and jeff bridges is awesome as the Spook. I wish Jon Snow was in the movie longer. The CGI was cool I dont think it was HORRIBLE like you guys think and the person who I saw it with liked it alot as well.",
      "total_reactions": 2,
      "user": "Just1nsane"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "I actually really enjoyed the Movie possibly due to enjoying the book, its transferred to screen about as good as it could, i would look forward to more, there are 10 books and this Movie was Book 1",
      "total_reactions": 2,
      "user": "Can7onaLegend"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "I have seen lots of fantasy movies from The Lord of the Rings to Monty Python and the Holy Grail and let me tell you Seventh Son brings on a whole new experience. This movie brings light upon a new set of fantasy. It is about a boy named Tom Ward who is chosen to aid the spook because he is the seventh son of the seventh son and on that journey he must fight creatures sent by the evil witch that wishes to gain all this power from the blood moon. First off people can not go into the movie expecting Harry Potter and Lord of the Rings this is mainly because Seventh Son is its own thing. From I have seen in other reviews they did not understand the story for some reason, but I promise if you have half a brain you would fully understand. The reason I am rating this a 9 is mainly because through out the movie there was this character that I thought annoying but besides that everything was pretty darn awesome. The effects and action scenes were awesome. Also, from what I know it is supposed to be a book series so I will be very excited to see a sequel to this film. I do not know why this movie has been trashed on and I know this one review will not stop that but I promise who ever reads this if you are on actual fan of Fantasy or Action you will enjoy this movie, and I forgot to mention that I saw this movie in IMAX and was completely amazed at how amazing the movie was with the 3D and amazing sound system. So, if you find yourself at the movies and do not really know what to watch I highly suggest this movie, I say watch it in IMAX but if you do not have the money that is completely understandable, I hope my review helps in your final decision to watching the movie.",
      "total_reactions": 2,
      "user": "jceb30198"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2015
      },
      "score": 3,
      "text": "A medieval fantasy film that is about the same quality as a Uwe Boll film. You can tell the actors know that this is nothing more than cheesy schlock as none of them give genuine performances. Jeff Bridges turns up the camp for his performance and Julianne Moore, well, she simply barely gives it any effort. They know the film is low quality and they don't really try as a result. The young actors are just kind of there, and the rest of the cast is completely unremarkable.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2016
      },
      "score": 1,
      "text": "This is the kind of film you watch at home on TV for free. You play it in the background as you live tweet something else, anything. Nothing here memorable other than the dreadful, dreadful voice of Jeff Bridges -- an actor I used to adore. One of the critics suggested he has become a parody of himself. It's his voice and accent: you cannot escape them and it is almost impossible to find a character behind that sound. There is no way that this was the director's idea: this is Jeff's schitck.",
      "total_reactions": 0,
      "user": "TheKiddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "I seemingly like this movie. Even though the plot is totally unoriginal, and the acting seems to be too cliched, the overall cinematographic technique is quite good, and there were moments that clicked for me. So, I still think it's a very decent movie.",
      "total_reactions": 0,
      "user": "aaronpaul121"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 2,
      "text": "What should have been the launchpad for a franchise dies on its feet with this truly terrible fantasy adventure. The seventh son of the title joins a knight in his quest to destroy an evil witch in a land of wizards and dragons. Sounds exciting but this turkey fails on almost every level, but especially in the casting of Jeff Bridges who gives the strangest performance you are likely to see this year",
      "total_reactions": 0,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2017
      },
      "score": 2,
      "text": "Seventh Son - There was one good aspect of the movie: The special effects. The acting was good, but with a script like this, no actor has a chance to shine. I have seen school performances that were more memorable than this.",
      "total_reactions": 0,
      "user": "meru"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "I think this movie needed more character background to understand why they were doing what they did. Of course, I just don't like movies that are one fight after another. I really liked the strong good women that broke up the evil, a needed respite.",
      "total_reactions": 0,
      "user": "ledaumas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2016
      },
      "score": 6,
      "text": "Decent fantasy epic. Good effects. Some depth. After barely watching it the first time around, the second time changed my mind. It from start to finish displays some original script writing. The effects are surprisingly good. I enjoyed it more the second time around.",
      "total_reactions": 0,
      "user": "gamerzx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2015
      },
      "score": 5,
      "text": "It is nothing more than a Syfy movie with better effects and two Academy Award winners. Not inventive or unique in the slightest, but that is what I expected. Good enough for what it was.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2015
      },
      "score": 4,
      "text": "For the first two thirds of the film you don't care about any of the characters.  There's just no development of any of the characters you may get the premise but the dialogue means nothing.  The final third was the most interesting and at least kept my attention.  D+",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "THE.WORST.MOVIE.EVER.",
      "total_reactions": 0,
      "user": "BoojVhlee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2015
      },
      "score": 2,
      "text": "Sergei Bodrov managed to turn a fantastic and completely unique book series into cliqued, unoriginal drivel with poorly built characters and world. I am sure I could make a far better adaptation with a 2001 $100 camera and Windows Movie Maker.",
      "total_reactions": 0,
      "user": "jameskparry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2015
      },
      "score": 3,
      "text": "There should be an award ceremony revoking Oscars, because some of the stars of this should be required to return theirs. Lots of fancy special effects can't save this convoluted foray into the world of fantasy and adventure. The script for this is just terrible and can't seem to decide whether its dialogue should be modern day or classical. And the direction...is non-existent. I bet Kit Herrington thought that he had made a wrong turn on his way to the set for \"Game of Thrones\" when he stumbled into this mess.",
      "total_reactions": 0,
      "user": "WJS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "\"Seventh Son\" 10 Scale Rating: 4.0 (Mediocre) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "I can't think of anything but weak. Despite an interesting plot and an amazing Jeff Bridges, Seventh Son never connects with us for real. Tom is not likeable enough as a hero, his romance with Alice is not convincing and the end is quite disappointing. Special effects are great, we have electrifying action scenes but they aren't enough to please the audience. You can watch it and have some fun, laugh a little bit, of course, but this movie won't get your love.",
      "total_reactions": 0,
      "user": "danipp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "The film has so many flaws. The misuse of A-list actors is disheartening, the dialogue is like that of a Saturday morning cartoon, and the accents are equal parts ridiculous and inconsistent. And it seemed as if the visuals were out of focus. Also, when someone goes flying into a pillar at 80 mph, they should be dead, or at the very least, seriously injured. Also, I wish Kit Harington was in the film longer.  Also. There isn't a whole lot of character development. The film also has some good features though. Cool CGI and great action. Cool villains, and a plot that has potential. But in the end, the film was pretty bad.",
      "total_reactions": 0,
      "user": "Fantasy_Critic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2015
      },
      "score": 1,
      "text": "Unflowing plot, lack of introduction, no certain climax, unclear events everywhere.in the end it seems like it just strolling around.",
      "total_reactions": 0,
      "user": "Alexlee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "It's a cliche movie and I'm pretty sure that everyone has already watched a movie like this one before: magic, witches, fantasy... the only good thing that I think about this is the visual effects, it was very good, but Seventh Son is just another fish on the fantasy and magic medieval stories ocean.",
      "total_reactions": 0,
      "user": "quotes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "What to say about this movie... It is a good way to spend an afternoon.",
      "total_reactions": 0,
      "user": "Sor-El"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 0,
      "text": "Well I was not happy with this movie! The book was so amazing and clever but the movie didn't follow it he was a 12 year old boy and Alice ended up being his friend not. Girlfriend! The special effects were good but that's it!",
      "total_reactions": 0,
      "user": "Kathywhatwastha"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2015
      },
      "score": 4,
      "text": "Well, this movie felt like it took all the things that didn't work with films like Season of the Witch, Van Helsing, Elektra (where she fights these people who are supposed to be awesome assassins but they die super quick) , Eragon (which wasted Jeremy Irons.).  It was predictable and pointless.",
      "total_reactions": 0,
      "user": "Markham2015"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "This is a baseline for any action movie. The beginning hooks you but the plot becomes mediocre eventually. Regular viewers of any action movie will be uninterested in this but you'll get some enjoyment out of this movie. Best as just a rental.",
      "total_reactions": 0,
      "user": "thetmg1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2015
      },
      "score": 7,
      "text": "Even if you're willing to go along for the ride, that still means taking Bridges' performance seriously. Which, believe me, isn't easy.",
      "total_reactions": 0,
      "user": "alexa417"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2015
      },
      "score": 8,
      "text": "A fantasy adventure film needs more than \"cool creatures,\" a rousing score, and two certifiably over-the-top performances to make a lasting impression.",
      "total_reactions": 0,
      "user": "tonimiller417"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2015
      },
      "score": 8,
      "text": "Seventh Son wraps itself in a bland colored shroud of clichés, making you find reality much more interesting than fiction.",
      "total_reactions": 0,
      "user": "gigiharris17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "I liked the movie. Good acting, story line and special effects.",
      "total_reactions": 0,
      "user": "jinannn31"
    }
  ]
}