{
  "mc_avg_user_score": 5.8,
  "mc_metascore": 37,
  "mc_mixed_rating_frequency": 1,
  "mc_movie_name": "Seven Days in Utopia",
  "mc_negative_rating_frequency": 5,
  "mc_positive_rating_frequency": 6,
  "mc_pro_critic_reviews": [
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2011
      },
      "score": 83,
      "summary": "In addition to being one of the finest golf movies ever, this film raises the bar on faith-based cinema."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2011
      },
      "score": 70,
      "summary": "Duvall can play an avuncular cowboy sage in his sleep, but there's truly no one on Earth you'd rather see dishing out homespun aphorisms, so it's pointless to resist the pleasure of watching him do what he can do better than anyone else. Baker and Melissa Leo, as the waitress' mom, are not asked to exhibit a fraction of their talent, but they further class the joint up."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2011
      },
      "score": 67,
      "summary": "It's a lot more cornball – i.e., enjoyable – than \"The Tree of Life,\" which tried for some of the same things. Utopia, with its big blue skies and peachy-keen people, may not rank right up there with Shangri-La, but it's close enough."
    },
    {
      "critic": "Sheri Linden",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2011
      },
      "score": 60,
      "summary": "Though the drama has its heartfelt moments, it unrolls as flat as the Texas terrain, cast in an idyllic summer glow."
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2011
      },
      "score": 60,
      "summary": "Provides little more than a pleasantly passable Christian sports parable delivered as a sort of Texan golfer's version of \"The Karate Kid.\""
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Seven Days in Utopia obviously isn't targeted at us cynical New Yorkers. But it goes down more smoothly than you'd imagine thanks to Duvall and an excellent supporting cast."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "With all due respect to Cook's novel, another book - the Bible - teaches us that on the seventh day, God gave it a rest. Seven Days in Utopia should have followed His lead."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Until Seven Days in Utopia sucker punches you with a surfeit of faith-based platitudes, its upbeat brand of golf mysticism isn't altogether unappealing."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Told in such predictable and bland fashion it dulls the effect. And this in a movie with Robert Duvall, Lucas Black and Melissa Leo."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "Lacks surprises."
    },
    {
      "critic": "Eric Hynes",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "For a time, the film shoulders its hokum rather well, with Black strutting convincingly and Duvall's mouthy mugging mostly in check. But all those shots of heavenly shafts of light eventually climax in unabashed Christian conversion."
    },
    {
      "critic": "Gary  M. Kramer",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "Seven Days in Utopia is flawed in so many ways -- the editing, writing, acting and Matthew Dean Russell's direction are uniformly weak -- that this well-intentioned film does its positive messages a disservice."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "There's a climactic putt, of course, but by then you wish Duvall would get one more \"Tender Mercies\" under his belt so you can forget about this tin cup of a family flick."
    },
    {
      "critic": "Ben Sachs",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "If the combination of Christian bromides and golf tips strikes you as a recipe for boredom, stay away."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2011
      },
      "score": 38,
      "summary": "God bless Robert Duvall. An American cinematic institution, our greatest living actor makes the fortune-cookie bromides of Matthew Dean Russell's Seven Days in Utopia sound like Yates."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2011
      },
      "score": 30,
      "summary": "A stultifying hybrid of athletic instruction film and Christian sermon."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2011
      },
      "score": 30,
      "summary": "For one thing, Seven Days in Utopia feels an awful lot like Victor Salva's 2006 New Age uplifter \"Peaceful Warrior.\" That film at least had the appeal of watching Nick Nolte play Yoda, whereas here Duvall simply seems to be playing Duvall."
    },
    {
      "critic": "Nick Schager",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2011
      },
      "score": 30,
      "summary": "A squishy Hallmark Channel-level melodrama that rarely bothers to mask its propagandistic intentions."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2011
      },
      "score": 25,
      "summary": "Until its final seconds, Seven Days in Utopia is just a piece of gee-whiz, G-rated, nicely shot evangelism outfitted as a golf movie. Then it cuts away at the pivotal moment that's normally the life's blood of inspirational sports dramas - and becomes something vastly more obnoxious."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2011
      },
      "score": 25,
      "summary": "Not a second of it is convincing - or compelling - but then the film is about \"utopia,\" a blandly idealized place unblemished by hardship, malice, sin, or errant golf strokes."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2011
      },
      "score": 25,
      "summary": "I would rather eat a golf ball than see this movie again."
    },
    {
      "critic": "Andrew Schenker",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2011
      },
      "score": 20,
      "summary": "Director Matt Russell shamelessly pitches woo to the already converted with an unholy barrage of heavy-handed flashbacks and phony Christian uplift. If any film ever needed a mulligan…."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2011
      },
      "score": 12,
      "summary": "The movie is terrible partly because it's badly written, directed, and conceived and partly because it lacks the necessarily thematic coherence to accomplish proselytism of any kind."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2011
      },
      "score": 3,
      "text": "Boring Christian propaganda flick--reality as they would like it to be rather than what it is. Christian fantasy.  This is the kind of world imagined by people wanting to avoid dealing with the world and all it complications.  When I was ten I would have enjoyed it.",
      "total_reactions": 2,
      "user": "maga"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "A movie with a message,,,what a concept!  It is so refreshing to be moved by a movie and feel that it was truly a great investment of time and money.  Kudos to Robert Duval!",
      "total_reactions": 2,
      "user": "Trudyap"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "This movie may not have all of the polish of the run-of-the-mill Hollywood movies, but it was extremely refreshing to be able to watch without hearing vulgarity, seeing inappropriate dress, and being drenched in the usual blood and guts typically seen today.  We've lost our innocence in this country and we thirst for extremes in entertainment beyond reason or good judgement.  If it seemed blaw to some viewers, maybe they need to check their hearts and minds - too much yuck has gone in.  I for one was happily surprised by the message, performances, and lessons to ponder.  Maybe it wasn't perfect in the eyes of many but I left the movie not feeling beat up or disgusted for a change.",
      "total_reactions": 1,
      "user": "wyomingite"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "What can I say, Robert Duvall is awesome as always!  In addition to Mr. Duvall's superb performance, the movie's message accurately points out that Golf is a game that can teach valuable life lessons. Living with perspective, balance, and emotional control are a few of them. I felt my time well spent which is not something I can say for most movies.",
      "total_reactions": 1,
      "user": "myview"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "Someone finally made a movie with a real life story that didn't have just a bunch of cussing and sex.....Just some decency for a family to enjoy.......Hope the general public gives this movie a chance and decides to spend their dollar on a movie with a message.",
      "total_reactions": 1,
      "user": "DennisLippy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2012
      },
      "score": 0,
      "text": "Manipulative garbage. Shameful schlock. I have lost total respect for Robert Duvall for allowing himself to be involved in such a syrup infested predictable piece of made for TV embarrassment. God Bless.",
      "total_reactions": 0,
      "user": "JohnnyTwoCents"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "just saw this movie and really enjoyed it. Robert Duval is great and I loved his character and the unconventional way that he taught Luke.  Great scenery and great message for all of us!",
      "total_reactions": 0,
      "user": "moviegal"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "Contrary to what the usual experience is, the movie is even better than the book, which I read a couple of months ago.  The story, acting, and forward motion of the movie held our attention, and it was truly an old fashioned quality movie, without the embarrassing low-class dialog and computer-enhanced imaging used in most movies to artificially hold our interest.",
      "total_reactions": 0,
      "user": "w1irebender"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2011
      },
      "score": 3,
      "text": "Seven Days in Utopia is the sweet story of promising young Texas golfer Luke Chisholm (Lucas Black) who chafes under the control of his mentor father.  In his first golf match on the pro tour, his father (Joseph Lyle Taylor) abandons him publicly, and Luke melts down and leaves the match, driving until he reaches Utopia, Texas.  There he meets retired golf pro Johnny Crawford (Robert Duvall) who helps him get back his game over the next seven days while he romances local girl Sarah (Deborah Ann Woll) and endears himself to the town folk (Kathy Baker, Melissa Leo). After his lessons in Utopia, complete with Bible instruction, Luke then returns to his now remorseful and conciliatory father for another chance at the tour.",
      "total_reactions": 0,
      "user": "FilmDilettante"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2012
      },
      "score": 2,
      "text": "I think we've found the nominee for time waster of the decade. My main problem with this film was how it only gradually started with Christian values in its first three quarters, and then started streamlining them and shoveling them down your throat in the last minutes. It turns into a complete nonredeemable mess.",
      "total_reactions": 0,
      "user": "kbm1"
    }
  ]
}