{
  "mc_avg_user_score": 4.1,
  "mc_metascore": 27,
  "mc_mixed_rating_frequency": 25,
  "mc_movie_name": "Sex and the City 2",
  "mc_negative_rating_frequency": 90,
  "mc_positive_rating_frequency": 53,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 2,
      "text": "Ok, Sex and the City (both films) was never intended to be a smart film about intelligent women taking charge of their own lives and living their lives to the fullest. Oh - wait, YES IT WAS! That's what the whole bs is about \"smart women, independent, blah blah blah\". Well, Sex and the City 2 is one of the most insulting films to women I've seen in a long time.",
      "total_reactions": 1,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2010
      },
      "score": 2,
      "text": "Sex and the City 2 more like S@#tz and the City 2! I hated this sequel as I hated everything in this movie! They shouldn't been ended since the last movie that I enjoy just a little and of course the entire series too. The characters are not laughable,there are many subplots,and why oh WHY do we have to go over with lots of problems with these ladies? Like boring stuff in issues with their relationships and there plenty of more that is far over the top. And of course they have lots of racism and too controversial when the girls are having a break at the Middle East. It's almost as bad as the Transformers 2 and I'M NOT KIDDING RIGHT THERE,they even more racism like this. WHAT WERE THEY THINKING??? If you see this movie,I DARE you and trust me you won't be happy to see this sequel ever again.",
      "total_reactions": 1,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2010
      },
      "score": 1,
      "text": "What a heaping pile of garbage. Laughably bad. All of it. And this is coming from someone who was a pretty big fan of the show. I really wish this wasn't so terrible, but it was even worse than I had imagined. A true disaster. Unfunny, poorly acted, and looks like it was directed by a child. Embarrassing.",
      "total_reactions": 1,
      "user": "Tony"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "You want to like the movie. You watched the series and you even sorta kinda liked the first movie. So you want to like it, you want to make it your summer time special. You want to enjoy it, but it just blows in your face over and over and over again. It's just too much. It's over-done, over-the-top, just like the wedding at the very beginning of the movie. It's over-produced and over-thought. It lacks carelessness and ease, not to mention it crosses over to ridiculousness one too many times. It doesn't have the wit and the smarts the original series had, and you can't find anything in common with Carrie - once always broke because of her shoe addiction, now living in luxury. Before, she couldn't afford to have her apartment renovated, now she's owning two and flying out to Middle East without a blink of an eye. I'm giving it 10, because when you peel all that off - the bad script, the over-produced schemes and the horrible product-placement - you kind of get what the producers wanted to do. There's a good, honest feeling of wanting you to feel entertained there - to leave the cinema with a smile on your face.",
      "total_reactions": 1,
      "user": "kowalski"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2010
      },
      "score": 3,
      "text": "Well if you are a fan of the series, You might have good moments and some \"SPARKLE\". For those who haven't been through the whole ride, i am afraid they are gonna have a bumpy ride cause there is a whole lot of \"Not SPARKLE\" stuff in this movie. Extremely predictable and lame story with nothing in it to be excited about. And this is coming from a huge ducking fan.",
      "total_reactions": 3,
      "user": "usamaabbas"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2010
      },
      "score": 4,
      "text": "Breaks my heart to rate this film at such a low score.  But honestly the crew of SATC could have stopped at movie #1 there was no need for #2 and there was certainly no need to base the movie on a trip to abu dhabi .  The film is riddled with so many over the top sexual innuendos its almost child like that they would think the audience is that stupid.  \"Lawrence my Labia\"   The middle eastern stereotypes were offensive and awkward it was almost like this once smart comedy stepped down and degraded down to a kindergarten level of writing and acting.  So not impressed! You can skip this film for sure.",
      "total_reactions": 2,
      "user": "Julara"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "People don't seem to get Sex and the City 2.  The creators wanted to make something over the top silly and fun, and the movie succeeded.  Yes, it has some eye rolling moments, but this movie is pure escapism similar to old movies from the 30's, 40's, and 50's.  I laughed a lot at this film, and the scene where Charlotte and Miranda talk about parenthood in the bar is one of the best dramatic and funny moments in cinema this year.  Also, I don't think these critics were true fans of the original HBO show.  That series definitely had some silly moments as well.  I don't think the movies have been that different from the TV show.  I hope they make more sequels!  There!  I said it and feel EXHILARATED!",
      "total_reactions": 1,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "I think that my organs have stopped working after watching this film. It's not a gender thing, this is just a bad movie that should have gone right to dvd. Excuse me, I have to go cough out my spleen right now.",
      "total_reactions": 3,
      "user": "Overchure"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "The opening music was suitable for an audience aged 12 to 21. Bad start considering the audience attracted to this film is aged 35+. The dvd cover for this movie has actually photo-shopped Kim Cattrall so much I actually thought she'd been replaced by another actress. Were they blind? Now Carrie is meant to be a fashion icon and the first pair of shoes we see are garish brash sequined FAIL heels. Then she's wearing a hideous tiara with crimped hair - again someone was blind. Liza Minelli covering Beyonce Single Ladies was just absolutely woeful and sad. Sam's first sex scene lives up to the hilarity we expect and is the first good scene. The soundtrack for when they arrive in Abu Dhabi was the Stargate Movie soundtrack which was a tad wierd as I kept expecting the SG1 team any minute now. I didn't see this as insulting to Muslims as others have commented. It was four wealthy American women experiencing complete opulence in Abu Dhabi so it seemed ok to me that they didn't know much about the place, the people, the culture...  They didn't actresses justice in this movie, using camera angles, lighting and make-up that made them look old and tired. Miranda and Charlotte really took a backseat in this movie which was a shame. There were a few laughs but not as many as we've come to expect.",
      "total_reactions": 1,
      "user": "Sabrinna"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2012
      },
      "score": 1,
      "text": "This film is not only offensive to women , or Arabs, but too humanity itself. Non-exisent plot with filled with ruined characters, racism, and midlife crisis like cliches that no one wants to hear about. Ridiculuosly overhyped. Just stay away",
      "total_reactions": 1,
      "user": "Jbrizzy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "michael patrick king hace un trabajo inferior al de la otra película y aunque esta mantiene las risas y las bromas estereotipadas no tiene respeto por las culturas occidentales y parece que entre mas van creciendo las damas de la película se vuelven mas elitistas y conservadores",
      "total_reactions": 1,
      "user": "diego9901"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2010
      },
      "score": 8,
      "text": "A mind freedom, wisdom and human nature is what this movie is about. The heart wants what it wants and nothing is going to stop it. A movie you need to feel.",
      "total_reactions": 0,
      "user": "Nas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2011
      },
      "score": 1,
      "text": "As a huge SATC fan who loved the series along with the first film, this movie was a HUGE disappointment.",
      "total_reactions": 0,
      "user": "jrmint"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 1,
      "text": "This movie make that  women look stupid,  this movie has no story, no developmen, nothing this movie is as empty as the first one, Michael Patrick King must the worst movie director ever",
      "total_reactions": 0,
      "user": "RodrigoBGC"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "\"Sex and the City 2\" is, in my opinion, a somewhat weaker continuation to the tv series than the first movie was.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2014
      },
      "score": 4,
      "text": "I'm surprised how entertaining and skillfully made the movie was for a guy like me. I pretty much watched it to see something exotic to what I usually see, and it delivered on the entertainment front, as well as the peek into a world that I usually avoid. As such, I recommend checking it out, but there is no truth to the portrayal of Arabs, and there is no mention of the women who find the Arab (conservative) culture to be empowering. Instead, the movie depicts the non-excessive people as submitting to the excessive rich women. That is a false and borderline deluded message. There also wasn't any focus on solving anything. The only woman who comes across as analytically smart is the red-haired one, who also uses her professional knowledge to help her friends. There are also few showings of moral integrity. The lead character shows a few heroic acts, but apart from that, it mostly follows the women as they turn off their brains and act on instincts.",
      "total_reactions": 0,
      "user": "mrnice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2016
      },
      "score": 0,
      "text": "Includes the line \"Lawrence of my labia\". 'Nuff said.­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­",
      "total_reactions": 0,
      "user": "ManiacUK"
    }
  ]
}