{
  "mc_avg_user_score": 7.4,
  "mc_metascore": 57,
  "mc_mixed_rating_frequency": 90,
  "mc_movie_name": "Sherlock Holmes",
  "mc_negative_rating_frequency": 47,
  "mc_positive_rating_frequency": 472,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "I'm loving the reviews here, the stupidity within the statements: \"It was too rational\" and \"It was too complicated and boring\" are reminding me once again that most movie-goers prefer to have their hand held throughout an entire movie rather than use their deductive skills. Too rational? are you kidding? you actually need 'magic' to enjoy something? Sherlock Holmes is ALL about the mystery being solved, everything being presented and known. If you don't like that then why did you even bother to go watch? @the Sherlock Holmes purists, every other hero of some of the oldest stories in time have transitioned into numerous changes like this one(batman, being a man without powers, being a sort of detective on his own, was changed a lot over the years). The picture of however you imagined Sherlock to be might not be the same as the next person beside you. Its open to interpretation, unless you seek to extinguish everyone's creativity due to your close mindedness. The characters weren't empty, their relationship was fully realized (Sherlock and Watson, two detectives fighting over small, inconsequential things, Watson being tired of Sherlock's antics, and yet what unifies them is the mystery for the time being. Sherlock feeling stuck in his life, feeling as though he is being abandoned, trying to pull his old friend back into the game so he wont be the only one who's trapped and alone, his character develops from there but I wont spoil it) and it was very much apparent that they cared deeply about each other, but most would rather that their emotions surface in a much more obvious way. Its ridiculous to give this movie a bad review just because you didn't bother paying attention.",
      "total_reactions": 11,
      "user": "Angelsdawn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "Hmmmm. There are action sequences, plenty of one liners, and Robert Downey Jr. I can only deduce that this is another Hollywood box office smash. And silly old me, I just saw the film. My friends pestered me about this for the longest time. They loved the film, and were positive I would too. I told them I'd get around to it, until finally one of my friends lent me the movie to watch. My feelings about this unique film are a little mixed. The film wants to be clever, but very little smarts at all are needed to view this film. Naturally, this film is geared towards teenage boys, who for the most part, are not interested in an intellectually stimulating film. They just want to see Downey deliver witty lines, and watch him beat up thugs. So, if that's what you came to see, you will not be disappointed. However those wanting a more intelligent film, should not look here. Even when the Sherlock Holmes is explaining how he figured out the case at the end, it's through many clues that the viewer didn't have a chance of deciphering themselves, which is quite contradictory to what Sherlock Holmes is all about. I know the target audience, so I expected as much, but my mother who viewed the film with me, was quite irritated at the obscure clues. A good mystery should be tailored so that the audience can try to solve the mystery too (and make it hard enough, so that they can't figure it out). This film does nothing of the sort, instead, we merely learn at the end, that Sherlock had seen things that the camera never shows us, making it impossible to solve the mystery ourselves. But like I said, the target audience doesn't care about such things, so therefore, the film is oddly \"smartless.\" But I digress. On the other hand, the cast does a fantastic job at portraying each of their characters, even if some lines were delivered a little hammy. Also, the musical score, composed by Hanz Zimmer, is very good, and absolutely hilarious. Music doesn't commonly make me smile (out of humor anyway), but this score did. Though many of the action sequences were rather ordinary, there were definitely a handful that kept me on the edge of my seat, and I'm sure the target audience will eat it up. The film is quite amusing, as one can expect with from the leading actor, but for some reason, the film wasn't quite as humorous as I was expecting. It was funny enough, anyway. Lastly, and this may be a major problem for some, but this film just doesn't feel like Sherlock Holmes. It feels like Robert Downey Jr. makes another million dollars. I suppose this is to be expected, but somehow, I was hoping that there might be some sort of Sherlock spirit to this, but alas, there was not. I was not wowed, but I most definitely enjoyed myself. I do wish, though, that the film was a bit more intelligent, and this film doesn't feel like Sherlock Holmes at all. Regardless, this is an enjoyable romp, and I'll probably catch the sequel on DVD. Consider me entertained, but not impressed.",
      "total_reactions": 1,
      "user": "LandF"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "Guy Richie's \"Sherlock Holmes\" is a stupid interpretation where Sherlock Holmes is a muscle brute solving murders and mysteries with bullet time and sheer luck. Surprisingly, the movie actually works great with its modern interpretation of Holmes.",
      "total_reactions": 12,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "Sherlock Holmes was greatly acted, suspenseful picture with a great impersonation of Holmes. Robert Downey Jr. deserved best actor nomination.",
      "total_reactions": 2,
      "user": "oscarr"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 4,
      "text": "Robert Downey Jr. and Jude Law work great together. It's a shame that nothing else in this movie works at all - the worst part is how hard it tries to.",
      "total_reactions": 3,
      "user": "ryancarroll88"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2010
      },
      "score": 5,
      "text": "When it comes to big blockbusters, I generally dislike movies that fall into this category because they simply lack any cerebral characteristic. Surprisingly, Guy Ritchie's Sherlock Holmes is dissimilar to my tendency of aversion of big budget films.  Contrary to what I just stated, Sherlock Holmes is undoubtedly not a thoughtful film. But unlike other films in my categorical standards, Holmes  makes up for it with its beautiful art direction and action sequences. Even though they are not accurate to the time setting, the scenes of combat are well choreographed and give the film personality.  Additionally, the art direction is great, the images of vintage London are just mesmerizing giving the film much needed charm to successfully emulate the original Sherlock Holmes.  Lastly, Downey Jr's replicates  Conan Doyle's literary character to English perfection with his remarkable false accent and smug personality. With these statements said, the main flaw is the lack of mystery.  Sherlock Holmes is a renowned literary character that was famous for the mysteries he solved and how he manipulated every sort of evidence to solve the case. Even though there are some traces of it, Sherlock Holmes ultimately doesn't create a plot of anonymity.   It is obvious that the film focuses on action, and that only.  That does not necessarily ruin the film, I found the film thoroughly entertaining. But the audience should simply lose the thought that Sherlock Holmes is a mystery; because it ultimately is not thought provoking or mysterious in any way.",
      "total_reactions": 3,
      "user": "RyanGee"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "I thought this film was great. Great performances all around, very atmospheric. It also manages to be authentically Holmes, although the action's on a slightly larger scale. But how could anyone not enjoying watching Holmes work out how to take down his opponents in more unique ways.",
      "total_reactions": 2,
      "user": "Lambo442"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "This is probably as good as a Shaerlock Holmes movie is going to get. Robert Downey continues to do great in this movie.",
      "total_reactions": 1,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2012
      },
      "score": 1,
      "text": "Little fidelity to the orignal character, very little homework on the history and the period the story took place. This movie is a commercial enterprise to lure bored youngster or people with low reading skills so that they can sit and turn the brain off as usual sitting on the moive theater seat eating some popcorn. Jude Law cannot make a Watson as he does not look at all like a rugby player. Robert Downety Junior would actually make a good Moriarty and Mark Strong should have been the Sherlock Holmes. They have good the cast inverted.",
      "total_reactions": 2,
      "user": "JYT"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "Sherlock Holmes is known as the brilliant detective of 221B Baker Street, who can spot minute details in the blink of an eye and observe even the smallest and insignificant things and regard them as important. Here in this film we get a more rambunctious, drugged and physical man with the same intellect and persona we'd expect. An excellent film.",
      "total_reactions": 1,
      "user": "Critic2012"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "The scenes between Holmes and Watson were witty and fun to watch. I've not read a lot of Sherlock Holmes, but I can tell the movie presented him to be a little too eccentric. Holmes and Watson excel in hand to hand combat, which I thought unlikely. Ironically, I can believe Watson to be great in fighting, given he's a seasoned soldier. The antagonist was brilliant, so was the plot and the mystery. I thoroughly enjoyed every minute of it.",
      "total_reactions": 1,
      "user": "Swati"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "I don't understand why this movie got such bad ratings, I thought it was BRILLIANT!!!  Robert Downey Jr. was perfect for Holmes, he was funny, yet serious at the same time.  I thought it was an amazing movie for the holidays, it totally made me happy after seeing it.  I must say though, it was a little unreal when they knocked down some of the bad guys....  But good must always win!!!",
      "total_reactions": 0,
      "user": "Jawcl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "Guy Ritchie's interpretation of Conan-Doyle's famous sleuth with Black Magic, bare-knuckle boxing & general 19th Century japery.",
      "total_reactions": 0,
      "user": "ERG1008"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "Nice action movie. Good performances and directing. Entertaining but I can understand the negative critic scores, after all it is a movie about Sherlock Holmes and this is definitely not the Sherlock Holmes we are used to.",
      "total_reactions": 0,
      "user": "C1G4N0"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "Although the trailers only had me moderately interested, I guess they were a good manager of expectations because this move was PHENOMENAL! Robert Downey Jr is superb as the intellectual detective Sherlock Holmes. Jude Law is perfectly cast as his partner, Dr. Watson. Even though the trailers are full of the witty quips that run rampant in this flick, they don't do justice in showing just how intelligently this story is delivered. The script is near flawless. The story is intoxicating from the first minute. The acting is immensely entertaining. The sets were exquisite. The directing was surgically executed. Like Batman Begins, the story is almost nonstop, even up to the very end when the sequel is teased. Except instead of the Joker, we learn that Professor Moriarty will be the next villain!",
      "total_reactions": 0,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "Holmes works out and is sort of American, and Watson is young and not fat? Gotcha. Better keep Guy Richie away from the franchises that actually hinge on obesity.",
      "total_reactions": 0,
      "user": "Bairdo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2010
      },
      "score": 7,
      "text": "this movie has been led to perfect performances from Robert Downey Jr and Jude Law.",
      "total_reactions": 0,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "Why this film is getting the bad reviews I've seen is beyond me. Great actors, great scenes, good direction and a pretty good story. What the hell is wrong with you people? /rant.",
      "total_reactions": 0,
      "user": "Flapjack"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2010
      },
      "score": 6,
      "text": "Ehhh, not nearly what I expected. I'm a huge fan of Robert Downey Jr. and an even bigger one of Guy Ritchie, so naturally when I heard this film was being made I got excited. Not at all lived up to the anticipation. Watch if you like, but you're not missing anything if you don't.",
      "total_reactions": 0,
      "user": "LondonTruelove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "The backdrop and music are fantastic, while the actors really seem spot on. There is a unique sense of style and all the actors fit well. Camerawork and effects are great, but not too overwelming. I enjoyed the interesting touch editing. Robert Downey Jr. delivers, as well does Jude Law, though I would love to see Mark Strong being a hero one day. My only complaint is that I figured everything out before the end.",
      "total_reactions": 0,
      "user": "Rumblebeelove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "Before thiz newest version, there are about 200 movies that brought Sherlock into wide-screen and more than 70 Actors played as thiz famous character. Sherlock Holmes is a well-known detective on Sir Arthur Conan Doyle novels (Which first time published on 1887). Sherlock on thiz movie is Robert -Iron Man- Downey Jr., Accompanied by his fellow side-kick Dr. John Watson (played by Jude Law). The Other Casts are Rachel McAdams and Mark Strong. Downey Jr. seem does not care how to perform Sherlock authentically, otherwise he just act with his style and just have fun on his version of Sherlock. As we knew, Sherlock is discreet, calm, and charismatic person. But in the end, I think viewers also agree to put beside the original Sherlock for a while, bcoz thiz version is enjoyable. In the overall, The movie was very good enough and very funny with a good fresh concept. The Director is Guy Ritchie. Ritchie known as Indie-Director, which is his best works are LOCK, STOCK, AND TWO SMOKING BARRELS (1998) and SNATCH (2000). The plots in thiz movie is excited on the beginning, a little lame on the middle of film, and closed with just customary ending. After watching thiz movie, maybe its cross on our mind, Downey Jr. on his version of Sherlock resembles with Will Smith performance on WILD WILD WEST (1999). But we must to admit that thiz movie have some plus poins compare with Smith WILD WILD WEST. Both of the movies show us a new style on the legendary figures. Here he comes, The Funky Sherlock!",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "The first time I saw this movie, I hadn't really read a lot of the Sherlock Holmes stories so I wasn't that familiar with the character. However, after becoming more familiar with the character, I really enjoy this movie. Thanks to some great performances, especially Robert Downey Jr., a script that is original while accurately recreating the characters, and some good humor, Sherlock Holmes is a movie worth seeing. A little cliche? Yes, but definitely good.",
      "total_reactions": 0,
      "user": "Moviebuffreview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "Ritchie puts his own spin on the Sherlock story making him much more of a street smart detective and more of a oddball to society than god like genius. The story is a little bit complicated and losses steam but the performance from Downey is great, Jude Law is good and really grounds the movie as Watson and even though the supporting cast is forgettable they are made up for with fantastic slow motion run through of how Sherlock will dispatch his enemies, which is great as normally in action movies they just beat the crap out of their enemies but in this Sherlock narrates how he will beat them up and gives us the various injures they will sustain. I is a decent film but not having a great story in a Sherlock Holmes film is kind of stupid.",
      "total_reactions": 0,
      "user": "codfather96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "I went to see this movie with a friend, and was expecting a great movie. Ultimately it didn't live up to the expectations of a Sherlock Holmes movie. However, it was extremely entertaining. I enjoyed the mixture of deduction and modern technology. The plot was interesting, but I was able to figure it out a good twenty minutes in. Overall, it was really entertaining, but would have been better if they made up a new character instead of Sherlock Holmes.",
      "total_reactions": 0,
      "user": "tman267"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2011
      },
      "score": 6,
      "text": "So I rented this one, expecting it to be like an old crime whodonnit thing - and was kinda surprised.  Never knew the Holmes / Watson combination were like Batman and Robin!?!",
      "total_reactions": 0,
      "user": "EmuChicken"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "Brilliant acting from Downey Jr raises this movie from middle of the road to a good film. Some good camera work adds to the fight scene although at times it feels a bit like a Victorian CSI episode.",
      "total_reactions": 0,
      "user": "rotku"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "This film has received much negative criticism from numerous sources. They say its too \"thuggish\", too \"brutish\" and that its a crude imitation of what sherlock holmes should be. Yet there is one thing niggling at me.",
      "total_reactions": 0,
      "user": "MrCinnamon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "I loved it. Great performances by the actors!",
      "total_reactions": 0,
      "user": "Solveig"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "I wouldn't call this a classic but a must watch for some action, suspense and thrill. Both Robert Downey Jr. and Jude Law portrayed their characters very well. I am waiting for the sequel !!",
      "total_reactions": 0,
      "user": "giri2706"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "Trop attachÃ© Ã  l'image qu'on lui donnait dans les films prÃ©cÃ©dents, il m'a Ã©tÃ© difficile d'accorder le moindre intÃ©rÃªt Ã  ce Sherlock Holmes version 2010. Et franchement, s'il n'avait pas quelques atouts en poche, je resterais sur ma dÃ©cision. A commencer par son allure de blockbuster et sa mise en scÃ¨ne (ralentis, certains cadrages) parfaitement inutile, sans parler de l'ambiance un brin agaÃ§ante (Hans Zimmer n'est pas le meilleur Ã  chaque fois). Mais je dois reconnaÃ®tre que l'ensemble est largement sauvÃ© par l'interprÃ©tation et par le scÃ©nario, vÃ©ritable enquÃªte policiÃ¨re qui rend le film divertissant et intrigant. Car voilÃ  les seuls qualificatifs que je donnerais pour juger ce Sherlock Holmes : un blockbuster plutÃ´t sympathique, mais pas aussi exceptionnel de ce qui se faisait entendre.",
      "total_reactions": 0,
      "user": "avatar16"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "There isn't much of a mystery in this movie, but Sherlock Holmes mostly benefits from Robert Downey Jr's performance, and his pairing with Jude Law as Watson. Mark Strong gives chills as Blackwood and for what seems like the first time in movie history, the love interest gets cuts and bruises! One of many ways the movie avoids cliches. The action is also very imaginative and brilliantly realized. It's not your grandpa's version of Sherlock, but it's a great popcorn flick nonetheless.",
      "total_reactions": 0,
      "user": "jos95"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2012
      },
      "score": 1,
      "text": "Absolutely terribly put together. I cant see how this is getting any good reviews at all. There is just too much wrong with it. The plots are weak. The story telling has holes and the pace is awkward at best. The fight scenes are laughable, not to mention pathetic for a period piece and clashes with everything Sherlock Holmes of books was about.",
      "total_reactions": 0,
      "user": "JonathanC"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "Since this is based on an inspiring part of historical literature, people have come at it with their all, and what I'm mostly hearing is that it has turned much into an action movie and that they were 'getting tired of people being beaten up'. What might have been missed is the intellect that was deduced by Holmes, and that people may more have noticed the significant amount of violence because of it being seen on screen, and you have to look closer in order to pick up the lesser significant and more unnoticed details. Sherlock Holmes may have had violence and explosions in it, but it showed Holmes as an experienced person that didn't just go around injuring people for the fun of it. He looked for clues, he came to conclusions, he used logic. Ritchie may have spiced up this new Holmes a little more than people expected, but it added to the fun of the movie. It didn't show him in a new light, it just showed us his capabilities and his strength for his environment. People might not have picked up on this, and the fact it might have been 'too complicated and boring' means that they probably weren't focusing on it as such to figure it out for themselves. You might have expected what was going to happen, seeing as it was based on a piece of famous literature, but Sherlock Holmes of course is opened to interpretation. Then why go in there and see it, not bother to focus on the finer details, at least enjoy the film, and beforehand think you're going to expect something completely different? It's confusing how people thought this film would happen, and how it was going to turn out. With all these production teams and crews designing and creating this imaginative piece of media, why think you're going to get a tame bunch of people solving mysteries without any spice like the book says?",
      "total_reactions": 0,
      "user": "EssenceOfSugar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "A good movie but nothing spectacular. The set was great and the story-line worked well. There is some funny moments in it as well, along with the serious scenes of the film. The actors played their parts well and the fighting and action scenes were choreographed well. Based in London a long time ago, Sherlock Holmes and his partner have to investigate a mystery where is seems someone has came back from the dead. It's a good movie and worth a watch.",
      "total_reactions": 0,
      "user": "MediaCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "Great movie. Great intriguing plot and amazing acting. If there is one thing that bothered me, it was the fact that most of Sherlock Holmes' wit took a backseat to the more favoured action sequences which are not staple of Holmes. The movie balanced action and wit pretty well. But I found myself at the edge of my seat much more this time, and it had a more intriguing plot. I liked it-",
      "total_reactions": 0,
      "user": "MadDad"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "SHERLOCK HOLMES is a funny, entertaining, well-acted and well-directed fresh new take on the famous Detective.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "This film sort of came out of the blue as an all-out action bonanza, a modern yet still classic tale on the eccentric detective, and I think Guy Ritchie has did an excellent job of bringing the character to life on the big screen, and leaves the opportunity for the audience to come along for the ride.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 9,
      "text": "I'm not all that familiar with Sherlock Holmes, and there was very little if any introduction to the character in the beginning of the film, but that's okay.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "Action, Adventure, Mystery, Thriller, Crime............The movie fully succeeds in achieving success in all these genres and also adds an element of humor........All in all,its TOTAL ENTERTAINMENT...!!!",
      "total_reactions": 0,
      "user": "AB77"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Ð",
      "total_reactions": 0,
      "user": "Rkypkz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "First off, this is probably a 9.25 out of 10. This movie is great. Action sequences are great. Story is really good. Acting good. RD Jr. Does a good job, and so does Jude law. Score is good to. Cameraing as it slows down and does the same thing is kind of cool, and kind of pointless. Overall, this is a great movie that you should watch. Recommend completely.",
      "total_reactions": 0,
      "user": "Juanolo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2012
      },
      "score": 6,
      "text": "The first half of Sherlock Holmes was boring, the second half was much better, and then the ending was just dumb. I'm not saying it was a bad film, it just wasn't Sherlock Holmes. The ending when Blackwood comes out of nowhere and pushes Sherlock's \"girlfriend\" off the bridge was so dumb that I really started laughing. It was just silly, but even this movie isn't great, it can still be mildly entertaining with some clever moments with Robert Downey Jr. and Jude Law.",
      "total_reactions": 0,
      "user": "Tall_But_Short"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "A fantastic performance from Robert Downey Jr., who was perfect to play Sherlock Holmes. We have an excellent cast, an intelligent story and script, and overall resembles a recommended film for all who enjoy mysteries.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "Robert Downey, Jr. as Sherlock Holmes; that's something worth watching. I loved his acting, obviously, because I am a huge Downey, Jr. fan. The plot involved more mystery and suspense, and that's the core fact I liked this film a lot. Guy Ritchie was able to deliver it properly. Well, to me, at least.",
      "total_reactions": 0,
      "user": "theahsanhaseeb"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "Overall, Sherlock Holmes is simply a very fun little film. Robert Downey Jr, Jude Law, Rachel McAdams, and Mark Strong, are all excellent and the case presented to Holmes is very compelling. I really like the explanation of what went down at the end, really was nice to see all of the elements of the film come together like that. The film was also really well shot and the story was told nicely, so kudos to the cinematographer and director Guy Ritchie for those things, respectively. The slowed down effect used on a couple of occasions was also incredibly cool and well down, though I don't really think those particular scenes were needed, but I certainly appreciated the craft  there. There are a few other elements I didn't really think this one needed, but overall, it was a very enjoyable and well made film that serves as good entertainment for two hours. Sure, it's no Citizen Kane, but not every film has to be.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "The film was fine but I genuinely think that it would have been better off without Rachel McAdams. Nothing against the lady but her character just seemed to be put in there to incorporate a female lead. The story itself is rather good and I thought that Jude Law in particular was great.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Featuring remarkably written characters and dialogue, Guy Ritchie's reimagining of the classic literary character proves to be one helluva fun ride.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "Sherlock Holmes is one of those immortal literary characters who boasts so many film adaptations under his belt that he needs no introduction beyond his name. Even if you've never read any of Sir Arthur Conan Doyle's classic mystery stories involving the British detective, you probably already know of his astounding observational powers, proclivity for cocaine in the absence of mental stimulation, and that he's    a master fighter? All right, so obviously, Robert Downey Jr.'s Holmes is taking some slight liberties in that arena, and overall the movie is certainly aiming to please the modern action audience with a tale inclusive of rather frenetic action sequences and quickly-paced mystery elements. Too quickly-paced, in my opinion. The film just seemed to go by a little too fast for me, and I never really got the sense of any real suspense or palpable conflict. In all honesty, this really felt more like a 2-hour promo for the sequel to get you primed for a battle against Holmes's equally immortal archnemesis, Moriarty. However, there is still some fair entertainment value to it all, and in the end I enjoyed it enough to want to check out the second film.",
      "total_reactions": 0,
      "user": "WriteFilmLive21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "I like this movie a lot, Jude Law and Robert Downey Jr. first together on the silver screen. Good Story and very good cast.One of the best movies of 2009.",
      "total_reactions": 0,
      "user": "Wiesy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "I give it a 6 because I genuinely enjoyed the movie, the actors and the scenarios; it's a good little unassuming action flick. On the other hand, I can't give more than 6 because it was advertised as Sherlock Holmes and it's not Holmes. To those people who didn't like the movie on account of it not being a Holmes film, erase the title from your mind and start thinking about the character as Johnny McAwesomeville, and you'll find yourselves enjoying it too; it worked for me.",
      "total_reactions": 0,
      "user": "Kern"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "this new adaptation of Sherlock Holmes is very well directed .",
      "total_reactions": 0,
      "user": "killian13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Robert Downey is brilliant. Love how people say this is nothing like Sherlock Holmes. Wonder if they know that in the books he was a Cocaine addict...  oh and to all the people who said it was too \"Grey\"...Never Ever Ever go to London, you'll hate it.",
      "total_reactions": 0,
      "user": "Cloudlv9"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "An interesting film that is interesting to follow and visually is beautiful. And the music is inspiring as well (Hans Zimmer does fantastic here, as usual)  However, the story is a bit hard to follow and Downey Jr. is a great actor and all, but at times I struggle to hear what he is saying.  The film has good action and a good ending, so overall I enjoyed the film.",
      "total_reactions": 0,
      "user": "DibbHansen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "Sherlock Holmes is an electrifying, high-caliber entertainment experience at the movies. Downey, Jr. is great as Holmes, and Law's Watson is just as good. The two have chemistry and dominate the screen. The slow motion and creative use of cinematography just adds to the experience. If you plan on watching this movie, just be ready to use your deductive skills, because this is one complex story to figure out.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "Sherlock Holmes detects moments of clever intrigue.",
      "total_reactions": 0,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "I love everything about this movie. The SLO-MO fight scenes, to Downey's humorous take on the classic character, this movie has it all. The story is amazing and so is the movie overall. This is definitely a good watch for anyone who enjoys a action comedy and a mystery, with a classical touch all packed in one!",
      "total_reactions": 0,
      "user": "mishabridun"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2016
      },
      "score": 10,
      "text": "**** You!!!!!!!!!!!! Peter Travers...........................................................................................................................................",
      "total_reactions": 0,
      "user": "Zanessa250QI"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "Sherlock Holmes is an interesting little boring movie , but , and more when in the presence of Mr. actor Robert Downey, Jr. , who put the character , a little sympathy and eccentricity.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "Ultimately, it achieves what it sets out to do: to entertain.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "WHAT I LIKED: This film shines out as a historic crime film thanks to it's character portrayals and quirky yet gritty style. Robert Downey Jr gives one of the best performances of his career, making the character his own and building one of the best portrayals of any character in a long time. Yet the entire cast are excellent, aided by some truly authentic, timely world building and a smart, witty script. Not to mention the brilliant action where Guy Ritchie's amazing cinematography and the scoring comes into play. This is one of those quirky films that just clicks.",
      "total_reactions": 0,
      "user": "BarneyOnMT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2016
      },
      "score": 9,
      "text": "Sherlock Holmes has come to the cinema, sharing his body with Robert Downley Jr. This completely unforgettable story is here, full of action, suspense, fantastic interpretations, Sherlock Holmes's fans will \"live for this film\", with a new enemy, new story and a great artistic direction.",
      "total_reactions": 0,
      "user": "Futuredirector"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2016
      },
      "score": 5,
      "text": "Meh. I don't care, and I don't think anyone in this movie cares. It is so depressing looking and acted. Sure Downey gives an okay performance, but nothing special. Expected a lot more.",
      "total_reactions": 0,
      "user": "AaronWasserman1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "Proof that Guy Richie can still make good films, though it's not without flaws.",
      "total_reactions": 0,
      "user": "avamiller21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2016
      },
      "score": 5,
      "text": "Sherlock Holmes is quite an entertaining movie but by no means a good one. The obvious fault is the script, it's all over the place, same thing with the cheesy villain, the movie is over long and many scenes could have easily been scrapped to resolve the pacing issues Sherlock Holmes has. As for Mr Holmes, Robert Downey Jr. portrays him beautifully however the character is ridiculous, how he is put in this film makes him look like an action hero, he fights, shoots, kicks runs, and everything an action hero would do. Sherlock Holmes is more of an action movie than a witty, mysterious, compelling thriller, what a Sherlock Holmes should be! Just look at the show Sherlock, they hit everything right on the head with how to portray a diverse character like Holmes perfectly. Aside from Holmes being an action hero, there is also a very Holmes-like trait missing in this flick. He is not funny, neither sarcastic nor cynical throughout the entire film! That's something what makes the show Sherlock so immaculate. It's bloody hilarious! Sherlock Holmes may get you to chuckle softly a couple of times but by no means is this movie hilarious (in a dark way) as it should be.",
      "total_reactions": 0,
      "user": "CalibMcBolts"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2017
      },
      "score": 1,
      "text": "Disappointed by the movie. Was expecting much much more. The movie could have been good but there were so many problems with the plots and the overall direction of the movie. The overall execution was terrible and it was a boring mess with not even half way through the movie.",
      "total_reactions": 0,
      "user": "fadithebeast"
    }
  ]
}