{
  "mc_avg_user_score": 6.4,
  "mc_metascore": 58,
  "mc_mixed_rating_frequency": 94,
  "mc_movie_name": "Shrek Forever After",
  "mc_negative_rating_frequency": 33,
  "mc_positive_rating_frequency": 141,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2011
      },
      "score": 2,
      "text": "If your clever enough to make sequels of a film youll now that repeating the same storyline of a film will drastically change the critic and users reviews but not that case with this film it was way overrated. what really pissed me off was that this film was so bad not just because the story line repeated itself but because it itself was not prepared long enough and not thought through enough i wasted my money and was fuming with rage when i left the cinema plesase do not watch",
      "total_reactions": 2,
      "user": "796712"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2015
      },
      "score": 7,
      "text": "One of the reasons this was so good was because it was so much better than the disastrous Shrek 3. Obviously, it's not as good as the series' first two entries, but, unlike it's predecessor, Shrek Forever After manages to retain the fun and wit of 1 and 2.",
      "total_reactions": 2,
      "user": "YellowKirby"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "This installment, the best after Shrek 2, is everything, especially the Shrek-Donkey relationship is exceptional.",
      "total_reactions": 1,
      "user": "bats"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "This installment in the 'Shrek' series still maintains the comic validity of the previous three, and has a few moments which set it apart from the others, but much of what was wrong with the third is still present in this one.",
      "total_reactions": 1,
      "user": "GavGav96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "Shrek Forever After was the movie that did not need to be made that being said ti was not all that bad. The voice acting was good, there were some decent jokes, the characters still had their charm, and the animation was still good. Plus, I kind of liked the villain and the Pied Piper. However, this film is still the weakest in the series. The plot feels forced and clearly an excuse for another Shrek movie. Did not feel sad when this one ended. Maybe if the film had more throwbacks to the previous films I'd care more but as the film is it is just ok. While Shrek Forever AFter was clearly a money grabber and no where near as good as the first to/three it still has some charm and will entertain Shrek fans.",
      "total_reactions": 1,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "While not good as Shrek 2, I really enjoyed this Shrek, even more than the first one. I really am glad they got rid of the Arthur character, since he was the weak point of Shrek 3.",
      "total_reactions": 1,
      "user": "gm101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "I watched this with my family and we all thought this movie was great. The funniest of all the Shrek movies and I genuinely enjoyed this movie. Good way to end a memorable series.",
      "total_reactions": 1,
      "user": "MichaelD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "The jokes at this point are forced and feel very plastic. The dialogue doesn't flow as it did in the first film.",
      "total_reactions": 1,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "It all felt like filler. It's like someone wrote a fanfic epilogue and Dreamworks decided to animate it. The gags weren't nearly as inventive as the first 3 and Shrek without fresh humor is well, hollow.",
      "total_reactions": 1,
      "user": "homer4president"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 4,
      "text": "\"Shrek Forever After\" has permanently changed a funny, pure franchise into a greedy one craving for money. Nice work, Dreamworks...",
      "total_reactions": 11,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2011
      },
      "score": 6,
      "text": "yeah it wasn't horrible.   it was a good way to say goodbye.    it was entertaining to me.  but its not shrek.  or shrek 2.    so yeah 6 out of 10 its a solid movie.   its watchable.",
      "total_reactions": 3,
      "user": "lovemusic"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "It wasn't as good of a finale as I hoped from Shrek, but it definitely showed us again why we loved Shrek so much by bringing back the heart and most of the charm and some great 3D and animation. I give this movie 80%.",
      "total_reactions": 8,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "While not good as Shrek 2, I really enjoyed this Shrek, even more than the first one. I really am glad they got rid of the Arthur character, since he was the weak point of Shrek 3.",
      "total_reactions": 2,
      "user": "paulgreen"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "shrek is love",
      "total_reactions": 7,
      "user": "pedronotfound"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2012
      },
      "score": 0,
      "text": "A horrible ending to a downhill series of Shrek movies. The film is not funny anymore unlike the previous movies. The whole story just pissed me off. I gave a 1, not a 0, because of its graphics. But still, it's definitely a terribly bad movie..............",
      "total_reactions": 4,
      "user": "aaronpaul121"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2010
      },
      "score": 2,
      "text": "Shrek Forever After is nothing like Happily Ever After for SUCKING! The story is completely mess,it has the same story,same issues,same plot holes,nothing make sense,the only difference is the new plot  is about the evil Rumpelstiltskin wants Shrek to took away everything and wants to rule the kingdom and it doesn't reveal anything from the forth one,they shouldn't been done since the last third one. THAT DOESN'T MAKE SENSE,WHY DID THEY SCREW UP EVERYTHING! The Rumpelstiltskin character is completely useless and he doesn't look like that I've just saw. Why does Shrek has to come back that way he is? I just don't het it? The scenes are just nothing like that and screws up everything even more. I just one another Shrek film could be next step or should be over right now,but NO they just want Shrek to screw up the franchise. So that's that,Shrek film is done and they said that they will make another Shrek film and I just thought that I will say that Shrek needs to retire the franchise and I feel that Shrek needs a break.",
      "total_reactions": 1,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2010
      },
      "score": 6,
      "text": "\"In my opinion this latest and hopefully FINAL! chapter it gets boring , and unfunny , its hardly worth anyone's time , the character we all know and love , has well lost its charm , but i love seeing all the characters back , and for that i say Rent It\" .. C+",
      "total_reactions": 1,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "Although I love animation, I've never been a fan of the Shrek franchise.  This movie took me by surprise.  The first Shrek movie was good (not great) thanks to Eddie Murphy, but Shrek 2 was awful.  I never saw the 3rd installment.  I've never liked the weird Irish accent for Shrek that Mike Myers provides.  It doesn't fit for me and I find it distracting.  Why is he Irish when nobody else is?  My friend talked me into going to see this one and it turned out to be a good animated movie - maybe even the best of the Shrek movies.  The script is WAY better than Shrek 2 and had some good laughs and good animation and it held my attention the entire way.  The 3D was good, not great, and probably not worth the extra cost, as 3D mutes the colors due to the dark glasses.",
      "total_reactions": 1,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "While it's not the best in this series it's a great way to say goodbye, some fans may be disappointed with the more serious story and the lack of humor (don't worry it's still got jokes just not as many) but I was surprisingly impressed, a good farewell to this series.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "Tasteless, devoid of any of Dreamwork's charm. The final film to what was once an entertaining and perfectly satirical franchise shows of how unoriginal and lackadaisical the writers are and how apathetic the producers are at entertaining the people, their job. This ended my taste for 'Shrek'. It should have been a trilogy. The third was already boring.",
      "total_reactions": 1,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2016
      },
      "score": 0,
      "text": "After watching a series of unforgettable movies with charming characters, music, story, and graphics, I would have never expected \"Shrek\" to be going downhill. The plot involves Shrek wishing he had never saved Fiona from the tower in the first movie (can't remember why), then this weird dude comes in an puts Shrek in a time period in which the events of the first movie didn't happen. He is then seeing what would've become Fiona, Donkey, and Puss in Boots. I can't remember what happened after that, but I do not intend to watch that junk again. All I remember saying after watching that was: \"Well that sucked!\". Shrek as a series is now as good as dead, thanks to this movie.",
      "total_reactions": 1,
      "user": "wariothelegend"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "It's not as clever as the first two installments in the franchise, but this newest Shrek doesn't feel like is was cranked out as fast as possible for a quick buck. It's witty and well-written.",
      "total_reactions": 0,
      "user": "aabender002"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 6,
      "text": "So it's not a wonderful life; so they lied. Lying awake at night, Shrek, a husband and father of triplets, undergoes an existential crisis, as Fiona sleeps soundly, oblivious to the paradox that vexes her domesticated spouse, who misses the ogre condition of alienation and veneration. The sheer awe that Shrek's size and stature commanded from the townsfolk, in hindsight, so he thinks, was adequate compensation for his lonely bachelor life in the swamp. The marital bed, suddenly a coffin instead of a haven, inspires Shrek to take out a \"Wanted\" poster, the highlight of his outlaw notoriety, from the dresser-drawer and affixes the ephemeralia to the mirror, creating a jarring disconnect with the ogre's reflected self. Shrek realizes that he's half an ogre; his resentment lies in incubation 'til the next day at the birthday party, where he reveals his true colors. In the 1947 Frank Capra classic that loosely informs \"Shrek Forever After\", George Bailey(Jimmy Stewart), the stabilizing force of Bedford Falls, matches the ogre's disenchantment with being a household patriarch, in the housewarming scene where Mary(Donna Reed) gives her wanderlust husband a knitted picture that reads: \"George lassos the moon.\" Like the lunar surface, Shrek can be his own man in the swamp, lonely, but away from the pressures of being a husband and father. In the Capra film, Mary doesn't realize the double-edged significance of the moon; she sees the sphere as merely a romantic object, and not an object of despair, the final outpost for George's wandering spirit. Like \"It's a Wonderful Life\", one wish made in haste and self-absorption transforms a town and its people for the worse. Rumplestilskin's rave hints at the noirish qualities of Pottersville, since a rave promotes bacchanalia and in this instance, a means of institutional control. The witches turn into good-time party girls as FarFarAway Land becomes a fertile ground for intolerance and nihilism.",
      "total_reactions": 0,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "A lot of the pop culture references are gone, and much of the charm in the world of Far Far Away. However you do not always need charm to make a good film. There is much more emotion (crying and yelling) in this film, and less comedy, but the strong moral message that is the heart of this film glows warmly, and so even if it can't produce the thrills of both 'Shrek' and 'Shrek 2', it is still a huge improvement on 'Shrek 3', and provides an emotionally satisfying and enjoyable conclusion to what is a classic animated series. I am glad that it finished on a good note, despite my low expectations.",
      "total_reactions": 0,
      "user": "Judddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "Shrek 4 was awesome! Definitely one of the most satisfying movies of the summer so far. Enjoyed it from beginning to end. And if it is the last Shrek movie, it serves the series proud. I'd proudly own Shrek and Shrek 4.",
      "total_reactions": 0,
      "user": "AaronM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "wasn't as good as the previous three movies, but its a perfect way to end one of the greatest animated trilogys of all time.",
      "total_reactions": 0,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "One of the best animation movie !!! A little bit complicated to understand for kids,but it's a great entertainment ! I had a very great time to watch it with my kids.",
      "total_reactions": 0,
      "user": "La2n1cE"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "What reason do you go to see Shrek? For me, I expect cheerful atmospheres all around, That simple. In thiz fourth installment of Shrek, everything becomes darker and gloomy. I think the key that made Shrek franchise succesfull all the time is Andrew Adamson. Adamson is The Director of two early ones, SHREK (2001) and SHREK 2 (2004). And he also contributes writing credit in SHREK THE THIRD (2007). Thiz time to continue thiz three years occasion without his involvement, Shrek was into nightmare. The directing was handed to Mike Mitchell. Mitchell known as Director of DEUCE BIGALOW: MALE GIGOLO (1999) and SKY HIGH (2005), which are not animation. The story tries to reset everything from the beginning. It tells Shrek (Mike Myers) travels to the past and faces the new alternate universe, which Princess Fiona (Cameron Diaz) is a warrior, Puss in Boots (Antonio Banderas) now is a fat lazy cat, and Donkey (Eddie Murphy) does not even know Shrek. All happened bcoz of Bad intentions from new villain named Rumpelstiltskin (Walt Dohrn) who wanted to rule Far Far Away Kingdom. Thiz character has not developed well. The funny scene was only when he eventually changed his silly wig. It was not comparable to Lord Farquaad character in the first one. I think all of movie critics will hardly appraise thiz sequel as a good one. If we see Shrek series in overall, it was already downhill since the first. The first Shrek was amazingly great, the second one was still impressive, and we thought SHREK THE THIRD was a real forever after. Thiz one, I described it as no-need extension. However, Shrek movies always fill with joyful soundtracks. If only they have fresh ideas for thiz franchise to continue, but if do not, just left behind thiz franchise for a while. They did not realize, they might have been killing thiz franchise forever after. One thing for sure, thiz one is really a Cat-tastrophe and ri-Donkey-lous.",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "Hm, nice movie, great animation and stunning sound. A bit slow for the moments but overall experience is pretty cool. So it was pleasure watching it though i hope this is the last part. Enough is enough:)",
      "total_reactions": 0,
      "user": "aryanrule"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "I have never really found any of these movies funny.  At least laugh out loud funny, I may have given a stilted â",
      "total_reactions": 0,
      "user": "heybuddymovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "After the \"by the numbers\" Shrek 2 and abysmal Shrek 3 I was really surprised by how good this film was. The writers were much braver with the plot and it really pays off with a strong villain and great cast. The \"alternative Fiona\" in particular is a much more interesting character than her boring dowdy counterpart.",
      "total_reactions": 0,
      "user": "DukeJon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "Since the protagonists are lacking imagination and the story has been crumbled movie after movie, Shrek should be thankful to the fact that he reached his forever after.",
      "total_reactions": 0,
      "user": "Potter17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "The new villain, Rumplestilskin, is what really helped make this Shrek better than it could have been. Shrek is tired of his life as a harmless ogre and wants to be like he was before he met his friends, so he makes a deal with Rumplestilskin and his life changes exactly like that, with a lot of dislike for this new life. Beware of a dissappointing ending that makes the Shrek series leave too soon. Other than the ending, I think you'll have reasons to enjoy Shrek Forever After.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "I think making four shrek films was too much, they should have left it at 3 at the most. After 3 films of meeting, falling in love, giving birth, baby troubles and parties, all viewers don't need another movie of more baby troubles and falling in love. What was the point of this movie? oh, I know! MONEY!! The makers were being greedy, thinking after two great movies and one o.k movie they could still drag another money making film out into cinemas. Bad decision, not a bad movie, but not a good one either!",
      "total_reactions": 0,
      "user": "HonestOmi08"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "Shrek, Shrek 2 and Shrek 3 were great. However, Shrek Forever after is starting to show franchise burnout. I don't blame them for making more movies after the first three highly successful ones, but this latest one was just not as funny as the others. Its hard to make multiple movies over a single good idea I think. Shrek Forever After was not a bad movie at all, but it just wasn't as funny as the first two, it was just mediocre.",
      "total_reactions": 0,
      "user": "Necromus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2014
      },
      "score": 5,
      "text": "It's... meh",
      "total_reactions": 0,
      "user": "Inlikeflynn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "Here is my question for Dreamworks..Why the hell did you make this movie? I mean seriously they could have just ended this great franchise at Shrek The Third. In my opinion I didn't think this film was necessary at all, it just told a random story. There were very little laughs and I felt like Shrek was the only character in the movie and the other ones didn't matter much. This movie was a complete bore and had little to no exciting parts whatsoever. Although I give Mike Myers a thumbs up on his usual good performance on Shrek, the other characters fell flat. The plot was really cookie cutter and has been used in many movies before. The villain (Rumplestilskin) was not a very good one and he was also featured in Shrek The Third, but looked different so why would they have to remake him instead. Oh yeah and I though in the third Shrek all the villains stopped fighting and chased their own dreams? I guess Dreamworks forgot about that. Overall this movie was pretty horrendous one this movie spit in the face of Shrek and tainted a great franchise.",
      "total_reactions": 0,
      "user": "dark_mater97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "I really tried liking this third sequel to the wonderful \"Shrek\" film, but overall left nothing to enjoy, and little to impress. \"Shrek Forever After\" deals with its tough issues of trying to challenge itself to bring any new concepts, but failing miserably. The film has of course the issues of large amounts of pop culture references, which are so overly done and feels just like a slight tweak from its past films. The story has little to no depth, and feels as if they tried influencing the elements from its past films into this third sequel, which in no means was successful. By adding similar elements from its past films, \"Shrek Forever After\" feels too familiar, and loses the charm and wit from the first two films by trying to add them in the fourth.",
      "total_reactions": 0,
      "user": "jeff_reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2016
      },
      "score": 7,
      "text": "Let's face it: the \"Shrek\" franchise has jumped the shark. After two fantastic entries, the third film was less-than-stellar, losing the charm that made its predecessors so amazing. Now, the fourth one trots along (to the chagrin of some filmgoers) and touts itself as the \"final\" film in the series (though, of course, the recent announcement from DreamWorks that \"Shrek 5\" is being developed and planned for release in 2019/2020 renders that point essentially moot). How does the series end off? Well, pretty well, all things considered. Let's get it out of the way now: \"Shrek Forever After\" definitely feels like a retread. It's not the most original story in the world, and that might contribute to the notion that the franchise has lost its way. That said, it's still wonderfully animated, considerably charming and humorous, and it features some great, entertaining characters, ranging from great returning characters to exciting new characters (such as Rumpelstiltskin). Sure, the \"Shrek\" franchise may have lost its way, and it's no longer the animated juggernaut that it was in the early 2000's, but overall, \"Shrek Forever After\" is a considerably entertaining romp that the whole family can enjoy.",
      "total_reactions": 0,
      "user": "FreedomFighters"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "Formulaic and partly familiar, \"Shrek Forever After\" only succeeds thanks to its humor, likable characters and a talented vocal. Slightly better than the third one.",
      "total_reactions": 0,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "Shrek Forever After has nothing on the first three installments of the series. I only have a few problems with this movie. I don't like the updated CGI. The original Shrek animation was so much better in the first few films and I don't like the idea to go with something different. It wasn't broke so they didn't need to fix it. I also thought that this franchise deserved a better ending than it got. Shrek isn't going to a get like Toy Story 3 but they could have still done a little better seeing as this is going to be the final film. Other than that I found the film fairly funny but after 4 movies you can't expect it to be as funny as the first 3. I'm glad I saw the conclusion of this franchise but if I want to watch a Shrek movie I'll stick with the first 2.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2014
      },
      "score": 8,
      "text": "E se encerra a franquia Shrek,que deixa saudades. Termina muito bem,com um bom desfecho,mas não tem tanto gás,e isso atrapalha um pouquinho. Shrek aprende a lição de sempre amar as pessoas ao seu redor,e assim termina dignamente.",
      "total_reactions": 0,
      "user": "f3l1p3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "Despite ripping off Its a Wonderful Life, it still manages to be way funnier, and way more interesting than the third movie because it doesn't drag on, isn't boring, and feels like they actually wrote something. Overall Forever After is just okay.",
      "total_reactions": 0,
      "user": "Delaforce828"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2015
      },
      "score": 5,
      "text": "Shrek 4 es mejor que Shrek 3, las bromas, los chistes y las situaciones son en algunos momentos pasables, pero continua con el mismo error que su antecesora, un intento absurdo y ridículo de \"película apta para niños pero con chistes exclusivos para los adultos\" ¿y saben que es lo peor? ¡Que no funciona! una innecesaria continuación (como la 3) y un final decepcionante para la franquicia, olvidemos a Shrek 3 y Shrek 4, imaginemos que nunca existieron. Shrek y Shrek 2 merecían algo mejor.",
      "total_reactions": 0,
      "user": "JohnMasterL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "So underrated. Maybe its only me, but I liked this one more than any other in the series,  and i cant see any better way to end the series than this one.",
      "total_reactions": 0,
      "user": "Alan_britoo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "Here I add the last movie of the Shrek saga. \"Shrek Forever After\" a fun movie , romance a little boring but the fact very good, hope to remind our favorite ogre and his friends.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "After the brilliant first instalment, the even better second instalment and the good but disappointing third instalment, Shrek is back for a good movie that's better than the third one but not as good as the first two. This time, Shrek has to get his life back when Rumpelstiltskin (the best villain in the series) tricks him into giving up the day he was born. The only way to do this is by sharing true love's kiss with Fiona but since she no longer recognises him, he has to make her fall in love with him again. I enjoyed the movie very much. It was funny to see how fat Puss has become without Shrek. He's still the best character!  I enjoyed the movie very much,  not as good as 1 and 2 but pretty good.",
      "total_reactions": 0,
      "user": "DanBurrito"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2016
      },
      "score": 7,
      "text": "Shrek Forever After may not being great as the first two Shrek movies, but i better that Shrek the Third. The characters are funny, the story is okay, the animation is nice, the comedy is good but what i really like the most is the drama and the emotional scenes. In this movie, you really feels bad for Shrek for lost all his friends and family that he has. Even that the message is too simple, it doesn't change the fact that it still being a good movie. Is not perfect but it doesn't need to be. I'm glad that the writers really follow the continuity of the first movie, and this defiantly is a check this out.",
      "total_reactions": 0,
      "user": "CriticFer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "You get this feeling to why Shrek has to end. You get this feeling that it deserved to end after what Shrek the Third done to the franchise. Thing is... it's a story that'll forever end Shrek.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2016
      },
      "score": 8,
      "text": "Shrek Forever After showed me one thing that I taught extincted in movies. To appreciate the little things in life, for once I take a look at them and say they were big things. After a terrible predecessor, Shrek and his friends delighted one last time in theaters. And I think this movie was such a memorable work from Dreamworks. If Toy Story 3 and How to Train Your Dragon hadn't released in 2010. This would have been the best animated movie of 2010. Nowadays movies should be like this, as touching, clever, hilarious and with heart.",
      "total_reactions": 0,
      "user": "DavidTejada"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "In the fourth and final chapter, the animated Shrek series recovers the sense of mischief it lost in Shrek the Third. Yes, it helps that this one is in 3-D – the real deal, not a retrofit – that makes the action pop. But it's the characters that pull us in when familiarity flatlines our interest.  The plot gimmick involves husband-and-father Shrek (voiced by Mike Myers with just the right blend of mirth and malaise) feeling frustrated that his days as a fear-inducing ogre are over. So he makes a deal with Rumpelstiltskin (an ingeniously nasty vocal turn from DreamWorks Animation story editor Walt Dohrn) that tricks him into an alternate universe where he doesn't know his wife, Fiona (Cameron Diaz), his friend Donkey (Eddie Murphy) or fat-cat Puss in Boots (Antonio Banderas). It's a fun ride. What's missing is the excitement of a new interpretation.",
      "total_reactions": 0,
      "user": "FilmMasterEd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "Shrek forever after is maybe the worst film of the Shrek saga, because of it's not-much-color, unremarkable characters and some kind of dull story-telling. But it's a bit funny, sweet plot and unpredictable story. Shrek's back anyway.",
      "total_reactions": 0,
      "user": "Futuredirector"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2016
      },
      "score": 2,
      "text": "It follows the same butchered storyline as its predecessor. No new ideas come to this movie. Plot holes everywhere. Everything that was wrong with the Third is present in this one. A disappointing conclusion to this franchise",
      "total_reactions": 0,
      "user": "superbat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2016
      },
      "score": 7,
      "text": "Shrek Forever After improved upon the third, but still doesn't reach the same level of quality as the first two. The story this time around is more intriguing, taking on a very dark tone that is cool to see but doesn't live up to iconic value of the first two.",
      "total_reactions": 0,
      "user": "MasterRiley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2017
      },
      "score": 0,
      "text": "This movie was an utter disappointment for me. The plots were not properly executed, there were many loopholes and the story was boring to be honest. The problem with these commercial films is that their whole purpose is to make money out of amateur movie goers rather than make something that should critically make sense.",
      "total_reactions": 0,
      "user": "ammeoo"
    }
  ]
}