{
  "mc_avg_user_score": 8.4,
  "mc_metascore": 63,
  "mc_mixed_rating_frequency": 89,
  "mc_movie_name": "Shutter Island",
  "mc_negative_rating_frequency": 58,
  "mc_positive_rating_frequency": 999,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "This movie is just plain GOOD. Simple. Let me also be the one to say that these other people who are giving bad reviews, well they mostly do not have a good IQ or any knowledge of psychology. These people were probably just hoping for a scary movie. Because after the trailer, I was expecting the same. But I still enjoyed the movie even though I didn't get scared at all (because it's not a scary movie) is because I am a college student with a good IQ and understand of psychology and how the brain works. I also know what psychologists do and how they used to treat patients in the old days (hence why the setting is 1954 and not now). You don't even need to KNOW anything about psychology to appreciate this movie. Just a simple curiosity of how the brain works is a good start. I love action movies and scary movies but I also like INTELLIGENT movies and that's what this is. Those of you who say you saw the twist coming, I say bullcrap. Maybe some of y'all did but the twist doesn't take place until there is like 20 or less minutes left in the movie and the whole first half doesn't leave any clues as to what is coming. If you are an intelligent person or a curious person to how we humans function and our mind works, this is a GREAT movie. Great acting and great plot. I love psychology or most of it atleast and like I said, I am a college student who enjoys intelligent movies and not just the ones where there is plenty of violence, comedy, and sex. So those of you who gave it bad reviews, I'm sorry I have to say it but y'all are probably just dumb kids or dumb people in general who don't have a clue how you even function as a human being. Watch the movie and tell me if I'm wrong.",
      "total_reactions": 3,
      "user": "clmtigers15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "Not Scorsese's best film, but it might be one of DiCaprio's best performances. It's a very good looking film and intense feeling to it all. The music does a really good job in setting a tone, **** work comes to mind. Leo lights up the screen as Teddy Daniels, a  US Marshall investigating the disappearance of a patient at this really sketchy hospital. I think multiple viewings of the film gives it justice.",
      "total_reactions": 2,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "Scorsese and DiCaprio were born to work together! Shutter Island is brutal and twisted, yet brilliant right down to the core. From the first shot of the film to the closing credits, error was nowhere to be found. The music encompased the element of fear and excitement, perfectly. The beautiful yet gritty cinematography left you on the edge of your seat for the next shot. The script was one of the best I have ever seen on screen, leaving you repeating the dialogue in your head from the previous conversation. DiCaprio knocked it out of the park with one of his best acting performances, not to mention everyone else in this movie did really good. The story is unpredictable and once the Scorsese credits hit the sliver screen you will still be questioning what you just saw. In my opinion, its one of the best films ever made. A must see!",
      "total_reactions": 2,
      "user": "B-RAX"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "This movies is the best Mind Blowing ONE.Love the way of how Leonardo DiCaprio took his acting to another level.Just LOVE IT !!!.Also the rest of them played very well....also the places used for all scenes are SUPERB",
      "total_reactions": 2,
      "user": "cristyx66x"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "A great film.  DiCaprio/Scorsese deliver again. Suspenseful and never dull. The ending is powerful. The score is an all time favorite of mine. This movie was so great, I read the book and I don't like reading too much.",
      "total_reactions": 2,
      "user": "TEM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "Very good film!  I absolutely did not see what was coming in the end.When the twist is revealed it all makes sense, the signs were there, yet the viewer's mind chooses to ignore it, just like the protagonist's mind, that's why it's a genius twist. Perfect ending!",
      "total_reactions": 1,
      "user": "FilmQueen"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "Martin Scorsese's \"Shutter Island\" is a thrilling entertainment thanks to great performances from Di Caprio and Kingsley, but the film falls short for its lasting appeal. Good movie overall, but stick with your \"American\" crime Scorsese.",
      "total_reactions": 14,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "I'll keep it short. This film is one of the best films I have seen recently. So intense, thrilling and it keeps you to the edge of your seat. From prologue to the epilogue it's so perfect. What can you expect more from a director of his caliber.!!!!!",
      "total_reactions": 13,
      "user": "Falling_Hammer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "One of the most beautiful movies that I have seen. Di Caprio is fantastic in his interpretation, and the plot is very interesting, since at the end...",
      "total_reactions": 6,
      "user": "god-amaterasu"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "It was great movie, filled with a spectacular cast with spotless perfomances, great production values and a beautiful visual style courtesy of director Martin Scorsese.  It has a slow pace, but the mystery of the plot is well worth the wait.  Not every will enjoy it, but that's the beauty of it.  It's an acquired taste.  And thankfully, the taste was delicious. A 9.25/10",
      "total_reactions": 3,
      "user": "Harbinger"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "Set in the 1950's, two interesting stories that unfold while DiCaprio giving an excellent performance on Shutter Island, which is a mental \"institution\" that has you questioning from the opening credits. Although the movie can get confusing, even though it's story is told really well. Director Martin Scorsese will take you on an epic mystery that you won't forget for a long, long time.",
      "total_reactions": 3,
      "user": "Film_Fanatic_15"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "The movie uses the knowledge of unethical experiments with mentally ill patients in Nazi Germany, as well as in the Americas during the 1940s, to form a conspiracy theory that will keep you guessing until the end.",
      "total_reactions": 3,
      "user": "juliankleiss"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "\"Shutter Island\" is not Scorsese's best, but it's hard not to be turned on by the brilliant visuals and great performances given within it. The entire film is, as Ebert points out, directed at your senses, and as the twists and turns of Shutter Island become more and more intense and noticeable, the tension grows higher and the stakes much larger. The ending isn't great, but it's done so well we barely care to challenge it. Simply a very entertaining and wellmade mystery flick that pays a lot of homages to the 1920's.",
      "total_reactions": 4,
      "user": "nboley08"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "MUCH better than I thought it would be. I was surprised that the professional critics weren't more on board with it. My favorite element was the music - so brooding, and so delicious. The visuals were also incredible.",
      "total_reactions": 2,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "I guess Leo and Scorsese are just too good together to stop making movies, and this one is no exception. Creepy at times, and it's amazing how elaborate the whole idea was in the end (obviously you have to watch to know).",
      "total_reactions": 2,
      "user": "dijavantewow"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "This movie is what made me a moviegoer. I love this movie, beginning to end, brilliant, and that twist, oh my god, did not see that coming. Creepy, intriguing, and Smart. I love it",
      "total_reactions": 2,
      "user": "MetalMan95"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2010
      },
      "score": 2,
      "text": "This movie had to be one of the worst films of the year.  The most disappointing of all is that it was put together by one of the greatest film directors and an A-list actor.  Please make sure you don't waste your time checking this film out!",
      "total_reactions": 9,
      "user": "Attmfk"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2010
      },
      "score": 4,
      "text": "(Ignore the review I had with a 10. Not sure why the page reverted back to that score)",
      "total_reactions": 7,
      "user": "BlackFalcon"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "If you were to say that this movie was a major twist, or it was DiCaprio's most frightening picture, I would say that they are spot on. A perfect, sensible ending that makes everything change completely to the way I thought it would've ended. With a wondrous mystery to solve, answered, ONLY if you pay attention. Now, I only sometimes give spoilers, but I will not, would not, could not, should not, give away any important feature to this movie. Yeah, a little long- 2:15 or so, but if you start this early, turn up that volume, and put on the closed captioning, and you're a fan of horror/ suspenseful movies, and Leonardo DiCaprio, I would recommend this movie to you.",
      "total_reactions": 4,
      "user": "CoDFather"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2010
      },
      "score": 3,
      "text": "Thoroughly unimpressed. From the opening scene with the poor attempt at realism via crappy CGI (the sea and sky were so fake), the one dimensional acting and predictable and unrealplot with that awful, awful music direction. Well, that killed it all for me. The fact that those parts are integral to the film means that of course I switched it off half way through (through one of those ridiculous dream sequences)",
      "total_reactions": 6,
      "user": "spackle"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2010
      },
      "score": 4,
      "text": "I saw it coming after about 20-30 minutes. So, I had to wait the entire movie to see the ending I already thought was going to happen. Totally lame...",
      "total_reactions": 6,
      "user": "dontcontractaid"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2010
      },
      "score": 3,
      "text": "I worked it out after 20 minutes and fell asleep 10 minutes to the end and had to rewind to find out it I was right. Scorsese got carried away with the wind machine and an over blown score. Can't believe most of the critics loved it.",
      "total_reactions": 6,
      "user": "Dirtypoatoes"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "\"The Departed\" it is not, but Martin Scorsese's 'Shutter Island' is a complex film that demands the viewer's utmost attention, and is all the more rewarding because of it.",
      "total_reactions": 1,
      "user": "aabender002"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2010
      },
      "score": 7,
      "text": "Federal Marshall investigates strange goings on at hospital on island, girl missing, girl returns, Marshall has visions & flashbacks, gets paranoid, weirdness.",
      "total_reactions": 1,
      "user": "ERG1008"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "The movie is amazing. Put together DiCaprio's perfect acting with Scorsese's incredible directing, and then throw in a breathtaking, intelligent, complex story and you have Shutter Island. One of the best movies this year, if not the very best.",
      "total_reactions": 2,
      "user": "Razv"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "The movie was too great, firstly i kinda got lost in the middle not to mention when all things got \"delusional\"  and it was mind twisting... The end sequence left me at \"aw\" it could have ended awesome, but anyway big-up 2 martin s.",
      "total_reactions": 2,
      "user": "GathGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2011
      },
      "score": 5,
      "text": "The plot had one too many twists in it. If you actually think about it, it makes no sense. If hes a dangerous mentally ill patient then why would they allow him to leave and then mak him board a ferry back to the hospital as the whole reason they had him there was because hes a dangerous and violent man. The directors probably think they made an intruiging twist in the plot but all they did was end up ruining the film. A shame as it could have been great had they not added the last twist.",
      "total_reactions": 1,
      "user": "Iqbal"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "The latest from Martin Scorsese is a twisted noir-thriller that constantly compels you to question everything it gives you and luckily it is filled with enough intrigue and suspense to keep you glued to your seat and guessing until the end. If there is one fault I can ascribe to \"Shutter Island\" it's over-drama, something that made some of the more serious scenes in the movie almost laughably melodramatic (and unfortunately much of the guilt inevitably falls on the overly-bombastic score).",
      "total_reactions": 1,
      "user": "ryancarroll88"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2011
      },
      "score": 1,
      "text": "There is so much goddamn talent wasted in this pice of **** It's incredible that all this went to **** There was good acting and good editing but that's all you can say about this heaping, steaming, and terrible **** ****",
      "total_reactions": 2,
      "user": "Justinavery7074"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2010
      },
      "score": 6,
      "text": "A fine film with Leo showing what a great actor he's become. I think the central plot in the story has been a bit overused and I won't go into detail because it would spoil the film but nonetheless it's well done and makes for a very enjoyable movie.",
      "total_reactions": 2,
      "user": "Tubie"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "What makes this movie so great is the fact that it allows the viewer to work out for themselves what is actually going to happen and with out me revealing too much the result at the end will make the viewer go WOW the line up of actors isn't too bad either . The movie however can only be watched once as once you know the ending the rest is just pointless. definately a rental though no doubt about it.",
      "total_reactions": 1,
      "user": "conorbobonor"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "Simply amazing. If you have read the book, you will see that the movie is a near-perfect replication, so fans of Lehane's work will love this. If you don't already know, the story is that of two U.S. Marshals, Teddy Daniels and Chuck Aule, as they head to the Ashecliff Hospital for the Mentally Insane to search for a prisoner who has vanished into thin air. Throughout the story, Daniels and Aule are warned and told to leave, and are told of highly-illegal, experimental surgeries that take place at the lighthouse on the island. After a devastating hurricane hits the island, more and more answers come and you'll be able to start piecing together the twisted story. But the twist ending will have you on the edge of your seat, as it will make you re-look at the entire story again to realize the real truth. This is truly one of DiCaprio's best works, as he captures the essence of Teddy Daniels and his rapidly-deteriorating state of mind. If you like mystery movies, are looking for a film with some action, or seek a flick with a good back-story to it, this movie is for you.",
      "total_reactions": 1,
      "user": "Frostbite"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "Amazing cinematography and inspired performances from DiCaprio and Ruffalo, but the film is a little uneven as a whole. I wanted to like it a lot more than I did, but I did think it was really interesting and certainly better than some of Scorsese's other recent films (\"The Aviator,\" \"Gangs of New York\") but a step down from \"The Departed.\"",
      "total_reactions": 1,
      "user": "Tony"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "Shutter Island is a Martin Scorsese reworking of a novel not many will be familiar with, which means the twists and turns will be all the more unexpected. Throughout the course of the film, we are left guessing as to what is actually going on, which characters are we supposed to trust, which ones are actually real and which one is going to ultimately reveal the truth. In fact, few would be able to guess at the convoluted ending the movie adopts, which makes it all the more enthralling to be taken along for the ride. Strong lead from DiCaprio and an excellent supporting cast including the likes of Sir Ben Kingsley, Max Von Sydow and, begrudgingly, rom-com fodder Mark Ruffalo make this a well thought out, well acted adaptation.",
      "total_reactions": 1,
      "user": "ReReview"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2010
      },
      "score": 7,
      "text": "very shocking and good movie. I really liked this movie. This movie looked really bored at the beginning. I wasn't going watch this movie until my friends told me it was a really good one. One of my fav movie of the year. This movie was very unexpected.  One of the best thriller I seen in a long time",
      "total_reactions": 1,
      "user": "iamtrent424"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "This mind bending storyline that makes you wonder, what the hell is going on?? That's the way to win the crowd in my mind. This movie had the jump factors and the eerie music to make people look behind then and turn the lights on while watching.",
      "total_reactions": 1,
      "user": "Ruler101"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "I predicted the big plot twist to this movie in the trailer months before its release. THE TRAILER. when the narrator says, \"you have to find the missing patient\" while a weak and disturbed looking Leonardo DiCaprio stares into a mirror looking as though to question his identity IT IS OVER. One of the most overrated films in the history of cinema. Leo has acted better before (but hes okay). Scorsese has directed better before (but hes okay) everything about this movie is completely average. except for the abysmal plot. By the end of the film I was saying lines before the actors were, to which the guy behind me said \"Stop spoiling it I haven't seen it yet\", to which I replied \"NEITHER HAVE I!!!\" recommended only to brainless mainstream leeches with no appreciation for creativity, originality, or storytelling.",
      "total_reactions": 1,
      "user": "Zorgly"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2012
      },
      "score": 4,
      "text": "This movie was going fine until it took a turn in the stupid direction. The twist was horrible. Why can't there ever be a semi reasonable mystery that didn't end with the person just being crazy. Weird, confusing, and just plain bad.",
      "total_reactions": 1,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 6,
      "text": "Not one of Scorcese's better films, but it will keep you entertained. The acting is solid, and the plot keeps you engaged for most of the film. The film could have used some serious editing since it really tends to drag in that second hour. The twist ending is decent, and open for interpretation. It's worth watching at least once, just don't go in with high expectations.",
      "total_reactions": 0,
      "user": "AJackson729"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "It was ok. You see the twist well before the film is even over with and it is a little dull at times but for the most part it was interesting to watch just to see where it was going. Solid performances by the cast as well.",
      "total_reactions": 0,
      "user": "asylumspadez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "It's a good movie.",
      "total_reactions": 0,
      "user": "TheGorilla"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "A very well made, suspenseful film that keeps you engaged up to the end. I've seen movies with twist endings similar to the one in \"Shutter Island,\" but the movie is so well made that I still didn't figure it out until the final reveal. Also has an excellent score.",
      "total_reactions": 0,
      "user": "DarkKnightV"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "Shutter Island is a mysterious and atmospheric horror-flick with a fantastic central performance from Leonardo DeCaprio. The finale is as emotional as things come and is truly unforgettable. Excellent stuff from Scorsese.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "SHUTTER ISLAND is a great vessel for Leonardo DiCaprio to explore his acting skill. It is quite a performance. Maybe It is not the finest, but I think thiz is one of his best performance so far. DiCaprio collaborates the fourth time with Martin Scorsese, the last three are: GANGS OF NEW YORK (2002), THE AVIATOR (2004), and THE DEPARTED (2006). Scorsese himself is a well-grounded drama Director. His previous memorable classics are: TAXI DRIVER (1976), RAGING BULL (1980), and GOODFELLAS (1990). It is about Teddy Daniels (DiCaprio), an US Marshall comes to the island to investigates some mysterious case. The Island is the prison facility for mental illness. Thiz movie supported by high-caliber Casts, such as: Ben Kingsley, Mark Rufallo, Mark Von Sydow, Jackie Earle Haley, plus Michelle Williams. The screenplay on thiz movie is grandeur. Scorsese with his experiences arranged every scene effectively. The exploration is classic, we even could seen **** atmosphere here. The movie scores also help a lot to build such an intensive tension. The great example was on the opening scene, when Daniels and his partner arrived on the island for the first time. When they observe the surroundings preserves by maximum securities, the gates open one by one. It is just a usual scene, but the scores multiply it into ten times thrill. The twist ending is meant to be shocking. But unfortunately, I already see it where the story will go in the middle of the movie. When a conversation between Daniels and Rachel (Patricia Clarkson) on the scene in the cave. Daniels said angrily, I am an US Marshall, No one can stop me! (Spoiler Alert!) That is the time I clearly knew he was the patient. In the end, if we got a movie that every scene put in for a reason. That is the time when you already got an effective and flawless movie. Scorsese scores again!",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "Impressive movie. It's been a while since I've simply sat after watching a movie and just had to think about all the events that occurred throughout. Attention to detail has me pleased but I find there are irrelevant scenes within the movie that honestly just drags out the movie to become slower and just aren't needed. Probably one of the most non-predictable movies I've seen for a while as well in large thanks to DiCaprio and Ruffalo's performances who had me thoroughly convinced. Perhaps the ending requires just a fraction more closure, but otherwise, a great movie.",
      "total_reactions": 0,
      "user": "hellenn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "There's no accounting for taste, of course, but, in my book Shutter Island is one of the best movies of  the last decade.  DiCaprio is sensational; deserved an Oscar nomination.  The rest of the cast, especially Kingsley, Ruffalo and Sydow, are magnificent.  Affects moviegoers, I'd think, in much the same way a Lynch or a **** or a Bunuel movie might.  Haunting, shattering, unique.  This is bravura moviemaking.  Don't believe the H8.",
      "total_reactions": 0,
      "user": "royalviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "When all is said and done in M.S. career I believe this will go down as one of his more daring ventures. And isn't that what art is about? New expression to ones self? I'm not saying this is a ground breaking film, just that it pushes the style of a vision. It just so happens that this vision is through the eyes of m.s..  The story is strong enough to compel you to the end of the journey. And the acting is more than satisfactory in all cases. The weakest portion of the entry is probably the dialogue. Some of the lesser characters just seem to deliver the line and exit stage left. Which don't help the film but don't necessarily hurt it either. In the end though it is the direction and attention to detail of not just the setting, pacing, acting, or genre but style brought to all of the above. Watch it again and again then tell me I'm wrong.",
      "total_reactions": 0,
      "user": "nairByduoG15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "Shutter Island is a captivating movie, with an great intensity and  shocking final twist. The cast and the acting are also superior, first off all Leonardo DiCaprios performance.",
      "total_reactions": 0,
      "user": "Caestus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "A very thrilling experience and superb acting makes this movie really worth a watch. The authenticity of this movie is really well done and it's one of the better movie adaptions. Definitely worth a watch!",
      "total_reactions": 0,
      "user": "ZiggyStardust"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "this movie is a masterpiece, is one of the few movies after \"fight club\" that made me thing afterwards. its not a movie for everyone, a lot of people search for something Entertaining and simple that they could watch with they`re family and sleep after that. this is a movie for people that like intense thrilling movies. if you just want to see a funny entertaining movie stay far away from this.",
      "total_reactions": 0,
      "user": "pdvsky"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2013
      },
      "score": 6,
      "text": "A predictable but nevertheless well-directed delusional thriller. The suspense could've been better and sometimes it was difficult to follow what was real and what was fake; but I guess that's a good thing because it keeps you guessing. It's not particularly scary or insanely intense, but is good nevertheless.",
      "total_reactions": 0,
      "user": "sinadoom"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "Shutter Island is a great film that will keep you enthralled. Leonardo Di Caprio gives a star-studded performance as always but the plot has so many twists and turns that it keeps you guessing as to what will happen next. The ending I did not see coming. Shutter Island is a thrill ride that does not fail to impress and I would recommend watching it.",
      "total_reactions": 0,
      "user": "Sachi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2016
      },
      "score": 6,
      "text": "I haven't seen this film since it came out, but I remember it being well directed, beautifully shot and featuring great performances from its cast. I should really re-watch it.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "I personally thought this movie was great. It had great performances and a very interesting, complex, intense and thought-provoking story. It's good that Martin Scorsese is branching out of his typical crime drama films and tapping more into movies of different genres. 4/4 stars.",
      "total_reactions": 0,
      "user": "marnee96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "This is one of the films which not everyone can understand. If you are one of those who can, then it is perfect for you. Not the ending , but looking after the main character is very interesting - how he evolves or degrades (up to you to decide).....",
      "total_reactions": 0,
      "user": "RediCe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "It's a nice change but also a concerning knock on the head when a film comes along and truly makes you question your entire beliefs and capabilities of an aspiring filmmaker, whether it be storytelling, editing or simply character development, all these factors are of upmost importance.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "It's a pretty solid film. Some of the scenes in it are absolutely beautifully shot in terms of color and atmosphere, and the film is tinged with a creepy surrealism that keeps you on your toes as a viewer. The hospital and island are really a dreadful place! DiCaprio is one of my favorite actors, Ben Kingsley is his usual awesome self... The plot left some people a little cold because I think they were expecting something else. Watch it for its surrealism if nothing else. Not many \"mainstream\" movies capture Creepy Wonderland like this one does.",
      "total_reactions": 0,
      "user": "Sevvy88"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "I Was skeptical going into it, but my skepticism soon fled me as I enjoyed every minute of this movie! It is a thriller for sure. The only thing that keeps it from being a 10/10 from me is that I saw the twist coming. Terrific film. Leonardo deserved an Oscar for this.",
      "total_reactions": 0,
      "user": "hipposeatfree"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "\"Is it better to live as a monster or to die as a good man?\" That is the last line in this mind bending thriller from Martin Scorsese. It perfectly describes this film, which I can honestly say is one of the smartest and most savvy films I have ever seen. Leonardo DiCaprio gives his best performance to date. I've seen a lot of DiCaprio, since Titanic, we all have, and this is by far the best he's ever been. How he didn't win an Academy Award for this role is beyond me! The story is very strong and very smart. It's evident that they took their time with this one, in order to get every detail right. The ending is of course the best part. It leaves you scratching your head, going over everything you've just seen and keeps you thinking for hours. No matter how many times you see this movie, you'll always pick up on something new, each and every time. It was an amazing movie and I can't recommend it enough!",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "Scorsese and DiCaprio’s fourth collaboration, SHUTTER ISLAND is an on-the-edge-of-the-seat nail-biter, a period thriller situates at the titular island near Boston in 1954, a patient mysteriously disappears from the mental hospital on the island, draws the investigation of US marshal Teddy Daniels (DiCaprio) and his subordinate Chuck Aule (Ruffalo). But on the sly Teddy volunteers the task under a more personal motivation, he is after a pyromania who is responsible for the killing of his wife Dolores (Williams).",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "If thrillers are your thing ,watching this is logical. Martin Scorsese directed this so this should be on your watch list anyway. DiCaprio plays U.S. Marshal Edward Daniels, and his performance delivers. The supporting cast also does a great job. The script play is amazing.It is a bit boring the first 40 minutes, but it gets really good.",
      "total_reactions": 0,
      "user": "AlvaradoKTA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "This film offers suspense, mystery and altogether an exasperating experience. DiCaprio's performance is among his greatest and Scorsese certainly delivers. The plot of this film offers an incredible twist that is comparable to that of Fight Club or Sixth Sense. Definitely worth watching!",
      "total_reactions": 0,
      "user": "KingGeorge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "While Shutter Island may be one of Scorsese's weaker efforts, DiCaprio along with Ben Kingsley are able to generate two exciting performances in a moderately thrilling atmosphere.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "Shutter Island is a complex movie. It has you thinking one way one minute and then other a second later. The second half was better than the first. It was intense and thrilling all at the same time.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "Shutter Island is an emotional juggernaut that is a long, winding and twisted road that leads to the aftertaste that tickles all the areas of your tongue. Martin Scorcese exhibits his directing mastery as he delivers a shockingly powerful film that is so thought-provoking, it will leave you dazed after hearing the last sentence that changes it all. DiCaprio delivers an incredulously electrifying performance - and coupled with the clashing chords of the score and the raw power of the conceptions portrayed, this film is an utter jaw-dropper.",
      "total_reactions": 0,
      "user": "anshiman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2012
      },
      "score": 1,
      "text": "With extremely loud non-sensical music, a very predictable plot, and some extremely seroous over-acting, this is the worst suspense fulm I have ever seen.  Everybody involed with this disaster needs to go back to film school.",
      "total_reactions": 0,
      "user": "GREW50ME"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "Weird movie that absolutely takes you through twists and turns throughout. Overall, it's an extremely thought provoking film and lives up to the billing of being a \"psychological thriller\".",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "This movie is wonderful and outstanding! The plot is overall great and intresting. I was glued to the screen most of the movie. It was so intense and thrilling... The tension and mystery that I think the movie created made me want to keep on watching. It's one of those mystery stories that you know from the beggining that there's going to be a twist at the end but you don't know what it is yet. I love it because it keeps you on the edge through the movie. As the movie near the end you already have a clue of what is going to happen but it still shocks you when you find out. The amazing performances from Di caprio and Kingsley also made this movie great. I loved how my feelings changed according to the main character feelings. The plot is through his prespective and what he was feeling created what I felt during the movie. When he was close to un cover the truth I was anxious and scared just like him. I highly recommand this movie.",
      "total_reactions": 0,
      "user": "Rhcploverxx833"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "I rather enjoyed this psychological thriller by none other than Martin Scorsese. Leonardo Di Caprio, Mark Ruffalo and Ben Kingsly are fantastic throughout and upon repeat viewings, the audience will notice that the perspective of the film changes. It is a highly intelligent, well prepared film that deserves the highest of accolades.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "It fails as a thriller, but is an excellent psycho drama. Every single actor is awesome and Scorsese's director work is also outstanding. Some dialogues were a bit too misleading and in the end not every detail gets elucitated. But still, 'Shutter Island' is a very interesting motion picture that doesn't get boring anywhere.",
      "total_reactions": 0,
      "user": "axelkoch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "Scorsese and DiCaprio, in their fourth film together, again create an intense, provocative film-going experience, where the ride, accommodations, and destination are all first class.",
      "total_reactions": 0,
      "user": "barnet42"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "This film is awesome! I love Leonardo Di Caprio! and this is deffo his best movie! One of my favorite movies of all time and great twist at the end. !!!",
      "total_reactions": 0,
      "user": "ReaIistiC"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Scorsese evokes black magic in the mind-rattling and unforgettable Shutter Island, a film filled to the brim with dark wonder and secrets buried many layers deep. You will want to see it again immediately after your first viewing.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "Scorsese churns out a very uncharacteristic film with \"Shutter Island,\" a fantastically designed and performed film that drips with dread and demonstrates supreme editing prowess.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "Pretty good. I enjoyed it a lot, but I think it's very overrated. It had some very good, thrilling moments, but overall it was predictable. I had the ending figured out after the first 90 minutes. Some people will try to squeeze this movie into \"The Best of 2010\" category, but for me it just doesn't deliver. Good but not what I was expecting!",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "That Shutter island is carried by Leonardo DiCaprio took me a bit by surprise for I never took him as an strong actor. Not because I think him bad, mind you, just that I wouldn't have named him as one of the great actors of our time. I was wrong to think that.",
      "total_reactions": 0,
      "user": "MeritCoba"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Fantastic movie. No, it´s not very original and yes, by the middle of the film you expect what´s coming more or less. But the gorgeous use of visuals, that atmosphere and the captivating performances compensate it. Leonardo Dicaprio gives us what I think is one of his two best performances in a film along with Clint Eastwood´s \"J. Edgar\". He is truly phenomenal in all the last part. My very favorite scene is the one in which Leo talks with a man in a cell. You guys will know when you watch. That was so intense. All the cast is great. 7 seems low to me but I can´t rate 7.5 on here so I´ll give it an 8",
      "total_reactions": 0,
      "user": "sanyrub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "An infuriating movie.  One which uses expert direction to tell a story with no solid ground.  It's weird and twisty and atmospheric but never in any way which is remotely good.  It will keep you guessing, sure, but it pulls such a non-ending, such a copout that you could never really be sure to what exactly just happened.  Other movies have pulled off the ambiguous ending without it becoming a copout, but this one doesn't know how.  Inception did it.  In fact it did it in a way which was significant and beautiful, but Shutter Island is just a loopy trip into insanity which goes nowhere truly scary but everywhere and anywhere disturbing just to put a bad taste in your mouth when it's over.  Do yourself a favor and avoid this expensive piece of garbage.",
      "total_reactions": 0,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "\"Which would be worse - to live as a monster? Or to die as a good man?\" Teddy Daniels.",
      "total_reactions": 0,
      "user": "Marica"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "\"Shutter Island\" combines an interresting story with mindbending moments, but its regular dull acting, failed moments of horror and overly dramatic soundtrack keep it from becoming the masterpiece it should have been.",
      "total_reactions": 0,
      "user": "Duskspark"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "A movie that starts off good, giving the viewer a sense of dread and terror. Once the movie has got a hold of you, it doesn't let go... UNTIL the second part. I'm sorry to say that it just drags throughout the second part of the movie and I personally lost all interest in the movie. But since the first part of Shutter Island is great and the fact that the actors all contribute with solid acting, it's still a movie worth watching.",
      "total_reactions": 0,
      "user": "adamSv94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Literally, mind blowing masterpiece! Everybody who gave this movie a bad score, should watch it again, because i bet they didn't get it. Incredible story, superb acting and unpredictable ending leads me to the final 10/10 score!",
      "total_reactions": 0,
      "user": "SEROJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "i love this film. its one of those films you can watch over and over and you'll not get bored of it, you will also find new things every time as well. there are a few continuity errors, but whatever. its a shame this film fell under the success of inception in its genre, because its a modern classic. everyone fulfills their role perfectly and contribute to the atmosphere that scorsese aimed to create. the end leaves you questioning what happened next, and whether  you understood i properly, like TDKR. This film keeps you interested all the way through, the ending is hinted at, but its not obvious. splendid film!",
      "total_reactions": 0,
      "user": "AndJustice4U"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "A nearly perfect movie.Everyone who says its bad is not stupid but  has possibly not understand it.",
      "total_reactions": 0,
      "user": "JonLabudakis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "if you dont score this movie more than a 9 either you dont get it or you dont know good movies this movie has the best twist ever and the ending you better 2nd think that when you watch the movie that means to watch the movie right now because you will be like wow i need to watch that again like i was and now i have watched it like 7 times and im still thinking about the ending you get it when you watch it",
      "total_reactions": 0,
      "user": "MrThehammer171"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "This film sees a different side of Martin Scorsese with this suspenseful and eerie thriller. The way in which DiCaprio's character's emotions change throughout this film is totally unexpected. It may not be Scorsese's best film and the ending could disappoint, but an all-round great!",
      "total_reactions": 0,
      "user": "SamSk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "A well done creepy thriller of 2 U.S. Marshals investigating an escaped patient on a mental aslyum island, full of twists and turns and suspense, well done.",
      "total_reactions": 0,
      "user": "Bradyboy12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Shutter Island grows creepier and creepier as the movie progresses and by the end, when the entire movie's purpose is revealed, your left to wonder how all these events unfolded, and now you're just as dumbfounded and in denial as DiCaprio's character is. Scorcese is just a pure genius of filmmaking.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "for me this is the worst movie made by martin scorsese and possibly the unic not good movie made by him  it was an terrible disapointment  for me see this.",
      "total_reactions": 0,
      "user": "joao1198pedro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "The acting is brilliant and the mystery is brilliantly constructed and shrouded in a plot so full of secrecy and red herrings despite some scenes being choppily edited. Multiple viewings are required for this movie.",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "What was all the fuss about? The story was perfectly understandable. And yes movie was really good, a very well crafted mystery. I hope they make more movies like this",
      "total_reactions": 0,
      "user": "S2G047"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "Scorsese creates a great mystery in cinema based on the novel that will not only keep you watching, but thinking as well. Thinking a lot. Enough that you must watch it until the end to understand it all.",
      "total_reactions": 0,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "Shutter island is definitely not one of the best Scorses's movies.There is an interesting story and good actors but the result is not as good as i wanted.The acting was excellent but sometimes we lose ourself in the story.Shutter island is a weird movie starring a good cast and good story but Scorsese",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "The acting is brilliant and the mystery is brilliantly constructed and shrouded in a plot so full of secrecy and red herrings despite some scenes being choppily edited. Multiple viewings are required for this movie.",
      "total_reactions": 0,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2015
      },
      "score": 9,
      "text": "One of the best performances, story and movie    .",
      "total_reactions": 0,
      "user": "Marick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "Shutter island is a Martin Scorsese film, so ambiguously it is enjoyable. This movie is filled with interesting plot twists and strong characters. It is clever, but can be confusing at times. The casting is good, it stars people such as Leonardo di caprio and Ben Kingsley. I would not recommend this for younger ages as it can be rude, with adult themes; also children might not understand it because as I said it can be confusing. Overall it is a good watch.",
      "total_reactions": 0,
      "user": "Shedegg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "What a great and extraordinary and thrilling film from a director at the top of his game. I absolutely was on the edge of my seat with this movie. Captivating performance from Leonardo DiCaprio and also Ben Kingsley. I highly recommend this movie. Watch it!!!!",
      "total_reactions": 0,
      "user": "jacobshoff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "this is one of the most stupid movies that I ever seen. It's my opinion, but the story behind that cliches are so poor. What can I say... Martin Scorsese... I can never like his movies.",
      "total_reactions": 0,
      "user": "soloms"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Scary and nail bitingly tense, shutter island provides the audience with all this. Leonardo de Caprio plays the   US Marshall with past troubles and a shattered psyche perfectly. The perfect  film for any horror and thriller fan.",
      "total_reactions": 0,
      "user": "DANIELW45"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2016
      },
      "score": 9,
      "text": "Every detail of the production design is on point for maximum dread and psychic confusion.",
      "total_reactions": 0,
      "user": "avamiller21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2016
      },
      "score": 9,
      "text": "A complex plot presented in dark, brooding style. It holds your attention, draws you in and then leaves you thinking about it. It's like plain chocoalte and chili: richly textured and surprisingly good. I will return to Shutter Island before too long.",
      "total_reactions": 0,
      "user": "shiftworker"
    }
  ]
}