{
  "mc_avg_user_score": 5.0,
  "mc_metascore": 16,
  "mc_mixed_rating_frequency": 88,
  "mc_movie_name": "Silent Hill: Revelation 3D",
  "mc_negative_rating_frequency": 146,
  "mc_positive_rating_frequency": 134,
  "mc_pro_critic_reviews": [
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 40,
      "summary": "The first film was imperfect but solid as game-adaps go and fans revelled in its clammy shocks. No such luck this time out. Director Bassett oversees a vaporous horror sequel that rarely raises the pulse."
    },
    {
      "critic": "Calum Marsh",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 38,
      "summary": "Silent Hill: Revelation fundamentally misunderstands the appeal its source material."
    },
    {
      "critic": "Keith Staskiewicz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 33,
      "summary": "Some horror movies want to scare you witless, but Silent Hill: Revelation 3D just wants to beat you senseless."
    },
    {
      "critic": "Matt Donato",
      "publication": "We Got This Covered",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2017
      },
      "score": 30,
      "summary": "It's a shame Silent Hill: Revelation suffers the same doomed fate as most modern horror movies, bumbling through a shockingly disconnected screenplay which strings together moments that could have been salvaged otherwise."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 30,
      "summary": "There is a flamboyance to some of the imagery - Heather and her demonic doppelganger embrace on a flaming carousel - but no exuberance, no sense of wonder, fascination or enjoyment. Everything feels like a throwaway."
    },
    {
      "critic": "Andy Webster",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 30,
      "summary": "The film is nothing if not liberal with its bloodletting, which integrates cleverly at times with the 3-D: lopped fingers, for example, fly toward the audience. But personalities and plot are thumbnail sketches at best."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 30,
      "summary": "Silent Hill is not a place you want to go, and that applies for moviegoers as well as this videogame adaptation's characters."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 25,
      "summary": "Stiff, episodic, and disjointed, Silent Hill: Revelation 3D replicates its source material all too faithfully."
    },
    {
      "critic": "George Bass",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 20,
      "summary": "The nurse-monsters look cool - think HR Giger in Ann Summers kit - but the plot and burning fairgrounds are so OTT they dispel any chill factor."
    },
    {
      "critic": "Dennis Harvey",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 20,
      "summary": "A cheaper, cheesier sequel that's worse than its predecessor on every level (save being a half-hour shorter) and takes no special advantage of the stereoscopic process."
    },
    {
      "critic": "David Ehrlich",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "summary": "Silent Hill: Revelation 3D is the nadir of senseless seasonal cinema. But while Bassett's film struggles to say anything coherently, it gets the most important message across perfectly well: \"Do not go to Silent Hill!\""
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2012
      },
      "score": 0,
      "summary": "A knockoff in everything from style to story, it also suffers from 3-D effects that are dim and underwhelming, a maddeningly obtuse storyline, and performances that could have used some serious Herbert West-style reanimation."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 0,
      "summary": "One step worse than most of these video game movies. It feels less like a game and more like what happens when you leave your PlayStation on and it becomes a kind of dim screensaver. If we had a controller in our hand, we would probably throw it at the screen."
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 0,
      "summary": "With horror altogether absent and a plot drowning in insipid convolutions, it's a film whose early warning to Heather should be heeded: \"Don't go to Silent Hill.\""
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 8,
      "pos_reactions": 23,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "Not the scariest movie I've ever seen but this film is actually quite faithful both to the plot of the first movie and the third game in the series. I know I'm in the minority here, but I actually really enjoyed the first movie and felt like this sequel did a good job of establishing a strong link between that film and the game series. I will admit that there were a few instances of nonsensical plot and / or writing but I felt that overall, this was a worthy entry in the series with great atmosphere and great acting to boot. Don't believe all the garbage reviews in the press. I doubt most of those critics are even aware of the game series this movie is based on.",
      "total_reactions": 31,
      "user": "Andoloo"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 17,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "First off, I am a huge fan of the Silent Hill games and was NOT a fan of the first Silent Hill movie. This film was an outstanding homage to the game. Not ADAPTION. HOMAGE. The monsters were beautiful. The 3d was fantastic. And all the key points from the game came across very well. My favorite part was how they intertwined the First film perfectly and still kept the film true to silent hill 3. I.e. Happy Burger, the mall, theme park etc. The only negatives for me were the portrayals of Vincent and Douglas. Vincent was too Good as opposed to the game. And Douglas was simply cut down to a minor character. Also I understand alot of fans will be angry because of Pyramid Head being in the film, but they need to understand, PYRAMID HEAD WASNT A MANIFESTATION OF JAMES SUNDERLANDS FEARS, THE CREATOR SAID THAT HIMSELF. That all being said I give Silent Hill Revelation 3d a 9 out of 10 FOR TRUE FANS OF THE SERIES",
      "total_reactions": 25,
      "user": "mavizzle"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 15,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "WHAT IN THE EVERLASTING F**K IS WRONG WITH THESE CRITICS?!?!?! I love the first film to this day, it remains one of my favorite films, and in my opinion, the best game adaptation... until now, revelation has now booted it's ass off the perch, fans of the series will LOVE the level of faithfulness to the third game, Adelaide Clemens was born to play Heather, the set pieces are stylish, surreal and sometimes quite creepy, they managed to tie up most of the loose ends from the first film, and pyramid head gets a fully-fledged fight scene, the 3D is used phenomenally, the effects are amazing considering a crappy budget of 20 million, the mannequin monster was the creepiest scene in the latter half of the movie, but it isn't without some flaws, Kit Harrington is annoying and d**kish most of the time, pyramid head, while he literally kicks ass, doesn't get used enough, which is half of what takes it down a peg because he's on almost every poster for the film... i hope to god a director's cut solves this, the problem with such a phenomenal beginning is that the ending doesn't measure up, without spoiling anything, they pretty much say \"LOL, SEQUEL MOTHERF**KER\" which is a bit cheap considering what they chose to imply as their next source materiel, overall, this is almost, ALMOST as good as the first film, one small step for man, one giant leap for video-game films - samarathenymph xoxo",
      "total_reactions": 23,
      "user": "samarathenymph"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 16,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "I honestly enjoyed this film. Yes, call me \"flavorless\" in actual great films but in the end I bought Silent Hill: revelation 3D was actually pretty good. As a person who is oblivious to most of the actual Silent Hill game lore, understanding this film after watching the first wasn't really hard. Of course their are some plot holes that make you wonder if the writer was writing a script or a jumbled mess on paper but the major selling point for this film is obviously for the fan service and this film really delivers. The monster effects mixed in with the 3D effects will blow you away and certain scenes will leave you amazed and thirsting for more. Unfortunately, the real killing blow of the movie is it's length. After a few friends of mine left the theater for about 15 minutes, they missed almost 50% of the action. In the end, you will still be leaving satisfied and craving a sequel. Not really though.",
      "total_reactions": 27,
      "user": "TravisFinn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "Any true fan of the Silent Hill games will be greatly disappointed by this. It breaks the canon not only from the games but from the first film. The only character done nearly right is Heather, and even then she's still wrong. Don't even get me started on the fact Pyramid Head doesn't belong and how they portrayed Vincent...it wasn't scary, it wasn't faithful to the games, it was just a pure mess all around.",
      "total_reactions": 3,
      "user": "Nostalgic9tails"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "Silent Hill Revelation 3D will absolutely please the fans of Silent Hill but I doubt that it will please the common movie reviewers or critics. I am a big fan of Silent Hill and I am addicted to the first Silent Hill and the video games. As a movie it is not near perfect. First of all, the script is awful and senseless, it is far away from the script and the eerie talking of Silent Hill, as for the story, it is explained more than the first, it doesn't leave anything to the imagination of the viewer, and that's make Silent Hill Revelation forgettable, the direction is really bad, because there is no actual tension during the climax, which makes us miss Christopher Gans' direction. The visuals are good but you can see and notice that Pyramid head's costume is rushed, and a proof is the trivia on IMDB. As for a movie, it is not that scary, and it is definitely not that good, sometimes it is boring and dull, but mostly, entertaining and fun. The 3D is really good, and I give them the credit for that.",
      "total_reactions": 2,
      "user": "MovieGoer14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "Three words. What. The EFF!? (metacritic sensors *shakes head). I'm so glad I didn't spend money going to see this in theaters. I thought the trailers looked more like a parody of silent hill, but upon seeing the movie it's even WORSE than I thought it would be. Not only does it completely massacre the content it's supposed to be paying tribute to, the movie is one of the worst I've ever seen in my entire life. The acting is terrible, script is phoned in, special effects are mediocre at best. It's not even remotely scary or suspenseful. The characters' roles are all rearranged, some characters who were important in the game were killed off within 5 minutes of first seeing them, with no lasting impact on the viewer whatsoever. Fan service was shoehorned in all over the place and with the exception of one moment toward the end, it always felt out of place. I seriously felt like I was watching a really bad fan fiction come to life. Probably the most common defense I see of this movie is that a movie adaptation can't hit all the exact plot points of what it's based on, or it wouldn't be interesting to people who've played the game already. That's true in some cases but definitely not this one. The reason people complain about the plot changes is because they don't add any new dynamics to the story, they just water it down and strip any meaning they once had or any purpose they served. The result is a mess of a bunch of different things that don't make sense together, and whatever does make sense turned out pretty damn insipid. Evil clowns eating flesh burgers? OOOH so thought provoking, I wonder what it represents. GAD... DAMMAT. No movie in history has pissed me off this badly. An absolute shame.",
      "total_reactions": 1,
      "user": "Subject98"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2013
      },
      "score": 3,
      "text": "I like the early game franchise, and actually really enjoyed the first movie.  This one, however, just has nothing going for it.  It moves away from the Silent Hill feel, for more of a standard Hollywood movie, and somewhere in the transition completely falls apart.  The plot is of very low quality, and the acting is mediocre.",
      "total_reactions": 1,
      "user": "stitchmouth"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2013
      },
      "score": 2,
      "text": "This was terrible. Really terrible. I have no idea what the director/screenwriters did the the cast to make them act so terribly, but whatever it was it must have been worse than any of the horrors in the film. The acting was just so, so utterly terrible  especially from a pretty decent cast (Sean Bean for instance!)  that I just can't wrap my head around it. That combined with a terrible script (although, it does stay pretty true to the game...) really destroys any dramatic element to the film.",
      "total_reactions": 1,
      "user": "Retropunch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "3D sequel to the 2006 horror film based on the popular survival horror video game of the same name. It was written and directed by Michael J. Bassett and is based on the 'Silent Hill 3' video game. The film centers on the heroine's daughter from the first film, Sharon, who's now a young teen and lives with her father while constantly on the run from a ruthless cult. The cult wants Sharon back in the nightmarish alternate dimension world of 'Silent Hill', where her mother is still trapped. Radha Mitchell, who starred in the first film, only has a cameo in this chapter. Sean Bean and Deborah Kara Unger also reprise their roles from the first movie. They're joined by Adelaide Clemens, Kit Harington, Carrie-Ann Moss, Martin Donovan and Malcolm McDowell. Horror fans are sure to be pleased with this installment as well as fans of the video games (I've heard). I haven't played the games but being just a fan of artistic imaginative horror I thought it was quite an achievement.",
      "total_reactions": 1,
      "user": "KaneHa"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "I am unsure like most of the reviews on here how this movie is getting such bad reviews! After waiting 6 years for this movie to come out I was not disappointed. The movie stayed very true to the game itself and the girl who played Heather looked amazingly similar to the character in the game. I felt the acting was real and believable aside from the fact that she hardly seemed scared at all where as I would have been peeing myself! Even if you have never played the games before the movie is still a solid 6 or 7 out of 10 but the way it stayed true to the story I was looking forward to seeing unfold was just awesome. Honestly I think the reason that it did so badly was because I had no idea the movie was even coming out because I never seen a preview on TV or in the theatres, and the movie opened on the weekend that everyone is out celebrating Halloween. Lets face it... Video Game fans most definitely take advantage of the Halloween holiday! I think you should see the movie and decide for yourself. It definitely could have been longer because it did feel a tiny bit rushed but I loved it and I really hope that we get another installation to this film! I am SOOO over Resident Evil...",
      "total_reactions": 1,
      "user": "CatKute"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "This review may contain spoilers ***",
      "total_reactions": 1,
      "user": "InvasionMolly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "Awful. All I have to say is awful. \"What do you expect Voice, a good video game to movie adaptation?\" No, I expect a rather decent one or one that is at least watchable. I am glad that I brought my girlfriend at the time or else I would be clawing my eyes out hoping that Pyramid Head would rip me in half. I enjoyed the first silent hill movie because it was unique in the sense that it looked like someone was playing a video game. This piece of trash totally took that out and went their own path. The first one is probably the best video game to movie I have ever seen. This one was garbage. It deserves nothing higher than a 0. There were no scary parts nor were there any parts that made the movie redeemable. All the things that it was going to do, it didn't do. I was wanting a god boss battle. What do I get instead? Pyramid Head being a protagonist and killing the things that worship him. 0/10",
      "total_reactions": 1,
      "user": "Voice0fReason"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "This Movie is so bad I could barely finish Hollywood has to stop with making these awful video game adaptions stop butchering game franchises hollywood",
      "total_reactions": 1,
      "user": "Batman97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "I'm honestly surprised and saddened at how many users gave this a positive review. The movie was riddled with awful plot twists, some of the worst effects I've ever seen, and moments that seemed entirely pointless. The worst part is probably the ending where they spot light the horrible effects and at the climax of it all they throw away everything you watched by acting as if it were no big deal. The only thing I can imagine being worse than this is the sequel. *shivers* Hopefully that day never comes.",
      "total_reactions": 1,
      "user": "mookid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 1,
      "text": "\"Silent Hill: Revelation\" 10 Scale Rating: 1.5 (Terrible) ...",
      "total_reactions": 1,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 2,
      "text": "I'm not a fan of these types of movies although the first one wasn't too bad, which i did happen to like much more than this abysmal sequel. I want to say that this movie was rushed but that just doesn't make sense considering the first entry came out 6 years ago. The plot had quite a few holes. Acting wasn't an issue, but the dialogue and the script were just plain bad. Really the only positive thing about this movie i can think of is Michelle Williams' performance, and pyramid head is a bada$$, but other than that, this film is just terrible. Don't waste your time or your hard earned cash. 1.5/10",
      "total_reactions": 8,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "The only scary or gruesome thing about this movie is that it might be the end of Silent Hill. Yes, it's that bad, coupled that with an awful game earlier this year, Silent Hill is in all new low. Mercilessly butchering the memory of one of the best games in last gen, Silent Hill: Revelations 3D is a poor reinterpretation which fails almost in its entirety and they make sure to stomp the franchise while it's on the ground with truly horrible 3D implementation.",
      "total_reactions": 7,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "As we all know this is based on the 3rd instalment of the rather good survival horror games silent hill. It logically sidesteps the second game (as it was a stand alone story) and went to continue the story began in the first movie. Yes it follows the 3rd game and yes it changes aspects, the main characters and some of the plot elements, but the main bulk of the story is there. Visually Michael Basset has made a stunning movie, with some clever directing and ingenious set and creature design. (red pyramid always being a highlight) I found the plot self explanatory (with a little too much exposition) i feel there could be a better, longer directors cut somewhere, (i feel a extra 20mins  which enables the first 3rd of the movie to breathe a little better. Some of the dialogue was clunky but this is mainly because of the exposition, however it doesn't ruin or detract from the experience. The music is outstanding as ever with direct music cues from the game (most definitely a good thing) The only real downside was Vincent who didn't really work that well and to be honest wasn't needed, but again this does not ruin or detract from the movie. Tension is well handled and some of the scenes graphic and chilling. The 3d is handled well, with a few gimmicky bits but mostly bringing you into the misty town of silent hill in ways never before accomplished.",
      "total_reactions": 7,
      "user": "AdelaideM"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2013
      },
      "score": 2,
      "text": "Silent Hill Revelation is a prime example of how to take a movie's potential, wrap it up in a little box, and punt it off a cliff.  The first twenty minutes were somewhat suspenseful, slightly intense, and pretty much on par with the first film (for the record, I actually enjoyed the first SH flick). After that, it's as if Paul W.S. Anderson assumed filming duties and everything went to complete crap. Hilariously bad monster design, corny dialog, Malcom McDowell's apparent winging of his performance after coming to terms with reality and the film he signed for, and enough 3D IN YOUR FACE moments to induce 4D vomiting- those are reasons enough for me to stop there.  So, after trudging through that mess, we arrive at the final scene in the movie, the excrement on the urine-flavored cake: ***SPOILERS AHEAD*** In just one of many forced plot twists in this film, Heather summons Pyramid Head, who, with all his might, rushes to Heather's aid. I'm aware this reflects upon a scene in the first movie, but in this film they may as well have given Pyramid Head a cape and cowl because they couldn't have made his heroic presence more obvious.",
      "total_reactions": 5,
      "user": "Firecrest"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "I really enjoyed the film.Because i liked the game.All people say this is  no.The plot is fine,the acting is great.This is the best based on video game film.I can't understand why you guys give this negative reception? Many jumped scare don't make you scare?.That's a  reason to hate this film.",
      "total_reactions": 4,
      "user": "PinBB"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "A great choice for lovers of video game Silent Hill. I think that is not what was expected. visual effects but is well made. I take the pleasure of saying it's the best movie that is to be created from silent hill is the sequel to the first movie. is very good to have a good time watching it.",
      "total_reactions": 11,
      "user": "Cadmielt"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "A true homage to part 3 of the game series.  Great visuals but the acting was honestly terrible.  The film felt rushed why they didn't make a 2 hour movie to spread it out I have no clue.  Having played the third game it actually tied up some loose ends for me.  You have to really pay attention in this movie or you will get lost fast.  Creepy bad guys are plenty, the return of the great Pyramid Head are ample reasons for fans of the series to come back 1 more time to Silent Hill for this installment.",
      "total_reactions": 13,
      "user": "Feer"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "a great film, they used 3d so mind-bogglingly well that i felt like i was in silent hill with heather, the plot is strong, at least for fans of the third game, and the cast does a mostly brilliant job, i highly recommend this to people who liked the first film, and people who liked the games.",
      "total_reactions": 15,
      "user": "mickeyboy"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "The film faithfully respects the history of the game, if viewers who saw not a fan, then you will not find meaning. It's part of a history of Silent Hill, NOT a part of a horror movie like a \"the girlfriend of Chuky\"",
      "total_reactions": 15,
      "user": "palomitasvelaz"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "I was thrilled with how well this movie turned out. Being one who grew up watching the games being played, and playing them myself, Silent Hill has stayed true to it's fans with the movies. Which is a lot more than I can say about the generic and repetitive 'Resident Evil' movie series. The 3-D was phenomenal. Not an over the top, things flying at your face film. The 3-D wasn't used as the films selling point. Rather, it enhanced the movie. Making the beautiful sets and characters come to life! It was easy enough to follow, (even for those who haven't played the game) and yet stuck with the games. Not only was the art quality great, you'll fall in love with the main protagonists; Heather and Vincent. (Adelaide Clemens and Kit Harington) The only downfall was the films length. While it deserved at least a 2 1/2 hour time slot, it fell short with 1 hour and 34 minutes. This however, should not keep you from seeing this masterpiece of a creepy thriller. Maybe the resident evil series should just take a backseat and watch how Silent Hill does it.",
      "total_reactions": 9,
      "user": "destroyhumans"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2012
      },
      "score": 0,
      "text": "I never expected a movie to fail to follow it's source material so miserably. Poorly acted, poorly edited, and nigh incomprehensible plot-wise to anyone regardless of if you HAD actually played the games. In short, this film physically wounded me.",
      "total_reactions": 6,
      "user": "davoid15"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "So, I could start this review by telling you the reasons this is a bad movie. Paper thin storyline, bad acting, subpar special effects, among others. All this would give this movie a 2.............. but then I realize I didn't come for the storyline, the acting or the special effects, I just came here to see how they portrayed the silent hill world and monsters into the big screen, and at that it does a fair enough job. So, 5 it is.",
      "total_reactions": 3,
      "user": "melchaios"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "The movie is definitely not as good as it's predecessor, but it was still a decent film. Yes, it wasn't that scary as it was supposed to be, but it was still the dark Silent Hill world (of course, again, the first movie was a bit more true to the atmosphere of the games). The story was NOT supposed to follow the events of the games and that is something that the fans have to understand  all gaming movies do the same  and it's not that bad. The only thing I didn't like about the story was the ending  especially Claudia's role and what she becomes in the finale. The ending was just too...cliched maybe. Also the movie was at least a bit scary at the beginning, but when the Darkness finally engulfs Silent Hill, it has the opposite effect of what the viewer would expect  all the horror is simply gone  which I think was the biggest mistake of the movie, at least when talking about the horror aspect. Then the soundtrack was definitely one of the strongest aspects of the movie  I'm listening to it right now on Youtube. The actors also did a good job, which I didn't expect after seeing some sneak peaks. There is no way it is only worth 15/100 as in the critic score  do not be deceived by this  it is not a perfect movie but it definitely is not that bad,",
      "total_reactions": 3,
      "user": "vodas"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "Well ... it was fun to watch - if for the wrong reasons. Aweful and ridiculous plot and dialogue by blant and meaningless characters who behave and act stupidly will have you grin and giggle throughout a movie that tries to be exaggeratingly heavy on exposition and explaning but still manages to make no sense at all. It contradicts itself all the time and when it doesn't, it presents situations that are very unlikely and unbelievable if thought through.",
      "total_reactions": 3,
      "user": "iBash"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "i like silent hill: revelation, it is a narrative mess, but it is visually stunning, the monsters are stylish and inventive, and it benefits from a decent, devoted cast (sean bean, adelaide clemens, carrie-ann moss, malcom mcdowell, kit harrington), though it suffers from a distinct shortage of scares, it is consistently creepy, and that trademark sense of mystery is evoked in the asylum, though nowhere near as good as the original by any stretch, it is still a sufficient, conclusive ending to alessa's story, and i can't wait for downpour.",
      "total_reactions": 3,
      "user": "DJohnson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2012
      },
      "score": 1,
      "text": "Bravo.  SH:R:3D is now the best argument for Digital over Film -- it has such a modern look to it!  This movie is so modern that it would be right at home on Netflix Instant or a Blu-ray or any modern technology (i'm surprised it didn't go straight there!).  it looks like it was shot on an iPhone!  Really cutting edge stuff.  And the acting. Oh. my, god.  Every time a familiar face showed up I thought to myself, \"I CAN'T BELIEVE THEY'RE IN THIS MOVIE!\".  The art direction was great.  it reminded me of one of those haunted houses you go to on halloween where a bunch of employees wearing rubber run up and try to scare you, and then go back and wait to pop out again.  Very professional.  And as for the writer/ director, WELL, he certainly made a lot of choices!  i really think that the person who deserves the most credit though is Samuel Hadida, after all, his is the first credit you see!  On a scale from 1 to 10, i will rate it a perfect score of 1",
      "total_reactions": 3,
      "user": "CalvinCrack"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2012
      },
      "score": 0,
      "text": "This was a great GAME, and a cool FIRST MOVIE, but why make a second movie that has nothing to do with anything? The only thing it shares with Silent Hill is the name and that's pretty much it. Then there's this cheeseball 3D crap they threw in... ugh. THIS IS A NO SEE MOVIE",
      "total_reactions": 3,
      "user": "APOLLO_SOL"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "Well! I can't say it was like the first one or so bad, but it is bad, the first one is much better, this one, the scenes, the story is just a **** MESS! But I still enjoyed it, but don't know why!",
      "total_reactions": 3,
      "user": "HaithamBayazeed"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2013
      },
      "score": 3,
      "text": "Silent Hill: Revelation is a very bad movie. It's just a messed-up mixture of low scares and cheap and terrible script. I don't think it can even be called a horror film.",
      "total_reactions": 3,
      "user": "JovanP"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 5,
      "text": "Only for the absolute most die hard Silent Hill fans. I am intimately familiar with the Halo of the Sun, the Seal of Metatron, the Order, Valtiel, \"God,\" the layers of reality, Leonard, Claudia, Heather Mason, Harry Mason, Pyramid Head, Alessa, Dhalia, Robbie the Rabbit, the fog, Brookhaven, Vincent, and Lakeside Amusement Park, all from the games. If you don't recognize every single one of those from memory, then you will likely be lost throughout much of the movie. The film loosely follows the plot of the third game, and even then, you need to be very familiar with the story from that game to get what's happening most of the time. The acting is subpar in most of the characters, and there is way too much exposition. The set pieces are excellent, and some of the creatures are inspired, but the climax was rushed and the general pacing of the movie was poor. If you are indeed a super hardcore Silent Hill fan, then this movie will address many canonical issues that are largely unexplored in the games and deal with various fan-based theories. There are also so many references to each game in the franchise, including Downpour, that hardly a shot goes by without one coming in somewhere. Almost every set in the film was pulled from one of the games. Excellent fan candy, but not much else, I'm afraid.",
      "total_reactions": 19,
      "user": "SirRaiuKoren"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "now, i am a very hard person to disappoint... BUT F**K YOU MICHAEL J. BASSETT, F**K YOU, F**K YOU, F**K YOU, WITH A RUSTY IRON SPIKE!!! needless to say, it was very disappointing, for starters, pyramid head is on all but TWO posters for the movie, he is in only TWO F**KING SCENES IN THE ENTIRE MOVIE, these scenes are both extremely underwhelming, when you hype up a monster with all of your promotional material, YOU HAVE TO DO MORE WITH HIM!!! the characters, only three are developed with any effectiveness (heather, harry and vincent), and adelaide clemens is so flat, she barely has any of the heart her character did, kit harington was good, and sean bean was, as always, great, carrie-anne moss, was great as claudia, malcom mcdowell was great as leonard, and deborah kara unger was great as dahlia, who is BARELY IN THE MOVIE, despite the fact that she deserves a greater role as she is, by proxy, heather's mother!!! martin donovan was good but also pushed almost out of the movie altogether, and what happens to him, CHEAP!!! oh, and don't blink, you might completely miss rahda mitchell... who inexplicably provides a quiet mediocre performance... and to the shear lack of scares... there were only two scenes that scared me, one involves a birthday party, those who have seen it know what i mean, the other involves the mannequin spider... which strangely enough only lasts 40 seconds... like i said, CHEAP... the plot also seems flat sometimes, but the worst part? the fact that open road cut near FIFTEEN MINUTES out of the film, which they have voiced no intention of putting back in... what a shear f**king disappointment, this is barely silent hill, PLEASE MICHAEL J. BASSETT, NEVER MAKE ANOTHER SILENT HILL MOVIE EVER AGAIN!",
      "total_reactions": 8,
      "user": "mickelwick"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "In my opinion was better than the first one, but I must say that it was not horrible as some sites judged. As far as the actors have to say that fared; certainly nothing special but I think the dubbing in Italian has a little spoiled acting. There were many scenes and quotes that brought me back to SH3 (and not only) and I think the fans will appreciate who is so even though the plot is not really faithful to the game. The flaw of the film I think it's the script a bit too simpleminded but still full of surprises. The strength of the film are the sets (very similar to the game) monsters (and many really well done) and the atmosphere. But I must say that I found the special effects a little fake. Then let me tell you that in the end there will be a clash, but can be spectacular, but that did not seem suitable for a film like SH. Great songs Yamaoka. A film that must be seen from without high expectations but that is not bad (even if I consider the first best).",
      "total_reactions": 5,
      "user": "Mad_Hatter91"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "There is really no point in even reviewing this film. All that is bad about this movie has been said by others. If this movie could have copied one good thing from the original Silent Hill film I would have given it a 1/10 but Revelation 3D is relentless with its failures. I suppose if you like the any Resident Evil film after the first one you will like this movie. Enjoy :D",
      "total_reactions": 2,
      "user": "kingzardoz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2012
      },
      "score": 0,
      "text": "I have had only 3 experiences in a cinema like I had with Silent Hill: Rev and I wouldn't want to experience them again.",
      "total_reactions": 2,
      "user": "lightningbarer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2013
      },
      "score": 3,
      "text": "Wow. This one was hard to enjoy. Terrible in every way and a disgrace to the previous movie. It's even hard to try and describe what went wrong since everything went wrong.",
      "total_reactions": 2,
      "user": "OhTheDerp"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "I really didn't enjoy this movie, I knew from the trailers I probably wasn't going to enjoy this movie, but I went to the Cinema to see it because I thought, \"Hey, its Silent Hill, its got to be better than the last movie, right?\" Wrong.    The plot sort of based around the plot of Silent Hill 3 with Heather Mason, she starts having nightmares about Silent Hill and eventually starts seeing these things in real life. If you know the game, you know the general plot of this movie bar a few minor swaps and changes which may make it more interesting to some people? I don't know, I just kept pointing out mistakes to the people I was with who had never played Silent Hill 3. (They didn't like the movie either, by the way.)  The jump scares do scare you, but it doesn't really build up any kind of suspense as you know when the music starts to go quiet that something is going to scream, or a loud noise is going to attempt to frighten you. It did start to annoy me after a while, because it was less of a horror movie and more of a \"Loud noise, be scared\" movie.    The 3D aspect of the movie wasn't that bad, the fog and ash effects were nice, especially in transitions to the other world, but one scene that stuck out for me was the mannequin monster, the CGI was so bad that I burst out laughing like most of the audience in my showing of the movie, and I think it wins the award for one of the worst CGIs I have seen.    The last few minutes of the movie were pretty terrible, I really disliked the use of Pyramid Head and it just seemed to be queuing itself up for another sequel, with either Travis or the guy from the most recent game, Downpour as the main characters instead of the Masons.    Overall, the movie might be okay if you like jump scare movies or don't know anything about Silent Hill, but if you know about the Video Game, hate pointless jump scares or want a good horror movie, avoid this one. The reason it gets a three from me is because the 3D wasn't terrible, and some of the effects were nice, and while the plot wasn't a complete betrayal, it didn't make much sense in a few aspects.",
      "total_reactions": 2,
      "user": "Eraz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2013
      },
      "score": 3,
      "text": "I don't know what to write. Honestly, I didn't like the movie. The first part was perfect. It's still one of my favorite films, but Mr. Michael J. Bassets' creature didn't captured me at all, I didn't  feel a bit of fear or horror. Some scenes looked ridiculous and awkward, especially the last fight between two monsters. Everything was happening so fast, the conversations were short, it looked like the makers didn't have time and they had to shorten the film, so it looks kind of pressed. I have never played  Silent Hill 3, but i think those who played will like the fill.",
      "total_reactions": 2,
      "user": "milton666"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "silent hill no es la mejor secuela ya que se enreda mucho y no sigue la misma historia de la primera pero para mi los efectos especiales y una que otra actuacion valida compensa todo eso",
      "total_reactions": 2,
      "user": "diego9901"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2012
      },
      "score": 0,
      "text": "This movie is crap at best, not scary never any tension and absolutely awful dialogue. Don't touch the movie it is really that bad. I believe I could have made a better movie myself!",
      "total_reactions": 9,
      "user": "Makorov"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "I can't believe these worthless fu**ing critics... People complain about the RE movies not staying true at least somewhat to the source materal... but holy fu**.  Silent Hill is SUCH a NEAR PERFECT representation of the first and third game, its unbelievable.  I applaude the director for doing a fantastic job with what he accompished with this movie and its continued connection to the first film.  Please people, if you have played the games; DON'T LISTEN TO THE CRITICS.  The movie is awesome.  The only point I docked off, was yes the actors could have done a slightly better job.  The girl who played as Heather was awesome though.  Please see this movie and support it, and also respect the fact that \"this\" is what we always wanted from movies based off games.  A \"true\" representation of it.",
      "total_reactions": 7,
      "user": "Gamer4life1985"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2012
      },
      "score": 4,
      "text": "I saw this in 3D-- which is a blurrier, dimmer, more migraine inducing version of this crap film.  I'm a gamer, and thus a fan of the Silent Hill video game.  Though the first film wasn't great it was definitely a film, made by a filmmaker.  Revelation felt like fan fiction--which if you're a big fan of SH3, you'll probably love it.",
      "total_reactions": 7,
      "user": "MovieJerk"
    },
    {
      "neg_reactions": 19,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 0,
      "text": "Horrible bastardization of the Silent Hill game mythology. Not worth paying to see or worth your time. Not scary, cheesy, terrible script and director. It's kind of sad to see such a great story be completely ruined..to make a cheap buck for Hollywood. Silent Hill has gone to **** after they took out Team Silent.",
      "total_reactions": 32,
      "user": "fogworld"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Perfect movie, perfect cast, perfect story. Dont listen to the other reviewers. The movie deserves WAY better then this. Its an amazing movie and is faithful to Silent Hill and Silent Hill 3 games. The reason people are rating it low is people are now expecting Silent Hill to be like Silent Hill homecoming and later games. No, this is TRUE silent hill. I cant wait until the next movie. The next movie needs to directly follow. I want to see if Chris finds Rose... 10/10!",
      "total_reactions": 8,
      "user": "cameronrogers"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 1,
      "text": "Okay, I'm going to be up front here and tell anyone who is reading this that I am a Silent Hill fan.  I love the games and Silent Hill 2 is among my favorite games of all time.  I will not be comparing this to the games because we all know that the games are better.  So when I unleash all holy hell upon this movie, I want to make it clear that I am not being (or at least not attempting to be) a but hurt fanboy.",
      "total_reactions": 11,
      "user": "EvillivE"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2012
      },
      "score": 1,
      "text": "Too bad the fantastic french filmmaker of the first silent hill, which was a blast did not want to make a sequel , cos this is really not as good as the first one, despite the universe of both movies which are very similar.",
      "total_reactions": 9,
      "user": "AngeAlexiel"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "Zzzzz! So Boring! The only way you will like this movie is if you are under 14, haven't seen many other movies and... can't think of another reason! The story doesn't matter, we just want scares!",
      "total_reactions": 3,
      "user": "discodirk46"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "Just saw the movie yesterday, and it really dissapointed me, the plot was terrible, the actress that played heather wasn`t really convincing, the creatures introduced has nothing to do with heather history they made a lot of winks to all silent hill games and even tough their intentions were good it only confused the viewer.",
      "total_reactions": 3,
      "user": "rpdrichard"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "I am not sure why this pro critics have given this movie such a low score. I thought it was visually beautiful along with some very intense scenes. If you like horror movies give this one a shot. You will not be disappointed.",
      "total_reactions": 3,
      "user": "saints51"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "Absolutely a Masterpiece! Scary, creepy, emotional, mysterious. A fantastic story with fantastic characters.",
      "total_reactions": 3,
      "user": "Italian-gamer97"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2013
      },
      "score": 1,
      "text": "This movie is horrible as there is no point and the 3D ruined the entire movie+ Terrible voice acting...Never watch it or else you will feel shocked about its terrible graphics and voice acting",
      "total_reactions": 3,
      "user": "Annoymous1"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "The info dumps killed the movie. The first 45 minutes explained everything in the worst dialog in recent memory and removed all mystery or suspense from the action parts. The movie actually got the look of Silent Hill 3 down to a tee but there was none of the horror or otherness to bolster the visuals. The 'revelations' should have come towards the end and been better written. Pyramid head was awesome.",
      "total_reactions": 11,
      "user": "Gene"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "The only positive aspects of this movie are the two scenes involving the demonic nurses and when the audience witnesses pyramid head going through the asylum. Oh, and there is one extremely disturbing scene involving a plastic bag on the head of a mannequin. Literally everything else is painfully awful. Both fans and newcomers are going to be repulsed (and not in the good way).",
      "total_reactions": 11,
      "user": "rastapasta"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 1,
      "text": "As an avid Silent Hill fan, I was extremely excited for a sequel to Christophe Gans' 2006 film. The 2006 original was exactly what it should be - a movie DEDICATED to fans of the video games! And that movie was amazing - with great performances and a movie that really evoked a sense of dread in the terrifying nightmare. So I was extremely disappointed that this 2012 sequel is not even close to achieving that same type of caliber. The movie is filled with cheap scare tactics, cheesy acting, and characters randomly thrown in so that it could be called a Silent Hill movie. Whereas Christophe's original was paced so that you could identify with the main characters and their plight, you don't get that opportunity with this cast. When characters drop off in this sequel, you just don't care.  In Christophe",
      "total_reactions": 4,
      "user": "mekanykal"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "I enjoyed the movie, great CGI, and not boring. I felt that the movie is somehow too short. 2 hours would ideal to give a reasonable characters development, tensions and scariness. This movie is not all that bad at all. I will certainly get the DVD once it's out.",
      "total_reactions": 4,
      "user": "ivan_terrible"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 5,
      "text": "All the monsters and creepy hallways in silent hill make it enjoyably entertaining all the way through.  The plot lacked in build up and actually going somewhere with the climax.. I expected a lot more as the movie went on but it did come off strong right from the start.  A lot of reused horror ideas, (waking up from dreams) and predictable moments but main actress Adelaide Clemens saves any flaws the movie may have with an amazingly likable performance. Overall I would would watch it again if it was on TV but wouldn't buy it.",
      "total_reactions": 4,
      "user": "DesertEgoal"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "The BEST EVER possible trip to Silent Hill for real. People who have never played Silent Hill games may consider seeing this as a good horror movie but somebody must prevent them from writing ignorant reviews! I mean what is 15! Ooo I guess, you guys got too scared right? Or did not understand anything since you don't have any idea what Silent Hill is. Go see this and then you will want to see it again, with enough psycho stuff from the SH world and a good enough story to keep you interested, imagine this as a 5D or 7D movie with 5 minutes joy, well, this movie at least offers 5 times more than that.",
      "total_reactions": 4,
      "user": "UnderrateXposer"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2012
      },
      "score": 3,
      "text": "too bad that this film has a low user score. I wanted to see this film but now I think, watching this film is a total waste of time. It continues with watching part one.",
      "total_reactions": 4,
      "user": "MisssZ"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "I'm not saying that Silent Hill: Revelation is a bad movie, but it's a disappointment in the Silent Hill movie series. Matter of fact, it's one of the worst video game movie sequels since 97's \"Mortal Kombat: Annihilation.\" Sure, the first Silent Hill is kinda decent, but is 3-D really necessary in this sequel? Sometimes, unfortunately, it can't outmatch Resident Evil: Retribution's success in IMAX 3-D (Still the lowest grossing movie in the franchise, but manages to overcome the odds overseas). I'd prefer a cult classic horror video game turned into a movie soon like Dino Crisis or D or Haunting Ground and Clock Tower. Probably, I'll wait for a rental of SH: Revelation.",
      "total_reactions": 9,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "I guess if i never played the game's i would give it a bad rating myself. Cause i loved this movie. Perhaps the critics need to at least read up on it before viewing to know what is really going on. Just an idea anyways.",
      "total_reactions": 5,
      "user": "stealthbushido"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Similar  to one of the other user reviews (mavizzle), I too was not fan of first movie, but am a die-hard fan of the game series. If you enjoyed the games, there are ample reasons for you to be satisfied with the movie. For starters, the Silent Hill movies are a rare commodity, they are not created often enough! I saw the trailer and waited three weeks to see the movie in theaters. Paid over $12 a ticket, would have gladly paid more. If I had to drive three hours to have seen it, I would have done so. The movie itself has a large amount of 3D (if you have any doubt, watch it and compare it to others such as SAW 3D and you will see the difference). The monsters in the movie closely resemble those in the games, with a few differences and original creations tossed in. In addition, both the detective as well as heather herself closely resemble the in-game characters. Few movies have done such a wonderful job choosing such incredible matches such as these. Moreover, the music, atmosphere, and various other minor elements (red shoe in the motel, Apt 106 selection, amusement park, mall, et cetera) all contribute to a warm feeling of familarity  to any Silent Hill 3 fan - and who can forget the bus at the end of the movie?! Conversely, the movie does have its weak points. Some of the acting was the best, as well as a bit of a few cheesy verbal lines spoken by Vincent. Also, depending on the theater, the lighting can be quite dim for the 3D glasses causing a difficulty in visuals. Lastly, the movie does take an alternative path on the story plot. However, otherwise, anyone who has played the game will easily have foreseen a possible NC-17 rating slap on the former ending to the game if it was redone in movie format.",
      "total_reactions": 5,
      "user": "JudgeOfHorror"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "I don't see why these reviewers are giving this film a bad rep. The acting and the visuals are superb. This represents the third game brilliantly. The 3D is SO GOOD. It's the best 3D movie. Period.",
      "total_reactions": 6,
      "user": "theshanth"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "I made an account here just to review this movie. The reviews are the most absurd things I've ever seen. I left the theater with a smile on my face, and kept saying how great the movie was. This was definitely the Best Video game Movie I've ever seen! If you played Silent Hill 3, you will absolutely love and adore this game!",
      "total_reactions": 6,
      "user": "traskular"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 0,
      "text": "Nothing more then Garbage worst film adaption **** up on heather got her character wrong VINCENT IS 24-26 for **** sake heather HATES HIM he should not be a shoe horned Romance downpour should not even be in the damn movie are Travis Clearly anyone that says it did justice to the game NEVER played the game for **** sake its pacing was Awful they got barley anything done Douglas Cartland WAS NOT A MINOR PART also He does NOT DIE he only DIES in the evil ending and harry does not get Kidnapped HE gets killed in his living room and heather finds him and she fights Missionary who killed harry under Claudia Wolf's orders. THE best PART of the WHOLE movie Was SADLY Pyramid HEAD and He does not even belong in silent hill 3 but he stole the movie right under heathers nose in this **** fest of a \"Movie\" JUST awful they did not even get her outfit right YOUR NOT HERE WAS NOT EVEN IN THE MOVIE AND ITS THE MAIN THEME over all a **** movie",
      "total_reactions": 11,
      "user": "CyanAvery"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "A watchable but all together dumber feeling sequel. The first Silent Hill movie felt like watching one of the games, minus the scares. Because of that it was enjoyed by many SH fans, myself included. This one feels less like SH, and more like some torture-porn horror movie along the lines of one of the later \"Saw\" movies due to it's grotesque imagery and excessive gore.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "Just saw it and I think is the best adaptation of a video game ever!",
      "total_reactions": 1,
      "user": "neovolcano"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "To the contrary of most recent reviews, this film is in fact very well done, the production values are great and the horror/creature effects are chilling. The principals' acting doesn't match the effects unfortunately, so that criticism rings true. But the story is decent and there are instances of topical humor thrown in which was cool. Recommended for adults but kids under 14 and under should stay  seriously.",
      "total_reactions": 2,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2013
      },
      "score": 2,
      "text": "Only for devoted fans, who can overlook all the cinematic failures of the movie. For the rest of us it is a mess. The acting, the characters, the plot and every other thing is just bad.",
      "total_reactions": 1,
      "user": "oliver1h"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "I wasn't really a fan of the first film with It's Witch Movie type feel BUT I can safely say I liked my second stay in the Movie version of Silent Hill a hell of a lot better than the first. While the movie is by no means perfect It has some truly brilliant set-pieces and some imaginatively designed Sets. The only problems I had with this movie where, the acting and the final battle scene (WHY? MICHEAL. WHY?).",
      "total_reactions": 1,
      "user": "Samotslayer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "Not sure why somany people and critics don't like it. I found it to be the best damn videogame movie adaptation ever. It's ridiculously respectful to Silent Hill 3 and even makes references to some of the more recent ones. The look of the movie was great and the 3D was actually superbly implemented. Not a scary movie but it's eerie and disturbing in the way most japanese horror movies and the Silent Hill videogame series is so it actually felt unique. Loved the movie and already want to see it again.",
      "total_reactions": 2,
      "user": "StriderKiwi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "They had the chance to make a very good sequel. Instead we got this... Huge, huge disappointment, i expected a whole lot more from this film. Even the exquisite atmosphere from the first film is missing.",
      "total_reactions": 1,
      "user": "Sandwraith_"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2016
      },
      "score": 5,
      "text": "As a movie, Silent Hill: Revelation is bad; it has shoddy acting, video game-esque dialogue and cheap CGI. But as a Silent Hill movie, Silent Hill: Revelation is kind of watchable, but not on the par of its predecessor. Revelation will surely gain most of its fans by being true to the popular video game series. But if you are not a fan of the series, you will not be pleased, this is strictly for fans only",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "It's never been a good idea to make a film based on a video game. SH: Revelations is one of those films that felt like you are watching a video game; settings felt like levels that the main protagonist has to go through. Cue some really atrocious dialogue from dependable actors such as Sean Bean and Carrie Ann Moss.  Nevertheless, I was a fan of the game and I found it entertaining to some degree.  For the most part though it is quite faithful to the original game (in case you are wondering, it is based on the 3rd installment of SH).  If you are not a fan, well...watch this with much apprehension.",
      "total_reactions": 0,
      "user": "dharma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2013
      },
      "score": 2,
      "text": "Welcome to silent hill...a doomed town full of lost and tormented souls never to enjoy another moment of happiness all because of a little girl(demon) denies them of this simple pleasure....oh I'm sorry I'm not talking about the people in the movie...I meant the people(like me) who wasted their money to see this vomit inducing....cheaply rushed train wreck that isn't worth the attention of a squirrel fart!! Good God this movie is bad  althought the first movie wasn't perfect(my score 7/10) its far beyond this crapfest!!...so as usual the good: ENDING CREDIT'S(IF YOU LAST THAT LONG BEFORE TURNING OFF THE DVD PLAYER) Now the gut ripping...soul sucking....CASH STEALING BAD PARTS.....EVERYTHING BEFORE THE ENDING CREDITS....I MEAN WHY WASTE MY TIME TELLING YOU HOW BAD THE ACTING WAS BESIDES SEAN BEAN(GREAT GUY..LOVED HIM IN THE MANIC KILLER...THE HITCHER)Why waste my time telling you that you only see Alessa in THREE SHORT SCENES....Why waste my time telling you how they basicly killed almost all the characters in about 7mins(the dectective...girl in the mall)why waste my time telling you there virtually NO CHARACTER DEVELOPMENT...why waste my time saying how they just RUSHED THE MOVIE JUST TO GET TO THE ENDING...pyramid head is only in about three scenes(if you count the dream when he's at the amusement park)then he struggles to beat a monster with claws in the final scene?  Why the hell did lenard pick up heather? I mean where was he taking her? I thought he wanted to kill her but he knocks her out then carries her until she regains consciousness then kills him while he tries to RUN AWAY? My God...how stupid was that scene!? The great carrie-anne moss....aka Trinity...was also under used....as well as daliha as she's been reduced to ONE SCENE?!....TOTAL RUSH JOB....SMH....I will say(reluctantly) that certain aspects of the game was retained but why mention it....the director somehow destroys any(IF NOT ALL)the good that silent hill has to offer...I hate to say this but....I'D RATHER SUFFER THROUGH THE GLITCH-FEST THAT IS SILENT HILL DOWNPOUR THAN THIS ATROCIOUSLY BAD ADAPTAION OF A ONCE GREAT VIDEO GAME SERIES THAN THIS MESS EVER AGAIN(SILENT HILL 3 WAS THE LAST GREAT GAME IN THE SERIES...HOMECOMING WAS JUST ABOVE GOOD) Stick with the first silent hill movie  let this stay where it belongs.....OUT OF PEOPLES HOMES  MINDS!!!! This is how the girl in the mall ends up in silent hill.......Heather:how did you get here? Unknown girl:I took a wrong turn....mannequin drags her off screaming....GOOD GOD.....Two guys taking Vincent to a surgery room....two guys pushes Vincent(who's strapped to the chair)in the room....nurses looks around to locate noise....two guys obviously to stupid to realize that there making too much noise.....nurses attacks(AND I QUOTE) KILLS one of the two guys.....the other guy is too stupid to realize his friend is being hacked to pieces  even though he lays motionless on the floor(& is still being hacked to pieces) stupidly walks over  say(& I QUOTE) stop it....move.....get away as if he is getting small bugs off his OBVIOUSLY DEAD FRIEND  THEN HE HIMSELF GETS KILLED FOR BEING A COMPLETE MORON.....ITS SCENES LIKE THIS THAT WASTES THE ESSENCE OF SILENT HILL....How can you put one of the best enemy's in a video game(I'm talking about the nurses) in such a HORRIBLE SCENE? EVEN THE MANNEQUIN IS WASTED.....JUST LIKE THIS MOVIES POTENTIAL.......2/10",
      "total_reactions": 0,
      "user": "ilovegames32"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "As bad as the critics say? Absolutely not. At least this movie is watchable (the first film was not). Acting is solid, Nothing to really complain about. No real scares or suspense though. Ending isn't all that satisfying. Story could have been better but it was decent enough to make me stick around and see what happens. One thing good I can say about it is that they actually use 3D, They may not use it much but it's a heck of a lot more then any other \"3D\" movie. Overall, It wasn't that bad and I wouldn't mind seeing a sequel.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "A nice movie, full of fan-service like places and names from the game saga and specially from Silent Hill 3. A really good adaption from the game. The only thing that a did not like about this movie was that the director attempted to use the first one as a start or a base in the story line and in my opinion that was a bad move. The fist one was not a good movie(I mean Harry Mason, was an adoptive father and WIDOWER). But saving that, in my opinion this was a good movie even if it was really far from being a horror movie.",
      "total_reactions": 0,
      "user": "ClowLiReed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "The second part of Silent Hill fail to convince as much as the first part. The film has good sound and special effects, but a typical argument of a sequel.",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Sequel del film del 2006, Silent Hill revelation si pone come seguito che cerca di semplificare di molto, e anche troppo, la trama difficile del primo capitolo. Sharon cresciuta si ritrova a dover cambiare insieme al padre, molte città per scappare dalla polizia per una storia di quando lei aveva 11 anni. La madre Rose  rimasta bloccata nella dimensione della nebbia ed  riuscita a riportare Sharon nella realtà. Dopo il rapimento del padre, Sharon aiutata da un suo coetaneo immischiato a sua volta nella cittadina maledetta, dovrà ritornare a Silent Hill per la seconda volta. Purtroppo la l'ambientazione della città maledetta arriverà troppo tardi a circa 40 minuti del film, considerando la sua breve durata di circa 85 minuti! Inoltre se si prova a immaginare la durata del tempo che Sharon passa a silent hill può essere vicina a appena 3 ore! La fotografia che si era tanto distinta nel primo film, qua  abbandonata per una alla \"blockbuster\" cioè molto carica di colori, satura, totalmente inadeguata al tipico paesaggio scuro e avvolto nella nebbia a cui si era abituati fin dall'inizio della saga, rendendo i mostri quasi bianchi, definiti, poco minacciosi, e a volte ridicoli. riguardo ai mostri, questa volta sono pochi e si posso ridurre a poco più che 5 esemplari. L'inizio del film che presenta visioni \"terrificanti2 della realtà della città dove vive Sharon sono ridicole e senza senso, che tentano solo di suscitare disgusto e orrore senza riuscirci. Cosa inspiegabile  il fatto che se Rose alla fine del primo film rimane intrappolata nella silent hill della nebbia, perché Sharon non la incontra dato che ritorna in quella dimensione? Pessimi i momenti in cui compare il tanto amato mostro dalla testa di piramide che riesce solo a provocare disgusto e ci si chiede perché  finito a fare un lavoro così \"ridicolo\"?",
      "total_reactions": 0,
      "user": "ghostface97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Silent Hill Revelation was a good movie. I thought it was entertaining and it made me jump a few time great graphic well done SILENT HILL REVELATION 7/10",
      "total_reactions": 0,
      "user": "cool1707"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Silent Hill Revelation  o melhor filme baseado em games de todos os tempos. Superou seu predecessor. Discordo totalmente das criticas exageradamente negativas.  um filme para os fãs, mas com as devidas adaptações que o diretor julgou necessárias. Respeitem isso!",
      "total_reactions": 0,
      "user": "Junior_Santos"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Siempre dije que las peliculas basadas en videojuegos  las mejor fue la de silent hill  En este caso tengo que decir que con revelaciones me esperaba un poquito mas y lo unico que lleve fue una historia simplona y un final horrible pero ademas de eso la pelicula esta buena. Esta muy bien basada en el juego eso no lo niego lo unico malo es que hay amor y eso no me gusto para nada. Silent hill revelation 3D no es una pelicula que a todos les guste pero a los fanaticos de la saga silent hill les puede llegar a gustar.",
      "total_reactions": 0,
      "user": "Franco96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "This is my first (of many I hope) review here. I apologize beforehand for any mistakes, as english is not my native language.",
      "total_reactions": 0,
      "user": "LeonardoMagno"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "If you have played the game, the movie is true to the game. If you haven't played the game (most professional movie critics), you won't like this movie. I really enjoyed watching it, and will probably watch it again to see if I missed anything. It's not as good as the first, but it's almost as good....Yes, there are some holes in the story, but I think it would have been difficult to progress the story from SH1 to SH2 without some holes. Just watch the movie, you won't regret it.",
      "total_reactions": 0,
      "user": "LDiane"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "It looks almost exactly like the third game for starters. It's a pretty entertaining movie, but the ending boss battle was so anticlimactic that I had to knock it down a bit.",
      "total_reactions": 0,
      "user": "Hedilio"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 1,
      "text": "Awful. Looks cheap, terrible script, naff effects, abysmal acting and hap-hazard direction all make for a steaming pile. Gets 1 point for having Sean Bean in it.",
      "total_reactions": 0,
      "user": "darthstatto"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "The Movie is better than the first. This Movie has more commonalities with the games than the first. It is great to watch for every Silent Hill Fan!",
      "total_reactions": 0,
      "user": "ShaTime"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "I find Silent Hill: Revelation to be just perfect for the movie based on Silent Hill 3 and on the video game on the whole. Adelaide Clemens looks and acts absolutely like Heather from the video game. The setting is horrifying enough, white-gray foggy outside scenes follow rust-bloody shots of the inner side of the most scary and mysterious city. A lot of scenes are taken from the game, that's a nice gift for its fans. The plot is really interesting and twisty and it's understandable for everyone, not only video game fans who know the background of the story (like it happened with the first movie). The script is well-thought out, the dialogues sound realistic, the connection to the first movie is clearly explained. Silent Hill 2 has not come down to just an expensive video clip full of visual effects like what happened to the latest Resident Evil movies where the whole script can be written on just one sheet of paper with the most informative dialogues being: \"I need to recharge ammo\", \"Cover me\" and \"Run. I'll try and stall them to give you time to get clear.\" The monsters are disgusting and creepy, every motion they execute curdles the blood. The unceasing gritting sounds and even piano music create an atmosphere of true horror. I just think Silent Hill 2 could be a little bit longer, the time in the movie theatre passed too fast, but that's not a big bit of complaint. Well, I think it is a must-watch movie, containing a lot of outstanding features of the video game (which can satisfy the most devoted fan of the game), but being a good independent movie for every horror lover to enjoy.",
      "total_reactions": 0,
      "user": "ben198"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "For video game fans: It's just as faithful to the game as the first movie was faithful to the first game (think about it). The movie ran in the same order as it did in the video game, and contains so many references for the third game installment. As for the atmosphere it was a bit tame compared to the games, but still chilling.",
      "total_reactions": 0,
      "user": "RolyPo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "This movie is not bad at all. I think it is not as good as the first one, but it's right behind the first one. I actually enjoyed both movies. I also played every single game and I do not understand, why everyone is hating this movie.",
      "total_reactions": 0,
      "user": "KillaRiku"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "It didn't feel like a movie nor a sequel, I don't know what was it, but I know that it didn't impress me, it is absolutely rushed and underdeveloped, but on the bright side, it is still a good adaption of the video game which is a masterpiece, but not as good as the first one, the 3D is mediocre and the storytelling is bad, overall, it will please the fans, but not the moviegoers, I am both, it is like good and bad, but entertaining.",
      "total_reactions": 0,
      "user": "AReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2013
      },
      "score": 1,
      "text": "Bad directed, poorly acted, disappointing special effects, and a confusing plot, are some of the things that make \"Silent Hill  Revelation 3D\" a waste of time and money.",
      "total_reactions": 0,
      "user": "Estebancastro32"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "I'm still asking to myself \"Why did you watch it  Well, I try to be not so angry, but the film at the beginning is quite good, but than becomes really boring and has a weak screenplay  From Michael J. Bassett I was expecting more, because I really enjoyed his other works, but this one is really awful to his image.I'll give this movie not more than 5 and as a gamer I'm glad about the meticolousity of the characters and the cinematography is perfect, but Silent Hill makes all of us scared as hell, not bored.",
      "total_reactions": 0,
      "user": "RinoFury"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2014
      },
      "score": 4,
      "text": "Se le echaron en ganas para hacer esta secuela algo decepecionante, nada que ver con la primera, para empezar senti que era una pelicula fans service, una protagonista sin carisma, unos personajes poco aprovechados, la trama de por si no es mala es que no supieron adaptarla, algunas escenas algo discolocadas, algunas escenas que destaco  que tenia la escencia del videojuego pero aun asi, eso no significa que deba puntuarle con un 6 o a mas, la primera hora de la pelicula es aburrida  no logro despertar mi interes por seguir viendola pero se que mejora un poco a partir de los 60 minutos, pero le falta mucho para que sea mejor que su predecesora.",
      "total_reactions": 0,
      "user": "carloswalnuts"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "I have no clue what crawled up these critic's butts and died but I thought this movie was great. I loved Silent Hill 3 so I was excited when I found out this movie was based on it. Yes there were a few differences between the game and the movie but it still stayed true in a lot of ways and turned out being really good. Plus it had really nice effects as did the first Silent Hill movie. Even for a non-Silent Hill fan, it was still a really good horror movie. The world of Silent Hill is strange and crazy. Some critics need to be more understanding to the creativity of its genre.",
      "total_reactions": 0,
      "user": "lelefoxx00"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2013
      },
      "score": 1,
      "text": "I give this a one solely because Of Akira's soundtrack. The weird thing about this film is, it is inexplicably bad. By that I mean it has all the ingredients to be a fantastic film, great actors, great director, crew, source material, it has it all. So I really don't know how it came out this badly. And for the people saying that the bad reviews are only given by people who didn't play the game, WRONG. I've played every Silent Hill game outside of the arcade game and that has no bearing on the fact that this film is terrible. It fails spectacularly on every level, in fact. The actors feel like they are completely phoning it in, the cgi monsters are so over the top they come off as comic rather than scary, and ya know what, I'm just going to say it, Why is Pyramid Head protecting Heather? Also why is he running rides at Lakeview? Why is Vincent suddenly a 20 something hipster love interest? And last but certainly not least, why on earth is the transition to the otherworld generally denoted here by mass amounts of melted saran wrap?",
      "total_reactions": 0,
      "user": "Drewbeast"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2014
      },
      "score": 5,
      "text": "It isn't an appalling film by any means, but this film lacks the psychological horror of the games, relying on jump-scares which fail miserably. It also seems like the film is just moving from jump-scare to jump-scare with no buildup or character development, maybe because of the shorter length compared to the previous entry in the franchise, they felt they rushed it a little. On the plus side, the special effects are quite impressive. in fact, the only reason this review score isn't lower, is because of my love for the franchise.",
      "total_reactions": 0,
      "user": "bent12310"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2014
      },
      "score": 2,
      "text": "The director doesn't know **** about horror, I am afraid. The movie was a disaster & again shamed the SH franchise. True horror is not about scaring you but masterfully messing with you - something you can appreciate than being throw waves of monsters and expecting to have a good time. Said very simply: true horror deals with human nature, not the monsters.",
      "total_reactions": 0,
      "user": "Iluvatar21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "I'm disappointed (again). At least the users made the reviews positive.. but the critics? God. This it too bad. The movie is awesome! It will never be like the first but it's very good too. The storyline is very good and the cast too. And wow, it's getting more and more epic! Do you remember the pyramid head? He's back! And many others.. it's a very good movie.. very intense.. I just, cant understand why people dislike it. It's really sad that most of critics hate movies like this, which are so good, and love movies that have a weak storyline and are senseless.. people don't have good taste anymore.",
      "total_reactions": 0,
      "user": "walker14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2014
      },
      "score": 4,
      "text": "Hideous film and I saw it in 2D. Can't imagine how horrible it would be i 3D but it must be truly disgusting. Plenty of the gory bizarre special effects from the original have been routinely reintroduced in this hack driven abomination if there ever was one to predictable effect. The plot is dead basic and I think even the most diehard horror fan would find themselves debating whether to leave or not after the first ten goofy minutes of this hilarious nonevent of a movie. Its a shame that Sean Bean who can be one of the scariest actors out there is relegated to a small support role and isn't onscreen for very long. Very disappointing not even worthy of a Saturday marine escape movie status at the local mall. Staying in the food court and staring at nothing in particular with a coffee in front of you is a better bet than this truly awful film.",
      "total_reactions": 0,
      "user": "dagirls"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "I haven't seen a movie with absolutely no redeeming qualities in a while. This movie was bad.... hilariously bad. This had enough talent to even make Malcolm McDowell look like a terrible actor. The plot of Silent Hill Revelation is completely incomprehensible because not a single scene had anything to do with the previous scene, and there would be new plot devices and characters introduced every 10 minutes, while our two dull protagonists just run around and scream out exposition. Not to mention the acting and writing, which in itself almost made me turn off the movie 20 minutes in.",
      "total_reactions": 0,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2016
      },
      "score": 6,
      "text": "A massive amount of fans of both the first film and the games strongly dislike this sequel. Not to mention it being absolutely torn apart by critics. I honestly don't think it deserve to amount of hatred it's endured. Sure it's disappointing but there are far worse sequels. ( Remember Mortal Kombat: Annihilation?) The film still manages to maintain the look of the first film despite it's lower budget. And still has some atmosphere present within it. The monsters still looked very much it's predecessor's. The acting was still decent aside from some mediocre accents.The main drawback of the film was forced reliance on jumpscares. Personally I could've done without them.  And it's rapid pacing  which made the film feel rushed. ( The first film was 125 minutes, this film was only 94 minutes. The hugging scene was cheesy and kinda weak. The final battle between pyramid Head and the missionary was entertaining albeit brief and not fitting for horror film. Overall an average horror sequel and a servicable adaptation despite it's numerous changes and retcons. But I'm still hungry for at least one more film. Overall 62/100",
      "total_reactions": 0,
      "user": "Rehmedies97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "Matter of fact this is better than 1. It has the essence of the game (silent hill 3) that makes it awesome. Surely underrated film. I still don't get why people hated this film.",
      "total_reactions": 0,
      "user": "arislaf"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "It's a damn shame that this movie had to be such a letdown. After the greatness that was the original Silent Hill movie I half expected this one to be okay. But my excitement died when I found out that Tri-Star wasn't doing this one. I honestly shouldn't be too upset about this movie because it's not exactly a sequel but at the same time it is. Don't get me wrong, this movie like most others did have its moments that were entertaining and scary but the majority was slow and boring. don't pick this movie up unless you can stand no plot progression and stupid writing.",
      "total_reactions": 0,
      "user": "WeeverMan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2016
      },
      "score": 2,
      "text": "Even there are some cases where horror video games can do absolutely better than their respective movie counterparts. Silent Hill: Revelation is filled with the trashiest and stupidest horror I've ever seen. It, like its predecessor before it, makes the video game look a lot terrible and I can guarantee you it's not.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2016
      },
      "score": 1,
      "text": "not scary at all. the film really needs to be watched when you have played the game, otherwise you have almost no clue what and why is going on.. special effects were meh at best and acting was not bad but jon snow forgot sometimes that he needed to be doing an accent.",
      "total_reactions": 0,
      "user": "voxotto"
    }
  ]
}