{
  "mc_avg_user_score": 3.3,
  "mc_metascore": 26,
  "mc_mixed_rating_frequency": 51,
  "mc_movie_name": "Skyline",
  "mc_negative_rating_frequency": 154,
  "mc_positive_rating_frequency": 45,
  "mc_pro_critic_reviews": [
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2010
      },
      "score": 60,
      "summary": "Technically ambitious, dramatically basic. Still, it's a major step up from an AvP sequel and delivers all the Saturday night whizz-bang and Sunday morning brain-ripping you could want."
    },
    {
      "critic": "Adam Markovitz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2010
      },
      "score": 58,
      "summary": "Basically a nifty VFX reel in search of a plot."
    },
    {
      "critic": "Pam Grady",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2010
      },
      "score": 50,
      "summary": "This sci-fi thriller manages to blend genuine suspense with unintentional laughs."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2010
      },
      "score": 50,
      "summary": "It isn't clever. It isn't original. It isn't scary. At best, Skyline is a proficient, forgettable programmer that only occasionally lapses into irredeemably silliness."
    },
    {
      "critic": "Aaron Hillis",
      "publication": "L.A. Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2010
      },
      "score": 40,
      "summary": "The military eventually shows up to nuke the joint (L.A., incidentally), but there's no urgency, suspense or charm with all that back-row rattle."
    },
    {
      "critic": "Joe Leydon",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2010
      },
      "score": 40,
      "summary": "An underwhelming and derivative sci-fi thriller that's only marginally more impressive than a run-of-the-mill SyFy Channel telepic."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2010
      },
      "score": 38,
      "summary": "Their (The Brothers Strause) effects are pretty good, on a fairly limited budget. And that's about all you can say for Skyline."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2010
      },
      "score": 30,
      "summary": "Visual-effects wizards Greg and Colin Strause directed, showing more affinity for the city's steel and glass than for any of the characters."
    },
    {
      "critic": "Mike Hale",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2010
      },
      "score": 30,
      "summary": "Some obvious comparables for Skyline are \"Independence Day\" and Steven Spielberg's \"War of the Worlds,\" but there is nothing here that even approaches the comic-book verve of the first or the churning dread of the second."
    },
    {
      "critic": "Megan Lehmann",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2010
      },
      "score": 30,
      "summary": "Beyond the dazzling \"first contact\" sequences seen in the trailers, Skyline is a spasmodic and incoherent shambles hampered by an astoundingly stupid screenplay."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2010
      },
      "score": 25,
      "summary": "The Strauses don't care about how to keep an audience. Their movie has no sense of suspense or dread - Skyline is an apocalypse movie that plods like one of Romero's zombies."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2010
      },
      "score": 25,
      "summary": "So intent are the Strausses on showing off their visual chops, they leave the film's story, dialogue and acting in shambles."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2010
      },
      "score": 25,
      "summary": "Skyline plays like an effects guru's resume reel, not a movie."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2010
      },
      "score": 20,
      "summary": "Skyline is a piece of junk, even in a movie climate littered with expensive - though sometimes fun - junkiness."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2010
      },
      "score": 20,
      "summary": "It's finally here: The most boring alien-invasion movie ever."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2010
      },
      "score": 20,
      "summary": "So bland it's easy to forget the title only minutes after exiting, this Emmerich-by-numbers invasion movie exists only to offer you the cutting edge in unconvincing special effects."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2010
      },
      "score": 12,
      "summary": "Just plain bad. Boring. Unwatchable."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2010
      },
      "score": 11,
      "summary": "I'd use the term science fiction to describe Skyline but the movie decidedly lacks both science and fiction."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 2,
      "pos_reactions": 15,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2010
      },
      "score": 3,
      "text": "A big disappointment, yet I think some are taking this too harsh. I agree with fbcking stating the first trailer had no relevance to the film. This is a cliched sci fi film with a terrible plot, and terrible acting to put the cherry on top.",
      "total_reactions": 17,
      "user": "mrcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "What can I say, 9 for the trailer and 4 for the movie. I have to give the intriguing trailer a big round of applause. If you have seen the trailer before, I can guarantee you will be so bloody curious to watch the movie itself (exactly what happened to CLASH OF THE TITANS earlier thiz year). They were editing the trailer so well. But the fact is: Something so wrong is going on. Next Thing I can say, A-Class Special Effects collide with C-Class Actors. The movie directed by Special Effects experts, Colin and Greg Strause, who also directed AVPR: ALIENS VS. PREDATOR-REQUIEM: (2007). The premise is mysterious at the beginning, one night at 4:27 A.M. strange blue beams appear on the City of Los Angeles. It is the first initial of the extraterrestrial invasion. The storyline only follows one point of view (just like CLOVERFIELD, 2008), the movie focuses on a group of certain people and what happens next to them. They are Eric Balfour, Scottie Thompson, Donald Faison, David Zayas and others. There is a scene that I think it is a rip-off from WAR OF THE WORLDS (2005), when Terry meets a stranger and the alien is sneaking around to hunt them furtively with its long and creepy tentacles. The last thing I can say, The Sky is wreck and The Line is flat. Approaching the end of the movie, the story-telling is getting more and more poignantly absurd. For example (Spoiler Alert!), the octopus look-alike alien which could chase and destroy jet aircraft and even sophisticated Stealth fighter jet, can be defeated by bare-hand and an axe. Strause brothers are really getting on my nerves, while they underestimate our intelligence with their absurd story. There are several of them. However there is something that maybe you wont realize. Everyone and most critics thought that thiz movie was a monstrous failure, but what you did not realize that thiz movie made with budget of ONLY $10 million (estimated). To be certain, they made up some real money here. The tagline on thiz movie is: Do not look up, well, do not even look at the film itself. Next time if aliens invade the theaters like thiz again, I would rather go home and sleep on my bed. Do not waste 92 minutes of your life.",
      "total_reactions": 4,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2011
      },
      "score": 2,
      "text": "The worst movie of the year. I have nothing positive to comment on this movie except for the CGI. the cast is horrible with stone cold acting, running around the penthouse for an hour devoured by aliens. The story is uninspired with a preposterous ending. This is a movie that has lost its way to the direct-to-home video pile.",
      "total_reactions": 3,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2011
      },
      "score": 4,
      "text": "The first 30-40 min of the movie held my interest and I thought it was going to something special, but the ending, with its Matrix style of the aliens need the humans for food/energy thing, really throw me off. Writers had 3/4 of a movie, and just winged it from there.",
      "total_reactions": 2,
      "user": "phillyjeff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2011
      },
      "score": 3,
      "text": "The effects were surprisingly good for such a low budget film... But apart from that don't expect much from this film. It feels as if you were watching a bad tv show most of the time. Bad script, bad production, bad actors...",
      "total_reactions": 1,
      "user": "Pier"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 3,
      "text": "this movie wasn't that horrible ; it was horrible but it wasn't that horrible. While i was watching this movie i wanting i was expected more. I hope they don't make a part two.  One of the worst movie of the year. I would suggest anybody to go see this movie. They did an okay job directing this movie. This movie had an awful screenplay. It only going get worst. Please don't make a sequel to this movie. I give this movie an extra point because they did a fine job directing this movie shooting this movie in the director apt complex. nice job with the special effect.",
      "total_reactions": 1,
      "user": "iamtrent424"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 3,
      "text": "As far as the suspense goes, it leads you to nowhere. Too many War of the Worlds references are included too. It has also the weirdest, silliest ending which is more, well, weird and silly than you imagine.",
      "total_reactions": 1,
      "user": "consumer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 3,
      "text": "Take District 9 and Cloverfield, minus the character development, acting, plot, and drama, and you get this. It was pretty terribad- but I like a cheesy movie here and there. The problem with this is that it takes itself too seriously. When I think of how this came to be I imagine someone made some cool looking monsters, and said, 'hey, lets use these for...something..\"",
      "total_reactions": 1,
      "user": "kammi666"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 0,
      "text": "This movie took about two hours of my life that I can never get back. Though the first scene of the movie is intriguing the movie quickly derails into a morass of hiding in a penthouse, being squashed by aliens, being sucked up into the sky by aliens, and a final scene that leaves the movie watcher wanting to throw a rotten tomato at the screen in disgust. The acting was marginal at best (the script gave them nothing to work with) and the CGI seemed absurd. All in all I would call this the worst movie I saw in all of 2010. STAY AWAY!",
      "total_reactions": 1,
      "user": "FiestaBob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 1,
      "text": "Honestly one of the worst films I have ever seen. The plot is boring and the actors are atrocious. The film relied on special effects to much. The ending was so frustrating because it should off finished 10 minutes before it did and it didn't fit in at all with the rest of the film. They set it up for a sequel which will probably be as horrific as this one. Please save your money and don't see this.",
      "total_reactions": 1,
      "user": "cmaden12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 3,
      "text": "Just saw this movie on dvd and i thought it would be better than that. In reallity, its crap. The effects of the  movie  looked really nice but the overall scenes were dull and poorly done. It was hard for me to care abbout the  characters  in any way and  their stories were cliched from every B movie on the market. Giant ships and monsters were cool  to look at but brought no life to the film. Then that \"surprise ending\" was awful. Im all for films that just want to entertain, but this one doesn't.",
      "total_reactions": 1,
      "user": "Libra85"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 3,
      "text": "Skyline...when you first watch the trailer you think, well hey this might be a good sci-fi movie..right? WRONG, bad actors, cheesy, horrible effects, idea is nothing new, feels like a knockoff of War of the Worlds or something. Didnt keep me guessing whats next, didnt hold my full attention it was just another sci-fi movie that people will forget exists in a year or less.",
      "total_reactions": 1,
      "user": "MrRiggs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2011
      },
      "score": 2,
      "text": "Given that this had zero positive critic review I don't know why I watched this.  Now I wished I hadn't. It was terrible.  First, you have to sit through about 20 minutes of incredibly corny dialogue.  The rest of the movie was just as bad with bad acting and a terrible screenplay.  It even had that cliched  guy yelling \"nooooooooo\" in slow motion.   How do movies like this get made?  Worse yet, it had a stupid ending that implied that a sequel is coming  Noooooooo.",
      "total_reactions": 1,
      "user": "bikeman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "I only have one question? How did this film ever get made!!! This movie was trying way to hard to be cool and just didn't get the job done. Skyline, you get an F for FAIL!!!!!",
      "total_reactions": 1,
      "user": "MrC3030"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2011
      },
      "score": 2,
      "text": "This is a perfect example of when a film's visual effects far outpace the screenplay.  The DVD container emphasizes in large font that the visual effects are from the same guys who worked on Avatar, Iron Man 2, and 300!  What the container does not say is that the screenwriters from those films did not work on Skyline.  Aliens descend from the sky and everything which occurs afterwards, the audience sees from the perspective of a particular group of people trapped in a Los Angeles penthouse.  Why this group?  Aliens are everywhere and we have to see the events through the eyes of people we cannot stand?  The characters are one-dimensional and very obnoxious for most of the time.  Why did they waste what must have been an enormous visual effects budget on a story which appears to still be in draft form?  Did the producers feel the story in Avatar or District 9 was too complicated?  Stay away from this movie!",
      "total_reactions": 1,
      "user": "CitizenCharlie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2011
      },
      "score": 4,
      "text": "The movie had potential.  I liked how they attempted to portray events from purely the characters perspective.  I agree there were a lot of random scenes that were quite pointless to what little story there was.  The attempts at character background were somewhat shoddy, but not altogether terrible.  The CGI depicted the action and certainly drew you into the show.  I think how the characters responded to the crisis and invasion was not portrayed realistically.  I know I would have been going door to door in all the apartments looking for weapons or something useful to defend myself.  They just stayed in that one apartment the WHOLE time.  I would have ventured out at night to try and escape to the sea or at least tried to improve my situation as much as I could.  The fact that the aliens were practically impervious to all of the attempts to destroy them quite frankly was retarded.  It certainly promoted a somber depressing theme and frustrated me.  I would've liked to have seen the few uprisings and military attacks to have made some sort of impact on the aliens.  On that note I found it surprising that these aliens with all their technology were thwarted by shades or a simple kitchen counter in their attempts to locate humans.  I mean come on, if you can rebuild an entire spacecraft in a few hours after being nuked, but you can see past some shades?  What was the point for these aliens to invade anyway?  They needed brains to run their biomechanical creations?  That's pretty lame.  That's about 7 billion brains....I think those ships would have to be a little bigger and that it would take a lot longer to clean out L.A. then a few days.  I guess the brains, for the most part, lost their individuality and independence once they were transferred to their new hosts/bodies in a sort of \"borg\" like fashion.  That does not help this already handicapped movie in anyway. I think we all like movies to have some sort of closure, and that attempts to end movies without ending them only frustrate viewers and demonstrates a lack of creativity or ability to put together a cohesive story.  These \"endings\" make me think that the writers/producers could only come up with a bunch of noncontiguous scenes that they thought would be really \"cool\" to create, but then when they've created them they don't know how to connect them. That is my very long rant on a not so terrible B movie that had its moments in bringing me into the movie, but for the most part left me high and dry in terms realistic portrayal, lack of cohesive story, and fundamentally flawed ending on all points.  But hey the nuking of that alien mothership was pretty sweet.   I just need to remember not to lock myself in an apartment next time there is an alien invasion.",
      "total_reactions": 1,
      "user": "powderpoika"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2011
      },
      "score": 2,
      "text": "Some of the worst acting ive ever seen Jared \"JRock\" is the biggest tool alive. This was probably the worst movie ive ever seen! Extremely predictable and makes no sense. Im mad i wasred 480 Microsoft points on this turd of a movie! The acting is so unnatural like a bad SciFi channel movie. Dont waste your time!!",
      "total_reactions": 1,
      "user": "ManicHispanic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2011
      },
      "score": 1,
      "text": "Passable special effects for the movie's budget is the only thing going for this failure at storytelling.  Characters have little to do with what's going on around them and stand around like props waiting to be struck from the set by CGI tentacles.  I found myself vaguely interested by the invasion strategy: using light to lure victims into arms reach, but eventually decided it was a little redundant since the aliens are perfectly capable of getting to you and there's not much of a human defense against them.  My next bug-a-boo in movies of this genre is a poorly crafted rationale for the protagonist's ability to fight back.  I'm lead to assume Jarrod (Eric Balfour) is so somehow special by sheer virtue of his good looks and...neat tattoos because he got super-powers instead of being brainwashed by the alien lure AND was able to transfer his consciousness into one of the alien husks after being 'harvested.'  At it's best Skyline is a portfolio for FX on a shoestring budget, at worst, a 94 minute time sink.",
      "total_reactions": 1,
      "user": "cyanlianas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2011
      },
      "score": 0,
      "text": "Skyline is the absolute worst movie I have seen in theaters. This piece of crap has a horrible plot, corny diologue and Horrific acting. I would not recommend this horrible movie to anyone, just aweful.",
      "total_reactions": 1,
      "user": "Jcrank42210"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2011
      },
      "score": 0,
      "text": "How could people like this crap? I never heard of this movie until just a few days ago. A friend of mine told me about it and he thought it was terrible, but I checked it out anyway because I am a huge SciFi fan. After watching this, I wanted to shoot myself! What a piece of s**t! Every aspect of the movie was so freaking stupid. Hell, I'd rather watch Battlefield Earth than watch this mess again. Jesus, what a waste of my time!",
      "total_reactions": 1,
      "user": "SciFiFan89"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2011
      },
      "score": 1,
      "text": "This movie is so over the garbage, the actors really dint even felt that they were acting,looking like dorks that never did a movie. The sci fi  aliens looked more  like the 80's clay monsters, the end of the movie really made me laugh, plain horrible .",
      "total_reactions": 1,
      "user": "Watermelon789"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2011
      },
      "score": 4,
      "text": "skyline our first encounter our last stand dont look up thats right dont even look up at the screen this movie sucks  very boring story thats never explained propaly too short bad acting the effects are very good that is  the only thing good about this movie brothers strause make a decent movie your effects are good but your story telling sucks",
      "total_reactions": 1,
      "user": "mathew071294"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2011
      },
      "score": 0,
      "text": "HORABLE!! Absolutely horrible endingâ",
      "total_reactions": 1,
      "user": "Ebolinux"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2011
      },
      "score": 0,
      "text": "Pretty retarded,bad story line and the alien crap and copied War of Worlds.The alien ships had bad design and the \"burning light\" crap was a horrible concept of the also horrible movie.",
      "total_reactions": 1,
      "user": "RetroBlake"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2011
      },
      "score": 0,
      "text": "Boring. Amateurish. And miles away from being frightening except maybe how frightening the acting was. It shows that all the budget went to the spaceships and nothing else. There's really not much more to say except that it was a waste of time really.",
      "total_reactions": 1,
      "user": "AVCITY"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2011
      },
      "score": 3,
      "text": "Very disappointing, after seeing the trailers i thought this could be great, i should have listened to the critics though! Great CGI effects, bad script, bad acting, bad ending.",
      "total_reactions": 1,
      "user": "paulyh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2011
      },
      "score": 0,
      "text": "Finally a movie that sucks more than Battlefield: Earth.  This was one of the worst movies I have ever seen and I mean ever.  There was nothing good about this movie, the plot was horrid, the camera work was poo, and the acting was horrid as well.  I kept watching, hoping it was going to get better, but it didn't.",
      "total_reactions": 1,
      "user": "Odinra"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2010
      },
      "score": 5,
      "text": "Random, boring at times, poor casting, and poor screenplay. Basically it was just special effects that made the movie even bearable until the end. The ending if anything was the only thing to actually grab my attention. The movie does not deserve a '1' nor does it deserve anything higher than a '5'. If they had played the movie out like it was in the end from the beginning it may have been good...Somewhat 'District 9'-ish with 'War Of The Worlds'.",
      "total_reactions": 9,
      "user": "MrCreativename"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "I cannot figure out how this movie made it to the big screen.  Could have fooled me if you told me this was a  high school project.  Terrible movie, weak 1st grade plot, cheesy awful dialogue and acting, and fake artificial special effects I could have done better with any movie making app on my computer.  I regret not walking out of the theater within the first 20 minutes like I was about to but stayed out of sheer curiosity to see how bad it could be and laugh at how bad it was.  I pray that God guides all the people involved with putting this atrocity in front of audiences to retire from the entertainment business and maybe try the fast-food industry.",
      "total_reactions": 3,
      "user": "Critic77"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2010
      },
      "score": 2,
      "text": "Skyline borrowed heavily from Cloverfield but added some twisted elements of its own that is plausable if executed right. Unfortunately, directors Collin/Greg Strause's (Aliens vs Predator) misunderstanding of the plot lead to an excruciating hour and a half of watching blue lights and funny looking aliens. Adding to the bad side of the movie came the dialogue. Laughable yet not funny at all, first time writer Joshua Cordes did an amazing job of trying to earn himself a Razzie award for Worst Screenplay. I can't say anything about the cast because apocalypse movies' cast is always the unknowns and are usually bad. But given all the negatives, I think the visual and CGI effects are a bit wonderful. With everything else aside, this is one of the better effects of the year. With admirable visual effects and CGI, Skyline still failed to deliver a good storyline and solid dialogue.",
      "total_reactions": 3,
      "user": "OscarPicks2010"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "Worst movie I have seen in ten years.The only reason I didn't walk out was that my wife fell asleep 20 minutes into it and I didn't want to wake her up.  I won't spoil the ending for anyone foolish enough to go see this piece of crud, but it was one of the worst endings to a film I have ever seen, if not the worst.  It was like someone came along and surgiclly removed anything that could have been considered plot, and replaced it with pointless filler.  Also, the acting and directing were on a junior high school level.",
      "total_reactions": 5,
      "user": "Bart"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "Stank .. don't even waste your time watching it for \"free\" when it gets released to broadcast in 6 months... I want my money back!  Hmm I got to come up with 150 characters for this review! What can you say! Its a greedy nasty Corporate Hollywood rip off! Did not even come close to the promise of the trailer! Should have read a few reviews before I wasted my money!",
      "total_reactions": 6,
      "user": "KimLpersonal"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2010
      },
      "score": 1,
      "text": "No need for a spoiler warnings because you've seen it all before in much, MUCH better movies.  Incoherent and illogical don't begin to describe the \"plot.\"  The special effects that supposedly make this dreck watchable were cutting edge in 1985 -- seriously.",
      "total_reactions": 4,
      "user": "AXGinLA"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2010
      },
      "score": 3,
      "text": "Without a doubt the worst movie I've seen this year. It's difficult to get an alien apocalypse movie wrong honestly, you just need some cool aliens, combat scenes and explosions, plus a little bit of drama wouldn't go amiss either. This movie is avoid of everything but the first point and the lack of budget is obvious, with limited variety in the alien types and special effects. The actors are universally poor, as is the sorry excuse for a script. The entire first 30 minutes of the movie are completely redundant and each character might as well be a cardboard cutout with one defining characteristic each. It is impossible to feel anything for these people when the acting is two dimensional and the script doesn't deliver a single line of good dialogue the entire time. The characters don't go anywhere, which is appropriate considering the movie doesn't either. This horrendous thing would not be out of place in the line-up of SyFy Original Movies, though it would do said line-up a disservice (consider that for a moment). This movie makes Independence Day look like the greatest science fiction work ever created. Don't lookup.",
      "total_reactions": 4,
      "user": "TotalBiscuit"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2010
      },
      "score": 3,
      "text": "Nothing special here, there isnt anything in this movie I havent already seen in alien invasion movies. The acting is below average and some of the characters can get a bit annoying at times. Judging from the reactions throughout the theatre most of the other audience members felt the same way. You can go see this movie if you want to but dont complain when you realized you just wasted 10 bucks on garbage.",
      "total_reactions": 4,
      "user": "fedorp4p"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "Let's see. Let's take a hit like Independence Day, mix it with some really bad scifi from \"movies\" like District 9 and War of The Worlds (Tom Cruise edition), throw in just a twist from Paranormal Activity and we'll give it a myseterious name with a great trailer. Don't fall for it. Biggest waste of money I've spent on a movie in recent memory.",
      "total_reactions": 4,
      "user": "RobertRyanson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2010
      },
      "score": 1,
      "text": "In the Sparks song \"Cool Places\"(an ode to Los Angeles), which featured Jane Wiedlin on vocals, Ron Mael and the ex-Go-Go's bassist sang about going to these cool places and never wanting to \"cool down, cool down, cool, cool, cool.\" After all, Los Angeles is a town unlike any other. It's not Ontario, that's for sure. Concerning these places, the refrain \"I wanna go\" becomes a sentiment that moviegoers can relate with. \"Skyline\" is not Bruce McDonald's \"Pontypool\", the great 2009 Canadian indie whose action, brain-eating action, was also confined to one set. That zombie film had characters, especially Grant Mazzy, the disc jockey played by Stephen McHattie. \"Skyline\" has zombies all right, but they're not the aliens with an appetite for grey matter; they're the actors, all of whom deliver performances that rival porno ones. We root for these boring people to escape the confinements of Terry's high-rise apartment, because the cabin fever is mutual. We stare longingly at the theater exits. We could have stayed home and watched this sort of bargain basement sci-fi on basic cable. \"Skyline\" is not a wide release-caliber film. Jamal(Eric Balfour), new to L.A., along with his girlfriend Elaine(Scottie Thompson), starts the ball rolling when he proposes the idea of going to a relatively cool place: the marina, where the boats are, where he believes the aliens aren't. The aliens hate water, he theorizes, so they mobilize: five people, two cars, but before \"Skyline\" has a chance to get into gear, the car of adulterers(Terry and Denise, played by Donald Faizon and Crystal Reed) is demolished by an alien, just as it emerges from the parking garage. No road trip; no cool places, even relatively cool ones like the marina, because \"Skyline\" doesn't have the budget for a full-fledged escape from Los Angeles. Whereas \"Pontypool\" evoked the 1938 radio broadcast of H.G. Wells' \"War of the Worlds\" by insinuating the action via audio, \"Skyline\" projects its invasion on a flat-screen television, as a result of the link-up between the telescope and the monitor. Both films re-imagine a scenario in which the Mercury Theater's rendering of the alien invasion, narrated by Orson Welles, was real. Appropriately enough, \"Pontypool\" had a captivating voice to convey the attack, while \"Skyline\" lets the action speak for itself, fodder for the screen, as the US military's fight with the enemy gets translated into visuals, turning the speaking-challenged actors into an auxiliary audience. Ultimately, Jamal does end up in a cool place(climate-wise), the alien spacecraft, along with his pregnant girlfriend, once these discriminating extra-terrestrials get their fill of brains, metropolitan brains(L.A. and New York) exclusively, according to the time-log: no Bible Belt brains, no Dustbowl brains, no Appalachian Mountain brains are not good eatin' by these otherworldly creatures' lofty standards. \"Skyline\" ends with a \"minimum of chit-chat\", as Jamal, whose consciousness now survives in an alien body, makes human contact with Elaine through touch, like some dystopian version of \"E.T.: The Extra-Terrestrial\". Just when things finally, FINALLY, gets remotely interesting(staving off a zero rating), \"Skyline\" ends, strangely enough, on a high note.",
      "total_reactions": 2,
      "user": "Shiira"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2010
      },
      "score": 1,
      "text": "This movie gets one point for the special effects. The rest of the movie sucks. The whole movie nearly takes place inside the apt building where mysterious lights land and end up being an alien race on a brain eating agenda .. the movie never changes scenes except for the end and a point where the people try to escape....there is no story actually but a moral of you should not pay movie ticket price for this crap",
      "total_reactions": 2,
      "user": "SAMF2000"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "Without doubt one of the worst films I have ever seen. WHO decided this should be made?  Film is full of effects, no actual story and all set in a bloody apartment building, and the ending is actually beyond the ridiculous.",
      "total_reactions": 2,
      "user": "Flamesuitready"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2011
      },
      "score": 0,
      "text": "They should have picked up the unmanned vehicle clash scene and they messed it up. I didn't hate it because of the actors (who can't act if their lives were on the line), I hated it because they did the military intervention so terribly. Whoever says it was like starcraft is STUPID. Waste of money and a definite waste of time it was. Battle: Los Angeles is the movie to see. At least they got it right.",
      "total_reactions": 2,
      "user": "manbearpig"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 0,
      "text": "Unwatchable BS. No storyline. No plot. Cheesy, schmultzy just plain bad. Can't help but feel sorry for he actors. DO NOT WATCH! As Boring As Staring At a White Wall. Can't call this rubbish Sci-fi. It's too insulting to the genre.",
      "total_reactions": 2,
      "user": "Sabrinna"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2010
      },
      "score": 4,
      "text": "Pretty boring at times. Almost dozed off at one point. Disappointing over all. As exciting as the trailers for this film looked I definitely wish I had waited for it to hit Pay Per View at home.",
      "total_reactions": 2,
      "user": "Morg87"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "This is the worst movie in history. Other than the last airbender.  Between bad actors and even worse filming. This movie will go down in history as how to perform cinematic suicide.",
      "total_reactions": 2,
      "user": "Puffinparoxysm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "THIS MOVIE IS THE WORST MOVIE I HAVE EVER SEEN....HANDS DOWN.  I HAVE SEEN BETTER ON THE SY-FY CHANNEL.  I WOULD BE ASHAMED TO BE ASSOCIATED WITH THE FILM AS AN ACTOR, DIRECTOR AND MORE SPECIFICALLY WRITER.  SPECIAL EFFECTS DON'T MAKE A MOVIE - A STORY LINE WOULD BE HELPFUL - THIS ONE SUCKED.",
      "total_reactions": 2,
      "user": "wnh7"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "This is most definitely the worst movie I have ever seen. No depth of characters, little background, most of the movie is set in an apartment with scared people quivering for their life.",
      "total_reactions": 2,
      "user": "greoryg"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2010
      },
      "score": 5,
      "text": "waited, but not worth it...nothing else to say",
      "total_reactions": 2,
      "user": "ClemRusty"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2010
      },
      "score": 2,
      "text": "Where do I begin? This film is sloppy. Shoddy camera work, uneeded glares, and a plot so full of holes that is resembles Swiss cheese that has be attacked by a cat. Our characters are barely there, both in an acting sense and in characterization, you could have put some cardboard cut outs in their place for most of the movie. This movie wants to be a summer blockbuster, but just can stand up to the big boys. The effects are passible on some accounts, but when a movie that focuses on its effects is this weak it is time to find another occupation. It is good to look at for a minute, but don't look to hard-you'll see the cracks...",
      "total_reactions": 2,
      "user": "Rumblebeelove"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "I must have seen a different film from the rest of you.  I loved it!  Spectacular special effects and a story that keeps moving.  I loved that they didn't try to give us the feel-good \"Independace Day\" ending.  Sort of a cross between \"Cloverfield\" (without the shaky camerawork) and \"War of the Worlds\".  It is an alien invasion movie (that the plot folks) and it delivered even more than I expected. I will recommend it to all my sci-fi fans and will see it again soon.  I really thought it was a very good movie!!!",
      "total_reactions": 9,
      "user": "Slick1"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "This movie was, by far, one of the biggest pieces of crap that has ever been released.  There was absolutely no plot.  There was no storyline to follow, and the ending was, without a doubt, the worse.  My husband and I have no clue what we just saw, or why this movie was even made,  Horrible.  I was seriously tempted to ask for a Manager and request a refund.  Actually, they should have paid us to sit there and watch this piece of dung.",
      "total_reactions": 5,
      "user": "DebsGiz"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "No plot, no character development, poor acting. Even the special effects were nothing groundbreaking. Seriously, save your money. Worst movie I have seen in 2010.",
      "total_reactions": 5,
      "user": "rangitamoe"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "The tag-line for this film should be... Got ten dollars and 2 hours of your life to waste? Then come on in. Man I don't know what they were smoking when they made this movie but I hope it ended their screen writing career.",
      "total_reactions": 5,
      "user": "JonathanRN"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2010
      },
      "score": 1,
      "text": "I'm a huge sci-fi fan, but this movie left me with a feeling of emptiness. No storyline progression at all. A+ for special effects, but even the massive special FX budget couldn't make up for the horrible casting/acting. The end of the movie had me laughing. Such a waste of money - on all sides.",
      "total_reactions": 5,
      "user": "jrcowher"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "I cannot fathom the fact that the advertisements basically describe a different movie than I seen in the theaters. How is that legal? I was so excited for the movie that it makes me sick that I waisted the money for a movie night on this piece of crap. So here goes, I will never invest in another \"Brothers Strauss\" movie again. I also think that Universal needs to be addressed. Since when did they find it right to invest in crap. Not since \"M Night Shamalala's The Happening\" has a movie disapointed so much. I will never invest in his crap again either. Good luck Brothers Strauss in your endeavors, At least you wont fool me or anyone else I know again. This movie should of been call \"Crapline\".",
      "total_reactions": 5,
      "user": "PennellUSA"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2010
      },
      "score": 1,
      "text": "I'm not going to spend too much time on this review because this film has already taken too much time from my life. Needless to say, this is one of the worst films I've ever seen. It is a clear case of a studio \"taking the piss\". The story is weak/non-existent, the screenplay pedantic - like \"Machete\" (though I don't think it's intended), the directing and acting is third rate, and the action boring (my wife fell asleep). Even some of the special effects are reminiscent of 1950s sci-fi. Be prepared to see miniature B2 bombers flopping around the screen like butterflies in the wind. They spent $500k filming this and the rest of a low budget on special effects (some of which were adequate). In any case, I'll be boycotting Universal Pictures for a few months, as well as the producers/directors (Colin and Greg Strause) and writers (Joshua Cordes and Liam O'Donnell) permanently. I don't know why Scottie Thompson would let herself be associated with this mess.",
      "total_reactions": 8,
      "user": "donnelbr"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2010
      },
      "score": 7,
      "text": "I would rank it a 6.5 out of 10, but upped it to a 7. I hated AVP:R, and went in expecting to rip this one to shreds. Surprise surprise it is actually a solid B-movie.  Will not win any awards, but i do not think it pretends to be anything it is not.  Does not deserve the critical thrashing it is receiving. Entertaining 90 minutes at the theatre.",
      "total_reactions": 6,
      "user": "Cilliandrew"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Let me start with a big question mark (?)@ bad reviews, I don't know if it was the same movie, but the one I have seen is a great movie.",
      "total_reactions": 6,
      "user": "Constantin"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2010
      },
      "score": 1,
      "text": "Almost the whole first trailer was absent from the movie. They never addressed NASA sending out a communication like in the trailer and the press reporting on it. That trailer had me very excited and I got a different movie in the theater. What a waste of money and time.",
      "total_reactions": 6,
      "user": "fbicking"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2010
      },
      "score": 4,
      "text": "Nothing was really appealing about this movie other than one scene where a ferrari gets crushed by a giant alien foot. Other than that this movie was disgusting, lame, and it had horrible acting and pointless scenes which all end up worth nothing. Don't go see this movie.",
      "total_reactions": 3,
      "user": "lukesnook"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2010
      },
      "score": 2,
      "text": "Watching most of the movie, I was thinking they got many things right. Much better than cloverfield, which left me sick. I kept expecting the second half of the movie to pay off. It didn't. [spoilers now] Nuking the ship - it killed them! (I was thinking this is the first alien that ever died to a nuke.) but it was just a tease. The ending... for a big budget movie, I would have sworn the studio forced them to add that worthless ending. As it is, it took a low key movie that I might have rated a 5, and lowered it to a 2.",
      "total_reactions": 3,
      "user": "Quiet"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2010
      },
      "score": 1,
      "text": "When I watch this trailer,it was so awesome that I would like to see this movie and before when I saw this movie,it's so retarded that this movie is a joke that couldn't been done with the special effects and the plot is so unexplainable. Skyline is a retarded movie that they have lots of cliches and ripping off into War of the Worlds and Independence Day that it mixed together for a crappy b-movie. The effects are so much blue that even they offer special effects that it belong to James Cameron. The characters are complete joke that is so lame that each character has saying a lot of cliches and a bad dialogue. The story is so untold that they couldn't explain what aliens are come from and why they need the brain to control them? At the end is very dumb that it look like a video game of Gears of War and the action scenes that again rips off into Transformers and it sucks the movie so bad it's completely RIPS OFF!!! Please don't watch this movie and it's bad that you saw this cool trailer like The Last Airbender is,you'll be screwed to get your money back.",
      "total_reactions": 4,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2010
      },
      "score": 6,
      "text": "If you ara looking for deep storyline or brilliant actors' play, thats not movie for you. But if you like aliens, spaceships and survival stories (and you liked Cloverfield), this movie is not bad at all.",
      "total_reactions": 4,
      "user": "Ghua"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2010
      },
      "score": 3,
      "text": "I went to Skyline with very low expectations, and it didn't even meet that low standard.  I expected a predictable storyline and so-so acting, and the movie delivered there.  However, I also expected top-notch special effects, but it just never delivered.  Also, violating basic laws of physics in a movie is rarely a good idea.",
      "total_reactions": 4,
      "user": "salehigal"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2010
      },
      "score": 7,
      "text": "I give this movie a 7 based on its potential.",
      "total_reactions": 4,
      "user": "nondancer"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Great movie.",
      "total_reactions": 4,
      "user": "eumesmo007"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "Definately don't think it deserves the critical trashing at all. There's not much there folks...but a bunch of rehashed cool stuff. aliens from outerspace, and scared humans. Don't get your expectations up, just enjoy it. Its good B movie entertainment, and it makes sense as such. As a matter of fact who cares anyway because I think this film goes with the punches in the way that they say there is no such thing as bad ink. Its all publicity and in this case good or bad is all good, because who gives a crap about taking the time to even think about this movie. its not made to be thought through like it was trying to pass itself off as something great in the first place. it is what it is. A LOT A PEOPLES ENTERTAINMENT FA DA DAY.",
      "total_reactions": 5,
      "user": "albuckman"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "Loved it! I went hoping it wouldn't be as bad as most of the reviews are saying but now I wonder if  they actually saw it, great movie awesome effects very creepy.",
      "total_reactions": 5,
      "user": "markflagaz"
    },
    {
      "neg_reactions": 21,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "This movie was so good. I really loved the references to Starcraft II. You guys are all haters this movie was a classic, I can't wait for the blu-ray so I can watch it at home every day.",
      "total_reactions": 24,
      "user": "JSau"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "Cannot for the life of me understand any negative comments about this movie - it is FANTASTIC.  I think all the groaners have become too spoilt by many movies and can't appreciate true quality when they see it!  This was gripping from several minutes into the film to the end, great story with unexpected twist, fantastic effects and very convincing.  Saw one groaner complaining how he laughed when the movie suggested the penthouse apartment as the 'only safe place'.  Well, no sci-fi movie is totally believable, is it?  And the penthouse certainly did NOT stay the 'safest place' as the movie progressed.  I foujnd it totally believable - and top quality.",
      "total_reactions": 8,
      "user": "Moongold"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2010
      },
      "score": 6,
      "text": "Relatively ambitious, the casting while not superb seemed to suit the style of the film. Was boring at times but I generally enjoyed it throughout and will definitely rewatch it. If you are after some quality acting and drama then don't look here but for some thrills and spills combined with some pretty cool looking alien tech (not dissimilar to those seen in Crysis), look here. I recommend you give it a rent.",
      "total_reactions": 2,
      "user": "fangaas"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "im suprised ... from all the negitive reviews i thought this movie was gona be a real stinker. i actaully thought it was a pretty decent movie and im a pretty harsh critic . maybe cause i went in waching it thinking it was gona be crap and had my expectations very low it didnt leave me with any hype it was going to be good. i thought the special effects where fairly decent . the acting i thought was ok . i kept hearing how terrable it was . i was expecting acting as bad as The last Air bender where i was just cringing every time any of thoose kids opened there mouth . the action was pretty good and i was entertained through it had some pretty good suspense once it took off . about my biggest gripe was the ending . its a pretty much lets get ready for the sequel thing . which im not sure how well this movie did at the box office to know if there will even be one . granted its not a great SCI-Fi movie but its still a good one i thought. hell id wach it again.",
      "total_reactions": 1,
      "user": "ArkonBlade"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2010
      },
      "score": 6,
      "text": "Would have been a better movie if it gave us characters anyone cared about. Everyone that appears, even the 2 mains have very limited background and almost no personality. Add to that the fact that they're well off and live lavish lifestyles, it pretty much guarantees nobody will give a damn. Also, the ending sucked. It's become popular in films to do the whole make it seem like all is lost and then spring the twist that leads to victory. Unfortunately, the twist (which you can see coming an hour in advance) comes so far past the point of no return that humanity has no logical future. Finally, all the cliches from war of the worlds are there on display, from limb hacked off with fire axe to waiting for the flash to die down to see if the nuke worked.",
      "total_reactions": 5,
      "user": "Gene"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2010
      },
      "score": 6,
      "text": "Highly derivative film with unlikeable characters, a weak script, reminiscent of superior films...but decent in a B-movie, trashy kinda way with good sfx .",
      "total_reactions": 4,
      "user": "grindhouse83"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "It seems from all the reviews that a lot of people just hated this movie.  I think that if I saw it in theaters, I would like it a lot less as well.  The problem is mainly that it's a bit slow to get going because they start with the main action of the movie, then it morphs into the opening title credit, and then the story goes back in time to introduce the characters.  Then...the scene is a repeat of what you saw before the credits.  When that happened I thought \"whaaaaat?\" shut it off and made a sandwich.",
      "total_reactions": 1,
      "user": "likes2sing"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2010
      },
      "score": 5,
      "text": "I think EW and Empire got it spot on. The other critics pan it because smart intellectual reviewers surely cannot cannot be seen to like a mindless alien action flick. I don't mind my movies just for pure mindless escapism which had some satisfying alien shooting scenes. This movie is watchable for what it is and not as bad as some of the critics make it to be. Definitely worth a 5 or borderline 6. I would watch the sequel if they made it!",
      "total_reactions": 3,
      "user": "busternuck"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2011
      },
      "score": 7,
      "text": "Special effects are awesome...and I mean really awesome. This movie could have been an incredible blockbuster...if...the characters would have been developed and if the dialogue would have been more meaningful. Great effort though...",
      "total_reactions": 7,
      "user": "Nazgulero"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "there are bits in the movie which are quite entertaining but overall its ok. performances from the cast arent entirely believable and can seem a bit shaky at times. also the storyline feels like one we have seen before and can be somewhat predictable.",
      "total_reactions": 1,
      "user": "big-bad-bear"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Awesome movie!",
      "total_reactions": 3,
      "user": "R6ex"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Skyline was ridiculous. The acting was hilarious. The aliens looked cool. The ending was a shocker, but not in a good way. This belongs in the sci-fi channel.",
      "total_reactions": 2,
      "user": "rayray"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "I know this film got terrible reviews, but when I saw it I thought it was very good, it had some action in, had a few laughs too and the ending was a little confusing but interesting",
      "total_reactions": 3,
      "user": "AWarGuy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "This is a brilliant attempt at the sci fi genre. the story was nice and believable. there are no major actors in this one but they do their part well. the CGI aliens are well don. the directors definitely took different steps to what you are used to. there is no average joe turning into a superhero and doing all sort of risky, unbeliebale stuff. it's just 5 people trapped and trying to make it alive as the military being overwhelmed and outdone by the aliens technology and force. You can't help wonder throughout the movie if humanity can withstand this attack. unlike Battle LA or independence day were you know that eventually manking will prevail, skyline keeps you guessing which is a nice change. the ending is left open so am sure a sequel could be expected.",
      "total_reactions": 2,
      "user": "lethalwolf"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "I have no idea why people hate on this movie. Before it came out, big hollywood was hating on it because it was a low budget SciFi film. A critic friend of mine even told me he reviewed the movie without watching just because he heard it was bad but then I watched it on BLUERay I was wondering WHAT THE FUNK? THIS MOVIE IS AWESOME!",
      "total_reactions": 2,
      "user": "highwiredays"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "I REALLY dont get the people who are giving this movie low marks!.. I really enjoyed it,& so did the Girlfriend.To me it was kind of a cross between 'Right out your Door' & 'Cloverfield'.So if you enjoyed either of those films,chances are you'd probably enjoy this one.Thought the acting was good,interesting story,that kept me gripped,& The effects are very good also.Hope they make a sequel..",
      "total_reactions": 1,
      "user": "SpartanEdge"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "You don't see this movie for story.  You certainly don't see it to enjoy a great script.  The reason to see Skyline is the incredible art direction and slick special effects.  If you're not an effects buff or science fiction art connoisseur, go ahead and rate it low.  If you do love the art you see in things like Heavy Metal magazine, Independence Day, Alien, and so on, you'll love this.  Promise.",
      "total_reactions": 3,
      "user": "spacecaptain"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "I thought the movie was pretty darn good.  Although the acting was just okay, the special effects more than made up for it. I really enjoyed it and it doesn't deserve such a low rating. If you like scary sci-fi alien movies, you're gonna like this. Enough said.",
      "total_reactions": 1,
      "user": "MrBlueSkies"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "Once the climax of the film started, which did not take long at all, I was ecstatic and livid with the imagery,  characters, and the entire alien invasion plot. Graphics were awesome and the ending had me cheering along with the protagonists, I thought this was a great film! Surprised it got such bad ratings.",
      "total_reactions": 2,
      "user": "Got2riteareview"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "I think this movie, and all movies generally, need to be viewed in their own context. So in the example of Skyline it is a science fiction movie which plays like a B movie reminiscent from the 50s of that genre. The difference is that 1950s B sci-fi movies had cheap special effects. The special effects are pretty top notch in this film and the story is suspenseful with an easy to follow and understandable plot. We don't know who these aliens are but we do learn why they are here.",
      "total_reactions": 2,
      "user": "Gojira63"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2011
      },
      "score": 4,
      "text": "If you have ever seen the remake of â",
      "total_reactions": 0,
      "user": "SGRevan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2011
      },
      "score": 0,
      "text": "I felt bored and distraught after about 30 minutes in.  A decent synopsis Skyline had, but might just be better if it was made into a first person shooter video game.",
      "total_reactions": 0,
      "user": "PurpleUrp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "3.4? Come on, the Metascore for this film really is unfairly low. Thankfully the user ratings are slightly higher but for me, this was a highly effective, down-right scary alien invasion movie centered around the occupants of one apartment, making it was much more claustrophobic and involving than other perhaps more celebrated examples in the genre, for example 'War Of The Worlds' or 'Independence Day'  both of which are enjoyable films but Skyline just seemed more immediate & realistic. The CGI special effects and alien 'imagineering' are superb and the violence, when it came, was fast and brutal, again making the experience much more believable than big blockbuster Hollywood fare. The alien space ship interior at the end was ingenious and Donald Faison is great. He should be in more movies. Really engaging screen persona.",
      "total_reactions": 0,
      "user": "JonDoc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "Merits an average score based on what was produced with a low budget. The aliens were realistic enough so that the CGI was not obvious to spot and the action was reasonable. The story was disappointing considering the possibilities the concept of the movie opened up and the ending was ludicrous.",
      "total_reactions": 0,
      "user": "rotku"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "... the metacritic's are **** up by the people which are misusing it so much. The film is not so bad, and did not win any academy award. For a low budget film it's a very good work. I do not understand, why so much people hate this film, it deserves much better. metacritc's is going down, because some of the audience is putting **** on things.",
      "total_reactions": 0,
      "user": "Watz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 0,
      "text": "Yes it is a '0' and not worth rating at all. The worst plot with the some terrible action. It's like skipping through Independence Day but this Film is 100x worse (I like Independence Day, one of favourite movies which I would not skip through) but what the hell is this. It is good I didn't come to the Cinema to see this and it was on TV otherwise I would of been extremely pissed.",
      "total_reactions": 0,
      "user": "Chrislake94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2012
      },
      "score": 0,
      "text": "There are a lot of jokes to be made about the twilight series. However, I think now its best to laugh unintentionally at the cheesy lines than the jokes made from this movie. I mean seriously, this Friedberg-Seltzer film (this film really suck) 'expects' us to laugh. The jokes don't come off as funny and the actors aren't necessarily helping even though they're only imitating the characters from twilight. It almost feels as if every joke had a guy whacking the drum. .3/5",
      "total_reactions": 0,
      "user": "Leeway"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2011
      },
      "score": 5,
      "text": "Cut away first half of the movie and you get a good dose of entertainment, albeit unspectacular. Unfortunately you can't fast forward in cinema.",
      "total_reactions": 0,
      "user": "Tkwz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2011
      },
      "score": 2,
      "text": "Terrible acting, terrible directing, terrible story. Terrible movie! One of the worst I have ever seen! How did this movie not win all the razzies! Truly awful!",
      "total_reactions": 0,
      "user": "cabrita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2011
      },
      "score": 1,
      "text": "So um yeah, great FX, of course that's what made me want to watch it from the trailers in the first place.  But... it all goes down hill from there, high school drama club acting (minus Donald Faison who always delivers) pathetic plot that just never gets going and then drops you like a bad habit and an ending that leaves you with a nasty taste in your mouth.  I get that the Strause dudes are trying to lay the ground work for a series but I desperately wish I could take back the 94 minutes of my life I wasted.  Its drivel like this that gives the genre a bad rep.",
      "total_reactions": 0,
      "user": "phyrvurm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2011
      },
      "score": 2,
      "text": "I had to think a little bit before rating this move, was about to rate it 0 but I laughed so but so damn much that it'd be unfair being that mean! Seriously, I think it was worth the budget (yes, I dared go seeing it at cinema) since it was so hilarious I nearly wet my pants.",
      "total_reactions": 0,
      "user": "Belmsher"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2011
      },
      "score": 2,
      "text": "Well in short, I feel like I've lost 92 minutes of my life. Skyline had a good idea and failed to make it work, bad camera angles, bad acting and riddled with cliches. And to be honest, the CGI wasnt even as good as I expected. The trailer of the film promised something more than this, but I was bitterly disappointed.",
      "total_reactions": 0,
      "user": "gartside27"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "This movie serves as a perfect example of how no amount of acting or special effects can compensate for a terrible concept. I say that because just about every facet of this film is solid in terms of cinema. The acting is very good, the effects are superb, the plot develops well, decent dialogue, etc. The problem is, the foundation of the story is terrible. Aliens that are essentially indestructible and are somehow powered by human brains. Then when they are destroyed their giant blue orb of light somehow puts everything back together? I'm sorry but no amount of suspension of disbelief can get me through that sequence. Honestly, don't waste your time with it.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 4,
      "text": "Skyline was the worst reviewed movie of 2010 and not without cause. Basically it's a different version of War of The Worlds, with less of a storyline, and a ridiculous ending. The sad part of this whole thing is that the movie started out really good. After the event, I was on the edge of my seat, and then it all goes downhill from there. Eric Balfour is such a good actor, but he's constantly being cast in these subpar movies. I don't understand why nobody wants to offer him a role in a major motion picture. Once again he's very good and engaging in a movie that just crashes and burns. The special effects were cool, the acting wasn't bad, but the story stinks and the further into it you get, the more you keep asking yourself, why am I still watching this?",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "The acting was good, the visuals were excellent, the story was okay - that sums up \"Skyline\" pretty well.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "Thrilling at times, looks great, but unfourtanetly the story just doesn't expand out very far. I mean once you get to the end and you find out what the movie overall is about you'll find yourself thinking, is that it? Wanna tell me a little more about the aliens maybe? Thats the big problem here, they show me some bad ass imagery of aliens in this movie, but little explanation about them really. We learn a few things but thats about them and thats it. The movie ends having just an A story kinda teasing us with a B by not saying too much about the aliens and sticking to this decent but kinda lame story of some guy protecting his pregnant gf all the time. Good, but not great.",
      "total_reactions": 0,
      "user": "djcmusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2012
      },
      "score": 3,
      "text": "Skyline has some of the worst acting ever put on screen. The only reason why it isn't a 0 is because of the twist at the end, so it wasn't predictable. Problem the ending was so discombobulated it made my head dizzy.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "A very fictional movie and meaningless ... but it is entertaining.",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2014
      },
      "score": 2,
      "text": "Skyline is a huge disappointment of a sci-fi film as the story has no real excitement. The special effects are okay but they are overshadowed and forgotten thanks to the dull acting and premise.",
      "total_reactions": 0,
      "user": "Jack97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2012
      },
      "score": 0,
      "text": "Was this movie bad or what ? As if AVP was terrible, good grief look at what a mess this film was. The plot was basically was do what your not supposed to do and get killed for it.",
      "total_reactions": 0,
      "user": "jfrotylpe532"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 3,
      "text": "Not even the somewhat impressive special effects can sweep this movie's horrific acting and storytelling under the proverbial rug.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 1,
      "text": "There's a scene towards the end of the movie where the main character says something like this: \"What are you going to do when all the blinds fall down? It's not exactly like we have a lot more bed sheets!\" It was in the moment where I began shaking my head in complete dismay as to what the hell I was watching. The screenplay, the cast, the acting, everything was just terrible. The effects were the only thing going for this film, but even those were either blurry or hidden by bright lights. Skyline is horrible and one of the worst of 2010.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2013
      },
      "score": 2,
      "text": "It's not often that anything can negatively surprise me. This movie is all hype and no delivery. Yes there are some utterly stunning special effects, but that's it. I really can not say anything else positive about this movie.",
      "total_reactions": 0,
      "user": "Rox22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2013
      },
      "score": 1,
      "text": "\"Movie of the year', seriously. That tagline is the WORST. It should be, WORST movie of the year. Disappointing that they made this movie, it should not have been made in the first place.",
      "total_reactions": 0,
      "user": "Annoymous1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "text": "Yay, Skyline! What did I think of it, its horse crap. Nothing much to say about this movie, watch it if you want a migraine. Skyline's irrelevant story line was so appalling, I wanted to get up and leave the theater. THE MOVIE IS BULL SH**! The movie has no plot other than the fact that there are a few characters that you won't give a CRAP about just running around in circles and hiding from overly aggressive aliens. There is no plot, all you have are a couple of generic characters that can't act if their LIVES depended on it, a plot line that was possibly written by a preschooler who completed the script an crayon, an ending that is possibly promoting a sequel that NO ONE wants and dialog that you would find among 5 year olds. SKIP THIS PIECE OF DOG CRAP!",
      "total_reactions": 0,
      "user": "UtopianStuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "A sorry excuse for a film. \"Skyline\" was an abomination of a film, the acting was abismal, the camera work was terrible, the special effects were headache inflicting, the movie has no perks whatsoever. I'm capable of watching mindless popcorn flicks, but this movie wasn't even that, there is no action. The entire premise is as simple as this: a couple of people witness an alien invasion and in many failed attempts to flee their apartment building which is swarming with these generic brain craving aliens, they spend the entire movie running in circles while in hysterics. The movie is not worth a cent. No sci-fi movie goer will like this movie, neither will any other movie goer. Its one of the most terrible films I've seen in years and it should be avoided at all costs. Just don't watch this movie, stay away.",
      "total_reactions": 0,
      "user": "RecycledAir"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "Bad acting, stupid plot, a trailer that shows us the best parts of the movie and misleads us into thinking this train wreck is any good. This sucked. Ever since I see this, I compare sub-par movies to it. This is the ONLY thing that's come from seeing this movie. DO NOT WASTE YOUR TIME.",
      "total_reactions": 0,
      "user": "MichiganGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2014
      },
      "score": 2,
      "text": "I’m not going spend a huge amount of time on this one, because it came out four years ago, and honestly, it’s really not worth it. But it’s not often that I’d rate a film so low. I’ve seen a lot of films that would be easy to criticise, but I always salvage some kind of entertainment value. At the very least, you’re along for the ride. With Skyline, I can’t even say that.",
      "total_reactions": 0,
      "user": "Jack_Sunshine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2013
      },
      "score": 0,
      "text": "skyline skyline skyline why was it even made the story to this is so badly written i still want to know who thought it was a good idea to make this film, here's a spoiler for the hole film... they only leave the bloody hotel room about 90% way through the film! all the film is basically is a group of people watching the world go by into chaos and while there watching they also have freak out  moments what is just stupid all there doing is trying to survive in this one little hotel room where they had a party from last night, they try and make them self hidden from the aliens by hanging rags of blankest on the windows, yeah because they wouldn't find the only room with the windows covered suspicious, what was the budget again? $10–20 million WHAT DID THAT GO ON some fancy effects what make there eyes glow amd give them some thinker veins, a monster that kills some people that are hardly intresstin to watch and that i have no feelings for and also the ending... oh god not the ending this has the worst part of this film like most films there is a guy and girl who are together in this the guys brain like many others has been put in to these giant robot bodys and he is the only one that takes over the body you know the only one out of thousends of people, he runs to where he can here his wife or girl friend screaming then attacks the main boss like thing then it ends, im not joking or cutting any thing out thats how it goes theres no fight scene or anything to look like or show that its the end its just CUT end thats it... this was written by two people Joshua Cordes and Liam O'Donnell i guess the saying two minds are better then one doesn't work for  that cant write",
      "total_reactions": 0,
      "user": "Mr_NoFace"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "Don't get me wrong, the movie is probably one of the worst science fiction movies out there.",
      "total_reactions": 0,
      "user": "MarkT2014"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "I am so glad I didn't see this in the cinema. I loved the trailer and I thought I would to see this movie, but this is probably my least favourite movie of all time. A completely unambitious movie with terrible performances, a plotline which wasn't even worth an hour and completely unlikable caricatures of characters.",
      "total_reactions": 0,
      "user": "ChrisTaylor94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 3,
      "text": "Skyline was a very boring movie but in other opinion is very absurd sense , such as that can not win if these aliens ?, This is an insult , that causes us to demand to do some sequels , and the second stay we expected",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2016
      },
      "score": 2,
      "text": "Now here's a movie that could've easily got me scared because 'swallow' is in there, but instead, I was left off disappointed hoping something fascinating can happen and it turns out it didn't happen at all.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2016
      },
      "score": 1,
      "text": "The first time I saw Skyline was opening day in theatres, when I was ten years old. I went along with a friend to this film, who was very excited about seeing this, and I was a little excited too. Almost every 10 year old boy you would expect to love this movie. Most 10 year old's love to see cool aliens, and explosions, right? Skyline was the first time I hated a movie-going experience in my life. I did not like this movie even as a 10 year old.",
      "total_reactions": 0,
      "user": "CaillouPettis"
    }
  ]
}