{
  "avg_user_score": 7.1,
  "metascore": 58,
  "mixed_rating_frequency": 30,
  "movie_name": "Snowden",
  "negative_rating_frequency": 13,
  "positive_rating_frequency": 101,
  "pro_critic_reviews": [
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2016
      },
      "score": 100,
      "summary": "Moviegoers will love or hate Oliver Stone and his politics until the end of time. With well-made movies such as Snowden, though, his skill as a filmmaker becomes much harder for the detractors to debate."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2016
      },
      "score": 100,
      "summary": "It’s the most important and galvanizing political drama by an American filmmaker in years."
    },
    {
      "critic": "Allen Salkin",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2016
      },
      "score": 100,
      "summary": "You might not agree with Stone that the man is a hero, but you probably do want to see the film so you can compute what the whole uproar was about."
    },
    {
      "critic": "Calvin Wilson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2016
      },
      "score": 88,
      "summary": "Gordon-Levitt turns in an Oscar-worthy performance as a man who’s all too aware of what he’s letting himself in for. And Woodley skillfully balances a range of emotions as Lindsay."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2016
      },
      "score": 83,
      "summary": "Snowden has a secret weapon, and it’s one that I wasn’t expecting: a fully-engaged and on-his-game Oliver Stone."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2016
      },
      "score": 75,
      "summary": "Regardless of how they feel about the main character, most viewers are likely to leave the theater reminded of Stone’s instinctive brilliance as a filmmaker — his grasp of visual language not just to tell a story but to expose its essential emotional core."
    },
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2016
      },
      "score": 75,
      "summary": "Chilling - and very chatty. Snowden is a seriously talky film. Yet it never feels tedious, thanks to Stone's tremendous sense of story construction, the film's razor-sharp editing - and Gordon-Levitt's masterful performance."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2016
      },
      "score": 75,
      "summary": "As always, it’s a good idea to do your homework before or after seeing an Oliver Stone movie. You may come out convinced of his point of view and still feel hustled by how he got you there."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2016
      },
      "score": 75,
      "summary": "Snowden works best when it’s just Edward and the three journalists in that hotel room, sweating it out, or when we see the pattern of events that led him to commit acts that exposed the shocking practices of our own government but also quite possibly created serious security breaches."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2016
      },
      "score": 75,
      "summary": "Even with its flaws, Snowden is Stone's return to relevance, in subject and execution."
    },
    {
      "critic": "Soren Andersen",
      "publication": "The Seattle Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2016
      },
      "score": 75,
      "summary": "Gordon-Levitt carries the movie, and without flash or overt dramatics, overshadows everyone else in it."
    },
    {
      "critic": "Brian Tallerico",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2016
      },
      "score": 75,
      "summary": "Despite my issues with the structure of Snowden, there are numerous accomplished scenes and the film is carried throughout by Gordon-Levitt."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2016
      },
      "score": 70,
      "summary": "Mr. Stone has made an honorable and absorbing contribution to the imaginative record of our confusing times. He tells a story torn from slightly faded headlines, filling in some details you may have forgotten, and discreetly embellishing the record in the service of drama and suspense."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2016
      },
      "score": 70,
      "summary": "It’s a gripping movie, and Joseph Gordon-Levitt is good as Snowden (his voice alone is terrific), capturing his nerdy intelligence and passion for patriotism."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2016
      },
      "score": 70,
      "summary": "Stone seems genuinely interested in the slow and steady process by which Edward Snowden came to distrust the government that he worked for, and the director has made a slow and steady movie to go with it."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2016
      },
      "score": 67,
      "summary": "Gordon-Levitt, however, nails the part completely, physically hunching down into himself and getting Snowden’s halting, thoughtful speech patterns just right, while Stone, working with screenwriter Kieran Fitzgerald, creates a whirlwind ride nearly but not quite worthy of The Parallax View-era conspiracy thrillers."
    },
    {
      "critic": "Dominick Suzanne-Mayer",
      "publication": "Consequence of Sound",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2016
      },
      "score": 67,
      "summary": "Snowden is a film of sincere outrage, even when it strains to articulate that outrage in a less from-the-headlines manner."
    },
    {
      "critic": "Jared Mobarak",
      "publication": "The Film Stage",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2016
      },
      "score": 67,
      "summary": "Stone doesn’t care about Snowden as much as he does the ramifications of what his employers accomplished. He’s focused on the future, fearful the next person over-stepping boundaries is Donald Trump. This doesn’t make the film a resounding success, but it does make it fascinating."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2016
      },
      "score": 63,
      "summary": "For a director whose reputation is built on aggressively in-your-face subjects and styles, Snowden stands as a strangely inert outlier, a project that lacks passion although not perspective."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2016
      },
      "score": 63,
      "summary": "It's fairly absorbing though, increasingly, a bit of an eye-roller, and it's designed, photographed and edited to make you itchy with paranoia."
    },
    {
      "critic": "James Mottram",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2016
      },
      "score": 60,
      "summary": "Joseph Gordon-Levitt is credible as the former NSA contractor, but Stone gets side-tracked by his relationship with Lindsay Mills (Shailene Woodley) and Rhys Ifans’ leering CIA suit."
    },
    {
      "critic": "Jimi Famurewa",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2016
      },
      "score": 60,
      "summary": "Aided by a dialled-down Gordon-Levitt, Stone skilfully demystifies one of the Obama era’s most compelling stories. It’s a welcome return to form for a cinematic sleeping giant."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2016
      },
      "score": 60,
      "summary": "Stone is so intent on making Snowden an icon that he scrubs him of his nuances, his individuality."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2016
      },
      "score": 60,
      "summary": "For a film that’s so politically risky — Stone hasn’t named names and pointed fingers (at both sides of the aisle, incidentally) in a mainstream movie like this for years — it’s surprisingly safe aesthetically."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2016
      },
      "score": 58,
      "summary": "Laura Poitras’s Oscar-winning 2014 Snowden documentary “Citizenfour” is, almost inevitably, a stronger experience. That, too, was a species of political thriller but, unlike Stone’s film, it’s actually thrilling."
    },
    {
      "critic": "Mike D'Angelo",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2016
      },
      "score": 58,
      "summary": "A duly serious and ambitious fall movie that, despite the best efforts of its formidable director and cast, can’t remotely match the excitement of real life."
    },
    {
      "critic": "Gregory Ellwood",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2016
      },
      "score": 58,
      "summary": "As a piece of filmed entertainment Snowden is certainly a watchable endeavor, but Stone and screenwriter Kieran Fitzgerald’s script is often an odd mix of hero worship, conspiratorial thriller and cringe worthy dialogue."
    },
    {
      "critic": "Bryan Bishop",
      "publication": "The Verge",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2016
      },
      "score": 55,
      "summary": "The issues that Snowden raises are without question some of the biggest issues of our times — but a movie this safe won’t leave anybody thinking about them."
    },
    {
      "critic": "Erin Whitney",
      "publication": "ScreenCrush",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2016
      },
      "score": 50,
      "summary": "Snowden has some entertaining sequences, many of which explain the whistleblower’s story in an easily digestible narrative that doesn’t insult the audience’s intelligence or think too highly of itself. But the final moments are a mess; Stone isn’t interested in showing us the real version of the man, only his glorified version."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2016
      },
      "score": 50,
      "summary": "What's your take on Edward Snowden: A patriot deserving of a presidential pardon? A traitor deserving of execution, as Trump believes? Something in between? In Snowden the movie, in which a fiercely committed Joseph Gordon-Levitt plays the title role, Oliver Stone removes all doubt. He's Saint Edward."
    },
    {
      "critic": "Brian Truitt",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2016
      },
      "score": 50,
      "summary": "Snowden’s a polarizing whistleblower portrayed as an American hero here but in too pedestrian a fashion for such a hot-button topic, and the movie seems at times as awkward as its brainiac subject."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2016
      },
      "score": 50,
      "summary": "The voice of skepticism is sorely missed in Oliver Stone’s credulous bio-pic, Snowden."
    },
    {
      "critic": "Oleg Ivanov",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2016
      },
      "score": 50,
      "summary": "The film depicts Edward Snowden's ethical dilemmas in a political vacuum that disregards America's increasingly complex security threats."
    },
    {
      "critic": "Tim Grierson",
      "publication": "Screen International",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2016
      },
      "score": 50,
      "summary": "Stone’s mixture of paranoid thriller, political commentary and romantic drama keeps Snowden feeling busy without ever being particularly engrossing or enlightening. Frustratingly, Snowden remains a ghost in the machine."
    },
    {
      "critic": "Stephen Farber",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2016
      },
      "score": 50,
      "summary": "Stone’s direction is measured, methodical, and totally lacking in the fire and flamboyance that sometimes electrified and sometimes ruined his earlier films. The story moves along without any real sense of urgency or suspense."
    },
    {
      "critic": "Leah Greenblatt",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2016
      },
      "score": 50,
      "summary": "It somehow manages to make a fascinating, utterly contemporary narrative feel like old news."
    },
    {
      "critic": "Ben Nicholson",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2016
      },
      "score": 40,
      "summary": "Gordon-Levitt is perfectly fine as Snowden, getting the voice and cadence fairly spot on and he looks almost right. The problem is that he's such an introvert and blank slate - that's pretty good for espionage but not especially compelling for a character arc."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2016
      },
      "score": 40,
      "summary": "Stone's characteristic on-his-sleeve political views aren't the problem with the often-sleepy Snowden. Rather, it's that his film – the lag-prone script for which the filmmaker co-wrote with Kieran Fitzgerald – really doesn't tell us much that we don't already know.  That'll certainly be the case for anyone who saw director Laura Poitras' Oscar-winning 2014 documentary \"Citizenfour,\" a remarkable bit of filmmaking."
    },
    {
      "critic": "Justin Chang",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2016
      },
      "score": 40,
      "summary": "There’s a deeper emptiness at the core of the movie, a failure of nerve and a fundamental incuriosity about what makes the Snowden affair interesting and relevant, then and now."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2016
      },
      "score": 40,
      "summary": "What made Snowden so compelling in the excellent 2014 documentary Citizenfour reduces him, in the context of an Oliver Stone thriller, to a blur. Even Hackers was more exciting."
    },
    {
      "critic": "Benjamin Lee",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2016
      },
      "score": 40,
      "summary": "In his dry and uninvolving dramatic take, Stone has made a film aimed at breaking out Snowden’s story to the masses but it’s made with such limpness that a swift read of his Wikipedia page will prove far more exciting."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2016
      },
      "score": 38,
      "summary": "Snowden could have been a character portrait, but instead it’s like “The Bourne Identity” minus the chases and fights, which is like a ham and cheese sandwich minus the ham and cheese. As a consequence, I suspect, this film will make no bread."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2016
      },
      "score": 10,
      "summary": "Snowden is mostly flat, overlong, unfocused and didactic."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2016
      },
      "score": 10,
      "text": "Support this movie and Snowden's cause by spreading the message and helping this movie get the popularity it deserves. This movie embodied the great quest Snowden had to take quite factually correct and it was done excellently well! Want to be inspired to fight against corruption? Watch Snowden.",
      "total_reactions": 2,
      "user": "GloryofPushkin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2016
      },
      "score": 10,
      "text": "Well done, informative, and entertaining, but with the sad ending that Snowden himself predicted: His worst fear was that nothing would change (except to get worse).",
      "total_reactions": 1,
      "user": "Corvin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2016
      },
      "score": 8,
      "text": "Snowden is an extremely important movie. It's a fascinating movie to watch, the secrecy and lies the NSA and the CIA took to monitor and document public and private information of citizens. The path we take to witness Snowden question the morals behind this secrecy and the enormous stress he feels is really well portrayed. Secrecy means security, but does this make it morally right? Shouldn't the public and other countries have the right to know they're being monitored? Although some scenes drag a bit, and overall the movie feels a bit too long, the great cast and content definitely makes up for it.",
      "total_reactions": 1,
      "user": "HazzaGalla"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2016
      },
      "score": 3,
      "text": "Definitely not one of Oliver Stone's best. This is a portentous and, more unforgivingly, boring take on the Edward Snowden story. Lacking the amazing style and cleverness of JFK, this telling sees a lot of actors drowning as they try to make their characters come alive. A pointless exercise given that Citizen four, a documentary on the same subject, is so much better.",
      "total_reactions": 1,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2016
      },
      "score": 8,
      "text": "Great movie that doesn't make factual sacrifices for the sake of entertainment.  This is a political drama, not an action movie, so I'm not sure why people would complain about the lack of action...?",
      "total_reactions": 1,
      "user": "BigDegs29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2016
      },
      "score": 6,
      "text": "The best of Oliver Stone is hard hitting, intense, edgy, and controversial.  That was then.  This is now:  soft edged, melodramatic, predictable, harmonious.  Whatever you think of Stone, he is a giant of cinema and his voice so strong he created a brand of identity and signature subject matter which very few big movie directors ever achieve.  Give him the credit for tackling tough content nobody else would touch and executing with big class A production value and a zesty vigor which pushed the whole medium in his heyday.  Big fan here.",
      "total_reactions": 1,
      "user": "AxeT"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2016
      },
      "score": 6,
      "text": "What Snowden tries is what it tries to aim at best, but unfortunately fails at the end. This movie should try to play hard on the audience instead of playing it safe because the ridiculous part is that there's no hard tries whatsoever. See it for yourself, but don't expect too much hype over it.",
      "total_reactions": 4,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2016
      },
      "score": 10,
      "text": "This film is the must see of the summer. It tackles important political topics and sheds light on the mass information debacle a few years back. Joseph Gordon Levitt pulls of an outstanding performance playing the complex Edward Snowden.",
      "total_reactions": 6,
      "user": "Darro25"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2016
      },
      "score": 7,
      "text": "It was better than I thought. I don't understand critics and the reasons behind what makes a movie qualified to be good or indecent. For me, it's whether the experience was invigoratingly memorable as a piece of entertainment or not. Did it enthral? I feel the experience is being less appreciated than 'a good shot' at the movies nowadays. There are reasons why there is conflict in this world, and it revolves around who has the most power and who is the most threatened by it. In a world of 'somebody has to win,' this movie gives us a sense of purpose in an age where our lives have been driven by the technology we rely upon. Snowden is not a moviegoing escape from reality, it makes you weary of going back into it. I will always approve of a film that understands the exploitation of it's own material and goes all the way with it and remains pure to what specifically is being explored. A diamond in the rough.",
      "total_reactions": 4,
      "user": "devo-nc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2016
      },
      "score": 8,
      "text": "Though sometimes flat in its tone and drawn out in its pacing, this important piece of cinema nevertheless does an excellent job of detailing what happened and explaining the implications of the protagonist's actions. This biopic, though a somewhat fictionalized account, ranks far superior to the \"Citizen Four\" documentary that captured history as it happened but became so bogged down in technical jargon that its impact was lost on virtually anyone not fluent in tech-speak. This may not be Oliver Stone's best cinematic effort, but it's arguably one of his most significant productions.",
      "total_reactions": 2,
      "user": "Brent_Marchant"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2016
      },
      "score": 10,
      "text": "An important film about the politics of surveillance in our times. It has fantastic cinematography, editing, directing, cast, acting, very good scenes and good music. My only complaint is, that it's too much in too little time, so some sequences in the middle don't really pop, because you have no time to process them. This film should have been longer, because it's too dense. It could have been a good TV series, too. I hope we'll get a longer Director's Cut with more character moments and more scenes on the inner workings of the NSA surveillance complex. It's still a very good film & everyone should check it out, especially those who don't agree with Snowden. If you can, see it in 4k and at least two times, otherwise you'll miss a lot of visual and dramatic details. It's Oliver Stone's best film since \"JFK\" !",
      "total_reactions": 2,
      "user": "StanleyKubrick"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2016
      },
      "score": 10,
      "text": "The Snowden movie is both entertaining and eye opening. I was worried the film would not do justice to the story but Oliver Stone got it right! This story line could easily become a franchise as this film only covered the beginning of the tale and there is so much more. Thank you Oliver Stone, cast and crew for making a great film, and thank you Edward Snowden for the great sacrifices you have made.",
      "total_reactions": 5,
      "user": "fmguitars"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2016
      },
      "score": 1,
      "text": "This movie is a no for me.",
      "total_reactions": 9,
      "user": "MovieME"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2016
      },
      "score": 10,
      "text": "Great film making, and politically relevant. I saw this at the Arclight, Hollywood during a preview night. I had seen the HBO documentary on Snowden already, so knew what to expect. I admit this was my most anticipated movie of the year, so my expectations were very high. It met my expectations in every regard. I'll be seeing it again, and I hope everyone does. At the Arclight on Wednesday, there was a Q/A video that happened afterword and that was very enlightening. Or should I say mind blowing. Our privacy, or lack there of, are both taken for granted. Let's keep this conversation, and others, open.",
      "total_reactions": 6,
      "user": "willothenight"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2016
      },
      "score": 9,
      "text": "I was actually surprised by this movie.  The trailer did not make it seem all that appealing, but as a supporter of Snowden, I went ahead and watched it anyways.  The movie was actually well produced.  Obviously, the movie is heavily political, so if that is not a genre-base that one enjoys, then they should not watch it.  All in all, I really enjoyed it, both as a movie and as a philosophy.",
      "total_reactions": 4,
      "user": "pie314159265358"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2016
      },
      "score": 7,
      "text": "As the famous/notorious Edward Snowden, Joseph Gordon-Levitt is quietly compelling (even though he adopts the flat delivery of Keanu Reeves). This biopic alternates between his covert meetings with the reporters who released the NSA documents and the career events that lead up to it. The details are interesting, but his relationship with his girlfriend (Shailene Woodley) drags on the momentum. Sure, the paranoia message is requisite, but director Oliver Stone let it become too didactic and too constant. As a result, the basic story is still fascinating and well told, but it's power is diluted by the film's 134 minute length.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2016
      },
      "score": 8,
      "text": "Not Oliver Stone at his peak but definitely a solid entry in his cannon. Everybody gave great performances. This story is essential viewing. My biggest complaint was a weak musical score and a somewhat miscast Nick Cage. Otherwise, I recommend without reservations.",
      "total_reactions": 2,
      "user": "judahjsn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2016
      },
      "score": 3,
      "text": "I can't tell if it's slightly better or worse than the very disappointing Hell or high water. Either way it's a incredibly biased and dull movie on a subject that should be treated in a more open ended way. Instead of trying to answer the question of foreign policy and domestic spying, Oliver Stone tries to give you a answer. read up about Snowden before seeing this movie if you do. because you deserve to know the whole truth and nothing but the truth.",
      "total_reactions": 1,
      "user": "TheMetacritiqer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2016
      },
      "score": 8,
      "text": "I always start my critiques by judging did the director keep my interest throughout the entire film.  Oliver Stone accomplished that. Granted it's a little long in length but the story stayed in focus,  The ending leaves the audience with the choice of hero or traitor.  Everyone can judge that for themselves. As for me I give it a 2 thumbs up & refute the negative ratings some are giving it.  GO SEE FOR YOURSELF",
      "total_reactions": 1,
      "user": "moviecritic68"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2016
      },
      "score": 1,
      "text": "I, like Edward Snowden himself, was very disappointed with this film. Giving it to a jaded, major block-buster Hollywood director whose lost his sensitivity and nuance to the Hollywood machine, was probably the biggest, but most unavoidable mistake. Watch \"Citizen Four\" or any of his Edward Snowden's brilliant interviews with the media if you want the straight stuff on him. This film is a waste of time.",
      "total_reactions": 3,
      "user": "2morovian"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2016
      },
      "score": 8,
      "text": "A much better film than many of the reviews suggest. The movie is provocative and retells a very significant development in recent history. Some of the criticisms of this film seem to be that the movie is at times slow and relatively dull--I think that stems at least in part from the fact that the real-life Snowden is not the most exciting person and his life, while interesting, was not particularly compelling until 2013. He is not an action hero, but a real life person who made a series of decisions that are bound to attract both praise and scorn. I think that dynamic is captured by the movie, perhaps to its detriment with some reviewers.The movie is a bit long, but, in my view, there weren't scenes that warranted obvious cutting. A very good film and I'm glad I saw it.",
      "total_reactions": 0,
      "user": "IllegalDefense"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2017
      },
      "score": 5,
      "text": "Edward Snowden is an infamous man nowadays. After leaking that American citizens and the entire world were being watched by the NSA, he became the most wanted man in America. People were split on whether or not this man was a hero or a traitor. It is a hefty question for which there is no easy answer. On the one hand, he pulled the wool off our eyes and forced us to see what our government become: unhinged. The government never knew when to step and, even if they had an inkling it was wrong, they trudged on anyways. On the other hand, what he did revealed top secret information to our enemies. Yet, it is not this debate that takes center stage in Oliver Stone's film. Rather, it is an examination of the man behind the leak with little focus on the leaked information itself, which makes for a largely mixed bag as a result. While a compelling film when it really hits it stride, the film never dives into the leak enough, instead focusing on the love between Snowden (Joseph Gordon-Levitt) and Lindsay Mills (Shailene Woodley).",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2016
      },
      "score": 7,
      "text": "He who became a people's hero by betraying his own nation!",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2016
      },
      "score": 9,
      "text": "I was really impressed by this film. Great pacing, excellent acting on the part of Joseph Gordon-Levitt, and though I typically don't enjoy Oliver Stone's filmmaking, the directing was much stronger than I was expecting.",
      "total_reactions": 0,
      "user": "kromem"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2016
      },
      "score": 10,
      "text": "A great dramatised documentary about this man. A man who helped expose our governments for what they really are. I was gripped throughout as this film as it tells the full story how he started with full faith that all government bodies are here to purely serve the population, only to learn the truth, and his inner (and outer) struggles over whether to expose them and how best to do so without being killed. Ed Snowden is a true hero for doing what he did and I'm glad this story is now out there forever for all to see in this excellent video.",
      "total_reactions": 0,
      "user": "supemoneylife"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2017
      },
      "score": 8,
      "text": "Really good movie what shows inside of how America works nowadays and show the actual discussion of today - what is worth more - security or your freedom?",
      "total_reactions": 0,
      "user": "Ralfbergs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2016
      },
      "score": 9,
      "text": "A fantastic, superbly crafted film that deftly examines the importance and influence of Snowden's revelations. Stone delivers a screenplay which is tightly paced, beautifully shot, and with a performance from Levitt that was exceptional, this was an engrossing experience that is well worth your time. 9.01/10",
      "total_reactions": 0,
      "user": "Jess_Hill"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2016
      },
      "score": 9,
      "text": "\"Law Does Not Replace Conscience\"",
      "total_reactions": 0,
      "user": "PipeC"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2016
      },
      "score": 6,
      "text": "Pros",
      "total_reactions": 0,
      "user": "prnst2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2017
      },
      "score": 7,
      "text": "Well done movie by Oliver Stone.  Showed the man as well as the headlines.  Gave insight into his life and how he lived his life.  Question: at the end, you hear Hillary's voice saying he should stand trial and be punished, etc, which may have cost her votes with the target audience of this film.  Is Oliver Stone anti-Hillary?",
      "total_reactions": 0,
      "user": "smiyamot"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2016
      },
      "score": 8,
      "text": "This movie answers the question regarding who Snowden was and how it accumulated to the events of 2013. It shows us the capability of the mass surveillance that the US had which can be used for both good and evil: monitoring terrorist activity and defending against foreign hackers, or monitoring millions of innocent citizens and blackmailing influential figures.",
      "total_reactions": 0,
      "user": "masamuneriku"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2016
      },
      "score": 8,
      "text": "This was surprisingly good. It's without a doubt an Oliver Stone film hitting upon all of the usual Stone themes but it works so well for this film. Stone does a fantastic job of pulling common emotions and you can easily emphasis with the protagonist as the film progresses. My only major complaint is the final seen is ridiculously over the top where a crowd at the end all cheer for Snowden at the end. I think this stripped away the ambiguity of the film and I wish it had been cut.",
      "total_reactions": 0,
      "user": "AquaMorph"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2016
      },
      "score": 6,
      "text": "The best part of Snowden was the lead actor. Joseph Gordon-Levitt does a great job playing Snowden, the camera work was excellent, and the story was simplified to where a general audience could understand it. However, instead of simply telling a straightforward story about the guy, the director infuses his own personal left-wing politics at points and thus, the film becomes a bit cringe-worthy at those points. For example, while Oliver Stone tries to remain neutral and let the audience form their own opinion of Snowden's actions, it's quite clear from the way the story is told that he supports him. In addition, the film doesn't have as much drama as it should have. It's a bit dry emotionally. However, Levitt's fantastic performance and beautiful camera work saves it and makes Snowden an overall decent film.",
      "total_reactions": 0,
      "user": "CarFan1999"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2016
      },
      "score": 6,
      "text": "Snowden is the movie about Edward Snowden, who took it upon himself to release so-called \"classified\" documents. He currently has asylum in Russia for his actions, which are controversial among not only the public, but also in politics.",
      "total_reactions": 0,
      "user": "skeptic303"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2016
      },
      "score": 10,
      "text": "Oliver Stone did an excellent job of telling Edward Snowden's complete story. This is a story that Americans should know about and this movie does it well.  Some good acting, too.",
      "total_reactions": 0,
      "user": "ArlenG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2016
      },
      "score": 7,
      "text": "Oliver Stone’s Snowden is a story about an NSA whistleblower who’s revelations about the Government’s secret surveillance programs have shaken the public to it’s core. It is a story of a man who willingly went against his country to initiate a change projected by the freedom of speech and information. During the summer of 2013 when all the information came to light, Ed’s case was widely publicized as the vast majority of news channels and papers headlined his stories and discovery’s. In 2014 Laura Poitras’ oscar-winning ‘Citinezfour’ carefully documented Snowden’s account. Poitras, just like Greenwald, MacAskill & Gibson played an integral part in making Snowden’s story come to life.",
      "total_reactions": 0,
      "user": "Sportello"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2016
      },
      "score": 5,
      "text": "What’s it about?",
      "total_reactions": 0,
      "user": "dspratlin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2016
      },
      "score": 9,
      "text": "I really liked how they take his story and turn it into both a cyber-espionage thriller, and a love story. That wasn't what I expected, but it worked really well in the end. I think of this dude every time I glance at the masking tape over my laptop camera...",
      "total_reactions": 0,
      "user": "LaSh4wn328"
    }
  ]
}