{
  "mc_avg_user_score": 5.4,
  "mc_metascore": 69,
  "mc_mixed_rating_frequency": 16,
  "mc_movie_name": "Solitary Man",
  "mc_negative_rating_frequency": 8,
  "mc_positive_rating_frequency": 16,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "The problem with this movie is its linearity. The protagonist is a manipulative single minded jerk with no real insight and that doesn't change. It's aggravating watching him, there is no growth, the plot is obvious.  A disappointment.",
      "total_reactions": 1,
      "user": "weisberger"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2011
      },
      "score": 0,
      "text": "I would have never rented this title in the first place, but my brother went to pick up something for himself, and offered to get one for me.  I gave him a list of titles that I would like, but he couldn't find any of them, so he picked out this one, I guess because it had Michael Douglas in it.  I am truly shocked to see some positive reviews here, I thought that they would be uniformly awful, just like the movie.  I could tell that I didn't want to watch it after about 15 minutes, but I guess that I got through half of it before shutting it off.  I saw enough terrible dialogue, and Michael Douglas acting like he believed that he was a 16 to 18 year old.  It was painfully boring, along with being just awful.  Now I know that it is a great idea for me to pick out my own movies.  It is extremely rare for me to not let a movie finish, but I'm not into torture.",
      "total_reactions": 1,
      "user": "JED_Houston"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2011
      },
      "score": 0,
      "text": "Awful. Awful. Awful. Awful. Awful.  Why must a review be 150 characters long? Awful. Awful. Awful. Awful. Awful.  Why must a review be 150 characters long? Awful. Awful. Awful. Awful. Awful.  Why must a review be 150 characters long? Awful. Awful. Awful. Awful. Awful.  Why must a review be 150 characters long? Awful. Awful. Awful. Awful. Awful.  Why must a review be 150 characters long?",
      "total_reactions": 1,
      "user": "EAPayne165"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "Michael Douglas fans will enjoy his flawless performance as disgraced businessman Ben Kalmen in the darkly funny Solitary Man.",
      "total_reactions": 2,
      "user": "SecretAgentGal"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2010
      },
      "score": 1,
      "text": "To say this movie sucks gives it more weight than it's worth. The script is well-matched to the direction because both are done equally poorly. The only reason I watched it was because Salon.com liked it, but then it turns out that Matt Zoller Seitz reviewed it, and Salon should fire him. The movie had only one surprise for me - that I made it to the end without walking out.",
      "total_reactions": 2,
      "user": "Taplinger"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "Douglas is good and the script is smartly written, but I can't say that I found Douglas' character to be likable enough to care about how the film ended. I also can't say that I actually believed the daughter would sleep with Douglas' character either. Awfully skeezy/farfetched.",
      "total_reactions": 1,
      "user": "Tony"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "Michael Douglas is at his best in this dark comedy. The film is intelligent, sexy, funny, and pure fun. It gives you just enough drama to keep it interesting, while silently incorporating amusement when you least expect it. Jesse Eisenberg still shows he is a rising star, with raw acting talent. You have Douglas' right hand man Danny DeVito, who gives a notable side role. The dialogue between Susan Sarandon's character and Michael Douglas' are some of my favorite moments, despite the several \"WTF just happened\" moments that will keep viewers wondering what other crazy detail will the cast unveil next. No complaints here.",
      "total_reactions": 1,
      "user": "Film_Fanatic_15"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "The movie is good, but you stay with wanting more, is too short. The best perfomance of Michael Douglas in years contribuites to save the movie, that fails in the poor script and discrete direction.",
      "total_reactions": 1,
      "user": "zutopia"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2017
      },
      "score": 7,
      "text": "So close! Solitary Man is a masterclass in intelligent, hilarious but most of all truthful storytelling. The situations that Ben (Michael Douglas) finds himself in, and the resulting dialogues, are affecting because they are not strewn with Hollywood cliche plot twists. Instead we watch the slow and painful demise of a man who deserves his comeuppance and aren't left rolling our eyes at his predictable resurgence to glory.",
      "total_reactions": 0,
      "user": "Casually"
    }
  ]
}