{
  "mc_avg_user_score": 5.0,
  "mc_metascore": 52,
  "mc_mixed_rating_frequency": 3,
  "mc_movie_name": "Someone Marry Barry",
  "mc_negative_rating_frequency": 3,
  "mc_positive_rating_frequency": 3,
  "mc_pro_critic_reviews": [
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2014
      },
      "score": 60,
      "summary": "There’s nothing sophisticated or groundbreaking here, but the movie is a moderately good entry in the bro-grows-up genre."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2014
      },
      "score": 60,
      "summary": "Labine and Punch invest their performances with enough anarchic comic inventiveness and genuine chemistry to make their characters’ courtship and relationship issues funnily entertaining."
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2014
      },
      "score": 58,
      "summary": "Someone Marry Barry is a reasonably entertaining argument that good performers can enliven weak material."
    },
    {
      "critic": "Nick Schager",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2014
      },
      "score": 50,
      "summary": "The way the film hews to tiresome conventions is itself a buzzkill, but worse is its sheer lack of energy, as Pearlstein stages serious and/or heartfelt conversations that go on twice as long as necessary and treat the characters as more than the two-dimensional caricatures they actually are."
    },
    {
      "critic": "Glenn Kenny",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2014
      },
      "score": 38,
      "summary": "But because the movie is at heart as fake-sentimental as any other such motion picture, or greeting card, or what have you, there's a lot of backpedaling after, say, a random attempt to milk laughs out of human trafficking."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "There are no mass actors in this film yet fulfills with the quality of the A list movies. What a wonderful launch pad for an aspiring filmmaker. He wrote it, as well handled everything and everyone carefully. In the name of comedy, he did not go lousy, like most of the B movies do. One of the best main roles ever it was for Lucy Punch in her entire career as far my observation and she outclassed it. Daman Wayans also having a good time recently with movies like 'Let's be Cops', 'Big Hero 6' and this. Certainly his career graph mounting like any actor dreamt for.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2017
      },
      "score": 0,
      "text": "Pearlstein's collection of fart jokes and other scatological bits will only tickle the sides of kids up past bedtime. Some **** are better left unscooped and some films are better left unwatched.",
      "total_reactions": 0,
      "user": "Benkoko11"
    }
  ]
}