{
  "mc_avg_user_score": 7.1,
  "mc_metascore": 53,
  "mc_mixed_rating_frequency": 14,
  "mc_movie_name": "Soul Surfer",
  "mc_negative_rating_frequency": 14,
  "mc_positive_rating_frequency": 50,
  "mc_pro_critic_reviews": [
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2011
      },
      "score": 88,
      "summary": "The best faith-based film ever made, an uplifting, entertaining and wonderfully-acted account of surfer Bethany Hamilton's life before and after a shark bit her arm off in the waters off her favorite Hawaiian beach."
    },
    {
      "critic": "Andy Webster",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2011
      },
      "score": 80,
      "summary": "As a portrait of a spirited, resilient athlete, the movie succeeds best, unafraid to face its heroine's daunting challenges directly."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "It's a good, solid family film."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "Soul Surfer, while formulaic in design, is an authentic and heartfelt movie."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2011
      },
      "score": 70,
      "summary": "Thus ends one of the most understated shark-attack sequences, ever; it's almost Bressonian, except it's not boring."
    },
    {
      "critic": "Rob Nelson",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2011
      },
      "score": 70,
      "summary": "Distinguished by splashy cinematography, engaging performances from Dennis Quaid and Helen Hunt as the girl's go-get-'em parents."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2011
      },
      "score": 67,
      "summary": "The sermons are subtle, raising the film's chances of crossing over to secular audiences. Soul Surfer is so clean that it squeaks, but sometimes that's a nice change of pace."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2011
      },
      "score": 63,
      "summary": "It's a compelling tale of surf and survival."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2011
      },
      "score": 63,
      "summary": "I feel something is missing. There had to be dark nights of the soul. Times of grief and rage. The temptation of nihilism. The lure of despair. Can a 13-year-old girl lose an arm and keep right on smiling?"
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2011
      },
      "score": 63,
      "summary": "The best moments come when Robb's all-purpose toughness experiences vulnerable doubt. These moments are flickers, but they're bright and human."
    },
    {
      "critic": "Glenn Whipp",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2011
      },
      "score": 60,
      "summary": "That Soul Surfer rates as a giant leap for this team speaks well about the conviction the movie's actors bring to the material as well as the respect afforded the Hamiltons and their faith."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2011
      },
      "score": 60,
      "summary": "Superb limb-erasing effects and lush cinematography are bonuses, though not so much the cloying presence of American Idol's Carrie Underwood."
    },
    {
      "critic": "Kirk Honeycutt",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2011
      },
      "score": 60,
      "summary": "A true story of courage, determination and guts that deserves a more exciting approach."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2011
      },
      "score": 58,
      "summary": "Unique as an inspirational personal-achievement film in the way it focuses on the protagonist not merely as a bastion of strength, but as part of a supportive community and family."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "Hamilton is played, blandly, by Anna Sophia Robb, and her devoted parents, less bland, are played by Dennis Quaid and Helen Hunt. The surfing footage, much of it shot off the coast of Kauai, is not bland at all."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "McNamara's relentlessly shiny, happy outlook crosses the line between believable and artificial by about the 10-minute mark."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "Soul Surfer is a true story that plays like bad fiction."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "The script is weak, but everyone on the technical side of \"Soul Surfer\" is a pro. The scenes in the water flow together nicely, and the action is always coherent. Robb's scenes without an arm look seamless throughout the movie."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "The inspiring story of surfer and shark attack victim Bethany Hamilton deserves a better dramatization."
    },
    {
      "critic": "Andrea Gronvall",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "AnnaSophia Robb (Charlie and the Chocolate Factory) is too subdued as the teenage heroine; one might expect more affect from a young woman fighting to overcome disability and return to competitive surfing."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2011
      },
      "score": 40,
      "summary": "Dennis Quaid lends some needed saltiness as Hamilton's supportive dad."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2011
      },
      "score": 40,
      "summary": "Comes across as a particularly unspecial \"Very Special Episode\" of a television series that never made it past the pilot stage."
    },
    {
      "critic": "Aaron Hillis",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2011
      },
      "score": 40,
      "summary": "Soul Surfer offers a ghastlier sight than your wildest \"127 Hours\"–meets-\"Jaws\" nightmare: barefaced Christian pandering that pretends it isn't."
    },
    {
      "critic": "Steve Ramos",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2011
      },
      "score": 40,
      "summary": "Sappy melodrama, clumsy dialogue and heavy-handed proselytizing derail the inspirational story of teen surfer Bethany Hamilton."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2011
      },
      "score": 38,
      "summary": "You'd think it would be hard to make an uninteresting movie based on the true story of Bethany Hamilton... But the terminally bland Soul Surfer comes perilously close."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2011
      },
      "score": 38,
      "summary": "The swells of inspirational storytelling sometimes threaten to swamp the underlying inspirational story."
    },
    {
      "critic": "David Hiltbrand",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2011
      },
      "score": 38,
      "summary": "The aquatic and surf scenes are spectacular. The story, a clichéed climb to inspiration. Soul Surfer is more parable than plot."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "I bumped into Bethany Hamilton in the Lihue airport several years back, and she was surrounded by adoring locals.  Such a brave person, and it's a really amazing story. I thought the parts with Carrie Underwood were a touch contrived, but because faith is such a big part of the Hamilton family's life, they were appropriate. Hunt and Quaid are perfect casting choices.  The surfing scenes are spectacular.  The scene that had the biggest impact on me was the one in which she first comes home from the hospital, realizing some of the new limitation of her condition.  When she realizes that she'll probably never be able to play the guitar again, it absolutely put things in perspective (as a guitar player...)",
      "total_reactions": 2,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "Amazing chemistry between Dennis and Helen as bethany's parents.  Movie had amazing chemistry, editing, acting and music very moving and inspirational!",
      "total_reactions": 2,
      "user": "Nowehoboy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "This movie was so touching especially to all the young surfers out there who want to make a difference. I don't see why everyone is saying it was bad acting at the shark attack part. I couldn't believe what I was reading! Everyone is wrong. Please this movie is very touching. RECOMMENDED TO ALL AGES!",
      "total_reactions": 2,
      "user": "soulsurfer99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "The movie was very good. It had a good base. It has a good plot. The movie seemed that you were right next to the actors and actresses. I loved the movie it had action, faith, knowledge, and fun!",
      "total_reactions": 1,
      "user": "cfh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "I thought Soul Surfer was an amazing movie. It really brings emotion, faith, excitement and many other feelings to you. Having a girl of such young age be attacked by a shark and still be a pro at surfing is an amazing thing. I really found this movie interesting and it makes you wanna see it to the end with no interruptions. Like some movies i have seen i get bored of it, but then something happens and it just makes me change my mind about it. Soul surfer i think is the best movie i have seen in 2011 so far. I am totally a fan of the movie now. I also love how this story was based on a true story and they told it perfectly. They showed her life before things happened and after the attack. Then they showed everything she had to do and the challenges of having only one arm. Being able to surf again was a bug challenge for her and she managed to do it. With training and her friends and family there every step of the way. Even though she didn't win nationals she did win. She did the best she could and that's really all that mattered to her. Was just being in the nationals. I am a swimmer and if something like this happened to me, i don't think i could have the strength she did. I would be afraid to go back in the water and start swimming again. But she really managed to get back into life on her own. Great movie i loved it and i can't wait till it comes out on dvd. It's an amazing movie, totally worth of a 10 on 10 :)",
      "total_reactions": 1,
      "user": "CharityLeGal"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "I'm not a christian or a country fan. But that doesn't prevent me from from enjoying this film. I'm not a professional movie reviwer either, but I don't understand the critics dislike. I've seen much, much worse films shoehorning religion and \"feel good\" messages into some real life plot. This film told a good story without being preachy or boring. I'm a huge fan of the ocean, so perhaps I'm biased but, this film is worth a watch. I've seen it twice at two seperate screenings and loved it each time. Anytime I felt it might start being to message heavy, the scene would change before it was lost due to overexposure. Plus there is a lot of great surfing scenes, competition and recreation.",
      "total_reactions": 4,
      "user": "Vadvaro"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "I've read mixed \"professional\" reviews of \"Soul Surfer\"; here is my takeaway.  \"Soul Surfer\" has high-quality cinematography, mostly great acting thanks to Robb, Hunt, Quaid & Sorbo and some newer names. The script is also believable, thanks to the acting.  Faith, in particular Christian, is fused throughout, in a way that will resonate with many audiences. You will leave believing that there is living, and then there is living as was intended. I suspect that some that don't care for the film, don't care to ponder the \"deeper\" questions we face in life.  This film points to the Truth, if one cares to consider such things.  A great film that Dad, Mom, and the kids will come away feeling great about!",
      "total_reactions": 3,
      "user": "Realdeal"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2011
      },
      "score": 5,
      "text": "Soul Surfer is the story of a young surfer girl that was bitten by a shark and lost her harm. The most exciting part of this film was watching and waiting for that scene to happen. After her arm was gone this film turned into one of those mellow drama stories of faith and prayer. Sometimes I felt like this movie was trying to be what it is not; A motivational disney sports story. Lets just say this story is great but when you don't have the right script or people behind it (Disney) then even a story like this can fail on many levels.",
      "total_reactions": 3,
      "user": "filmtrashreview"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2012
      },
      "score": 3,
      "text": "Great true story it is a totally inspiring story, oh this movie may just be wonderful. It isn't, this movie has uninspiring dialogue, bad acting surprising from AnnaSophia Robb and no chemistry between its stars. I give this movie 27%.",
      "total_reactions": 5,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "Overall the movie was disappointing given that it was based on such an inspirational true story.  Intolerably slow until the shark attack, then only limped along for the rest of the story.  OK, we get that her family is religious, but does the audience need to feel like we're at a youth outreach revival.   To say this movie was bland is critically too generous. Unfortunately, the folks behind this production wanted the G rating and faith-based crowd so badly that they sold the movie's creative soul to the Christian value police.  What's left proves about as exciting as a cream colored Burqa.",
      "total_reactions": 2,
      "user": "wschill"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2011
      },
      "score": 1,
      "text": "Its the kind of movie you might watch on a sunday afternoon with Faith based commercials spanning the whole movie. The movie is weak. The acting is weak. Couldnt finish it. Can be purchased in the discount bin at your local store in a few months time.",
      "total_reactions": 3,
      "user": "MorriBey"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2011
      },
      "score": 2,
      "text": "I watched Soul Surfer with the expectation of an inspiring story of a girl overcoming a great tragedy, and i received nothing more than what seemed like a cheap, ill thought-out film about a girl who overcomes losing an arm to surf. The acting was bad. The writing and dialogue was bad. The editing and cinematography was absolutely awful. While the overall message of the movie was inspiring, I was way to distracted by the movies downfalls to care. This movie is great for anyone who doesn't care about plot or acting, or anyone under the age of 12.",
      "total_reactions": 3,
      "user": "NicholasBuck"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 4,
      "text": "Maggie Fitzgerald(Hilary Swank) wins by TKO. From her seat on the canvas, Billie the Blue Bear(Lucia Rijker) looks temporarily confounded by the boxing match's dramatic turnaround. Once again, the underdog overcomes impossible odds to become a champion when nobody had given the perennial loser a shot. This moment of triumph usually signals, on cue, the fierce competitor's sudden transition into humbleness, congratulating the lesser opponent on a hard-fought victory, like when Apollo Creed seeks out The Italian Stallion at the end of John G. Avildsen's \"Rocky\". But filmmaker Clint Eastwood, in \"Million Dollar Baby\", an adaptation of the F.X. O'Toole novel \"Rope Burns: Stories from the Corner\" diverges from the norm. The slightly unconventional inspirational sports movie demonstrates that not all antagonists possess hearts of gold. The German ex-prostitute retaliates by blindsiding Maggie when her back is turned, landing the newly-minted world-beater in a hospital room for good, and is never seen or heard from again. The obligatory scene the moviegoer expects, where the Bear shows up at the paraplegic's bedside, at no time materializes. The heavy remains a heavy to the end. \"Soul Surfer\", with its relentlessly optimistic cast of well-meaning, but boring characters, is thankfully counterbalanced, saved really, from their overbearing promotion of a Christian rhetoric by the equally unlikable Malina Birch(Sonya Balmores), the rival surfer, who doesn't seem to care one bit that Bethany Hamilton(AnnaSophia Robb) survived a shark attack which left the then-thirteen-year-old girl one arm down. If a movie ever was sorely in need of a rancorous presence, it's certainly this one. Malina is more cold-blooded than the great white, but Bethany, obviously a glass half-full kind of girl, misreads the surfer's pitiless dealings with her as tough love, in which at one point, she tells her best friend Alana(Lorraine Nicholson) that \"she's treating me like real competition,\" as if a method exists to the austere enchanter's unsportsmanship. The antics that Malina pulls during the surf meets looks more like a concerted effort on her part to humiliate Bethany. She calls attention towards the young girl's handicap by stealing waves the recovering athlete is too slow to catch, and in one instance, nearly grazes Hamilton during a ride which is analogous to dunking in your foremost rival's face. Unspoken in \"Soul Surfer\", but duly noted by those in the know, is the probability that the basis of Malina's animosity toward Bethany is a racial one. Although the blond clearly identifies herself as \"kama'aina\", a local, the more Hawaiian-looking girl obviously views Bethany as an outsider. The inauthentic dialogue obscures this fact. Apart from a few yeahs tossed in sporadically at the end of sentences(just like the Minnesotans in Joel & Ethan Coen's \"Fargo\"), \"Soul Surfer\" largely avoids the potential pitfalls of recreating the idiosyncratic dialect which identifies the speaker as native, a subculturist wary of perceived intruders on their home turf. Owning a ukulele doesn't give you local cred. In most cases, local cred is predetermined through skin color. In all likelihood, Malina hates Bethany unconditionally because she's \"haole\"(the Hawaiian word for \"foreigner\"). Even a catastrophic injury to the Caucasian aquatist can't remedy the indigenous girl's long-standing repulsion for her one-time colonizer. The slur can be inferred through the glee Malina projects each time she bests the one-armed surfer. But that's okay. God only knows this aggressively faith-based film could use a devil to muck up the calibration in its ecclesiastical design. At times, \"Soul Surfer\", with its stringent fundamentalist teachings, can be downright Calvinistic, hinting ever so slightly that Bethany is being punished for her alleged selfishness, when she puts her budding surfing career ahead of the church. Vanity, it is suggested, costs Bethany her arm, because had she gone to Mexico with the other missionaries as planned, rather than train for an important surf meet, the tragedy could have been averted. As if to overstate this point, at her first professional event following the attack, Bethany stops to glance at a TV monitor filled with natural disaster imagery from the third world. Not wanting to make the same mistake twice, she puts away her gameface, replacing it with a shameface, a visage better suited for reflecting upon all those homeless children, just how her church sponsor Sarah(Carrie Underwood) would want it.  With the internet image of the Venus de Milo still fresh on her mind(thanks, Helen Hunt), Bethany helps with the tsunami relief in Thailand, before returning back home to continue what would become the start of her banner career. Malina wins, due to a technicality, and improbably, invites Bethany to stand beside her on the winner's podium. \"Soul Surfer\" forgets who Malina is.",
      "total_reactions": 3,
      "user": "Shiira"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2011
      },
      "score": 2,
      "text": "Such a shame... the real-life story is truly inspiring, but the movie is one of the poorest attempts that Hollywood as ever made to bring a true story to the big screen.  The actors were good (except for Carrie Underwood, who needs to stick with singing), but that's the only positive thing I can say.  The story was poorly told.  It's obvious that the movie makers wanted to make a movie about surfing rather than tell Bethany's story.  I'm severely disappointed in this one.",
      "total_reactions": 1,
      "user": "T44W"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Interesting movie, Soul Surfer is beautiful and emotive, the performance on AnnaSophia Robb is amazing, the story of Bethany Hamilton is beautiful. This movie is pretty.",
      "total_reactions": 1,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "A completely boring movie that should've just been a made-for-TV movie. With completely 2-dimensional characters, it is extremely drowned out by sloppy hollywood attempts at makind a feelgood drama.",
      "total_reactions": 0,
      "user": "liptap"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "The story of Bethany Hamilton is a good one, and makes for a good movie, and it also helps that the cast is fantastic and has fantastic acting. While it is good there is one big flaw throughout the entire film, predictability, turns out if you've seen one faith-based movie about someone into competitive sports recovering from  horrible accident, learning a valuable lesson, returning to the sport to be only better, and becoming a huge inspiration you've seen them all. Despite that flaw Soul Surfer manages to be a sweet, emotional, and inspirational film, but if your like me and have seen so many of these films you lost count ages ago this might be one you can pass on, as for the other people enjoy it for it's heart.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "A motivational/inspirational film that reeks with Hollywood but the true story of Bethany is one to remember which carried the movie from utter failure.",
      "total_reactions": 0,
      "user": "PurpleUrp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "I'm not a christian or a country fan. But that doesn't prevent me from from enjoying this film. I'm not a professional movie reviwer either, but I don't understand the critics dislike. I've seen much, much worse films shoehorning religion and \"feel good\" messages into some real life plot. This film told a good story without being preachy or boring. I'm a huge fan of the ocean, so perhaps I'm biased but, this film is worth a watch. I've seen it twice at two seperate screenings and loved it each time. Anytime I felt it might start being to message heavy, the scene would change before it was lost due to overexposure. Plus there is a lot of great surfing scenes, competition and recreation.â",
      "total_reactions": 0,
      "user": "yokesh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "Great! Carrie Underwood's great! This is country queen, American Idol champion Carrie Underwood's first complete attempt in movies (it wasn't her first attempt in acting since she had starred in the TV series \"Ho I Met Your Mother\" a la Britney Spears which was absolutely hilarious and awesome!). She has been on various shows, such as the Ellen DeGeneres show (where she aplyed the game Carrie Underwater with Ellen!) and Jay Leno (where she performed a bit of her classic \"Jesus, Take The Wheel\").",
      "total_reactions": 0,
      "user": "clh_hilary"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "I was interested in this movie because I think Annasophia Robb has a lot of potential as an actress.  This movie does not confirm that but I blame the material and her agent. For the amount of pouting in the movie, maybe Miley Cyrus would have been a better choice. The special effects to block out Robbs arm were so so. At times, they failed and you saw her arm even though it was supposed to be gone.  Overall, a dismal effort but I give it credit for great scenary and having appealing lead characters on display.",
      "total_reactions": 0,
      "user": "JBM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2012
      },
      "score": 6,
      "text": "First of all, I would like to say that the true story behind the film is really sensational.The movie started very slow, but it gradually became better and more interesting. The ending (finally) is absolutely spectacular and inspirational. Although the film didn't get me my first impression, it was, overall, a solid movie....",
      "total_reactions": 0,
      "user": "aaronpaul121"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "This is the best movie for every age! It is made from a real life story and it is a real heart touching story. The Shark attack is a scary part but after that it is for anyone who wants to see it.",
      "total_reactions": 0,
      "user": "soulsuferrocks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "Given the source material this movie had so much potential but it was squandered here. This could have been such a powerful and inspirational movie but it wasn't. It felt like some Lifetime TV movie. The performances were pretty bland and Carrie Underwood should just stick to singing, she gave the worst performance out of everyone. The dialogue wasn't really that good, I didn't find anything they said to be inspirational or insightful. The shark attack was hilariously awful, it was so poorly done. There were some nice things that I did admire about the movie however. The surfing sequences were great and well shot, I was happy to see the camera not shaking all over the place. The soundtrack was great and went really well with the whole Hawaiian feel. Also, this movie did have some nice and sweet moments. Overall the surfing sequences are great, the soundtrack was great and this movie did have some nice moments but this movie just felt so cheesy. The bland performances and dialogue really brought this movie down and that's a shame because this movie had so much potential. It could have been a moving and inspiring film, but instead is a cheesy lifetime movie.",
      "total_reactions": 0,
      "user": "Coco890"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Soul Surfer has just been AMAZING and it is just so entertaining! It has just been so real and touching! I hope all of you guys also like it as just as me!",
      "total_reactions": 0,
      "user": "mybestfirned789"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "\"Soul Surfer\" is a based-on-fact film about the life of Bethany Hamilton, an optimistic, blissful young girl who rode lots of waves, lost an arm, and rode lots of waves some more. Back in 2003, when she was just thirteen years old, Bethany's left arm was bitten off by a shark. Now she is a champion surfer, renowned in her field of sport and admired by people worldwide who share similar disabilities.",
      "total_reactions": 0,
      "user": "AutiTakahashi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2012
      },
      "score": 3,
      "text": "This film is utter garbage. From the acting, to the editing, to the dialogue, to the crap load of cliches, pretty much everything in this movie is terribly executed. It doesn't help that this movie is filled with over-the-top Christian preachiness.  Ugh. Just awful.",
      "total_reactions": 0,
      "user": "MrAppleKins"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "WOW! This movie is great and very intimate. I'm gonna be very quick here, come with an open heart and mind so you can cry as much as the 90% in my movie theater cried. It is truly spectacular!",
      "total_reactions": 0,
      "user": "jetpackulley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "A true story pretty impressive.",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "This true story gave birth to an inspirational movie.",
      "total_reactions": 0,
      "user": "MontiYan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "This film was very well done and what's better is its all based on a true story and from the looks of the credits where they show real footage they certainly stayed true to it! Robb does a great job as young Bethany who loses her arm to a shark attack, and we follow her struggle to get back in the water and compete as a surfer once again. It's a very emotional film but thanks to some great acting and beautiful scenery it all comes together nicely. Some dodgy CGI work aside it's a good film.",
      "total_reactions": 0,
      "user": "survivorfan989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "With its excellent acting, a sublime depiction of Hawaii, and a refreshing inspirational message, Soul Surfer quickly became one of my favourite movies of all time.",
      "total_reactions": 0,
      "user": "Toblerone"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "One of the best movies ever watched loved it very good movie. Great story that goes along with it Its a must watch. But at the end of the movie it gets a little long and drags on but other than that great movie",
      "total_reactions": 0,
      "user": "scannellk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2014
      },
      "score": 1,
      "text": "i  saw this film to  many times . i understand people who like it or the critics . Bethany Hamilton is the greatest surfer and survivor alive today . but still i saw this movie a billion times",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "Soul Surfer tells the story of a girl, Bethany Hamilton,who lost her arm in a shark attack. She decides to get back in to the water and surf again. The film is exiting, sad, funny and has got a surprising end.",
      "total_reactions": 0,
      "user": "AntoniaGeidel88"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "Soul Surfer has a lot of faith, which is something that I really lack. So you could say that the whole story wasn't really my cup of tea and be pretty accurate. I empathize with Bethany's struggles, I really do, and props to her for everything that she's accomplished because it's extraordinary. But the movie isn't. Bethany has a loving family and believes in God and with that everything's going to be ok. I just feel like we're missing out on her part of the story, on her struggles. There's no way it was as easy as the movie showed.",
      "total_reactions": 0,
      "user": "hanneguacamole"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2015
      },
      "score": 9,
      "text": "This film was an excellent family movie, watching this with my 12 year old was truly inspirational.  Against all odds this young surfer was amazing with her courage and sheer magnificence in the water.  A great film especially for young adults, I enjoyed it too.",
      "total_reactions": 0,
      "user": "Sarahgwen1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "A great movie ! The impressive and difficult struggle of someone known to all Bettany Hamilton called on his passion for surfing , his fall by shark attack , disappointment over the loss of the arm, and faith , optimism , guts and heart to surf again",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "A well-meaning, handsomely staged biopic of the top Hawaii-based surfing star Bethany Hamilton who lost her arm to a shark in 2003 at the age of 13...",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2016
      },
      "score": 0,
      "text": "This film is the worst film that I've seen in a loong time...............................................................................................................................................................................",
      "total_reactions": 0,
      "user": "PeterWazoski"
    }
  ]
}