{
  "mc_avg_user_score": 5.8,
  "mc_metascore": 63,
  "mc_mixed_rating_frequency": 81,
  "mc_movie_name": "Spring Breakers",
  "mc_negative_rating_frequency": 120,
  "mc_positive_rating_frequency": 199,
  "mc_pro_critic_reviews": [
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 100,
      "summary": "In Spring Breakers [Mr. Korine] bores into a contested, deeply American topic — the pursuit of happiness taken to nihilistic extremes — but turns his exploration into such a gonzo, outrageously funny party that it takes a while to appreciate that this is more of a horror film than a comedy."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2013
      },
      "score": 100,
      "summary": "Spring Breakers seems to be holding a funhouse mirror up to the face of youth-driven pop culture, leaving us uncertain whether to laugh, recoil in horror, or marvel at its strange beauty. All I knew is I couldn't wait to see it a second time."
    },
    {
      "critic": "Read full review",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2013
      },
      "score": 91,
      "summary": "Atmospherically, Spring Breakers is an elegant evocation of noir storytelling, littered with misdeeds with girls and guns at every turn."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2013
      },
      "score": 91,
      "summary": "Harmony Korine's first ''mainstream'' movie, Spring Breakers, is by far the best thing he's ever done."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 88,
      "summary": "Korine wants to give us a portrait of our nation’s children — the girls, especially — as beautifully depraved sharks, pleasure-seeking killers oblivious to the comedy and horror of their existence. And damned if he doesn’t pull it off, or come close enough."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2013
      },
      "score": 88,
      "summary": "A candy-colored fever dream is the most unforgettable movie of the year so far."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 83,
      "summary": "Tampa Bay wears fringe nihilism well, including wet-fever dreams of trigger-happy angels floating on cannabis clouds and dusted with cocaine like beignets waiting to be licked clean. Or drug gangstas sporting cornrows and gold-grill teeth, living large and thinking three-ways. Film as a fetish tool, that's what Spring Breakers is all about, y'all."
    },
    {
      "critic": "Simon Crook",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2013
      },
      "score": 80,
      "summary": "A lurid, luminous teen-bender movie, as ludicrous as it is stylish, and Harmony Korine’s best film in years."
    },
    {
      "critic": "Rosie Fletcher",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 80,
      "summary": "Brave, brash and exhilarating, but lacking the insight and impact of the Korine-scripted \"Kids\" (1995). Too much fun for social commentary, this is what you wish school was like."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2013
      },
      "score": 80,
      "summary": "Spring Breakers is either an inspired satire of the youth movie or the most irresponsible comedy mainstream Hollywood will never make. The bros in your crowd will call it rad — and radical it is."
    },
    {
      "critic": "Xan Brooks",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2013
      },
      "score": 80,
      "summary": "Full credit to Korine, who sustains this act of creative vandalism right through to the finish. Spring Breakers unfolds as a fever dream of teenage kicks, a high-concept heist movie with mescal in the fuel tank."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 78,
      "summary": "Spring Breakers is Korine’s most cogent take yet on society’s outsiders."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "Whether the film is uniquely brilliant or dismissively dumb is not the issue here. Either choice can (and will) be offered – it’s the choosing that counts."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "The movie is wild, but not in the ways that you expect, and it’s also surprisingly chaste — you think you see a lot more than you actually do."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "The female actors, particularly Hudgens and Ashley Benson, are game for the ride. And Franco is indispensable, bringing humor and pathos to one of the more repulsive cinematic creations in recent memory."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "With a greater emphasis on sex than violence, Spring Breakers is a more enjoyable guilty pleasure than “Natural Born Killers” and just as acute about our cultural devolution. For all its seeming stupidity, its masterstroke is making us complicit in the corruption of its young stars (who include the director’s own wife)."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "It's a pleasure, so soon after seeing Franco's recent bewildered performance in \"Oz the Great and Powerful,\" to watch him tackle this menacing yet beguiling character."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "The equation of \"drugs+booze+sex=happy ending\" applies. Then along comes Harmony Korine with Spring Breakers and subverts an entire genre."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "Starts out like a salacious, rump-centric and blithely bare-breasted hip-hop video and ends up in the realm of scary and inspired trash. That's not meant negatively."
    },
    {
      "critic": null,
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "One of the effects of Harmony Korine's feverish, hypnotic style is that the whole thing feels like a fantasy—or rather a nightmare perversion of the American dream."
    },
    {
      "critic": "Oliver Lyttelton",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2013
      },
      "score": 75,
      "summary": "Midnight movie programmers of the future will undoubtedly give it a long life years after it’s gone from first-run theaters."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 70,
      "summary": "What stays with you is Franco, one of the more enigmatic actors around, going way over the top yet grounding his performance in … something. Whatever it is, it’s more interesting than all the wet T-shirt contests in the world, and it makes Spring Breakers worth watching."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 70,
      "summary": "The movie is an arty lark of ambiguous entertainment value, pulsing with melancholy. It's rarely less than interesting visually or tonally, thanks in large part to Korine's prurient sense of humor and the rich location textures and Crayola sweep provided by gifted cinematographer Benoit Debie (\"Enter the Void\")."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 67,
      "summary": "It’s shallow, it’s boring, it’s poignant, it’s clever, it’s poorly acted, it’s intentionally poorly acted, it has no story, it has marvelous scenes, it is artful, it is hallucinatory, it is shoddily put together. All response is valid."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2013
      },
      "score": 63,
      "summary": "Spring Break – it’s every bit as much fun as you think it is. Until it isn’t."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 63,
      "summary": "As Alien, a gun-crazy Florida drug dealer with tats, beaded cornrows and a grill any rapper would envy, Franco is a bug-f--k blast. Too bad the movie itself is rarely as outrageous as he is."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 60,
      "summary": "Although parts of Spring Breakers are very funny, there's also something tsk-tsking and superior about it, as if Korine had thought a lot about young middle America's idea of midsemester fun and decided he doesn't like it one tiny bit."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 60,
      "summary": "So often not in his element — his turn in “Oz the Great and Powerful” is evidence of that — Franco is in freako mode here, and walks a line between spaced-out caricature and just plain Out There."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2013
      },
      "score": 58,
      "summary": "The overall effect is enervating, like a party that grinds on after most of the attendees have either left or passed out. And much like \"Kids,\" the enfant terrible’s breakthrough screenplay, Korine’s film has an unintended moral hysteria, like a warning to parents of what their good girls are doing when they aren’t looking. The message: Keep them locked up. In their bikinis, if necessary."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "Am I crazy, or are Spring Breakers and \"Oz the Great and Powerful\" essentially the same movie? James Franco stars in both - a tattooed, gun-totin' gangsta in one, a charlatan magician in the other (you figure out which is which), and, in both, he's encircled by a bevy of Hollywood babes determined either to get witchy on him, or get that other witchy-rhyming word on him."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "With director Harmony Korine's visual overload and somnolent voice-overs — the same sentences are repeated ad nauseum — it manages to be both mind-numbingly dull and off-putting."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 40,
      "summary": "Spring Breakers strikes me as another of Korine’s calculated punk outrages, a sploog in Disney’s direction."
    },
    {
      "critic": "Guy Lodge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "Just about every charge of social negligence leveled at Spring Breakers can be countered with an arch claim of intent, which makes it at once playful and wearying; enjoyment is contingent on how little you're willing to fight it."
    },
    {
      "critic": "David Rooney",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "It has hypnotic visual style and a dense, driving soundscape. But it’s also too monotonous and thematically empty to be seriously provocative."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 38,
      "summary": "Admittedly, I’m far from a fan of Korine’s “Gummo,’’ “Julien Donkey-Boy’’ and the absymal “Trash Humpers.’’ But that he is proud of making intentionally sloppy and tedious movies doesn’t make them any easier to watch. Or all that much fun, for that matter."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 30,
      "summary": "Any irregularity in tone becomes a part of the movie’s intentionally rough, imperfect surface — a formal strategy I might find interesting if I could make head or tail of what the movie that’s using it is trying to say."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 30,
      "summary": "Fitzgerald’s influence could have crept in there by osmosis, and whatever other charges you want to level against Spring Breakers – such as incoherence, plotlessness, salaciousness and mind-numbing monotony – it has no lack of high concept."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2013
      },
      "score": 30,
      "summary": "\"Trash Humpers\" at least had the artistic courage of its own lunatic convictions, but Spring Breakers is all surface and sham; it’s trash about humpers."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2013
      },
      "score": 12,
      "summary": "How on earth is it possible for one film to be so tiresome? Spring Breakers isn’t deadly dull despite all the nudity and violence, but because of it."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 13,
      "pos_reactions": 17,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "Easily one of the worst films I had ever seen, one might ask on why talents such as James Franco decided on a disastrous film like this? Had high hopes for the film and found it extremely trashy, disgraceful and just terrible. The main marketing for the film are the star actresses in the film but other than that, the film is terrible.",
      "total_reactions": 30,
      "user": "Wormow"
    },
    {
      "neg_reactions": 19,
      "pos_reactions": 19,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "I've been lucky enough to see Spring Breakers in a film festival, before it was released and I have to say: the movie is one of a kind. The contrast between it's art-house narrative and it's trashy Miami theme is what makes the movie special, and James Franco's performance here is astonishing. The movie is odd and disturbing, but it's equally fun and entertaining in a way you have never seen before.",
      "total_reactions": 38,
      "user": "Hipsteran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "This movie was a total disappointment.",
      "total_reactions": 1,
      "user": "JrAgujaIsAGleek"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "Pretty much exactly what I would expect from a \"Mainstream\" Harmony Korine film. Not much going on in the film. Painfully slow. Only thing saving this one is James Franco's fantastic performance.",
      "total_reactions": 1,
      "user": "madams"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 0,
      "text": "One word describes this film. Pretentious. One of the main characters is a church going Christian, and her name... Faith (Selena Gomez). Halfway through the film, she jumps on a coach and leaves. That's it? She's the only character that gets any real character development and before you know it she's gone. This film is utter garbage. It's also infuriatingly repetitive, some scenes play out 3-4 different times as flash backs or flash forwards. The film is padded out big time, and only just makes it to 94 minutes. You could probably edit this film down to under an hour without losing any main plot points.",
      "total_reactions": 1,
      "user": "marktuk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2013
      },
      "score": 0,
      "text": "This film is so ridiculously awful, I wonder why its getting so many good reviews. It was a total waste of my time and i would not recommend this garbage to any one. With such a good ensemble of cast members, I thought that this film would rock!! but It left me depressed just like its mediocre storyline. It was extremely unbearable to watch but I continued, hoping that it would surprise me but it didn't. Watch at your own risk.",
      "total_reactions": 1,
      "user": "maxremo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "text": "Harmony Korine is a troll. The \"social commentary\" in the movie arent there, it's just some made up **** from a fan who are a hipster. The plot didn't dwelve into anything I didn't expect. The movie has no structure. It would show the same scene multiple times and repeat the same dialogue.",
      "total_reactions": 1,
      "user": "blur95"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2014
      },
      "score": 3,
      "text": "A god awful movie. I didn't enjoy any part of this movie except for the acting of James Franco, who I have always liked as an actor. This movie was just about partying, drugs and stealing nothing interesting at all.",
      "total_reactions": 1,
      "user": "Viper8787"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2014
      },
      "score": 2,
      "text": "i registered to metacritic specifically to review this film. it sucks. it's a piece of turd. the film is as superficial as the subject it tries to explore--i don't mind the nudity and the violence--but i do mind the empty poses people put on to try and be cool, and that's what this movie achieved. the whole thing is vacuous and the dialogue is HORRIBLE. like really bad. the sequence where franco starts reciting his \"poems\" were among the worst dialogues ever written in cinematic history. and god the girls were HOT HOT HOT, but even that cannot save this BS. no plot, no characters (the girls don't have names even?), no nothing. what a waste of hot chicks.",
      "total_reactions": 1,
      "user": "tonnu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2014
      },
      "score": 0,
      "text": "This is the worst movie that i've ever seen, it's like a porno!! And Selena Gomez is the worst actress that the world ever seen!!!!!!! It's Terrible!!!!!!!!!!",
      "total_reactions": 1,
      "user": "Raniel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "I don't know why so many negative reviews for this incredible movie. Spring Breakers is a beautiful movie, but unfortunately very few people understand the real meaning of it. The direction and the story are magnificent, the film isn't tiring, it has sad and happy scenes but the both fit together. I have no words to describe it. People should stop focusing on the **** and start focusing on the film.",
      "total_reactions": 1,
      "user": "ryandiamandis"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 2,
      "text": "The plot was very poorly drawn out. The characters were very hard to relate to. There were a few interesting camera angles and sequences on occasion, but most of it was the same, slow motion sequences of people drinking and partying.",
      "total_reactions": 16,
      "user": "ryan_carr772"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "This film is an enigma.  There is so much exploitive female pulchritude that it at times offensive.  But there is a compelling story underneath and a quite good performance by Franco as a scumbag trailer trash hood.  Also a surprising end",
      "total_reactions": 3,
      "user": "StevieGJD"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "The critics hate almost every movie made but somehow actually liked this film? Wow, I can't say I'm surprised, those morons will give any artsy fartsy movie a good rating. The reality is that Harmony Korine made a terrible movie that has no actual point other than to show an unnecessary amount of nudity and tell a 45 minute story in 92 minutes because the movie repeats itself the entire time. The acting was actually fairly decent but beyond that why bother even watching? If you want to watch a handful of stupid girls make exaggeratedly stupid decisions in a film that drags and has no point, this is the movie for you. If you want to be entertained, don't bother.",
      "total_reactions": 3,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "Seriously, what was the point of this terrible movie? First half of the film was mildly interesting while the second half was one long horrible boring tangent. With all the provocative material you would think that would keep things amusing, but it was so tiresome to watch. It was pointless. It went from lets enjoy spring break to lets kill people. Utterly stupid.",
      "total_reactions": 3,
      "user": "Trev29"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "Spring Breakers starts with a good idea. The result though is awful. It has no sense this film and there is not something going on. It is boring ,lame and the storyline is dull. You will easily get bored in that film and you will waste a huge amount of time. The trailer seemed an extraordinary film and I though at first that Spring Breakers is going to be one of my favorite films. However, I was disappointed by the result. The actors and the characters were not interesting  I liked the direction though and while i was watching that film i was waiting for something to happen but nothing happened at all. This movie is a huge waste of time and I don't recommend it. I watched it with friends and they all didn't like it. Why did it have even one good review is a strange mystery for me  Do a favour to yourselfs and don't watch Spring Breakers. If you want watch the trailer three or four times.* I was expecting for some sexual scenes as I read about that film and it had not a great amount of them but even that couldn't make the film better*",
      "total_reactions": 3,
      "user": "Kiva"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2013
      },
      "score": 2,
      "text": "This movie had such great potential. If it just followed the compelling",
      "total_reactions": 10,
      "user": "mbeckford"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "Four chicks go to Fla for vaca and end up involved with a very funky gangster (James Franco with braids and gold teeth). There's about 20 minutes of total narrative here. The rest is a montage of college partying (tons of T&A;, blunts, booze and blow) and bad arty montages with repetitive VO. Franco is fun to watch as he chews the scenery with those goldies and even goes down on two guns, literally. I don't understand how today's short-attention-span audiences can enjoy this, because it's one long, slow Girls Gone Wild music video. I might have enjoyed it as a short, but found it painfully dull and pretentious.",
      "total_reactions": 5,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "The worst “movie” I have ever seen. This movie was a pile of terrible directing, bad editing, average acting, and worst of all screen play. This movie could have been an average short movie, since most of the movie consisted of repeating the same shot over and over again in slow motion with gun voice effects in between each shot, At the same time topping it off with completely useless shots with no relation to the story of the movie. As far as acting goes, it  was average and it was more because of terrible screen play that it looked terrible. In general, this movie is consisted of 70 minutes of girls in bikini jumping around in slow motion, really bad softporn, and slow motion of shots where the actors were posing for the camera. The other 20 percent is each character’s two line that keeps repeating over and over and over again, and jumping between scenes that somehow manage to tell the week story of this movie.",
      "total_reactions": 12,
      "user": "nsmnavid"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2013
      },
      "score": 3,
      "text": "Horrible! I was expecting more but was so turned off by the lack of depth and gratuitous soft porn type shots. I was bored and wanted to leave half way into it (a couple sitting in front of me did).  I only stayed to see if it could redeem itself ....unfortunately it did not. Can't believe this was actually made!....this is a definite insult to my intelligence. Completely unbelievable .......these college girls could suddenly turn into killers, robbers....no big reaction to getting thrown in jail?....don't waste your money!",
      "total_reactions": 23,
      "user": "Trishp"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "I can honestly say worst movie I have ever seen in my life. Dragged on way too long and im still confused as to what the plot even was. I've never walked out on a movie before until i seen this one, too bad to finish.",
      "total_reactions": 16,
      "user": "l30NITA"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "This was easily the worst movie I have ever seen in my life. It had zero plot, horrible acting, and was a glorified cinemax porno. What an absolutely trash film. I even got my money back after putting up a huge stink to the manager after leaving the movie, luckily I wasn't alone and they afforded everyone their money back. What an absolute joke of a film and WITHOUT A DOUBT the worst movie I've ever seen in a theater. Watching someone take a dump would have been better and more entertaining than this film, if you can even call it that.",
      "total_reactions": 16,
      "user": "jete26"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2013
      },
      "score": 1,
      "text": "Not one character in this movie came off as anything other than a contrived caricature, with the exception of maybe Selena Gomez. The directing was very showy, and very style over substance. The dialogue didn't give any depth to the characters, nor did it allow any sort of connection between the audience, and the situations the characters were going through. Some of the writing was pretentious, without any sort reason to be so based on merit. People who want to see it for mindless fun and partying will be disappointed, and people who want to see a psychological depiction of the demise into a life of crime will be disappointed as well. It attempts to be both, and the attempts are very obvious. I don't want to see a director or a writer trying. It was like something you'd see in a high school's literary magazine, trying to be deeper than it actually is.",
      "total_reactions": 6,
      "user": "MichaelDN"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "This movie was nothing I had expected. I find it very hard to come up with a clear black/white answer about how good the movie was because it was so abstract. Very intense movie made possible by abstract lighting, camera angles, flashbacks, and editing. The pace of the movie was very fast leading up to where the girls went on spring break, which made sense, yet it the pace was constantly fast for the rest of the movie, adding to the insanity of the movie. It was definitely more psychologically involved then I could have ever thought, but not necessarily in a good way, just an interesting way that made you uneasy of how messed up these girls are. I don't think it's fair to give this movie a score lower than 3, just because it was quite interesting. However, this movie did have very terrible moments. I'd give James Franco's performance a 4/10. He was mostly convincing, but was playing a terrible character. I'm not bashing his acting, I'm just surprised that he degraded himself to such a stupid character. Too many unneeded raunchy scenes and other party scenes that were repeated through the whole movie really made the movie worse. There is no connection to any character whatsoever. The ending is mixed. While it was too unrealistic, abrupt and should have explained more, the out-of-the-blue effect it has makes it interesting. When you leave this movie you will have a \"What did I just watch?\" feeling. All in all, I liked it, but just barely. It kept my attention for the most part and was interesting. However, you might not want to waste your money at the movies seeing it.",
      "total_reactions": 4,
      "user": "GatorZero"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Spring Breakers is a pleasant surprise despite being uneven, in some parts silly and outrageous, but most of Spring Breakers being first rate art-direction with charming performances especially coming from James Franco, it isn't everyone's cup of tea, but still it is worth checking out.",
      "total_reactions": 4,
      "user": "MovieGoer14"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "According to Merritt, a WASP-wanna-be from the Midwest, Angie possesses \"a criminal mind\"(a subtle dig at her friend's Italian heritage), and indeed, all her talk about \"cutting corners\" to save money on their Florida trip in Where the Boys Are, does evoke Goodfellas, when Henry Hill gives us the nuts and bolts of mafia life. Far from hijacking trucks, the caper that Angie proposes is a \"steak-out\", described by the brunette as follows: you order the meat, you eat half, and then you bring the other half back to the $22/a night motel room that they share with two other girls. Thoroughly modern Merritt, despite being the class spokesperson for \"playing house before marriage\", antagonizing her professor in the process after a lecture on \"random dating among college freshmen\", is in actuality, a virgin, but the blond is progressive, therefore corruptible, so the girl goes \"wild\", allowing herself to be Angie's partner-in-crime. At a local hangout, we see the Italian on her latest job(with Merritt in-tow), masquerading as paying customers, in which the broke girls nurse complimentary cups of hot water flavored with contraband teabags, while nibbling on bring-your-own-saltines that they shuttle to and fro below the diner countertop in their attempt to escape detection from the greasy spoon's proprietor. For this, hijinks which seem tame compared to, say, armed robbery and first-degree murder, Merritt half-jokingly tells Angie that her scheme will land them in San Quentin. For its era, they were loose, because good girls, as portrayed in the movies, thought about going steady, not going all the way, or \"backseat bingo\" as Merritt puts it. Whereas Tuggle asks a male hitchhiker, \"How big are your feet?\" Candy, in Spring Breakers, is less coy, holding up a sign for Brit in a darkened lecture hall that reads: I want penis. More than no guilt sex, or to borrow the professor's formal terminology: premature emotional involvement on a first date, what Brit and her friends really lust after is money. No cutting corners for these toxic princesses; this is a new breed of \"kids\". To procure a bankroll for their booze-and-drug fueled vacation, they rob a chicken shack, intimidating the customers with squirt guns, hammers, and 'tude. Safe to say, when Brit, sensing apprehension from her partners concerning their felonious plot, tells them to \"act like you're in a movie,\" that movie isn't Where the Boys Are. Although the girls are no angels; they drink and smoke(Tuggle shows a fake I.D. to the barkeep, while Merritt and Melanie puff on cigarettes), and have sex(Melanie has multiple partners, the last one ending in date rape), their debauchery is no match for all the bong hits and alcohol that find passage through the half-naked bodies of these libertine sociopaths. Quite pointedly, the girls in Where the Boys Are dig jazz, dialectic jazz, played by white musicians, akin to Spring Breakers, where Alien, a rapper/drug kingpin, plays hip hop to the sunburnt party people; a white rapper, whose antecedent, Basil, the white leader of a bebop trio, are homologous entities in their appropriation of what is considered to be a black music form. Given the seamless diversity among Larry Clark's Kids, the fluidity in which the contravening cultural group manipulates the expropriated genre on the beachfront stage would seem to be an intentional ploy on the filmmaker's part, since the diegetic music performed by the co-opting musicians in Spring Breakers, accentuates the unexpressed but readily apparent segregation laws that keeps the Ft. Lauderdale of Where the Boys Are uniform with one single skin color. At the outset of the 1960 film, the university campus that the girls attend is inundated with snow, and more importantly, a strong gust; an unintentional, but nevertheless, pointed metaphor about a change in the wind that would beget the Civil Rights Movement. Faced with a remodeling of the social stratum, the girls, conspicuously, head south. Back at the aforementioned diner, a male patron seated next to Merritt, spreads ketchup over a slice of white bread. Contextually speaking, the innocuous act now reads as her indifference to shed blood, the fallout from racial strife. Although Brit and Candy gun down numerous young black men at Alien's arch-rival's compound, their skin color, arguably, is a matter of sheer happenstance. They're post-colonial. The victims could easily have been white. Granted, at a seminar, the BFFs ignore a murder scene photograph of Emmitt Till, the 14-year-old boy whose death spearheaded an activism for social change. And yet, the same girls seem at ease with Alien's crowd, primarily black, at a run-down pool hall. It's Faith, the innocent and sheltered one, cut more from the same cloth as Merritt and her pals, who feels anxious and uneasy in mixed company. Faith is a proxy, a throwback, the good girl interested only in where the white boys are.",
      "total_reactions": 2,
      "user": "Shiira"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "It really seems like the movie is a vehicle for Harmony Korine to shamelessly get his rocks off of starlet T&A.; The dialog induces cringing and eye-rolling throughout, and the movie makes a rock-solid case against putting James Franco in movies.",
      "total_reactions": 2,
      "user": "Xax"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2014
      },
      "score": 1,
      "text": "Wow this was just pure unadulterated trash. Not one character, aside from maybe Selena Gomez' character and James Franco's to some degree were likable. The film was essentially an incoherant mess with a random assortment of scenes that really lead nowhere. In fact, I found myself trying to figure out what the movie was about after it finished. The acting was ok, I would be hard pressed to think of another positive. I mean, the film did a good job making the ending intense, but even then, it felt sort of pointless and random. Intense, sure, but useful? Not at all. That is how Spring Breakers is defined for me, really. A bunch of scenes and situations that were dragged out for far too long. For me, this one felt like a horrible music video that was an hour and a half long rather than just 3-5 minutes long. Hell, even if this one was just a music video, I would still hate it.",
      "total_reactions": 2,
      "user": "Spangle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "This has to be one of the worst movies I have ever seen.  There is nothing in the movie to recommend.  The movie is only about an hour long, but it keeps showing the same scene over and over.  The story is completely ridiculous and unbelievable.  The acting in universally bad, and you do not feel for any character.  Just awful.",
      "total_reactions": 2,
      "user": "Chipper12345"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "The worst movie of the year. James Franco has officially gotten on my last nerve. Does Slena Gomze think she can act. It made me want to puke it was so vile and gross.",
      "total_reactions": 2,
      "user": "MovieMan12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "Dang was this a weird movie,but enjoyable. It was missing a lot of detail I felt when it was over there was a lot missing,but over all a nice movie to chill down to watch.",
      "total_reactions": 2,
      "user": "M9ki"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "Just plain bad. I get it, you made an \"artsy\" film. But artsy hues, creative shots, and choppy editing do not automatically equal artsy. It seems like a lot of people hear that a movie is artsy and deep and immediately decide it's good. Maybe they're afraid people will think they didn't get it. If that's the case then call me ignorant, but this movie had 0 substance. Its as big a pile of trash as the characters it displays. I would say about 15 minutes of this whole movie advanced some sort of plot. The rest is useless flash forwards, flash backs, and just plain flashes. I suppose there was some attempt at social commentary, but it was poorly developed. The worst part is that the acting wasn't bad and it was shot in a way that had it actually had a good story, it could have been a phenomenal film.",
      "total_reactions": 2,
      "user": "BobLeeSwagger"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "I recently bought this on Blu-Ray because I missed it in the cinemas. After watching it I can say I truly enjoyed it, the direction was amazing, I feel like the story fell apart at the end and became less believable but I enjoyed it non the less. The soundtrack was great and the use of the songs was appropriate and with intent. I think all the main cast did a great job acting wise, with special mention for James Franco, he really gave it his all and it shows. Despite all these positive feelings I still feel like its a Marmite film and will disappoint allot of people, for me though the story went in a direction I wasn't expecting and kept me interested throughout.",
      "total_reactions": 2,
      "user": "Livid_Carrion"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "Spring break is getting to be like prom night or Thanksgiving: an alien American institution we've consumed so much in pop culture that it's almost as if we Brits have experienced it in our rainy Brit lives. Anyway, we're expected to be in on the cultural reference  in this case, lithe, young college kids partying super hard in sunny Florida during the March vacation. The Glasgow comic Kevin Bridges famously took a stand against this Americanisation, dourly recalling watching high school movies with \"spring break\" scenes: \"We didn't have 'spring break'; we had the Easter holidays.\" Like a Christmas movie in December, this film has actually been released at the correct seasonal time, although it means less in the shivering UK than in the US. James Franco's creepy gangsta character in this film is always intoning the words: \"Spring Breeeeaaak  in a state of bleary ecstasy, as if invoking, or desecrating, a quasi-religious icon.Harmony Korine has given us a violent pulp true romance that could be renamed A Pre-Summer's Night's Wet Dream. Like the exploitation films by Quentin Tarantino and Robert Rodriguez, it's the kind of movie that looks as if it was created to fit the poster. The difference is that those films signalled that they were faux-trash. This is more like the real thing. Spring Breakers is Korine's most technically competent and fluent movie; probably his most commercial, his funniest, perhaps even his least irritating. The plot concerns college students who are bored with their course and their lives: they zone out and pass rude notes to each other during lectures on African-American experiences in the postwar US; this academic subject is a deadpan touch of insolence on Korine's part, considering the overtly racial aspect of what is finally to happen. These badass girls are Brit (Ashley Benson), Candy (Vanessa Hudgens) and Cotty, played by the director's wife, Rachel Korine. From their kindergarten days, they are friendly with Faith (Selena Gomez), a modest Christian girl. Our heroines are desperate to go on spring break, but have no money  so with daring, masks and a fake gun, they knock over a fast-food restaurant and gloatingly exult in their cash (\"It makes my  look bigger!\"). Taking Faith with them, they head for party central in the Sunshine State, falling there under the dangerous spell of the drug dealer, rapper and automatic-weapons-enthusiast Alien. He is played with tattoos, metal teeth and cornrows by Franco. Alien conceives a kind of passion for these women, like a non-pimp pimp who doesn't intend them to have sex with anyone but him. All too clearly, Korine is ventriloquising himself with this character. He creates four lissome heroines who appear in their bikinis pretty much all the time. Even in court. After a while, you have to wonder where the heck they are keeping their hotel-room keys, cash and phones etc. Korine became notorious with the script he wrote for Larry Clark's Kids in the 1990s and now, at 40, he has achieved  well, not maturity exactly, but a kind of seniority, bordering on the maestro-perviness of the great Clark himself. Like that other spring-break classic, Piranha 3D, Spring Breakers is naturally an excuse to show lots of semi-naked women and men  but mostly women  with in-your-face/in-their-swimsuit-area shots. Alien is always gasping at how pretty his foursome are: giggling, they pose for the imaginary photo he frames with his fingers  and yet all the women and indeed men on camera are pretty. Korine is giving us a preselected, pre-auditioned representation of youth and beauty. For all its absurdity and voyeurism, Korine brings to it a real authorial style. He shapes the pulp. He leches over the women, but he is also on their side. It is a world away from his (interesting) experimental piece Trash Humpers, and also, thankfully, from his excruciatingly annoying drama Mister Lonely. The colossal party scenes  in the pool, on the beach, in the hotel room, on the balcony  are coolly choreographed in montage, and the more desolate \"reportage\" shots outside all-night convenience stores look good. There is an undeniable directorial strut in Spring Breakers. Where, precisely, he is strutting to is another question. As for Faith, the good girl, her role is unexpected. Much is made of her attendance in Christian prayer groups, which sometimes convene in front of a huge stained-glass window. Given Faith's background, I wondered if there would be some reference, ironic or otherwise, to Good Friday or Easter Sunday  the events that license the holiday. But no. I suspect the idea never occurred to Harmony Korine for a moment. It is an entirely pagan entertainment.",
      "total_reactions": 9,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "This is the first and will most likely be the only time that I experience anything so horrifically bad that I am compelled to write a user review of it. This is literally the worst movie that I have ever seen. This movie is actually so atrociously bad that showing it to detainees ranks as torture under the Geneva Conventions.",
      "total_reactions": 5,
      "user": "MoeCim"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "This film contained visually enticing cinematography with a oddly hypnotic aura. Seeing the neon glows fused with the gritty score of Cliff Martinez and Skrillex's party anthems made Spring Breakers that much better. If that does not hook you on, then James Franco's entertaining performance will.",
      "total_reactions": 11,
      "user": "Eon2323"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "I didn't just watch this movie. I experienced it. I did not want it to end. Everybody in this movie was so nice. I just wanted to stay there forever and have fun. All the other movies out there are all the same compared to this music videostory. Nobody could ever figure out how it will unfold. They just know that somebody has to eventually have consequences in a fantasy land where responsibility does not exist... The only question is who and how. For that answer you have to watch this alternative treat. Just be sure to leave the kiddos at home this movie should be rated nc-17.",
      "total_reactions": 12,
      "user": "analogkid280"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "My friends and I saw this movie at a film festival and that was extremely grateful for us. But I must say this film shocked me. I've never seen a film by Harmony but after this I must check out his work. Selena sheds her good girl image and gets a little bad in her sadly SPOILER ALERT, she left when things got real bad so she was only in a very small amount of the film. Other then that she really stepped up in this. Vanessa since her movie Bandslam, Beastly, and Sucker Punch I have no longer looked at her as the cheesy High School Musical character I see her as a young, beautiful, and talented actress. In this she got really down and dirty, and some might think its slutty. But there all playing college girls on Spring Break they wont sit around and watch TV they will party there asses off. The pairing of Ashley and Vanessa was a good combo. Rachel the directors wife I believe I think made her acting debut superb. James eh. Just James a good actor came in on his A-Game. Skrillex scored the amazing soundtrack. And when I say amazing I mean it. The film is stylish from pink-blue-neon-glow in the dark everything colorful. To the fans who write comments like 'This is slutty or bad for them', you are one of the main reasons they do it. If I were on Disney what 4-6 years and Im 24 I wouldn't want people saying stop your a Disney Robot go back to HSM. No I want to be seen as more then that an actress (Baby V Shines). This is a movie ment for the 16-29 year old target.",
      "total_reactions": 9,
      "user": "MarkMusic"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "This film is awful the main thing it relies on is half naked girls and even though there hot there still annoying and it does not make up for the lack of story or poor acting and the end scene is just a joke don't waste your time with the piece of trash no wonder America as problems with guns.",
      "total_reactions": 6,
      "user": "scoley"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "The only thing that kept this movie from being a disaster of a party move? James Franco. His performance was highly entertaining that made me wish the movie was about him in an intriguing storyline instead of a wasteful, crappy, party movie. Seriously, how many more party movies are we going to see? Ever since The Hangover, party movies have been coming out at an extreme rate. None of them, except The Hangover, were any good, and you can throw this one in the box that is labeled, \"Horrible party movie\".",
      "total_reactions": 3,
      "user": "ClayMerritt"
    },
    {
      "neg_reactions": 15,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "If your a Harmony Korine fan you will not be disappointed. Spring Breakers brings performances that are out of this world by actresses you would have never of guessed be so good. James Franco in my opinion had an oscar-worthy performance. The beauty of this will was how fun the party is and how amazing the violence can get. SPRING BREAK!",
      "total_reactions": 22,
      "user": "TheWalrus2000"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "I'm not criticize this thing from its terrible story telling skill, bad acting, pointless character, useless movement, annoying sound effect and discrimination on female. I'm not criticize this movie from its continuous display of naked body, drug use, crime for no reason. I just want everyone to ask themselves a simple question after they finish watching this thing, and that question is \"what actually is this movie want to told me?\". Is this movie, or thing because I do not think it is a movie, want to tell me that being a student is boring because you go to the same place everyday and do the same thing? Or it just want to tell me that to be myself, I need to kill others who just hurt my friend and the reason is we mess up with them first? Or it just want to tell me if your religion or body against you to become yourself then you should give up yourself? Or it just want to tell me that the reason of common people become to criminals is because they get kick out of school? Or it just want to tell me that money rocks because it can get anything you want and make your dream come true? Or it just tell me NOTHING because the director does not want to tell me ANYTHING! Maybe he is filming some weird homemade sex tape but somebody saw it so the director said \"Oh no, we are actually making a movie\". Then he get some jerks who look cool but actually are cowards and then copy some stories from those emo kids on the Internet and then we get this thing call Spring Breakers. I wish the true meaning of this thing is NOTHING or then I will curse the director and I might fight him on the street. Seriously, I swear that other people are laughing from begin to end when I am watching this movie because it is ridiculous! If you believe that this movie is trying to help people find their real identity and the truth of the world around them, and you like it. Then you need to watch The Truman Show for damn sure.",
      "total_reactions": 4,
      "user": "Shawnhan93"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "Don't be skeptical of Spring Breakers simply because you find its subject matter unworthy. Instead, let Harmony Korine's breathtaking, surreal, and confounding work of art wash over you. This is not a film. It's an experience. Spring Breakers is unlike any movie you've ever seen. It's electric, vibrant, artistic, beautiful, and, most importantly, it has something to say.",
      "total_reactions": 4,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "Lets glorify criminal activities by putting good looking girls in bikinis and Mr. Franco to the movie. Lets add some cool music too...Yeah because crime is fun and cool right? No it is not....",
      "total_reactions": 10,
      "user": "oliver1h"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "It's a polarizing film, but it's also brilliant. A new age Taxi Driver on drugs, with multitudes of themes, original cinematography and a commanding performance from James Franco. Don't miss this.",
      "total_reactions": 2,
      "user": "TastyJamProject"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Spring Breakers is a 2012 film directed by Harmony Korine. Film politically incorrect, Spring Breakers can send us a biting social commentary about young people and what they are becoming. The cast was very good but among all the absolute best is definitely James Franco. The only flaw was the ending that was supposed to be different.",
      "total_reactions": 1,
      "user": "Mad_Hatter91"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2013
      },
      "score": 1,
      "text": "Spring Breakers is one of the worst movies so far this year. It actually isn't a film other then showing continuous naked women, complete overuse of drugs and people committing crime like its fun. It not only comes across as boring and repetitive but ridiculous the way the movie unfolds.",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "For a full review go to: http://youngthespian42films.blogspot.com/2013/03/spring-breakers.html I highly recommend this movie to anyone passionate about gender politics. This movie is somewhat cerebral in its technique and the meaning and message are both up to interpretation. If you are looking for the next Miami Vice or Fast and the Furious this is not the movie for you.    This movie uses so many art house techniques to tell this story that I never had the space to discuss. This movie is just another strong signifier in my mind that we are entering a new New Hollywood era. I can't wait to keep having new and exciting experiences at the cinema. No matter what you think about this movie it is definitely a unique experience and something really different than usual Hollywood schlock.",
      "total_reactions": 4,
      "user": "youngthespian42"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "One of the most talked about movies of the early spring season is a polarizing one.  The cinematography is beautiful, and the film is painted in a flashy surrealism that carries on throughout giving a dreamy feel.  Acting and writing are sub par for the most part, though James Franco gives an electric performance when he appears half way through.  The film is indulgent and could have done with some sharper editing at times.  Still, it is an original experience at the cinema, and that is very rare in these times.",
      "total_reactions": 1,
      "user": "CriticalState"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "It could have been literally no better than garbage, but it's artfully told and James Franco gives an Oscar-worthy performance. The ending rings a little false, but the film contains the greatest use of a Britney Spears song, so all is forgiven.",
      "total_reactions": 1,
      "user": "Seriosity"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "\"Spring Breakers\" is in many way a revelation. Harmony Korine has decided to turn away from the pretentious \"shock\" of earlier films and has created a moody, hypnotic treatise on youth.  It evokes Soderbergh's brilliant \"The Limey\" in structure and tone, and the acting is terrific. The less you know the better, but there is a scene that is as uncomfortable and riveting as \"Cape Fear\"'s scene with Robert DeNiro and Juliette Lewis. In fact, Franco could be channeling DeNiro's performance, but he is uniquely original as well.",
      "total_reactions": 2,
      "user": "Johnrieber"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "Springbreakers starts like an MTV pop video complete with quick cutting and busy visuals and my first reactions were in the negative. The film is full of unlikeable characters and, along with prison, spring break seems like an activity that most rational people would wish to avoid. The voice over narration from the girls' point of view presents it as a kind of utopia that the accompanying visuals deny. There is no denying the technical package, though. Stylised direction, eye catching cinematography and skillful editing help to ensure that the film looks slick and professional and yes, after abandoning my initial misgivings, the film does become hypnotically compelling. James Franco, in another 'out there' performance, is just great as the rapper/gangster Alien and the music by Cliff Martinez adds a whole other dimension to the proceedings. One of the best scenes has James Franco playing piano and the three remaining girls singing a sweet Britney Spears song whilst inter cuts show the violence they have  perpetrated. Surprisingly good!",
      "total_reactions": 1,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "This was a hard film to rate for me mainly because the first half was getting repetitive and boring, but the second half of this film after they introduce James Franco's character was really interesting.  Franco is the best part of this film putting on a really strange and funny performance.  I was stuck between a 7 and an 8, but the style and the fact that there are some very memorable scenes give this film a very low 8.",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "the thing about Springbreakers against any prediction of how the cast make it bad in a harmony korine movie is that actually the cast gives to it a whole new level. For one, James Franco is amazing, is not just his transformation is the whole sense he gives to it, he actually is so mesmerizing there that he can convince you of everything, and then Vanessa and Ashley are so badass that you do get some kind of empathy, you do empathize with them and the whole free sense, empowering sense, isnt just about craziness, is about the sense that you can eat the world, that nothing is gonna stop you, but at the end there is smth that stops you, being it your self consciousness  but at the end they also are self contradictory and that shows what this age is about, ok we arent gonna go rob a shop or kill someone but we go under a stage where we believe we can do whatever and its not, at the end we all are tamed, and even if that means we are hypocrite because we go back to society rules, this is a sort of analogy that needs to be read with open mind, enjoy the art and enjoy the act.",
      "total_reactions": 3,
      "user": "Male22"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "Full review at  http://moviesandsean.blogspot.com/2013/03/review-spring-breakers.html",
      "total_reactions": 1,
      "user": "Conner42"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "To be honest, I think, that it should be played in every school to show young teenagers, what can happen at simple spring break. This movie is revolutionary, visionary... and I can't wait to see it again.",
      "total_reactions": 3,
      "user": "MPB"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "Tl;dr  Debunking \"the grass is always greener\" myth with the help of sex, drugs, money, and violence. It's awesome.",
      "total_reactions": 2,
      "user": "smithcaaron10"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "It has the joy of guns, love, comedy, and thriller but looses the hope to have a usual plot that discovers the joy of the film people want to see, in any sort of way.",
      "total_reactions": 1,
      "user": "Winningmartha"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2013
      },
      "score": 3,
      "text": "I haven't yet seen it, but I do work at the concession stand at a move theater. In a period of 3 hours 4 customers told me the movie was terrible (one of those 4 was a friend). Not only terrible, but so much so that 3 of those 4 customers didn't even stay to finish the movie.",
      "total_reactions": 1,
      "user": "Wolfmazter"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "text": "Probably the worst movie I've seen in the last decade. No story, bad, no, horrible script. No character development. What more can I say, don't spend money on this one, you will regret it. I have no idea why some think James Franco's performance is astonishing other then to try and rate this terrible movie higher then it should be.",
      "total_reactions": 3,
      "user": "zepoxi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "text": "Worst movie I've ever seen. The movie is literally a 2 hours music video with boobs, drugs and asses everywhere. I left the the Theater after  30 minutes of this",
      "total_reactions": 1,
      "user": "kaiser-one"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "Spring Breakers is a must see flick, it reminds me and almost playbacks \"Thirteen\" which is a masterpiece, it is not only \"party till dawn\" type of movie (Project X & 21 and Over) no, it is way more than that. The acting, I thought was good, especially coming from these types of actors (Disney Princesses) and as always, James Franco gives an outstanding performance, the plot is clever and twisty, some fight scenes are chilling, but dialogue is somewhat repetitive in one point, but still, Spring Breakers is a BLAST!",
      "total_reactions": 1,
      "user": "AReviews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "This thing swings from totally brilliant to uneven, sometimes in the same scene. At the end, I can't wrap my brain around it completely. I appreciate the visual artistry but the story telling suffers from the flash and never fully takes off. I actually think there is an iconic movie in there somewhere that either got lost in the edit(s) or just died along the way during the writing process.",
      "total_reactions": 1,
      "user": "GeekFurious"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "You just have to wonder at anyone who liked this piece of garbage.  Sure, there was lots of T&A; and some really stupid gratuitous violence but there was no point to the film. Other than for Harmony Korrine's lame attempt to show how decadent college age, brain dead, party people have become.  The premise wasn't all that bad.  Nice girls get corrupted on spring break and have to deal with it.  But the way the premise was handled was more like an adolescent male's wet dream of what could be.  Watching porn makes way more sense than this junk.  And the shoot out?  Two girls in bikinis who just can't miss against ten or fifteen guys who just killed their friendly pimp wannabe with a single shot?  Just plain dumb and a bit nauseating.",
      "total_reactions": 1,
      "user": "psyberdelic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "When I first saw this back in March, I didn't like it. I never found it to be terrible, per se, but due to the trailers, buzz, and reviews, I was expecting something that was darkly funny and satirical and I left the theater saying, \"Wow, that was a waste of potential.\" While it is both of those things some times (but very rarely), it's very bleak and kind of disturbing, with its great hypnotic and dreamlike filmmaking, dim tone, and welcome repetitiveness that showcases the hedonism of spring break activities and the youth of America. The social commentary is there with the ironic and contradictory voiceover work as well as the continual downward spiral of these four girls when their temptations are maximized and succumbed to and when their love for easy entertainment gets the best of them. The portrayal of the girls was realistic with the voiceovers talking about how \"spiritual\" their break is while showing the girls having sex and doing cocaine, and the shots intercut of Selena Gomez at her church spliced with her smoking pot. The casting was all very good; I loved how Harmony Korine decided to cast innocent-looking girls previously known for their adorable Disney work to show how innocence can be lost so easily. The acting was solid on everyone's parts, conveying the awfulness of these people. 8.4/10, great, one thumb up, above average, etc.",
      "total_reactions": 3,
      "user": "MattCipolla926"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "A shallow, uninteresting and self-indulgent film. The story didn't make sense. The cast was weak. Nothing about this movie was worth talking about. I had to force myself to finish it for the sake of being fair.",
      "total_reactions": 1,
      "user": "film_bug"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "Schlechtester Film, welchen ich diesen Monat gesehen hab.",
      "total_reactions": 1,
      "user": "v_mueller"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "Spring Breakers might be my favorite film of the year. Never before has a film made me tear up because of how masterfully beautiful it was done. A haunting and moving experience.",
      "total_reactions": 1,
      "user": "KyleHaines"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2015
      },
      "score": 0,
      "text": "It is the worst movie I have ever seen. I watched it because thought that James Franco work will be great but right now I am absolutely disappointed. Actors played their roles awful. If you like naked bodies and film with no story than it is for you.",
      "total_reactions": 1,
      "user": "Halenast"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "Spring Breakers plays out like a music video, using dialog second to action.  But whether it's action or dialog it's always going to have some kind of impact which is why I can appreciate Harmony Korine. A nice change from the norm. Not exactly for cuddling up with your sweetheart but if your girlfriend likes movies like this she's more awesome than most.",
      "total_reactions": 0,
      "user": "Scraper"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "Competent film making that could benefit from more focus on message and content. There is wisdom to be found in the world, so the movie could have taken some of that and used it to contrast the other stuff. My favorite sequence was a rendition of a Britney Spears song. And that's what the movie is good at: taking stuff that few expect to have higher qualities and then making that stuff poetic.  If there were more films like it, I would have rated it more harshly (2-3 out of 10)... recommended for people who find beauty everywhere...",
      "total_reactions": 0,
      "user": "mrnice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "There is more to this movie than meets the eye. I was expecting a dumb and voyeuristic flick, but it is more a commentary on the hedonistic lifestyles of some of today's youth with some excellent cinematography and a great score with a great performance by James Franco. Kudos to director Harmony Korine for creating a work of art. (I didn't mind looking at all the hot bods either.) Critics liked this film better than did surveyed audience, because the former are on average more intelligent. therefore, I'm not surprised at reading all the audience comments panning it.",
      "total_reactions": 0,
      "user": "jgzeger"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "A movie about crazy college girls who want to party hard starring former Disney-stars.",
      "total_reactions": 0,
      "user": "Tall_But_Short"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "I don't know how many times I would have to hear James Franco's character and his  accent say \"Spraaaang Breaaaak.\" I felt like I had been drugged and asked to sit through a movie with really no plot. This movie was a lead up to a pretty cool action sequence at the end, but the real stars were the slutty girls. They were downright sluts, which is kind of unrealistic, and they really had zero depth. Needless to say, I wish I had two hours back.",
      "total_reactions": 0,
      "user": "Fullmetal"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "4 bad girls rob a store to go on spring break (they REALY wanna go u know). There are lots of nice scenes where scantily clad (or not) girls get drunk or do drugs. It's all good fun till they get their bikini asses thrown in the slammer only to get bailed out by a white rastafarian rapper (Franco) with whom they happily descend into a more criminal existence. It all sounds more exiting than it realy is. The film feels like a trancy video commercial for T&A; spring breaks. Best watched intoxicated to better relate to the characters.",
      "total_reactions": 0,
      "user": "Apemonkey666"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "A 4/10 is the score I'm giving this movie as a placeholder. I'm not sure if I really liked it or found it ridiculous. The soundtrack was really excellent, the opening montage was really sick, but everything else... we'll see.",
      "total_reactions": 0,
      "user": "SimpleMethod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "It has occurred to me that the majority of those watching this movie are really only watching it for one of two reasons (or both). To see Disney starlets prance around on drugs and alcohol, all in bikini's wielding assault rifles. That, or a chance to see one of them topless (which by the way, they are; at least two of them...if only for a brief couple of seconds). A good 80 percent of them will have absolutely no idea who Harmony Korine is, nor any clue to his style of filmmaking. Granted, either you like it or you don't you have to understand that Korine is in fact an art-house director, and rarely follows conventional film standards. Having said that, for those who've never witnessed films like 'Kids', 'Gummo' and 'Ken Park' expect to see something different.",
      "total_reactions": 0,
      "user": "joey-clemenza"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2013
      },
      "score": 2,
      "text": "I couldn't even sit through this entire movie, and I never give up on a movie. I couldn't connect with the characters at all and I felt like I was watching from a distance. I got bored and really didn't care what happened. I found the plot jumpy and difficult to follow but maybe that was because I stopped paying attention or caring. I did like the artsy look to it but the characters and the plot were crap and a half.",
      "total_reactions": 0,
      "user": "sammietee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "nice bobbies, nice booties, but horrible story line, confusing, in all honestly this was a waste of time. would not recommend to see this. VERY disappointing!",
      "total_reactions": 0,
      "user": "stranglehold"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2014
      },
      "score": 6,
      "text": "First off this was a weird movie. I thought I would hate it. Sort of do but at the same time it surpassed my expectations. There's a lot of voice-over with conversations said in the future while showing something different. Kind of confuses you a little. There are a lot of boobs in this movie. I would say thats a plus but at the same time, it takes away from the gritty realism that the movie seems to try to achieve. Girls don't take their tops off in public and not by the dozens, at least from my experience. There were many porny shots that didn't seem necessary. I know why they were there. Without them I most people would have lost interest in this movie. It lacks depth and character development. 45 minutes into the movie and the I didn't feel like I knew any of the main cast except for Selena Gomez's character. She ends up leaving which leaves you with the other terrible 3.",
      "total_reactions": 0,
      "user": "SergeantSoz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "This movie was a huge disappointment to me. As a college girl the same age as the characters in the movie, I could not relate to these characters at all. Yes, we all want to have a wild crazy spring break, but these girls didn't just want to have fun, they wanted to hurt people. They robbed a fast food joint to get there for crying out loud. This movie had potential to  build a very strong storyline, but it was never developed. The only character we personally got to know a little bit was Selena's Gomez's Faith. I would've liked to know more about the other three girls and why they acted they way the did. I enjoy movies where I can feel the characters, this whole movie I was just dizzy because of the mixture of the weird dialogue and camera angles. I did enjoy James Franco's performance and Alien was probably the best performance I have ever seen him portray but there is no way it is Oscar worthy. I did not like this movie and I'm thankful I went during matinee hours and only payed five dollars.",
      "total_reactions": 0,
      "user": "KayWilkie8776"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "This is not a bad movie but it is also not the 10's or even 9's people give it. The movie is a social commentary about the current generation but also a comedy, in fact, it is a mix of many different genres but that is all subjective. The audience it targets seems to be your average college student and teenager. The actors do a great job of portraying their characters. The director does a pretty good job of allowing you to know what's going on but the script is a little confusing, although that could have just been me. There will be parts during which you will be wondering \"WTF\" and it can be pretty funny if you are with friends who also react the same way. Overall, it is a pretty entertaining movie and isn't the worst or the best but is enjoyable and speaks to the audience it is directed towards.",
      "total_reactions": 0,
      "user": "WhereDoiStart"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "Spring breakers directed by Harmony Korine, very cute, I did not expect much from this movie, but it managed to entertain me, good direction, some scenes I did not like, however, the filmwould recommend to everyone to spend a pleasant day is fun.",
      "total_reactions": 0,
      "user": "alescio92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "One word: Cliche. We've already have seen movies where girls are on a trip to enjoy themselves, but get caught in the wrong hands. All this is cliche melodrama. 5/10",
      "total_reactions": 0,
      "user": "TTWR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "This movie is definitelly one of a kind, but not in a good way. I did like James Franco's performance,  and I loved the cinematography. That being said, the rest of this movie is just a bunch of ex disney girls being converted into whores by none other than Harmony Korrine. Honestly, this movie was so bad, it was good. Still, I walked out of the theater with a headache.",
      "total_reactions": 0,
      "user": "RyanSolomon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "Enjoyable movie I really liked most of it, I would be interested to see a follow up maybe with Miley Cyrus. James Franco made the experience that much greater it really shows how diverse his acting skills are.",
      "total_reactions": 0,
      "user": "deemo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "I don't get the appeal of this movie and i never well. For starters they did a few things well... Cinematography was good and Jame's Franco's characters was well played and interesting. On the flip side the movie was oddly paced and had a bunch of unnecessary scenes with awkward dialogue. It just followed no formula at all that makes a movie good.. Character development was pretty bad and the ending was completely ridiculous.",
      "total_reactions": 0,
      "user": "Ryguy50"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 6,
      "text": "This movie is just so ridiculous but entertaining at the same time. Four girls on spring break end up turning hardcore what makes it so funny is the girls seeing them in this then seeing them in some of their other work makes this movie even more of a joke. James Franco was the whole reason i wanted to see this his character looked so \"pimpin\" well of course i also watched for Ashley Benson she is just too gorgeous.",
      "total_reactions": 0,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2013
      },
      "score": 1,
      "text": "Not much of a story line, it wasn't exciting and thrilling like they said it would be... I also think the actors could have been chosen better, something to spice it up a little, Bland",
      "total_reactions": 0,
      "user": "applesandorange"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "In my opinion Spring Breakers was an average movie. It had some WTF moments but it also had great moments. James Franco's character really brings the Drug Kingpin-Rapper character to life. With Gucci Mane's appearance as Franco's enemy makes the movie more intense and makes you wonder where will the bad blood take the movie. Overall this movie was unique and it made waiting for it worth it.",
      "total_reactions": 0,
      "user": "Average"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "Oh my, what a movie. This dark thriller is definitely something that we haven't seen in quite some time. James Franco's portrayal of Alien and those teen darlings (Gomez, Hudgens, Benson, and Korine) really gave that dark vibe that makes the audience want to stay and watch how it will all turn out, especially for the girls. There were too many sexual contents, but aside from that, it was a good movie.",
      "total_reactions": 0,
      "user": "twerk-king"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "this movie is nothing but a disappointment. besides being a superfiacial movie the performances are terrible. not all that glitters is gold and this movie is proof of that.",
      "total_reactions": 0,
      "user": "marymovie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2016
      },
      "score": 9,
      "text": "Spring Breakers has always been a bit of a polarizing movie and with good reason but you can't deny that this is a very surreal film with a subliminal message reflecting on modern-day superficiality and the youth of our nation's obsession with highly stylized pop culture media being so focal in their lives. The acting from the 5 leads is also very superb with a truly out of the box performance by James Franco. I can see where people can be skeptical of this movie, most will walk into it viewing as something similar to Project X or SuperBad with Selena Gomez trying to shed her good girl Disney image but its not nearly at all like that. Its polarizing but in the end, its also brilliant with Harmony sucking you in with visually enticing cinematography with a oddly hypnotic aura mixed in with a neon fused and techno filled score by Skrillex and Cliff Martinez. It can be said that this film is like scar face meets good, country girl Taylor Swift or Taxi Driver on Heroin and adderal, if you're into potential cult classics with an art house feel and subliminal genius then this movie is for you.",
      "total_reactions": 0,
      "user": "bfoore90"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2014
      },
      "score": 6,
      "text": "I went to this movie admittedly with low expectations and what I got was a slightly pleasent surprise. The film had a deeper meaning that it hinted at that I never thought would be there. The Flimmaking had far more art to it than I thought it would and the ting that made the movie a great experience was the overpowering performance by James Franco as Alien. A tattoo loving and gun carrying drug dealer/ Rapper that steals the show everytime he is on screen. Franco's Character hinted at someting far deeper and his range surprised me so much His peromance turned this movie form an unsatisfying artistic fail into a slightly above average pleasent film.",
      "total_reactions": 0,
      "user": "jordansalford"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "Spring Breakers is a unique experience featuring lots of depth and style. Harmony Korine is a great artist. That might be where to start, because everyone seems to diss this film and its director, and I'm here to disagree. He kept his style, and that's why I loved it! Most people who went to see this probably didn't know anything about him and also probably didn't care about who he was or what he had done before...",
      "total_reactions": 0,
      "user": "teosav"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "how can anybody like this movie? I saw it twice, once in theaters with several friends and once in class and everybody around agreed that it was terrible. the \"action\" scenes in it are just horrendous, and the rest of the movie is boring. This is the worst movie i have ever seen",
      "total_reactions": 0,
      "user": "doere"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "text": "Look, many people here have tried to convey how truly awful this movie was but still haven't been believed, so I will describe my own feeling as deeply as possible in order to discourage the unwary from witnessing a spectacle that will leave them forever traumatised and mind-raped : THIS MOVIE IS A CRIME AGAINST HUMANITY !!!",
      "total_reactions": 0,
      "user": "tarquin_makismo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "Perfect actresses, perfect story, perfect direction, for this, that's all **** perfect hahaha! I really miss movies like that in theaters.. the only problem is that doesn't  came to brazilian theaters :/",
      "total_reactions": 0,
      "user": "DeividAlves_"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "Summary: Spring Breakers is a strange flick about promiscuous teenagers, drug dealers, guns and sex. 60/100 [C+]",
      "total_reactions": 0,
      "user": "GuillermoBM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "\"Spring Breakers\" 10 Scale Rating: 3.0 (Awful) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "this film is magnificent, life magic.The END is MAGIC !!! it is perfect and innocent side..because of faith. innocence, evil, drugs... we have little innocence in the world and it shows in the film. evil..",
      "total_reactions": 0,
      "user": "hiatabastos"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "this film is so well done, so real, so exciting, one of my favorite movies, the performance of selena, james franco, the nteiro cast are impeccable, incredible, one of the best films of 2013",
      "total_reactions": 0,
      "user": "rebelheart123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2015
      },
      "score": 5,
      "text": "Unlike other people, I think James Franco's performance didn't really stand out. The whole movie is like a weird trip, but Franco's character was too stupidly dressed (especially the gold teeth) to not think he was a parody. I actually really liked the plot, and the actors (especially Selena) were great, and the cinematography was BEAUTIFUL as well - but this movie was like a dramatic joke. I didn't feel a connection with any of the characters, and they all seemed like they had no chemistry with eachother.",
      "total_reactions": 0,
      "user": "nanancay"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2015
      },
      "score": 6,
      "text": "O filme relata muito do que vemos hoje como as drogas por aí,o crime entre muitos outros. No filme estrela várias atrizes talentosas como Selena Gómez e Vanessa Hudgens;a linhagem foi jogado bem em quem saía do lado do criminoso Alien (James Franco). Na trama temos a Ashley Benson e Vanessa Hudgens como vilãs do filme pois roubam um restaurante para conseguir ir no festival Spring Breaker. O filme não digo que é ruim pois é excelente temos que ter uma visão positiva dessa peça filmográfica,eu realmente gostei da atuação da Vanessa menos a da Selena que não se mostrou destemida sempre na dela.",
      "total_reactions": 0,
      "user": "LilScience"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2015
      },
      "score": 9,
      "text": "Spring Breakers a very disturbing look at today's youth and how some over indulge themselves in the party life to the point  where it becomes  self destructive, i think this movie was very intriguing and stylistic with many stand out moments i think many audience members expected a party film like project x or 21 and over but its much more art house than that i think that's why the audience had a mixed reaction i don't blame them though the trailers marketed it as such.",
      "total_reactions": 0,
      "user": "TheDude-"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "the contrast between it's art-house narrative and it's trashy Miami theme is what makes the movie special, and James Franco's performance here is astonishing. The movie is odd and disturbing, but it's equally fun and enter",
      "total_reactions": 0,
      "user": "Clubsocial"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "Foxes é maravilhosa. Eu amo tudo o que ela faz, tudo bem feito, impecável. Coisa de artista de verdade, é uma pena ver que não tem o reconhecimento merecido.",
      "total_reactions": 0,
      "user": "Rosaria88"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2016
      },
      "score": 1,
      "text": "The sole fact critics loved it is showing me that this movie might be at least a 7, right? Well, wrong! I didn't even love a single scratch of it. Even James Franco decides to waste his life playing in this plotless movie. The best part about it is that I'm reviewing this movie in Spring so you can't tell whether I'll see it again or not... but because my score is a negative, it means I don't want to see it again. If you're a critic and you decide to love watching this, you can save your life by getting some eye medicine. How in the world is such a film made in 2013 can be made to be absolutely to look shamefully bad in front of public? Now if we didn't had films like Scary Movie 5 or Grown Ups 2, this would've been the worst film of 2013 I've ever seen.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2016
      },
      "score": 0,
      "text": "An atrocity.",
      "total_reactions": 0,
      "user": "123nonono"
    }
  ]
}