{
  "avg_user_score": 4.9,
  "metascore": 75,
  "mixed_rating_frequency": 86,
  "movie_name": "Spy",
  "negative_rating_frequency": 286,
  "positive_rating_frequency": 353,
  "pro_critic_reviews": [
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 100,
      "summary": "It's a comedy of exasperation where, for once, the joke isn't on McCarthy, but on everyone who can't see her skills."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2015
      },
      "score": 90,
      "summary": "As McCarthy and Byrne carry on a filthy volley of insults (with what is surely secret sisterly glee), Feig keeps his Spy machinery cranking so smoothly that nothing said or done feels as outrageous as, in fact, it is. The truth serum Spy drops into our fizzy drinks makes us feel so good that we don’t even realize we’ve been schooled."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 90,
      "summary": "Spy lampoons sexism without abandoning sex — a tough tone for a comedy to strike but one that Feig and McCarthy manage to accomplish with both a sense of justice and a sense of humor."
    },
    {
      "critic": "Bob Mondello",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 90,
      "summary": "It is, in short, a generous, smart, sexy comedy, surrounding this generous, smart, sexy star. About time."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2015
      },
      "score": 90,
      "summary": "Laugh-stuffed and making excellent use of its marquee-grade supporting cast, it promises to be a home run in its early summer release."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2015
      },
      "score": 90,
      "summary": "An uproarious blast of globe-trotting action-comedy delirium that doesn’t spoof the espionage-thriller genre so much as drop a series of banana peels in its path."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 88,
      "summary": "Feig, who wrote the Spy screenplay, encouraging his actors to improvise along the way, has his own stealth mission. For all the over-the-top comedy, zigzagging chases, and choreographed fight scenes, Spy is very much a tale of female empowerment."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 88,
      "summary": "All the actors come up aces. And let's bottle the delicious byplay between McCarthy and Byrne, whose comic timing is bitchy perfection."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 83,
      "summary": "McCarthy’s mind just seems to race in a faster gear than her costars, allowing her to blast off arias of profane put-downs with such speed and demented originality that her mouth practically shoots sparks. As a physical comedian, she possesses the greatest gift of all: She’s totally unafraid of looking stupid."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2015
      },
      "score": 83,
      "summary": "There is a giddy sense of glee that runs through most of this movie, making it feel like Feig can barely contain himself with all of the things he wants to do and show you in the movie."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2015
      },
      "score": 82,
      "summary": "Spy would be a standout if only for its ability to keep me laughing while also keeping me from figuring out who was really double-crossing whom. Add to that this extraordinary ensemble of actors (who knew Jason Statham could be this funny?), and you’ve got another memorable offering from McCarthy and Feig."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 80,
      "summary": "Spy may not be a great movie, but it is great fun. And at times it will have you wondering if there's that much of a difference."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 80,
      "summary": "Spy is hilarious and heartfelt, a terrific movie."
    },
    {
      "critic": "Genevieve Koski",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 80,
      "summary": "Spy never lets its genre conceit get in the way of its comedy, which delivers more laugh-out-loud moments than any other mainstream comedy so far this year."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 80,
      "summary": "The busy, silly script allows Ms. McCarthy to be her own best sidekick, in effect an entire sketch-comedy troupe unto herself."
    },
    {
      "critic": "Emma Dibdin",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 80,
      "summary": "A whip-smart blend of savvy parody, elegant slapstick and zinger-packed dialogue makes for the year’s most rewarding character comedy so far, and McCarthy’s best showcase to date."
    },
    {
      "critic": "Olly Richards",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 80,
      "summary": "The supporting cast is a kick. Law gets to send up the Bond role, something he could very well have played in his younger days; Allison Janney fills her boots as the angry head of the agency and Statham, frankly, should only ever play this role for the rest of his life."
    },
    {
      "critic": "Alex Needham",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2015
      },
      "score": 80,
      "summary": "Spy confirms Feig’s and McCarthy’s instinct for both the zeitgeist and the funnybone, and is sure to ramp up anticipation for Ghostbusters even higher – as well as being a delight in its own right."
    },
    {
      "critic": "Tim Grierson",
      "publication": "Screen International",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2015
      },
      "score": 80,
      "summary": "This is a generous, consistently pleasurable comedy."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 75,
      "summary": "Nobody is better than McCarthy at over-the-top comic hostility."
    },
    {
      "critic": "Susan Wloszczyna",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 75,
      "summary": "As a distaff version of James Bond in Spy, Hollywood’s reigning empress of ha-ha Melissa McCarthy has a license to not just kill the audience with laughter but also to slay us with her acting skills."
    },
    {
      "critic": "Brian Truitt",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 75,
      "summary": "Feig blends a keen sense of physical comedy and exquisite timing with all the requisite spy-flick tropes, from the trippy and stylish opening credits to surprisingly violent, bone-breaking action scenes that he refrains from playing for laughs."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 75,
      "summary": "Spy is a foul-mouthed, often hilariously disgusting, slightly padded comedy that soars on the strengths of writer-director Paul Feig’s wonderfully idiotic script and nimble camerawork, and the bountiful comedic talents of Melissa McCarthy, Rose Byrne and Jason Statham."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 75,
      "summary": "The character is sweetly sympathetic — less “Tammy” than “Mike & Molly” — and the laughs and chaos are all the more infectious for it."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 75,
      "summary": "The fun of Spy comes in watching the right actors mess with their own images, blithely."
    },
    {
      "critic": "Jesse Hassenger",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 75,
      "summary": "Spy, similarly, doesn’t exactly send up James Bond or Jason Bourne espionage thrillers, but it places McCarthy in the middle of the action while subverting the traditionally male domination of that arena."
    },
    {
      "critic": "Steve Macfarlane",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2015
      },
      "score": 75,
      "summary": "It's the sustained, full-bodied mania of Melissa McCarthy's performance that anchors the film's many winning blind-alley gags."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2015
      },
      "score": 75,
      "summary": "Feig's commitment to the genre, and some truly wonderful set pieces, make Spy as lovable as its main character."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 70,
      "summary": "McCarthy has much more to discover about herself as an actor and an avatar and a cultural signifier, and I hope she doesn’t get trapped by one role, one genre or one franchise. But her campaign of conquest is going well."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 67,
      "summary": "Some of the combat scenes work, including a kitchen-set hand-to-hand battle that's one of the movie's highlights, but more often they feel superfluous at best."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 63,
      "summary": "The problem is that writer/director Paul Feig became too enamored with his storyline which, at best, could be described as a lame James Bond parody."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 63,
      "summary": "As cinema, Spy is content to cater to its own conventions, hit the required marks and earn a few laughs along the way. As a cultural bellwether, it does something bigger and more important, without ever italicizing that fact."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 63,
      "summary": "The fights and deaths are somewhat comical, the one-liners hit or miss and the stunts faked with less sleight of hand than a director experienced in action might have managed. And Feig can’t bear to end this thing, which goes on far past the point of endurance. But he’s done better by McCarthy here, and she has delivered a performance that’s more deft than her usual daft."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 60,
      "summary": "Spy boasts tons of the type of low-humor that fuel so many Seth Rogen and Will Ferrell frat-boy movies. The difference here is that the laughs aren't at the expense of the fat kid. By the time the closing credits roll, McCarthy's character been built up, not torn down -- and we're rooting for her, not guffawing at her."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 60,
      "summary": "Feig keeps throwing so much stuff at you — gross-out gags, chases, brutal violence, not to mention actors working their heads off — that he finally wears down your resistance. In the end, I admired him for keeping this ramshackle construction together, casting performers I adore, and proving that Melissa McCarthy can, indeed, hold a gun. A mixed victory. A definitively mixed review."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 60,
      "summary": "The moments when Spy falls apart are when the film fancies itself the real thing. The times when it works are due to its leading lady."
    },
    {
      "critic": "David Ehrlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 60,
      "summary": "Though it’s been two years since they collaborated on \"The Heat,\" Spy makes the case that Feig and McCarthy are still just warming up."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 50,
      "summary": "This is a different sort of comedy that more or less succeeds on its own terms, despite that fact that you find yourself rooting for the post-Snowden CIA."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 50,
      "summary": "Alas, “sad case” is not how we want to see McCarthy; it’s frustrating to see her spend more than half the movie being the pathetic target of jokes rather than the dominating figure she was in “Bridesmaids” and “The Heat,” both of which are far funnier than this one."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 38,
      "summary": "With the overlong, limp and lazy Spy, Feig has lost his mojo."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 19,
      "pos_reactions": 16,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "This is a really funny movie. There was so much laughing from the crowd, you even missed some of the jokes! Many great performances. Don't believe any negative reviews from people who can't laugh. Go see it!",
      "total_reactions": 35,
      "user": "daviddk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2015
      },
      "score": 9,
      "text": "I saw the unrated version of this film and it was hilarious, full of vulgar language, extreme violence and some very graphic nudity that involves a selfie and a man and his \"junk\". Melissa McCarthy is brilliant as were Jason Statham, Rose Byrne and British comedic actress Miranda Hart. If you get a chance watch, all of the end credits all the way through, as they have a bunch of other possible scenarios of future \"Susan Cooper\" adventures. I smiled through almost the entire film and even laughed out loud several time. It's very entertaining and a huge improvement over \"Tammy\", which may be one of McCarthy's worst films.",
      "total_reactions": 4,
      "user": "WJS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "This movie made me crack up countless times. Not just a belly laugh. I'm talking a real crack-up. A hit my leg kind of laugh. Engaging story, direction, photography, as expected. The performances, especially Byrne's and Statham, are hilarious. But obviously, the real winner in this film is McCarthy. She just walks on with her sad costume and proves everyone just how bad-ass and agressive she can be while remaining the character with the wittiest, funniest one-liners. Paul Feig: you are a genius and can't wait for your Ghostbusters movie to come out next year.",
      "total_reactions": 4,
      "user": "carlosgz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2015
      },
      "score": 9,
      "text": "Great movie with characters that are consistently funny.    Jason Statham plays a hilarious parody of his other roles, and McCarthy as the lead shines as a desk jockey coming out of her shell.  \"Spy\" also avoids dumb plot-driven humor, instead favoring hilarious characters.  People who like \"da dum, cha\" punch-liney comedies might be let down, but who cares about those idiots?  \"Spy\" is smarter than it lets on while still delivering belly laughs.  There isn't much to not like about this movie, it's great escapist fun.",
      "total_reactions": 4,
      "user": "mtg837"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "Just when I thought that Melissa McCarthy had worn out her comedic welcome (thanks to Tammy and Identity Theft, a bad one-two punch), I guess all she needed was her Bridesmaids and The Heat director Paul Feig to get her out of her slump. The plot is very similar to Get Smart (or even Johnny English). When all the other agents are compromised, a lower level assistant is recruited to field work. The difference is that McCarthy's character is very good at her job. And it's the characters she bounces off of and their interaction that makes this movie work, beside the chase scenes and action sequences (which are all staged well) . Jason Statham plays off his macho image brilliantly, with every manly boast getting more absurd. Rose Byrne continues her comedy streak as the **** And just as Fieg introduced Rebel Wilson to American audiences in Bridesmaids, Brit Miranda Hart is great as the gawkward best friend. A pleasant surprise.",
      "total_reactions": 3,
      "user": "jamess"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "Melissa is the star of the film and shines. This is McCarthy at her best.",
      "total_reactions": 3,
      "user": "sexyanne"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2015
      },
      "score": 9,
      "text": "This film is one of the funniest films of the year so far. The jokes weren't plain and bring, I loved Allison Janney and Miranda Hart in this film because their they were really amusing and weren't used  in places they weren't need but used appropriately. This film is humors and Melisa did a fantastic job, as did all of the cast",
      "total_reactions": 3,
      "user": "MrMrianit500"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "A redefined wonderful spy movie.",
      "total_reactions": 2,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "No question Paul Feig just gets Melissa McCarthy.  In this film not only is she funny but she's tough while keeping a real vulnerability.  Along with McCarthy you also get Jason Statham, Jude Law, and Rose Byrne giving great performances.  This is a funny movie in which you still care about the spy elements.  A-",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "After a bunch of critical failures following Bridesmaids, I though McCarthey's career was over. But after seeing her dramatic work in St. Vincent this year, and her returning to a great comedic role in Spy (for which she was nominated for a Golden Globe), it looks like she may go back to making good movies again",
      "total_reactions": 1,
      "user": "jfla"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2015
      },
      "score": 7,
      "text": "Some scenes in the movie does make me cringe of Melissa McCarthy's performance, but she was surprisingly good in her role as \"Spy\" turns out to be a jolly-solid comedy spy film.",
      "total_reactions": 7,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2015
      },
      "score": 7,
      "text": "Funniest movie I've seen in a while. Thought it isn't exactly awe-inspiring (some jokes don't hit the ground), it's still well-acted and enjoyable for the most part. Gotta love Jason Statham and Rosa Byrne's characters respectively.",
      "total_reactions": 5,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "Spy is witty, hilarious and doesn't rely on cheap jokes, even the over the top insults are clever. We witness a quiet desk bound CIA analyst's descent into a strong and wild character. Definitely makes us oversee the feeble attempts of \"Tammy\".",
      "total_reactions": 5,
      "user": "DNails"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "Messy and formulaic but hugely enjoyable nevertheless, Paul Feign and Melissa McCarthy's third team-up Spy is a fun genre film with plenty of laughs and solid performances.",
      "total_reactions": 3,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "***   The movie's not over till the fat lady zings. (Isn't there a verb for “zinger”?) Oh, she sang, all right; she's down in the dressing room getting dry-humped. In other words, the movie is funny. It's not a spook spoof, it's a spy comedy, with lots of kinetic talent, instant classic lines (aforementioned zingers) in the vein of “Top Gun” and a great sideshow of Statham spoofing Statham.",
      "total_reactions": 3,
      "user": "globalnomad"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "Pretty good film. Totally filled with humor under humor sauce. Only problem is that it's 90% vulgar (if not all 100%) but it makes film even funnier. Plot is very interesting and plot twists are really unpredictable especially 1 in the end with nuke trade (don't worry, it's not a big spoiler). I think, if you're not opposed to vulgar stuff, you really should give it a chance. Or at least sacrifice 120 min of your free time for Statham. It's his best role in his career. Really. Best.",
      "total_reactions": 8,
      "user": "Deadly_Traveler"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 0,
      "text": "Melissa McCarthy stars in 'Roseanne Blart: Spy Cop', playing a desk-bound CIA analyst who volunteers to go undercover and find a deadly arms dealer. Okay, i'm sorry, let's try and be professional.",
      "total_reactions": 23,
      "user": "FilmGob"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Though Melissa McCarthy is on the verge of being typecast (or has she already) this film is funny, smart and sassy. I loved the deadpan humour and action. Jason Statham though does need to work on his comedic timing.",
      "total_reactions": 5,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2015
      },
      "score": 9,
      "text": "\"I once drove a car off a freeway, on top of a train, while I was on fire. Not the car -- I was on fire!\" Growls Jason Statham’s Super macho super spy during one of many hilarious scenes in this Over the top spy comedy.",
      "total_reactions": 5,
      "user": "Closeremperor16"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "A movie without a heart",
      "total_reactions": 5,
      "user": "SirNilesIV"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "A lighthearted good time in this thoroughly entertaining movie you can bring your teenagers to. Expect it to be a great movie to bond with friends or family over. Perfect for a girls night out. You'll share some good laughs, and enjoy an uplifting story.",
      "total_reactions": 5,
      "user": "MenaBanana"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "Like with Bridesmaids, Paul Feig managed to make a great comedy that would still be a great movie even if there were no funny moments in it. What really makes this movie work is that it is just as much of a spy thriller as it is a comedy. It is thoroughly entertaining in both aspects. Another reviewer said she just randomly turns into a competent agent, but I don't think that is the case. I think she was competent from the beginning. The problem was just that they didn't believe in her. There's often talk of badass females in action movies and this is one of them. The story in my opinion is intelligent and layered, which makes for an exciting movie going experience. Definitely one of the most entertaining movies I've seen this year.",
      "total_reactions": 12,
      "user": "MichaelDN"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Before watching this film: N/A",
      "total_reactions": 7,
      "user": "43in2014"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "Far exceeding my lukewarm expectation, Spy arrives as a cementation of the creative pairing of Feig and McCarthy, and could end up as the funniest film I see all summer. It’s without a doubt the return to form McCarthy so demanded after her recent output of comedic sludge (St. Vincent lacked enough of her to erase the grease-stain that is Tammy). More than that, Spy is legitimately, refreshingly hilarious. It’s fantastic cast play up acidic vitriol and exponentially vulgar material with game performances across the board, particularly from Jason Statham (more on his brilliance later).",
      "total_reactions": 7,
      "user": "DRauchDoes2015"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "This is definitely the best comedy of the year so far, and the best movie by Melissa McCarthy. The plot wasn't as predictable as The Heat, and the movie just made me laugh so hard. Jude Law, Rose Byrne, and Jason Statham were also fantastic in this movie and the plot was just so fun! I really want Paul Fieg to keep teaming up with Melissa McCarthy and keep making comedies like this.",
      "total_reactions": 7,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "The movie has action just like a James bond movie, but it also has the awesome humor of Malissa McCarthy. If you dont like Malissa McCarthy and her style of humor you probably wont like this much. I think it is funny, original, and worth a high score...",
      "total_reactions": 7,
      "user": "ama19921"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2015
      },
      "score": 9,
      "text": "An unexpected delight! This was a fast paced, tongue in cheek satire that was clever, intelligent and punctuated by frequent hilarity. Mcarthy is brilliant, and Statham displays a hitherto unseen sense of comic timing that was utilised to great effect. A surprising script peppered with every expletive you can think of, and probably some you can't, and some rather visceral violence ensures that Mcarthy will be thought of alongside other famous on-screen spies. The action sequences were excellent and the dialogue was absolutely superb, with so many memorable lines. In the same league as Kingsmen, though not quite as polished, this was a thoroughly enjoyable film. 8.79/10",
      "total_reactions": 7,
      "user": "Jess_Hill"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "McCarthy is made for physical comedy, and she certainly made it work here. Of course, much is due to her bulk and the numerous ways she exploits it for comic effect. Then there are her priceless facial expressions. Hilarious. I would have given this flick an 8 if it weren't for the overuse of the f-bomb. It seemed as though the screenwriter opened that spigot in the last quarter of the movie, and those bombs soon felt contrived and utterly gratuitous. I served 20 years in the Navy, and I don't remember sailors using such language. Have never understood why Hollywood writers feel so inclined to use it with such a heavy hand . Is it supposed to be earthy? Beats me.",
      "total_reactions": 9,
      "user": "nautico"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "After \"The Heat\"  director Paul Feig proves that he is capable of directing smooth/funny action, now he teams up with McCarthy for the third time. Susan Cooper is an unassuming, deskbound CIA analyst, and the unsung hero behind the Agency's most dangerous missions. But when her partner falls off the grid and another top agent is compromised, she volunteers to go deep undercover to infiltrate the world of a deadly arms dealer, and prevent a global crisis.  After \"tammy\" happened  people didn't like her for writing/staring in it, but this is her  comedy triumph. What's funny is the fact that the film makes fun of the spy movies cliche's, which Feig has achieved in writing the script; when Jason Statham is popping jokes, when McCarthy's one-liners are 'filthy-volley' and isults Rose Byrne you have to watch this film. Grade A-",
      "total_reactions": 9,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "If you need a good laugh - in fact, lots of laughs, go see Melissa McCarthy's new movie \"Spy\".  It is wonderfully funny!  And, it has a fabulous cast.  McCarthy is an underused CIA employee who has a secret bad ass side.  Her boss, Allison Janney, decides to put her into the game when the identities of the guy spies are compromised.  Watching her get her gadgets and new identity are hysterical.  Jude Law is suave as any James Bond and McCarthy is always in his ear bud saving his butt.  Jason Statham provides great laughs as a hyper gonzo fellow spy who just can't let himself be outdone.  Especially by a girl.  Rose Byrne is wicked funny as the gorgeous villainess who wears skirts so tight and heels so high, she needs assistance to walk!  The laughs keep coming.  Finally, McCarthy has a movie that doesn't dumb things down for the audience.",
      "total_reactions": 9,
      "user": "Acacia"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "Spy is the best constantly hilarious slapstick romp since \"It's A Mad Mad Mad World.\" After the first 15 minutes, it's an hour and forty-five minutes of laugh-out-loud banana peel and gag-writing antics.",
      "total_reactions": 9,
      "user": "joypebble"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "Wow. I had thought it would be good but this really was the funniest film I have seen for quite sometime and definitely Melissa McCarthy's best performance. She portrays her character in such an endearing way yet at the same time is utterly hilarious. The rest of the cast is also fantastic. Rose Byrne is great with her constant put downs and a scene with her and McCarthy on a plane is hysterical. Miranda Hart is also terrific even though I initially thought her out of place but once she moved out into the field in the second half of the film I could not take my eyes off her and found that she stole scenes with great one liners or even just funny mannerisms. Jason Statham was perhaps not as funny as I was expecting but he was still great delivering his lines in a comically dead pan voice.The most plaudits must however go to Paul Feig for managing to create a film that was hilarious yet also riveting through its many plot twists and action sequences. His writing was so brilliantly specific to each character, something that only heightened the comedy. There were also many occasions during the film when lines became inaudible due to the laughter of myself and the audience at a previous line or action.",
      "total_reactions": 11,
      "user": "forwardswill"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2015
      },
      "score": 0,
      "text": "Spoiler Alert!  Let's sum it up:  Juvenile vulgarity?  Check.  Predictable writing and humor?  Check.  Melissa McCarthy in all her typecasted glory?  Check.  Unbelievably athletic obese women?  Check.  Dick picks?  Check.  The old overly stupid men/ smart women cliche?  Check.  Gay 50cent cameos?  Check.   Predictable plot?  Check.  Incredibly unintelligent?  Check.  Complete waste of 2 hours?  Check.",
      "total_reactions": 18,
      "user": "jutt77"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Bond 007 meets the Three Stooges! This is one of the best films of the summer that you won't regret sitting through, if you're a Melissa McCarthy fan. She is unleashed in her role and no holds barred. It's corny and a goof ball spoof but it gets the job done as a satire. While other summer blockbusters give you fluff, this won't",
      "total_reactions": 6,
      "user": "chughead"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2015
      },
      "score": 9,
      "text": "A Hilarious Movie. It was what it was designed to be a spoof and play off of spy movies. We all loved it. The characters were just cheesy enough. Had a blast watching it. Worth seeing.",
      "total_reactions": 6,
      "user": "Tick"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Paul Feig and Melissa McCarthy collaborate for a third time in Spy and this film is far more action packed than the pairs other movies. This movies got a great cast with some pretty funny actors in the mix. Melissa McCarthy tones herself down as well and he performance does not resemble her other roles in films like Tammy and the Heat. However the true highlight of this movie is Jason Statham. This guy is really funny and he is really only parodying himself. The funniest moments in the film involved him almost all the time and its nice to see him doing something a little different. If you were a fan of Bridesmaids and The Heat you will likely like this film but the action in the film could bring on a new audience.",
      "total_reactions": 6,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "This is a movie that does to spy films what Shrek did to fairy tales.  It turns conventions upside down, yet retains an entertaining and funny story.  An obvious riff on James Bond and Casino Royale (the more recent one), it starts by taking us down the conventional spy genre from the start.  The first few minutes could easily be a James Bond movie with Jude Law in the role, but soon we are taken on a different path.  When Melissa McCarthy is thrust into the field, we get surprised and delighted as she ends up being effective despite (or perhaps because of) her non-conformity to role expectations.  The film manages even to argue feminism while being hilarious, no mean feat.  Highly recommended.",
      "total_reactions": 6,
      "user": "paulusmillarus"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "Well that was surprisingly funny and not terrible as I thought it was going to be.",
      "total_reactions": 6,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "well i should not have watched it with mom but it was a smart entertaining film with a great mix of funny and kill bill style action. everyone does a perfect job here giving a long film that never gets old i mean just when you stop expecting surprises it throws in 50 cent!!! thats awesome. and the movie is filmed great too. sure some wont like this and again if your a kid watch it alone. im 14 and it was very odd watching with a groan up but i never stoped me if you like who is in it they wont disappoint. its still in theaters go get some nachos and watch this film!",
      "total_reactions": 6,
      "user": "tobinISawesome"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "....................................................................................................70 **** idiots that..............................................................",
      "total_reactions": 6,
      "user": "Zanessa250QI"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "My girlfriend and I ended up seeing this as a backup after Jurassic World sold out and I was presently surprised. Pros: The jokes are consistently good and this is easily's McCarthy's best work to date. Cons: Over stayed it's welcome a bit with a 2+ hour run time. Bottom line: I'd almost guarantee Spy is a better movie than what you're expecting.",
      "total_reactions": 4,
      "user": "blanks09"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "Maybe I set my expectations on this one a little too high, because after reading the rave reviews I went in expecting a lot. And while it was undeniably entertaining, it did fall a bit short on laughs for me. But on the plus side, the whole cast gives great performances. Melissa McCarthy once again does what she does best, owning every scene she's in with great and humorous results. Jason Statham was also surprisingly funny, as was Rose Byrne, who departs from her usual sweet and innocent roles as the film's villain. Jude Law also gives a funny and worthwhile performance. The action was also fun to watch and never let up. Overall, while it wasn't quite as funny as I had hoped it would be, there wasn't a dull moment in the film and it kept me entertained from start to finish, which is enough for me. It may not be Paul Feig and McCarthy's best (I still like Bridesmaids the best) but it is a step above their last film The Heat.",
      "total_reactions": 4,
      "user": "moviemitch96"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "User Score is spot on.  My wife enjoyed it & I laughed a few times due to funny lines & occasional funny scenes. I'm not a big Melissa McCarthy fan so that doesn't help. Some of the characters were believable but others weren't.  An overweight middle aged woman casted in a role to fight professional killers is a bit much. So I give it a 6.5 overall and that is being generous",
      "total_reactions": 4,
      "user": "moviecritic68"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "An entertaining and hilarious film where Melissa McCarthy was for once in the limelight and not statham. Overall well acted and met the intentions of being funny.",
      "total_reactions": 4,
      "user": "eion"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "One of the best films I have seen in a long time. Very well thought out characters, comedy, and storyline. I can't say enough positive things about this movie. It's a must watch, it'll have you laughing from the beginning to the end.",
      "total_reactions": 4,
      "user": "anomally"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "Spy doesn't always work but all the performances are great. The film has timely comedy but its the way the actors deliver the lines that keeps the film entertaining. McCarthy holds the lead but its Jason Stratham steals the show.",
      "total_reactions": 2,
      "user": "csw12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "In spite of at moments REALLY ridiculous, impossible and parody-like plot, this movie made me laugh out loud so many times! Although, most of those moments came in the first half of the movie and was mostly due to Melissa Mc., Miranda H. and Rose B. and their chemistry. Three ladies made this movie better than it really is. Jason S. had his moments as well, but the ladies take the crown. Even though I'm usually not a fan of this type of comedy, I gotta admit that Byrne's snarkyness, Hart's goofyness and McCarthy's (almost) everything made my evening.",
      "total_reactions": 2,
      "user": "Miljac"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2015
      },
      "score": 9,
      "text": "Spy is one hilarious movie. Melissa McCarthy has made some duds lately by be type-casted as the same old \"fat slob\", but this movie is different. Everything  in the film feels fresh and exciting: the locations, the cinematography, the jokes, the sight gags, the satirizing of the espionage genre, and the A-list cast. I was never once bored in this flick; it even features 50 Cent! This is ten times better than Bridesmaids.",
      "total_reactions": 2,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "Easily the funniest film of the year. I absolutely loved The Heat and Bridesmaids so I knew this was going to be good and this more than delivered. Out of the aforementioned The Heat and Bridesmaids, this is easily the best of Paul Feig's work. I knew Melissa McCarthy had a very strange talent in comedy but this movie really shows it. You will laugh til you cry throughout the whole movie. Easily one of the best of 2015",
      "total_reactions": 2,
      "user": "BrushedRed"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2015
      },
      "score": 7,
      "text": "So \"Spy\" is a Comedic Action film staring Jude Law and Melissa McCarthy. Now I'm not a huge fan of her work but this movie was quite entertaining, It's full of extremely raunchy/adult humor and decent action. The movie is poking fun at other more serious Spy movies like 007 or Mission Impossible, In Spy they attempt the same missions with less then great results. Jason Statham also plays a great role in the film with an almost Chuck Norris aspect to him. It was surprising to see a more Comedy focused movie is able to still keep entertaining Action.",
      "total_reactions": 2,
      "user": "ToFewViews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "Generally, this was a pretty fun and funny movie.  It could have been so much better if the producers, writers, and director had just let Melissa McCarthy be herself.  If you are wondering what I mean by that, run, don't walk, to see \"Heat\".  As a result, Statham steals the show which isn't bad as he plays a parody of his performances in so many movies.  Who knew he had it in him?  I wanted to like this more, but McCarthy came closer to dragging it down instead of dragging the belly laughs out of me.",
      "total_reactions": 2,
      "user": "jfsmith1222"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "Spy is witty, hilarious and doesn't rely on cheap jokes, even the over the top insults are clever. We witness a quiet desk bound CIA analyst's descent into a strong and wild character. Definitely makes us oversee the feeble attempts of \"Tammy",
      "total_reactions": 2,
      "user": "kyle20ellis"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2016
      },
      "score": 1,
      "text": "Someone compared Spy to Mall Cop. No I don't think so. I enjoyed Paul Bart Mall Cop it was funny it was cute heartwarming family entertainment. Spy is unnecessarily vulgar and graphic, none of it amusing and once again McCarthy is just over the top. Rose Byrne was a huge disappointment. I really wanted to like the movie I had high hopes but it was just too noisy, unfunny and underwhelming.",
      "total_reactions": 2,
      "user": "nosma"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "'Spy'' is an incredibly hilarious and smart comedy, one of the best in years.",
      "total_reactions": 2,
      "user": "CalibMcBolts"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 2,
      "text": "There isn’t a crude word and/or gesture that I don’t know and have used at one time or another in my lifetime but I am from the ‘old school’ of being  a gentleman who doesn’t curse in front of a woman or give someone ‘the finger’. I avoid films with Adam Sandler and his ilk because they are guaranteed to have curse words, vagina and penis jokes, a foot in someone’s crotch and other things that appeal to the naughty 14 year old boy who secretly looks at the pictures in Playboy.",
      "total_reactions": 16,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "I couldn’t believe I liked this film, after I hated “The Heat” so much. Given witty well-written material, Melissa McCarthy turns out to be a warm, charming comic actress. I really couldn’t believe it. Nor could I believe the excellent comic performance from Jason Stratham. Rose Byrne was also very good in a very difficult part, I think, and I knew Jude Law was a good actor, but I had no idea he could be so good even in satire. I highly recommend this film, which was wonderfully directed and paced, well-written, and full of surprises. My family and I laughed all the way through.",
      "total_reactions": 7,
      "user": "GinaK"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Melissa McCarthy never gets old, and Spy makes sure of that. There is slapstick comedy, sex jokes, gratuitous violence and non stop swearing town into the mix, to make for a more enjoyable movie. Wit the shortage of GOOD Cop/Spy comedies nowdays, Paul Feig and his cast set out to make a movie that people could laugh at, not with it. Examples: Paul Blart Mall Cop 2, which was a turd for both Kevin James and the predecessor it relies on. Spy is fun, every moment was comic and delightful. McCarthy steals the show, and Jude Law was descent as well. There is also Transporter Statham thrown in, he seemed awkwardly disturbed in a movie about dick jokes and nudity, but he seemed the fit. Feig handles the film well. It was funny. For the average person, Spy will not be enjoyable. But for me, who came of the Naked Gun movies, I relate to Susan Cooper and her job. America, F*ck Yeah.",
      "total_reactions": 7,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "An otherwise pretty good movie totally spoiled with all the foul language.  I don't know why writers think using the F-word in almost every scene is 'normal' or funny.  One of McCarthy's rants against Anton is particularly unnecessary, unfunny and just nauseating.",
      "total_reactions": 7,
      "user": "drbriandoddphd"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Spy is James Bond (Jude Law), Jane Bond (Melissa McCarthy), and Jason Statham. It's such a silly movie but it works. I got more than a few belly laughs from Statham in particular, who is absolutely ridiculous in this movie in the best way possible. He's this oblivious tough guy who makes it a point to brag about how tough he is then does the dumbest things possible. McCarthy is back to being her hilarious self, and the supporting cast are all excellent. Spy is the definition of a fun action comedy - see it in theaters if possible because nothing's better than good laughs in a packed house.",
      "total_reactions": 7,
      "user": "SolInvicta"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2015
      },
      "score": 2,
      "text": "I was dragged into this movie so to be fair I have to say that \"going in I didn't want to see it\"",
      "total_reactions": 12,
      "user": "TrueWOPR"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2015
      },
      "score": 2,
      "text": "Save your money. Seriously. Unless you find silly physical humor funny -- and some do -- this is just another in a series of moronic, obvious comedies with the overrated MM.",
      "total_reactions": 12,
      "user": "briefly"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "Melissa McCarthy teams up again with Paul Feig (writer/director of \"Bridesmaids\"), but the result isn't anywhere near as hilarious. She plays an deskbound CIA analyst who ends up on a mission to intercept the black market sale of a nuclear device. A few other stars are in the mix (Jude Law, Jason Statham, Rose Byrne), but only Byrne manages to be very funny. There's plenty of energy and good-natured spoofs on the genre. Feig has reigned in McCarthy's usual incessant rants and liberally substituted F-bombs every time he can't think of something clever. This movie is never dull. It just falls short on laffs.",
      "total_reactions": 5,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2015
      },
      "score": 7,
      "text": "Surprisingly a movie that doesn't just rely on McCarthy being as vulgar as she can. I mean don't get me wrong, there is plenty of raunchy, vulgar humor with lots of profanity, but McCarthy herself seems toned down. As a result her character is much more endearing, and this very well might be the best film of her career.",
      "total_reactions": 5,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "It's a comedy - thriller movie. I am not a big fan of either genre but I enjoyed this movie immensely. Imagine a James Bond movie where James is a big, fat and very smart woman.",
      "total_reactions": 5,
      "user": "netflic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "I would have liked it more if more than half of the funny scenes weren't shown in full in the trailers or ads.  Being on a scooter is probably going to be funny, but they show the whole funny part in the previews.  Too bad it would have been better without knowing about 80% of the movie.  Wait for the DVD",
      "total_reactions": 5,
      "user": "Pdfortune"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "Melissa McCarthy and Paul Feig turn over an action/adventure leaf with \"Spy,\" a clever farce that features a veritable laundry list of engaging set pieces and engaging comedic performances.",
      "total_reactions": 5,
      "user": "Compi24"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Demasiado graciosa, sin duda un clásico inmediato de la comedia, conforme se desarrolla la película uno se lleva sorpresas agradables, sin duda esperemos haya secuela.",
      "total_reactions": 5,
      "user": "chepod8"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "Spy is a movie that starts out good but looses its way in the middle. It has got laughs but the weak plot brings the movie down. That would be my short summary of Spy.",
      "total_reactions": 5,
      "user": "AliceofX"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2015
      },
      "score": 9,
      "text": "one thing funny about this movie is when you have a bunch of wild plot twists, crazy ideas, and some balls to do the shooting, also a sufficient amount of money to make your crazy and wild ideas real, then you just have the urge to make it, ei? this movie is \"for entertainment use only\". i mean, Jason Statham playing useless arrogant spy and Melissa McCarthy gone full-world-class-action-movie-spy? oh come on if it's not \"just for laugh purpose only\", what is it? overall plot is twisty, tricky, and full of surprises. the opening is epic, later on it's become wilder and wilder.",
      "total_reactions": 5,
      "user": "Alexlee"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "Although it is Extremely predictable, Spy is a  very funny adventure and is a great comeback for actress Melissa McCarthy and has many memorable moments. 8/10",
      "total_reactions": 5,
      "user": "BB_Critic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "‘Spy’ marks the third comedy collaboration between writer/director Paul Feig and star Melissa McCarthy in a thus far successful quest to “feminize” movie sub-genres having created a female ‘The Hangover’ with ‘Bridesmaids’ and transformed the traditionally male “buddy-cop” comedy with ‘The Heat’.",
      "total_reactions": 5,
      "user": "FilmPhonic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "I'm still waiting for that super funny movie that you can't wait to see a second time when it comes out on video. Well this one doesn't fill the bill. I was so excited to see it because I had heard good things but we hardly laughed .In fact, there was only a few chuckles through the whole movie from everyone in the whole theater!. They could have done without all the F-ing swearing! It made it worse. Good acting but it just fell short of being a really good movie.",
      "total_reactions": 5,
      "user": "stiner49er"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2015
      },
      "score": 1,
      "text": "After a promising and funny opening with Jude Law doing his 007 bit, this Bond parody degenerates into a witless farrago. The movie aims for the lowest common denominator and hits the bulls eye as it does have obvious commercial appeal. However, it is more offensive for that very fact than for the propensity of four letter words that are tiresomely uttered in almost every line of dialogue. This excuse for a screenplay seems as if it has been written by a ten year old who has just learnt how to swear. It is disgracefully unfunny and this constant use of expletives is a sign of desperation which only succeeds in insulting an ‘Intelligent’ audience. It’s sad to find actors like Jude Law and Rose Byrne complicit in this junk. On the other hand Melissa McCarthy is in her element. She is actually a good enough comedienne but this material is, as Miranda Hart rather aptly puts it ‘extraordinarily out of her league’. Miranda Hart, herself, is just embarrassing. Hopefully, this will abort any further chances she may have had of a Hollywood career. Ditto Jason Statham who should recognise his limitations and stick to his unambitious, and usually not very good, action movies. He is way out of his depth here attempting comedy.",
      "total_reactions": 18,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2015
      },
      "score": 2,
      "text": "Do you like movies with Melissa McCarthy in it? If yes: then you'll like this movie, if no: then you will not like this movie. It's as simple as that really. Personally, I don't like Melissa McCarthy, so I really didn't like this movie.",
      "total_reactions": 8,
      "user": "xstuff123x"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "This feminist version of 007 James Bond might lack of originality on its first place but the outstanding chemistry and performance from the cast unexpectedly turn it into an entertaining film to enjoy. Director Paul Feig has turned both Melissa McCarthy and Jason Statham from their usual annoying and heroic characters to something surprising, added with intense woman empowered violence, comprehensive actions, hilarious and silly adults dialogues as well as unpredictable story line twisting have generated infectious laughter from the beginning till the end. While McCarthy spreads her comic showcase extremely well, her screen time together with Rose Byrne are genuinely funny and impressive thanks to the compelling relationships crafted between both of them eventhough it's antagonistic in nature. The film sounds ridiculous but the act of balancing the line between being a comedy and an action thriller that allow colorful characters development without any boundaries have overall qualified the film for another sequel.",
      "total_reactions": 8,
      "user": "michael1208"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2015
      },
      "score": 1,
      "text": "Good grief.  This just got so boring the 2nd half.  It's sad what works for laughs.  Are we all 10 year olds? but the 2nd half was just dullsville as they worked through their plot such as it was.",
      "total_reactions": 8,
      "user": "moviemom"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2015
      },
      "score": 2,
      "text": "\"75\"? Really?  I love Melissa McCarthy and she can make almost anything funny with her unique comic riff but this movie was just plain unfunny.  It is a testament to how bad the writing was that even McCarthy couldn't rescue it.  A few very good laughs but 90% just plain not funny.  This is one of those movies where you wonder what the writers and the people who allowed the script to go to production were thinking.  Actually, it was probably Melissa McCarthy = $.",
      "total_reactions": 11,
      "user": "TantricSky"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "Is Spy a laugh out loud comedy?  No.  Is it an enjoyable film?  Yes.  You will definitely get some chuckle out of this film.  I would recommend at least renting the film when it comes on on DVD if you are at all curious.  The film had some excellent performances particularly from Melissa McCarthy and Jason Statham.  Paul Feig gives some excellent direction and writes the film pretty well despite the fact that there are parts that don’t fully hit the mark, but I would say it’s a lot better than other comedy films that have come out in recent memory.  It does, however, have the unfortunate timing of coming out between Kingsman and Spectre and I think it will get lost in the shuffle between them, and I would say I definitely preferred Kingsman as a film on almost every level and I would go back to that film again before this one.  With all that said though, this is a very enjoyable film and I had a great experience in going to see it at the cinema.  I would probably recommend it, particularly for it’s action scenes which were better than I was expecting.  If you like action comedies, this is probably one to add to your list.",
      "total_reactions": 11,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Even with a few stereotypes, Spy is an extremely funny and exciting action film. Characters are well written enough to make the audience love them, smart humor is present all the time and McCarthy owns the screen as expected. Law is playing the kind of role he always does, just like McCarthy, but this doesn't prevent this hilarious comedy from being loved. It's really hard not to have a great time watching this spy adventure. Besides, how about seeing Jason Statham portraying a good but stupid agent? This doesn't happen everyday, you shoudn't miss it!",
      "total_reactions": 9,
      "user": "danipp"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "First they brought us Bridesmaids, then The Heat, and now we have Spy.",
      "total_reactions": 9,
      "user": "ReysonPoint"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2015
      },
      "score": 3,
      "text": "I'll be honest, it was more funny than I thought it would be at first. I laughed a few times and to be honest that is extremely rare to find in a movie seeing how I have a level 110 tolerance to laughing ring that I equip to go see movies.",
      "total_reactions": 9,
      "user": "i73"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "This is not Bridesmaids, but it is better than the Heat.  Melissa McCarthy's ad libs are very funny.  There are plenty of laughs.  I laughed out loud enough to make me recommend this film.  If you are easily offended this is probably not for you.",
      "total_reactions": 6,
      "user": "StevieGJD"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "After last summer’s critics-panned squib TAMMY, which is not quite a financial disaster, but Melissa McCarthy’s star power has inevitably been questioned whether her box-office draw can still maintain after her rotund figure and comedic schticks have been overly cashed in on these years. Thanks heaven SPY has arrived, a third collaboration with Paul Feig, and unites her with the criminally under-appreciated her BRIDESMAIDS (2011) co-star Rose Byrne, and under Feig’s helm, together they concoct up a thoroughly hilarious spin-off of James Bond’s spy trademark, with an overhaul of a female lead and in passing, finally fulfils Jude Law’s yearning as a suited-up top agent after he lost the battle to Daniel Craig almost 10 years ago, and gives Jason Statham a rare opportunity to tease his own action hero stereotype.",
      "total_reactions": 6,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2015
      },
      "score": 3,
      "text": "The film was ugly as sin, the jokes were very often pee-pee/poo poo level, the lead actress was amusing but not particularly funny, the british sidekick was depressing... For a comedy, it was shocking how much this looked and played like straight-up trash. My wife thought it was even worse. Bette Midler, where are you  -- all is forgiven!",
      "total_reactions": 6,
      "user": "robozot"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "It may not be a work of art, but SPY is that rare spy spoof that is actually funny from start to finish. Sure the film is too long and they really don't know how to use Jason Statham but the rest of the cast is totally game and the filthy script actually very funny. A terrific time at the movies. A good summer flick.",
      "total_reactions": 6,
      "user": "LowbrowCinema"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "A mildly amusing spoof of the spy movie genre that, unfortunately, has too few sustained laughs to make it worthwhile. Feeble attempts at creative insults, excessive use of f-bombs and uneven pacing keep this offering from living up to its potential. If you really want to see something truly funny in this comedy subgenre, go see \"Kingsmen\" or the original \"Red\" instead.",
      "total_reactions": 6,
      "user": "Brent_Marchant"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2015
      },
      "score": 9,
      "text": "It's a good sign when a comedy has you laughing so hard you're crying within the first 5 minutes. There hasn't been a comedy this good and this consistently funny since maybe The Lego Movie, but I would argue that Spy is even better than that. Spy is about a CIA analyst, played by Melissa McCarthy, who has to go undercover after her partner falls off the grid to prevent a global disaster. I love Melissa McCarthy, but this is by far her best role I've seen her in. She's an extremely versatile actress, who can make pretty much every type of joke a hit. They're all perfectly timed and delivered so that, even if the jokes themselves aren't all that funny, the timing and delivery made them so much better than they should have been. The plot itself is a little thin, but there are some good twists towards the end. It almost doesn't matter because of how much you'll be laughing throughout the movie. You definitely won't want to pass this up when it gets into theaters in June. It'll be one of the best times you've had at a theater in a while.",
      "total_reactions": 6,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "If you thought you were done with Melissa McCarthy movies after Tammy please watch this movie.This movie is probaly the funniest movie of the year in fact it's the funniest movie I've seen in 2 years Neighbors, 22 Jump Street, and The Interview were still funny though but this was done a little bit better. Also this movie movie makes use of its R rating they swear multiple times and some people get shot in the face and blood splatters. Everyone in this movie does a great job McCarthy, Jason Stathom, Rose Byrne, everyone! The Action Scenes were well shot. But my mine problem is that the plot is kinda cliche but its still kinda original but if you are really big into spy films then you've probably seen this. If you haven't seen Spy by now then please watch it whenever you get the time to.",
      "total_reactions": 6,
      "user": "Red-Opposom-098"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Spy was a very pleasant surprise. It was full of laugh out loud moments from beginning to end, a strong cast, and some surprisingly fun action scenes to boot. This is definitely a film worth watching.",
      "total_reactions": 6,
      "user": "WheelzFourReelz"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "ok was this movie any good yes was it funny yes but there were however parts when i really couldnt tell whether it was coming or going not gonna lie melisa mccarthy does it agin just a little diffrent then what i wanted does this mean skip it ??? nope not in the slightest bit just not her best is all",
      "total_reactions": 3,
      "user": "chrismovieguy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "This is really **** great movie all of the scenes are funny this is the best movie in 2015 together with pitch perfect 2 and insurgent I will watch it again ^_^",
      "total_reactions": 3,
      "user": "shadow_13"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2015
      },
      "score": 6,
      "text": "sadjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuufjfhfhjdajifdjdifjiojsdmcxfjjjjjjjjjjjjdj..............................................the negative reviews  are imcroprresemssible",
      "total_reactions": 3,
      "user": "sicrano"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "Whatever your opinion, just watch it. That's probably the most I've ever heard Jason Statham say so many words while being so seriously unserious. There are quite a few cheesy moments, I think Melissa is gay but I'd watch it again. :)",
      "total_reactions": 10,
      "user": "Plastosilch"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "It was OK, I laughed some -- but was thought I would laugh more.  Was expecting a smarter, more clever comedy but it turned out to be at the upper range of standard.",
      "total_reactions": 7,
      "user": "benjitek"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Melissa McCarthy finds herself in top form with sharp dialogue and perfect comedic timing in Spy. The secret agent/spy persona is surprisingly well fitting for McCarthy and allows her to showcase her chops well. Paul Feig proves again their chemistry and demands more collaboration.",
      "total_reactions": 7,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "Spy is an incredibly funny film, that continues to surprise it’s audiences. The cast of characters does not disappoint, except for maybe Jude Law. The rest of the cast makes up for it by delivering stellar performances. Statham had a seamless transition into a comedic role. Smaller cast members; Miranda Hart, Peter Serafinowicz, and Allison Janney all contributed greatly to the movie. Melissa McCarthy has played many roles similar to this one, so if you want to see a different character from her, you will have to wait for her next film. McCarthy still delivers when she turns into filthy-mouthed intelligent badass after she has to become a spy for the CIA, because the entire group of spies have been discovered by the extremely ignorant villain, played by the beautiful Rose Byrne. McCarthy has to save the world from a nuclear bomb, and along the way she keeps you laughing and wondering what might come out of her mouth next, and of course if she will succeed in finding the bomb.",
      "total_reactions": 7,
      "user": "OptiNuzPrime"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "Very funny movie alot of crude humour that works. For me jason statham stole the show, suprisingly good for a spy actiom comedy one of the funniest movies so far in 2015.",
      "total_reactions": 7,
      "user": "gab19"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2015
      },
      "score": 9,
      "text": "In my opinion one of the best comedies of 2015. Something a bit different than usual, having a woman like Melissa Mccarthy playing the main role and being a spy, who actually turns out to be good at it. Jason Statham in a really funny role and doing it well too - making fun a bit about his other movies where he's all macho man. Watching the whole movie was really exciting and it had funny characters and plot twists - of course it copied James Bond style a bit, but I guess it was meant that way, a bit of a parody, but not copying it too much. Really good movie to watch.",
      "total_reactions": 7,
      "user": "Ralfbergs"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "Unexpectedly fresh and funny, \"Spy\" is a hilarious espionage film, that shows the true comedic talent of Melissa McCarthy and proves that the right director can do miracles with her.",
      "total_reactions": 4,
      "user": "Szen"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "In a word, it is hilarious!  Love, love, loved it!  Melissa McCarthy is amazing!  Jason Statham was great fun in this against-his-image role.  You must watch it to the very end of the credits.  A great ad-lib scene at the end had me laughing as I left the theater.",
      "total_reactions": 4,
      "user": "maggiemae"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "................................................................................ I let me terribly, the movie is good, but the jokes are long and dull especially from Melissa McCarhty character, if this is have been aclaimed from american critics, the american humor is poor.",
      "total_reactions": 4,
      "user": "Thenewone"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "I got free tickets to see this, didn't want to go, went with the wife, was pleasantly surprised how hilarious this movie actually turned out to be.  I found it on par with 21 Jump Street or Superbad in terms of humor and laughs.",
      "total_reactions": 10,
      "user": "Heaviermetal"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "This was an incredible movie in so many ways. Melissa was as brilliant in the dramatic parts as the comedic parts. She was fantastic in the stunts and they didn't seemed simplified for her either. Rose was absolutely convincing as a **** antagonist. Jude was his brilliant usual self. Paul did a fantastic job both writing and directing. And IMO ALL the jokes worked. The parody moments were spot on and the Came in expecting mediocre. Left, amazed.",
      "total_reactions": 5,
      "user": "DarylZer0"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2015
      },
      "score": 4,
      "text": "Terribly unfunny.  Awful writing, awful comediennes, none of the humour works on any level, penis photos, throwing up on dead bodies, and as many vile and grotesque insults as possible.  Just being vile doesn't make something funny, you sort of have to combine it with something that's funny. Only redeeming part of the film is Jason Stratham, who unfortunately isn't in the film enough.  A perfect demonstration of why America isn't known for satire, for a brilliant satirical spy film look for OSS 117. This is more like Paul Blart In The CIA.",
      "total_reactions": 2,
      "user": "nascent"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2015
      },
      "score": 7,
      "text": "The best comedy of 2015. Surprisingly funny while still having a pretty interesting comedic plot. In my opinion it outperforms the over praised Kingsman from earlier this year (which was really good too). Good characters, good scenery and Melissa doing her thing. It has not benefited from the actress´ previous films, which were not too good and probably turned some people off, which ended making this film not that successful. But it´s a great comedy with a lot going on.",
      "total_reactions": 1,
      "user": "sanyrub"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2015
      },
      "score": 4,
      "text": "This movie is plain boring. There are \"so called\" funny moments, but since you can tell what they will be like seconds (if not minutes) before they happen all the fun gets stripped out out them (not to mention that there are only extremely low-level funny situations).",
      "total_reactions": 2,
      "user": "smilzoboboz"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "This movie was hilarious. They took a genre, the spy film, and stayed true to it with both the action and acting but deftly interjected lots of humor all the while they played it straight.  I think it was easily Melissa McCarthy and Rose Byrnes best comedic work to date.  And major props to both Jason Statham and Jude Law who absolutely killed it in this move.  If they do a sequel, they need to at the very least get Statham back as his character was brilliant.",
      "total_reactions": 3,
      "user": "Filmdude"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "I liked this film, it was funny and well casted for what it was, the characters all combine well with each other.",
      "total_reactions": 1,
      "user": "jinannn31"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2016
      },
      "score": 10,
      "text": "This is one funny movie.  I was let down with Tammy and Identity Theft but McCarthy hit a home run with Spy.  She was funny and great to watch.  She is an inspiration to big women. Statham was fantastic. It was great to see him in this movie.  He was funny and every time he came on screen couldn't stop watching him his performance was very enjoyable. I hope there is a Spy 2.  I would love to see a type of Transporter movie where Statham and McCarthy is in a road movie.",
      "total_reactions": 1,
      "user": "moviegoer62"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2016
      },
      "score": 1,
      "text": "The photography, lights, costume and make-up are decent (hence the 1), the acting is forced and the jokes are... the kind of perpetrated by the (sadly unfunny) kid who tries far too hard to be admired in the schoolyard. About the story and the characters... I do not know, they leave nothing to the imagination, they are incredibly shallow, as it seems the actors were forced to stick to the script. Whilst I laughed or winced at other movies with Melissa McCarty, this one failed to generate any emotion, it is bland, unsavoury.",
      "total_reactions": 0,
      "user": "Barny"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2016
      },
      "score": 6,
      "text": "Spy is an entertaining comedy vehicle for Melisa McCarthy. It also features some other amusing turns from Jason Statham and whoever plays that hilarious Italian pervert spy (too lazy to research, sorry). Rude jokes and decent fights abound. Spy is a fun time.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "I was surprised at just how good this film was. I laughed all the way through. Melissa McCarthy and Jason Statham in particular put in great comic turns, but really everyone is top notch in this film.",
      "total_reactions": 0,
      "user": "DukeJon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2015
      },
      "score": 8,
      "text": "In keeping with the spy theme, and having in recent months seen Mission: Impossible-Rogue Nation, The Man from U.N.C.L.E, and Spectre, it is high time to review the film that spoofs them all—Spy, with Melissa McCarthy and Jude Law. Maybe spy spoofs have been done before, but McCarthy makes this one unique, because she is so screwball that you either sit there in dismayed disbelief or keep a box of tissues on hand to wipe tears of laughter from your eyes.",
      "total_reactions": 0,
      "user": "ClariseSamuels"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "I've only watched half the movie so far, but so much of that time that means it's crap and I refuse to watch any more, but not \"Spy\"! This is a real gem of a comedy that manages to weave in enough action and drama that it's not a one-trick pony. I'm quite confident the last hour of the film will be as good or better, so this film gets a first-ever, pre-finish \"9\" from me.",
      "total_reactions": 0,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2015
      },
      "score": 7,
      "text": "It is one of the better made comedies I have seen lately. The movie is long, but with funny actors bringing their A game, it never fails to keep you entertained.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "A pretty funny, albeit almost too vulgar, action comedy, Spy has one major flaw. And that's its main lead, Melissa McCarthy.",
      "total_reactions": 0,
      "user": "RealMuthaF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2015
      },
      "score": 6,
      "text": "T- Minus One Day.",
      "total_reactions": 0,
      "user": "TheApplegnome"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "Spy is predictable and repetitive. However, the violent and raunchy humour often works in this movie with some slapstick added for good measure. Melissa McCarthy is charming as ever and the side cast is strong too.",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2016
      },
      "score": 6,
      "text": "Its funny jokes, fast-pace, and stylized, energized action sequences are mostly enough to cover for some weak characters, poorly plot development and crudeness.",
      "total_reactions": 0,
      "user": "papeadojhon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2016
      },
      "score": 7,
      "text": "........................................................................................................boring comedy sorry....................... i like Law & Statham.....................",
      "total_reactions": 0,
      "user": "raciocinio"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2015
      },
      "score": 5,
      "text": "After a promising start the film lost some interest but the good moments of humor and some parts of action meant that the film was not a total collapse .",
      "total_reactions": 0,
      "user": "FrenziedPanda99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2015
      },
      "score": 8,
      "text": "I found this movie, hilarious and fun and it even gets better throughout the time. 'SPY' isn't your typical comedic movie, it's something that I, in my opinion, found original and funny in every way. It gives action, drama, crude humor that you will laugh no matter what, and a story that you've heard before but still give it a shot anyway because it's a f*cking spy movie. Say that James Bond had sex with Austin Powers and this is the results.",
      "total_reactions": 0,
      "user": "Almostearly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "There is a term' Drop Dead Silence, which I will modify to Drop Dead hilarious. Spy is a long leap for everyone who have worked on it. Generally it is not much different then any girl's dominated comedy but when you watch it , you realize it takes humour to the direction (not the new ones) that you did not assume while coming for it.",
      "total_reactions": 0,
      "user": "Xan_Ryil"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "It like James Bond and Austin Powers kind of had a baby called Spy. But anyway the movie is hilarious because of Paul feig and Melissa McCarthy and also Jason statham are fricking  hysterical. And it's a great movie over all.",
      "total_reactions": 0,
      "user": "FlamingBear"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "Hilarious movie you should watch now. Spy is a great movie, and has a lot of great humor, with good actors, even some you wouldn't expect in a comedy, like Jason Staham but he's still great, and man is that British chick fine.",
      "total_reactions": 0,
      "user": "gdiego135"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2016
      },
      "score": 9,
      "text": "Melissa McCarthy has done an excellent job on Spy, the laughs come and come non stopping, and the performance of Jason Statham was meaningful and delight one. Each character know how to manage and entertain audience. The most hilarious movie of the year",
      "total_reactions": 0,
      "user": "DavidTejada"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "WHAT I LIKED: A brilliant A-List cast sparkle in one of the best written comedies in a long time. This spy spoof excels in making a story for you to genuinely get into with some badass action to match, that somehow still manages to keep you laughing throughout. It's paced excellently, keeping the audience on a joy ride from the off; this is not only one of the best spy spoofs ever, it's one of the best comedies too",
      "total_reactions": 0,
      "user": "BarneyOnMT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2016
      },
      "score": 4,
      "text": "OK, so this looks like an interes...oh my God! its another bloody Bond parody!! seriously!!! Yes the modern age feminist hipster, Paul Feig, takes a swing at the Bond genre, and oh what an original concept that is, gee I wonder what we'll see here...ugh!",
      "total_reactions": 0,
      "user": "IAmTech"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2016
      },
      "score": 7,
      "text": "A fast moving and very enjoyable comedy spy romp with great action sequences and sharp one liner put downs, does earn its Cert 15 rating (UK) though. One niggle might be that Melissa McCarthy's performance seems a bit like an extended John Candy impression..",
      "total_reactions": 0,
      "user": "bumpycapers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2016
      },
      "score": 9,
      "text": "very funny movie loved it ............................................................................................................................",
      "total_reactions": 0,
      "user": "reviewfrom19842"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2016
      },
      "score": 7,
      "text": "I laughed. The wifey and I had a good time. But why is the bag of dicks joke keep being reused? I mean, its a heavily reused bag of dicks. We should have at least fresh bags, even if the dicks are pretty well worn.",
      "total_reactions": 0,
      "user": "Bias"
    }
  ]
}