{
  "mc_avg_user_score": 7.9,
  "mc_metascore": 82,
  "mc_mixed_rating_frequency": 119,
  "mc_movie_name": "Star Trek",
  "mc_negative_rating_frequency": 133,
  "mc_positive_rating_frequency": 1167,
  "mc_pro_critic_reviews": [
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2015
      },
      "score": 100,
      "summary": "This new Star Trek is fast-moving, funny, exciting warp-speed entertainment and, heaven help me, even quite moving - the kind of film that shows that, like it or not, commercial cinema can still deliver a sledgehammer punch."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2015
      },
      "score": 91,
      "summary": "The new, vastly improved Star Trek moves at warp speed through a marvelously reinvented sci-fi franchise, reverent to the past and firmly entrenched in the now."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2015
      },
      "score": 80,
      "summary": "The movie is fun, it's smart and there's plenty of action. There are enough knowing nods to old-school fans to satisfy them, but the nods don't get in the way. In fact - and a feel for this kind of thing is what makes Abrams so good - they're perfect, nice accents that won't slow down the uninitiated."
    },
    {
      "critic": "Aubrey Day",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2015
      },
      "score": 80,
      "summary": "Buoyant, buffed and with the promise of even better to come, this is the freshest Trek in decades."
    },
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2015
      },
      "score": 80,
      "summary": "The overall impression is one of unbridled enthusiasm on the part of the film’s makers, both for its predecessors and for the brave new universe Abrams and his crew are exploring."
    },
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2015
      },
      "score": 80,
      "summary": "This is a grand success – perhaps a new populist benchmark in what to do with a flagging franchise, and a witty, light-on-its-feet prequel."
    },
    {
      "critic": "Jeff Shannon",
      "publication": "The Seattle Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2015
      },
      "score": 75,
      "summary": "This is easily the best “Trek” movie since “Khan,” giving the rebooted franchise ample reason to proceed at warp speed."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2015
      },
      "score": 70,
      "summary": "It's one heck of a fun ride, a pure popcorn spectacle that doesn't require a knowledge of the Star Trek mythology to make it enjoyable."
    },
    {
      "critic": "Bill Weber",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2015
      },
      "score": 63,
      "summary": "Like the original cast’s best movie, The Wrath of Khan, this Star Trek essentially turns out to be a war film, with the occasional philosophical timeout to discuss love, friendship, and duty until the next bone-crunching fistfight or multi-weapon rumble with the Romulans. But Bana’s villain lacks the wit and corny majesty of Ricardo Montalban’s."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2015
      },
      "score": 2,
      "text": "This one, just like the second movie, is taken so far away from what Star Trek was supposed to be - an interesting, exciting and dramatic sci-fi, that drifts along in a slow, gentle pace, where character development, exploration, intrigue and character interactions are given a lot of space.",
      "total_reactions": 4,
      "user": "Rayfinder"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "Star trek 2009, as I call it, Star Trek: the MOVING Picture is a fast paced thrill ride that leaves it brain at the door. Donâ",
      "total_reactions": 1,
      "user": "theinspector"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2011
      },
      "score": 5,
      "text": "Well this movie strips out all the smarts of the original IP and replaces it with brainless action, I didn't watch Star Trek for it's action scenes, I watched it so I could enjoy the escapades of the crew and their adventures in space, sure in the original series the only \"Real\" characters were McCoy, Spock, & Kirk, and this movie just does horrible things to them. I'm not here to say that's it's a bad movie per se, but it fails to do the IP justice, wand assassinates the characters along the way.",
      "total_reactions": 1,
      "user": "Basilsik1991"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2011
      },
      "score": 5,
      "text": "I thought the movie was boring. There wasn't really anything that grabbed my full attention.",
      "total_reactions": 1,
      "user": "MichaelD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "As a long time Trek fan,i was really looking forward to this movie,especiially after watching the full trailer with the rousing music by Two Steps from Hell.Have to say though,i found the movie completely underwelming.. I know its supposed to be a reboot,but why make a Trek movie,if your going to ignore the whole history of ALL the series,with events like the Vulcan home planet getting destroyed?! Dont get me wrong,the film has its moments,& is quite slickly shot,But Kirk trying to get it on with Uhuru? Spock IN a relationship with Uhuru? Kirk taking command the way he did was lame.The cast were prett good on the whole,but Notably good in the film was the guy who played Spock(I forget his name),& Karl Urban as Dr Mcoy i thought.The effects were pretty good on the whole,but there was far & away not enough space sequences/battles,& what there was,was lackluster.These are supposed to be big lumbering ships,with alot of crew members doing all sorts of tasks on board,so why is this never really capitalised & done justice in the Trek movies to make tense & prolonged battles between starships?.. The ones that came the closest to this was The Wrath of Khan,& Nemisis,both better movies for it.Though my favourate Trek movie stll has to be First Contact BY FAR,followed by Nemisis,then Wrath of Khan.I hope the next movie(if there is one),has a proper space battle you can sink your teeth into & enjoy,cos this movie didnt,Far from it.",
      "total_reactions": 1,
      "user": "SpartanEdge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "Overall, this could have been any C grade science fiction movie. Let's break this down. Here's what was bad about this movie:",
      "total_reactions": 1,
      "user": "pauljohnson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "A little bit more heart, substance and dare I say it – logic – and I might have enjoyed the fun parts where the things blew up and the people yelled at each other.",
      "total_reactions": 1,
      "user": "JohnTY"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "I give this movie a 6.5/10. My reaction to it was, \"...meh.\" I just din't really care for it. It wasn't as exciting or well written as I had hoped but it certainly wasn't a bad movie. Maybe I'd liek it more if I were a die hard Star Trek fan but this was actually the first movie of it I saw. I prefer Into Darkness over this movie by far, but that's not to say this isn't a pretty decent movie.",
      "total_reactions": 1,
      "user": "Epik_Ninnja"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "Who: Chris Pine, Sylar, Gary King, Pam Dawson, The 2003 Hulk, and Kyle Reese as Pavel Chekov",
      "total_reactions": 1,
      "user": "RvwFromUpHere"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "As a child and teenager, I grew up with the \"Star Trek: The Next Generation\". While I was never a hardcore Star Trek fan, I did enjoy quite a few seasons of that series as well as \"Star Trek: Voyager\" and \"Star Trek: Deep Space Nine\". Still, the original series never really appealed to me. They always came off as outdated in so many ways I guess I outgrew them before I had the chance to get into them.",
      "total_reactions": 1,
      "user": "johnslegers"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2014
      },
      "score": 3,
      "text": "Painfully dull clichéd action fare, Star Trek is not Star Trek. Transposed aspects of the original are diluted, stripped-down, downright illogical and nonsensical. Appropriate for 'teen' audiences, the mentally deficient and those not yet born when even The Next Generation was on air. Dreck.",
      "total_reactions": 4,
      "user": "AlienSpaceBats"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2016
      },
      "score": 3,
      "text": "Where to begin. How to compare the reboot to original trek and whether to compare it to TNG?",
      "total_reactions": 3,
      "user": "rederp"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "The Movie that killed Star Trek,",
      "total_reactions": 5,
      "user": "NightbringerAT"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "We were pleasantly surprised with this well polished and incredibly entertaining instalment of movie genius.  Great casting and stunning visuals  a real treat on the big screen.  Love the character development and it stayed true to the original series but was easily enjoyed by those that aren't all that familiar with the Star Trek format.  Top notch work and a must see!",
      "total_reactions": 5,
      "user": "mymedia"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2011
      },
      "score": 5,
      "text": "Seriously, haven't we seen this plot before?  A villan from future comes back to destroy the past ala 'Borg Queen' using time travel once again as a cure all for bad writing.  It's just an excuse to 'reboot' everything and frankly, it didn't succeed in being convincing.  It's tired, sad and so overused.  It's such a bad plot device I wish they'd stop using it.  The acting was good, not great but then what can you expect?  The rest, well average to poor at best.",
      "total_reactions": 12,
      "user": "PWB"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "Star Trek is actually a really good action sci-fi film and I feel really bad with myself that I haven't watched this excellent film these years. It has great action and really good special effects and even though I saw the film in my computer the it felt like I was at the cinema which was a great experience for me. I've never watched before Star Trek and my first impression is really positive. I liked the characters and the actors were great too. J.J.Abrams made a really good film after Lost which was a great tv show and I'm really looking forward watching the sequel of that film and I hope that it's even better than this film which was really good. A must-watch!",
      "total_reactions": 4,
      "user": "Kiva"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "I liked the cast, Thought the film had some solid acting. I wish Nero, the film's villain, had a bigger presence though, Felt he was barely in the film at all, Which is rather disappointing. Also, The film was a bit too fast paced. I understand that you can only pack so much into a film and that Star Trek is a massive series, Heck I am shocked that they packed so much into this film, but still it sort of hurt the movie. That being said, It wasn't a bad movie. I enjoyed it enough to give the sequel a chance.",
      "total_reactions": 2,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "While it does destroy fifty years of canon with time-travel mumbo jumbo, J.J. Abrams' 'Star Trek' is nevertheless a brilliant origin story with great performances and direction.",
      "total_reactions": 2,
      "user": "YellowKirby"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2016
      },
      "score": 2,
      "text": "Star Trek is one of those stupid series that geeks love for no reason. It is not exciting or awesome. The formula is bland after well the first movie but geeks still love it. This movie is only for geeks.",
      "total_reactions": 2,
      "user": "GamecubeLover"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Impressive Hollywood product, exciting story, outstanding acting performances! This one is an excellent sci-fi movie, stunning and much more spectacular than usually we may see any other fantastic tale!",
      "total_reactions": 11,
      "user": "Mackey"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "A very enjoyable action extravaganza. I loved it pretty much from start to finish and laughed out loud in parts. Chris Pine did a great job as Captain Kirk and Simon Pegg as Scotty!!!",
      "total_reactions": 22,
      "user": "spielbrick90"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2012
      },
      "score": 0,
      "text": "The writing was atrocious. This movie felt like it was just filled with a bunch of lines from classic Star Trek so reviewers would say its Star Trek. Instead of making me hark back to any classic Trek they just made me feel ripped off with such cheap gimmicks when none of the characters felt like they were in the series like Spock yelling, choking, and marooning Kirk and Scotty and Chekov are reduced to mere comic reliefs. Red matter was some magical blob that did what the writers wanted to whenever they wanted the plot to do something, it was not science fiction. But that should be expected from the same writers who wrote such Hollywood \"greats\" like Transformers and The Island. The Star Trek franchise has now stooped so utterly low that for humor it now needs cartoons and bestiality jokes, now uses \"your mommy was a whore\" insults, and is now totally reliant on special effects, fistfights, endless shouting for \"entertainment.\"  Mr. Abrams promises much but like his mystery in Lost it they're pretty empty despite all the initial hype. He says its a prequel to the series, but then he uses a cheap trick that its an alternate universe to avoid creative thought and so he can just put in whatever he wants to still claim he didn't wipe anything. This movie shamelessly tries to milk every last penny out of the Star Trek name instead of letting it die with the miniscule dignity it had left.",
      "total_reactions": 8,
      "user": "B_G"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2012
      },
      "score": 1,
      "text": "A depressingly shallow and moronic action/explosions fest masquarading as a star trek film. The character limit is simply far too small for me to list all of this film's flaws, but I'll have a go at it anyway: the pointless and non-sensical destruction of Vulcan. Warping Kirk into some kind of Twilight-esque pretty boy thug and thief who beats people up in seedy bars. Making Kirk and Spock enemies, for no other reason than to provide some \"dramatic tension\". Romulans that weren't even recognisable as Romulans. The pretentious, in-your-face overuse of shaky camera and lense flare. And a plot that can be summed up in one sentence: Blow up the Romulans. And all of these flaws conveniently hidden by Abrams with the lazy, cliche'd excuse:  \"but it's a parallel world, so it can be different.\" To a point, maybe, not so different that it becomes unrecognisable and turns into star wars. To quote another reviewer, Gene Roddenberry must indeed be rolling in his grave, while Rick Berman tears his hair out and has an anurism. In conclusion: avoid this film like you would avoid Justin Beiber's new single.",
      "total_reactions": 8,
      "user": "TARDISlore7"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "I only needed twenty minutes to know the next one hundred would be garbage. A trite, melodramatic script that aggressively violates the \"show, don't tell\" rule, passable CGI ruined by a baffling decision to drench EVERYTHING in sun glare, and editing so brisk it makes one feel as if they are watching a collection of (poorly made) short films instead of one fully fledged story. Pass.",
      "total_reactions": 9,
      "user": "gimmedatsammich"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "Star Trek is intelligent, funny, witty, visually dazzling, surprisingly well acted, and the story is told with a surprising amount of depth. It benefits from its mesmerizing action and true heart. I give this movie 89%.",
      "total_reactions": 9,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "This is an outstanding reboot of the classic sci-fi series we all know and love, partly because it introduces new and fresh ideas into the series while still paying homage to the original films.",
      "total_reactions": 3,
      "user": "DeVr33z"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "Star Trek is, generally speaking, a good movie that appeals to both established fans and outsiders alike. The acting is enjoyable, the actors are very well cast for their iconic roles, the special effects are great, the score is rousing, and there are tons of great little details only long time Star Trek fans will notice. Unfortunately the biggest problem this movie has is that it is a reboot of the series and as such disregards much of the established lore and history. While it goes about this in an interesting way in the end it opts to stand apart from almost fifty years of Star Trek rather then adding to the universe millions have come to love.",
      "total_reactions": 3,
      "user": "thedarkorb"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2015
      },
      "score": 7,
      "text": "don't know too much about the Star Trek series but i found the movie very enjoyable with its stunning visuals and decent story. Star Trek might be forgettable but it was good while it last",
      "total_reactions": 3,
      "user": "csw12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2013
      },
      "score": 1,
      "text": "I'm not a trekkie fan or a Star Wars fan, I like them both more or less.  With that said:  this movie is a perfect representation of this soul-less ADHD generation.  This movie is so forgettable I had to read the reviews to be reminded of the plot.  I'd normally give it a zero, but I think I'll give it a 1 for Orion chic boobs; apparently that's all I remember about the movie.",
      "total_reactions": 3,
      "user": "Bobbo"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "enough of the BS! this game is broken. Namco employess creating fake accounts to help promote them game. Not fininding any co-op support for days. Just and awful experience",
      "total_reactions": 3,
      "user": "vintagegamer16"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2011
      },
      "score": 2,
      "text": "This is the \"Twilight: Bitter Moon Redux-Sparkles Edition\" of the Star Trek movie universe.  Lots of sexy kids running around and not making much sense along with plot holes you could pilot two death stars through side-by-side.",
      "total_reactions": 7,
      "user": "AgentJohnson"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2011
      },
      "score": 0,
      "text": "The movie by itself deserves maybe a 5 out of 10 just for being another semi-entertaining one size fits all action flick that doesn't have any real artistry to bolster it.  It's cliche and it's designed mainly for teenagers.  However, the **** that used the Trek label to sell this kind of smut should be tarred and feathered for dealing the final blow to a beautiful legacy that peaked with TNG.  Trek is now dead and lives on as a twisted, reanimated, disgusting corpse.  Sucks.",
      "total_reactions": 7,
      "user": "BillyBobBeavis"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "now for jj abrhams the guy who was involved in my worst movie ever seen . that movie being Cloverfield i was very suprised at how well he did with this film . now im not a big treky i did enjoy star trek the next gen , and have seen some of the original films with shatner and most of the original series . so im not hardcore enough to where some are mad at him altering the whole story line . which i think even if i was he did it in away that made sense and if they did a sequel it would be new and interesting (hopefully) . its the branching time line deal where some thing was changed in the past that follows the original star trek time line and creates a new one and thats the one we are now following . i thought eric bana did a good job as the romulan captin . as well as most of the other actors who did the main roles of the crew of the enterprise . its not great acting but it was good enough . this new plot line makes us wonder more not ever being sure whats gona happen next . it has some nice visuals and some pretty decent story telling . so old JJ redeams himself alittle for that abombinashon known as cloverfield . so if this is the future of the series then i say all ahead warp factor 8.",
      "total_reactions": 4,
      "user": "ArkonBlade"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2010
      },
      "score": 4,
      "text": "There are some good scenes but just too many silly action sequences, silly plot turns, self referential winks. At 120 mins it's a grind to get to the end.",
      "total_reactions": 4,
      "user": "tonyGreen"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "When my family and a friend went to see this movie and since two of them are Star Trek junkies, I thought they loved this movie, as I have never been really interested in Sci-Fi. When I asked them about the movie, they were pretty disappointed with this movie. And this is coming from total Star Trek junkie. TOTAL. Here's the bad parts: The violence is random and unnecessary. Captain Kirk ha a drink, then gets beaten up. The characters are as bland and tasteless as supermarket own brand sweets. The special effects are over the top and I suffered a mild headache. There's this green guy who looks like it was an exact copy of Yoda. Most of the acting is poor, some actually do a decent job. This movie has no tension whatsoever. Most of the scenes play out like a soap opera, or like a couple of British ladies discussing money and fashion over a cup of tea and a biscuit. I DID like the part with the young Captain Kirk: well acted and it was funny. Overall, it's like a car that does a good job of going up a hill until the battery died and it makes it's long journey down the hill before the back goes into a tree.",
      "total_reactions": 4,
      "user": "Bathmat"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Kirk is Star Trek and in this movie they not only get you fired up about him you know it's in his genes. I've seen plenty of movie's where the opening sequence was brilliant. Casino Royale sans Craig, The Fifth Element, Mission Impossible, to name a few but none have taken the Hero call to this level. The tone from the start is exactly what Roddenberrry's vision was all about, the crusade of hegemony into space and how that construct behaved with alien contact. This movie has it all and then updates everything. You don't have to be a Star Trek freak to enjoy this rocket ship into the future.",
      "total_reactions": 5,
      "user": "DallasTxUsa"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "Star Trek is one of my favorite movies of the last decade. I can see it many times, and never get bored and this is for a number of reasons. Every scene is handled very well, and all is accompanied by a beautiful classic composition that really sets a perfect flow to everything it tries to portrayed. The characters, specially  James T. Kirk and Spock are developed with tons of depth, and the rest of the crew are given unique personalities that are all very entertaining to watch. There´s action here, and very cool action, but this is a movie about characters, and their impact on the story. In fact this whole movie is an effort to accommodate an acceptable alternate universe to a series that has been running for way too much time. J.J Abrams did a fantastic job, it accommodated everything perfectly, and in the process it has created a very enjoyable film that has perfect pacing, and never gets boring.",
      "total_reactions": 1,
      "user": "Gilberto"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "Very entertaining, excellent casting.  Showed another dimension to the franchise by updating it, but still paying homage to the original.  Excellent work.  My only quibble was with its predictability, but hey, you can't have everything.  See it on big screen if possible.",
      "total_reactions": 1,
      "user": "plf5403"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "So overall I really liked Star Trek. While it does not offer much in terms of ideology or great films it is a lot of fun. It has the same characters you know and love with a little twist, it is fast paced, has some good action, and is a lot of fun to watch. This is a film that will appeal to both casual movie goers and Star Trek fans alike. If you have not seen the movie yet check it out because I think that you will really like it. Star Trek (2009) is a great film that does a good job setting up the characters and I cannot wait to see what happens to them in Star Trek Into Darkness. When the film ended I wanted to see more of these characters and thankfully after four years of waiting the sequel is finally coming out. Abrams you have a really good first film under your belt and if you screw up the sequel I will be really pissed off. Hopefully Star Trek (2009) is the start of a great new franchise of Star Trek films.",
      "total_reactions": 1,
      "user": "Jacob"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "This is the first time i watched a Star Trek movie, or a Star Trek anything for that matter. The visuals are great. So is the performances. The story is okay; nothing amazing. There is some action and humor from time to time.",
      "total_reactions": 1,
      "user": "adhamhany"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "Star Trek is a fantastic reboot of the age-old franchise. The action scenes and effects are top notch but it's the relationships between the characters that really sell things here. The friction between Kirk and Spock is super fun to watch. The only downer; not enough of Karl Urban's Bones.",
      "total_reactions": 2,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "This is a good movie.  If you're interested in sitting down and watching an exciting film with a lot of great actors and action, you won't be disappointed.  Also, if you're a fan of Star Trek, it doesn't leave you in the dust, either.  It maintains some great fan service elements, including seeing all of your old, favorite characters as kids, seeing the Enterprise, and some other classic aspects of the old series.  It's nice to see a franchise that had fallen so hard with The Next Generation movies pull up out of the dirt.",
      "total_reactions": 1,
      "user": "TheVoid"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "All thanks to this movie...now star trek is truly worthy of calling itself THE rival of star wars...no doubt its the best prequel made by anyone for any movie....",
      "total_reactions": 2,
      "user": "paritosh47"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "One of the strongest films in the franchise! The film is expertly cast, with Urban playing Dr. Bones McCoy perfectly. Arguments can be made for every cast member! Within the first 10 minutes, the audience is blast into intense action and is met with a heartbreaking introduction. As we see each character make their appearance throughout the film, there is one above all that steals the show, and oddly enough, it's a cameo! Live long and prosper for veteran and new fans alike!",
      "total_reactions": 1,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "I hate Star Trek and I loved this movie.  It even overcame a terrible a villain - Eric Bana's bad guy just didn't make sense... story arc =  miner on mining vessel to insane planet destroyer?... right.... - but even with that huge flaw, I loved this film.  Kirk, Spock, the Russian kid, Scotty, Harold (from Harold and Kumar) and Captain Pike all rocked and oh my god Ohura you sexy linguistics overachiever you - keep wearing that skirt  with your clever self.",
      "total_reactions": 2,
      "user": "BobaFett666"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "Reinvigorates the Star Trek franchise in more ways than one!",
      "total_reactions": 1,
      "user": "Jaykay85"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "I never grew into this whole Star Trek fandom or never even bothered but this movie really hooked me up on the franchise. It was well done and great, I can't wait for a sequel (or prequel)!",
      "total_reactions": 1,
      "user": "ZiggyStardust"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "Star Trek - The IMAX Experience One Line review!",
      "total_reactions": 1,
      "user": "LevelsAndGear"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "Unluckily, I have never watched any movie of this franchise before, but I doubt this film may let you down. Speedy, but well-constructed, \"Start Trek\" offers dazzling visuals, exciting entertainment and a delicious nostalgic tone of early sci-fi movies.",
      "total_reactions": 1,
      "user": "Potter17"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "\"Star Trek\" gets the ultimate reboot as J.J. Abrams brings the old, rustic star trek series back to its energetic space-travel roots with some shiny visuals, excellent casting, and a pulsating storyline.",
      "total_reactions": 2,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "It's... very different from previous Trek films. There's some things that stay the same, and a lot that changes. Definitely not gonna replace Wrath of Khan, heh.",
      "total_reactions": 1,
      "user": "Delta_Assault"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "This film is quite surely, a surprising piece of sci-fi entertainment. It did bore me sometimes, but the characters themselves were extremely interesting to watch - especially the way the actors portrayed the characters as they did in the 60's. This is particularly on terms with Chris Pine playing James T. Kirk, even trying a bit of overacting as William Shatner did. I also loved Simon Pegg's accent as he played Scotty. The development of the characters are quite possibly the key part of this film, but they are the most significant element that I praise. I just love how characters get on with each other.",
      "total_reactions": 1,
      "user": "EssenceOfSugar"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "Given that the sequel is now out, and I'm about to draft a review for that, it's probably time to get the review for this one up. I've always been a Star Trek fan. Not one of the rabid ones, one of the die-hard eats-lives-breathes Trek fans (the superstereotypical Trekkies), but a fan nevertheless. Given that reboots are now dominating Hollywood to the point that one begins to wonder how many original ideas are making it through the producer deflector screen. Thankfully, this reboot is one of the few that makes you glad that you spent the money to see it in the theater. Let's talk Star Trek. This is an out-and-out reboot, forget everything that came before except Star Trek: Enterprise (which was generally forgettable on its own for the most part). This gives the movie an amazing degree of latitude, freedom that it uses to exceptional benefit. Consider for a moment the fact that we're talking about established characters known to the entire world, and now we're plugging new actors into them. This is actor hell. Sure, you're being given a shot at a major screen role, probably bigger than anything that's ever come before, but you're going up against the yardstick of your predecessor. That said, the entire...ENTIRE...cast deserves congratulations on jobs very well done. Not a single actor failed in any way to render a believable, moving, and memorable performance. More on that in a few seconds. Scriptwriting is bang-on, featuring a coherent plot with enough twists to make it interesting, enough levity to keep it from being depressing, and outstanding character development and progression. They didn't fall into the trap of trying to redevelop characters along the lines they followed in the original storylines; they went in new directions, all of which were rewarding. Action is plentiful because, well, that's what audiences today demand (Star Trek: The Motion Picture would never fly in today's market...it barely flew in any case). Even so, the action is well choreographed and is a sensible part of the story rather than merely action for the sake of action. Set design was beautiful and well-designed; everything had a function. And to address something many people have made noise about, yes, this Enterprise looks a lot more advanced than the one in the original series. That's the POINT. This movie follows Star Trek: Enterprise. The original series, Next Generation, all of that never happened. Thus, this Enterprise is a logical progression from the one in ST:E. Even the overall story is, frankly, a brilliant fusion of old and new timelines to create an exceptional reboot. But, as promised, back to the cast. Chris Pine is a very good Kirk...at the risk of infuriating legions of Trek fans, actually better in many ways than Shatner was (his deliveries are better, blocking is smoother, and he is able to project an ego without being a walking one). Zachary Quinto may not be Leonard Nimoy, but who is? Quinto's Spock is a fantastic portrayal of a beloved character, and one that lives up to the lofty standards set by Nimoy. Zoe Saldana's Uhura is every bit the groundbreaker that Nichelle Nichols was. Everybody, from John Cho as Sulu to Anton Yelchin's Chekov, are believable parts of the crew and fit perfectly into the story's universe. Karl Urban in particular deserves commendation; at long last, he's found his calling and has developed a perfect interpretation of McCoy. And Simon Pegg as Scotty? Pegg's interpretation is easily believable as the younger Montgomery Scott, with the same genius and exuberance. I also must make mention of Leonard Nimoy (of course): it would be so easy for Nimoy to overpower the entire film, but (and here's the mark of a truly great actor) he doesn't. He's every bit a part of the narrative as every other character, which is why I'm so glad Shatner stayed out of this one. (He would've wrecked it. Shatner's Kirk is dead. Done, full stop. Forget the fact that he resurrected his own character in his novels. Sorry, Shatner-Kirk is cashed out; it's time for Pine-Kirk.) Oh! And the score? The anthem of this new incarnation of Trek is so worthy of the mantle of Trek...Michael Giacchino seems intent on vaulting into the neighborhood of John Williams, and he just might. In short, much as I tried to find fault with this reboot, I just can't. There are a few tiny plot holes, but every film has and can be forgiven for a couple minor ones. Star Trek is an excellent film and promises to sprout a crop of new Trek fans for a new generation of Trek. As long as they can keep this up, it's going to be a good one. A very rare 10 for the sci-fi gem of Star Trek. Boldly go.",
      "total_reactions": 2,
      "user": "Oxcart"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "With JJ Abrams at the helm, this was a blockbuster that we guessed would be loud, explosive, and armed with enough action to rival any blockbuster. It doesn't disappoint.",
      "total_reactions": 1,
      "user": "StevenF"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "This is bound to be one of the best movies of the year. In my book, it definitely is.",
      "total_reactions": 2,
      "user": "oxana"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "Oh my, time travel?  Again?  Rather than actually have to work at creating the Star Trek universe from the past JJ Abrams has opted for the lazy route; to retcon everything with the mentioned time travel plot.  That said the film is surprisingly decent.  The cast are good, Chris Pine pulls off  Kirk well and it would of been a lesser film without him.  He takes the main facets of Kirk; Intelligence, emotion, empathy, equality, imagination and ego and makes his own Kirk, as apposed to just trying to copy Shatner.  Kudos to him.  Like I said, I wasn't keen on the plot but I liked the motivation for the villains.  I also liked Eric Banner's mix of matter of  fact casual attitude mixed with acute hate and rage.  I liked that the villains were former miners and their ship was an actual mining vessel, rather than them being trained soldiers on a warship etc.  The pacing is decent and the action sequences are exciting and filmed well.  There are some nice nods to fan boys also such as the Kosbayashi Maru test scene.  Some moments in the film however just seem too self aware and winky though.  All in all I thought it was a good film, not lazy in personality but lazy in conception.",
      "total_reactions": 1,
      "user": "Hyperbole"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "J.J. Abrams' STAR TREK will certainly be appreciated by those who have enjoyed the original show as a classic series. And as an action film, it certainly delivers. I thought the film was...disposable. But anyone age 30 and on praises it enormously, so I must have been born a decade or so too late.",
      "total_reactions": 1,
      "user": "Critic2012"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "In my opinion, Star Trek was never quite as cool as Star Wars and I remember some of the feature films being particularly poor. J.J Abrams does his best to equal things up by giving the much-loved franchise a much needed modern update with this 2009 reboot.",
      "total_reactions": 1,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "In short, the film is an action-packed and glorious adventure. Not having watched the original series, I thought that the first film in the reboot is fantastic. The cast was great, the acting was solid, it's funny in several places, and everything is evenly-balanced.",
      "total_reactions": 1,
      "user": "Official"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "Untrue to the original series, but still a thoroughly enjoyable film. The number one consideration with this film was, \"How can I take Star Trek and make it accessible to a modern audience?\", and in that, this film succeeds massively.",
      "total_reactions": 1,
      "user": "Metanar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "I am giving this movie a 10 only because other ratings are so low.  The film is a great achievement in mastering the re-imagination of an old idea and bringing it new life.  Sure we would love to put Shatner, Kelley and Nimoy on the silver screen again in prime condition - and to try to recapture that would tug the presentation in the wrong direction.  This movie has a fair plot - a terrible villain and a mountain to climb in criticism.  The acting is fabulous.  The filming is out of this world.",
      "total_reactions": 1,
      "user": "pumbaz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "While I think that maybe the original cast is missed by most star trek fans, I think the cast selection,  conversion,  and the alternate reality could have had some problems I find that it was done seamlessly and the new cast fit in beautifully. I liked this movie a lot.",
      "total_reactions": 1,
      "user": "ricksroses"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "J.J Abrams out did himself here. I was never a fan of Star Trek and to be honest I do not think I will ever enjoy the older movies and programmes but as a stand alone film, this has to be considered the best blockbuster of the summer. It has everything you could possibly want in a film and the pacing is fantastic especially when considering how long this film actually is.The chemistry between all the characters is also great and I do love how they seem to have actually taken their time over the storyline in order to get it 100% correct. I was shocked at how much I enjoyed this film.",
      "total_reactions": 1,
      "user": "dev92"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "I've been a fan of Star Trek since I grew up watching the original series as a kid and also watching Star Trek TNG into my late teens (Star Trek TNG is still my favourite TV series of all time!). This was a great reboot of the series, I really enjoyed it! It had lots of funny moments and it was interesting to see today's young actors and actresses put their spin on the characters form the original series. Much more entertaining than the couple of mediocre TNG movies released before it.",
      "total_reactions": 1,
      "user": "Necromus"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "This movie appeals to a broader audience than just Trekkies. It takes everything that was great from the old series and puts it into a large budget film of the current day. Finally, Star Trek is on par with Star Wars in the special effects department! Great film, a must see!!!",
      "total_reactions": 1,
      "user": "Reality_Check"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "I watched this at least 5 times. The CGI was top notch. The plot unraveled at a breakneck pace, and the characterization was fabulous. What fascinated me was that there was a story to be told, and that's why the movie was made, and not just to make loads of money on a trash plot. Kirk was definitely the best character. Bana portrayed the psychotic Nero very well. The rest of the crew also delivered engaging performances. This has to be one of my favorite space movies. The movie succeeded in reviving a dying franchise.",
      "total_reactions": 1,
      "user": "Swati"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Absolutely fantastic! I know nothing about the previous Star Trek films or shows so I do not know where this film fits or whether or not it does justice to the saga, but regardless....this film was great. One of the best of 2009!",
      "total_reactions": 1,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "To be fair. I though this was decent reboot. I really love how all the die-hard fans are hatin this for not following ST-lore to the letter. It's a reboot, the whole point was to give it a fresh start, using something familiar.",
      "total_reactions": 1,
      "user": "Rox22"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "I've seen Star Trek a few times now yet it still doesn't really grab me as a great film. While I like it, and it's got great characters and an interesting storyline I do find myself getting just a little bored also. I'm not a trekkie, or a nerd when it comes to sci-fi films so perhaps this is why. Having said all this I still think it's a solid film, especially visually with great special effects, and there is enough here to make for an enjoyable viewing, and I am looking forward to the sequel!",
      "total_reactions": 1,
      "user": "survivorfan989"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "Good entertainment all round and it was a reasonable prequel to the movies. I liked the bad guy Banner. the young Kirk was also well cast, and you gotta love the Doc!",
      "total_reactions": 1,
      "user": "MikeGale"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "Never, never had a special interest in this series, because it has never had a story, which in my opinion was not worth seeing. but really this movie it looked appealing, so I found the opportunity to see this work.",
      "total_reactions": 1,
      "user": "forestville"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "A fantastic thrill ride that is great because of the cast.  The casting in this film is pitch perfect and director J.J. Abrams makes a Star Trek film not just for Star Trek fans but fans of any good sci-fi films.",
      "total_reactions": 2,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "Great story, lots of action, all of the characters are all there, i can easily consider this the absolute best Star Trek movie since Star Trek First Contact",
      "total_reactions": 1,
      "user": "DanteKusagari"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "And a fantastic film, full of action, humor, good performances, the own Gene Roddenberry, was creating the series today, he would like, not to mention that the film pod please even the most demanding fans, as the public casual",
      "total_reactions": 1,
      "user": "Scorpion"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "Perfect, everything was perfect.",
      "total_reactions": 3,
      "user": "ascoltami86"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "While pleasing old fans, and introducing a new generation to a timeless franchise, 'Star Trek'  lives up to the name. With jaw dropping special effects, an excellent story, and some on point acting, the new 'Star Trek' is one of the best sci-fi films and reboot/remake in recent memory.",
      "total_reactions": 1,
      "user": "charlie_west"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Very impressive, action packed, Hollywood blockbuster- that will keep you entertained throughout the whole film. the acting is good and CG I is astonishingly brilliant. the film is not just aimed a star trek fans, but a whole manner of people. this film is made great by the balance of action; acting, something you don't normally see when the CG I is as big as this.",
      "total_reactions": 1,
      "user": "turbulentmaniac"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "This was an excellent movie, and no one else can convince me otherwise.",
      "total_reactions": 1,
      "user": "pkmarie10"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 9,
      "text": "An interesting different approach to the new Star Trek. A more \"shoot first and ask questions later\" feel. And I very much so enjoyed it. A much faster pace which is much preferred in my mind and excellent special effects and a brilliant casting. Good to see Simon Pegg in there as Scotty! The only letdown is the lens flare which can be off putting at times. But a thrilling story nonetheless with a fantastic villain and it seems this is the benchmark for the next generation of Star Trek.",
      "total_reactions": 1,
      "user": "SamSk"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "I really enjoyed this film! There was action, there were great special effects, there was humour, and a lot of nostalgia for those familiar with the original series. All the characters were entertaining, although some could have been developed a bit more (Eric Bana was excellent as Nero, I wish we could have seen more of him).",
      "total_reactions": 1,
      "user": "ypomoni"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "As someone who despised the earlier television and film series, this was a worthy re-imagining that works amazingly well. This film benefits from J.J. Abrams fantastic direction and its outstanding character interaction. Chris Pine as Kirk is very well cast and Zachary Quinto as Spock is just flawless. The visuals are beautiful to look at and are extremely well choreographed. All of these attributes are followed up with a very well written script that manages to be original and entertaining! Whether you enjoyed the Star Trek in the past or not, Star Trek '09 will fascinate you to infinity!",
      "total_reactions": 1,
      "user": "Epicluko"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "A very stylish film done with elegance and creative vision, then add on top of that a great script, well done acting, eye popping visuals and you have this major hit!  Great, great film and a great restart to this beloved series.",
      "total_reactions": 1,
      "user": "DibbHansen"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "I admire it's noir tone to the classic and cult sci fi series, and it's lead men are very charismatic and 'vulcan'. The story could have been a little simpler, but otherwise a movie I could watch more than twice.",
      "total_reactions": 1,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "If I had a coffee bean, I'd extract the elixir of life from it in the Post-It note, I'd stand in the rain with it in the gravy-boat... My trenchcoat is really a diesel-powered basking shark.",
      "total_reactions": 1,
      "user": "Kabahaly"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "Star Trek (2009) on Blu-Ray is a fantastic film running 126 minutes long.The film is a new take on an existing series, it does suffer from consistency issues with the Star Trek series. Nothing that will hurt the movie if you can look beyond that though. With that said, the movie is paced well, with the entire story being important to the outcome of the film. Throughout the movie, we have an opportunity to explore a number of landscapes, ice worlds, space, and earth. This Star Trek though is beginning of the journey, prior to the original Star Trek series, and as such is a perfect entry into the Star Trek world for both new and old. The story is a tightly nit tale of retribution, coming of age, and desire. The screenplay was well written, the characters were confident and fun, and as a whole it was a great experience. There were some pieces of this which may make it inappropriate for younger audiences depending on family rules. There is some kissing, women in underwear, and some crude humor. There is also some profanity spread throughout as well as characters who are intoxicated. Overall though, I would say for most families and children this movie would be fine for anyone over the age of 10-12.",
      "total_reactions": 1,
      "user": "R4z3r"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "A Wonderful Space Adventure Movie !!!",
      "total_reactions": 1,
      "user": "Assassination"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "An excellent film with an amazing cast.  This revised vision of the Star Trek films taught the film industry how to reboot a franchise.  Unfortunately now there will be dozens following suit.",
      "total_reactions": 1,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "Star Trek reignites the its franchise with a style. Crisp cinematography, good acting, deft directing and a good soundtrack contributes to raise the movie's bar.",
      "total_reactions": 1,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2013
      },
      "score": 9,
      "text": "I hated what Mike Pillar, Rick Berman and Brannon Bragga did to the franchise (Voyager, DS9, Enterprise). They eventually ground the whole thing into the ground. Then J. J. Abrams, Roberto Orci and Alex Kurtzman come a long with a flippin great idea that resurrects the franchise in one fell swoop. Well, it probably wasn't all that easy, but it worked  as in great masterpiece scifi action adventure. Casting was fabulous. I'm still watching this... over and over. Got a few 'dead in the heart' low score trolls here that probably ought to take up a new hobby... like law bowling... might fit their personality a bit better. The rest of us... XD",
      "total_reactions": 1,
      "user": "FilmHack"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "I really enjoyed this movie. Eric Bana steals every scene he's in as Nero. The dialogue is sometimes a little too cheesy but it certainly doesn't damage the movie too much. It's a fun, action-packed movie that never really takes itself too seriously which I think is pretty rare nowadays. If you want to experience a fun movie then I would recommend it, just don't expect and Oscar contending movie.",
      "total_reactions": 1,
      "user": "Longo12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "Not liking Star treks' old series and movies, surprisingly I loved this film. Its Star Trek for the modern era no doubt. The film is faster more intense and worked out really well JJ takes this film in a great direction and I found myself blown away by Chris Pine and James Kirk and Zachary Quinto as Spock. Whether you liked the previous star trek franchise or not you will most likely enjoy this film.",
      "total_reactions": 1,
      "user": "AaronWasserman2"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "Star Trek reignites the its franchise with a style. Crisp cinematography, good acting, deft directing and a good soundtrack contributes to raise the movie's bar.",
      "total_reactions": 2,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "The whole black hole turns into a space-time continuum bit was very well done and convincing.",
      "total_reactions": 1,
      "user": "anichels"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "This is just what the Star Trek franchise needed, someone who could take a look at it from a new perspective and creatively re-imagine the whole thing. JJ Abrams made the best Star Trek movie in an incredibly long time and was able to do it while keeping all the trekkies happy. The visual effects are some of the best I've seen, the plot is wonderful, the acting is superb, there's so much that could be said. This is a movie that appeals to all ages whether you like Star Trek or not.",
      "total_reactions": 1,
      "user": "homer4president"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "Star Trek is a surprisingly good reboot with a great cast and performances I really loved the development the characters got while also delivering some great action sequences Star Trek is a clear example of when the person who loves the material makes a re- imagining it turns out fantastically my only flaws with the film is that there was one plot hole and that the Leonard Nemoy cameo felt forced other than that its a great movie",
      "total_reactions": 1,
      "user": "TheDude-"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "very fun movie! I never liked star trek until this movie! its made for the new generation and it is fantastic! Chris Pine and Zachary Quinto are fantastic!",
      "total_reactions": 1,
      "user": "waronasserman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "We were all a bit self-aware about this flick. Whether it would be a major flop or a huge success. I am pleased to say it was the latter. This movie introduced a lot of people to Star Trek and got more people interested in it. If you're a sci-fi fan, I recommend seeing this movie.",
      "total_reactions": 1,
      "user": "BoogeeFilmGuy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2015
      },
      "score": 9,
      "text": "Clever, witty, funny, thought-provoking at some parts, action-packed, Star Trek surely exceeded my expectations. The story can be confusing to newcomers, and will definitely warrant another viewing to make sense of it all. But the movie is so good that it is not a bad thing to do so.",
      "total_reactions": 1,
      "user": "YT_TheHaloFreak"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "Impressive Hollywood product, exciting story, outstanding acting performances! This one is an excellent sci-fi movie, stunning and much more spectacular than usually we may see any other fantastic tale!",
      "total_reactions": 1,
      "user": "aadityamudhar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "Now... for Star Trek, it's only a matter of time before this movie finally gets a good score from me. As expected, we all thought Star Trek could've been better. It's the only 'better' we could get.",
      "total_reactions": 1,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "I have never been a fan of star trek,cas it related to science, and had terrible action and effects. But now that I saw the star trek reboot, I enjoyed it more than I thought I would. It has action, a new and enjoyable story, and effects are great.",
      "total_reactions": 1,
      "user": "gameguardian21"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2016
      },
      "score": 9,
      "text": "Amazing, absolutely amazing. JJ Abrams is such a creative force of nature. Taking the Star Trek franchise and making it fresh for a new audience as well as giving the old fans what they want as well. Also the cast is all absolutely perfectly casted and resemble the old characters.",
      "total_reactions": 1,
      "user": "AaronWasserman1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "As a moviegoer, Star Trek provides some visually breathtaking action, an outstanding and clever script, some great acting, and some fun humor. Star Trek is smart, fun, and emotionally satisfying. This is a must see, and let's hope that the sequel is just as good.",
      "total_reactions": 0,
      "user": "Moviebuffreview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2016
      },
      "score": 8,
      "text": "Despite the familiar characters JJ Abrams takes Star Trek in a very different direction, a direction that will likely prove off putting to some purists. Taken on its own merits however this is an entertaining piece of sci-fi and a promising start to this new vision for long running franchise.",
      "total_reactions": 0,
      "user": "drlowdon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2016
      },
      "score": 3,
      "text": "Star Trek is really awful. The original series was known for being cheesy and stupid, which is also why it never resonated with me too much. Sadly, so is this one. Packed with stupid quips that are supposed to be funny but are not, Star Trek is also maligned by many other faults. The entire cast is dreadful, the story is beyond stupid, convoluted, and ruined by the time travel element. The time travel element, instead of being interesting, is really poorly executed and makes no sense whatsoever. It adds a layer of complexity to a plot that did not really need another layer of complexity. The resolution comes far too quickly and easily. Sure, some people die, but the crew is never really threatened. The plot is packed with filler that really adds nothing other than an opportunity to play 80's music. The dialogue is horrifically cringe-inducing and, even worse, it looks fake. The set design is blatantly obvious and is so bad it is reminiscent of a 50's movie when somebody is \"driving\" a car - it is that obvious. The only saving grace here is the special effects, which are incredible. Unfortunately, the look of the film is ruined by JJ Abrams' hard on for lens flare, which is distracting and wildly overused. Overall, Star Trek may have stunning space visuals and some cool designs, but the film is like the hot girl with no personality.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2012
      },
      "score": 6,
      "text": "What a fresh action-comedy... But hey, I was expecting a science-fiction movie! What went wrong? Star Trek takes 30 boring minutes to set itself up like a teenage comedy, explaining that Kirk is Kirk and Spock, well, Spock. Then the action kicks in, and it gets a lot better. It's a lot of fun, and the actors, effects and score are pretty damn good. But the story is thin and the script rather heavy-handed. Where are the ideas and ideals? Would I be a real star trek geek, I would probably be offended by this.",
      "total_reactions": 0,
      "user": "Jailhouse_McGee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2016
      },
      "score": 10,
      "text": "Another franchise has been brought back to life, with renewed energy -- and a surprisingly well crafted script that fully understands its source material.",
      "total_reactions": 0,
      "user": "TheApplegnome"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2016
      },
      "score": 8,
      "text": "Star Trek is true enough to its name to provide a satisfying quasi-reboot for the decades-old franchise. The science of this sci-fi action film is very thin, but the heart's still there, in no small part because of the participation of Leonard Nimoy, who has a surprisingly substantial role.",
      "total_reactions": 0,
      "user": "adpirtle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2016
      },
      "score": 8,
      "text": "A \"Star Trek\" movie truly for the next generation, director J.J. Abrams takes on an iconic science fiction franchise and injects it with some fresh, new energy that might even bring in fans not familiar with the legacy of \"Star Trek\".",
      "total_reactions": 0,
      "user": "MrMovieBuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2016
      },
      "score": 9,
      "text": "This Star Trek reboot took what the old movies and shows had, took away the cheese, added better visual effects, and better action scenes. This movie is incredible, the characters are better than they were before and the visual effects are majestic, J.J. Abrams does a fantastic job in directing this movie. This is better than all the other Star Trek movies for sure.",
      "total_reactions": 0,
      "user": "spencie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2016
      },
      "score": 9,
      "text": "Wow! i was really impressed with the new reboot of star trek, and that comes from someone who has never seen any star trek movie or series. Great characters, action,humor and a good plot are all here. This movie will not only introduce new people to the franchise but will also satisfy old fans",
      "total_reactions": 0,
      "user": "reviewer2015lol"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "The film is sufficiently smart and engaging that Abrams has effectively guaranteed the characters will be back for further adventures.",
      "total_reactions": 0,
      "user": "avamiller21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2016
      },
      "score": 8,
      "text": "Star Trek had me intrigued from the minute it began. With it's epic visual and special effects, it manages to create magnificently beautiful scenes. This is not a film where it enthralls you with it's tremendous CGI, it's a film where it entertains you with stellar performances and storytelling. It has character development that was impeccable to watch. You actually feel emotion for each character which was surprising given the fact that Spock was such a stuck-up. This is one of JJ Abrams' finest films and I can't wait to see what he has to offer next!",
      "total_reactions": 0,
      "user": "Antgiog1202"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2016
      },
      "score": 8,
      "text": "A fast-paced adventure with just enough heart and emotion, Star Trek uses the most out of its expansive cast and script to deliver a solidly-crafted reboot of the once terrific franchise.",
      "total_reactions": 0,
      "user": "Muskrat147"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2016
      },
      "score": 9,
      "text": "Amazing, absolutely amazing. JJ Abrams is such a creative force of nature. Taking the Star Trek franchise and making it fresh for a new audience as well as giving the old fans what they want as well. Also the cast is all absolutely perfectly casted and resemble the old characters.",
      "total_reactions": 0,
      "user": "Aaron_Wasserman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2016
      },
      "score": 8,
      "text": "We were pleasantly surprised with this well polished and incredibly entertaining instalment of movie genius. Great casting and stunning visuals a real treat on the big screen. Love the character development and it stayed true to the original series but was easily enjoyed by those that aren't all that familiar with the Star Trek format. Top notch work and a must see!",
      "total_reactions": 0,
      "user": "TheArchetypes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2017
      },
      "score": 9,
      "text": "While this movie does kind of feel like star wars at times, the overall quality of this movie makes it not that important in the first place. The story itself is told very well told, with and interesting take on the Star Trek universe. The characters and their banter really shine here. Spock is an alien trying not to let emotion cloud his judgement, letting the events around him challenge him to do that. Kirk is your reckless, irresponsible, and headstrong likable guy, who can see things more as fun than threatening",
      "total_reactions": 0,
      "user": "Thatonenerd2187"
    }
  ]
}