{
  "mc_avg_user_score": 7.9,
  "mc_metascore": 64,
  "mc_mixed_rating_frequency": 31,
  "mc_movie_name": "State of Play",
  "mc_negative_rating_frequency": 2,
  "mc_positive_rating_frequency": 114,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "Very good movie. Some incredible performances by Russel Crowe and Rachel McAdams, plus a complex and interesting story, make this one of the best movies of this genre i've seen.",
      "total_reactions": 1,
      "user": "Razv"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "State of Play is a sloppy, incoherent thriller that's too long and seems to forget the fact the its playing to an audience, and rather just drones on.",
      "total_reactions": 1,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2011
      },
      "score": 6,
      "text": "A disapointment. Casting mistakes. See the orignal: the British TV show. American version might have been better if done in 6 episodes on cable network",
      "total_reactions": 0,
      "user": "warfield"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "I think it's gonna be great political thriller if still 'keep low'. State of Play deliver slow-paced, twist and well-acted but I think a little cliche.",
      "total_reactions": 0,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2011
      },
      "score": 9,
      "text": "Sensational film based upon the BBC series of the same name. Russell Crowe is magnificent as journalist Cal McCaffrey while Ben Affleck is convincing as congressman Stephen Collins. The supporting cast are incredible also with Helen Mirren as a ruthless head editor and Rachel McAdams as rookie, up and coming Della Frye. State of Play focuses upon Stephen Collins (Affleck) a rising star of his political party until his lead researcher Sonya Baker is murdered. Her death leads to lies, conspiracies and secrets spilling out. Investigative journalist Cal McCaffrey is old friends with Collins and is handed the story by his ruthless editor Cameron (Helen Mirren) Cal and his partner Della find themselves involved in a cover-up that threatens to shake up America's power structure. They soon discover that with billions of dollars at state no ones life is ever safe. A very well written script by Billy Ray, directed brilliantly by Kevin McDonald State of Play is a political thriller you simply cannot afford to miss!",
      "total_reactions": 0,
      "user": "Rosco"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "\"State Of Play\" one line review!",
      "total_reactions": 0,
      "user": "LevelsAndGear"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "This movie is exceptional, and even with its crazy twists it manages to entertain and mystify for its entire running time.  The characters are amazingly acted, and most of them knock 'real' straight out of the ballpark, while Russell Crowe delivers an Oscar-worthy performance.  Well-written and executed on all fronts, State of Play is a movie I will definitely come back to time and time again.",
      "total_reactions": 0,
      "user": "CRL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "A political thriller with all of the right needs: dependable leads (Russell Crowe, Rachel McAdams), an interesting script and taunting direction from Kevin Macdonald.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "I really liked this one. It was incredibly engaging and tense from the very beginning and kept you guessing, you never really knew what was coming around the corner. I really liked all the performances and the directing was incredibly well done and honestly, this is how a political thriller should be.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "With a tightly-wound story that never ceases its flow of intrigue, a delightfully passionate ensemble cast that impresses while it entertains, and a solid directorial foundation from Kevin Macdonald, \"State Of Play\" makes for a worthy addition to the \"journalism thriller\" sub-genre.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "A good plot, even though not exactly original, with enough twists and turns to keep you watching without making your head spin. Based on a 5 hour BBC mini-series of the same name, and obviously having to omit a lot to condense into a film, you do not feel like there are unexplained aspects to the story by the end of it.",
      "total_reactions": 0,
      "user": "ypomoni"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "State of Play is a fresh concept.",
      "total_reactions": 0,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "State of Play: 6 out of 10: State of Play is two hour plus big budget thriller without one memorable scene and only one memorable performance. The memorable performance is Helen Mirren who brightens up the screen whenever she appears. The rest of the performances are more stereotypes than individual characters.",
      "total_reactions": 0,
      "user": "juliankennedy23"
    }
  ]
}