{
  "avg_user_score": 5.1,
  "metascore": 45,
  "mixed_rating_frequency": 12,
  "movie_name": "Step Up: All In",
  "negative_rating_frequency": 10,
  "positive_rating_frequency": 11,
  "pro_critic_reviews": [
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 75,
      "summary": "It’s the rare movie that knows its limitations, but also understands how to use form to best convey its strengths, pulling together countless complicated dance scenes in which the relationships between teams and characters come through more clearly than they could through dialogue."
    },
    {
      "critic": "Inkoo Kang",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 70,
      "summary": "The film has a muscled buoyancy and thrilling, joyful spectacles that make the fifth installment of the popular franchise an energetic crowd-pleaser."
    },
    {
      "critic": "Kyle Anderson",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 67,
      "summary": "The space between the spectacles are just too laborious, creating the odd sensation that there's not quite enough dance in this dance movie."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 60,
      "summary": "The fifth entry in the popular dance-off franchise is, like the others, a fantasia that upends the usual rules of filmmaking. Here, the more threadbare the scenario, and the more unmotivated an action, the better. Character and story just get in the way of all the awesome dancing."
    },
    {
      "critic": "Charlotte Runcie",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2014
      },
      "score": 60,
      "summary": "It’s preposterous, but I dare you not to smile at the high-kicking silliness on offer, or the sweetly old-fashioned undertones: as the inevitable final showdown looms, loyalty, hard work and fair play are just as important to the dancers as strutting their stuff."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "The exuberant dance sequences have long been the series’ saving grace, but even those are starting to feel redundant and interchangeable."
    },
    {
      "critic": "Christy Lemire",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "Even by the standards of this franchise—and this genre in general—Step Up All In is pretty laughable."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "Step Up All In,  directed by the dancer and choreographer Trish Sie, signals a slight retreat from the bonkers, protest-themed “Step Up Revolution.\""
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "With even less plot than in previous installments to get in the way of its inventive 3D dance scenes, this fifth pic delivers on spectacle... but lacks in chemistry."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 45,
      "summary": "Even if the big numbers in Step Up All In don't always hit the heights of its immediate predecessors, there are enough exultant moments – during the crew battles or Sean and Andie's pas de deux on a carnival ride — to tide you over until the inevitable Part Six."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 40,
      "summary": "Step Up All In cuts too fast, the way an MTV hack does when forced to disguise that a starlet can't move."
    },
    {
      "critic": "Penny Walker",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 40,
      "summary": "The finale's energy level and actor buy-in makes it vastly more enjoyable than the rest of the film."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2014
      },
      "score": 40,
      "summary": "This really doesn't have the fun or the zip of that earlier Miami adventure. The dialogue is even more tired and, crucially, the dance sequences themselves are looking less fresh this time around."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 38,
      "summary": "The best that can be said for “Step V” is that it has some sparkling moments of choreography, clever gimmicks as themes for the dance-offs and lovely costumes."
    },
    {
      "critic": "Mark Jenkins",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 37,
      "summary": "First-time director Trish Sie, a music-video veteran, is more interested in spectacle than character, as she demonstrates even when nobody’s dancing."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 30,
      "summary": "Because “all in” – to me, at least – suggests a certain standard of enthusiasm, of emphaticness, and what this latest Step Up movie indifferently chunks out falls far short of that standard."
    },
    {
      "critic": "Boyd van Hoeij",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2014
      },
      "score": 30,
      "summary": "It is unlikely that a lot of viewers come to see a Step Up film for convincing dialogue or psychological insight into a group of young things trying to make it big in a ruthless industry. But there’s barely any humor that doesn’t feel third-rate and most of the plot threads are so thin that All In occasionally feels like a satire of a dance film."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "One of these days Step Up will realize that it's better for the characters to just whimsically dance like in old musical movie without forcing an already stagnant plot. The movie boasts a dynamic choreography and stellar music to go with it, some are timed just right and they are admittedly entertaining. It commendably tries to bring a dancer's perspective on their life style and tribulation, but the plot often contradicts the effort by putting overly flamboyant characters or tired plot. In the end it's just another drawn out excuse for a dance battle, albeit a rather spectacular one.",
      "total_reactions": 2,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "I was one of the first people to see the movie. In my coutry it released really early, I think it was 11th or 18th of July.",
      "total_reactions": 2,
      "user": "TheMaker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "Step Up: All In is the 5th installment in the forgettable Step Up franchise. It is so formulaic, cliched and very predictable that if you have seen the trailer you have seen it all.",
      "total_reactions": 2,
      "user": "HaithamB"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "Step Up: All In is a boring dance movie. Really. If you've seen the trailer, don't bother to watch this spoiled opportunity. STAI follows Sean played by Ryan Guzman who teams up with the previous actors from the previous instalments battle to see who is the best dancer of all. Sounds good, right? Well, director Trish Sie has done a poor, horrible and bad job on this film. The story is loose, the characters don't tie together, and the dance is also CGI made. It's just Battle Of The Year 2! Step Up 2 and Revelution were both good movies, but All In is an example of the series going downhill.",
      "total_reactions": 2,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2014
      },
      "score": 0,
      "text": "This movie is just bad, really bad.  The script is just a constant fail, I felt shamed.",
      "total_reactions": 1,
      "user": "yusep"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "The people in step up: all in, can do better at dancing. Sound mixing: OK. Storyline: hmmm. I'll will have to say mixed between ok and terrible. Also the editing is a problem. Dancing was ok, but they need to do better.",
      "total_reactions": 0,
      "user": "IMAX500"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "T    -    h    -    i    -    s    A    M    -    o    -    s    -    t    M  -    o   -    v    -    i    e    D    -    a    -    n    -    c    -    i    -    n    -    g    In The World",
      "total_reactions": 0,
      "user": "alex2080"
    }
  ]
}