{
  "mc_avg_user_score": 8.5,
  "mc_metascore": 58,
  "mc_mixed_rating_frequency": 35,
  "mc_movie_name": "Stoker",
  "mc_negative_rating_frequency": 27,
  "mc_positive_rating_frequency": 323,
  "mc_pro_critic_reviews": [
    {
      "critic": "Olly Richards",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2013
      },
      "score": 100,
      "summary": "An intense mix of horror, thriller and domestic drama, this is exquisite film making."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 88,
      "summary": "The chilling and stylish and aggressively creepy Stoker begins at the end and takes us on a shocking and lurid journey before we land right where we started, now seeing every small detail through a different lens.\r\nIt's disturbingly good."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 83,
      "summary": "Stoker operates in a perpetual state of dread, a sophisticated Southern gothic that starts out confusing and winds up as a perversely humorous coming-of-age yarn."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2013
      },
      "score": 83,
      "summary": "Anyone already planning on seeing Stoker, the English-language film debut of Oldboy and Thirst director Park Chan-wook, shouldn’t read this review. Or watch a trailer. Or read anything about it at all, really...It’s best taken one tense, exhilarating moment at a time, without anticipation or expectation."
    },
    {
      "critic": "William Goss",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 83,
      "summary": "Park allows this macabre coming-of-age tale to be defined by mood and style above all else."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 83,
      "summary": "More blatantly an exercise in style than anything on par with the director's crowning achievements, and suffers to some degree from the predictability of its premise."
    },
    {
      "critic": "Scott Tobias",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2013
      },
      "score": 80,
      "summary": "For as long as Park and Wasikowska keep it burbling, it's an intoxicating brew."
    },
    {
      "critic": "Jeremy Kay",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 80,
      "summary": "Literary references and symbolism abound in Stoker. You can get tied up trying to figure out who is what. That is the idea. All the clues are there. You just have to look closely."
    },
    {
      "critic": "Kevin Harley",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 80,
      "summary": "Park Chan-wook brings operatic finesse to generic material in his tight-wound, wickedly weird US debut. And Mia Wasikowska nails it."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 80,
      "summary": "Park's unsettling visuals and his handling of the cast make the occasional holes in Wentworth Miller's script practically irrelevant."
    },
    {
      "critic": "Guy Lodge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 80,
      "summary": "A splendidly demented gumbo of Hitchcock thriller, American Gothic fairy tale and a contemporary kink all Park's own."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "Stoker is the sort of stylish, cerebral movie that engages your brain instead of your emotions, and yet you’re never less than intrigued by the breathtaking visual artistry of this slow-burn thriller."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "A beautifully twisted, slow-burning psychothriller that may or may not all be taking place inside India's head."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "Once Wentworth Miller's screenplay starts to provide answers for Charlie's mysterious menace, though, expectations are left unfulfilled."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "Stoker is deliciously demented, and that's a good thing. This twisted coming-of-age tale takes us into \"Carrie\" territory without the supernatural element."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 75,
      "summary": "Sure, it’s got its horror aspects. But for my money, this movie belongs alongside “Secretary,” “Ginger Snaps” and “Thirteen” in the family of deliciously dark female coming-of-age stories."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 75,
      "summary": "The performances are excellent, but it’s the direction that lifts the movie up and spins it around. Like Hitchcock, Park storyboards everything ahead of time, and while that level of control might seem claustrophobic in theory, it ends up freeing Stoker to sail into zones of malevolent visual sensuality."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 75,
      "summary": "Stoker is Park's darkly funny, deliciously depraved riff on Hitchcock's \"Shadow of a Doubt.\""
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 75,
      "summary": "The Hollywood debut of Korean filmmaker Chan-Wook Park (“Oldboy”) is a vivid, short exercise in tone, a movie lacking shocks and huge surprises, but one that makes up for that by creeping us out, from start to finish."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 70,
      "summary": "There is something immensely rewarding about being in the hands of a director whose confidence is such that he can lead us to uncomfortable places and we’ll go eagerly along for the ride, just to see where it leads."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 63,
      "summary": "Like a taxidermied owl, Stoker is lovely to look at, but in the end it’s hard to give a hoot."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 63,
      "summary": "Wasikowska is a fine, intriguing actress, though I'm not sure anyone could make actual psychological sense of this woman. Nobody on screen — not Kidman, not Goode, not Wasikowska, not Jacki Weaver as Auntie Gin — seems entirely at home in the chosen (or guessed-at) style."
    },
    {
      "critic": "Read full review",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2013
      },
      "score": 63,
      "summary": "It does have a dark, satisfyingly sinister feeling of gothic creepiness that I somewhat reluctantly admit appealed to my enjoyment of perversity as entertainment."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2013
      },
      "score": 60,
      "summary": "The movie is less to be experienced than to be appreciatively studied, like an insect, a stuffed bird, or the sketch by a gifted artist in the style of an Old Master — in this case, the Master of Suspense. It’s not pure Park or pure Hitchcock but a muted, mildly mesmerizing blend of the two. You might want to take a careful stroll in this Hitchpark."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "The new thriller from South Korean director Park Chan-Wook is a bizarrely perverse, beautifully rendered mystery that you may or may not care to solve."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "The final act of Stoker walks a fine line between the sensational and the silly. Mr. Park is less interested in narrative suspense than in carefully orchestrated shocks and camouflaged motives."
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "Park's methodical but tonally uneven direction too often eschews luridness; it's as if he can't decide exactly how far to push his material into the loopy. Still, his assured and evocative camerawork intimates that peril lurks everywhere, and there's an alien quality to its performances and dialogue that suggests a world slightly unhinged."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "Drooling fanboys and \"Buffy\"-loving academics are sure to go wild — not that there’s anything wrong with that…right? Stoker is a gorgeous wank job; just prepare to hate yourself for loving it."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "Once the film gets cooking, the questions never stop. For instance: When you find the dead body of someone you love, isn’t your first call to the cops?"
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "Park employs all manner of cinematic derring-do – shock cuts, off-kilter compositions, discontinuous storytelling – all to no great purpose other than to make us go “Wow.” A more appropriate response might be, “Huh?”"
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "Park is busy treating every frame like a runway model, dressing it up in self-conscious layers of cinematic haute couture. It’s gorgeous to gaze upon but otherwise dessicated – listless, juiceless and ultimately pointless. For all his exemplary camera work, there’s no motion, or emotion, in the picture."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "The film's weird mix of dollhouse dread and fashion-magazine chic can be fetching, but it's nothing if not vacuous, a series of disjointed, improvisatory riffs that recall the brazen aesthetic overload of Amer."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 42,
      "summary": "The movie wants to be Hitchcockian, but it's the flat-footed Hitchcock of \"Marnie\" that Park evokes. His filmmaking here is hermetic and lugubrious, with each physical movement meaninglessly heightened and every line hanging in the air with (empty) significance."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2013
      },
      "score": 40,
      "summary": "What we end up with is an arm's-length film that feels more haunted than haunting -- and one that audiences will want to forget rather than remember."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "Stoker is like the baby David Lynch and Tim Burton had, then left on the doorstep of the Addams Family. Full of heavingly gorgeous images that envelop a viewer before smothering them, its maddening elements eventually become too much to bear."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "Spontaneity has been banished by rigid stylization, and the net effect is as lifeless as a severed head that turns up in a basement freezer."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "Wasikowska drabs herself down. Her body is undefined in dowdy clothes, her hair hangs limply. But her eyes usher you into her inner world, with its battle between girlish longing and the impatience to move on and be what she really is — whatever that might be. It’s a richer performance than the movie deserves."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 37,
      "summary": "Stoker plays out like a Kabuki “Macbeth”: gallons of style slathered on a story you already know by heart."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 30,
      "summary": "Stoker, which plays something like a remake of “The Addams Family” mixed with “The Paperboy” — but without the laughs of either – belongs in a special category of movie badness, or perhaps two different but overlapping categories. It’s a visually striking but fundamentally terrible film made by a good or (some would say) great director."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 25,
      "summary": "The movie reveals itself as not merely dull, but pointless."
    },
    {
      "critic": "Rodrigo Perez",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 16,
      "summary": "The risible Stoker is a brutally empty, deeply unfortunate movie, and Park Chan-wook's jackhammer of a tool he calls a brush is, on this evidence, something that should be locked away."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "Love or Hate Wook Park, but you will certainly love Stoker. Bloody, stylized with awesome cutscenes and a well done story of a sexually abused girl by his mom's lover. It's a slow burn, quality thriller. It's graphic brutal violent content can be overwhelming but this movie manages to control it. It's a fun movie in a way. Dark, stylish and brutally good. Stoker is a little bit of everything.",
      "total_reactions": 3,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "Stoker is a technically brilliant film, evident of the mastery of Chan-wook Park whose 'revenge trilogy' is truly unforgettable and 'Oldboy' in particular one of my favourite films of all time.  Unfortunately though it never becomes anything more than a technically brilliant film and even though there are scenes (like the one when Mia is brushing Nicole's hair) that are simply magnificent, the overall result is more muddled than unsettling.",
      "total_reactions": 1,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "Cinematic gold. Stoker is hypnotic, stunning, gorgeous, satisfying and stylish. A masterpiece delivered by the director that brought us the film: \"Oldboy\" which is another amazing piece of cinema. For those of you who don't know, Chan-wook Park is a Korean film maker and Stoker is his first English language film, and this has put him as one of the directors to look our for. The acting is outstanding, the cinematography is stunning, the plot is flawless, and it's not by Quentin Tarantino, but it seems like a Tarantino. I will not recommend this movie to all movie goers, or at least those who do not favor violent films, yet its an amazing movie, film making at it's best.",
      "total_reactions": 1,
      "user": "UtopianStuff"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "Stoker has a first rate art direction and an exquisite editing with an astonishing soundtrack and a great cast but a ridden of cliches and a third rate, tired and unoriginal plot that is pointless and dumb. This thriller is gruesome and it is not everyone's cup of tea, although it looks spellbinding and delightful, it is a dull, disturbing and an uneven experience in so many ways.",
      "total_reactions": 4,
      "user": "MovieGoer14"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "It's safe to say that fans of the Director will be pleased but so wil regular audiences as well.  This is a GREAT thriller which is simultaneous vividly stunning with excellent performances.  Look for this to steal some Oscars next year.",
      "total_reactions": 6,
      "user": "JayMan123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "Is very strange and is not commercial. Is very Well acted and is fun. The images are very beautiful and psychological terror. Is very paused and sometimes is erotic",
      "total_reactions": 3,
      "user": "guillepcosio"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "Prior to and superseding Old Boy, the penultimate film of Park Chan Wook's Vengeance Trilogy, incest is intimated(whereas incest becomes actualized in the 2003 Cannes Grand Prix winner), a forerunner to Stoker, his American major studio debut, where sexual tension between an uncle and niece is unequivocally stressed. At the outset of Sympathy for Mr. Vengeance, a mute brother and his dying sister hold each other like lovers as they look out toward the coastline, while over the soundtrack, the brother's letter is read over the radio airwaves, a letter that promises his beloved sibling, a kidney. During the convalescence, she allows Ryu to wipe down her arms and legs in the nude, save for a towel, a sponge bath that conveys the potential for transgressive intimacy. It's the ease and lack of self-consciousness about exposed skin from the pair which suggests a chummy history. In Lady Vengeance, incest is employed as metaphor, when Geum-ja, a parolee wrongly accused of child murder, has sex with a bakery co-worker who sees her as an \"elder sister\", a teenager at least fifteen years Geum-ja's junior. Incest, however, in Old Boy, rises above the subtext and begets two separate but interlocking interfamilial relationships that climaxes into the most tragic of tragi-comic endings. It's only natural that the South Korean filmmaker would choose to remake Shadow of a Doubt, the perviest of films in the Alfred Hitchc*ck ouevre. Not for nothing, in Stoker, does Evelyn, the mother, brag to Uncle Charlie, her brother-in-law, about the recently widowed woman's ability to speak perfect French, since Francois Truffaut(The Bride Wore Black) famously refashioned  tropes to his own European art-house sensibilities, as does Wook Park(working from a script he didn't pen), who ferrets out the depravity that courses through the veins of Charlie and Young Charlie(visually linked by matching introductory shots of them lying down on beds) in Shadow of a Doubt, Our Town's shadow, the 1942 film with a similar double-barreled incest storyline as Old Boy. \"Have you ever seen...yourself,\" India asks a boy, \"...from an angle you don't get to see when you're in the mirror,\" while walking in the woods, just prior to his attack on her. Stepping out from behind the trees, Charlie rescues India, giving his niece a chance to flail away at her oversexed classmate, after he bonds his wrists and ankles together. Very obliquely, India's little speech recalls Old Boy, when Soo-ah allows Woo-jim, her brother, to molest the consenting schoolgirl in an empty classroom, going so far as taking out a compact mirror so she can get a better look at this familial lover giving her exposed breasts a tongue bath. She then tilts the mirror up to her smiling face. Echoing India's words, the smile says, \"That's me. That's also me.\" Comparably, that's India in the bathroom, staring at herself, too, in the looking glass, before she enters the shower, where a different, more grisly recount of the boy's murder by Uncle Charlie's hands play out; a murder fantasy that serves as onanistic material for autoerotic sex under hot water. Both violence and taboo love turns India on. But what about Young Charlie? The filmmaker, in Stoker, makes more explicit the sexual longing and violent disposition already inherent in the uncle's namesake, whose \"miracle\" could be comparable to India's \"longing to be rescued, to be completed,\" if not for the oppressive sexual climate of her times. Whereas India is an only child, mourning the sudden death of her father, Young Charlie has a full complement of parents and siblings. It's this stable family life, perhaps, that helps stave off her incubated unwholesome side which the uncle tries desperately, but fails to activate. Like Young Charlie, India is in simpatico with this long-lost uncle, sharing her counterpart's gift of telepathy, in which she hears Charlie's words of introduction from afar at the funeral. In Shadow of a Doubt, Young Charlie hums a few bars of the \"Merry Widow Waltz\", to the dismay of her uncle, who later attempts to romance his niece with an emerald ring. Earlier, through visual metaphor, Hitchc*ck shows how he wants to deflower Young Charlie. But what about the girl? Is she willing? It must be sexual attraction that prevents Young Charlie from turning the Merry Widow Murderer in? That much is made clear when, analogously, India doesn't report the discovery of their housekeeper in the family's pantry freezer. Back at the funeral party, India observes, \"You look like my father,\" and because he's her uncle, she can safely realize her daddy fantasies without guilt. When Evelyn catches Charlie helping India slip into a pair of high heels, it confirms, perhaps, something she always suspected about her husband and daughter. Like Min-Sik(who beds his daughter), India, the \"young girl\", doesn't fully realize who the person she's attracted to really is.",
      "total_reactions": 2,
      "user": "Shiira"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "Dark, chilling, and unpredictable, Stoker was a real treat. The mystery surrounding Uncle Charlie was engaging and the movie did a great job at keeping us in the dark about him. The characters are memorable and well-written. All the performances are fantastically creepy, especially the one given by Matthew Goode. It's not as well constructed as Oldboy, but this is still a fine piece of work by Chan-wook Park.",
      "total_reactions": 2,
      "user": "Zal"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Stoker is a psychological thriller that you might not expect. It's not the usual type of the genre. The storytelling is in pure style and it features its terror in a completely twisted way. It's a weird cinematic experience that might stuck in your head for some time. It didn't offer much new to the plot but it creates a both melancholic and terrifying atmosphere to the picture which made it fascinating. What's more fascinating is the film making understands the psychosis beneath it and it clearly shows them on screen. Stoker is quite peculiar but in a remarkably stunning way.",
      "total_reactions": 2,
      "user": "morfil"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "Not sure what movie the other three saw.  Stoker was an atrocious, contrived and nearly plotless waste of 105 minutes.  If you want to waste time on 105 minutes of a guy staring at everything he can possibly stare at mixed with a heaping supply of useless symbolism this may be your perfect movie, for everyone else, steer clear.  I gave it a 1 because there was one interesting and quite striking scene with two of the main characters at a piano.  Everything else was crap.",
      "total_reactions": 6,
      "user": "Settlestone"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "STOKER is South Korean director Chan-wook Park’s Hollywood debut, a screenplay written by Wentworth Miller (not-just-a-pretty-face from PRISON BREAK), and the trinity of the stars in the poster seems alluring, but bears the height of his vengeance trilogy (2002-2005), most likely it would end up to be another mishap of exotic directors lose their mojo under the high-handed industry regulations. But STOKER suffices as a hotbed for the monomania runs in the family bloodline, a maniac returns to his long-lost family and enkindles the evil out of his only kin, sounds like a horror-slasher, but the film tends to be a rite-of-passage for our protagonist India, a girl lost his father at her 18th birthday, meanwhile, murders are all around the family, even the trailer neither cares to hush up the victims nor to reveal the culprit (poor two-times Oscar nominee Jacki Weaver).",
      "total_reactions": 1,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Park Chan-wook's latest is a seductive slice of suspense titled \"Stoker,\" and it is carried with some unexpected supernatural bravura. It's not understated to say moviegoers' were thrilled when director Park Chan-wook, director of the legendary \"Oldboy\" (2003) and \"Lady Vengeance\" (2005), announced he was making his first English language feature film. Park is a truly talented director, a visual stylist with a flair for mystery. He is best known on these shores for his notorious, visceral, and character-driven 'Vengeance Trilogy'. Unfortunately, some American viewers familiar with his work, accompanied with their lofty expectations, won't get what they might have expected and hoped for.",
      "total_reactions": 1,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "A pointless movie, without any psychology in it, like a good horror movie shoud have, no moral, no talcum, a pointless, useless story about a girl who kills people without any purpose. Ok, she murdered that boy from school because he was tryin' to do her thing. But...the police man??? Bad, simply bad.",
      "total_reactions": 1,
      "user": "SweetyDumii"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2013
      },
      "score": 5,
      "text": "Very uneven  some good scenes, but a lot of uninteresting sequences. Visually great. Length is ok.  but there are much, much better thrillers out there. In the end  all style, little substance.",
      "total_reactions": 1,
      "user": "Film13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "Stoker definitely fulfilled my expectations, though I had not really watched any of the previous work by Park. I did expect some visual mastery, that is exactly what I got. The film is visually mesmerising, providing us with innumerable beautiful shots. Really, each shot can be a still photograph on its own right. It is simply stunning the amount of work this must have demanded, so the director did a superb job. The casting was great, too since everyone's performance was excellent, especially young Mia Wasikowska.",
      "total_reactions": 0,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "The movie starts at the funeral for Mr. Stoker. That leaves his introverted teenage daughter (Mia Wasikowska), his troubled wife (Nicole Kidman) and Uncle Charlie (Matthew Goode), who shows up from obscurity. And the creepy, fatal games begin. Who's killing and why? While some things about the direction and cinematography are compelling, the slow pacing and ultimately silly story keep it from having the socko effect that was desired. Interesting coincidence: Harmony Korine (director of \"Spring Breakers,\" which opened here this weekend) has an almost invisible part in this film as the art teacher.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "A twisted little horror-thriller that keeps you invested in it's mystery and bizarre sexuality. The atmosphere is creepy and dark with moments of brilliant cinematography. The characters are compellingly deranged. Wasikowska plays her coming of age character brilliantly adding to the film's deranged sense of sexuality.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "Chan Wook Park, the acclaimed director of the Vengeance Trilogy brings to life a script by Wentworth Miller in a way no other director could making Stoker a must watch. When India (Mia Wasikowska) finds out her father (Dermot Mulroney) has died she is shocked to learn she has an uncle Charlie (Matthew Goode), a suave, sophisticated man who takes an instant interest in her and her mother Evelyn (Nicole Kidman). Completely different from his previous work and a lot more subtle than the previously mentioned trilogy, Stoker is a slick and disturbingly gripping psychological mystery film with a cast so good that everything about it is a pleasure. Chan Wook manages to marry the light and dark aspects of this story so that they meld together into a film that is set almost entirely in the grey. The camera work and the mise en scene help the film feel not of the norm, not of this Earth while also grounding the film in reality. However the film really wouldn't work without the fearless performances of Wasikowska and Goode who seem to have perfectly interpreted Miller's words. Kidman is also fantastic as usual as the sultry yet petrified Evelyn, a character Kidman cuts right to the centre of  Ultimately the reason stoker works so well and is so good is because it breaks the mold of the conventional psychological thriller thanks to an inventive and oftentimes surprising script and story that brings out the best in Chan Wook's work as he shows the corruption and fear that Charlie brings in his wake.",
      "total_reactions": 0,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "Disturbing, beautiful and twisted. Stoker is an underrated masterpiece that, though a little confusing and messy at times, is a loving tribute to  films that has been made with care and creativity. With great actor and fantastic directing from Park Chan Wook, the genius behind Oldboy, and a great debut from new screenwriter and actor, Wentworth Miller, Stoker is one of this year's best.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 5,
      "text": "Chan-wook Park makes a curious art direction/stylish-heavy film which does quite engage any of our senses. Sure, the cast plays off of each other well; but it all feels a bit pointless.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "Probably the worst thriller mystery movie I have ever seen. Stoker is simply a god awful, contrived, pointless waste of 100 minutes, that offers no real tension or any realism what so ever.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "An absolute failure of whatever it was trying to be. Not artful, suspenseful, or thrilling. Terribly boring. I hated the main character the moment she was on the screen. An utterly pointless movie.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "That main character is a total waste and a terrible actress. The movie was nonsense that offered no resolution except me hating it on every level. Garbage. Atrocious.",
      "total_reactions": 0,
      "user": "ReviewCenter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "Absolutely masterfully directed. Once again Chan-wook Park shows that he can perfectly use colors and music to set a mood. It was grim and creepy and the performances by the entire cast. The thing that is truly great about this film is, as I stated earlier, the directing. It's fresh and has an atmosphere that the directing allows it to perfectly achieve. The problem of this film lies in the writing. As interesting as the plot is it does seem in certain ways implausible That's the flaw of the film but if you look past that it is quite quite good.",
      "total_reactions": 0,
      "user": "moonman1994"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2016
      },
      "score": 7,
      "text": "Within the first half hour, it becomes clear that Chan-wook Park had just finished watching Alfred Hitchcock's classic Shadow of a Doubt and decided, \"That is my next movie.\" From naming a character Uncle Charlie and making him a very mysterious figure, Park's film plays like a remake of Shadow of a Doubt until he hits the halfway point and turns it into a movie Hitchcock never could due to the Hays Code. That said, I would not be surprised if this were the film Hitchcock wished he could have made. Perverse, sick, and decidedly twisted, Stoker landed far better for me than the only other work I have seen by Chan-wook Park, Oldboy, but still feels like a largely hollow experience.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "Not really good. Wants to be a stylish serial-killer, coming-to-age thriller with a twist, but fails to be more than a pretentious, and ultimately boring movie. The characters, their actions and motivations are underdeveloped and unrealistic. The acting is good, but the writing is lacking any kind of tension or realism. I felt nothing for the main protagonist/antagonist. The sound effect and the shot very beautiful, but nothing outstanding. Not recommended.",
      "total_reactions": 0,
      "user": "oliver1h"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "My husband wanted to see the movie because of the NY Times review, while I was put off by the trailer and the mixed critic reviews. We did end up seeing it, and both loved it. It is more of a psychological thriller than the horror/slasher film implied by the trailer. The cinematography was outstanding and the direction wonderful; in fact, now I want to go back and see Oldboy.",
      "total_reactions": 0,
      "user": "joie2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "After I watched the movie a second time, I had a second thoughts about this movie, it is slow but it is very interesting, the photography is amazing and the acting as always is phenomenal, the story although it is cliched but amazing and twisty, the scenes are chilling, all in all it is very good, but not the best.",
      "total_reactions": 0,
      "user": "HaithamBayazeed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "This movie just wasn't for me.  I found while well made and well acted it suffered from a predictable and clichéd script in which you see most of the movie coming a mile away.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "An empty plotted terribly acted film that sucks the life out of you. Like a vampire. Nothing happens, and when something does it feels contrived and weird. Terrible.",
      "total_reactions": 0,
      "user": "MovieMan12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "Stoker is an exquisite film making, it sounds good, it looks great, but it lacks originality, which kind of disappoints in a movie that could be a one of a kind, lost opportunity, but let me deal with it, it is not an enjoyable experience, it is dark and dull, but in a good way, although it lacks originality, which means it has a lot of cliches, it stands out as one great thriller with disturbing imagery, great acting and storytelling, the editing is perfect the psychological part in this movie is perfect, but still, it is not what I was hoping for, pity.",
      "total_reactions": 0,
      "user": "AReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2013
      },
      "score": 2,
      "text": "what a waste of time and talent  an inexistant story  and the actors plus the cinematography alone cannot make a great movie  In the other hand  I really enjoyed Jacki Weaver's presence  she did good",
      "total_reactions": 0,
      "user": "AliBenzekri"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "This movie I could barely even finish.  The first half was boring as hell, I was about to turn it off but something finally happened.  Anyway was highly disappointed.  Was hoping for a scary movie, this was a joke, save your time and watch something else!",
      "total_reactions": 0,
      "user": "eli9494"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "I cannot express how into this I was. The fantastic acting, terrific cinematography and minimalist filmmaking helps exponentially. I can't really describe it, but suffice it to say that the callous and rigid character adds so much to immense freakiness of it all; lighting, quick cuts and scenes in one shot are so admirable. People need to understand that it isn't just about a mysterious and sociopathic uncle interrupting a girl and her mother's lives. The acting, atmosphere, tone, set pieces, metaphors, symbolism, writing, how the script ties together, directing, cinematography, score, editing, sound design, lighting and more explore the thematic elements of jealousy, maturity, coming of age, growing sexuality, family dynamics, and loss of innocence. Even if you based it off of its surface value and basic plot, it would still be solid due to its flourishes of difference in plot and filmmaking. This is easily the best film of 2013, and one of my favorite films of all time. It's up there with Kubrick and  (the latter, of course, since it was based off of Shadow of a Doubt). 9.7/10, masterful, two thumbs up, etc.",
      "total_reactions": 0,
      "user": "MattCipolla926"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "Stylish with a capital S. Park Chan-wook's film language is fantastic. He's in complete command of the medium. While it truly is a superior achievement in the technical categories, I doubt that this is the type of film which will receive much, if any, attention from the Academy. But it ought to. I liked the performances a lot as well.",
      "total_reactions": 0,
      "user": "kasperlovborg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "\"Stoker\" 10 Scale Rating: 8.0 (Great) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "It's a good thing that one can submit a ZERO as a score, because this film fully deserves it (from my point(s) of view). One does not need a hundred and fifty characters to describe how terrible it is.",
      "total_reactions": 0,
      "user": "Anwar-Mkayed"
    }
  ]
}