{
  "mc_avg_user_score": 5.9,
  "mc_metascore": 43,
  "mc_mixed_rating_frequency": 19,
  "mc_movie_name": "Stolen",
  "mc_negative_rating_frequency": 8,
  "mc_positive_rating_frequency": 19,
  "mc_pro_critic_reviews": [
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2012
      },
      "score": 58,
      "summary": "He seems to have given up on making art long ago; these days, all he wants to do is entertain, and with Stolen, he succeeds, albeit only on the guilty-pleasure level. Like seemingly the sum of late-period Cage, Stolen is unashamedly cheese, but at least it's cheese of a pungent, flavorful vintage."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2012
      },
      "score": 45,
      "summary": "Stolen is less shameless than \"Taken\" - which featured evil Albanians and other assorted politically incorrect appurtenances - which also makes it less effective."
    },
    {
      "critic": "Keith Staskiewicz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2012
      },
      "score": 42,
      "summary": "The longest stretch of logical plotting lasts about forty seconds, and the deep-rooted silliness makes it hard to take anything in the film seriously. But at least it has the decency never to ask us to."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2013
      },
      "score": 38,
      "summary": "For all the heists, chases and shoot-outs, it's a sluggish picture. Characters feel the need to stop the action to explain themselves. Thoroughly."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2012
      },
      "score": 4,
      "text": "Having been cut from the US box office, i felt lucky to get a viewing. This film commonly reminds me of 'Taken', the scenario with a kidnapped daughter, which from many aspect of blockbusters is becoming bland and boring. I mean maybe in 'Die Hard' and a few arnie schwarzenegger films, but in the 21st century you need more plot content and plot twists than the plain old story. The story is based around the farther (Nicholas Cage) being a bank robber, at firth thought i was hoping for an epic action packed film. However the film turns from an action packed first 10 minuets to a long predictable low budget middle. With a believe at least 30 minuets of a guy driving round in a yellow cab. There is poor character development, as well as a lack in creativity. The ending is highly predictable and reminds me of a low budget 80s film. The attempt at comedy is bleak at best.",
      "total_reactions": 1,
      "user": "TheFilmGuru"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "I thought it was a brilliant film. cage acted really well in it, as he does in his other films. overall, great film, great story line, great plot, a really really good film",
      "total_reactions": 1,
      "user": "reecerules751"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "a really entertaining action film, albeit too serious for it's own good, cage does really well, most of the other cast does a solid job, the action scenes are deftly handled, if you have some free time, give it a watch",
      "total_reactions": 3,
      "user": "DJohnson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2012
      },
      "score": 4,
      "text": "With the trendy \"kidnapped daughter\" plot, stolen from Taken's playbook, Nicolas Cage once again disappoints in his all new movie made of mediocrities and no appeal. Everything barely holds together, plenty of inconsistencies plagued the story and while it tries to offer minimal excitement, it turns into a boring mess. Bordering on comical, it also has contrasting serious tone, which is delivered in a heavy handed manner. This creates strange performance, especially on some parts, and leaves me wondering whether it's made in the '90s.",
      "total_reactions": 2,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2012
      },
      "score": 6,
      "text": "a decent film, no more, no less, decent performances, decent action, decent plot, the only thing wrong with it is that it hardly ever does anything truly good.",
      "total_reactions": 2,
      "user": "extrafizz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "I really enjoyed this film. The story was good, the action intense, characters were solid and the movie reminded me alot of taken. just wish it was a little bit longer but awesome well made action movie nonetheless. I definitely recommend giving this movie a watch or two",
      "total_reactions": 2,
      "user": "C3realkillah"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2012
      },
      "score": 2,
      "text": "Boring. Pathetic. A very mediocre movie. I don't know what is wrong with Nicolas Cage, he got to learn how to turn down a role and only do films that have potential. Stolen is nothing but a mixture of some action films that I've already watched. I wasted my time. Don't watch it!",
      "total_reactions": 1,
      "user": "theahsanhaseeb"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "epic",
      "total_reactions": 1,
      "user": "billylenz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2013
      },
      "score": 1,
      "text": "Nicholas Cage is known to enjoy making bad action films. However he somehow manages to make them fun wither either his oddball performances or his tongue in cheek sense of humour. For example Con-Air (also directed by Simon West) is a bad film but cage makes it entertaining with his over the top southern lilt. Stolen on the other hand is just garbage. When Bank Robber Will Montgomery (Cage) is released from prison a man from his past ransoms his daughter for the 10 million dollars he thinks he deserves. Without any options he must attempt a dangerous heist with the help of old friend Riley (Malin Akerman) to rescue his daughter. I'll keep it short because I honestly believe trying to find merit in a film like this is akin to drawing blood from a stone. The film has only one entertaining element and that is Josh Lucas' villain. He is hilarious to watch as his acting is so terrible its moderately funny. Besides that the film is one mistake after another. The finale is the worst offender as the action is awful as the scenes are dark and impossible to see, Cage looks like the film has finally broken him and the film nosedives into the credits. The father daughter dynamic is non existent and Cage and Akerman have little to no chemistry so the entire 2nd act doesn't work. In fact the whole film doesn't work, it is a misconceived abomination of a film.",
      "total_reactions": 0,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "If you like Nicolas Cage, you will like Stolen, because it is vintage Cage with a capital “C.” He swaggers, he sweats, and he suffers over ethical dilemmas. Just when you think he is a hardened criminal who has seen it all, it turns out he has a soft spot for his little girl. After getting out of jail, he stops to buy her a teddy bear before turning up at her doorstep for the first time ime in eight years, which might be why he was a little out of touch with the fact that she is now a teenager who wears make-up and sees a psychiatrist. Now in his late forties in real life, Cage has not lost his style or his boyish looks, nor has he lost his perfect timing or his mellow voice with that laid-back Californian lilt. There is something comforting about Nicolas Cage in his role of Will Montgomery. As an antihero who is a thieving genius with a heart of gold, this is a role that Cage can play with his hands tied behind his back, but it is still a lot of fun to watch him at work. Cage's Will Montgomery makes it clear that robbing banks is simply something he does because he can earn a living while he uses his criminal brilliance to outsmart the system. But he refuses to kill or hurt anyone. This gets him in trouble with his closest associate who wants to shoot a witness at the scene of the crime. “We're not killers,” says Will Montgomery as he drags his comrade away by force. The movie has typical superhero-type problems with realism, as Will tracks down a vengeful madman who has abducted his daughter, but the script does make an attempt to give logical explanations for the action. Although Will Montgomery has his own bizarre form of ethics, in his chase scenes he causes so many car accidents that it is a stretch to think he never hurt anyone. But he never turns a gun on any innocent party, and his primary role is that of father. In his own weird way, Will is just trying to support his family. Will is the nemesis of FBI agent Tim Harlend, played by Danny Huston. The chemistry between these two foes is perfect as they develop a grudging respect for each other. Malin Akerman is the smart and feisty Riley who emerges as Will's love interest. (There is a strange cell phone conversation where the two slip into Swedish to avoid detection. No explanation is offered for this detail, except it turns out that Akerman has Swedish roots in real life.) And Josh Lucas does a great job as the crazed Vincent, a good thief gone rogue. The film holds your interest and is highly entertaining, although there are a few places that may cause viewers to groan a bit. However, it is refreshing to see a violent action film where violence is abhorred by the bad guy himself. The contradictions that arise from this antithetical position make Nicolas Cage's character a lot more interesting than he might have been otherwise.",
      "total_reactions": 0,
      "user": "ClariseSamuels"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "Typical Nicolas Cage movie but with Cage toned down a bit from his normal eccentric self. The cast and entertainment value was decent but the characters were all pretty empty and the plot was predictable. Malin Akerman's role, though small, was a nice surprise. I didn't know going in that she was actually in the film at all but I'm a big fan. Sami Gayle was a decent young actress also. Most child actors hold back movies but she actually carried her weight. She also looks alarmingly similar to Angelina Jolie when she first started as a little girl. Overall, not a bad movie and one that was pretty enjoyable but nothing special.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "Whenever I see Nicolas Cage's name on a movie poster, I know that no matter the film, I'm going to see a great performance. While Cage has done every conceivable genre, he is of course best know for his action films. In Stolen, Cage once again teams with his Director from Con Air, Simon West, to give us another exciting thriller. Cage plays Will Montgomery, a career criminal who has just spent eight years in prison. Montgomery comes out wanting to start a new life, but that's put on hold when he learns that a former enemy has kidnapped his daughter and is holding her for ransom. I guess no one has ever told Nicolas Cage that you're supposed to slow down with age, because he is just as good in this movie as he is in all his other films. Cage, notorious for performing his own stunts, does some amazing things in this film and is of course pure intensity. In this film he's paired with Josh Lucas who was in a film by the same title in 2009, not to be confused with that movie, Lucas plays Montgomery's partner in crime and throughout this film you can see him and Cage feed off of one another, too me, that was the best part. Lets be honest here, rarely do action films have a decent story to distinguish themselves from one another. Stolen is no different, a daughter in peril, held by a weird foul mouthed bad guy, who is being chased by a want to be hero with a less than stellar reputation, you've seen this dozens of times.  What makes Stolen stand out from those other films is the cast, it's as simple as that. The cast really keeps you interested, even when the movie gets to be predictable and even when the stunts are impossible, the cast keep bringing you back to the edge of your seat, with their great performances and extreme intensity. For that reason, even though this is a familiar and predictable film, Stolen stood out from all the other action films I've seen lately.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "Honestly, I thought it was a pretty enjoyable movie. It kept me interested from start to finish and was rather entertaining at times. The plot was very generic but then again so is every plot to every action film so I didn't mind. The acting was ok but what saved it wasn't Cage but the several B list actors on the cast. I agree with Extrafizz, while the film does everything at a solid overall level, It doesn't really do anything good. There isn't a single aspect of the film that really sticks out but I still enjoyed watching it and would recommend it.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2012
      },
      "score": 4,
      "text": "Stolen is derivative of so many other films: Brake, Taken to name a recent few and there's no new ground broken here. Josh Lucas, a classy actor, is poorly cast-against-type as the derelict, revenge-seeking brother. And there are so many ridiculous implausibilities that make you wonder \"why do I not hit the Stop button already?\" And the ending, jeez, I expected alot better from director Simon West.",
      "total_reactions": 0,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "A score of 5 is pretty generous. Honestly, Cage has become a caricature of himself. The plot is weak, the characters shallow and poorly developed. I will admit a few adrenaline rushes, but gunfire and car chases are tense. The tension was formulaic and not unique to Stolen. By the way, Stolen?! Terrible title. My favorite part was the soundtrack. It was so utterly campy that it became my favorite element. B score for a B movie. I saw it for free on XBOX Live so I have no regrets, but pay more than a few dollars for this one and you certainly will.",
      "total_reactions": 0,
      "user": "MalFet1999"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "Don't bother with this mediocre crap. It unsurprisingly only made 2m$ at the theatres worldwide, but it should have been a direct-to-DVD release. The story is laughable and high unrealistic and the characters are bland and uninteresting. Even at 92 mins it seems too long for this ultra-thin script. My advice: avoid even when there's nothing else to see!",
      "total_reactions": 0,
      "user": "Apemonkey666"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2015
      },
      "score": 9,
      "text": "Simon West o diretor The Flash,em 2011 faz The Mechanic (2011) e no ano seguinte o incrível The Expendables 2 (2012) e esse excelente suspense de ação Stolen (2012)...",
      "total_reactions": 0,
      "user": "LoRevisor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2014
      },
      "score": 2,
      "text": "Many reasons not to like it. Cage doesn't fit the role in a story that is predictable and houses no characters of interest. The film even struggles to consistently entertain, it feels like a dull Taken copycat that lacks the brilliant original concept and the ground-breaking quotes. I never felt bothered about the outcome nor did I ever feel my pulse raising. Whatever you look for in a film, I doubt Stolen has it.",
      "total_reactions": 0,
      "user": "callumjsouth"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Well, Vincent has became my new favourite villain :D Lucas has created the true-born bad character. Cliffhanger, but I can't rate it above 7, cause of inadequancy of plot. Sooo many unbelievable turns of action are too much for me.",
      "total_reactions": 0,
      "user": "najlepsza"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "me parecio una pelicula genial muy detallista y original en muchas cosas, la trama puede ser clasica pero la forma en que se desarolla es casi unica, me parece que todo fue muy real y con el tiempo justo para probocar el efecto deseado, aunque el final deberia ser mas oscuro pero muy atrapante le doy un 8",
      "total_reactions": 0,
      "user": "sombrassolidas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 1,
      "text": "\"Stolen\" 10 Scale Rating: 1.5 (Awful) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2015
      },
      "score": 9,
      "text": "Simon West year of 2012's he made two Masterpieces Stolen and The Expendables 2...  WTHell does this movie didn't opening in large scale this is a minimium of 2,000 theaters... Because i know that this film flop in box office...",
      "total_reactions": 0,
      "user": "Zanessa250QI"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2015
      },
      "score": 9,
      "text": "Ninja    Simon West    Ninja  last year one movie The Mechanic (2011) this year 2 movies holy **** Stolen (2012) and the amazing The Expendables 2 (2012)    Both 3 are great movies.",
      "total_reactions": 0,
      "user": "sicrano"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "Every scene is breath taking and full of suspense and thriller. I love watching this movie.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "Pretty good movie. It's like an action thriller, mixed with a bank heist movie.",
      "total_reactions": 0,
      "user": "jelenabiebs31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2016
      },
      "score": 9,
      "text": "...............................................................................................................................................Very Good, Movie...",
      "total_reactions": 0,
      "user": "clinteastwoo"
    }
  ]
}