{
  "avg_user_score": 5.2,
  "metascore": 25,
  "mixed_rating_frequency": 11,
  "movie_name": "Strange Magic",
  "negative_rating_frequency": 25,
  "positive_rating_frequency": 27,
  "pro_critic_reviews": [
    {
      "critic": "Jesse Hassenger",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2015
      },
      "score": 67,
      "summary": "Strange Magic, an animated film from Lucasfilm and Industrial Light & Magic, borrows its sensibility from another movie from the summer of 2001: \"Moulin Rouge.\" The new film’s composer and music director, Marius De Vries, even arranged songs for Baz Luhrmann’s phantasmagorical musical."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2015
      },
      "score": 67,
      "summary": "Strange Magic is messy and uneven and occasionally annoying, but it also dares to be different."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2015
      },
      "score": 50,
      "summary": "Strange Magic is strange all right, but hardly magical."
    },
    {
      "critic": "Helen O'Hara",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2015
      },
      "score": 40,
      "summary": "While there are fun moments, the whole is an odd mix of grotesquerie and cutesiness."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2015
      },
      "score": 40,
      "summary": "The problem with Strange Magic isn’t so much its derivative story as it is the odd, half-complete way it unfolds. You can sense the weird mixture of tones, influences, ideas — as if the whole thing were still in its planning stages."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2015
      },
      "score": 40,
      "summary": "At once disarming and calculated, Strange Magic is a film of commodified feelings, evoking memories of other experiences — whether of Shakespeare, the original songs or authentic enchantment."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2015
      },
      "score": 38,
      "summary": "If you close your eyes you’d think it was a commercial for a “Great Love Songs” DVD collection."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2015
      },
      "score": 38,
      "summary": "A cartoon fantasy cooked up from a half-baked idea from George Lucas."
    },
    {
      "critic": "Glenn Kenny",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2015
      },
      "score": 38,
      "summary": "Strange Magic is essentially a jukebox musical so song-laden as to practically be an operetta, and the songs are so eclectic that they never quite fit into the movie’s flying-insect world, which is divided into dark and light forests."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2015
      },
      "score": 30,
      "summary": "Strange Magic certainly isn’t an ordinary sort of mess, and the personal nature of the project is still evident in the finished film."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2015
      },
      "score": 30,
      "summary": "The look of the animation has limited charm. The story is primarily a string of life lessons for little ones, impossible to miss. And there is a great deal of singing. I don't think even fools will fall in love with Strange Magic."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2015
      },
      "score": 25,
      "summary": "I don't think Strange Magic is terrible movie, but it is a very weird one in many ways, and perhaps the most bizarre thing about it is realizing that we finally have a fairy tale written expressly for the age of date rape drugs."
    },
    {
      "critic": "Michael Ordona",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2015
      },
      "score": 25,
      "summary": "The plot movement feels very much like an unpleasant formality, shoved forward by tiresome devices."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2015
      },
      "score": 25,
      "summary": "A jaw-droppingly terrible animated musical that mismatches George Lucas’ inane story about a pair of fairy princesses to an oddball selection of the “Star Wars’’ creator’s favorite pop tunes."
    },
    {
      "critic": "Steve Davis",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2015
      },
      "score": 20,
      "summary": "It’s like watching a cartoon version of American Idol on an endless karaoke loop."
    },
    {
      "critic": "Graham Fuller ",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2015
      },
      "score": 20,
      "summary": "The eerie wood was exquisitely designed. Disastrously, what goes on there suggests a Californian mall during spring break."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2015
      },
      "score": 20,
      "summary": "A thoroughly derivative and unengaging fantasy."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2015
      },
      "score": 12,
      "summary": "As juvenile and frivolous a wish-fulfillment fantasy as one might expect from the visionary behind the lightsaber and Princess Leia hogtied to Jabba the Hut, Strange Magic depicts war as a series of scarcely muddied binary oppositions: between good and evil, the beautiful and the ugly, and singing and death by karaoke."
    },
    {
      "critic": "Michael Rechtshaffen",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "summary": "A shrill, garish hodgepodge of familiar elements from other animated vehicles (most evidently 2013’s Epic), there’s virtually nothing about this forced, fractured fairy tale that feels remotely fresh or involving."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "summary": "Terrible character design, combined with a painful lack of laughs and a crushing plethora of ghastly songs, makes Strange Magic perhaps the worst animated feature ever to come out of Disney (which might explain why the studio is releasing the film under its now-rarely-used Touchstone label). Compared to other Lucas missteps of recent years, it’ll make you nostalgic for Jar Jar Binks."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "It's so dense, every single image has so many things going on, although it's a little bit disjointed.",
      "total_reactions": 2,
      "user": "GamerMagazine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 2,
      "text": "Strange Magic is why people think animation is for kids. Between the ear-bleeding songs every few minutes, the unclear stakes, and lack of characters parents will have to grin and bear this one. Despite Lucasfilm pushing the boundaries in computer animation with Industrial Light and Magic this film doesn’t have anything groundbreaking. Lucasfilm has done some enjoyable animation on television with two Star Wars shows making it baffling that their work on film is not worth watching. Much like the love potion in this film you will quickly ignore this lovefest in favor of other more superior films.",
      "total_reactions": 1,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "I don't understand why people are being so hard on this one. I enjoyed it. It's different. When do you ever see someone fall in love with someone ugly in movies--and they don't get a makeover? The choice of songs is really good, too. And it's main asset is definitely that it's gorgeous to look at. Sure, the middle portion is really weak and the movie feels a little long all together, but a 25 critics' concensus? Come on!",
      "total_reactions": 1,
      "user": "TheNikus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "George Lucas has stated that he made this film with 12 year old girls as the target audience. Ignore the people who state it's too simple or what have you. The character design is an improvement in diversity compared to other films (characters of colour, different looking females, faeries of variety, etc.) and there are multiple good messages embed in the movie. The main theme was romance, but the main female protagonist gets stronger without a romantic interest, saying you don't need romantic love to grow. And if your crush only likes you as a friend, you continue to be a good friend to them.",
      "total_reactions": 1,
      "user": "JustANewt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "This movie is beautiful, it brings a strong point to the minds of children and even adults, that you will see in few movies. Love can be found in the most unlikely places,and ways. The protagonist, it mainly attractive, and the fact that she fell for a not-so attractive character, brings a key message to the viewers, that everybody deserves love. This can be seen in few movies, and that George Lucas decided to carry this message forward is very beautiful.",
      "total_reactions": 1,
      "user": "DeaneAoun"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "Strange magic, in my opinion is a great film but I do understand that it has a very limited audience. Men will not enjoy this. I thought the film was moderately comedic  and certainly strange, there is a lot of singing. Although the plot line is fairly predictable, the film is very easy to get sucked into. 8/10 :)",
      "total_reactions": 1,
      "user": "Aquamarianna"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2015
      },
      "score": 1,
      "text": "George Lucas has developed some really interesting characters and woven some extremely entertaining stories during his lengthy career as a filmmaker.  Strange Magic has neither.  The characters are completely undeveloped and bland.  The two fairy sisters, even though they look different, might as well have been the same.  One is blond and one a brunette.  One is really angry and heartbroken, the other is the \"flirty sister.\" Of course, the only reason we know this difference is because they make it a point to tell us that.  \"I need you to help me look after your flirty sister...\" said one character to the other sister.  \"Oh, she's the flirty sister, that's the difference\" I remember thinking to myself.  I can't for the life of me remember what the actual plot of the movie was, and I literally took my kids to see this movie about 3 hours ago.  It was bright and colorful, there were fairies and lots of songs, but the story was so bland that it couldn't even hold my kids' attention for the duration.  My youngest, who's three, took it upon herself to climb out of her booster seat and throw it down the next row in the theater out of boredom.  I really didn't think George Lucas could sink any lower than Jar Jar Banks or the forgettable story from Kingdom of the Crystal Skull, but this movie proved me wrong.  Of course, it was so forgettable it may not matter, as I've been referring to it as \"Strange Music\" all day.  By tomorrow, I might just be trying to remember what I did this afternoon, with no real answer.  I really hope I am that lucky.",
      "total_reactions": 6,
      "user": "rmklingler"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "While Frozen was centered on a story about sisterhood, this is my kind of musical animation and my family loved it.  This offers much more and focuses on the ideal that love is found where you least expect.  The beauty of this musical is skin deep, and many will not see it (Critics) and realize how good this movie really is.  The CGI animation is top notch and unmatched, and what else would you expect from a Lucasfilm production.  The soundtrack amazing and the musical numbers were well executed. I truly wonder who funds these critics and if they saw the same movie.  Go see it for yourself and you'll agree it's one of the better animated features to come out in some time!",
      "total_reactions": 6,
      "user": "paintballzr"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "Fresh, beautifully look at, unashamed fun and very original! This is a musical, but the songs are well woven into the story so it doesn't feel like random interludes.. This movie is a great excuse to escape for an hour or so, have some fun and maybe remember not to take life so seriously. The characters are all true to themselves and live in believable worlds, but don't have much to worry about... What sets this movie apart for the adults is the depth the characters' emotions go to. Not seen this so well portrayed in an animated film before. They are really acting! Love it or hate it, the experience is worth having. Just remember this is entertainment and enjoy the ride!",
      "total_reactions": 7,
      "user": "Woodywoodster"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "Strange Magic..what an oddball film. It's clear this movie is aimed squarely at tween girls, but with such amazing visuals I really had to give it a chance.  The first act is a sappy setup for the rest of the film, and it wasn't long before I was wondering why I bothered.  But then something \"strange\" happened.  I stopped wondering why all the kids in the theater were giggling and laughing and just gave in to the musical.  And then it hit me.  Duh!  It's a _musical_!",
      "total_reactions": 4,
      "user": "Agent314"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2015
      },
      "score": 0,
      "text": "The plot is hackneyed, the songs are unlistenable cover versions of old overplayed radio hits, the characters are almost universally annoying. The animation, however, is gorgeous. Kids will probably adore it.",
      "total_reactions": 2,
      "user": "bibliaddict"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "The best movie of the year so far is Strange Magic! It's like a mix of A Mid-summer Night's Dream, Moulin Rouge, Willow, Frozen, and Beauty and the Beast. It has a great story and fantastic characters. It's funny and has fabulous music. It has beautiful animation, terrific female characters, and features some really nice voice acting. What's not to love!",
      "total_reactions": 14,
      "user": "Garr"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "Strange Magic works as a harmless animated fest. But nothing else. Hollow story doesnt make up for the brilliant characters and okay voice acting. Give it a watch with your kids, for deep characters and great CGI, but everything else is hollow and boring.",
      "total_reactions": 4,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2015
      },
      "score": 2,
      "text": "If you've ever seen the movie Enchanted, this is the kind of movie they were making fun of. I was confused about the plot of this movie when I watched the trailers, and now that I've actually seen the movie, I still don't know what it's about. From what I gathered, Strange Magic has to do with these two sisters/lesbians?, some love potion that causes you to sing a lot, and a troll king. If there's any semblance of a coherent plot, it went way over my head. There seemed to be way too much going on at one time. The story cycle through three main characters at almost two minute intervals, and it got so aggravating that I just gave up trying to follow whatever was happening on screen. One thing I know for certain about Strange Magic is that it lives up to its title; it's strange. The background animation is about as good as you'd expect from a modern animated movie, but the character design is just unintentionally creepy. They look more like demented caricatures than cartoon characters. What makes this movie even more painful to watch is that a majority of the running time is dedicated to covering random pop and rock songs at the most unnecessary times. They cover just about everything: Lady Gaga, The Beatles, Beyonce, Whitney Houston, you name it. Strange Magic may provide a decent distraction for the youngest of moviegoers, but older viewers will just be annoyed by the ridiculous soundtrack and disturbing animation.",
      "total_reactions": 1,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2015
      },
      "score": 6,
      "text": "\"Strange Magic\" feels like George Lucas' attempt at recreating \"Frozen\" but it fails in nearly every aspect, though the songs are catchy and the animation is nice to look at, there's not much going on beneath the surface.",
      "total_reactions": 2,
      "user": "Parappafan1996"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "OK, what the **** have the critics been smoking? They must really have it in for George Lucas because this is to me the best American animated film of 2015 (and this year gave us Inside Out). I'm a guy and not even that big of a fan of musicals and I thought this film was beautiful, charming, uplifting, and funny (Bog's mom has some fantastic one-liners), with a good message to boot. It's an animated version of Moulin Rouge, and the way the characters go from talking to singing and back again is seamless and perfect. The characters' actions seem realistic and believable in this world and I loved how the filmmakers played with a sense of scale, where even a flower is a huge in their world. Again, I'm a straight adult male and I don't normally care about fairies but this film made full use of the concept. This is sure to be remembered as a cult classic down the line. One of my favorite childhood films was Beauty and the Beast and I can compare this favorably to that. If I ever have a daughter, this will be one of the films I show them.",
      "total_reactions": 0,
      "user": "samichsupernova"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2015
      },
      "score": 0,
      "text": "This movie is the **** movie I've ever seen.George Lucas has only made hate him more he needs to get on track and stop copying other movies. All of this is generic ****",
      "total_reactions": 0,
      "user": "Dezapplez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2016
      },
      "score": 2,
      "text": "\"George Lucas made this film because he wanted to make a fun movie and a musical.\" -- IMDb's Trivia",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "It's such a cute movie with lovable characters, good songs, action and best of all, Marianne and the Bog King is the cutest couple I've ever seen❤️",
      "total_reactions": 0,
      "user": "Luna_Blaze"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2016
      },
      "score": 10,
      "text": "I watched this movie and found that the characters and the story line very enjoyable. People of all ages should be able to enjoy this film IF they have an imagination!!  One of the finest of 2015!!",
      "total_reactions": 0,
      "user": "WiccanWoman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2016
      },
      "score": 10,
      "text": "I don't agree with the critics. This is a very entertaining movie. We've watched it on Comcast 6 times plus bought a copy. The characters are absolutely beautiful!! Listen to the dialogue, it's hilarious. The Sugar Plum Fairy is a scream! I guess \"The Critics\" just watch too many movies to appreciate it. Look at the difference in the ratings between critics & users. This is a fantastic piece of work by Mr Lucas.",
      "total_reactions": 0,
      "user": "Waveguide"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2016
      },
      "score": 4,
      "text": "Hallow, utterly formulaic and overflooded with pop musical numbers, Strange Magic lacks anything even remotely groundbreaking.",
      "total_reactions": 0,
      "user": "J2005"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2017
      },
      "score": 2,
      "text": "Strange Magic is why people think animation is for kids. Between the ear-bleeding songs every few minutes, the unclear stakes, and lack of characters parents will have to grin and bear this one. Despite Lucasfilm pushing the boundaries in computer animation with Industrial Light and Magic this film doesn’t have anything groundbreaking. Lucasfilm has done some enjoyable animation on television with two Star Wars shows making it baffling that their work on film is not worth watching. Much like the love potion in this film you will quickly ignore this lovefest in favor of other more superior films.",
      "total_reactions": 0,
      "user": "Creepers200"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2017
      },
      "score": 2,
      "text": "Strange Magic is why people think animation is for kids. Between the ear-bleeding songs every few minutes, the unclear stakes, and lack of characters parents will have to grin and bear this one. Despite Lucasfilm pushing the boundaries in computer animation with Industrial Light and Magic this film doesn’t have anything groundbreaking. Lucasfilm has done some enjoyable animation on television with two Star Wars shows making it baffling that their work on film is not worth watching. Much like the love potion in this film you will quickly ignore this lovefest in favor of other more superior films.",
      "total_reactions": 0,
      "user": "Enderman"
    }
  ]
}