{
  "mc_avg_user_score": 3.4,
  "mc_metascore": 17,
  "mc_mixed_rating_frequency": 11,
  "mc_movie_name": "Street Fighter: The Legend of Chun-Li",
  "mc_negative_rating_frequency": 76,
  "mc_positive_rating_frequency": 28,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2014
      },
      "score": 1,
      "text": "thanks Andrzej Bartkowiak and Justin Marks now no hollywood studio will ever take a chance on a street fighter movie again. after this movie i wouldn't blame them it is horrible easily up there with the worst video game adaptations. it's terribly acted, terribly shot, the action sequences are horrible and while some of the cast make some sense in theory (but not in practice) whoever cast Neal McDonough  as M. Bison really needs to rethink his line of work",
      "total_reactions": 1,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "Great film. It has ultimate action and a great supporting performance by Michael Clarke Duncan.",
      "total_reactions": 6,
      "user": "TheGeographer52"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "Not a terrible movie. It looks like they did try to stay a little loyal to the series, but unfortunately took a few too many liberties for it to be any good. Overall and OK movie that looks like it could have been more, but either due to a lack of funding or interest the studio mad a really average movie.",
      "total_reactions": 6,
      "user": "Rox22"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2011
      },
      "score": 0,
      "text": "wow they had to make another street fighter movieyou figured they would learn from the first movie i mean the story is all about chun li so why aint she chinese and the actress's outfit doesn't even resemble chun li's from the game and they couldnt even do her spinning bird kick right.",
      "total_reactions": 7,
      "user": "Jamyz"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "I can't believe that the score for these kind of movies is so low, I mean after i read all these comments, i wanted to give this movie a 6 or 7, because i thought maybe it was not that good as i watched it just 10 mins ago. But honestly, everyone is comparing movies against videogames here. In a game you mash all those buttons, make combo hits, fatalities to take down the enemy. The story is usually ignored and 4 out of 5 people doesn't care about story in a game. In movie i want to know about the characters, their origins. If you put a 90 minute long fighting scene in a movie, there will be no difference between a game and a movie. I think this movie was pretty cool and exciting and the reason that many people disliked this was that they want to see meaningless fighting scenes, 10 punches + 3 kicks per second... I am a nerd too, I like marvel, dc, mortal kombat (not so much of a Street Fighter fan actually i always find that game rather dull) but honestly i want to see a background for characters in movies; not a 90 minute full with brawling and gun shooting. The only reason that i gave 9 instead of 10 was that interpol officers kinda stood outside of movie and couldn't participate that much. They should were either totally removed or used more often in film. I strongly suggest this movie to all of you who are interestedâ",
      "total_reactions": 10,
      "user": "julian_zizzle"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2011
      },
      "score": 2,
      "text": "\"Street Fighter: The Legend of Chun-Li\" is a sub-par video game adaptation. The story is there, but very poorly put together and occasionally nonsensical. You'd think that that would be alright as long as the action sequences are good, right? Well, no. The action is terribly dull. McDonough is miscast - the antagonist he plays was not at all as menacing as he should have been. An utterly forgettable action film.",
      "total_reactions": 6,
      "user": "Will"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2012
      },
      "score": 3,
      "text": "What can I say",
      "total_reactions": 4,
      "user": "OverdueReview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2015
      },
      "score": 2,
      "text": "I would say that the original Street Fighter was way better than the unforgivable but unnecessary prequel because straight up, Chun-li should have her own video game movie in real life or my favorite, anime style (Street Fighter II: The Animated Movie). Who exactly in their right minds chose a fan-favorite hottie from Smallville and the late \"Big Teddy\" Oscar-nominee Michael Clarke Duncan in the first place? Chris Klein sucked in this piece of trash. He should've taken the page out of the Dane Cook \"I'm a serious comedian\" playbook. But in my retrospect, Ming-Na Wen was the better Chun-li in the original Street Fighter. We laughed on this horrible offensive video game movie before, but I should just cut it some slack. It's still an awesome crap movie. But \"The Legend of Chun-Li?\" Meh.",
      "total_reactions": 0,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2014
      },
      "score": 3,
      "text": "Why is this kind of bad not funny?",
      "total_reactions": 0,
      "user": "Inlikeflynn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2016
      },
      "score": 1,
      "text": "Oh well, I knew there'd always be a time where I can always fight Chun-Li again one day. Nope.... not kidding. I actually want to fight her for real. Come out to play wherever you are.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "The story was good, and it's awesome to see Kristin Kreuk play such a strong character and step out of the shadow of Lana Lang.",
      "total_reactions": 0,
      "user": "jelenabiebs31"
    }
  ]
}