{
  "mc_avg_user_score": 6.6,
  "mc_metascore": 41,
  "mc_mixed_rating_frequency": 3,
  "mc_movie_name": "Struck by Lightning",
  "mc_negative_rating_frequency": 4,
  "mc_positive_rating_frequency": 11,
  "mc_pro_critic_reviews": [
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2013
      },
      "score": 67,
      "summary": "Struck by Lightning sticks to generic character sketches of high school student types - the jock, the goth, the cheerleader, etc. - and gives Carson the best lines. In between, some charming, buzzy talents pitch in on this short little lark."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2013
      },
      "score": 60,
      "summary": "While the good outweigh the bad, it's a close race. But what is good, particularly a heartbreaking performance by Allison Janney, is really good, enough so that Colfer emerges as a talent worth watching on the page, not just on the screen."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2013
      },
      "score": 58,
      "summary": "Lightning is a funny, fast-moving movie, packed with barbed one-liners, goofy hyperbole, and all the oversized exasperation of teen angst. But it's too acid, particularly where Colfer is concerned."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "There's also a refreshing lack of wrapping everything up in a neat, happy bow at the end."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "Genial and heartfelt but essentially toothless, lacking in either snark or spark."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "In his screenwriting debut, Glee's gifted Chris Colfer, 22, proves he can lace a line with sass and soul. The downside of Struck by Lightning, besides the fact that Colfer's character, Carson Phillips, is struck dead in the first scene, is that Colfer hands himself all the best lines."
    },
    {
      "critic": "Brian Miller",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "Struck by Lightning means well, but its gentle dissection of high school cliques brings nothing new to the genre, except the fact that being out isn't the problem for the hero, Carson (Colfer)."
    },
    {
      "critic": "Amanda Mae Meyncke",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2013
      },
      "score": 42,
      "summary": "Struck by Lightning may appeal to fans of Colfer’s work on “Glee,” but as a film it’s utterly lacking in scope, depth or meaning beyond an immediate chuckle or two."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2013
      },
      "score": 40,
      "summary": "Except for Ms. Janney's monstrous mother and an Alzheimer's-afflicted grandmother (Polly Bergen), Struck by Lightning gives its characters no dimension."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2013
      },
      "score": 40,
      "summary": "One can't blame Colfer for wanting to expand his range, but he's created a character who is neither hero nor villain, in a black comedy that is neither dark nor funny enough."
    },
    {
      "critic": "David Fear",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2013
      },
      "score": 20,
      "summary": "Then observe as all but the hard-core Colferphiles slink out embarrassed, feeling as confused and discombobulated as if they too just took an electric bolt to the brain."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "summary": "A class-five pity party so unbearably condescending and unconvincing that it might just make you run out and buy an \"I'm With Mitt\" t-shirt, it makes an inadvertent but hugely compelling pro-bullying argument."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "A strange sort of film. A smart, left-of-centre high school story like Detention, which, although not without it's own faults, was actually entertaining throughout. Instead, here we get earnestness, moralising and a quite underwhelming story with a surprisingly generous handful of cruel twists. Allison Janney is wonderful in quite a meaty role, and Rebel Wilson and Angela Kinsey add much needed spark and humour. I find it odd however that Chris Colfer would write himself a mostly unlikable role; pompous, arrogant, and dismissive of what he could learn from others. Is he supposed to be the hero? By the end, all I could muster was, \"really?\".",
      "total_reactions": 1,
      "user": "wiggipop"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "You can't help but like Chris Colfer as Carson Phillips. Great supporting cast. Kind of a dark theme, but it works. Very enjoyable. Saw it with my teenage daughter and she was nuts about the movie, she can't wait to get the DVD.",
      "total_reactions": 1,
      "user": "Venergroup"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "I loved this movie. Great acting, great screenplay. This is Chris' first screenplay, and the wittiness and flow of the movie really surprised me.  Everything was well thought out and entertaining. He is a pro already. I can't wait to see what he has in store for the years to come! Also, having Rebel Wilson in any movie makes it worth watching!",
      "total_reactions": 1,
      "user": "beatleslove"
    }
  ]
}