{
  "mc_avg_user_score": 8.1,
  "mc_metascore": 50,
  "mc_mixed_rating_frequency": 32,
  "mc_movie_name": "Super",
  "mc_negative_rating_frequency": 10,
  "mc_positive_rating_frequency": 142,
  "mc_pro_critic_reviews": [
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "The libido and bloodlust flowing from the pint-size Page is the funniest thing in the movie, but elsewhere, the mix of the goofy and ghastly is hard to digest."
    },
    {
      "critic": "M. E. Russell",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "I suspect audiences will divide sharply on the movie's wild tone shifts. I found them sort of fearless."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2011
      },
      "score": 75,
      "summary": "Super exists in the no-man's land between indie quirk and raw exploitation, and when it works, it's thrillingly off-balance."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2011
      },
      "score": 75,
      "summary": "Smart, sick, and subversive, Super gives you what you want only to make you wonder why you want it."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2011
      },
      "score": 75,
      "summary": "It's really a one-joke movie, but the joke is a good one."
    },
    {
      "critic": "Nathan Heller",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2011
      },
      "score": 70,
      "summary": "As a movie, Super is unfocused and bafflingly inconsistent. It is also the most genuinely surprising new release I've seen in a long time."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2011
      },
      "score": 70,
      "summary": "Super is occasionally brilliant, sometimes awful and terribly confusing overall."
    },
    {
      "critic": "Michael Rechtshaffen",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2011
      },
      "score": 70,
      "summary": "A giddily over-the-top, super-entertaining goof on the Everyman crimefighter flick written and directed with evident relish by James Gunn."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2011
      },
      "score": 63,
      "summary": "Despite the derivative nature and low production values of Super, there are laughs in the at-times ragged script."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2011
      },
      "score": 63,
      "summary": "Wilson does amusingly steely work, while Page goes bonkers, giving her gleeful nut job one of the more memorable horselaughs in recent American film history."
    },
    {
      "critic": "Simon Kinnear",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 60,
      "summary": "It’s too raw and difficult for one target audience, but the erratic tone might leave sick puppies equally nonplussed. Gunn’s jibes at Bible-bashers and gun-nuts are as blunt as Frank’s attacks, and the clash of kooky comedy and violence is as awkward as it is ugly."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2011
      },
      "score": 60,
      "summary": "Super rides on the carefully bent performances of its stars."
    },
    {
      "critic": "Karina Longworth",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2011
      },
      "score": 60,
      "summary": "Gunn successfully shifts between celebrating violence and mourning it, but his handling of emotional evolution is clumsier; he seems particularly out of his depth in the film's mawkish ending. But Page is a revelation: There isn't another gorgeous twentysomething actress working today who could more convincingly reveal sexual bravado to be simultaneously silly and creepy."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "Take \"Kick-Ass.\" Strip it of most of its wit and charm, amp up the violence, the sadism. Make it more crude and coarse and gory. And what you're left with is Super."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "Shot on the cheap, with cheesy animated credits and comic-panel \"Bams!\" and \"Pows!\" splashed across the screen, Super has a jokey, low-rent quality (or lack of quality) that could be endearing, if Wilson's performance weren't so nihilistically dull, and if there were somebody in the picture who had a soul."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "I'm all for movies that create unease, but I prefer them to appear to know why they're doing that. Super is a film ending in narrative anarchy, exercising a destructive impulse to no greater purpose than to mess with us."
    },
    {
      "critic": "Walter Addiego",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2011
      },
      "score": 50,
      "summary": "Wilson is basically playing an even more feckless version of his \"Office\" character, Dwight, another intense and self-deluded doofus. It's a character that works better in smaller doses."
    },
    {
      "critic": "Elvis Mitchell",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2011
      },
      "score": 50,
      "summary": "Ultimately the movie ridicules the culture that compels what Cedric the Entertainer calls grown-ass men to dress up like comic-book characters, as well as the Christian attempts to co-opt that culture."
    },
    {
      "critic": "Mark Keizer",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2011
      },
      "score": 50,
      "summary": "This depraved charmer offers enough to admire and a specialized hipster crowd will enjoy it, if to a mutedly positive effect."
    },
    {
      "critic": "Rob Nelson",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2011
      },
      "score": 50,
      "summary": "Waiting for Super to deliver the funny is an experience as long as the film itself."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2011
      },
      "score": 40,
      "summary": "Super starts off feeling like a cult comedy you might catch during a midnight film festival. But since Gunn never nails his tone, the concept makes more sense than the execution."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2011
      },
      "score": 40,
      "summary": "Where Gunn's last feature \"Slither\" was an enjoyably icky, funny riff on schlocky horror tropes, the split-personality Super merely repels with half-baked ideas, Wilson's and Page's scorched-earth overacting and atonal bursts of jokey gore."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2011
      },
      "score": 38,
      "summary": "A spoof of you-know-what that's a lot less funny than it sounds."
    },
    {
      "critic": "Andrea Gronvall",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2011
      },
      "score": 30,
      "summary": "This movie is too pedestrian for camp, and too scattershot for an action comedy."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 20,
      "summary": "There are kernels here of a thoughtful and provocative picture, but they never pop – or POP!, for that matter."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2011
      },
      "score": 20,
      "summary": "Skip this one, even if your hipster significant other whines a blue streak."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "\"YOU DON'T BUTT IN LINE!\"",
      "total_reactions": 2,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "This movie was awesome mix of drama and insanity. +10from movie. Really enjoyed it.  The acting was very well done and effects. This movie ads a new meaning to realism. One of the best 2011 movies so far.",
      "total_reactions": 1,
      "user": "sYs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "This movie honestly surprised me. I went in expecting a quirky and fun nerd movie in the vein of Scott Pilgrim vs. The World, which is exactly the opposite of what I got until it wasn't, at which point it was exactly what I got, until it wasn't that either. Perhaps that requires some clarification. Keeping it spoiler free, this movie starts off as a mixture of bleakly depressing and ball-twistingly awkward, but at the same time somewhat endearing for all that, before a somewhat drastic change of pace with an intentionally amateurish title animation set to Green Day-style 90s grunge. After the intro it wallows in pity for a little bit longer before buckling down and being legitimately funny and clever while still keeping up the incredibly awkward subtext. This culminates when our hero decides that his weapon of choice shall be a pipe wrench, graphically beating people in a short montage which seems for all the world as if it's being played for laughs, and which ends with him dropping a cinderblock on a criminal's head from a fire escape. However, shortly afterward there's a complete tonal inversion as it goes from quirky and lovable to serious and almost frightening within the space of a few minutes, and suddenly it seems as if that little comedic montage was not as funny as it first appeared. From that point forward the movie flits back and forth between gritty horrific delivery of its message, somewhat humorous stylization, and some honestly disturbingly psychotic moments that I honestly don't know if I was frightened or amused by. The movie really gets serious right near the end, when it simultaneously has a moderately impressive action scene, delivers a cuttingly real portrayal of what would actually happen if random people decided to be vigilantes, takes a hard look at morality and fanaticism while cashing in on the allegories to organized religion that have played a small part throughout the movie, and still manages to be somewhat funny at times throughout all of this. The ending feels simultaneously satisfying and like an absolute tease. All in all this movie has a lot more to it than I bargained for, and while I'm sure more than one of you will interpret everything I've said as the movie just seeming schizophrenic, I honestly think it melds together quite expertly in a way which is near impossible to explain. It's certainly worth a watch, because while I can't say with any certainty that you'll like it, I can say that you'll never see anything else like this movie and it deserves a view simply because of how astoundingly unique and intriguing it is.",
      "total_reactions": 1,
      "user": "Nilkad_Naquada"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Move over Batman... There is a new super hero in town, and he is ready to bash his way through the skulls of injustice with his pipe wrench of truth! James Gunn returns with another explosive cult-comedy starring Rainn Wilson as The Crimson Bolt, a self-made super hero that takes up crime-fighting after a seedy drug dealer makes off with his wife. Together with the help of his trusty side-kick, Boltie, they will squash evil in all of its many forms! In a James Gunn film, that includes beating people senseless over minor indiscretions like butting in line and keying cars, naturally. Gunn pulls no punches when it comes to crass, irreverent humor and exploitative violence, taking each to their veritable extremes while hiding behind the guise of a super hero film. Dig deep enough, and there are many powerful themes at work that speak directly towards the concept of the vigilante super hero and the essence of right and wrong. Rainn Wilson embodies the role of our deranged hero perfectly, providing an equal balance of sad ineptitude with never-ending hope and courage. Ellen Page's foul-mouthed Boltie adds an entertaining mix as well, when she is not taking the role too far over the top. As a wry wink to the super hero genre, SUPER cannot be beat!",
      "total_reactions": 1,
      "user": "ILHM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Super succeeds as much as it fails in many areas. The film is not by any means close to perfect, nor is this a feel good hit of the summer. Some have argued that it fails at being :\"funny\" and that the entertainment values are lacking. I would argue that the film succeeds in what it set out to complete. Rainn Wilson plays a similar role to what we have seen him act before, but with some darker twists. Depending on how you view the movie, you might be disappointed at the odd conclusion or in some ways mesmerized by way Wilson develops during the course of the movie.",
      "total_reactions": 1,
      "user": "RabidPuma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "To clear up all the report's all those people who are saying He's ripping off \"Kick-Ass\", Here's the explanation.",
      "total_reactions": 1,
      "user": "George-roots"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "I am so glad movies like this get made.   I really relate to it.    Funny, its honest, and the ending leaves you sad, but happy.    It would be a disservice to give away plot points.  Because it does not follow the typical Holly Wood droll",
      "total_reactions": 8,
      "user": "13years"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "I can't beleive its got such a bad score on here I thought it was brilliant. So dark and sad but constant between the lines humour all the way through!  Very clever film, much deeper than it appears.",
      "total_reactions": 4,
      "user": "Doyouvoodoo"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2011
      },
      "score": 4,
      "text": "The film is warped. It had the makings of some absurd fun, and it is fun at points, but the pacing just sucks, and the thread that pulls the whole thing together is far too kinky.  The Ellen Page bits are by far the best parts of the movie. The violence, incidentally, is surprisingly graphic for a movie like this. Why so many big name actors signed on to this sucker is beyond me - maybe they're all friends of the creative team.  I wouldn't bother.",
      "total_reactions": 10,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "Super is a niche film that will only appeal to a certain group of people. Super will be and is compared to Kick Ass a lot, but it is not trying to be Kick Ass.  This film is a dark comedy at heart and keeps to it; Super is far less over the top and is filled with a lot of insane fun for you but not the family.",
      "total_reactions": 3,
      "user": "bkd72"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "For me, this was easily the best movie of the year.  It's certainly a visceral experience.  The characters a mentally disturbed and they are meant to disturb you.  The movie gets you to laugh at violence that will disturb you.  If catching yourself laughing at that kind of thing makes you a sad panda, you won't be happy with this film.  If you are the kind of person who would go to this movie with the kiddos after your PTA meeting, you won't be happy with this film.  If you are someone who is offbeat with a dark side, but still fun, you too will love this film.",
      "total_reactions": 2,
      "user": "FlatBlack"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 3,
      "text": "You can't really call this film a \"Black Comedy\" as that implies that its funny. This movie is similar to the likes of \"Kickass\" and \"Observe and Report\", but as shocking as they were, they were also funny. This isn't. You'd swear was Lars Von Trier asked to help write this.",
      "total_reactions": 3,
      "user": "DelTorro"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 1,
      "text": "Best summed up by a reviewer in Variety who said \"Waiting for Super to deliver the funny is an experience as long as the film itself. \"  Take a pass on this one.",
      "total_reactions": 11,
      "user": "MorriBey"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2011
      },
      "score": 0,
      "text": "This movie is a pointless immoral gory bloodbath. It's homicide porn at best. All the characters are insane losers that no sane person can relate to. DO NO WASTE YOUR TIME BY SUPPORTING this liberal garbage.",
      "total_reactions": 12,
      "user": "killingspree"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "For me, the star of the show was Ellen Page; she brought such enthusiasm to the role and I have to say, she was also pretty funny. To be honest, given the quality of the rest of the cast I ended up a little disappointed, I expected more somehow. Don",
      "total_reactions": 1,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2011
      },
      "score": 0,
      "text": "Completely awful, calling this a bad movie is too much of a compliment, I've seen bad movies before but this  is the worst movie I've ever seen, it has no redeeming features at all, none of the characters are likable, it's not funny, and just a humongous waste of every ones time, honestly I came into this movie thinking I was going to love it because I love movies like Kick-Ass and Defendor where a regular guy just says he's had enough and becomes a super hero and this one was going to be a comedy also so I really was expecting to enjoy it, but as  you can see I was extremely disappointed, I literally cannot begin to describe how awful this movie is, I seriously have no words other than this is literally the worst movie ever created, so do yourself and others a favor if you see a copy of this movie anywhere snap the disc in half, I believe the Crimson Bolt said it best when he said \"how can something so stupid and idiotic exist?\".",
      "total_reactions": 6,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2012
      },
      "score": 0,
      "text": "I would not recommend anyone I care about to see this movie. It is not at all like Kickass, and there are very few funny parts. I felt terrible after finishing the movie, as the film in its entirety had a depressing funk that viewers think will be lifted at the end, but it is not. The dialogue is awful, and the language and eapecially graphic violence are all far over the top to the point where it isn't even funny, just shocking they would allow it to be in a movie rated R. This is definitely the darkest movie I've ever seen, darker than Worlds best Dad or Donnie Darko. The conclusion left me wishing I had never started the movie in the first place. Please don't see it.",
      "total_reactions": 3,
      "user": "explodr"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2011
      },
      "score": 5,
      "text": "This film was pretty insane. The story is pretty similar to Kick-Ass, the nerdy guy who tries to be a superhero with no powers. Super is a little more violent than Kick-Ass, but it lacks a lot of charm.  Rainn Wilson was pretty good as a superhero, he's better than being a rock star for sure. He uses his same Dwight Schrute attitude to fight so-called crime with no superpowers, but a pipe wrench. Kevin Bacon was pretty good as the drug dealer who steals his wife from him. Ellen Page is probably what made this film funny, and not so much Rainn WIlson's stupidity as a superhero. Ellen was great as comic fan who loves violence and justice. Without a doubt one of her fiestiest roles ever. There were some good funny scenes with Rainn WIlson, it usual happens when he's first starting out as a hero. This film is really violent though. There is so much head-bashing and explosions. It was kinda funny seeing the action words pop up, but it seemed they kinda forgot to bring them back during the action sequences later in the movie. In the end, this was just okay. It was pretty funny and somewhat exciting until the last 20 minutes, where its gets extreme and really violent. A warped movie, but this Rainn Wilson film is far better than The Rocker.",
      "total_reactions": 1,
      "user": "MrCook"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "I'm not gonna bother explaining this movie to you, I'll just summarize the plot with a couple spoilers. A man has religious hallucinations and starts breaking people's skulls for crimes ranging from child molestation to cutting in line. It looks like he might get caught and learn it was crazy all along, for a little while. Then a cop is shot to death in his house, he murders his way through a ranch full of criminals to take back his wife,  gets his young accomplice killed, and leaves. Then the movie ends with a saccharine sweet monologue about how he was right all along and what a beautiful life his actions created for him. With logic like that I don't even feel the need to touch on the insane shifts in tone and moral ambiguity. It was a shame, because I almost liked this movie while I thought the loose ends would get wrapped up in a healthy dose of real-world.",
      "total_reactions": 1,
      "user": "Akuto"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "A amazing film that was so much more than it initially appeared to be. It's a journey of self discovery for the main character Frank, and satirises religion and the superhero genre in general. Very gorey and very 'weird', and could only possibly suit a select type of film goer; namely those undiscouraged by the surreal, the grotesque who enjoy a film that goes beyond itself. The frequent comparisons to Kick-Ass are completely unjust, as it aims for a completely different effect.",
      "total_reactions": 1,
      "user": "Metanar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "I expected an indie kick-ass and it was. It was also a bad version of kick-ass. Not to say kick-ass was anything special in the first place, but this did not have any thing that was special or fun or anything else it was trying to be.",
      "total_reactions": 1,
      "user": "Summersausage"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "What a strange, problematic, frustrating, and yet extremely entertaining movie.  The cast fits their parts well, and it's funny to see Ellen Page be a crazily violent psychopath because it's so completely opposite of most of the characters she plays.  It's also funny most of the time when Rainn Wilson is dressed as his superhero alter ego.  He makes some pretty stupid and shocking yet funny decisions. This is also one gory movie.  There's even a scene where Ellen Page nearly smashes someone with a statue in nearly the same way Alex killed the cat lady in a clockwork orange.  Now I'll get into the problems.  First off, the movie both makes fun of and embraces Christianity at the same time, which is probably the weirdest and most hypocritical perspective I've ever seen a movie take.  You shouldn't make fun of God at all, and you definitely can't have it both ways.  A major character dies that just shouldn't have ,which is annoying but I won't tell you who, and the ending is depressing.  Not trying to give spoilers but it was and not even in a comedic way.  It was very poignant and so sad that I nearly cried.  So what do we have here?  A movie with great characters, very dark comedy, and lots of entertainment value mixed with insurmountable and annoying problems.  I liked it, but it's a far cry from what could have been.",
      "total_reactions": 1,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "A bizarre superhero movie that might require a specific taste to appreciate it, otherwise, you'll think it's disturbing trash. I like it, even with all the eff'd up stuff that's involved.",
      "total_reactions": 1,
      "user": "ThatCooperGuy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "Super is an entertaining yet unbalanced movie. It treads the same ground as Kick Ass (a nerd becomes a powerless superhero) but doesn't reach the same heights. A fair point is made by making the two 'heroes' utterly psychotic, but this leaves the picture without a truly likable character to root for. Super's fearlessness does work to it's advantage, though. There are constant surprises to be had and you're never quite sure how things are going to close out. I also get the suspicion that this is a movie that will get funnier every time you watch it. Still not what I would call a 'great' film, though.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "The movie's aesthetic is interesting; it starts a comedy apparently pretentious and slapstick, however the screenplay goes pushing on you and the movie keeps creating a way that you don't except, ending like a convincing drama. Right before the end I though \"damn the guy kinda screwed all up, lost his team girl and all that only to save the woman who was despising him\" but the end was really persuasive. Cool, the script much goes right so as much as it fails, but there are moments which are good, like the surreal divine messages, the heroic Christians episodes, nevertheless the violence really visceral. The initial comparisons with Kick-Ass are inevitable, but there is something more human and believable, the end just proves it.",
      "total_reactions": 0,
      "user": "jimmytancredi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "This really isn't a feel good movie. If you want a fun loser turned superhero watch Kickass, this is closer to Defendor. The end is gruesomely bloody the middle is as well, it's pretty cool and very down to earth. I enjoyed most of it but it really was sad. Ellen Page played a crazier version of Juno and of course the star plays a character almost exactly like his character int he office. Not that this is bad. it's not the greatest movie but you won't regret seeing it either. if you are interested in watching go for it but don't expect an epically awesome loserhero movie like kickass or Toxic Avenger, expect a kind of sad kind mix of Bibleman and Defendor that makes you feel uncomfortable when you can relate to the crazy guy.",
      "total_reactions": 0,
      "user": "tingle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "Super is strange to say the least. The premise is completely conventional nowadays - a nobody decides to become a superhero and fight crime despite a complete lack of skill. The problem with any film that follows this formula from now on is that it's not Kick-Ass. To be fair to Super, it's not trying to be Kick-Ass. It's more satirical, but also far darker. Every character has some form of mania that drives them, whether it's Wilson's religious epiphanes, Tyler's dependence on drugs or Page's full-blown insanity. The performance highlights of the film are Nathan Fillion's bizarre turn as a TV evangelical superhero, and Ellen Page who is just plain terrifying (and who is the dark heart of the film). It's often funny but other jokes are misjudged,  the pacing of the film is a bit off and it's just too depraved. It might appeal to some, and I can see what it was trying to be, but Super goes a little too far for me.",
      "total_reactions": 0,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "Before watching this movie, I didn't expect much. Maybe some stylized violence, a few comedic moments, and a few good one liners. But what I got was far beyond that. The acting was really spot-on, the visual effects looked great and believable, the dialogue was dark and funny, and the plot was engaging and unique. For me, this is probably my favorite movie of the year. If you're into dark comedy and want to see something with less filler and more substance, this movie SHOULD NOT BE MISSED.",
      "total_reactions": 0,
      "user": "Mahboy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "This film is bizarre, absurd and ridiculous. However, all the actors do an excellent job, the action scenes are extravagant and entertaining, and there a quite a few laughs along the way. This film has extremely dark humor and almost feels unnecessarily grim, and the main character (Rainn Wilson who does a superb job) is demented and insane, as well as his sidekick, Boltie (Ellen Page, who is also amazing). Gruesome, dark and depressing at some points, the movie can drag along and feel slow, but then pick back up with excitement or murder. A roller coaster, some parts are great, some fall flat, but overall, this movie is average. I'd say it's worth seeing if you like dark humor, or the movie \"Kick-Ass\" as \"Super\" follows the same underdog-civilian-who-becomes-a-superhero formula. Overall, an average movie, some of the gore and death feels out of place or unneeded, but everything ties together for a fantastic conclusion, and amazing actors portray their characters well enough to save this movie from the brink of simply being depressing and warped.",
      "total_reactions": 0,
      "user": "Jman4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "Frank Dâ",
      "total_reactions": 0,
      "user": "Booleanflix"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "Shut Up Crime! With a recent emergence of superhero movies aiming to be grittier and more realistic, Super is arguably the most accurate portrayal of what would happen if someone without powers or insane amounts of money decided to be a superhero. Super is super realistic...and super dark! The single solitary downfall of this movie is that it completely disregards expectations, but I'm pretty sure it couldn't have been done any other way. How do you advertise for a movie that is a perfect mix of drama, comedy, tragedy, thriller, parody and character-based gore-fest? How do you tell the uninformed movie-goer that what they're about to see is going to challenge them in ways that a super-hero movie could never be expected to?  Casual movie goers may get turned off by the gritty violence and somewhat convoluted message. Yet the fun, the humor, the strength of character and the way Gunn challenges thematic notions raised by most superhero films definitely elevates \"Super\" in a way that suggests its future will be as \"cult favorite\" as opposed to \"lauded superhero spoof.\"",
      "total_reactions": 0,
      "user": "moviekretik"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2016
      },
      "score": 8,
      "text": "Hilarious dark comedy, and I guess this reflects my personality. I could really relate to Frank. And the ending would likely not be this pretty. I get that people find this movie reprehensible, but I like is over-the-top quality.",
      "total_reactions": 0,
      "user": "quentntarantado"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2014
      },
      "score": 8,
      "text": "Errm. A peculiar flick that will make you think, laugh, cringe and if you're mentally disturbed enough (which I am), get emotional by the ending. I liked it and would have given it a six or a seven, but Ellen Page just made the pie so much sweeter with her wonderful character and acting, as well as that sex scene.",
      "total_reactions": 0,
      "user": "Gamer147"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "Being a low-budgeted independent film, Super has a surprising amount of mildly dark and amusing humor that works on many occasions, and a zealous lead in Rainn Wilson.",
      "total_reactions": 0,
      "user": "SuperheroMovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "While at times the jokes may stray too far into tastelessness for the script’s lofty spiritual aspirations, it is, surprisingly, an endearing and entertaining movie that manages to discuss some pretty hefty themes of responsibility and wish fulfillment through a lens which is at times unique, at times brutal, at times childish, and at times truly meaningful.",
      "total_reactions": 0,
      "user": "Shaneryankelly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "This film is realistic at the same time surreal. The score I give it high because there have been many times I've laughed, I kept thinking that somewhere in the world can have someone do this!  ji ji ji",
      "total_reactions": 0,
      "user": "RacheJaus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "I personally love this movie,  Ellen Page is fantastic, Rainn Wilson is awesome in this SUPER movie. NATHAN FILLION is hilarious as The Holy Avenger!!",
      "total_reactions": 0,
      "user": "Wadeus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2016
      },
      "score": 6,
      "text": "I really liked the movie but there are a lot of problems in the cinematography that really annoyed me through the whole film, in other they were perfectly done but it was hard to remove the bad taste from the bad ones.",
      "total_reactions": 0,
      "user": "weirdcryo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2016
      },
      "score": 2,
      "text": "I don't usually hate on an universal acclaim user score, but when I do, I do it for reasons. Super, on the other hand, has very great animation sequences and that can't save the film from being an instant mess. A dumbed-down mature Kick-Ass which that movie is obviously better.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    }
  ]
}