{
  "mc_avg_user_score": 5.8,
  "mc_metascore": 45,
  "mc_mixed_rating_frequency": 55,
  "mc_movie_name": "Surrogates",
  "mc_negative_rating_frequency": 22,
  "mc_positive_rating_frequency": 56,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 6,
      "text": "\"Surrogates\" is a disjointed SF movie that doesn't quite grasp the idea of what its talking about. However, it still provides you elegant cinematography as well as decent entertainment thanks to the \"old\" Bruce Willis.",
      "total_reactions": 2,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "Not all of the elements work, but Bruce Willis does a really good job, the setting and \"what if\" examination of a society in which robot avatars take over human interaction is reminiscent of blade runner and other pulp sci-fi movies, and the special effects are good enough to not get in the way. Is it perfect? No. Is it better than most critics say it is? Yeah. I say check it out",
      "total_reactions": 1,
      "user": "bmdunham"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2010
      },
      "score": 2,
      "text": "Surrogates has to be one of the most worst produced sci-fi films ever, with an interesting story. But not even action star Bruce Willis can save this movie from disaster.",
      "total_reactions": 0,
      "user": "Film_Fanatic_15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "\"Surrogates?\" A movie about mothers having babies for other people staring Bruce Willis as the doctor? Nope. I know right, the title had me fooled too. \"Surrogates\" is director Jonathan Mostow's interpretation of Robert Venditt's popular graphic novel also named \"Surrogates\" (and no, a graphic novel is not the same thing as a comic book). The live action adaptation of \"Surrogates\" is a visually stunning movie that appears to have gotten butchered along the way to be forced to fit into a 90 minute feature.",
      "total_reactions": 0,
      "user": "PYRiAH"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2012
      },
      "score": 1,
      "text": "A terrible movie that displays an incomplete thought, weird plot, weird acting and a lot futuristic robot    disaster..............",
      "total_reactions": 0,
      "user": "aaronpaul121"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2012
      },
      "score": 2,
      "text": "I didn't understand who the **** were we supposed to root for? The religious zealots, unwilling to accept change? Or the \"hero\" who destroys surrogates that, let's face it, will be rebuilt in a few weeks?",
      "total_reactions": 0,
      "user": "XolPemNab"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "One of the main flaws of this film is that a film based on androids that create an idealistic version of themselves revolves around the inventor, who becomes disillusioned at how they've changed from aiding less able people such as himself to somewhat empty and materialistic concerns. The college student was a fair target, considering who they were aiming for. However, this becomes a side issue among the division between the predictability and the actual exploration of humanity's frightening procrastination at becoming old and unable to go through life. This was in contrast with turning it into some kind of fashion statement, as if artificiality and beauty can prolong meaning of life itself. Bruce Willis is ultimately superb in this role, considerably cynical and not sarcastic, distinctive in a world of people who are plugged into androids. In turn, there are obvious cliches that you would find in an action sci-fi, albeit having action that was just as necessary as the dialogue.",
      "total_reactions": 0,
      "user": "EssenceOfSugar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "SURROGATES is a visually impressive and a decent film, but in some scenes, the acting wasn't good and the film seemed a bit cheep.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "Surrogates (2009): Potentially good movie with a great premise ruined by a cheesy, shallow and awkward script.  If the script was fleshed out better, and the director wasn't verging on stylish action-movie mode it could have been substantial.  I can't help but feel Mostow was trying to channel Spielberg here, but couldn't quite cope.  Mostow is no JJ Abrams.",
      "total_reactions": 0,
      "user": "nascent"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "Well, as usual, interesting visuals combine with a weak story to create a passable film not entirely devoid of entertainment value as long as you have nothing better to do.",
      "total_reactions": 0,
      "user": "HotelCentral"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "A smart little genre outing, an endangered species in modern Hollywood.",
      "total_reactions": 0,
      "user": "avamiller21"
    }
  ]
}