{
  "mc_avg_user_score": 7.8,
  "mc_metascore": 85,
  "mc_mixed_rating_frequency": 18,
  "mc_movie_name": "Take Shelter",
  "mc_negative_rating_frequency": 17,
  "mc_positive_rating_frequency": 157,
  "mc_pro_critic_reviews": [
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 100,
      "summary": "Take Shelter, which, it should be said, boasts haunting but seamless visual effects, is a movie for this moment in time, this moment in our lives."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 100,
      "summary": "The story of a man afflicted with fearful visions, Take Shelter is a film that's hitting the right apocalyptic trumpet call at the right time."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 100,
      "summary": "Taut, unsettling, haunting and powerful."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 100,
      "summary": "The film concludes not with a \"surprise ending\" but with a series of shots that brilliantly summarize all that has gone before. This is masterful filmmaking."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 100,
      "summary": "As with \"Shotgun Stories,\"  Nichols assembles a tense portrait of blue-collar life, while deepening his thematic interests and working on a bigger scale. Burrowing into the subconscious of a damaged man, he delivers a modern American epic with extraordinary restraint."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2011
      },
      "score": 100,
      "summary": "Nichols has said that the idea for the film emerged from a free-floating anxiety that he sensed in the world at large, the feeling that everything we treasure in life could be lost in an instant. That sensation permeates this strikingly original movie - especially its enigmatic mind-fuck of a finale, which will haunt you for several lifetimes."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 91,
      "summary": "Begins frighteningly and gets progressively more so."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 91,
      "summary": "Writer-director Jeff Nichols builds his elegantly shot, weather-sensitive horror story in waves of tension that crest as if pulled by tempests."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 90,
      "summary": "Not just a fascinating character study but a kind of horror movie as well."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 90,
      "summary": "Writer-director Jeff Nichols maintains a cagey balancing act for much of the movie, refusing to specify whether his protagonist is a prophet or a madman, yet in the end this doesn't really matter: the storm inside him is plenty real."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 90,
      "summary": "A terrifically crafted little movie that bounces off current events and the nation's downbeat mood ingeniously, and that it variously suggests comparisons with the early work of Terrence Malick, Stanley Kubrick and the Coen brothers. Yeah, I think it's that good, but please note that I also said \"little.\""
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 90,
      "summary": "A dazzling piece of filmmaking, and much of the dazzle - as well as the anguished darkness - comes from Adam Stone's cinematography, which expresses the swirling state of Curtis's mind with richly varied flavors of light."
    },
    {
      "critic": "Melissa Anderson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2011
      },
      "score": 90,
      "summary": "Despite a few missteps, Take Shelter powerfully lays bare our national anxiety disorder - a pervasive dread that Curtis can define only as \"something that's not right.\""
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2011
      },
      "score": 90,
      "summary": "Nichols has a genius for making landscapes and everyday objects resonate like crazy, for nailing the texture of dread."
    },
    {
      "critic": "David Rooney",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2011
      },
      "score": 90,
      "summary": "A riveting genre blend of thriller, domestic drama and supernatural horror propelled by a brilliant lead performance."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2011
      },
      "score": 88,
      "summary": "Shannon's powerfully imploded performance ignites one of the best films of the year."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 88,
      "summary": "Take Shelter plays Curtis's unraveling at daring length. The film will be too slow and dark for some, and it's definitely overlong."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 88,
      "summary": "Here's what I most appreciate about Shannon's work with the writer-director Jeff Nichols: the subtlety."
    },
    {
      "critic": "Noel Murray",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 83,
      "summary": "Writer-director Jeff Nichols re-teams with his \"Shotgun Stories\" star Michael Shannon for his second feature, Take Shelter, which has a similar setting, but a different mood. Nichols is still concerned with family legacies, and the ways people in smaller communities relate to each other, but Take Shelter is slower and smoother, deliberately developing a mood of creeping dread."
    },
    {
      "critic": "Angie Errigo",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2011
      },
      "score": 80,
      "summary": "Terrific. Michael Shannon delivers a fractured everyman who'll stay with you long after the final frame."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 80,
      "summary": "Nichols approaches his subject with thoughtful empathy, and while his themes are enormous - he's addressing no less than the state of our nation - he wisely underplays even the most important moments."
    },
    {
      "critic": "Sheri Linden",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 80,
      "summary": "From the first moments of the eerie storm that opens the story, dread is the prevailing mood of this pre-apocalyptic drama - a film very much about this moment in time."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 80,
      "summary": "It is a quiet, relentless exploration of the latent (and not so latent) terrors that bedevil contemporary American life, a horror movie that will trouble your sleep not with visions of monsters but with a more familiar dread."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2011
      },
      "score": 80,
      "summary": "This deliberately paced psychological drama builds an ever-tightening knot of tension around an excellent Michael Shannon, here playing a family man slowly driven mad by apocalyptic visions that could be paranoid, prophetic or both."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 78,
      "summary": "Take Shelter is a deeply unsettling movie. Writer/director Jeff Nichols (an Austin resident and director of the award-winning 2007 feature \"Shotgun Stories\") doles out information as strategically as a government official."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2011
      },
      "score": 75,
      "summary": "All in all, Nichols ends up with a richly drawn, and at times disturbing, portrait of one man's descent into madness."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "Take Shelter is paced slowly and deliberately, which is necessary to make believable whatever is tormenting Curtis."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "Nichols throws curveballs, but his film is unique and unforgettable."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "The economics of star casting aside, what would Take Shelter have been like with James McAvoy or Mark Wahlberg or Jake Gyllenhaal at its center?"
    },
    {
      "critic": "Bill Weber",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "It's not easy to give a character study concerning mental illness the aspect of\r\na psychological thriller without some notes of exploitation or trivialization\r\ncreeping in, and Take Shelter makes a few missteps."
    },
    {
      "critic": "Pam Grady",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2011
      },
      "score": 70,
      "summary": "Shannon makes the man's dilemma plain and moving, and that gives Take Shelter a resonance that last long after the final fade out."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 63,
      "summary": "It would be possible to appreciate Shannon's fabulous work in Take Shelter far better if the filmmaker lost a quarter of the two-hour running time -- there are many overlong scenes that make this a needlessly tough sit."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Take Shelter has a problem, the simplest of all problems but no less serious for its being simple. It's a film without suspense and with a slow-moving story that unfolds without surprise or embellishment."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "Powerful, with an overwhelming sense of dread throughout as you watch the protagonist slowly descend into madness.  Keeps you on the edge of your seat throughout and doesn't reveal its cards until a ridiculously shocking conclusion.",
      "total_reactions": 2,
      "user": "JTKelley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Just because you're paranoid, it doesn't mean they aren't out to get you. Or in the case of Curtis, that scary storms aren't out to get you. This is a small film  but with superb acting  that understandably won't appeal to everyone. Pace is deliberate, to say the least. and not that much really happens. It truly will grip and haunt you if you know someone who's struggled w/ mental illness  thanks to brilliant portrayals by Shannon, Chastain and Baker. And you'll want to talk to someone about the ending!",
      "total_reactions": 1,
      "user": "Lyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "Great story, different and presents the most realistic character's paranoia, which Shannon knew how to handle and leave with good acting, but Jessica Chestain, my god, she is tremendous, what I loved most were the dialogues and how they managed to give you the feeling you want. very good!",
      "total_reactions": 1,
      "user": "wishmaster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 9,
      "text": "Take Shelter is a thriller that doesn't utilize scare tactics, but instead terrifies us with emotional dread and an enthralling story. Michael Shannon gives the performance of his career, alongside strong newcomer Jessica Chastain.",
      "total_reactions": 1,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "The movie restrains itself, making most of the film quite slow, but then it unleashes into an unsettling, terrifying tour de force. Michael Shannon is once again amazing, and Jessica Chastain is quickly becoming one of the finest actresses out there.",
      "total_reactions": 1,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "Take Shelter is the story of one man's quest to protect his family from an impending storm. Curtis (Shannon) begins to have premonitions that a storm is coming to destroy his world. These premonitions become so real that Curtis begins to prepare a shelter for the storm. Curtis is also fully aware that his premonitions may not be real. At the same time he is preparing his shelter he is also seeking help for what may just be delusions.",
      "total_reactions": 1,
      "user": "seancriswell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "Incredibly symbolic throughout, Take Shelter is a film that really rides on Michael Shannon's terrific performance and Jeff Nichols' great direction. Showing incredible vulnerability, Shannon stars in this character study of a broken man dealing with some troubling visions that threaten not only himself, but his relationships, and his marriage. Shannon does a great job portraying this troubled man. The writing here is also very good and it does a great job drawing connections between the storms, both exterior and interior. Overall, I would say this film has many strengths, but none that make it a truly great film. As it stands, it is pretty good, but is missing that \"it\" factor. Its main negative is that it is a touch too long, even though it is two hours. Some scenes could have been cut and the final result would have been just as effective. However, as it stands, the film shows both the talents of Nichols and Shannon quite well and show is a pretty emotionally impactful film.",
      "total_reactions": 1,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "One of the best films of 2011. A brilliant film in every way. Michael Shannon and Jessica Chastain give Oscar caliber performances in this emotional drama. The last 30-40 minutes are some of the most intense I've ever seen. I absolutely loved it!",
      "total_reactions": 1,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "Perhaps too drowsy in pace for some, \"Take Shelter\" is not easy to enjoy; it's a ponderously, slow simmer that yearns for one's admiration, while never losing the viewer's interest. The film echoes a sense of dread and anxiety, channeling Shannon's dark, slightly unhinged, sullen aura, his trademark loomy stature and coarse features; he brings to life a \"Curtis\" character who is so malleable in his purpose, that no one can tell what's to happen next. Moreover, it feels as if what the audience is seeing has much more depth, as if another layer of subtext is just waiting to show itself. Nichols paints a portrait that is both astounding and riveting to hold on to, grimmacing and shuddering uneasily with anticipation and pent-up apprehension, driven by self-discovery, and down-right frightening in the most eerie of feelings. Although it is Shannon that reels in arguably the best performance of his career, more than worthy of an Oscar nomination, Chastain is incidentally moving, though mostly captured in her spot-lighted contemplation and worry. Notwithstanding near impeccable casting, editing, musical accompaniment, and cinematography, not all will appreciate \"Take Shelter\" due to its slothlike pace, frustratingly ambiguous, conflicting religious and metaphysical themes and interpretations, and its crazed, schizophrenic sequences. Pack plenty of whitey-tighties, because this one's a nightmare.",
      "total_reactions": 7,
      "user": "FDT44"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "This is a masterfully made movie- the acting is spot on, the writing is great, the cinematography and special effects are both wonderful especially considering the small budget- but what makes this movie great is that it really has a human feel to it. This movie precisely depicts the raw human emotion experienced by loved ones when dealing with mental illness. Truly one of the best of the year!",
      "total_reactions": 3,
      "user": "ahpieper1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "This is an incredibly good film which I absolutely would NOT recommend to everyone.  It's a remarkably sensitive portrayal of a family dealing with paranoid schizophrenia over a couple of generations.  I don't think I've seen Jessica Chastain or Michael Shannon in a better role, and that says a lot  because I think each have done outstanding work (Revolutionary Road, Boardwalk Empire, The Help, Tree of Life). I also have to mention Shea Whigham.  He's such an effective actor - brings so much to every movie he's in, including All the Real Girls, Boardwalk Empire, and The Bad Lieutenant: PONO.  Loved his take on Shannon's best friend.",
      "total_reactions": 5,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2011
      },
      "score": 2,
      "text": "This is a mostly well executed movie that is completely undone by its ending, which essentially turns the film into an offensive parody of mental illness. If the hook had been delivered as they emerged from the shelter, it would have worked. But after they spoke with the doctor it crossed the line.",
      "total_reactions": 6,
      "user": "mokomuku"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "This movie reminds me of a mostly forgotten film from the '80's called the Rapture starring Mimi Rogers. I think anyone who saw that movie remembers it quite vividly for its uniqueness and its compellingly honest take on evangelical apocalyptism. This is a great movie for the times and I'm sure we'll remember it ten or twenty years from now (unless the world ends before then, ha). Both leads are excellent, yes, it does tax the patience a bit in parts but it also delivers some unique twists and turns in its two hours. I liked it, I recommend it.",
      "total_reactions": 2,
      "user": "JUIKER"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "Shannon is once again a pleasure to watch: a very controlled performance of a guy on the brink of insanity, a person dealing with his demons, a person in dispair... A very unsettling story told brilliantly from a promising young director.",
      "total_reactions": 2,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "Michael Shannon is making a career out of playing dramatic, on-the-edge characters. This time, he's having a gradual encounter with mental illness, He suffers from disturbing nightmares and hallucinations that threaten his safety, while trying to hold down a job and be a good father/husband. There's an involving story here, but almost every scene takes too long to unfold. This means the movie is slow and frustrating, although the weather effects are well done.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "Simply moving film.  From beginning to end the entire audience was silent and engrossed in what was happening on screen.  Michael Shannon did an incredible job, as always.  My only fault was the pacing.  I felt it worked for the movie, and speeding things up would have only hurt, but it was still slow and drawn out.",
      "total_reactions": 2,
      "user": "bjnotnj"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "This doomsday psycho-drama is a precious gem from indie director Jeff Nichols, boosted by an extraordinary acting impetus from Michael Shannon and Jessica Chastain pair. A working class point-of-view towards the Armageddon has been laboriously concocted through an ordinary worker's psychosis degeneration and the clashes between him and the mundane world. Comparison with last yearâ",
      "total_reactions": 2,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "A la manière d'un M. Night Shyamalan des grands jours, Nichols joue avec nos peurs les plus profondes, sacrifiant tout artifice visuel au bénéfice d'une famille simple, avec ses problèmes et ses  moments de bonheur, au bord de la rupture. Si la léthargie des personnages peut faire bailler, le suspense ainsi que le magnifique orage qui sert de toile de fond au scénario devraient vous scotcher jusqu'au bout. Michael Shannon est un très grand, il est plus que temps d'ouvrir les yeux sur son indéniable talent. Hypnotique et fascinant, du pur cinéma",
      "total_reactions": 2,
      "user": "Pinto-Vegas"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2011
      },
      "score": 4,
      "text": "Curtis (Michael Shannon) is having bad dreams.  Bad dreams are a bit low key to accurately describe what he dreams at night; absolute night terrors works better.  He dreams his faithful dog suddenly attacks him and takes a chunk out of his arm and later he dreams his best buddy stabs him with a pickax.  There is no warning these events would ever occur in reality, but for some reason, Curtisâ",
      "total_reactions": 5,
      "user": "CitizenCharlie"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "A masterful film with subtle direction red hairings and a multitude of suspense. The director slowly build his suspense throuought the film until it's climax. However after the climax comes a revelation that is not only startling but also intriguing. This event causes one to rethink everything he has just saw. I thought WOW!",
      "total_reactions": 5,
      "user": "cabrita"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "A haunting, well acted and near flawless meditation on our national anxiety. The pitch perfect tone and pace invite the viewer to participate fully, and have a stake in the proceedings. Rich, rewarding and worthwhile.",
      "total_reactions": 3,
      "user": "Scosor"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "I must say, this film took me by surprise. Its slow pace, haunting, strange and heavy ambiance makes it slightly tough to watch, but increasingly addictive the more you do watch it. I cannot say more. It's a must see for anyone with an open mind and taste for originality.",
      "total_reactions": 3,
      "user": "bitburn"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "Excellent. If you enjoyed Donnie Darko you will enjoy this. The ending, whilst confusing at first, makes sense when you think about it. A very very enjoyable movie.",
      "total_reactions": 3,
      "user": "MorriBey"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "Shannon & Chastain are remarkable in this film. It is in these performances that keep the film grounded and engaging. Shannon portrays a man that is truly terrified, down the the very fiber of his being.....and even when everyone else in the film doubts him, he still draws belief from the audience. I found myself wondering the whole film, \"What if he is right?\" Throughout the entire film, that question contains far too grave of repercussions to merit dismissal, which makes this film engaging to the very last moments.",
      "total_reactions": 3,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "There is masterful filmmaking at work here, this is true. Cinephiles will love the cinematography, editing, and what may be at one point an homage to Magnolia. You'll know what I mean when you see it. To address the criticisms, or at least to elaborate upon what they are alleging is something which \"undoes\" film via its ending, I should first point out that this film is not about an entire family. It's about a particular man's relationship with his family. Where there are complaints that he does not 'connect' with his daughter, or that we do not see her characterized with as much depth as the other primary actors, misses the point. Her characterâ",
      "total_reactions": 3,
      "user": "nhaler"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Woah... No idea where that came from, but it is of an impeccable quality. Cinematography is gorgeous (once more, Jessica Chastain receives lighting like nobody else), Michael Shannon is breathtakingly solid, and I've been in some moments completely freaked out. Unquestionably, something grandiose happens in these 120 minutes. May seem a bit long and tedious in the middle, but trust me, it deserves that you hang on till the end.",
      "total_reactions": 3,
      "user": "jocereal"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "Take Shelter is one of the most poignant and disquieting films Iâ",
      "total_reactions": 3,
      "user": "TheMudDoctor"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "Similar to Polanski's \"Repulsion\", this is a psychological tour-de-force, but on a grander scale. In contrast, Chastain and Shannon's performances are beautifully-restrained, with the exception of a couple appropriate scenes. Though everything wasn't perfect - the VFX (birds) were questionable, at times - the acting was spot-on and the sound cues/music set-up the dread perfectly. Frankly, I loved the story. If you haven't read a lot about it, leave it that way until you've seen the film. To me, the greatest scene wasn't the ending, but the scene where Shannon warns the community about the pending storm. Not since \"There Will Be Blood\" was there that much intensity in a scene and it was invigorating to see it on-screen. For those that don't like this or \"Drive\", they don't appreciate great direction. Don't miss this one, especially in theaters. It's quietly disturbing.",
      "total_reactions": 3,
      "user": "Friskytiger81"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "For about 110 minutes I really did not like this movie. But the last 10 really saved it for me. The funny thing about it is that's the most controversial. Some people really liked it until then, but for me the ending was key. But I guess it's all about what you took the ending to mean. Was Curtis crazy or was the apocalypse forthcoming? That I think is the key to loving or hating this. Outside of the ending it was a beautiful film with incredible acting and tension throughout. I had never seen Jessica Chastain before and only knew of Michael Shannon and Shea Wigham from Boardwalk Empire, but all three blew me away. If beautifully shot movies and good acting with thin story lines are your thing then you will love this. But if you need constant action to keep your interest and hate movies like Drive then this is a pass.",
      "total_reactions": 3,
      "user": "Dagoblog"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "Part midwest drama, part horror flick, and part apocalyptic epic, the independent film Take Shelter, by newcomer writer/director Jeff Nichols, has somehow managed to fly under the pop culture radar.  This is not to say that critics haven't taken notice.  This small film has been lapping up awards at film festivals such as Cannes, Sundance, and Toronto and, in my estimation, it deserves every one.",
      "total_reactions": 3,
      "user": "spacemonkey83"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "Great acting by Michael Shannon and Jessica Chastain accompanied with great storytelling by Jeff Nichols makes this movie one the year's must sees. Also a subtle but wonderful score, which intensifies the suspenseful moments even that much more. This movie will stick with you for a few days, it's that good!",
      "total_reactions": 3,
      "user": "blaine04a"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "I saw this last night, but upon my return I couldn't put into words what I thought of the film. Now I think I can. This film is a wonderful character study. You have this man named Curtis who has these vivid nightmares that suggest the world is going to end. He eventually becomes convinced that the nightmares are a prophecy for things to come. He takes drastic action to protect his family, so drastic that it threatens to rip his life apart. His wife thinks he's going crazy, even he thinks he might be going crazy. But he still continues on because he truly believes in what he's doing. I found this conflict fascinating, and the question that writer/director Jeff Nichols leaves us with is equally compelling. Is Curtis a paranoid schizophrenic or is he a prophet? The ending doesn't give you the answers you're looking for. This isn't the kind of film that's wrapped up in a nice tiny ribbon. It forces you to think. The performances are also terrific here. Michael Shannon really allows us to see the conflict brewing in Curtis. We can connect with his doubts as he makes decisions a sane person probably wouldn't make. Overall, this movie isn't for everybody. It's definitely an independent film in the sense that the pace is slow and the movie ends ambiguously, but for those of you looking for a film that will stick with you for days, be sure to check this one out.",
      "total_reactions": 3,
      "user": "JollyG87"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "What an outstanding movie it was, i was looking forward to watch it from the very beginning. I must say this is a good psychological drama which feels quite appropriate in a sense that the family portrayal is quite real and all of it looks close to the reality. Jessica Chastain and Michael Shannon performed superbly, few times it stumbles a bit but overall good movie.",
      "total_reactions": 3,
      "user": "khan2705"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "Curtis has a good life: a loving wife, a daughter and a job with decent benefits. His nights as of late have been sleepless. Inescapable storms and faceless people linger threateningly in his dreamscape. He awakes, short of breath and covered in sweat.",
      "total_reactions": 3,
      "user": "nevermindpopfil"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "Take Shelter is simply the best movie of last year.",
      "total_reactions": 3,
      "user": "JohnW67"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "A very important movie about the financial problems of our days (not just in America, but also in Europe). It is also a movie about the importance of family (the only shelter that can protect you). Brilliant performances from all cast members. Highly recommended.",
      "total_reactions": 3,
      "user": "oliver1h"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2011
      },
      "score": 3,
      "text": "I wish I had read some of these user reviews before going to see the movie.    Manipulative is the key criticism.  The film-makers toy with viewer's emotions without grounding the plot in any real insights into human nature or interpersonal dynamics.",
      "total_reactions": 4,
      "user": "jon44"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "Take Shelter is an amazing mystery of a film with outstanding performances by Michael Shannon and Jessica Chastain. Director Jeff Nichols keeps his film tense and disturbing all the way through. He lets the madness slowly start to come in until it kicks the door wide open with brutal force. The film is a true battle between reality and fantasy, and Nichols creates the perfect mixture of suspense, drama, and insanity to feed it. Take Shelter is a horror film unlike any other because it has nothing to do with monsters or ghosts. Instead this film allows a feeling of terror to overwhelm us that is familiar and much closer to home.",
      "total_reactions": 4,
      "user": "Sir_Brandon"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2012
      },
      "score": 1,
      "text": "I am diagnosed with Bi-polar. I have been around many people with Schizophrenia and have talked with them about it.  I have yet to meet anyone yet who has said they have the hallucinations that people have in these movies that try to sympathize with people with mental illness.   Even a Beautiful Mind, another train wreck of a movie that makes portrays mental illness symptoms in Hollywood form, a.k.a.,  a fairy tale.  They don't exist.  After watching this movie I am again insulted with the way this is all represented.  Even the fighting with his friend is very phony.  And no one possibly could get the ending of this movie cause it has an infinite amount of possibilities on what it could actually mean.  I am glad I downloaded this movie and didn't waste my money renting it, or wasted a Netflix slot.  As far as the acting, I didn't think that Michael Shannon's job was very difficult when I thought about it.  He usually just has a blank face.  Emotionless.  Who couldn't do that?  This is one of those movies that critic's like because it's a very different kind of movie.  Maybe if they would have turned around and seen have the audience sleeping it would have altered there final scores.  Only reason I gave it a 1 is because I did like a few of the camera shots.  A few were memorable.  But too movie as a movie whole.  It isn't very memorable.",
      "total_reactions": 4,
      "user": "ekolite82"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "Am I losing my mind?  Between this and the critical approbation showered on that dismal turkey DRIVE, hackneyed phrase be damned, 'cuz here it's appropriate - just WHAT are you folks smoking??  As far as this flick, I'll at least spot you the performances in this one... the very busy Jessica Chastain is remarkable; like Julia Roberts, but with talent.  And Michael Shannon anchors this thing in a huge way... any suspense generated in this rather ponderous tale is generated by him and him alone.  He is somehow capable of generating heartbreaking warmth and a sense of deep menace simultaneously.  Kudos to them, but otherwise, this thing takes a loooooong time to travel virtually nowhere.",
      "total_reactions": 14,
      "user": "dougrees"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2011
      },
      "score": 4,
      "text": "Poorly directed, too long, and done on the cheap.  Trying to build suspense has rendered the film boring.  I should have spend my money on the muppets.",
      "total_reactions": 5,
      "user": "gfny"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2011
      },
      "score": 3,
      "text": "Wow is this movie overrated.  There are some things to admire: the actors are all very good and the cinematography is outstanding.  But, somehow it doesn't quite work.  I'll point out one element that seems dishonest and safe: having the daughter be hearing-impaired means that the filmmaker doesn't have to really give her a point of view.  That is dishonest because of course she has emotions.  She just sits like a sweet little cherub (and she is adorable).  But, she is given no room to react to the craziness around her.  Kids have personalities too.  Key scenes that show this:  We get to see some of her spunk when she is feeding the dog some of her own breakfast in the opening scene...but later when her father gives the dog away we get no reaction from anyone--not even a mention of it! That shows me the filmmaker wasn't really interested in the real emotions of the family members.  The whole film felt designed to get good reviews, but it felt very manipulative to me.",
      "total_reactions": 5,
      "user": "MJT"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2012
      },
      "score": 3,
      "text": "Not  a disaster movie, just a depressing movie that doesn't make sense with no escapism factor.  They tacked a cheesy ending on it because they knew no one would want to see this movie if it was honest about itself.",
      "total_reactions": 5,
      "user": "bob13bob"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2011
      },
      "score": 3,
      "text": "Please don't waste your time or money on this clunker.  It would have made a nice 1 hour Twilight Zone episode, but nothing more or better than that.   A groaner of an ending.   ``YGHhhhhh - wish I stayed home",
      "total_reactions": 7,
      "user": "philo"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "slow and spiritless. the entire movie labors to reach the pinnacle ending which is anticlimactic. you will feel cheated.",
      "total_reactions": 10,
      "user": "shaunmed"
    },
    {
      "neg_reactions": 17,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2011
      },
      "score": 0,
      "text": "This movie was so horrible it compelled me to join this site just so I could review it.  Everyone better \"take shelter\" from this mess of a movie.  In a theater of 20 people on a cold Sunday night, 10 people, including me, walked out within the first hour.  The entire first hour consisted of no plot development.  Every 10 minutes this guy was having nightmares, and the only purpose of these dreams was apparently to scare the sh*t out of the audience.  By the third nightmare, I was over it.  Based on the spoilers I've read, apparently this crap just continues the entire length of the movie.  It's a 15 minute plot spread out for what feels like an eternity.  Clearly there must be someone in this movie --- either an actor, or someone behind the scenes --- who has a cult following, as it would be the only explanation as to why it has such high ratings on here.  It was one of the worst movies I've ever seen in my life.  If you want to see great acting and \"cinematography\", or whatever the hell else people are saying is so great about this movie, you'd be better off seeing a movie whose writing didn't suck.  MESS!",
      "total_reactions": 18,
      "user": "CriticalGreg"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "Heard this movie did an incredible job of visually depicting his growing madness, and I wasn't disappointed.  Excellent movie, excellent acting, found a few soft holes in the script, especially the interaction with his brother, but all in all a very good film. Great camera work.",
      "total_reactions": 2,
      "user": "Hawkeye_Lori"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "Take Shelter is movie about family, dream, fear, power, disaster, supernatural, logic an what you could describe about it. Dazzling performance by two its lead, Michael Shannon and Jessica Chastain. It could be better and the **** is \"shake\" your logic.",
      "total_reactions": 2,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "Great movie! I started to believe that the main character was going crazy. I started feel the pain he was going through. I felt scared for his family members, and when you think what the movie is about. They have a twist at the end of the movie! The movie isnt for everybody, it is \"Slow\" but, I enjoyed the story to develop slowly.",
      "total_reactions": 2,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 4,
      "text": "A boring film with above average acting, nice effects, and a story that grabbed me at the beginning, then lost a little bit at a time, right up to the predictable ending. It just wasn't fun, the only root was for the daughter. Some nice marks for the loving wife who puts up with it all. Is it faith, mental illness, or actually \"the prime mover\"?  Although there is evidence for all three, I never found out and didn't care to form my own opinion because Mr. Shannon couldn't make me care.  In the end not quite a poor film, so a  C-.",
      "total_reactions": 2,
      "user": "RobinsNest"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 2,
      "text": "I really, really don't understand why this movie scored so highly with the critics. If I had to choose one word to describe it, it would be 'tedious'. It was like watching a reenactment of someone's uninteresting (although unfortunate) life, with a few interesting dreams thrown in. I was waiting for the movie to begin all the way through until it ended.",
      "total_reactions": 3,
      "user": "martinistripes"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "Curtis, the main character, is so insane that by the end of the movie I was starting to lose it. In some ways with his insanity it hid the dull and lifeless parts of the rest of the film and the fact that Michael Shannon couldn't make me care about his character.",
      "total_reactions": 3,
      "user": "csw12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2012
      },
      "score": 2,
      "text": "Most boring, slow paced movie I've stuck with hoping things would change, but alas - NOT.  The broody thing got old fast and the mental illness vs. cosmic connection to nature of sorts just didn't work.  Felt cheated for sticking through to the end... and why would you want to go broke, lose job, etc. adding on to a perfectly adequate concrete storm cellar... oh yeah, do you think you would stand around exchanging I-told-you-so nods in the face of the events shaping up in the final scene?   blah!",
      "total_reactions": 2,
      "user": "Eboard802"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "This movie I wanted to watch a long time ago. The right time came and I watched it. I enjoyed the whole movie, from the beginning to the end. It lasts 2 complete hours, more than enough to make me fall asleep. Moreover I knew it was a very slow moving. But it didn",
      "total_reactions": 1,
      "user": "deromir"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "A darker FIELD OF DREAMS, this film took me about 45 minutes to get into.  Once it became focused it shined.  Not a great film in any cinematic sense, but the central performance by Michael Shannon is earth-shattering.  There is a sensitivity in his nuanced mannerisms to early onset schizophrenia.  I was also impressed with the positive light treatment and family support play in this character's tragedy.  It is oddly uplifting and inspiring.",
      "total_reactions": 0,
      "user": "eliotwalnut"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "I think you're gonna either hate it or love it. I loved it. Especially the ending, because it got me thinking about how many dream/visions he had that were true (or going to come true, like furniture suspended in mid air if your whole house blows away!). Like his best friend attacking him. Notice his wife was only in ONE dream, she didn't do anything AND THAT WAS WHAT TERRIFIED HIM! I hope there's a sequel to this movie, because they have to try to get back to that shelter... and fast. And everyone is going to try to bust in on him and his daughter.",
      "total_reactions": 0,
      "user": "Maves"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2016
      },
      "score": 7,
      "text": "A film best viewed at home as it is slow in pace and requires the viewer to be comfortable and able to pause if distractions arise. While the pacing, length and questionable resolution are all valid criticisms - Shannon's performance is spot on captivating. A fair trade indeed. Your time in exchange for a remarkable (if not a bit disturbing) interpretation mental illness.",
      "total_reactions": 0,
      "user": "EinRand"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2016
      },
      "score": 8,
      "text": "This is one of the best films I've ever seen on mental illness or schizophrenia, and should be up for oscar nods this year just for its educational value, if nothing else. The up-and-coming Jessica Chastain from \"Tree of Life\" is marvelous along with Michael Shannon and Kathy Baker here in giving this very original story a life.",
      "total_reactions": 0,
      "user": "pdw123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2017
      },
      "score": 0,
      "text": "Dans le genre peu répandu du film \"suis-je fou, Docteur ? enfermez-moi au cas où !\" Take Shelter est très loin de K-Pax, l'un des rares exemples qui me viennent à l'esprit, lui-même non exempt de quelque défaut comme... la mollesse. Mais si K-Pax avait parfois sa léthargie, alors Take Shelter n'a même pas deux de tension : il est si lymphatique et si mou qu'on tombe comme une masse rien qu'à essayer de le regarder.",
      "total_reactions": 0,
      "user": "Broyax"
    }
  ]
}