{
  "mc_avg_user_score": 6.0,
  "mc_metascore": 49,
  "mc_mixed_rating_frequency": 221,
  "mc_movie_name": "Terminator Salvation",
  "mc_negative_rating_frequency": 137,
  "mc_positive_rating_frequency": 305,
  "mc_pro_critic_reviews": [
    {
      "critic": "Simon Edwards",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2015
      },
      "score": 80,
      "summary": "The Terminator story recharges with a post-apocalyptic jolt of energy. Frantic and full of welcome ties to the past, it also ploughs new ground with purpose."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2015
      },
      "score": 60,
      "summary": "Director McG proves perfectly adept at blowing things up in interesting ways, but there's not so much acting here as there is yelling at different volumes."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2015
      },
      "score": 60,
      "summary": "Terminator Salvation is one of the most visually impressive films in the series. The action is non-stop and the look borders on dazzling.... But ironically for a series that's supposed to be about an embattled humanity struggling against those who lack it, there isn't an emotional moment in this."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2015
      },
      "score": 50,
      "summary": "Terminator Salvation is a tale told idiotically, full of sound and fury, signifying nothing."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2015
      },
      "score": 50,
      "summary": "Not only does the largely disposable Terminator Salvation fail to advance the franchise's overarching rise-of-the-machines storyline (a better title: \"Terminator Stagnation\") but, worse, it never manages to distinguish itself from any other reasonably budgeted action film."
    },
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2015
      },
      "score": 40,
      "summary": "Terminator Salvation isn’t the gritty, futuristic blitzkrieg for which fans of the first two films have been salivating. It isn’t even the slick, entertaining Hollywood blockbuster most were realistically expecting. It is a shambolic, deafening, intelligence-insulting mess, a crushing failure on almost all counts."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2015
      },
      "score": 40,
      "summary": "Missing is Cameron’s signature action modification, best exploited in Aliens: the strapping female heroine. McG’s testosterone-juiced world feels a little doomed without her."
    },
    {
      "critic": "Laremy Legel",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2015
      },
      "score": 35,
      "summary": "The sound is great, the explosions are great, the look and feel could have been turned into something special. It’s the words and plot that are huge negatives here."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2015
      },
      "score": 30,
      "summary": "What's lacking is the sense of emotional balance and urgency that the original Terminator, though just a B movie, was blessed with--the quality that earned it fans in the first place."
    },
    {
      "critic": "Sukhdev Sandhu",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2015
      },
      "score": 20,
      "summary": "It’s a catastrophically bad movie whose aggressive dullness and dumbness can best be reproduced by picking up a brick and slamming it against one’s forehead for two hours."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2015
      },
      "score": 20,
      "summary": "With much buzzing, beeping and whirring, the Terminator franchise comes to an absolute creative standstill, or even goes clankingly into reverse, with this fantastically dull fourth episode."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2015
      },
      "score": 3,
      "text": "Terminator Salvation does little to salvage the franchise providing another loud, dumb, and unnecessary film in the Terminator franchise. While the story is not a straight up retread of the previous films it is uninspired filled with tons of tropes; loud and dull action; and thiny written characters whose arcs are predictable and as lifeless as the machines they are fighting. A gritty Terminator film set in the future in a prequel sequel isn’t a bad idea but without anyone interesting to connect with or action scenes that are shot well the film falls on its face. Even if the film is entertaining at some level it lacks any staying power and will be forgotten about shortly after one leaves the theater.",
      "total_reactions": 1,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "While I didn't think this movie was as good as the first two, I thought it was way better than the 3rd film. The acting was great, the story was well told and tied into the story arc well, and the effects were incredible. It really is impressive to watch all four films over a short period of time. You really appreciate how far the technology has come. I thought they did a great job with the setting and overall feel of the environment. I also thought that the concept of Sam Worthington's character was really interesting and the \"Arnie\" cameo was pretty sweet. There were some things that I wasn't a fan of however. I thought they tried to add too many new little gizmos for Skynet. I also thought the ending seemed a bit weak and almost like an afterthought. They have paraded around the concept through the entire series of your \"fate\" not being set and yet the series is always determined on never wavering from the future laid forth in past films. While the argument can be made for that logic, it can also be made countering it. Lastly, while I thought the casting for Kyle Reese was fantastic, I thought having Bryce Dallas Howard play the role of Kate Connor was a terrible idea. Not only does she look nothing like Claire Danes but she also looks way too young. The timing just doesn't feel authentic at all. Shoot, they could've just used Claire Danes and kept the continuity completely. I doubt she was too busy since she hasn't really been doing anything major. Also, while she would still be young, at least she's a bit older than Howard is and they could've always made her look a little more aged. If you can make a robot look like the spitting image of Arnie, I don't think adding a decade or so to Claire Danes would've been too much of a challenge. Overall though, this was a very good movie and definitely fit into the series well. While they have yet to really show why John Connor is a threat in the first place or to show the resistance make even a dent in Skynet, they at least hinted towards a possible light to end the darkness with the frequency concept. I don't know if they're ever going to make a fifth film or even reboot the franchise which seems to have become the rage these days but if they do neither, at least we can more or less figure out how things unfold from here.",
      "total_reactions": 1,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "GOOD: The main cast for the most part do a terrific job and you can really feel the sense of dread they were going for. BAD: All of the supporting cast (except Michael Ironside) just seem bored and half asleep most of the time. GOOD: Sam Worrthington is great in the lead role as Marcus. Bad: Christian Bale's John Connor is a generic one dimensional soilder. GOOD: The plot is really great and interesting. Bad: The subplot of the frequency that can shut down Terminators doesn't really go anywhere. GOOD: The action scenes and effects all look and sound great. BAD: The final battle is a bit lackluster",
      "total_reactions": 1,
      "user": "starscream97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2014
      },
      "score": 4,
      "text": "A huge disappointment for Terminator fans like me. The story was week and the acting was poor (with the exception of Christian Bale). However, the action was exhilarating and the special effects were stunning but that isn't enough to balance with the movies poor story. Terminator Salvation was OK at best. It felt like a generic action movie.",
      "total_reactions": 1,
      "user": "demolisher7778"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2014
      },
      "score": 4,
      "text": "could have been so much better, this film is  watchable but nothing more, plot is weak and not enough violence that you would expect for a terminator film. and WTF were they thinking? NO ARNIE!!!!!!",
      "total_reactions": 1,
      "user": "ThomasC"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "MacG's \"Terminator: Salvation\" doesn't offer anything new; just story and action revolving around wars and battles, In the end, the movie is just a CGI bridge in the Terminator series.",
      "total_reactions": 8,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "first things first i have to bring this up, why is Christian Bale acting like hes still in batman? lol.. GOOD: the action sequence, the acting, the setting, they picked perfect actors and the robot effects was amazing",
      "total_reactions": 2,
      "user": "Sikoandr"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 2,
      "text": "A very disappointing mess of a film.  I am a big Christian Bale fan but not even he can save this loud, pointless, and just dumb film.  The visuals aren't bad, but everything else is.",
      "total_reactions": 2,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "I am wondering why actors like Bale and Worthington confirm to such a film with bad screenplay that is apparently not at all action packed but instead laughable. Without Arnold Schwarzenegger the obvious ridiculousness is missing which is not a matter to replace that with usually good actors who make a complete fool of themselves in \"Terminator Salvation\". Part four was an opportunity to get rid of the trifle that Schwarzenegger caused in previous parts. But no, that would have been too shrewd. Instead of that a Schwarzenegger copy appears and fights with Connor...",
      "total_reactions": 2,
      "user": "mailinh"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2014
      },
      "score": 3,
      "text": "So here we have yet another cynical attempt by Hollywood to make money on old property. T1 and T2 are classics. They raised my standards of what an acceptable action movie is. T2 wrapped up the story so well that T3 should have never existed, but it unfortunately does. After so many years since the unnecessary T3, I was really surprised that this came into fruition. Surely I thought they would have a really solid justification for bringing this back. They didn't. I'm not even going to criticize the movie for being directed by a total hack, or the lack of involvement from Schwarzenegger -- I'm just going to dissect it for what it is, and it still sucks pretty bad on its own. T1 and T2 had this pseudoscience that was fictional, but consistent: in other words it made up it's own rules per say and stuck to them. The fact that judgement day was prevented in T2 means that the post-apocalyptic setting of this movie is a flaw in itself. It just doesn't make sense. The only way this could have some coherence is if it was stated it takes place in some type of hypothetical scenario or another dimension or something of that nature, but this movie is adamant that it is a direct sequel. Due to this, comparisons to the original 2 (or even T3, which is a bad movie, but better than this) are bound to arise. And this is what dooms the movie among various other things. One of those things is the awful casting. Every character (with the exception of Yelchin, who was just OK) seemed out of place, like they belong in a soap opera. My biggest rant in this context is Christian Bale. It's apparent that they needed to snag at least one hugely popular actor for marquee value, but oh god is his performance terrible. His gravelly Batman voice/mannerisms do not translate well to this one. He just comes off like a complete douche bag: in every scene  he has this exaggerated sternness, which is obviously meant to convey that this is a very intense and serious movie, but it has an adverse, almost comical effect, not to mention that this one's rated PG-13 anyways. That might seem small, but the fact that they included a PG-13 installment in an R-rated franchise makes me (correctly) assume that the studio ultimately just aimed to make money with this movie, and nothing more. Catching this notion seriously cheapens the \"experience.\" Throughout the movie I was seriously irritated with the sloppy editing and bad dialogue. The whole thing just stank of this made for TV quality that's hard to explain, but also really cheapens the experience. This movie just simply lacks any charm or personality: it's an overproduced mess and should never have been, but studio greed has cemented yet another bad Terminator movie  in the series. If you're even slightly interested in this series, watch the first 2 and forget this and 3 even exists...",
      "total_reactions": 2,
      "user": "PrivateJoker"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "Apparently, Christian Bale hasn't been told he's one of the great actors of his time. I'm sure if he had been, he wouldn't be wasting his time and energy with this incoherent swill.",
      "total_reactions": 3,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "Terminator Salvation is a fantastic action movie. One of the best of the series. The only downside? Sam Worthington. The guy just can't keep a steady American accent. Everything else was beautiful. The cinematography, the action sequences, the acting, etc.",
      "total_reactions": 1,
      "user": "EliteF50"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "The first Terminator to take place almost entirely in the legendary future conflict between man and machines. After three movies taking place in the past (present?) that only gave us glimpses into what the future looked like, it's nice to see a movie that actually takes place during that chapter in the war. Even if it isn't how we were told it would look.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2011
      },
      "score": 6,
      "text": "Everything about this movie is average. Acting, story, cinematography, sound... actual the special effects are mostly good, but still. This movie is nowhere close to the caliber of the original terminator movies. It has its flashy and cool moments but in the end feels shallow and mostly forgettable. The governators cameo was amusing. Overall it's better than alot of whats in the theaters these days, but don't go out of your way to see it",
      "total_reactions": 2,
      "user": "Zorgly"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2011
      },
      "score": 3,
      "text": "Don't be back! This movie had a cool effects bit, but the main character is a terminator himself! You'd figure he'd be under skynet control! And you'd think that the not being hungry or not felling anything would give something away!",
      "total_reactions": 2,
      "user": "WykedEvil"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2012
      },
      "score": 4,
      "text": "Terminator Salvation promised to finally let us loose in the nightmarish dystopian future we've only seen glimpses of so far in the series. Yes, the entire film is set after the machines have risen up and destroyed the vast majority of human civilisation, but does this make for a tense and exciting film? No, not really. In all the other installments (including the underwhelming Terminator 3) you have the constant sense of jeopardy, that judgement day is coming, and that made for some brilliant tension. In Salvation, however, all that doom has already occurred, and all that remains is the gloom. The storytelling is pedestrian, McG's action direction is competent but uninspiring, the new models of terminator we see look like rejected designs from the Transformers art department and most of the actors look like they're in it for the money alone. Christian Bale shouts and Batman growls his way through the film playing an older John Connor, Bryce Dallas Howard is wooden as John's pregnant wife Kate, Moon Bloodgood's pilot is just the typical warrior woman with truly ridiculous tousled hair and Michael Ironside really stretches himself playing yet another stern military leader. At least Anton Yelchin is decent as a young Kyle Reese and Helena Bonham Carter is good as always when she's briefly on screen as a terminally ill Cyberdyne scientist whose actions instigate many of the film's key events. The real highlight of the film, though, is Sam Worthington - his character Marcus is an incredibly tortured soul, and a fascinating tribute to numerous icons of film and literature - everyone from Frankenstein's Monster to Jason Bourne is in there somewhere. He makes for an utterly compelling protagonist in the hands of Worthington who manages to make Marcus tough and gruff, but also incredibly sympathetic. It does annoy me that the original idea for the film had Marcus as the central character, until Christian Bale was cast as John Connor, prompting the script to be re-written to focus on him instead. The original film concept would have certainly resulted in a more satisfying final product, as though John Connor is undeniably at the centre of the Terminator saga, he's not a particularly interesting character in himself. Aside from showing Sam Worthington at his very best, and having quite an entertaining finale that has some crowd-pleasing callbacks to earlier Terminator installments, Salvation offers very little apart from grey visuals, moody pessimism and a predictable plot. You only have to re-watch James Cameron's masterful first two installments, and even the flawed third film in the series (which still offered the odd thrill and plentiful camp humour) to see how much the glowing cybernetic eye has dulled over the years. Perhaps it's because of the absence of Mr Schwarzenegger, perhaps it's because there's no time travel, or that all the interesting stuff has already happened by the time film begins, or maybe it's because Christian Bale threw a tantrum and McG has very limited talent. Whatever the reason, Terminator Salvation is a rather dull film, which is almost worse than being a bad one. Is this the death of the Terminator franchise? I almost hope so.",
      "total_reactions": 1,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2011
      },
      "score": 1,
      "text": "\"Terminator: Salvation\" One Line Review! \"D\"",
      "total_reactions": 1,
      "user": "LevelsAndGear"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2011
      },
      "score": 6,
      "text": "Continuing to spread ever-thinly the narrative of it's progenitors, this Terminator sequel is an enjoyable couple of hours that nonetheless falls apart if you even dare to engage your brain for more than a fraction of a second. It would've been more interesting to have the story disregard John Connor and focus solely on the Marcus character; the machine-in-search-of-humanity thematic is one of my favourites in Science Fiction literature, the film manages to keep this concept interesting for about 10 minutes, then it degenerates quickly into typical action fare,",
      "total_reactions": 1,
      "user": "AlienSpaceBats"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2011
      },
      "score": 3,
      "text": "A Schwarzenegger-less disappointment. Terminate it, because really, it makes most sense that RISE OF THE MACHINES would be the final movie (making it a trilogy)--especially with the ending it has.",
      "total_reactions": 3,
      "user": "Spielberg00"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 4,
      "text": "I thought it was... okay. Felt like an average summer blockbuster, which is exactly what all the reviews prepared me for. McG is definitely no James Cameron, as if we needed further evidence.",
      "total_reactions": 1,
      "user": "Delta_Assault"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2011
      },
      "score": 0,
      "text": "This movie was not good. At all. Open heart surgery in the desert? Who? Who does that? Killing off the ONLY human (he wasn't actually human) character in the movie? Why? He was the only one with redeeming qualities. YOU DON'T GIVE ARNOLD A GUN to kill your primary targetg!? Instead you ask him to throw the herald of your demise around as softly as possible so that he doesn't die from internal bleeding, a severe concussion, etc etc.",
      "total_reactions": 1,
      "user": "MattCarterWA"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2012
      },
      "score": 2,
      "text": "This movie needs to be terminated. Without Arnold this series has no point in watching. A truly ugly film with a setting that doesn't even look like earth. The whole movie was just a bunch of dreadful noisy crap with terrible acting all around.",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "Due to its very nature, in making a film of the post nuclear war against machines between the Resistance and Skynet, director McG was already onto a hiding to nothing. James Cameron's films featured an occasional shot of the war but were always based around a single Terminator relentlessly pursuing its targets as part of an intelligent time travel plan. By focusing on the war, what made the previous films successful is lost. Connor and Reese fight against motorbike terminators, hunter-killer planes, aerobots and giant terminator robots, proving successful against them all. To say the tension is missing would be an understatement. Bale does his deep Batman voice thing, less forgiving here, and in places the script suffers from cheese overload in places, none more so than Connor stealing (or a lazy tribute to) Arnie's seminal line, 'I'll be back'. This was almost too much to take. Yelchin is also given some equally cheesy lines that seem out of kilter with his character's previously strong willed and determined nature.",
      "total_reactions": 1,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "It does not have enough character development, but it offers us plenty of exciting action. The first half was dull at times and disappointing, but the second was an improvement. What it needs is more emotional scenes between characters.",
      "total_reactions": 1,
      "user": "Official"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "THIS REVIEW IS FOR THE DIRECTOR'S CUT. I can see the hate on Terminator Salvation compared to James Cameron's films due to the weak writing and the fact its PG-13 but to all you haters on Metacritic, see the R-Rated Director's Cut - It is so much better than the theatrical PG-13 version. McG just cut out the R-Rated material to give it a PG-13 rating which I know, is stupid because what he cut out were important plot points and character development, nudity, and R-Rated material violence is added that includes blood and someone being stabbed with a screwdriver. McG even cut out some character development between Blair Williams and Marcus Wright and John Connor which made the film thin on writing. Terminator Salvation doesn't capture a lot of what made the first two great or Rise of the Machines visually amazing but it is time for a new formula in a new setting. Besides, the whole \"Send a Terminator back in time to kill the main character but send another Terminator to protect him/her leading to action\" formula was kind of getting tired in the script of Rise of the Machines but hey, there's actually pretty good character development in Salvation even though the script could of been better and more powerful and less thin. Also, why was it lacking substance for Marcus Wright and the Terminators? Sam Worthington was actually flawed but good at his performance as Marcus Wright. James Cameron recommended to McG to have Worthington join the cast, and plays a good infiltrator that has a perfect conflict to his character: Being determined to be an Infiltrator-Terminator by SkyNet or stay as his human self. He was executed in 2003, then reborn as an Infiltrator during the War Against the Machines but his living brain and heart still remains in his body not knowing he was recreated as a Terminator-Infiltrator. Marcus Wright was actually good character communicating with the Resistance and SkyNet when joining the War Against the Machines and facing his conflict of human or infiltrator. Christian Bale was pretty good as John Connor to. He was right for the role of playing John Connor in his 30s as a Military Soldier - better than Nick Stahl in Rise of the Machines. Terminator Salvation is an important to the Terminator franchise. Why? Well, remember in the first when Kyle Reese was sent back in time by John Connor to protect Sarah Connor from the T-800? John Connor has to meet him so he can send him back in time in the future and Kyle can impregnate Sarah so John Connor exists and it shows where the T-800s modeled after Schwarzenegger came from. It also gives a reason why the T-800s in the first two and the T-850 (The infiltrators Arnold Schwarzenegger played) were sent back in time from the 2020s since Terminator Salvation is set in 2018. Though the ending was bit corny when John Connor almost lost his life to the prototype T-800 that was played by Roland Kickinger as Schwarzenegger them Marcus Wright gave him his heart so he could continue fighting the machines in the war but it was a decent resolution giving the audience the message that everyone deserves a second chance (This scene is expanded in the Director's cut with nudity and more violent material) The Director's Cut of Terminator Salvation is Rated R for some violence and brief nudity.",
      "total_reactions": 1,
      "user": "MovieBuff36"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 4,
      "text": "Good looking and boosted by kinetic action, but the script is life-threatening stupid. Any machine with such a muddled, non-functional master-plan has to fail against even a completely unorganised human race. Characters are underdeveloped and the dialogue is barely okay. Christian Bale roars more than he speaks, which becomes quite annoying after some time. But as you expect it from director McG, the untalented cousin of Michael Bay, this is flashy, stupid fun.",
      "total_reactions": 2,
      "user": "Jailhouse_McGee"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "Também não é brilhante como T1 e T2 mas Terminator 4: Salvation supera e muito Terminator 3.",
      "total_reactions": 2,
      "user": "LoRevisor"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2013
      },
      "score": 3,
      "text": "A CG Arnie goes to show how this film lacks the heart of the originals, and covers it up with special effects. The problem is it gives the unique atmosphere that worked in the earlier ones a blockbuster twist, losing it completely.",
      "total_reactions": 1,
      "user": "KaptainHutchino"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2014
      },
      "score": 0,
      "text": "McG just killed the Terminator franchise, **** him, nothing that made the first great is here, the action is just like Transformers, **** is all over your face, there is no Arnold, or even a menacing villain like the T-1000 from T2, no just get an endless **** storm of lame CGI “terminators\", the script couldn't be more cliched, the characters are bland, Christian Bale doesn't have any of the charm that John Connor had in T2 instead he just becomes a clichéd character, who has no chemistry with anybody, the same goes for Sam Worthington, the whole movie just felt pointless, and a shameless attempt to cash in the Terminator franchise without putting any effort, which at least Terminator 3 had some effort this piece of **** however didn't.",
      "total_reactions": 1,
      "user": "Leo9127"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2015
      },
      "score": 8,
      "text": "I liked this move. I thought it was a great revamp of a tired franchise. Bale was a great addition fresh off his Dark Knight boost. I thought the ending was rushed and implausible, but hey, that's the future and maybe they could do a medical procedure that quickly. I watch it periodically.",
      "total_reactions": 1,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2011
      },
      "score": 6,
      "text": "The weakest of all the Terminator movies. Seriously, no Arnold? As for the plot, it felt like it was supposed to be for a Terminator video game, not a full-length movie. At least the movie had great action scenes and solved a plot hole from T3, the reasons why I gave this movie a passing grade of 6. But if they're gonna make a T5, they better focus on what made the first three great, and get Arnold back!",
      "total_reactions": 0,
      "user": "gm101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2011
      },
      "score": 2,
      "text": "This was a dissappointment and the worst, by a long shot, of the series.  Terrible, poorly written screenplay.  Cheesy characters, and one of silliest endings I've seen. This one is loser in what had been one of my favorite sci-fi movies series.  I hope the people involved in this never make another movie.",
      "total_reactions": 0,
      "user": "bikeman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "I made the mistake of taking notice of the bad reviews Salvation got, which lead me to delaying purchasing this film.",
      "total_reactions": 0,
      "user": "danielb1982"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "Terminator Salvation might not be the sequel that most Terminator fans will be looking for, but its full of action packed scenes which will leave you in suspense and wanting for more. The storyline takes place in the somewhat distant future from the previous movies and explains on the origin of the original Terminator, however with known foresight by the main character John Conner after his adventures in T2 and T3.",
      "total_reactions": 0,
      "user": "BasilZero"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2012
      },
      "score": 5,
      "text": "A clichÃ©d film brought down by a mediocre script riddled with plot holes. Bale unfortunately struggles in his role as John Connor, but it is somewhat elevated by the performances of Sam Worthington and Anton Yelchin. There are so many missed opportunities in this film, and while there are good CGI shots and battle sequences, the formula for these films is beginning to feel tired.",
      "total_reactions": 0,
      "user": "pauljohnson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2012
      },
      "score": 6,
      "text": "Not as bad as people who hate it say it is. It's actually decent. I know the story revolves around the war against the machines but at least there is some pretty good character development between John Connor (Christian Bale) and Marcus Wright (Sam Worthington) who also have pretty good performances. Bryce Dallas Howard was also perfectly cast as Kate Brewster. Besides, at least its a sequel that continues John Connor's prophecy as the leader of the resistance who defeated the Terminators in the war. It also provides solid PG-13-style entertainment.",
      "total_reactions": 0,
      "user": "Jedi_Jettson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2014
      },
      "score": 9,
      "text": "I have never watched the other Terminator movies - at least not well enough to remember them - but the lack of Schwarzenegger AND the presence of Bale & Worthington definitely made me want to watch this one. And I don't regret it for a second!",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 6,
      "text": "Sam Worthington made this film, That was the one thought I kept when I watched this film because it was true. He outshined everyone easily and this film was easily the film that sort of launched him into the spotlight. Christian Bale was solid ,as was the rest of the cast, and the action was good. Yet the plot was just too boring and wasnt interesting, It was rather tough to sit through. Its just a solid action flick imo.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "This wasn't a poor film it just didn't live up to the standards set in the first two. Still I thought it was a solid film with a fairly clever idea. I enjoyed it and would happily see a fifth one if it is ever made.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "This film ruined the whole terminator story, Kyle Reese hadn't been sent back in time yet so Skynet wouldn't know who he was and when Skynet tells Marcus that he had killed John Conner something that Skynet had been trying to do for years well no time travel had taken placein the future yet so how would Skynet know that they'd been trying to kill him for years, apart from that it was a good change to have it set in the future instead of basically the same storyline with the previous 3.",
      "total_reactions": 0,
      "user": "JayJP"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "Christian Bale's performance in this film surprisingly saves it from an otherwise tastelessly written film.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2013
      },
      "score": 5,
      "text": "Even worse than Terminator 3 Rise of the Machines. Terminator Salvation is a stupid science fiction action movie. The first 2 movies were clever science fiction movies. Explosions go off and the directors want you to be excited, but your not because it's just Bruce Wayne meets the guy from Avatar and  hits the fan. There are some scenes which will please old school Terminator fans and people just looking for mindless action. But there all about 30 minutes apart and are too infrequent to redeem the rest of the film. Terminator Salvation is a stupid science fiction movie with NO MEMORABLE LINES WHATSOEVER which is the exact opposite to the first two movies and overall it reminded me of Transformers Revenge of the Fallen drunk.",
      "total_reactions": 0,
      "user": "python2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "Rewatched it recently on BD. And we are finally in the future where this big war between humans and machines is waging expect there is not much to see. Yeah it has action but the story is lame.",
      "total_reactions": 0,
      "user": "Tessara_Vejgan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "love this film mostly christian bale`s performance, just love it. the story is very very nice, music just awe..................................................................................",
      "total_reactions": 0,
      "user": "crytech"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "A much different but interesting take on The Terminator universe.  Which gives the franchise that new direction it needed and gave the franchise that new life and energy.",
      "total_reactions": 0,
      "user": "J24O1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "An action-packed continuation of the Terminator franchise, that might not be as glorious, but still great! Don't listen to the bad reviews!!!",
      "total_reactions": 0,
      "user": "TheApplegnome"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2014
      },
      "score": 4,
      "text": "A quite unfortunate attempt to be a revamp of the gone franchise. Without Arnold returning they relied on a CG cameo of his muscled form as well a convoluted amount of characters and effects. Sam Worthington was the only selling point of this film.",
      "total_reactions": 0,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "This series has finally managed to terminate itself. Why the casting directors chose Christian Bale, I will never understand. He's basically Bruce Wayne in a post-apocalyptic world, somewhere he doesn't belong. The plot is too long and drawn out, with way too many explosions and not enough Arnold. The only redeeming quality about this film is the performance from Sam Worthington, which is the only thing about this flick \"worth\" watching. He is the reason why this movie recieves a 4, because everything else is a rotten sandwich in a dirty toilet.",
      "total_reactions": 0,
      "user": "TimeOfTheChimps"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2015
      },
      "score": 3,
      "text": "The weakest output from the Terminator franchise, \"Terminator Salvation\" is an exhaustingly boring, poorly paced and un-interestingly plotted action film that doesn't appreciate the efforts of its charismatic cast.",
      "total_reactions": 0,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "Después de la película medio decente de Terminator 3 tenemos otra película después de 6 años, valió esperar? Pues esta película fácilmente supera a su predecesora. Aquí vamos al futuro, nos muestran como se mueve la guerra durante el futuro, no es el mismo visto en Terminator 1 y 2. Lo cual es comprensible, es 2018, por lo que se puede perdonar que vallan de día y aun no hayan lasers, de hecho, las maquinas tampoco tienen lasers ni modelos avanzados de Terminator, por lo que si Skynet no crea los lasers lo que queda de humanos no lo harán. Aquí tenemos 2 perspectivas, la de la resistencia y la de los supervivientes, el personaje Marcus nos muestra los supervivientes mientras que John nos muestra el lado de la resistencia. Termina siendo interesante ver este futuro, en T1 y 2 solo nos mostraban trocitos, por lo que si te gusta la saga podrás disfrutarla. Eso si, hay algunos agujeros argumentales, como por que no matan de inmediato a Kyle Reese para que John no naciera... Tal ves por temor a destruir la realidad? El viaje en el tiempo y si el no protege a Sara entonces John no nace pero en T2 que paso... Es mejor así para ser sincero. Pensaba darle un 08/10, pero el final es muy cliche y la película seguro se vuelve algo aburrida la 2da vez que la veas. Por estos motivos le doy un 07/10, es una película que supera a la anterior muy fácilmente pero no llega a ser de lo mejor por unos pocos y lamentables detalles. Si eres fan de Terminator seguro la disfrutas mas que T3.",
      "total_reactions": 0,
      "user": "Larry223"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "No entiendo las malas críticas. Esta es de lejos la mejor película de Terminator, olvida las entregas de Arnold, T4 ofrece acción de la buena y, al fin, la trama es interesante de verdad.",
      "total_reactions": 0,
      "user": "CPD98"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2015
      },
      "score": 6,
      "text": "First of all this movie is no where near as bad as many critics will tell you, the acting isn't the worst in fact the leads are pretty good. The action is also fantastic using a surprising amount of practical effects for the Terminators and explosions. Downside is the writing isn't that good, which is why a lot of people don't like this movie. Personally I think it's much better than Terminator 3 even with the lack of Arnold Schwarzenegger as the titular character because at least this one does not look like a made for TV movie.",
      "total_reactions": 0,
      "user": "NotoriousFraud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2015
      },
      "score": 3,
      "text": "Terminator Salvation is what nearly killed the franchise forever. Unlike T1 and T2, this movie is entirely soulless and has no heart or likability to the characters, who come across as bland and uninteresting. Not to mention, it directly contradicts things that have been firmly established in Terminator lore. For example, why the heck is John Connor, the LEADER of the human resistance and mankind's last hope, taking ORDERS from some random douchebag??? In addition, at one point, a T-800, which was DESTROYED once covered in molten metal, rises up after having a huge vat of what is likely molten steel dumped all over it and starts chasing after John again with no negative repercussions.  Also, Christian Bale gave in this movie apparently what was him method acting from The Dark Knight. In other words, he was almost like a gruff sounding Keanu Reeves. And Sam Worthington. He was decent in Avatar. In this, not so much.",
      "total_reactions": 0,
      "user": "SkyrimGuy935"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2015
      },
      "score": 4,
      "text": "Terminator Salvation plays more like a typical modern blockbuster than a Terminator film with its huge production values paired with one-note characters and military jargon.",
      "total_reactions": 0,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "Ehh... This movie was a mixed bag for me. It had good acting but a terrible plot. But the special effects and Christian Bale literally save this movie. Overall an OK Terminator movie but it is also unnecessary and messy. 5/10 (mediocre)",
      "total_reactions": 0,
      "user": "Le__Xenomorph"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2016
      },
      "score": 6,
      "text": "Christian Bale hacks a Terminator by plugging a USB to his phone. That's what this movie is. Loud, dumb, entertaining, but no actual logic or character development. No Arnie. There are some cool T-800 scenes, but for the most part the movie is just loud and wants to entertain you. It did entertain me, but for a story perspective or character or anything like that, it has pretty much nothing else but the backstory of the main characters. It's alright, watch it if you want, but it's not necessary.",
      "total_reactions": 0,
      "user": "LinttaFlamingo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "Let's talk about names. Character names, to be specific. As much of a rabid fan of the first two Terminator films as I am, I have always been bewildered by James Cameron's inexplicable saddling of the potential savior of all mankind with the brown-envelope-bland moniker of \"John Connor.\" It's akin to calling Bruce Wayne \"Tom Smith\" or having to refer to Arnold Schwarzenegger (now there's a name for you) as \"Governor Arnold **** There's zero zip, nada panache; it just doesn't have the requisite hero ring to it. John Connor sounds like the name of a high school gym teacher. The wiry, wily Connor (Bale), who, in this equally ill-titled Terminator Salvation, is on a mission to locate and protect the life of his future father, Kyle Reese (Yelchin), is a model of post-nuclear industriousness, commanding a truly ragtag global resistance (via shortwave radio) against the self-aware machines of Skynet and their killer cyborgs, the Terminators. (At this point in the apocalyptic, time-traveling, man vs. machine mythos of the franchise, the year is 2018, and the parent is roughly half his son's age.) Connor has his grimy mitts full. But the name thing still rankles – and it can be extended to the director of Terminator Salvation: McG. The nickname (I assume it is a nickname) smacks of unintentional, comic mediocrity, as in McDonald's, McJob, McHammer, et al. McG previously helmed the wiseass-fun Charlie’s Angels in 2000 and hasn't done anything for my adrenaline centers since then. He stages action sequences with grand aplomb, though, and in this, at least, Terminator Salvation is worth its admission price … but only just (and it'll help if you slam a few sucrose-infused Apocalyptic Ice Slurpees – the film's tie-in with the venerable 7-Eleven summertime sugar bomb – in advance of taking your seat. There's a great sequence – the only great sequence, come to think of it – wherein a hulking, three-story, Transformer-esque Terminator tears apart an abandoned roadside gas station (and, ha-ha, former 7-Eleven) that generates some real frisson. But it's pure CGI, and when the dust fades, it still can't hold a candle to the stop-motion and very endearing goofiness of Stuart Gordon's 1990 Robot Jox. (And it never even comes close to the truly unforgettable sequence in Stanley Kramer's It's a Mad, Mad, Mad, Mad World in which an enraged Jonathan Winters demolishes a very similar human outpost while trying to terminate Phil Silvers and Buddy Hackett. Now that's entertainment.) Terminator Salvation, on the other, shinier, more metallic, and thus less human hand, is terrifically dull, full of ear-searing sound design and much yakkity-yakking about the fate of humanity but entirely lacking any sort of soul or sense of good old summer matinee fun. The film is just like its machines, which, by the end of McG's McBlockbuster deserve to win their war against humanity, if only to curtail, once and for all, uninspired and inhumanly mechanistic filmmaking such as this.",
      "total_reactions": 0,
      "user": "MovieManiac83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2015
      },
      "score": 5,
      "text": "I think the only way to describe this movie is that its 'alright'. It's not bad, by any means, but its not very good either. Maybe only having Schwarzenegger as a cameo wasn't the best idea.",
      "total_reactions": 0,
      "user": "BoogeeFilmGuy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2015
      },
      "score": 6,
      "text": "Though the cast did a good job with what was given; Termination Salvation ends up being a downgrade in the Terminator franchise as the effects and the weak charter portrayal bring this film below the previous ones. Overall, for fans of the series this will be a disappointment and for other's this is a good one time watch.",
      "total_reactions": 0,
      "user": "geo333"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "After the dreadful terminator 3.who ruined the franchise forever (remember that i didnt watch genesis yet).my hype for terminator salvation...was mediocre.but when i hitted the start button,the movie becamed one of the best terminator movies.memorable characters,efects,duels,and of course:Mototerminators.They revealed all types of terminator aside from all the 3 we all know in love...ish(TX sucks)The mototerminators that i have mentioned before.the fish terminators.name the type and its on the movie.The bad thing is... less schwarzenegger.Althrough the movie didnt save the franchise,is a great movie.",
      "total_reactions": 0,
      "user": "SuperHyperST"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2016
      },
      "score": 2,
      "text": "Whoever came up with this idea has better get fired right now. No Arnold Schwarzenegger or even the charming from the first two movies. Ultimately the weakest installment in the franchise.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "If sensation alone makes a movie work for you, then this one succeeds on those strengths every 15 seconds.",
      "total_reactions": 0,
      "user": "avamiller21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2016
      },
      "score": 8,
      "text": "Somebody get Mr. Bale a cough drop..please!",
      "total_reactions": 0,
      "user": "WeAreTheJuice"
    }
  ]
}