{
  "mc_avg_user_score": 4.5,
  "mc_metascore": 31,
  "mc_mixed_rating_frequency": 50,
  "mc_movie_name": "Texas Chainsaw 3D",
  "mc_negative_rating_frequency": 67,
  "mc_positive_rating_frequency": 41,
  "mc_pro_critic_reviews": [
    {
      "critic": "Joe Leydon",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2013
      },
      "score": 60,
      "summary": "Helmer John Luessenhop (\"Takers\") and a small army of scripters go back to the bloody roots of the long-running franchise to concoct a better-than-average horror-thriller that relies more on potent suspense than graphic savagery or stereoscopic tricks."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2013
      },
      "score": 58,
      "summary": "The mere presence of a second layer to the story gives Texas Chainsaw 3D an intriguing kick, and it adds a couple moments of visual wit that show a willingness to fiddle around with the genre. Not being irredeemable garbage counts as a modest achievement, but it's a small step in the right direction."
    },
    {
      "critic": "Andy Webster",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "Ms. Daddario is adequate, while Mr. Eastwood, as a lawman, strikes sinister notes. It's nice to see briefly Marilyn Burns, the record-holder in long-distance screaming in Tobe Hooper's original 1974 \"Texas Chain Saw Massacre,\" and Gunnar Hansen, who played Leatherface in the same."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "A sign of how desperate the series' producers have become is that the big twist here is that Leatherface, the slobby butcher-boy demon in his mask of human skin, is now...the good guy. (That's a ''jump the chainsaw'' concept if ever there was one.)"
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2013
      },
      "score": 40,
      "summary": "Stick around through the credits for an extra closing scene that leaves the door of Heather's new home wide open for a sequel."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2013
      },
      "score": 40,
      "summary": "The original \"Texas Chainsaw Massacre\" leaves audiences feeling hollowed out, dispirited and dissolute. Texas Chainsaw 3D is simply a bummer for being a big nothing."
    },
    {
      "critic": "Pete Vonder Haar",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2013
      },
      "score": 40,
      "summary": "Discredit director John Luessenhop for giving us 3-D visuals reminiscent of \"Jaws 3-D\": That slab of meat's coming right for us! Try as he might to honor the original - flashbulb transitions, a skeevy (yet buff) hitchhiker, metal doors, and meat hooks - there's little of its mounting dread."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2013
      },
      "score": 40,
      "summary": "The climax of Texas Chainsaw 3D is a bit more interesting and unpredictable than the usual horror-movie third act. But it feels like it's bred more out of desperation than anything organic; you can sense the gears turning in the screenwriters' heads as they try to figure out a way to breathe some fresh life into this franchise."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2013
      },
      "score": 40,
      "summary": "Unlike the restrained 1974 film which cleverly relied mainly on suggestion, this version piles on the graphic, often CGI-enhanced gore."
    },
    {
      "critic": "William Goss",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2013
      },
      "score": 25,
      "summary": "The most frightening thing about the franchise at this point is that it just keeps on going, undaunted by the characteristics by which the first film made its name. Family is still family and a brand is still a brand, but the blade… well, it’s only grown dull."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2013
      },
      "score": 25,
      "summary": "There's nothing thrilling about summarily dispatching everybody who isn't meant to survive to the credits, nothing entertaining about meathook, hatchet and chainsaw murdering that we've seen scores of times."
    },
    {
      "critic": "George Bass",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2013
      },
      "score": 20,
      "summary": "Sadly, this leap onto the stereoscopic bandwagon marks a new low for the franchise, as far away in quality from the '74 original as it is in years."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2013
      },
      "score": 20,
      "summary": "Time to fire up the critical Black & Decker: Somebody-there are six credited screenwriters-really wasn't clear on the concept."
    },
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2013
      },
      "score": 20,
      "summary": "A clunky, lumbering sequel that, like its masked protagonist, has no redeeming features."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 20,
      "summary": "Texas Chainsaw 3D sees itself as over-the-top and knowing, but what we ultimately get is simply eyes without a face."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2013
      },
      "score": 12,
      "summary": "All the makers of Texas Chainsaw 3D cared about was getting your $16."
    },
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2013
      },
      "score": 12,
      "summary": "There's no deliberate Texas Chainsaw Massacre 2-style comedy to the film, just dim-witted gruesomeness retrofitted with gimmicky contemporary trappings."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "What a stinker!! I seriously don't understand how an army of writers came up with this dreck! I feel bad for the new generation along with no jobs they have to watch pale horrible remakes of far superior originals! Do yourself a favor and watch the original Texas Chainsaw Massacre and forget the rest!",
      "total_reactions": 7,
      "user": "discodirk46"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "The film tries to terror, which is not achieved. It gore and some entertaining and leaves you with a bad taste in vocation.",
      "total_reactions": 3,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "I like it, i will admit it could have been better but it was a good movie and it was fun the 3D was a bonus and  i liked how it had a twist at the end. Overall 9/10",
      "total_reactions": 3,
      "user": "cool1707"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "Texas Chainsaw 3D is a waste of time and opportunity to make a good sequel/follow-up to one of the classics The Texas Chainsaw Massacre, meanwhile, the new Chainsaw delivers chills and thrills, albeit you don't care about the characters nor the story, it gets so bad to be fun, and with the 3D! Its scary as hell. But without any denying, it is definitely one of the worst movies 2013.",
      "total_reactions": 2,
      "user": "MovieGoer14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "Somebody tell those  executives to stop bringing back a franchise that's deader than the characters in the film. Despite ignoring the sequels after the original, it completely forgets what year it's supposed to be set. Making Leatherface into an antihero completely jumped the shark, throwing everything that made the character terrifying shredded to pieces. No horror fan will enjoy this, especially fans.",
      "total_reactions": 1,
      "user": "Tetsuo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 2,
      "text": "I thought this film was going to be gory good time, how wrong was I. This distant sequel (set in a very futuristic \"1994\") lacks the terror of the 1974 original and the brutality of the 2006 prequel and is completely devoid of scares and suspense; Instead you get plenty of unintentional laughs and plenty of moments when you will be face-palming at the onscreen silliness. Yes, this movie did have its fun moments and some nice practical gore in the first half, but then it is ruined by the use of CG gore instead. The film is poorly written, poorly acted and with poor dialogue, though the film has an interesting twist in the latter half but the film makes a silly yet bold turn at making Leatherface, the terrifying and merciless killer, into an anti-hero which will certainly divide fans of the series. In the end, Texas Chainsaw is a disappointment and misses its chance to even have a brutal and terrifying chainsaw massacre in it, instead we get an unintentionally hilarious silly-fest that is poorly acted and written. But we do sometimes get good gore and is a little fun at times along with some good sound design and a nice colour scheme...and also an interesting twist that will certainly divide fans.",
      "total_reactions": 1,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 3,
      "text": "Woah. Well, this movie was pretty sad. It's was very generic and predictable. We've seen it before, the same lines, the same actions, the same plot. It was very disappointing.",
      "total_reactions": 1,
      "user": "ScarTissue1990"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "A slick addition to the horror franchise with good production values and enough tension to keep you on the edge of your seat when you're not jumping out of it. This new film is not half bad picking up from where the original 1974 film left off. For horror fans this more than delivers. The first hour is well modulated to build the expected tension as the usual array of attractive young teens go through their paces of being terrified, hunted and finally butchered by the fearsome leatherface. The final half hour brings to the fore more everyday recognisable villains, in this case in the guise of the local police force. At this point the film effectively switches our sympathies towards leatherface against the authorities, and whilst this last section doesn't quite pack the punch of the first hour it still keeps you engaged. The film has some great photography, including low slung camera angles and overhead crane shots, which add much to the uneasy atmosphere that pervades the film. The editing also skilfully ensures that we are not let of the hook (so to speak). Let's face it this is the sort of film that gives you exactly what it says on the tin and it certainly touches a primal nerve in me. Anyone going in and then being either disappointed or disgusted obviously have not been discerning enough about their choice of movie.",
      "total_reactions": 1,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "A decent addition to the TCM films, but it unforntuatley had its flaws. Good setting with a good range of characters and storyline, but some of the deaths were a little disappointing and predictable, as were some of the twists also. It had it's ups and downs as far as the excitement and entertainment went, but I certainly wasn't bored at anytime while watching it. I think the two more recent TCM films from the 2000's that came out were better than this one, but Horror fans should still enjoy it.",
      "total_reactions": 1,
      "user": "survivorfan989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "Texas Chainsaw 3D is just a mess of a film and shows how Hollywood just loves to keep horror franchises alive as long as they can.  I enjoyed the original",
      "total_reactions": 1,
      "user": "BreakingBrad"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "Story line is interesting. Very predictable. Trey Songz was very good looking. Had some very scary, unbelievable moments- for the thrill seekers. Over all, the best part of the movie was Trey Songz taking his shirt off;... Take that as you will.",
      "total_reactions": 1,
      "user": "killerbee41895"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Texas Chainsaw 3D was awesome. Despite the fact that its 31 Metascore has let itself down, this film was great! The horror was the great element in this film. Horror lovers will crave this one...",
      "total_reactions": 1,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "What a way to kick off 2013 an awful film mixed with one of the greatest lines in movie history.  Do your thing Cuz comes after they try and make leather face a compassionate character.  Yes the same man who slaughters people with his chainsaw and wears their skin, that is how stupid this movie is.",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2013
      },
      "score": 4,
      "text": "This film could've been good. But overall terrible story telling, no scary scenes what so ever, the horror scenes turned into comedy scenes. Like the Carnival that was high-larious. If your a horror film lover then you will literally want to turn away. If your looking for something to fill in some extra time TURN AWAY. This is only for people who love to watch parodies because this is basically that",
      "total_reactions": 1,
      "user": "MarkMusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "The movie had some really good ideas, but fell short on everything.  The writing in between the key ideas of the movie was horrendous.  This movie also holds the biggest movie mistake I've ever seen/heard of.  It's supposed to be a sequel to the 1974 movie, the setting is supposed to be late 80's early 90's and yet at one point a cop pulls out an iphone.",
      "total_reactions": 1,
      "user": "SylaxSYN"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "This is probably one of the dumbest, most unbelievable films in the series. There is a scene where leatherface chases one of the main characters and she falls not once, not twice, but three times. Leatherface then chases her over a fence into the middle of a carnival, where he runs past about 50 potential victims, apparently set on killing the unbelievably sexy white girl (leatherface must not have approved of her interracial relationship). The girl then decides to grab onto the bottom of a ferris-wheel carriage, because ferris wheels don't go in a circle in her mind. Low and behold, as she is almost to the bottom a cop shows up with a gun. Leatherface throws his chainsaw like a boomerang at the cop.",
      "total_reactions": 1,
      "user": "Iamthejuan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "This is a typical horror flick with a lot of gore and insane situations. As usual with a movie like this, it is going to be polarizing. I am somewhat in the middle with this. I would have liked a bit more originality, but I don't want to jump in the bandwagon and bash it for what it is: \"just\" a horror movie.",
      "total_reactions": 5,
      "user": "BBKing299"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "I am really surprised! I didn't expect that this movie will do its job, and freak me out! A very good movie surprisingly! The 3D is amazing, the acting is good not great, but I had a really good time, eventually the first Texas Chainsaw left me amazed, the squeal left surprised, amazed and freaked out, really well-Done!!",
      "total_reactions": 6,
      "user": "HaithamBayazeed"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "This reboot picks up where the original left off: The only survivor is a baby, who returns as an adult to claim her heritage. After too much dialogue the killings finally begin: bloody, blunt-force-trauma butcherings. Of course, they're more explicit than the 1974 versions, but they still have the same grungy, low-budget brutality. If you liked the original (which is one of my faves) you won't be disappointed. That being said, in striving to maintain the style of the original, they've abandoned any hope of freshness. NOTES: Saw it in 2D and didn't miss anything. STAY THRU THE CREDITS for a final surprise.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "I have been a fan of horror since 1984 so it is by no means something that just happened. I have to say that this movie is unbearably the worst movie when it comes to one of the main characters of horror I have ever seen. The 3d is there to 3 dollars more, was not even good. The scare quotient was laughable. (SPOILERS) The fact that Leatherface is made out to be a anti-hero or when he is thrown his chainsaw and the line \"Do your thing cuz!!\" Was uttered, let me know that horror is truly dead. I have seen more gore out of the Walking Dead series than this movie conjured. I would have to say it is even worse than Next Generation with Renee Zellweger. It was not even campy fun or it's so bad I enjoy it type of movie like some of the Friday the 13ths. Also to have a movie be in the heart of texas and have rap music in it, I know they are trying to sell soundtracks but it takes you out of the experience. Characters are so cliche and come right out of the cardboard cutout of horror. Also if you see a big ass dude with a chainsaw cutting into a coffin, why the hell would you yell out to him not once, but TWICE!?! I hope the Leatherface series is dead and gone after this because this is a character and story that should be left alone. What is sad is that opening credits of the first movie re-done in 3D were absolutely cool to see and if they would have kept up with that through this movie then maybe it would have been better. Actually they should have just re-done the original into 3D and I would have been happier.",
      "total_reactions": 2,
      "user": "Terkovian"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "el director convierte una simple película de terror en un lió familiar que solo ciertas personas lo entenderán  ademas el personaje de cara de cuero no se define si es un villano o un héroe. esta nueva entrega no ofrece nada bueno la serie de películas de la masacre de texas y como una recomendación para la próxima entrega que las películas sean coherentes una con la otra por  que si uno ve las otras entregas no tienen nada que ver con esta.",
      "total_reactions": 2,
      "user": "diego9901"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "A lot of this film proved to be unsuccessful due to its jumbled timeline, its constant stupidly, it's over use of cliché and it's \"twist\" ending. However, there's no denying that it's an enjoyable slasher flick that should satisfy the needs of gore-hounds and is a good way to pass 90 minutes for everyone else.",
      "total_reactions": 2,
      "user": "jackcarlin96"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2013
      },
      "score": 2,
      "text": "Seriously, do I need a Texas Chainsaw Massacre reboot again and again? Truth is, I think the franchise needs to take a break or just retire already. Is New Line the owner of the Texas Chainsaw Massacre franchise? Of course, but not Lionsgate. The same company that bought the Saw franchise into a horror powerhouse is trying to make a mockery of Leatherface. I don't really need to paid $10 bucks to see a baffling but corny reboot that is gonna be in 3-D. Hello, there's nothing new in 3-D. I would rather kill myself if they are gonna make a Leprechaun reboot. Not happening.",
      "total_reactions": 8,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "I hate that i am gonna say this but it was stupidly-comedic and hilarious. It's a fun movie actually, and as a fan, i find it very interesting to see if a 2012 type Texas Chainsaw will work and it did. No scare at all but i don't care, do you? 2 THUMBS UP!",
      "total_reactions": 11,
      "user": "Khen01"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "I don't understand all the bad reviews and i can't understand why all the new horror movies have bad reviews. This film was great. Had great plot and it was really interesting. I can't stand why everyone says don't watch it watch again the original. The original sucks. Get over it. This one is much better and it also has some 3D stuff. Watch it and ignore bad reviews",
      "total_reactions": 3,
      "user": "Kiva"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "Even for a horror movie, Texas Chainsaw 3D takes implausibility to new heights. That's not to say it's unwatchable, but for a franchise that is most appreciated for the unflinching grittiness of its source material and a continuum of creepiness, TC3D features neither of those traits.    The film tries to do right by the original film, picking up moments after Sally Hardesty escapes from Leatherface in the back of a pick up truck, and shows the cops arriving at The Family's farmhouse as a result of the events from The Texas Chainsaw Massacre (1). But the reference to and inclusion of the original's gnarly, almost documentary-style footage only manages to highlight even greater the overall plainness of TC3D; which is to say it looks like The Apparition or One Missed Call. Standard. Plain. More wonkiness ensues as the history it claims to be bound to is suddenly rewritten with the addition of several new family members, including women and children (!) and a handful of un-scary men in overalls, none of whom appeared or were even referred to in the first entry. evidently TC3D's writers confused the original and the remake, the latter having also added birthin' folk to the mix. Well, guess what? It all doesn't matter, since all of Sawyer family are quickly killed when a vigilante group of locals burn down the house, killing everyone inside. That is, all but a single baby girl. Aha!    Fast forward to modern day, where that baby girl, Edith, is now an adult - but also conspicuously not her late thirties, which she would be if the original film truly took place in 1974, which it very openly did. She inherits her grandmother's house in Texas, a place that secretly houses Leatherface in the basement, who summarily kills all her friends shortly after they arrive at the house. This is especially unfortunate as interpersonal tension is built between her best friend and boyfriend, who are together cheating on Edith, but none of that matters because nobody lives long enough for anything to come of it. Indeed, Edith never even finds out about the affair. This ain't The Mist. How Leatherface survived the vigilante townsfolk, or even managed to travel, is also skimmed over. There is a line where someone mumbles \"Maybe he ran out the back...?\" Maybe!    This leads to what is probably the scene that best exemplifies the overall squandered potential of the Texas Chainsaw 3D, as Edith escapes the secluded grounds of her grandmother's home, only to happen upon a well-populated and surprisingly nearby county fair, ferris wheel and all. Fans of the series have long lamented that while The Texas Chainsaw Massacre franchise is super, there has never truly been a \"massacre\" in any of the films. Surely Leatherface entering the fairgrounds, swinging his live chainsaw, will remedy this blight? Nope. Not even a single passerby meets their end at Leatherface's saw. Pity.    Edith survives the attack and is eventually sheltered by the police... But they get distracted amongst each other and she runs away after having discovered their role in the burning down of her family's original farmhouse. It should ne noted that she learns this only after the police leave her alone in a room with the \"Evidence Box\" detailing the original murders, and is so angry at the vigilante townspeople that she writes \"muderers\" over their photos with a red Sharpie. Umm... What? Apparently the only thing she hates more than murderers are people who murder murderers! Yeah!    The movie slows down quite steadily at this point, as Edith now must deftly elude the terminally uninteresting locals, who also want to kill her because they know she is related to Leatherface. Lucky for her, Leatherface becomes hip to their scheme and comes to Edith's rescue just as they are about to kill her at the old abandoned slaughterhouse. As a result, the townsfolk instead turn their aggression towards Leatherface, but then Edith rescues him too. Yes, indeed... she apparently has already gotten over the face that he murdered all her friends only 40 minutes before, and feels tender hearted towards him, due to his \"simple nature\" and, I guess, that sad look in his eye behind the skin-mask he wears over his face. Although the police eventually intervene, they nonetheless allow Edith and Leatherface to simply go back home, despite the carnage, telling them only to \"clean this **** up\" - the most egregious line of the film... in a film full of egregious lines. The last of their clan, Edith and Leatherface do actually return home to start a new, seemingly platonic life together - adding another wasted opportunity of TC3D to seize on the delightful creepiness of the franchise. **** you not, that's how the movie ends.",
      "total_reactions": 4,
      "user": "MateoSanDiego"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "Critics, what can I say about them other then misleading and they probably didnt even see the movie or dont like horror movies and should not even be aloud to rate movies. some of the worst movies I have ever seen got high ratings from critics and low ratings from real people like you and me.",
      "total_reactions": 11,
      "user": "bigfoot6463"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "\"While it goes against my better judgement, Texas Chainsaw 3D is one giant cliche, it falls into every horror category imaginable and brings nothing new to the table. That being said if you actually sit back and relax you might actually enjoy this romp.\"  C",
      "total_reactions": 1,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2013
      },
      "score": 3,
      "text": "Needless 3-D really hurts it. Plenty of gore though and it's certainly watchable. Poor plot though and the movie is hurt even more by the terrible ending. Yet another horror remake that fails to live up.",
      "total_reactions": 1,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "Call me a sucker, but watching this film (rental, minus the 3D trapping that aimed to draw people into theaters) actually made me think that the franchise still has something to offer. This film has something to offer for fans of the franchise, in other words.",
      "total_reactions": 1,
      "user": "Kevbo85"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "Its funny, I usually like these kind of movies. But usually the one's that I like have some sort of charm about it such as..(Camera angles, character development, gore effects, and good music) This film hardly had any of that. Actually I wouldn't even call this a true film at all. There's nothing cinematic about it. Honestly I felt like I needed an hour long shower after I watched this. Although the carnival scene is neat. THAT is pretty much it.",
      "total_reactions": 1,
      "user": "Brinncdeewhy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2014
      },
      "score": 4,
      "text": "Interstesting movie just wished they hadn't called it Texas chainsaw massacre. Its comical because it classic big boobed lots of sex cliche movie not Texas chainsaw",
      "total_reactions": 1,
      "user": "horrorfix"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "It's not scary, but it is still one of the better horror movies I've seen. It manages to get away with not being scary by being a slasher movie that doesn't suffer from being irritatingly campy. As a matter of fact the film isn't campy at all. It's a serious and self-respecting slasher film that is actually trying to scare you. Unlike most slasher films, it doesn't rely on over excessive gore or unnecessary nudity. It's serious and is trying to provide genuine scares, and while it doesn't succeed at providing scares, I respected and enjoyed it anyway for not treating me like an idiot.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "Texas Chainsaw 3D brings a few tricks to reinvigorate an already tired series but sadly fails to polish the fundamentals. When another title comes of from well-known franchise such as Texas Chainsaw which has inspired many movies of its genre, people already has an expectation, while this is an allure, it's also a strain to create fresh ideas. A bunch of 3D antics and choppy script are definitely not the way to pique audience's interest.",
      "total_reactions": 0,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "It's another gore filled chase-romp with little to no memorable moments. But that shouldn't be a surprise, considering the film had really no reason to exist anyway.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "I liked this movie and the 3d effect was pretty amazing. The reason i gave it a five was because it wasnt even close to texas chainsaw massacre in awesomeness and I got more sick than scared when i watched it",
      "total_reactions": 0,
      "user": "Homie786"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2014
      },
      "score": 1,
      "text": "This was Horrorbile! Nothing scary about it, just a mess of blood, and disgusting scenes. This is one of those movies where they just try to hard. Tania Raymonde is Hot, but when shes flaunting her body around it makes it even harder to take this movie seriously. The ending gets twisted in a Horrorbile way.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "Okay, look. Did I go into this thing with high expectations? Absolutely not, which in the end is why I ended up sort of digging it. Was the acting bad? Yes. The characters cookie-cutter and shallow? For the most part, yes. The kill scenes tacked on? Oh quite. But I expected all that; if I hit play in the first place, at this point I'm still on board.",
      "total_reactions": 0,
      "user": "LuciusMcGibbon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "The worst horror movie I have ever seen. A terrible waste and an insult to the original. The trailer looked as bad as the movie but the movie was so much worse.",
      "total_reactions": 0,
      "user": "WhySoSerious54"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "This movie was a cheesy, i mean ya, i get it, its a great movie in all, but don't you think crazy massacre people chasing young hot girls? i mean we see that in almost every horror. take halloween for example, its all about hot girls getting killed. i for one give it a 6 out of 10. good movie, but too typical for me.",
      "total_reactions": 0,
      "user": "MADCOW2248"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Its always good to see another \"Chainsaw\" film, so I was excited to see it.  It was pretty good, but not great.  Not sure of the justification of making the townsfolk out to be bad while \"Leatherface\" (the killer) is painted somewhat sympathetically.",
      "total_reactions": 0,
      "user": "Paradisecity"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Alot of critics are saying that this movie basically sucks. I thought the movie was overall really well done. The idea of making this a direct sequel to the original 1974 version was a creative idea. There was one big mistake in this movie such as the time gap. In the beginning it recaps the 1974 movie showing all the kills and the main protagonist in that movie barely escaping. Then, the real movie starts when the towns people show up and burn down the house where Leather face lives. Everyone thinks he dies and then the movie skips ahead to twenty years later. Twenty years later would mean that this was taking place in the 1990's. The time frame is shattered though when someone uses an iphone towards the end of the movie though. Basically everyone you expect to die does but not in the ways you expect. Alot of people didn't like one scene where a specific person falls down stairs and gets up and can't exactly run. This person fell down concrete stairs and everyone in the audience of the movie was like \"Oh my gosh. Why isn't she running?\" well let's see she just ate  falling down some concrete stairs. The acting for all the characters was surprisingly good/above average and is probably one of the best horror movies I've seen in about 2 years. I don't recommend this movie to anyone who ever says the original is always better and all that bs.",
      "total_reactions": 0,
      "user": "freeze10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "I think the directors recorem this kind of movie because they think it is something simple to do, but even something simple to play has to be done in a dignified manner, which in most cases here, does not happen.",
      "total_reactions": 0,
      "user": "khutch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "GreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreat",
      "total_reactions": 0,
      "user": "Lolidk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2013
      },
      "score": 5,
      "text": "This is the I think the third remake of the Texas Chainsaw Masscre,I can't tell because they've remade the movie so many times.It's okay,but only rent it.",
      "total_reactions": 0,
      "user": "ICEExMagic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "I enjoyed it though I have to say it wasn't as scary as I thought it would be, the characters make stupid decisions like Heather hiding in a coffin, really? It's still enjoyable to watch if you like those best worst movies.",
      "total_reactions": 0,
      "user": "Coyle98"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2014
      },
      "score": 8,
      "text": "In a post-Saw (that's just \"saw\", no chains attached) cinematic universe, it's refreshing to see a recent horror film which starts off with a premise which tries in no way, shape or form to be needlessly \"clever\"...honestly, it takes boldness in this day and age to do a \"for God's sake, don't let the monster out of the basement!\" movie, and even more balls to make that monster the mighty Leatherface.  Sure, by the end it all goes completely batpoop-crazy, but it still retains an internal logic - however \"nutzoid\" - which endings like the first Saw simply fail to have (guy dying of cancer, decides he's going to imitate a CORPSE in a room with two desperate, trapped guys who have access to nasty bladed implements...just so he can give the audience a big, nasty \"couldn't see that comin', could ya?\" spook at the end?  Spare me)...",
      "total_reactions": 0,
      "user": "rjmacready"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2014
      },
      "score": 3,
      "text": "Unfortunately, Not even the violence and gore can make up for the terrible screenplay and semi professional acting. Texas Chainsaw 3D is too boring to enjoy--- or even watch",
      "total_reactions": 0,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2015
      },
      "score": 2,
      "text": "I couldn't even finish this movie. Just another lame remake that is far worse than the 2003 version and is just ruining the legacy of the original and only good version from 1974. I could've directed this movie.  It just such a lazy effort. If you are a fan of horror I recommend just skipping this movie.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 2,
      "text": "\"Texas Chainsaw\" 10 Scale Rating: 2.0 (Awful) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2015
      },
      "score": 0,
      "text": "Wow, I am impressed of how bad this movie was, seriously it was more than awful. A hollywood cash grab so obvious you'd have to be mentally retarded not to see it. I won't go in details about the film itself, because it doesn't even deserve that attention, but let's say there is not one single redeeming quality to it.",
      "total_reactions": 0,
      "user": "Urbanlistener"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 0,
      "text": "Borderline unwatchable as a horror movie. Intermittently effective as an unintentional comedy. As far as horror sequels go, this is right down there with Halloween: Resurrection.",
      "total_reactions": 0,
      "user": "SolInvicta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2016
      },
      "score": 2,
      "text": "Time to fire up the critical Black & Decker: Somebody—there are six credited screenwriters—really wasn’t clear on the concept. The guy's called Leatherface (Dan Yeager, behind the skins). He lumbers after people, kills them and then his family eats them. How hard is that? After a brief montage from Tobe Hooper’s feverish 1974 classic, we’re back at the murder house, where—what’s this?—a bunch of yahoo hicks shoot down the remaining cannibal clan and torch the porch. These yokels are our villains now, and unfortunately, they’re a lot less scary or suggestive. Bereavement’s Alexandra Daddario, playing a distant Leatherface cousin set to inherit the manor (and manner), continues her sad career in unbuttoned bondage, and the 3-D effects are especially ruinous.",
      "total_reactions": 0,
      "user": "MovieMasterEddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2016
      },
      "score": 2,
      "text": "Texas chainsaw 3D is garbage. Its terrible in everyway, the acting is atrocious, the pacing is terrible, and its not even scary!!!!. Really!!!??. A 12 year old could make a better movie.",
      "total_reactions": 0,
      "user": "MOVIECRITIC315"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2016
      },
      "score": 7,
      "text": "Movie was great with lots of gore. But how many people are Leatherface?! This one is Jed so I can't keep track.But the directors did a great job into making a new Texas Chainsaw movie after so many years.",
      "total_reactions": 0,
      "user": "Kingofdanerds"
    }
  ]
}