{
  "mc_avg_user_score": 5.4,
  "mc_metascore": 36,
  "mc_mixed_rating_frequency": 35,
  "mc_movie_name": "That Awkward Moment",
  "mc_negative_rating_frequency": 27,
  "mc_positive_rating_frequency": 39,
  "mc_pro_critic_reviews": [
    {
      "critic": "James Mottram",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2014
      },
      "score": 80,
      "summary": "Gormican’s script is the film’s big strength; the dialogue fizzes while the set-pieces pay off handsomely."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2014
      },
      "score": 70,
      "summary": "While it's easy to tease first-time writer-director Tom Gormican's raunchy rom-com, the trio has a shaggy chemistry, and most of the jokes hit."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2014
      },
      "score": 63,
      "summary": "It's the Judd Apatow syndrome and there are times when the blend of romance and raunchiness threatens to curdle. In the end, however, the \"love conquers all\" mentality wins out."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2014
      },
      "score": 63,
      "summary": "While it has the requisite amounts of comedy and romance, it's actually more of a buddy movie. Think \"Sex in the City,\" bro-style."
    },
    {
      "critic": "Anna Smith",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2014
      },
      "score": 60,
      "summary": "It’s predictable and troubled by continuity errors, but as undemanding romantic comedies go, it’s a pleasant enough watch with a heartfelt script from debut writer-director Tom Gormican."
    },
    {
      "critic": "Adam Markovitz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2014
      },
      "score": 58,
      "summary": "Sit tight through the end credits and you'll be treated to a few off-the-cuff outtakes of the guys doing things much funnier than anything in the film itself."
    },
    {
      "critic": "Stephen Whitty",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2014
      },
      "score": 58,
      "summary": "It has some good actors, and some quick dialogue, which also has the feel of real-life. But the plot forces things a bit, and the direction is uncertain; just when it seems willing to take some risks, it retreats."
    },
    {
      "critic": "Kevin McFarland",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2014
      },
      "score": 58,
      "summary": "That Awkward Moment desperately wants to speak to a new generation of romantic-comedy devotees without proving it has the authority to do so. It’s not as laboriously dumb as the overloaded ensemble rom-coms of Garry Marshall (\"Valentine’s Day,\" \"New Year’s Eve\") or the similarly star-studded \"He’s Just Not That Into You.\""
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2014
      },
      "score": 50,
      "summary": "The reversion to formula takes a pleasing comedy and drops it down a notch, but That Awkward Moment is still very easy to like."
    },
    {
      "critic": "Susan Wloszczyna",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2014
      },
      "score": 50,
      "summary": "At the very least, the makers of That Awkward Moment should get credit for savvy casting."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2014
      },
      "score": 50,
      "summary": "Like its characters, That Awkward Moment has commitment issues: It lacks the courage of its bad taste."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2014
      },
      "score": 50,
      "summary": "It's nice to see a movie in love with New York City, but That Awkward Moment sets such a low bar for Jason's redemption it becomes a drag."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2014
      },
      "score": 50,
      "summary": "It’s over familiar, a movie that plays like recycled, R-rated outtakes from “Rules of Engagement” or “How I Met Your Mother.”"
    },
    {
      "critic": "Sheri Linden",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2014
      },
      "score": 50,
      "summary": "Even when Gormican’s material tries too hard to be wackily crude, and not hard enough to make dramatic sense, the actors suggest layers of experience that help to fill in the gaps."
    },
    {
      "critic": "Kate Erbland",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2014
      },
      "score": 43,
      "summary": "The most awkward thing about That Awkward Moment is that the majority of it just doesn’t make much sense and, as a relatively light-hearted spin on the romantic comedy genre, it absolutely should."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2014
      },
      "score": 42,
      "summary": "The three young stars biding time in Tom Gormican's listless rom-com are too gifted for one mediocre movie to bury."
    },
    {
      "critic": "Randy Cordova",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2014
      },
      "score": 40,
      "summary": "First-time writer-director Tom Gormican keeps the dialogue moving at a rapid pace, which doesn’t obscure the fact that most of what is said is dopey and witless."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2014
      },
      "score": 40,
      "summary": "What makes this film particularly bedeviling is that you get the sense there is a nice guy behind this mess, one not so callous about matters of the heart. If anything, the raunch seems forced. The closer the film gets to real emotions, the more authentic it feels."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2014
      },
      "score": 40,
      "summary": "That Awkward Moment is eminently forgettable — but worth remembering as Poots’ moment."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2014
      },
      "score": 40,
      "summary": "In the main, it's the usual story – much more rom than com."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2014
      },
      "score": 38,
      "summary": "The compensation comes in the three lead actors, all way too good for the material dished out by writer-director Tom Gormican."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2014
      },
      "score": 38,
      "summary": "That Awkward Moment strives to straddle the line between breezy, bromantic comedy and “Hangover”-esque guy humor. It fails miserably on both counts."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2014
      },
      "score": 38,
      "summary": "Its obsession with male genitalia, or, more specifically, penis receptacles, is emblematic of its overall aura of male entitlement and its consideration of women as prizes to be lanced."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2014
      },
      "score": 37,
      "summary": "The best thing about awkward moments, after all, is that they usually pass quickly. And, blessedly, just as swiftly forgotten."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2014
      },
      "score": 30,
      "summary": "There’s probably a movie out there that can call a happy, anatomical truce between Viagra-hopped, horizontal-dick jokes and heart-on-the-sleeve love stuff, but this ain’t that."
    },
    {
      "critic": "Genevieve Koski",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2014
      },
      "score": 30,
      "summary": "First-time writer-director Tom Gormican fills his script with jabs at romantic convention, but his story doesn’t attempt to subvert those conventions in any meaningful way."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2014
      },
      "score": 30,
      "summary": "The pic falls well short of its efforts to combine the raucous vulgarity of the “Hangover” movies with Cameron Crowe-ish depth of feeling."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2014
      },
      "score": 25,
      "summary": "As for the dialogue, although the characters talk really fast, swear a lot, and overlap their lines, what they’re saying isn’t very funny or authentic. It’s as if David Mamet collaborated on writing an episode of “Two and a Half Men.”"
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2014
      },
      "score": 25,
      "summary": "There is something of a manufactured air to the proceedings, one that is acutely aware of the techniques and traits of other similar better film, but without the strength in writing to back it up."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2014
      },
      "score": 20,
      "summary": "Tom Gormican, the writer and director, mostly uses overlapping dialogue in place of actual jokes, although occasionally he stretches to toilet humour."
    },
    {
      "critic": "Cath Clarke",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2014
      },
      "score": 20,
      "summary": "The actors – who seem to have been involved in a hideous industrial accident that’s left them with the superpower of repelling all comic timing – are spectacularly unfunny."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2014
      },
      "score": 12,
      "summary": "That Awkward Moment is a rom-com for dudes that seeks to outdo the ladies by being even more insipid, formulaic and contrived than anything Katherine Heigl has ever done."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "summary": "A vile, witless sex comedy."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2014
      },
      "score": 5,
      "text": "Three friends decide to stay single. They spend the rest of this movie in attempts at witty repartee (sometimes successful, but more often not). This is really a romantic vehicle for Zac Efron (he even gets teary), but the story is too trite to be believed. Meanwhile, Miles Teller is the star (he's an up-and-coming talent). His has charisma and offhand comic style is winning. Michael B. Jordan (also a promising newcomer) has some light moments, but has to handle the dramatic duties. It's all about relationships, so this is def a chick flick, but it revolves around guys, so there's lots of cussing and lowbrow humor. Even though it's well-paced, the dumb plot and unoriginal writing make it mediocre.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2014
      },
      "score": 6,
      "text": "If you're looking for a laugh out loud romantic comedy, then I wouldn't recommend this one because even though it has some very funny bits in it, which I could relate to. It also is a bit too romantic at times and it also drags on fir a bit too long.",
      "total_reactions": 1,
      "user": "Daniel2651"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2014
      },
      "score": 5,
      "text": "That awkward moment may deliver the laughs on a three some bromance and a few dating advice that's delivered in the movie but it lacks its true identity in its characters and it tries to hard on being a good comedy romance movie and this is a type movie that had some potential of being better but it was just ok.",
      "total_reactions": 1,
      "user": "david1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "Whilst That Awkward moment does manage to conjure a few guilty laughs, it amounts to nothing more than a very forgettable 'movie that Zac Efron was in'.",
      "total_reactions": 1,
      "user": "sammurphy66"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "\"That Awkward Moment\" 10 Scale Rating: 6.0 (Decent) ...",
      "total_reactions": 1,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "With a few tweaks, and by jettisoning Zac Efron, this would be a fun guys movie wtih some interesting heartwarming moments.  Instead, it's largely a drag. Michael B. Jordan shouldn't sell himself short acting in this type of crap.  He's like Russell Westbrook playing at UCLA - averaging 10 points and a couple of assists against average competition, yet against the NBA's best, he shines.   Jordan needs a real part and he acts the hell out of it - see Fruitvale Station. And Miles Teller is a rising star with limitless upside.  He was great in The Spectacular Now and the best part of 21 and Over.   But neither Jordan nor Teller could save this movie from its bad writing, it's tone-deaf directing, and Efron's crappy acting.  Even the two leading actresses are pretty amazing. I'd never seen Imogen Poots in anything, but she's a comer. And Mackenzie Davis is destined for great things.  Seriously, take Efron out of the equation and hand the script over to a better writer, and you have the makings of a St.Elmo's Fire Junior.   But that's a lot to ask for.  Juding the movie on what it is, not what it should have been, I give it a solid 3.5, rounding down.  I even laughed a bit.  The other THREE people in my opening night audience didn't make a peep. They clearly were not in the target audience for this film.  Which is really another challenge for the makers of this film - finding that audience.",
      "total_reactions": 6,
      "user": "FleshWorld"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "That awkward moment when I'm making a review",
      "total_reactions": 2,
      "user": "MKSauceLOL"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2014
      },
      "score": 3,
      "text": "Not horrible, but not good either. I think the three main actors are probably the only really positive thing I can say about it. The stories not bad but it's predictable which I guess shouldn't come as a shock. I also think I was expecting more of a buddy comedy as opposed to a romantic comedy.",
      "total_reactions": 2,
      "user": "Longo12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "I went into this movie (not my choice) expecting it to be a train wreck, i am very happy to say it exceeded my expectations by a country mile. The jokes were hilarious, there were likable characters and the actors had chemistry which tied it all together nicely. I recommend this to people looking for a comedy as this one of the better ones out at the moment.",
      "total_reactions": 2,
      "user": "Connorsauras"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2014
      },
      "score": 5,
      "text": "This is a movie you should not go see with your parents, unless you are completely open with them. With a penis joke every five minutes, \"The Awkward Moment\" will have you laughing out of your seat. This movie is an hour-and-thirty-five-minute awkward moment that you should at least see once in your life.",
      "total_reactions": 2,
      "user": "carrielargent"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2014
      },
      "score": 5,
      "text": "This movie is receiving a lot of hate despite the fact that is it enjoyable... OK the movie is predictable and has some cliches but it is to be expected by these kind of movies. What I really enjoyed was the fact that we got to see a romantic comedy from a male prospective.  Overall an enjoyable movie...",
      "total_reactions": 2,
      "user": "Loler13gr"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2014
      },
      "score": 5,
      "text": "This film has its moments, but in the end you've seen this movie before.  The funny moments in the film mainly come from Miles Teller plays off of Efron and Jordan well.  Overall a worth while watch that is just to predictable for a recommendation.  C+",
      "total_reactions": 2,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2014
      },
      "score": 8,
      "text": "Great movie with known story. Still very interesting with great moments and good subtle comedy. Zac Efron and Miles Teller are good duo and Imogen Poots is good addition.",
      "total_reactions": 2,
      "user": "SpiRo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "this movie is a funny guy movie it has the hilarity - the love and the charm of course. But Zac Efron which is not my favorite actor but it is  shocking  his performance well charming but his character represents himself as a selfish ladies man who makes girls do what he wants. Writer/director Tom Gormican thinks he knows love but really? he does know guys .....really he does he maybe does not know something about love . Grade B+",
      "total_reactions": 2,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "A romantic comedy from the guys point of view that surprisingly ends up feeling more believable than so many others in the genre. The real star here is the bro-dialog. It often leads to plenty of laughs and is so enjoyable because it is honestly how guy friends around that age talk to each other.",
      "total_reactions": 2,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "What the f**k is up with all the hate for this movie? I really enjoyed it. I had to sit in the front row for the thing and I still really liked it. The third act was a little cliche which was disappointing, but most of the jokes were great and the chemistry was fantastic. The female characters were really fleshed out too which I liked and it's the best movie I've seen this year, which isn't saying much, but I think it might end up on the lower end of my top 10 of the year, if not honorable mention. Go see this, much better than anything else out. 8.3/10",
      "total_reactions": 10,
      "user": "SimpleMethod"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "That Awkward Moment is a terribly formulaic and rather lacklustre comedy that subjects the audience to an overused plot, one-dimensional characters and witless, unintelligent jokes. The storyline seems forced for the sake of plot progression filled with boring cliche after cliche. Although the cast is charming, there is little chemistry between Zac Efron and Imogen Poots making their story a bit dull. Overall it is a mediocre film to watch with your buds or alone late at night for the raunchy, risque humour.",
      "total_reactions": 1,
      "user": "TheFilmFanatic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2014
      },
      "score": 4,
      "text": "We’re long overdue a great romantic comedy told from the male perspective – unfortunately That Awkward Moment isn’t that movie, the characters lacking in likeability, too many of the jokes falling flat, and the film missing the spark that should make hearts flutter.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "تو عمرم فیلم به این بدی و بی محتوایی ندیدم فیلمنامه اصلا",
      "total_reactions": 0,
      "user": "shahriar1378"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "It's decent. Better than I thought it was going to be but not that funny. The story is kind of generic and overall isn't special by any means. Though it's not that funny, there are some moments where it's hilarious. Those moments are far between but  when they come...it's hilarious. The cast is the best part of this and turn this somewhat unfunny, boring, and generic movie into something that barely passes. Overall I'm satisfied but wanting more. 6.1",
      "total_reactions": 0,
      "user": "bmaster4616"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2015
      },
      "score": 1,
      "text": "Absolutely crappy movie. The only reason why I watched it was because I was an hour into the movie and realized how freaking awful it is, and I now had to commit to watching the rest. To no one's surprise, the rest of the movie was terrible. There are some positives; the humor is funny, the music is appropriate, and the acting is pretty solid.",
      "total_reactions": 0,
      "user": "knightofthesun"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "The cast is fine (VERY fine) and the story is funny but there's nothing special in this romantic comedy besides a few laughs and great performances. Script is extremely superficial and doesn't say any interesing or new about relationships and characters development are quite poor, specially Efron's and Teller's. You can watch it to have fun a little bit but you'll be eventually tired after so many clichés of the genre and past films about the same subject.",
      "total_reactions": 0,
      "user": "danipp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2015
      },
      "score": 4,
      "text": "2/5★ An awkward title for an awkward film about the lives of Millennials in the big city. Played by inoffensively hot and up-and-coming actors, the film does nothing but drive home the difference between current and past young adults as portrayed by cinema that reflects some truth in the arrested development of the 20-somethings of today. Bro code and all that entails-its tiresome and condescending. What passes as witty banter does nothing to disguise the fact that it has nothing original to say.",
      "total_reactions": 0,
      "user": "reellm"
    }
  ]
}