{
  "mc_avg_user_score": 7.2,
  "mc_metascore": 42,
  "mc_mixed_rating_frequency": 8,
  "mc_movie_name": "The English Teacher",
  "mc_negative_rating_frequency": 0,
  "mc_positive_rating_frequency": 10,
  "mc_pro_critic_reviews": [
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2013
      },
      "score": 75,
      "summary": "Under Craig Zisk’s frisky direction, the entire cast is superb and wrinkle-free. The screenplay, by husband-wife team Dan and Stacy Chariton, is thin as a poker chip but as clever as it is contrived."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2013
      },
      "score": 75,
      "summary": "The most pressing question I took away from the film is, Are they really still teaching \"A Tale of Two Cities\" in honors English classes?"
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2013
      },
      "score": 75,
      "summary": "Nathan Lane steals the show in this tale of a high school English teacher who becomes obsessed with a student's play."
    },
    {
      "critic": "Adam Nayman",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "A potentially incisive character study is buried under layers of fluff in The English Teacher."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "The picture is perfectly watchable but rarely compelling, because the filmmakers are too timid to take any chances."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "The line between “cute” and “cutesy” is violated, repeatedly, in the sometimes funny, often cloying comedy The English Teacher."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "Even the sitcom stylings might not matter if the movie were funny, but in spite of the potential for Guffman-esque comedy, The English Teacher boasts few surprises—except perhaps its message, which seems to be that selling out isn’t so bad. Chalk it up to a case of “write what you know.”"
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "This is the second recent release—after The Great Gatsby, whose overwrought, on-screen text it even shares—that aims to channel great, time-honored storytelling without being able to tell a great story."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "The acting, especially Ms. Moore’s, is solid. But her strong, sympathetic performance fails to transform The English Teacher into anything more than a sitcom devoid of laughs, except for a soupçon of literary humor. It is a movie at odds with itself."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "The film’s cutesy vibe is closer to \"Glee\" than \"Election\" or \"Waiting for Guffman,\" with Nathan Lane’s exuberant drama teacher pitching several yards of camp tent."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 30,
      "summary": "The English Teacher is a tragedy masquerading as a comedy and doing a disservice to both."
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2013
      },
      "score": 20,
      "summary": "A respectable cast and much noisy boisterousness isn't enough to generate a single laugh."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2013
      },
      "score": 20,
      "summary": "Despite a lead performance by the always welcome Julianne Moore it is rudderless in its presentation and outright stupid in its central conceits."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2013
      },
      "score": 5,
      "text": "“The English Teacher” is an awkward attempt by director Craig Zisk (“Weeds”, “The Larry Sanders Show”) in his feature film debut as he tries to relate the tale of a spinster high school teacher  Julianne Moore, who becomes obsessed with the talents of one of her former high school students.  Nathan Lane plays the drama coach/teacher who loves the play the ex-student has written and the efforts all make to have it produced. Greg Kinnear as the father of the young playwright also interjects his presence as this troubled film seeks to find its comedy/tragedy identity but never quite makes it. I give the film only a 6 despite the fine efforts of 3 very talented actors.",
      "total_reactions": 0,
      "user": "BHBarry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "This is Julianne Moore's movie. She's in almost every scene and has the chops to pull it off. She plays a single, stereotypical high school teacher with no personal life…until one of her former students returns home with a play he's written. She takes it upon herself to bring it to the stage (with the help of drama teacher, the always funny Nathan Lane). There are other supporting roles that add to the humorous momentum (notably the school administrators). This movie is as light and predictable as a TV episode and some of that could be the director, Craig Zisk, a talented veteran of the medium. Although it's in no way memorable, this is a sweet little trifle with charming comic energy.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "Does former student count...!",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "Cute, sweet, great acting. I love both Julianne Moore and Nathan Lane, so this was the perfect flick for me. I thought both of them were truly in their element for English Teacher",
      "total_reactions": 0,
      "user": "KatieW"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "I enjoyed the comedy & romance.  Also appreciate how quickly actions can get blown out of proportion..  Glad that in this as tory th as t collaboration and common sense prevailed.",
      "total_reactions": 0,
      "user": "kathytreece"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "I think I really like Julianne Moore here. She's quite funny, moreover her role as an English teacher who loves literature so much and loves being alone as much as I do. Haha. Feels like this movie's talking about people like me with our lonely passion??? Of course without that affair with her former student. Eww!",
      "total_reactions": 0,
      "user": "Herlyanti"
    }
  ]
}