{
  "mc_avg_user_score": 4.4,
  "mc_metascore": 26,
  "mc_mixed_rating_frequency": 3,
  "mc_movie_name": "The Haunting in Connecticut 2: Ghosts of Georgia",
  "mc_negative_rating_frequency": 10,
  "mc_positive_rating_frequency": 10,
  "mc_pro_critic_reviews": [
    {
      "critic": "Joe Leydon",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2013
      },
      "score": 70,
      "summary": "The helmer generates suspense with shrewd pacing, deft emotional manipulation and efficient use of familiar tricks -- jittery editing, flickering lights and unsettling sounds -- common to haunted-house pictures."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "Actually offers some decent scares before descending into typical horror film bombast."
    },
    {
      "critic": "William Goss",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 42,
      "summary": "To the film’s credit, it doesn’t waste much time in doling out shadowy figures and fake-outs for the gullible and easily goosed, and the cast as a whole dutifully delivers its panicked looks and cries in the night."
    },
    {
      "critic": "Nick Schager",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 20,
      "summary": "The story is ultimately nothing more than a decrepit vehicle for the moldiest of scary-movie clichés: screechy specters, inane character behavior and jump scares that a toddler could anticipate minutes ahead of time."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 20,
      "summary": "The storytelling, from a script by David Coggeshall, is at times nearly incoherent and relies too often on random scares."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "summary": "The rotting corpses, projectile insect vomit, and creepy geezers in black arrive pretty much on cue, as does the great Cicely Tyson as the obligatory old blind woman who \"sees\" more than most people with two good eyes. It's her upper bridge, though, that's truly the scariest thing in the whole movie."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2013
      },
      "score": 2,
      "text": "AWFUL AWFUL AWFUL. Any good comments on here must be paid for as this movie has no good points at all.",
      "total_reactions": 2,
      "user": "Azingbo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "Ghosts of Georgia has some new ideas, but overall, it is filled with cliches and outdated ideas, old creaky stuff just to generate some scares that we pray for to work, at the end of the day, no shocks. Predictable and cheesy. At some points of the movie, I regret watching it and think that it would have been better to feel bored than watching this. I have some questions for the writers. Why should anyone sane, knows that some crazy stuff happening around him, move from his house at midnight rather than morning? And I don't think that anyone doing nothing, won't wait till morning, to do laundry! The acting is maybe good for a horror movie, I might give credit for that. The story is somehow interesting, and there is a little bit of ideas that are somehow new. So 3 out of 10 and I regret it.",
      "total_reactions": 2,
      "user": "MovieGoer14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "The Haunting in Connecticut 2:  Ghosts of Georgia is not a horrible film.  Almost.  But not quite.",
      "total_reactions": 0,
      "user": "slippery"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Its a nice watchable movie,with unpredictable story.Not awesome  as first one ,but decent movie.Well acted and dramatic ending as well.Its worth watching.",
      "total_reactions": 0,
      "user": "Smee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "The most baffling thing about this movie is the title. Why even have Connecticut in the name? The movie has nothing to do with the original and it doesn't take place in Connecticut. Why not just call it \"The Haunting in Georgia\"? The only thing that was redeeming in this movie was the little girl who played Heidi and the support hot redhead that played Joyce. Other than that, this is a terrible movie.",
      "total_reactions": 0,
      "user": "casher"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2013
      },
      "score": 3,
      "text": "This movie is only trying to scare but it lacks story, and it lacks the way to capture its audience. I would recommend to skip this one. The movie is very dull and very confusing on to what the meaning of the movie is. The movie is way better to be left unwatched. Lions gate didn't make such a good movie this time. Not  worth the watch.  The story could've been written and directed better.",
      "total_reactions": 0,
      "user": "deerios98"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2014
      },
      "score": 1,
      "text": "When I didn't think a movie could be worse than The Haunting in Connecticut, this movie was made. At least in the first one, there was some unintentional comedy... and stuff actually happened. This was just a compilation of shadows moving across the camera, and flickering lights. If Lifetime made a horror movie, this would be it. This is one of the most boring and cliched horror movies I've ever seen.",
      "total_reactions": 0,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "I wasn’t expecting much going into this film mostly due to the ridiculous title of the picture but I actually enjoyed the film. There was the basic elements here to be far more scarier but where held back by standard effects tricks that now plague paranormal movies almost to the point of making them boring. Yet at moments I felt actual suspense and eerie tension as more dramatic scenes unfolded into real chilling events. The setting and story was creepy and the film version held a far more haunting presence than what I originally imagined from the actual story. The film veered from the true paranormal case with a more morbid, dark representation of the evil spirit haunting the land as well as the family.",
      "total_reactions": 0,
      "user": "A_So_Horror_Fan"
    }
  ]
}