{
  "mc_avg_user_score": 6.5,
  "mc_metascore": 51,
  "mc_mixed_rating_frequency": 56,
  "mc_movie_name": "The Call",
  "mc_negative_rating_frequency": 11,
  "mc_positive_rating_frequency": 80,
  "mc_pro_critic_reviews": [
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 90,
      "summary": "An effectively creepy thriller about a 911 operator and a young miss in peril, The Call is a model of low-budget filmmaking."
    },
    {
      "critic": "Staff (Not credited)",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "Surprisingly good, and surprisingly gruesome, fun."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "The Call might not be a classic for the ages, but for a Friday night? For a movie to take people out of themselves? And to make them marvel at the viewing experience that just happened to them? This one is hard to beat."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2013
      },
      "score": 70,
      "summary": "The Call for the most part is a tense, extreme-jeopardy thriller that delivers the intended goods."
    },
    {
      "critic": "Leah Churner",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 67,
      "summary": "A pastiche of classic plot devices scrounged from \"The Taking of Pelham One Two Three,\" \"The Conversation,\" \"Blue Velvet,\" and dozens of other movies, the story often feels familiar, but director Anderson (The Machinist) has a such a flair for suspense that even the most jaded viewers will find themselves in a sweat."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2013
      },
      "score": 60,
      "summary": "No one’s winning any awards for The Call. But at least the award winners know how to make it worth our while."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "A sputtering, so-so B thriller with a neat hook but very little personality."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "For its last third, the entire thing gets a Frankensteinian head transplant, and turns into derivative serial-killer nonsense."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "The action starts with a bang, but deteriorates and grows more absurd as the story strays farther from the LAPD call center."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "The film is at once shamelessly transparent, manipulative, and far-fetched, and impossibly suspenseful. You'll want to take a shower afterward - that's how icky you'll feel."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "You’ve seen pieces of this movie in “Psycho,” “Silence of the Lambs,” and 2004’s “Cellular.” Still, the early scenes in the Hive give The Call a needed novelty: It’s a workplace drama, and the work is responding to other people’s desperate worst-case scenarios."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "All that unsavory business aside, the biggest problem with the third act is how the film discards the novelty of its own premise in order to bring its star into the action. When Berry trades her headset for a rock, it’s the bluntest metaphor imaginable for a film that’s completely lost its mind."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "Rare is the thriller that goes as completely and utterly wrong as The Call does at almost precisely the one hour mark. Which is a crying shame, because for an hour, this is a riveting, by the book kidnapping."
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "There’s little to differentiate this high-pitched screamer from a particularly feverish “Law and Order” rerun."
    },
    {
      "critic": "Ian Buckwalter",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 45,
      "summary": "The shoddy attention to character, plausibility and detail is particularly surprising coming from Anderson, a director of smart indie thrillers like \"The Machinist,\" \"Session 9\" and \"Transsiberian.\" He's been a gifted filmmaker with a talent for creating chilling tension through meticulous control of just these elements."
    },
    {
      "critic": "Trevor Johnston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2013
      },
      "score": 40,
      "summary": "Yet just when the movie has us in its grasp, the script falls to pieces and turns into a crass female-in-peril button-pusher whose shameless psycho-killer clichés insult the intelligence."
    },
    {
      "critic": "Chris Packham",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2013
      },
      "score": 40,
      "summary": "The middle third of the film comprises the phone call, a tight 40 minutes."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2013
      },
      "score": 40,
      "summary": "For 91 minutes of its briskly paced 94-minute running time, the film works as a tightly wound bit of pins-and-needles storytelling. Then, Anderson lets it all unravel in a three-minute stretch of cheap writing that not only betrays the characters he worked so hard to develop, but that also thumbs its nose at any audience members with a brain."
    },
    {
      "critic": "Sheri Linden",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 40,
      "summary": "It buzzes along for a while, the promising plot innovations inviting suspension of disbelief, before by-the-numbers implausibility, over-the-top valor and unsavory contrivances take over and the line goes dead."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2013
      },
      "score": 38,
      "summary": "Labeling The Call as \"relentlessly dumb\" would be an overestimation of its intelligence. This is as brain-dead as a movie can be and it assumes the audience will have the I.Q. of a rutabaga."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 38,
      "summary": "I’ll say one thing for The Call: Its ending is actually a bit of a surprise. Just when you think it couldn’t get any stupider, pow! I’ll be damned, Hollywood, you still have the power to blindside."
    },
    {
      "critic": null,
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 38,
      "summary": "Brad Anderson's film is defined by an often frustrating combination of cleverness and stupidity."
    },
    {
      "critic": "Laremy Legel",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 33,
      "summary": "An active affront to logic, placing us in a world we firmly know doesn’t exist."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "A very good film, has an awesome thrilling feel to it. The situation is somewhat cleverly executed and the film itself is something a little different which I like. It could had been less of a cliché but despite that, this film is still worth watching.",
      "total_reactions": 2,
      "user": "Dalek"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "Halle Berry plays a 911 operator who gets a call from a girl (Abigail Breslin) trapped in the trunk by a kidnapper. Not only is this a nail-biting rescue, it becomes a police procedural as we watch the resources used to find the caller. Most of the time, the film makes smart choices that keep you involved and sometimes even wanting to scream at the screen. The filmmaking is sharp with some flashy editing touches and solid sound design. Even though the conclusion is a bit much, up til then, it's a well-crafted, gripping ride.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "I feel like I wasted my time watching this movie since it was already unpopular. Halle Berry had a bad performance and scenes just go down in history forgettable. It wasn't total failure but it could have and should have been more than it was.",
      "total_reactions": 1,
      "user": "TheWalrus2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2013
      },
      "score": 5,
      "text": "It was a good and exciting movie up until the last half hour where a 911 operator turns into high class detective discovering the location of the kidnapper. No cell signal where there was one in a previous scene, no cops at the location which they knew and was the only lead they had. They were there, but then left just before ms. 911 shows up and solves everything in 5 minutes flat. Oh and the last scene makes NO sense at all. Hal Berry is great, but the ending leaves you staring at the credits while you shake your head and wonder why the writers decided that was the best way to go out. Still giving it a 5 for everything up until the end. Don't watch this one people, you'll be disappointed...",
      "total_reactions": 1,
      "user": "forTheNom"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "Well,I love the first two acts of the film but seriously falls flat on the final act.The Call is suspenseful,Gritty  and it thrills me so much but when the third act arrives the movie becomes silly and generic But still it's fun but  the movie is well executed and great performance of all the actors and actresses in it.",
      "total_reactions": 1,
      "user": "JohnKristofer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "The Call is a slow, gritty thriller because the end or the climax is wonderful and disappointing at the same time. This movie is so edge of your seat  edgy, nail biting, bloody thriller. The Call deserves a 9 because its a wonderful thriller.",
      "total_reactions": 4,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "The first two acts of this film are great. It is intense, suspenseful and emotional. All the performances are good and it is very well paced. The problem comes when the third act starts. It turns from a twisted thriller into a dumb generic \"Silence of the Lambs\" ripoff. I would recommend watching the movie and walking out an hour in.",
      "total_reactions": 6,
      "user": "RalphsReviews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "At a running time of 1 hour and 30 minutes the movie movies quick and if it was not for the final minutes of the film I would have given it a 8 of 10.  Unfortunately, the absurd ending may be too much for some to handle, it really is overall worth the cost of admission.",
      "total_reactions": 2,
      "user": "tgreen81"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "Once you get past the unattractive Harpo Marx hairdo sported by Halle Berry in “The Call” the first 80 minutes of this 98 film presents an interesting thriller before it becomes a cliche of previous thrillers. At that point it falls apart leaving more questions than answers but you really don’t want to waste time trying to figure out what just happened.",
      "total_reactions": 3,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "How dare this movie have a 6.6 from the users and 50's from the critics. This piece of dog crud  should be laughed about. The ending was stupid, the fact no one checked the cabin, she drops her phone, and doesn't finish him real good before he helps her. Too many retarded things happened.",
      "total_reactions": 3,
      "user": "Noxious"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "Hallie Berry shows her concerned side in this strange but interesting suspense fest. It sure is great with many clever ideas thrown out as Berry does her job. It just ends in such a weird note that while the credits rolled I decided to bump this rating down a notch. If you missed the last 30 minutes of the movie it gets an 8 otherwise its a 6 if you stayed and watched the whole thing. Why did the director do this I am so mad at him. So good and then, uuugh.",
      "total_reactions": 3,
      "user": "analogkid280"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2013
      },
      "score": 3,
      "text": "Worst acting by Hallie Berry I have ever seen. B rated movie not meant for big screen. OK plot is the only reason it got a 3 from me. With an ending that leaves your jaw dropped and you have to push it back into place because you just realized you got ripped off and want your money back. Worst ending that I can remember. DO NOT WASTE YOUR MONEY. I'M NOT EVEN WASTING ANY MORE TIME ON THIS MOVIE REVIEW. IF YOU WASTE YOUR MONEY AND SEE IT  DONT SAY YOU WERNT WARNED.",
      "total_reactions": 5,
      "user": "bigfoot6463"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "Remember movies like \"House at the End of the Street\" or \"Gone\", which lacked in character development, acting, and believable tone? Remember their misguided and incoherent endings that lacked any wit? Well, i'd say that \"The Call\" has much more wit and believability. It suffers from a lot of important plot elements that could have been added and maybe the supporting characters could have been put to better use, but this film is a treat in a genre that has recently had a lot of repetitive and lazy flicks.",
      "total_reactions": 1,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "I must admit I went into this film skeptical, however the trailer was intriguing so I gave it and chance. Halle Berry makes this movie exceptionally convincing and delivers an emotional punch. I will warn you if you are suffering from anxiety you need not watch \"The Call.\" So many times I shifted forward in my seat in suspense, while biting my nails. Now with all of the positives this film does shove a few pins through my heart. 3/4 of the movie excels as a thriller, but in a blink of an eye were running upstairs when we should be running out the front door. The thriller quickly turns into a horror film and this is where the film loses me. We are given a \"Saw\" ending?! As the director, Brad Anderson had everything going for him, but gives up on the ending and it is extremely disheartening. In a nut shell \"The Call\" is a fun, outlandish, and suspenseful treat that is worthy of a matinee ticket.",
      "total_reactions": 1,
      "user": "aaronmwolford"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "\"The Call is a somewhat intense, smart, but predictable edgy thriller. That actually makes you cringe a little bit. Although not unique or original in any way shape or form and its insanely forgettable. For the most part its that fun guilty pleasure.\"  B",
      "total_reactions": 0,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2013
      },
      "score": 4,
      "text": "This has a good premise on how 911 operators work. The first act sets up nicely, the second act goes smoothly and the final act jumps the shark. Once you know the antagonist's motive it becomes ludicrous that it become an episode of Criminal Minds.",
      "total_reactions": 0,
      "user": "Tetsuo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "An impressive thriller. It's tense, brutal, features a original idea, and, up until the very end, has believable moments and characters who act and make decisions like real people would. I have to give special praise to Halle Berry who gives a fantastic performance rather than just relying on her looks. This is also do to the fantastic writing. The only real complaint I have is that near the films conclusion it takes the predictable turn of the main character going in to save the girl by herself. It's predictable and cliche, but doesn't hinder the overall movie. All in all I was highly impressed with \"The Call\" and recommend a watch.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "Despite a haircut that makes it look like some kind of small animal died on her head, Halle Berry is excellent in The Call, a tense thriller that was a genuine surprise, a smartly written and performed film. When Jordan (Berry) is responsible for the death of a young girl, she quits work as an emergency call operator but when another girl, Casey (Abigail Breslin) is taken she finds herself back in the chair trying to save her from her captor. The Call is a pulse pounding film as it playfully subverts horror conventions to create a thriller so tense that you may well feel your heart beating in your chest. Grounded by an excellent performance by Berry as the good natured but self conscious Jordan, everything in the film feels real adding a new level to the action as Breslin's Casey gets closer to her destination and her expected demise. The usual diversions are to be expected and an odd and slightly pointless cameo by Michael Imperioli slows the film down but all in all its a film with an interesting premise, two great central performances and an ability to play with the viewers head. The only real downside is the film's villain, he lacks the charisma of other horror villains and while the tension and terror is real, the ending is written on the walls from the beginning and it takes the adventure out of an otherwise great film. It's not a bad film, it's fun, clever and creepy but it doesn't really push boundaries in its conclusion so much as nudge them, hoping they will fall over on their own.",
      "total_reactions": 0,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "The Call is a perfect example of a movie that not only has a ton of potential but also is executed so very well until the very end. The plot is very interesting and well developed and the acting is absolutely incredible. Abigail Breslin deserves an Oscar nomination for how believable she is in this film. The back and forth between her and Halle Berry's characters immerse you completely into the movie and have you on the edge of your seat. The supporting cast of Morris Chestnut, Michael Eklund, and even cameo appearances by Michael Imperioli and others don't disappoint either but this is hands down the Berry and Breslin show. But as I said, the flaw was in the last ten minutes because up until that point, we were looking at a solid 9/10 caliber film. Those last ten minutes caused the film to go from a nail-biting thriller surrounding unfortunately realistic circumstances to yet another cliched film where drama and suspense is built upon stupidity and unrealistic actions and reactions. Some people might not care much but to me, that killed the immersion and the movie-watching experience and definitely took the movie down a few notches. The fact that there was essentially no closure just added to the last several minutes being weak. Nonetheless, this was actually a pretty good movie but it had \"great\" potential.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "When it was announced that WWE was staring a film company, like most, I thought it was a joke. After some success with films like the Marine and 12 Rounds, the company earned some legitimacy and with it comes bigger talent and better Directors. The Call is the first WWE film that doesn't star a wrestler, and it was every bit as good as any Hollywood thriller that was released last year. Halle Berry stars as a 911 operator, whose worse nightmare is realized, when a kidnapping victim calls in from the trunk of a serial killers car. From there, the Call becomes 90 minutes of pure, non-stop intensity. It's hard to imagine a film that features a girl in a trunk and a woman in a call center, being as entertaining as it was, but that's where the experienced Hollywood talent comes into play. Halle Berry is not someone I consider to be a terrific actress, but she surprised me, by playing a character who had to overcome emotion and think on her feet. It quickly becomes evident that going by the book will lead to this girls death, and the operator comes up with some pretty novel ideas about how to deal with the situation. The supporting cast, which does feature an active WWE superstar, is also very good in assisting with the statewide manhunt. This film was really on pace to be one of my favorite films of the year until the ending. It was very strange, but the film gets to a certain point and then just ends. There may not have been much more of the story to tell, but the way it ended made me feel like I left the theater a few minutes early to answer an important phone call or something. It maybe a small thing to some, but to me, it really took a lot away from an otherwise terrific film. The Call is not that original, outside of the particular situation, it's a type of film you've seen many times over. It is however intense, fast paced, very entertaining, and most definitely worth the price of admission.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "While the cast is pretty solid, Berry is a rather disappointing lead and Eklund, who plays the film's villain, failed to be a satisfying performance as well. The plot was also incredibly predictable at times as well, I often called what would happen next several minutes before it happened. The ending was also rather disappointing and made little sense. That being said, I still enjoyed The Call quite a bit. It was interesting and entertaining, I gotta give it that. It's worth giving a shot.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "This is not a perfect film--but what it does perfectly is keep you on the edge of your seat with an intense story and gripping suspense. Halle Berry will leave you craving for more.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "There was a time when \"B\" movies were meant to fill a couple of hours and entertain the masses...nothing more. Well, \"The Call\" is just that: a tight, vicious little \"B\" movie that never let's up and delivers the goods.  All of the talent is acting as if it's an \"A\" drama, which helps keep the suspense level up: nobody is phoning it in...and it is an \"R\" rated thriller, so they are willing to get a bit nasty, which also helps the film, to be honest.  A tight, vicious thriller that did the job it was made to do!",
      "total_reactions": 0,
      "user": "Johnrieber"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2013
      },
      "score": 9,
      "text": "Great movie, Not one dull moment, keeps you waiting to see what happens.Makes you want to do something to help. The bad guy on this movie is twisted.My only problem with \"The Call\" is at the very end, but it wasn't a big issue.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "This is the definite thriller I was hoping for, it deserves the wait, I was hoping it won't be bad, but with Halle Berry and Abigail Breslin and a thriller that moves under your skin and nerves, it is never a bad movie.",
      "total_reactions": 0,
      "user": "HaithamBayazeed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "This is one of the best thrillers I have ever seen. It has everything you could ask that makes a movie good. Great acting, quality entertainment, originality, and a plot that is completely possible and believable. Not to mention that it teaches you exactly what to do if your in this kind of situation. The only minor problem is the ending because it's not all that believable but it's still satisfying. Not a big problem though. Overall, great thriller!",
      "total_reactions": 0,
      "user": "mds03"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "The first two thirds of this film is a strong 7, but the final third brings this film down to a 6.  Still I would recommend watching the film for strong performances.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "Interesting 911 police procedural and suspense is almost unbearable, although the torture of two female characters can be a bit much at times.  Overall, I enjoyed the experience and a mite disappointed at the ending.  Nice thing, overall, was no CGI.  Halle was good as usual.",
      "total_reactions": 0,
      "user": "EriktheRed3939"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Really good interpritatin of being kidnapped. I think Abigail does a really good job of portraying the emotion. only down fall is the ending it seems like they cut it short as if they ran out of budget. I feel it should have lasted 5-10 min. longer.",
      "total_reactions": 0,
      "user": "emsig"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "I thought this movie was amazing! Halle Berry did an amazing job, so did the teen and the \"psycho\". It was breathtaking, action-packed and sometimes surprising. I liked the ending which was a bit politically incorrect, and the fact that the guy in the wheelchair wasn't the guy in the wheelchair. He was just a worker that happened to be in a wheelchair. But the fact is that the identity of the kidnapper wasn't surprising at all and that his motives were not original at all. But the point of view was strong, the solutions that Jordan gives to the girl are intelligent, the acting was great, the music was excellent and the story was good. It did what I expected it to do and it did it well. Awesome movie!",
      "total_reactions": 0,
      "user": "charmedlp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "The Call, a decent movie, nothing to write home to mom about, but enough thrills to keep me interested and engaged.  I have to admit after viewing this movie I have many questions.  Questions about the sister, the wife, etc.  I would tend to think Halle Berry is the only reason this movie attracts viewers.  I also can really respect the brief glimpse of the life of a 911 emergency dispatcher and how critical their jobs are.",
      "total_reactions": 0,
      "user": "Koncensus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "Llamada de Emergencia 911 genera un suspenso impresionante, ademas de poca predicibilidad, excelente calidad de actores como la hermosa Abigail Breslin, esta pelicula guardaba un contenido comun en peliculas de su genero, sin embargo logra desarrollarlo mas alla de normal",
      "total_reactions": 0,
      "user": "Jmsbpp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "The call is a thriller about a 911 operator who gets a call of a girl who is kidnapped by a man in his car. It is a new idea and it is successful. The action and the plot are amazing. Abigail Breslin and Halle Berry were great and i think this film should have more positive reviews as it is a quality thriller and you will not get bored. Great things happen in that film and it has some suspense. I don't really know if there is going to be a sequel but the Call is a great thriller.",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "Way to much of using a stupid tricks to given some shock? Not at all but no gut. If the film want to press the audience into corner just like Silence of The Lambs. It's a shame. You have to work harder and more original stuff that make sense please. While watching this film. I have a lot of questions that lead to unreliable plot.",
      "total_reactions": 0,
      "user": "mtoons"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "The Call definitely had its plot holes and moments of stupidity. However, it was a very exciting movie and kept me on the edge of my seat. The weak part of the film is character development. I know a little bit about the characters but only just enough to get by. However, this is not really a character driven story. This movie was made to be a thrill ride. That is where the beauty lies. They want Speed and they somewhat get there. I thought the acting was pretty good. The villain of the film was very believable and did a great job. Overall, I wouldn't say its the best thriller I have ever seen but its pretty darn good.",
      "total_reactions": 0,
      "user": "w1ldw1ldwest"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 4,
      "text": "If this was not the end yet, I would say that it stands out from the average, but it's unfortunately only one of many, and did not start badly, but then the ending",
      "total_reactions": 0,
      "user": "Firebala"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "The movie falls victim to a Hollywood ending, but the rest of the film is gripping and tasteful. Halle Berry is a very good actress in this movie, and Abigail Breslin is believable. It's a fun movie to watch with your friends on Friday night, there is no arguing with that.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Why do people say the ending is cliche, I have never seen a thriller end like that? It would be more cliche if she called the cops and they took him away and gave him 25 to life in jail  Why would that have given you satisfaction  I think leaving the psycho to starve to death in his own sick lair was a more interesting ending as his many victims would agree (the amount of scalps in the fridge show he killed more that the one girl shown in the film), maybe another film has this ending so it is cliché but I doubt that giving it a nice happy, the cops come and take him to jail, ending would really have satisfied you unsatisfiable people.",
      "total_reactions": 0,
      "user": "Jhdharrison"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 2,
      "text": "Surprisingly well written, suspenseful, intelligent, ok acting… then the third act  unbelievably contrived, ridiculous, 7-in-a-row of the dumbest decisions ever made, worthy of the intellect of a 5-year-old, from a supposedly intelligent character, in order to end with a half-decent epilogue that didn't particularly fit with the rest of the film.",
      "total_reactions": 0,
      "user": "Who_are_you"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "6 heading to 5 just because of one thing: the ending. This movie, at least for me, its worth 7 or 8, but the ending, the useless, nonsense ending, almost destroys all the work and, lets call \"progress\", that was built before it. Why didn't they just finished the traditional way where they escape and call for help? I don't know; but sometimes you just have accept it the way it is: sh*t happens.",
      "total_reactions": 0,
      "user": "jppl1999"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "Generally a somewhat thriller film \"The Call\" never dies down on It's plot and acting but It does on the actual story as well as violence. You may fine it as a stripped down version of \"Maniac\" comparing It's similar content. Nevertheless this film kept me watching, and I'm sure you will too.",
      "total_reactions": 0,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "i never saw a movie  that  Halle berry saves abgail  breslin  from a kidnap . i love the thrills and the watching halle berry save someone . great movie wonderful",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "The Call es una película que sin dudas logra mantener al público en suspenso a medida que avanza el film, con presión recurrente y mucho entretenimiento.",
      "total_reactions": 0,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "\"The Call\" 10 Scale Rating: 6.0 (Decent) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2015
      },
      "score": 2,
      "text": "Labeling The Call as \"relentlessly dumb\" would be an overestimation of its intelligence. This is as brain-dead as a movie can be and it assumes the audience will have the I.Q. of a rutabaga. I suspected I might be in trouble when the opening credits proudly proclaim that The Call is a \"WWE Production.\" Uh-oh. Granted, I wasn't expecting a high-caliber art film (although, once upon a time, Brad Anderson was an indie director - The Machinist, anyone?) but the WWE isn't exactly known for gripping storylines and well-developed characters. The pedigree runs true.",
      "total_reactions": 0,
      "user": "MovieManiac83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "The Call\" was a little monotonous intense and dramatic movie , but the story and the perfomance as Haley Berry, dazzled in this film. The script is very good, exepcional theme, but the rest was a bit vague.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2015
      },
      "score": 6,
      "text": "At a first glance, \"The Call\" might seem like a minor work, destined to arouse interest only after its DVD release, and to be watched absent-mindedly during an autumn afternoon. Not that it tries to be subtle, or pretends to be meaningful: “The Call” is action, jump scares, petty suspense; it’s built to entertain the viewer for its 92 minutes of running time, and sell a lot of popcorn. Don’t underestimate it though, it will surprise you.",
      "total_reactions": 0,
      "user": "Devilmath"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "Relentlessly suspenseful, this lean thriller has an emotional subtext that makes it almost unbearably involving.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2017
      },
      "score": 6,
      "text": "Un thriller dans les coulisses du \"911\", le numéro d'urgence américain qui en voit défiler des vertes et des pas mûres (rien que du très classique au pays de la violence) jusqu'à ce qu'une opératrice se retrouve mêlée et emmêlée dans une affaire d'enlèvement par un atroce psychopathe.",
      "total_reactions": 0,
      "user": "Broyax"
    }
  ]
}