{
  "mc_avg_user_score": 4.0,
  "mc_metascore": 22,
  "mc_mixed_rating_frequency": 27,
  "mc_movie_name": "The Bounty Hunter",
  "mc_negative_rating_frequency": 49,
  "mc_positive_rating_frequency": 22,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2011
      },
      "score": 1,
      "text": "Okay The Bounty Hunter is a premise that shouldn't have been put to screen in the first place, but then you got Gerard Butler and Jennifer Aniston and you think maybe. Then you watch it they have simply no chemistry and the film is so badly written it isn't funny. It isn't bad enough to be good. I give this movie 13%.",
      "total_reactions": 2,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2010
      },
      "score": 2,
      "text": "There is not much to like in this pretty awful romantic \"comedy\" that does not have a single intentionally funny thing to laugh at. The story is predictable and cliched, the dialogue is laughably bad, and not even Jason Sudeikis (great on \"SNL\" and \"30 Rock\") can bring any humor to this.",
      "total_reactions": 1,
      "user": "Tony"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2013
      },
      "score": 1,
      "text": "God, I hope Ms. Anniston and Mr. Butler should've just started action movies or a drama instead of wasteless piece of crap are Jennifer Anniston rom-coms. Can we please get a \"Friends\" movie or something because you are way spending too much money on these Gucci shoes? I really don't like Jennifer Anniston and it's time for her to give it up because \"The Bounty Hunter\" is one of the most absolute drenched-up movies of all time.",
      "total_reactions": 1,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2011
      },
      "score": 2,
      "text": "Oh my god, what is this? \"The Bounty Hunter\" isn't even a rom-com movie with guy catches girl and girl catches guy thing. It's a movie that is filled with idiotic dialogue and stupid-ass acting. A true movie goer will know what I mean.",
      "total_reactions": 12,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "Don't understand the hate for this film. I appreciate the actors and the characters they play. It's funny, romantic, bit of action here and there and simply ticks all the boxes of a romantic comedy. Recommended to couples for date nights. I would gladly watch this again and again.",
      "total_reactions": 2,
      "user": "fryzee"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "This is the IDEAL flick for people who are bored of watching Robert De Niro  Charles Grodin's scrotummy old faces every Christmas when Midnight Run is on the telly. That was well overdue a remake and the Hollywood guys have delivered in spades. There's a bit of a twist this time tho. The bounty is on a girl and the bounty hunter is her ex boyfriend. You can understand how awkward it's gonna be when they're cuffed together for the duration of the film. Comedy actors Gerard Butler and Jennifer Aniston positively sizzle throughout... on-screen and off. That's method acting.",
      "total_reactions": 8,
      "user": "SHANKROID"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "While the film does not really have anything particularly good about it, it does not have anything particularly bad about it either. Going into the film with the expectation to laugh and be entertained a lot will definitely produce a disappointment. There is, really, barely anything that is funny about the film at all, so that is a let-down.",
      "total_reactions": 0,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 1,
      "text": "I have seen my share of bad movies but this one knocks it out of the park big time. I was not entertain people I was bored out of my mind. I ask the same question that my favorite critic Roger Ebert asked. Why was this movie necessary, why was it made. Iâ",
      "total_reactions": 0,
      "user": "thelordoffilm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 1,
      "text": "Yet another movie for morons.  It continues to be a downhill slide for Jennifer Aniston who finds new ways to carve out bad decisions in selecting films.  She was so good in \"The Good Girl\" and respectable in \"Friends with Money\" and \"The Break-Up.\"  Other than that, whoever is picking vehicles to showcase any talent she may have continues to fail...miserably.  I won't even go into Gerard Butler who is immensely overrated and an absolute pathetic actor.",
      "total_reactions": 0,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2010
      },
      "score": 4,
      "text": "Another movie lately that was given hype that it was going to be very funny and again it was just okay. This i will say had the chance to actually be a good movie but i think there needed to be some rewrite areas that would have made it better. A little better action scenes and actually put the comedy into it.",
      "total_reactions": 0,
      "user": "Ruler101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2011
      },
      "score": 2,
      "text": "Jennifer Aniston will be in anything.And i mean anything.She is the only thing that kept me watching this dead end, dreadfully boring film that its only good part is where she grabs her breasts, other than that, the film is pretty terrible",
      "total_reactions": 0,
      "user": "thecurber"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2011
      },
      "score": 2,
      "text": "I always have such high expectations for Jennifer Aniston. Maybe that is part of the problem, but this movie was terrible. It was almost like a \"Mr. and Mrs. Smith\" wannabe - and I see the connection, but if you want a troubled marriage combined with action then watch that instead. It was very predictable with a silly storyline that doesn't even try to pretend the couple won't end up together in the end.",
      "total_reactions": 0,
      "user": "jrmint"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2011
      },
      "score": 2,
      "text": "Even with its starring cast -- Gerard Butler and Jennifer Aniston -- The Bounty Hunter is unfunny, predictable, and ridiculously cliched, igniting not even the tiniest spark of chemistry between Butler and Aniston.",
      "total_reactions": 0,
      "user": "KendylKlownfish"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "A very big disappointment of what could have been a great movie.",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2012
      },
      "score": 2,
      "text": "A horrible mixture of romance, cuffs, a mediocre actress and actor, lame plot; well, that's a recipe for an ugly movie. The film at its best is a guilty pleasure that doesn't seem to work on any type of level. There's no redemption for this piece of crap. I'm at a loss for words.",
      "total_reactions": 0,
      "user": "JawsLaxerDrama"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "The Bounty Hunter is one of the those films that tries to cross genres and blend different types of humor, but it fails miserably as the jokes fall flat and the action is lame.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2016
      },
      "score": 0,
      "text": "Okay The Bounty Hunter is a premise that shouldn't have been put to screen in the first place, but then you got Gerard Butler and Jennifer Aniston and you think maybe. Then you watch it they have simply no chemistry and the film is so badly written it isn't funny. It isn't bad enough to be good. I give this movie 13%.",
      "total_reactions": 0,
      "user": "SimpsonFans"
    }
  ]
}