{
  "mc_avg_user_score": 5.1,
  "mc_metascore": 58,
  "mc_mixed_rating_frequency": 121,
  "mc_movie_name": "The Twilight Saga: Eclipse",
  "mc_negative_rating_frequency": 162,
  "mc_positive_rating_frequency": 176,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 18,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "Although Bella's still the ignorant **** and the triangular romance is baffling as the HP one, \"Eclipse\" is possibly the best Twilight movie so far. Using REAL action, an understandable story, and an slighter increase in character development the movie finally develops into something more of a mindless romance blockbuster, the appropriate title this **** up saga so craved for. Overall, with bitten lips, I'll recommend it.",
      "total_reactions": 19,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 4,
      "text": "It's teeny-bopper sheen, abs, and amateurish writing obscures what could have been a good movie. It's too bad the plot centers around a love triangle and romantic lines that would make George Lucas cringe.",
      "total_reactions": 2,
      "user": "rodericrinehart"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "The majority of teenage girls and I, do not see eye-to-eye on entertainment. They enjoy things like One Tree Hill, pop music, and whatever is on MTV while they're sitting in-front of the television. Things that promote superficiality, melodrama and self-absorption. Twilight is yet another of these things. It's badly written, terribly acted, superficial, and worst-of-all, boring as hell. I cannot say enough bad things about this, and the fact that this has become as popular a fad as it has, makes me want to die a slow agonizing death from cancer just to get my mind off of it. This isn't receiving a 0 because \"I'm a guy and guys just hate Twilight because girls enjoy it\". This is getting a 0 because it is truly earned, by a movie (and book) that have no thought put into beyond the characters appearances. There is nothing redeemable to list here.",
      "total_reactions": 1,
      "user": "TheKennedyCurse"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "I've just started to write a script which will make me millionaire. Here's the recipe; dig out a few Mills & Boon romantic trash novels (3 in all), re-write the romantic hero as a cutesy-wootsey werewolf, who upon the sight of a full moon enjoys to nothing more than to roll-over and have his belly tickled. Enter the romantic anti-hero who doesn't admire having his belly tickled so much, but rather prefers gnawing at a butcher's bone and terrifying stray kittens of an evening. Let one cute human, kitten-owning teen to be a the centre of a love triangle between said doe-eyed-beasties. Put together a cast of good-looking young people to populate the families, friends and townsfolk of this fictional village. Don't let any of the protagonists kiss until the very last 10 minutes of the final movie in order to maintain a high level of suspense among the female, pre-teen audience.",
      "total_reactions": 1,
      "user": "mark"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2010
      },
      "score": 1,
      "text": "i have to admit i haven't read the books, and i watched the movies just to know what's everyone so crazy about. but this movie was super-boring. it wasn't as horrible as new moon, but the acting almost made me cry with frustration. i mean, they get paid soooo much money for this??? i just don't understand why the movies are such a big hit. it has nothing we haven't seen before!!! little advice, read anne rice, watch true blood, coz that's about real vampires. this is just a pile of crap. thank gods i'm not stupid enough to pay to see this garbage",
      "total_reactions": 1,
      "user": "darkokid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "While the other two Twilight movies were bad, this one sets a new low by having the least interesting plot, meaning it was so bad, I would've given this movie a -5 if metacritic let us do it.",
      "total_reactions": 1,
      "user": "gm101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 0,
      "text": "Okay, seriously? This is what some people consider to be a good film? This is what people were up at midnight to see? You gotta pray for humanity, even if you don't believe in God. Okay, opening rant aside, lets move onto the actual film review. This films plot is less stupid than New Moon. Here, it's basically Newborn Vampires VS The Cullens and Jacobs Pack. The problem with that is that the Newborns are hugely anticipated and so built up, but, the fight lasts barely a minute, and they don't even do damage against the good guys. Bella's a **** There she is stringing Jacob along, when we all know she'll choose Edward over him. Heck, they're discussing him turning her at the beginning of the film. Poor Jacob, his heart being played like some toy. The dialogue was crap. This is an actual piece of dialogue. Charlie Swan: What's going on? Jacob Black: [pause] I kissed Bella. [pause] Jacob Black: And she broke her hand. [pause] Jacob Black: Punching my face. [pause] Jacob Black: It was a complete misunderstanding. Whoever wrote dialogue like that probably wrote for Andromeda. The troubling thing is that in the theater I was in, people actually laughed at that dialogue. They'd probably have laughed if someone just got up their and jingled a bunch of keys. And we're supposed to believe that Bella and Edward are in love? They have as much chemistry as a rapist and his victim. And Edward still looks like a **** with his pale ass face, his disco ball impressions in the sunlight and hair being 95% gel I will add one positive thing: Bryce Dallas Howard and Ashley Greene are beautiful! Thats the only good thing I can say about this piece of crapola. To close this review, If you see a twilight fan who calls this the best film of the year, do the right thing. Slap them over the head, give them a copy of Nosferatu, Dracula, Near Dark or 30 days of night and hope they get immerssed into a REAL vampire movie",
      "total_reactions": 1,
      "user": "roddersj04"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2011
      },
      "score": 2,
      "text": "More generic sparkly vampire nonsense that doesn't deserve your attention. Despite being a flavour of the month thing, where vampires are periodically \"cool\" again for a month or two, this movie caters for screaming fangirls and nothing else, please avoid if you are over the age of 13",
      "total_reactions": 1,
      "user": "MrReviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2011
      },
      "score": 1,
      "text": "One of the most boring movies I've ever seen... one of the worst actresses I've ever seen seriously the girl really needs some acting classes. They sell the Lautner boy like a piece of meat is always half naked =___=. Pattinson acting is about 30/100. The \"great final fight\" is lame, MORE THAN LAME, for me this movie sucks.  The only point I'm giving is for the character of \"Alice\" wich I found interesting.",
      "total_reactions": 1,
      "user": "PopCulturist"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2011
      },
      "score": 1,
      "text": "How many more Twilight films must they make before they finally realize that they are creating an abomination of a franchise? Although Eclipse is better than its two predecessors, which is hardly saying anything, it continues its dull and lifeless story with very poor acting, dull imagery and a totally boring characters. Three films, three flops. This is getting ridiculous.",
      "total_reactions": 1,
      "user": "Hasriona"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 3,
      "text": "Just because of a slight improvement, the \"Twilight\" series won't win over much more fans. Once again, we have a bland script and terrible    acting.",
      "total_reactions": 1,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2012
      },
      "score": 3,
      "text": "This new dose of vampire mush for puss:es is the worst load yet. It offers no payoff at the end, and not even any highlights throughout its duration. The plot literally flatlines after the first frame.",
      "total_reactions": 1,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "I didn't like this movie,AT ALL!!! I don't why people think that this sparkling turd of the movie is so bad that I DON\"T KNOW,IT'S JUST ANOTHER STUPID TWILIGHT WITH SPARKLING OF DUMBNESS!!! I don't know why people and some stupid critics believe that this movie is really awesome,because it's not. It's like you're going to see a movie that you think this movie is going to be amazing,but I guess that this wants  to see it because the viewers and the moviegoers thinks that we are all IDIOTS for watching this this THIS Sparking Vampire! But this third one could be the least bad,it only works. Much like the two Twilight movies are bad as ever and I guess that they least embearble to the series. The scenes are too corny,the action is few of them and they actually rip-off the \"30 Days of Night\" because the director did this movie into fighting scene like that,wouldn't be explain about the fighting in the movie or in the book,those three annoying morons are still annoying and I can't stand listening with those bad vampire tones all the time,I mean please I wouldn't pay attention to Edward Cullen about his lovey dovey crap of all time,and the scenes are much standard that it's not quite interesting. So that's all I have to say and for the record I should think that this movie will be exactly a \"JUMPING INTO SHARK\"!!! Thank you,if you feel so hating that third movie into sparking crap,please avoided! If any tween girls feel drunk and crack the whole time spinning their head,feel enjoying this movie. This is the movie that the people will watch to whole time,and us PLEASE!!! (Note: I just wanted thank Owen Gilberman from Entertainment Weekly for liking this movie and I have no point that this movie could be more interesting and for idiot critic like that,I wouldn't been trusted anybody who likes this movie and for shaming liking all the time,that's too harsh to everybody else and make us bad reviewing lack of opinions that it's just not the same,screw you and Twilight,LEAVE ME ALONE!!!)",
      "total_reactions": 4,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2011
      },
      "score": 3,
      "text": "This movie was bad. This was the first twilight movie I saw. A lot of wooden, sometimes hammy, acting, dumb love scenes, terrible script, average special effects, and a bad story with bad characters. I do not recommend that you see this movie.",
      "total_reactions": 4,
      "user": "BenjaminFrazier"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "A very good interpretation of the book. If you dont like the book dont go to see the movie. Simple as that. Why people have to make such a song and dance about it I dont know.",
      "total_reactions": 11,
      "user": "buddy15"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "I like the story and the locations where the film was shot but I think that they could have chosen better actors as Bella and Edward. There is no chemistry between them (who are supposed to be a couple) and the acting is bland and fake. everything about Kristen Steward irritates me. she cant act and surely there are better female actors who could have played bella and made it convincing that she has this big thing for edward an all the drama that she goes through.",
      "total_reactions": 2,
      "user": "HOTBRUNETTE111"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2010
      },
      "score": 2,
      "text": "I saw it with my girlfriend and she's really into this stuff (vampires etc.). Maybe that's why I found this film a little bit frivolous. I don't mind if someone like it - it's his stuff. But please, I don't wanna hear about it all time. When will the new Twilight movie hit the cinemas? Really, I don't care",
      "total_reactions": 2,
      "user": "honeymoon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "The Twilight Saga Eclipse is the best movie of Twilight series there is action,there is suspense and some Horror scenes.people dont like this because this movie is from twilight saga series,but i think this is great!",
      "total_reactions": 2,
      "user": "Transforminator"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "So much action!!!! I love action movies and if you have read my reviews on the other two Twilight movies you will see how I bring up how there is not enough action. This one did not have alot alot of action but it had alot of action compared to the other two films!  The script was not slow at all! It kept you in the movie...it kept you engaged!    The actors were fabulouse! Just awesome or great. They were so good I can not explain how good they were!  My favorite scene in the movie was the scene after the tent scene. The scene where Bella asks Jacob to kiss her!  Well I hope that you enjoyed reading this reveiw!",
      "total_reactions": 2,
      "user": "portia_lautner"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Uff, finally, this third part of the twilight saga is better than the other two, the situation is incredible, and the fight with the neo vampires is sorpresive, an incredible film.",
      "total_reactions": 2,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2011
      },
      "score": 4,
      "text": "With still the incredibly weak performances, and still unintentionally funny moments( basically most of the film) make this the worst written yet, but boy is it entertaining. I give this film a  38% of a good movie.",
      "total_reactions": 9,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "Whereas the first two movies were very slow, this one tries to balance action and character development, and for the most part does it well. (I admit I've only read the first book and watched the first two movies on DVD). Fans seem split into Team Jacob and Team Edward camps, and each will have much to cheer for in this movie. I'd say give this movie a shot if interested.",
      "total_reactions": 1,
      "user": "AaronM"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "this is so much better than the first two movies.",
      "total_reactions": 1,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "Brilliant opening scene that actually looks like a real vampire movie. This makes a nice change from the first two. But unfortunately our next scene is Edward, the 110 year/old Vampire asking Bella, a 17 yr/old girl to marry him. It's a tad creepy. Th forest chase was excellent, great effects and the very thing vampire fans love. The love triangle is a bit pitiful and 'same old'. Let's hope that's the last we see of it and Jacob moves on to a far more interesting girl. Overall this is better than it's two predecessors.",
      "total_reactions": 1,
      "user": "Sabrinna"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2010
      },
      "score": 5,
      "text": "The Twilight series are just simply not worth ranting about over the net. Sure Taylor Lautner is attractive and sure there is chemistry between Stewart and Pattinson, but the franchise is crap and we all know it. Predictably when they made a successful novel, they will probably turn it into a movie, so there born the Twilight series. Written elegantly by Stephanie Meyers and ruined by Hollywood. Even though in this particular film I admired the CGI effects and the director, it still doesn't make up for the bumpy plot and high school acting. Especially Lautner, all he is good for is pleasing the audience (girls) with his abs and that is not acting (to say the least). Twilight Saga: Eclipse has its goods but there weren't enough to cover its faults.",
      "total_reactions": 1,
      "user": "OscarPicks2010"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "I thought it was great. the actors really made me feel like they meant it, and it sorta makes your head feel abit tipsy when you try to get back to reality.",
      "total_reactions": 1,
      "user": "Topvideo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "I thought this was very good. Interesting story, fine acting and cinematography. I think it was a vast improvement on the second movie in the series. I look forward to seeing the next part.",
      "total_reactions": 1,
      "user": "joeboggs"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "One of the best Twilight movies so far. You have  to go see it. Espesially if you are a werewolf fan and I am. I can not wait untill Breking Dawn comes out. Please please please do not judje the twilight saga movies by there actors and actresses or any of that. Give it a chance.",
      "total_reactions": 1,
      "user": "abduction"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2010
      },
      "score": 4,
      "text": "There's something highly appealing to the Twilight saga, though I can't put my finger on it. The characters are wooden, the plot is laughable, and the direction is uninspired. Yet I found myself enjoying Eclipse much more than the first two, but not for reasons the filmmakers would hope. It's a terrible film, but thoroughly enjoyable if you're in the right mood. Look for all of the intentional and unintentional double-entendres; their inclusion, no matter how immature they may be, are the most enjoyable thing about this movie.",
      "total_reactions": 0,
      "user": "Max"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "The film is utter nonsense, acting is horrible and the chemistry between Kristen Stewart and Taylor Lautner is horrible. I only tolerated this film because I like the books and that's not saying much",
      "total_reactions": 0,
      "user": "Julara"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2010
      },
      "score": 4,
      "text": "Parts 2 and 3 of the saga would be terrible if they weren't hilarious in their awfulness. The novels are poorly written tripe, a cut below Barbara Cartland-style romances and that doesn't help things. The movie version accentuates the lack of structure, pacing, unity, rhyme and reason. There's also a pack of Mononoke-huge wolves so that's a plus. Also, no comedy in tha last three year made me laugh as much as Twilight trilogy and although it was unintentionally funny, I respect funny. So... go Bianca and Godfrey and Jimbo, whatever your names are!",
      "total_reactions": 0,
      "user": "KundK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "Eclipse is the best of the Twilight films so far, but the series still needs a lot of improvement-notably on the acting and dialogue. Anyways, it was mostly good. I enjoyed it. A 7.25/10.",
      "total_reactions": 0,
      "user": "Harbinger"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Eclipse had better acting, directing, picture, romance and action. Altogether the movie was brilliant and I look forward to seeing it on DVD. I think you should go watch this.",
      "total_reactions": 0,
      "user": "WiseMarosis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2010
      },
      "score": 4,
      "text": "Drop the act, people. Eclipse is utter modern vampire love fantasy. Every moment is padded with tacky lines and subpar acting, and had it not been for a couple of entertaining scenes in the last 30 minutes, the whole two hours wouldâ",
      "total_reactions": 0,
      "user": "FitriAmirrol"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "I have never been a fan of the Twilight Saga I find them boring and badly paced. However I must give credit to where credit is due and I honestly have to say I enjoyed this installment. What worries me the most is that David Slade wonâ",
      "total_reactions": 0,
      "user": "thelordoffilm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2010
      },
      "score": 4,
      "text": "Love all the parts in the film without Bella and Edward being lovey dovey. Jacob is better in the book. Argh. The scenes for the supporting characters are definitely interesting and the highlight of the film",
      "total_reactions": 0,
      "user": "xiuyiwang"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "While in general, I don't find that much excitement with this saga, this third installment is actually the best one so far. The whole drama with the romance remains here but it also puts in new villains and the return of Victoria as their leader. The direction done with this third part is done much better and has a more interesting point of view in terms of script and overall story. Let's hope that fourth installment does the same or better.",
      "total_reactions": 0,
      "user": "Sonicphoto"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Easily the best movie of the series so far, and I feel it was a mostly faithful tribute to one of my favourite books.",
      "total_reactions": 0,
      "user": "tghm1801"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "There isn't much blood sucking vampires in this film and half of the vampires only drink blood from animals. I have to admit I did enjoy the story and the setting which was beautiful and worked well. However I can't say much for 'Kristen Stewart's' acting as she acts like she's stoned all the way through the movie. 'Robert Pattinson' really does his character justice and it's fair to say he has certainly made a lot of female fans. 'Taylor Lautner' has turned a few heads too and he will be appearing in the new thriller 'Abduction.' I'm also loving 'Rachelle Lefevre's' acting who portrays the character Victoria really well. All in all I'm going to rate this an eight due to most of the actor's performance's. However I have to take a point off due to it's shaky, weak start and 'Kristen Stewart's' acting which is embarrassing.",
      "total_reactions": 0,
      "user": "Jems"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2010
      },
      "score": 6,
      "text": "\"It was good not great , very optimistic , the ending felt rushed and unoriginal , the acting was for the most part ok , Eclipse surpasses New Moon , The action sequence at the end was pretty moderate to , all in all this movie is reasonably enjoyable\" .. B-",
      "total_reactions": 0,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2010
      },
      "score": 3,
      "text": "\"Is it better than New Moon?\" After viewing The Twilight Saga: Eclipse, this was the first question asked by most people, and the answer is \"Yes.\", but that doesn't mean that Eclipse is good.",
      "total_reactions": 0,
      "user": "JustinSmith"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "I went with my little sister and my girlfriend to see the movie... My Gf was falling asleep, impresive, since she is kind of a Twilight fan. My little sister, 15 YO, watched every minute of the film, and at the end she told me it sucked... Well, we all three concluded the movie sucks, specially the plot, and more specifically *Spoooooooooooooooileeeeeer* the promiscuity of Bella Swam...",
      "total_reactions": 0,
      "user": "yo_milo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2010
      },
      "score": 7,
      "text": "As yet another Husband/Boyfriend/Fiance Watching this series without any other choice, I can say that if I were to choose to watch any of the series of my own accord for some reason, so far it would be this one. The story is admitedly good, while the overall themes presented by said story may be generic, it is a workable and enjoyable plot if you ask me. The effects, no one, not even the most extreme opponents of the Twilight Saga can deny are incredible stacked against any movie.  Also this one just has more action so really, the truth is, more guys may be able to accept this one as a decent movie.",
      "total_reactions": 0,
      "user": "Axlthehunter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2010
      },
      "score": 7,
      "text": "This movie was not perfect, or anywhere near perfect at that. But I did enjoy it. Isn't that what watching movies is about? Eclipse was 10 times better than Twilight and New Moon. Sometimes the movie got to confusing, but I did enjoy it.",
      "total_reactions": 0,
      "user": "PrincessT1991"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "This movie has a nice story and more blood then the last two but could have been better. I been following twilight movies since part one came out and still none of the movies measure up to the first movie. I like this movie but i can't watch it over and over again. This movie isn't the type of movie I could watch over again. I like twilight , but it could be better. This movie is a huge bounce back from new moon. Twilight new moon was a bad movie. I didn't like it at all. This movie is bouncing back to being a good movie. The director did a fine job with putting more blood and gore in this movie. This movie was good but still it could have been better",
      "total_reactions": 0,
      "user": "iamtrent424"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "So to start off, I have never read the books and I completely hated the first movie but this movie was actually something that I liked. I feel like this movie broke away from the relationship between Edward and Bella(but it was still present), and it really took on a little bit of the horror genre (thanks to the director of 30 Days of Night). This movie starts to really show its dark side and we as the audience start to connect with some of the other characters and their lives as well as Bella and Edward's. I am not a romantic and love movie type of person but the action and the plot really moved me and kept me engaged and excited for the final two movies. I recommend this movie because it was so good, that after I watched the premiere, I had to watch it again 10 hours later.",
      "total_reactions": 0,
      "user": "TENCATIJA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "It's hard to review this movie without mentioning the other two. But I will start by saying this movie is an improvement over the last. And on par with the first. The vampire clan are a really cool set of characters that have some depth. The shapeshifters really need to find a shirt. But they aren't terrible. This movie boast some very impressive fight scenes and Alice and Victoria, this time played by Bryce Dallas Howard, look really hot. There're are a few conversations in the movie that made me laugh too. So why the 4, Bella. The whole crappy story is about the most boring and uninteresting charactor in the movie. Why should I or anyone care about who she ends up with? And everything that she said and did was just annoying. This movie is a teenage girls fantasy and I guess that's who I have to be to enjoy it.",
      "total_reactions": 0,
      "user": "Libra85"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "Thiz movie is phenomenal. A lot of movie-critics pout and sneer at thiz romantic flick. But on thiz review, I want to stay neutral and trying to be objective. If you want to be fair, whoever The Director or The Casts, will be getting a hard time to fill viewer great expectation since everyone pays full attention on thiz franchise. The original content wrote by a woman novelist, Stephenie Meyer. Twilight Saga schedules for quadrilogy. I think thiz third constellation is better than the second one, NEW MOON (2009). But the first one TWILIGHT (2008) is still the best bcoz its mysterious atmosphere and great introduction by former Director, Catherine Hardwicke. Thiz time, The Director is David Slade (30 DAYS OF NIGHT (2007)). Thiz sequel has good paces on story-telling. Although some people said the sequences was a little bit slow and boring. But I think if you want to get some precise romantic scenes, thiz is the only way to do it. Slade successfully captures the emotions for some moments with his Close-up cinematography. If we look at the main Casts, Edward Cullen (Robert Pattinson) and Isabella Swan (Kristen Stewart) do not show much improvement than before. The better performance belongs to Jacob Black (Taylor Lautner) with his deep gaze. The surprising best performance comes from the supporting Cast, Dakota Fanning as Jane, one of the Volturi members. With her accent tone and body language, Fanning made an incredible vampire aura. The blood-thirsty Jasper character (Jackson Rathbone) annoyed me a little bit. His character evolved too much. In two earlier prequels he is almost invisible, but on thiz third one, he has changed dramatically to become vampire warrior. I observe, Thiz is an odd movie, where girls love it, boys hate it. I hope they did not come to the theater just to see some good-looking faces (I am saying thiz, it is not bcoz I am a Twilighater). In the other hand, if you look inside, no matter how corny the movie is, it will be still a story to tell (I am saying thiz, it is not bcoz my close-one is Twilighter). The formula is repeated very well, Shirtless Werewolf plus Very-cool Vampire plus Girl who cannot even make up her mind, equal to Movie that totally twilight us.",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "Now here is an interesting and exciting Twilight film! The franchise jumped leaps and bounds with this film! It has a nice chunk of character development, a looming sense of impending doom, and awesome action sequences. This film feels more \"real\" and the audience begins to see the truth behind its characters. Lautner's performance here is really bad however, and the Dallas Howard replacement for Victoria was a mistake.",
      "total_reactions": 0,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "I enjoyed it. Some people take everything so seriously. Its really not bad at all but people seem to have a vendetta against it which is strange to me.",
      "total_reactions": 0,
      "user": "new2011"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "A different take on tired vampire stories. I do not know what people thought was bad about the acting. They all did their jobs exactly as they are described in the book.",
      "total_reactions": 0,
      "user": "work75"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2012
      },
      "score": 4,
      "text": "No improvements from the last movie. The plot is still weird and ridiculous. Taylor Lautner is still acting funny rather than dramatic. It still has scenes that doesn't have depth. It still lacks excitement. And it is still a book series that wasn't meant to be a movie.....",
      "total_reactions": 0,
      "user": "aaronpaul121"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "\"This latest installment of the twilight franchise is darker and deeper, the love center continues again.\"",
      "total_reactions": 0,
      "user": "Leeway"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "I think this movie was good. I watched all three movies of this saga in three days and loved the story overall. But before that i have never read any Twilight books. This movie is not totally filled with action, nor total romance. But the existing action and fight scenes were well played and looked good to me. Characters were nice and talented. These movies were good enough to pull me into this story. But don't expect me to say something like these were the best movies i have ever saw.",
      "total_reactions": 0,
      "user": "julian_zizzle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "Certainly, \"Eclipse\" is a major improvement when it comes about action and romance, but Slade's direction is too apathetic to make this film a thrilling one.",
      "total_reactions": 0,
      "user": "Potter17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2011
      },
      "score": 0,
      "text": "It sucks. I hate it. Anyways, me and my friend made a bet. We are going to see Breaking Dawn Part 1 and see how fast it takes me to puke. Who ever loses has to buy the winner a burger from a restaurant. WISH ME LUCK!",
      "total_reactions": 0,
      "user": "MaxxSwan13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "The best of the three released movies. Even so, it still manages to be pretty bad. With terrible acting, and knowing that Kristen Stewart can do so much better (as evidenced in \"The Runaways\"), if you're not already a \"Twihard,\" then don't bother.",
      "total_reactions": 0,
      "user": "Eclectomaniac"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "With a faster pace than the first two, this film is breathtaking, the story is more interesting and can keep us watching for longer than the second, an improvement.",
      "total_reactions": 0,
      "user": "vini1904"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "The social vampires, cuddly werewolves and one-expression-Bella are back!",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2012
      },
      "score": 2,
      "text": "Woof!  This movie is so bad, so poorly written, directed, and acted, that it's actually....good?  No, never.  It's horrible.  This whole universe of lore is so ludicrous it borders on blasphemy.  Vampires sparkle & they can reproduce thru intercourse?  Werewolves imprint on their soulmate?  And at the center of this world is a mysteriously special \"woe is me\" dullard female who takes 3 movies to choose between the jock werewolf and the sparkly emo vampire.",
      "total_reactions": 0,
      "user": "Pahn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "I am not a Twilight fan boy, I have never read the books nor watched the movies until the part 1 of the fourth book came out. That being said, I didn't mind this movie. Only bad thing about the acting was that Lautner sucked, Did not care for him at all. I like how they explained more of the characters' history as well. Also, I find this movie as well as the book a rather pointless journey. It would have been easier to kill off Victoria in the first book, deal with Bella's decision between Edward and Jacob in the second, then get married in the third. It just seemed like such a pointless journey especially when we all know how it's gonna play out (even if this wasn't based on a book series, It was rather predictable on who she was gonna choose in the end). Again, it was not that bad. A little predictable but I didn't mind it.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2012
      },
      "score": 4,
      "text": "Bella, just get a life or end it. We are all just done. Kind of visually stunning film. That's pretty much I and everyone else can say...",
      "total_reactions": 0,
      "user": "Jeramyd69"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "It's very unusual that the thrid ones be the better. The Twilight Saga: Eclipse is even way better than New Moon and Twilight, more involving and much entertaining and fun to see. The action sequences were finally real and watchable and it doesn't focus so much on the love thing, just that it gives action a little more flow and topic. I definetly liked this one and if Breaking Dawn (prts. 1 and 2) are like this, the series, I guarantee, will start to grow.",
      "total_reactions": 0,
      "user": "jetpackulley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "Despite the fact that I despise these films, I thought that Eclipse was fairly viewable. There was more action which was desperately needed in the previous film whilst the storyline was half decent. It still seems to lack imagination in terms of direction and also is acted fairly poorly. It is almost like the production company has decided that they barely need to try considering the fact that they are almost guaranteed the money. I can't blame them if I am honest.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "Una auténtica historia de amor, un buen triángulo amoroso, momentos únicos como cuando Bella necesita calor humano. Personajes bien construídos. Sabemos más de algunos de los Cullen. Impresionante el cuerpo de Taylor Lautner. No se le puede pedir más: o sí, que llegue ya la boda!!!!",
      "total_reactions": 0,
      "user": "jordi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "Suffers from the noticeably lazy writing and insufferable, repetitive dialog that comes with movies about fanatic teen pop culture trends. So, basically the same type of sh*t you could expect from the Twilight series. But the character development is a little stronger, it's shot competently, and it's got some action, emotion and anticipation. An enjoyable flick...but nothing to remember.",
      "total_reactions": 0,
      "user": "YoursTruly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 4,
      "text": "Almost everything about this film was a major improvement upon the first two installments, but I had a real hard time getting into this one; I found it to be slow, uneventful, and surprisingly boring.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "This movie is the best of the saga, there is action in it and now the actors say something when there is happenings nothing. Thae actors can be better and the story is better then the outer twilight movies.",
      "total_reactions": 0,
      "user": "Wiesy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "Para minha alegria deixa lua nova no chinelo e passa crepúsculo por um ponto.Já que nesse temos ação e momentos mais legais mas mesmo assim não chega a ser um grande e excelente filme só razoável.",
      "total_reactions": 0,
      "user": "LoRevisor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Eclipse is better than its predecessors and does not disappoint in almost anything.",
      "total_reactions": 0,
      "user": "BrunoAD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "An interesting and beautifully filmed third installment of the Twilight saga, which is not as bad as everyone says it is.  It is entertaining, some dull acting (Pattinson especially), but the visuals are great and the battle at the end is very entertaining.  I enjoyed this movie and have enjoyed how the story is unfolding on the big screen.",
      "total_reactions": 0,
      "user": "DibbHansen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 3,
      "text": "'The Twilight Saga: Eclipse' basically consists of some people laying in a tent and communicating through poor acting and a lackluster screenplay that they are cold and at the climax a big tree falls. That's all that happens. Nonetheless, its better than its predecessor.",
      "total_reactions": 0,
      "user": "nickrovert"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2014
      },
      "score": 6,
      "text": "I actually enjoyed this. It wasn't fabulous, but it wasn't so much as the other Twilight movies. It didn't have any ridiculous lines that were ridiculously acted like in the others.",
      "total_reactions": 0,
      "user": "chw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "While it could've been far worse than what the audience was expecting, \"The Twilight Saga: Eclipse\" is still a failure in cinematic terms and only devoted fanboys/fangirls will find satisfaction.",
      "total_reactions": 0,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2015
      },
      "score": 4,
      "text": "Es superior en la mayoría de los aspectos que su antecesora, Eclipse es un capitulo \"relleno\" que no aporta ninguna novedad a la historia, la batalla final no es épica o increíble, pero es pasable... Un capitulo sin muchas sorpresas que llega al punto de ser un poco aburrida y tediosa.",
      "total_reactions": 0,
      "user": "JohnMasterL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2016
      },
      "score": 6,
      "text": "While Eclipse is a HUGE improvement over the overly serious New Moon, it still is lame and has a lot of sighs and overdramatic love. But that's Twilight!",
      "total_reactions": 0,
      "user": "LinttaFlamingo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2016
      },
      "score": 2,
      "text": "Once again, the \"Twilight\" franchise still proves to be as tedious, frustrating and flat-out even more boring than ever. \"Eclipse\" is probably the most unnecessary installment of the franchise, for the most part, it feels like padding and filler until the next chapter comes along. So we sit through the things we expect.",
      "total_reactions": 0,
      "user": "MrMovieBuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "It is a huge improvement on this franchise.  For one, it actually has a plot, and though its performances are still terrible, it offers a little bit more than the first two films",
      "total_reactions": 0,
      "user": "JosephASowell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2016
      },
      "score": 3,
      "text": "Here we go again. Twilight: Eclipse is the unwanted sequel to the unwanted sequel to the not-so-well received Twilight, and it ends setting up another unwanted sequel. Once again, we have ourselves a poorly paced, poorly edited, poorly acted, poorly written and melodramatic movie with some of the most cringey dialogue i've heard in a film. Once again we have topless teenage boys roaming around, except this time, they're more abundant. We have a horribly filmed action scene in the third-act filled with incomprehensible shaky cam that irritated me to death. I am not looking forward to the next installment, and i'm going to give Twilight: Eclipse a 3/10.",
      "total_reactions": 0,
      "user": "ThreeboxIndoors"
    }
  ]
}