{
  "avg_user_score": 8.7,
  "metascore": 38,
  "mixed_rating_frequency": 13,
  "movie_name": "The Outsiders",
  "negative_rating_frequency": 6,
  "positive_rating_frequency": 105,
  "pro_critic_reviews": [],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "Let me just say that I read \"The Outsiders\" in novel form before having seen this movie. Viewing \"The Complete Novel\" edition, I felt that this adaptation did not serve the book the glory it should have. While the locations and sets were fitting to the story, and the plot is very faithful to its source material, the problem is the unconvincing acting. Thomas C. Howell lead in one of his early roles as Ponyboy, a greaser from Oklahoma. His friend Johnny, played by Ralph Maccio, becomes responsible for a murder of one of the Socs, a class of rich teens,  and the two have to face the trouble they've made.",
      "total_reactions": 1,
      "user": "Akaman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "A very hard hitting and moving story about rival gangs and the effect it has on the lives of the people in and around the gangs. The story follows two of the younger greasers after one of them accidently kills a rival gang member in self defence. They leave town and believe they will have to remain on the run forever.",
      "total_reactions": 2,
      "user": "wildermovreview"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "The first problem, the actors not that they were bad but the fact that the movie relied on them too much. It had good action and seemed believable. Until they started talking. The problem is that it followed the book almost line by line and that made it very cheesy and the buff cool kids would suddenly spout a line from a poem and that ruined it.",
      "total_reactions": 1,
      "user": "Creviewer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2014
      },
      "score": 4,
      "text": "The Outsiders was a very good book, but the movie doesn't even come close. Right from the get-go, the story dwindles and the actors portray their characters awkwardly, almost as if they have no clue what type of character they should be playing. Add this to the list of another one of Coppola's bombs.",
      "total_reactions": 1,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "So **** stupiD!  The book is even worse.  I am being super super super super super nice with this review!  it is a -0.0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001/100 stars.  And that is super nice too.  the worst author and movie ever",
      "total_reactions": 3,
      "user": "ChespinJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Director Francis Ford Coppola continues  to adapt S.E Hinton's  novels onto the big screen, but this time he adapts her first debut novel onto the big screen. Before watching the film I have read the novel,so far  Kathleen Rowell's screenplay misses nearly perfect realized film about adolescents. Coppola's cast of young stars are perfect and talented we can see them playing  the characters. C. Thomas Howell was missed cast his performance as the main character \"Ponyboy\" was not terrible but I think he was stale. The screenplay does not give depth to the protagonist; the film's location is spot on! While the locations and sets were fitting to the story. Coppola's direction is good, he captures dramatic tension and we have sympathy for the characters. The film creates the scenes from it's source material, which is good and fans of the book will love. The performances were great, the script needed some work. Grade B+",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2014
      },
      "score": 9,
      "text": "As I the movie came to an end, an amazing feeling swept over me. Growing up as a youth in Long Beach, California in the twenty-first century, it always seemed that the problems the youth face today were a lot worse than in the past. This movie does an astonishing job illustrating the crazy and dangerous life that teenage boys lived through in the American heartland over four decades ago! As I watched, the similarities between my adolescence and theirs gave me a very grateful feeling to have made it out of that stage of my life. For me, this movie was a very spiritual reminder of the possible dangers, temptations, loyalties, friendships, and overall craziness of teenage life.",
      "total_reactions": 0,
      "user": "geenucoco"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "An amazing book into an amazing film, they captured the characters amazingly with the selected actors and were able to bring many of the elements of the book to life. It was emotional and a great movie, a cinematic masterpiece.",
      "total_reactions": 0,
      "user": "pietheman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2016
      },
      "score": 6,
      "text": "Francis Coppola has made a well acted and crafted but highly conventional film out of S.E. Hinton’s popular youth novel, The Outsiders. Although set in the mid-1960s, pic feels very much like a 1950s drama about problem kids.",
      "total_reactions": 0,
      "user": "TheMovieScene"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2016
      },
      "score": 9,
      "text": "I liked this movie a lot when growing up. Its a great coming of age story that is worth watching for all adolescents. Would highly recommend checking it out.",
      "total_reactions": 0,
      "user": "MasterRiley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2016
      },
      "score": 8,
      "text": "The Outsiders is a moving tale about the life of Socs and Greasers.  The film is well made, and carries a classic effect along with it.  One cannot help but laugh when Dally says, \"Let's do it for Johnny!\"  An all-star cast makes the film much better than it could have been.",
      "total_reactions": 0,
      "user": "laxdrew2"
    }
  ]
}