{
  "mc_avg_user_score": 6.4,
  "mc_metascore": 52,
  "mc_mixed_rating_frequency": 26,
  "mc_movie_name": "The International",
  "mc_negative_rating_frequency": 14,
  "mc_positive_rating_frequency": 45,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "Im going to be brief on this one: is you're looking for a mindless action film, then there is nothing to see here. But if you're looking for a movie with a good plot and mature story, then you will be pleased!",
      "total_reactions": 1,
      "user": "Neosapien"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2012
      },
      "score": 4,
      "text": "A lot of drama, but not a lot of suspense. The music was limited which made me bored for most of the movie. The action didn't get under way until the middle of the movie. Overall, a toss-up movie with a slow plot.",
      "total_reactions": 0,
      "user": "jwt7000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2016
      },
      "score": 7,
      "text": "The International is a thoroughly engaging action thriller with a top-notch lead performance from Clive Owen and sleek, stylish director from Tom Tykwer. Just as engaging as Tykwer's past films, The International examines the corrupt activities of a bank and uses it as a moralistic play when it comes to reality and the way bankers seem to get away with everything. For this, the film can be somewhat unsatisfying due to its lack of pay off, which many will find problematic, though I thoroughly loved the ending. The cinematography is very good, as in all of Tykwer's films and really gives the film this stylish, sexy look. That said, there are problems. The one major action set piece is really, really dumb. Like, earth-shatteringly dumb. Additionally, it can be hard to follow. Not too hard to follow, but there is certainly some confusion along the way. All in all, The International is a stylish thriller with an overly complicated story, an ending that I liked but many will not, and can be quite implausible at times. Overall, it is a truly flawed film that has more good than bad to it, plus it is definitely entertaining.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "The International: 6 out of 10: The International has great timing. Not since The China Syndrome opened up 12 days before the Three Mile Island Accident, has a movie seemed so prescient (Or in The international’s case ripped from the headlines.) A therein lies one of The International’s two main problems. It is ripped from the headlines. The problem is the headlines in question are from 1989. The movie is about The BCCI collapse. Unfortunately the script mimics the actual late eighties scandal a little to accurately for its own good.",
      "total_reactions": 0,
      "user": "juliankennedy23"
    }
  ]
}