{
  "mc_avg_user_score": 5.6,
  "mc_metascore": 33,
  "mc_mixed_rating_frequency": 16,
  "mc_movie_name": "The Stepfather",
  "mc_negative_rating_frequency": 12,
  "mc_positive_rating_frequency": 17,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "THE STEPFATHER is a good movie, but it could have had more stuff happening in it.",
      "total_reactions": 1,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2012
      },
      "score": 0,
      "text": "The worst remake movies i seen  is The Stepfather (2009). and  Psycho (1998). Planet of the Apes (2001). The Wicker Man (2006).  Red Dawn (2012) , And wait for more bad remakes movies Carrie 2013 and . Robocop 2013.",
      "total_reactions": 1,
      "user": "Dollis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "Okay, so I first saw this on blu-ray, which is unrated. I did not know the theatrical was PG-13. I sort of looking for a bloody slasher film with a psychopathic stepfather, you know, something that excites me on a boring evening. I'm not sure what the differences were between the unrated and PG-13 versions, but no matter how you look at it, this film really doesn't work, despite its great premise (I wasn't aware it was a remake until later). He's supposed to be the guy everybody trusts, your classic closet serial killer who's otherwise normal...well, almost otherwise normal. For a guy who's supposed to be a step ahead of everyone else, it's pretty clear he's not one of the brighter killers to exist. It's like he's asking to be caught, with how he suddenly quits his job because he has to provide identification, murders people who think he's suspicious, and even keeps his **** browser history intact on his computer. Seriously? He doesn't even manage to clear his browser history? Couldn't he have at least made a separate user account on Windows so no one else could see it? But no, he decides to leave his entire web activity available for public eye, which, big surprise, helps a lot in his eventual discovery. The \"cell phone with low battery\" trick is actually used here, which hasn't been suspenseful for at least a decade. He somehow loses a fight to a teenager who is clearly a worse fighter, tries to cover up his evidence with a lock that someone simply forces open, and lives an open lie that you can't imagine anyone in the movie possibly believes, sans the desperate person he's scheduled to marry. There's really nothing special at all about this film, and its nonsensical premise isn't lived up to in the execution (no pun intended). Plot holes are everywhere, believability is kept to a minimum, the characters aren't anything special, we never learn the bad guy's true motives, everyone in the movie seems to have a serious association problem (considering they dismiss his picture on America's Most Wanted as nothing to worry about, or that he never allows himself to be photographed, or that he refuses to provide proper identification when asked, etc.), and really, the bad guy is just not very smart. Yeah, he tries to be charming like a typical psychopath, but he's not exactly calculated in any way whatsoever. His smarts as a killer end at his ability to fake a smile. Pretty weak film, especially with an antagonist who is an idiot and is wearing a sign on his forehead the whole time saying he's the killer on America's Most Wanted, which is naturally dismissed by every single person except the main protagonist. Yeah, that's weak.",
      "total_reactions": 0,
      "user": "solutions10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "While I have not seen the original, this movie on its own is not scary, not even very suspenseful. A few scenes showed promise, but everything here seems so cliche'. The acting is solid, and there are a few nice shots, but not enough to push it over being a polished bland film.",
      "total_reactions": 0,
      "user": "Rumblebeelove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2014
      },
      "score": 1,
      "text": "Generic is the perfect adjective for this horrible so called horror movie. You'll be bored until the last 5 minutes of the movie and then boredom becomes stupidity.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "It was pretty good. It could have been way better though. It was entertaining and very intense most of the time but unfortunately the suspense was limited. I really hope there is a second one because it will out do this one big time since the writers know what the flaws are in this one now. Plus, the second one should really be rated R.",
      "total_reactions": 0,
      "user": "mds03"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2016
      },
      "score": 7,
      "text": "It's not that bad acted, it's entertaining and it's just some mindless fun. I mean the situations the characters were in were pretty unbelievable and the ending was just too much over the top but it's a mindless popcorn entertainment like most PG-13 horror movies these days.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "If the movie's attic-bound climax is a little predictable and the plot holes rather gaping, The Stepfather, unlike many of its more prestigious A-class competitors, is never less than entertaining.",
      "total_reactions": 0,
      "user": "avamiller21"
    }
  ]
}