{
  "mc_avg_user_score": 6.1,
  "mc_metascore": 52,
  "mc_mixed_rating_frequency": 33,
  "mc_movie_name": "The Switch",
  "mc_negative_rating_frequency": 9,
  "mc_positive_rating_frequency": 34,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "\"The Switch\" has its fun and joy thanks to the weird chem of Jason Bateman and Jennifer Aniston....but its all too obvious.",
      "total_reactions": 4,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "It's much better than I would have thought based on the 53 Metascore. It's not a slapstick comedy, but there are a ton of laughs. Juliette Lewis and Jeff Goldbum are terrific and much more restrained/deadpan than you'd think.  Bateman is awesome, as usual, and Aniston delivers exactly as you'd expect her to.  It's not a movie you'd want to ever see more than once, but it's certainly worth seeing once.",
      "total_reactions": 3,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2010
      },
      "score": 6,
      "text": "This is a nice movie ... but again what can you expect more from a romantic comedy ... the feel is nice !!",
      "total_reactions": 2,
      "user": "rachit"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "Movie definitely perks up once young Mr. Robinson shows up...terrific chemistry between him and Jason Bateman.   Look for the scene in which son (unbeknownst to him) tells father why he collects picture frames--and why he keeps the original artificial pictures.",
      "total_reactions": 1,
      "user": "housetales"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2011
      },
      "score": 5,
      "text": "I thought this was a cute film. I actually know women who want to do a similar thing to Jennifer Aniston's character and found a lot of humor in that situation. How can you dislike Jason Bateman? He's so adorable, as was the kid. Again, another movie with a predictable ending, but sometimes that isn't such a bad thing.",
      "total_reactions": 1,
      "user": "jrmint"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "â",
      "total_reactions": 2,
      "user": "BHBarry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Like with many movies you have to accept the initial premise. Once you do will find there's a surprisingly touching side to this movie that I never saw coming. Probably Jennifer Aniston's best movie as she is not the lead character. And every word by Goldblum is brilliance.",
      "total_reactions": 1,
      "user": "Slickest"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2010
      },
      "score": 6,
      "text": "It was a very smart movie with great acting, especially the young child (Bryce Robinson) in the movie. I don't like Jennifer Aniston, but she was decent in this movie, and Jason Bateman, was (like always) funny, and is a great romantic comedy. It wasn't as good as I expected, but the 53 metascore? I don't get it. I believe somewhere in the early 60s would be more appropriate. Jeff Goldblum was okay, and I wasn't really feeling the sarcasm like I did when Juliette Lewis was in Whip It, but honestly, it feels like everyone is sort of missing a puzzle piece from other movies that they didn't show in this movie. However, Patrick Wilson was the best actor, where you really wanted to punch him in the face, which is what they want you to expect. Predictable and cheesy, yes, but The Switch is a good romantic comedy that is smart, funny, and at times touhing. Go see The Switch.",
      "total_reactions": 0,
      "user": "sesamejack"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "Sebastian is so twee, were he a girl, his name could only be Belle. But Kassie had a son, a boy too sensitive for his own good; the sort of kid who worries about the fate of aquarium-bound creatures, which is to say, he probably took the plight of the imprisoned **** \"sea-kittens\" in \"Finding Nemo\" to heart. Sebastian was a test-tube baby. In his most primordial form, he too swam around in an enclosed environment. The aquarium is at a Chinese restaurant, where Wally is reunited with Kassie, his best friend who's back in New York after a seven-year separation. Actually, Kassie already has a best friend(Debbie, played by Juliette Lewis), as does Wally(Leonard, played by Jeff Goldblum), but Wally is like a boy who doesn't know he's supposed to kiss the girl. Now Kassie is home again, but with baggage, so he thinks; baggage in the form of a test tube baby who grew up to be boy with the sort of singular personality that can test one's patience. After Kassie gives Wally the lowdown on her twee son, the oblivious father suspects that his best friend is exaggerating, since the lad he sees at the fish tank appears perfectly normal; an all-American boy, by Wally's estimation, who could have originated from Roland's sperm. But then the happy child steps aside, and that's when we first lay eyes on Sebastian, the animal-rights activist and hypochondriac. To Wally's chagrin, Sebastian would rather eat rice with soy sauce than the duck that the man-child shelled out big bucks for, because thanks to the Internet, the kid knows all about foie gras. It's as if Sebastian has an oversized heart, due to the force-feeding of on-line information which his preternatural compassion for animals stoke. In another film, for instance, Mike White's \"Year of the Dog\", a funny, but corrosive film that doesn't love its characters, Sebastian's veganism and overall neurotic essence would be roundly ridiculed. \"The Switch\" doesn't treat Sebastian like a loser. The film handles him with kid gloves, which at times can be detrimental to the inherent drama of Wally's rivalry with Roland for Cassie's affections. Her sperm donor, a nice guy, is too nice, exactly what you'd expect from an assistant professor in feminist studies at Columbia University. Because the man has no notable flaws, some moviegoers may deem Wally's plan to tell Cassie the truth about the sperm as being selfish and narcissistic. At a rock-climbing park, site of Sebastian's birthday party, it's a park employee and not Roland who loses his patience with the boy's unwillingness to have fun. Due to Roland's discipline in academia, emasculating Sebastian with a boorish outburst would belie the sensitivity that Kassie presumes a feminist studies professor comes equipped with. Roland's stability is better than Wally's imbalances. The film never proves, without the shadow of a doubt, that Wally is the better husband for Kassie, the better father for Sebastian. Biding his own time, without any regard toward what's best for mother and child, Wally finally decides it's time to grow up, to step up, and be a man. Thirteen years? That's too late in some women's books. But since \"The Switch\" is not another dispiriting romantic comedy, it's good by default(Sebastian, played by Thomas Robinson, earns your sympathy), but imagine how much better the film would be if Kassie was the one to intuit the truth about her son, by recognizing the \"boy\" in the boy.",
      "total_reactions": 0,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "A very fun and charming movie. It far exceeded my expectations. Some romantic comedies make it seem as if the two leads have no chemistry together but Jason Bateman and Jennifer Anniston were wonderful together.",
      "total_reactions": 0,
      "user": "Island7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "This is another trite movie where you feel as if you are once again watching Rachel for the 1000th time. Jason Bateman and Bryce Robinson have some chemistry, but it is not enough to save this movie as you can't help but feel they are doing double duty as they provide any watchability this film has while propping up a cardboard cut out of Jennifer Aniston where the lead actress should be. A DVD rental reserved for the weekend when all the new releases have been snatched up.",
      "total_reactions": 0,
      "user": "Amber"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2010
      },
      "score": 3,
      "text": "I left this film thinking,  An OK romantic comedy; nothing great, but somewhat enjoyable.  Maybe worth renting.  Yet., I woke up in the middle of the night disliking this movie. Something about Jennifer Annisonâ",
      "total_reactions": 0,
      "user": "mandm1951"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "This is one of those rare movies where I will have to disagree with the metacritic score. As far as romantic comedies go this is a solid one, jason bateman does a great job, especially in his scenes with the kid, and jennifer aniston's presence in a romantic comedy doesn't hurt as usual, although it also doesn't add much in this particular movie. Special praises to Jeff Goldblum, whose character may seem superficial unless you actually lived in nyc and worked in a firm like the one JBateman's character works.",
      "total_reactions": 0,
      "user": "istanbul"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2011
      },
      "score": 5,
      "text": "I sincerely liked, solely for one reason, the movie proposed something and fulfiled (something rare nowadays in romantic comedies), it was funny, cute, light, and of intelligence break, showing such how the world nowadays is accelerated and we are always leaving the essence aside, forgetting the small details of life and when we wake up the time got through.",
      "total_reactions": 0,
      "user": "jimmytancredi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "As horrible as the name is the film is incredibly entertaining. I am shocked to find out that this film was getting horrible reviews. I get it the story line is predictable as they come but it is a completely different take on romantic comedies of past. Overall this film is a must grab at the redbox but fell short at the box office as it should have.",
      "total_reactions": 0,
      "user": "filmtrashreview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2011
      },
      "score": 4,
      "text": "The Switch had a potential premise, but fails to produce any laughs or predictability.",
      "total_reactions": 0,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2011
      },
      "score": 2,
      "text": "Wally (Jason Bateman) and Kassie (Jennifer Aniston) have been best friends for years.  Wally missed his opportunity years ago to be with her because of his neurotic behavior, so he is now forever stuck in the friend zone.  Which is just fine by him until Kassie decides it is time for her to have a baby, by a donor.  He tries to convince her that this is the wrong way to go about it, but she does it anyway.  At the â",
      "total_reactions": 0,
      "user": "heybuddymovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 5,
      "text": "The Switch is surprisingly smart and funny and generates great chemistry between Jennifer Aniston and Jason Bateman but the movie fails due to it ending up at the heart of it being completely self centered. I give this film 46%.",
      "total_reactions": 0,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "One of Jen Aniston's heartier flicks of recent years--a modern and interesting subject. Bateman and Aniston are not only a fun pair, but you'll root for them.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2015
      },
      "score": 6,
      "text": "It is a pleasant and nice romantic comedy that maybe doesn't offer anything new but incorporates humor at exactly the right moments that make the film enjoyable",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2012
      },
      "score": 5,
      "text": "This movie is hardly that interesting to watch. I saw the movie, but I could really care less about it. It certainly wasn't miserable to watch, but i hardly believe this passes as a comedy.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "Interesting to see only 44% of users liked this? I personally enjoyed it a lot more than I thought I would. A formulaic rom-com, but the film has some more serious undertones as well. I cared for the characters of The Switch more than those of other films of the genre. I recommend this if you haven't considered it already.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Normally movies on netflix suck, but not this one. There was one scene that was really touching and happy which almost made me cry. Go See this movie.",
      "total_reactions": 0,
      "user": "Gary_2013"
    }
  ]
}