{
  "mc_avg_user_score": 7.1,
  "mc_metascore": 64,
  "mc_mixed_rating_frequency": 10,
  "mc_movie_name": "The Way",
  "mc_negative_rating_frequency": 2,
  "mc_positive_rating_frequency": 21,
  "mc_pro_critic_reviews": [
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 83,
      "summary": "They're an entertaining foursome, and Estevez guides them through lovely scenery, clever sight gags and personal confessions with leisurely skill."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2011
      },
      "score": 83,
      "summary": "Estevez treats the drama with a straight-faced, utterly earnest approach with dual respect for the material and the audience's awareness of how it can go wrong. By playing it straight, The Way never goes off the deep end."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 83,
      "summary": "There's a contemplative loveliness to The Way, an affecting personal project both for Emilio Estevez, who wrote, directed, and plays a small role, and for his father, Martin Sheen."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 80,
      "summary": "The beauty of the movie, in fact, is that Mr. Estevez does not make explicit what any of them find, beyond friendship. He lets these four fine actors convey that true personal transformations are not announced with fanfare, but happen internally."
    },
    {
      "critic": "Angie Errigo",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2011
      },
      "score": 80,
      "summary": "Gentle, likable and profoundly touching, it makes you want to dig out the hiking boots and make the same journey."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 75,
      "summary": "Unafraid of stillness and scenes of quiet contemplation, the film also celebrates companionship and community, which are all good reasons to embrace the experience along The Way."
    },
    {
      "critic": "Calvin Wilson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "Pleasant, well-acted but somewhat overlong, The Way was written and directed by Estevez, who's perhaps best known for his acting career (\"The Breakfast Club\")."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "Estevez directs with ease and assurance but, both internally and externally, not enough happens to these people."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "There's nothing startlingly original about Estevez's screenplay, yet it has a modesty you seldom see when Hollywood tackles spiritual subjects."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "Estevez keeps his touch light, with a minimum of pedantry. The Way is really a gift from this son to his father. Sheen, gradually revealing a man painfully getting reacquainted with long buried feelings, who gives the film its bruised heart."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "Funny, moving, hip and transcendent all at the same time, The Way is both deeply thoughtful and enormous fun to watch."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "A heartfelt project, scrappy and engaging, The Way has its way with audiences despite, not because of, its sentimental excess."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "It's a sweet and sincere family pilgrimage, even if a little too long and obvious. Audiences seeking uplift will find it here."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "It's a plucky film that covers a lot of ground and uncovers this wonderful, ancient ritual that people of many faiths and from all walks of life take on."
    },
    {
      "critic": "Sheri Linden",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 70,
      "summary": "The gentle drama offers an intriguing look at the contemporary version of an ancient ritual, and is anchored by the on-screen work of the writer-director's father, Martin Sheen. But Estevez doesn't push far enough, opting to focus on generic lessons in camaraderie and the primacy of the moment."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 70,
      "summary": "If The Way is sometimes shaggy and inelegant, and flirts with sentimentality the whole way through, I was finally overcome by its dignity and sincerity, and by the rough, rude, gorgeous magic of its journey."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 67,
      "summary": "The Way never arrives anywhere you couldn't see coming a mile away, but it does so with such empathy that its conclusions feel comforting rather than overly predictable."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 67,
      "summary": "The performances are solid, the cinematography is stunning, and the setting is intriguing. But the whole thing feels bloodless, hitting us over the head with its understatedness. Anytime a film's soundtrack features The Shins, James Taylor, and Nick Drake, you know you're in for an overly laid back time."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 67,
      "summary": "Essentially, The Way starts out as \"Eat Pray Love\" and takes a long, surprising trip toward becoming David Lynch's \"The Straight Story.\" And that's a longer trip than a mere monthlong trek across Spain."
    },
    {
      "critic": "Kerry Lengel",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "One can forgive the trying-too-hard aphorisms -- \"You don't choose a life ... you live one\" -- but savvy cinephiles are sure to be annoyed by Tyler Bates' hypnotic ambient-folk soundtrack, studded with such despoiled musical gems as Nick Drake's \"Pink Moon\" and the Shins' \"New Slang.\""
    },
    {
      "critic": "Ben Sachs",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "Estevez strains to prove his earnestness at every turn, undermining the film's good intentions with a surfeit of explanatory dialogue and a sappy adult-contemporary soundtrack. But for all his awkwardness Estevez is undeniably sincere, regarding both people and nature with disarming good will and maintaining a steady, soothing pace that allows the life lessons to resonate."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "It works better as an idyllic travelogue through northern Spain than as a familial drama; despite the real-life relationship between filmmaker and star."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2011
      },
      "score": 50,
      "summary": "The pilgrimage is still long but, even with the crosses they bear, these are pilgrims lite – perhaps it's the modern way."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "The Way is a good, cheap vacation. At times, you wonder if Estevez isn't creating a cracked therapeutic remake of \"The Wizard of Oz.'' He's got the nerve and the heart, all right. I'm less sure about the brains."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Here and there, the actor invests the kind of feeling that makes The Way come alive in human terms."
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "As a director, Estevez exhibits a bland visual sense, but he does manage to convey some of his scenic locations' multifaceted textures. Mostly, though, his dramatically inert, spiritually generic The Way seems like it was far more fun to shoot than it is to endure."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 25,
      "summary": "With The Way, writer-director Emilio Estevez has made a respectable failure. What's respectable - and undeniable - is that this is a sincere effort to make a film of sensitivity and spiritual richness."
    },
    {
      "critic": "Andrew Schenker",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2011
      },
      "score": 25,
      "summary": "The making of The Way must have been a nice moment for father and son, but why must the rest of us suffer?"
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "\"The Way\" is a staunch film; it knows what its identity is, and it doesn't try to elude from it. How many films can one recall that set out to do the same? In doing so, Estevez has created an experience for the viewer that is blithesome in spirit, modest in bearings, and introspective in tone. Moreover, it doesn't appeal through flash; the actors act within their limits, its displays of pathos avoid brazen treacle, and the plodding itself, although lighter than it should be, results in a soul-quest that touches upon the faculties of regret, despair, loss, and spirituality without affectedly being as so, assuming a semblance to a pretentious sermon.  Notwithstanding the cloud of predictability that is suspended above the filmâ",
      "total_reactions": 1,
      "user": "FDT44"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "This afternoon we went to see \"The Way,\" All four of us found the film to be stunning.  The scenery is breathtaking and the personal stories of both the protagonist  and of the people he meets and travels with;  and the adventures they encounter; - or generate;  are wonderfully realized.  It is a \"road\" story of the highest caliber.  See it..",
      "total_reactions": 1,
      "user": "Benarden"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "This movie started off a bit awkwardly in that the acting was a bit stiff and too put on, but once the tragic news came to Martin Sheens character, the acting and the story got more interesting and better. Overall the adventure, the supporting characters, the open European countryside makes the movie a really good watch.",
      "total_reactions": 1,
      "user": "Klumzy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "Martin Sheen still has a commanding screen presence that The Way is a joy to watch. The best part of The Way is the idea that less is more. Some scenes provide such emotion without a single word being said with the end moments being especially satisfying. The story is of Tom (Martin Sheen), a optician who is quite content with his weekly golf games. However one day he receives a phone call from a police chief in France telling him his globetrotting son Daniel (Emilio Estevez) had been killed on the Camino de Santiago (The Way of St James). He immediately heads to France to identify the remains but while there decides to take Daniels ashes on the Camino. While on his journey he is joined by eternal optimist Joost, an overweight Dutchman(Yorick van Wageningen), A chain smoking Canadian (Deborah Kara Unger) and an Irish Writer with writers block (James Nesbitt). Despite the fact he wants to handle his grief in private he comes to learn he needs the others as much as they need him. Itâ",
      "total_reactions": 1,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2012
      },
      "score": 3,
      "text": "If the Barrymores or Fondas are the first family of acting, the Sheen/Estevez clan deserves serious consideration as the last.",
      "total_reactions": 1,
      "user": "NoahCoward"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "Quite simply, one of the 10 best films of the year. Sheen and son provide a needed portrait of  a man who seeks to honor his late son and discovers himself in the process.",
      "total_reactions": 1,
      "user": "RichieBoy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "I found this on Netflix Instant so I decided to end my night with this movie.  It was a really good pick and I am glad I watched it.  The scenery is nice and the characters really grew on me.  Good ending as well.  I would recommend to a friend or watch again which is the ultimate review.",
      "total_reactions": 1,
      "user": "Hexteque"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "absolutly great movie. it was both comical, dramatic, and interesting. martin did great at his role, and alot of the side characters (his friends) were terific. they were hilarious, and serious when it called for. this movie was a great one.",
      "total_reactions": 1,
      "user": "Chaseyo2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "Everyone has their own, personal reason for choosing to walk the real 500 mile Camino de Santiago.  This is a trail which begins in France, winds its way through the French Pyrenees, across northern Spainâ",
      "total_reactions": 0,
      "user": "CitizenCharlie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "I must admit, when I started watching The Way, I questioned the necessity for a scripted narrative at all. I found the beginning a little soppy and melodramatic, and thought it might have been a more interesting film to watch if it were simply a documentary following the real-life Martin Sheen on the Camino de Santiago pilgrimage. But around halfway through the film, I found my self hooked, and completely immersed in this story of a father honouring his recently deceased son by completing the journey that killed him. Sheen's performance as the grieving Thomas Avery is utterly compelling, and the supporting cast of international actors all add something to the story and give the rag-tag group of pilgrims an interesting dynamic. The story is propelled along nicely by Emilio Estevez's fluid direction, and by a great eclectic soundtrack, and you're given plenty of time to ponder the characters' true motivations and the magnitude of the journey they are undertaking. Some of the plot points are a little jarring, doing little to advance the story, and you could argue that film goes on a little too long, but by the end of the film you really do feel like you've been on this amazing journey yourself. So just sit back and enjoy an incredibly well performed, emotional and personal piece of filmmaking, and take time to appreciate the breathtaking beauty of the Spanish countryside.",
      "total_reactions": 0,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "I love Martin Sheen and it is hard to be critical of him or Emelio...This is a decent effort, the film is well filmed and has a very genuine feel. However the message is simplistic and littered with clichÃ©s.  (Witness the stock Irish writer character, played by James Hesbitt...) Some of the characterisation and some scenes are clumsey and not credible. The scenery is beautiful and this film will do a lot to promote The Camino  The soundtrack was not bad but some of it jarred...Worth a look, for those looking for a little spirituality....",
      "total_reactions": 0,
      "user": "8486"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "The messages and meaning of The Way are not immediately apparent, because like the characters in the film, its a journey of discovery and fulfilment for each individual who views the film, religious, curiosity, tourism or just general hiking interest. This film truly has something for everyone and writer and director Emilio Estevez has did a wonderful job of persuasion and feelings of contentment.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "I wanted to really like this film. It is an admirable project underlying the actual relationship between the director and star. But it was cliched, predictable, and overly religious. The scene where Tom gets drunk is very poor and seems to be stuck in their so someplace in the 2 hour running time he gets to say how he really feels. Although I do not believe that what people say while drunk is the truth; just the opposite.The scene with the Gypsies once again looks stuck in so we get the message; it needs to be subtle.So the question becomes is it worth a look? It's right on the borderline between a B- and C+. The scenery is nice although there is not enough of it. The road could have been a character but it is trivialized. Plenty of loopholes: how does a man his age just do a 500 mile walk? Where are all the clothes stored? well, having read what I just wrote I can't recommend it. Nice try that falls short.",
      "total_reactions": 0,
      "user": "RobinsNest"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "Saw this on Netflix last week. Great movie, and Emilio Estevez does a superb job directing it. Martin Sheen is still pretty busy after all these years, and he's still a great actor. He's also doing a documentary show called Breakthroughs Martin Sheen that I've seen.",
      "total_reactions": 0,
      "user": "mikewilliams"
    }
  ]
}