{
  "avg_user_score": 6.3,
  "metascore": 50,
  "mixed_rating_frequency": 76,
  "movie_name": "The Purge: Anarchy",
  "negative_rating_frequency": 41,
  "positive_rating_frequency": 132,
  "pro_critic_reviews": [
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2014
      },
      "score": 80,
      "summary": "It's also breathtaking to watch a throwaway studio sequel break its corporate chains before your very eyes and become something thrilling and dangerous and alive."
    },
    {
      "critic": "William Goss",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2014
      },
      "score": 78,
      "summary": "The story has a welcome sense of continuous momentum, and what’s more, DeMonaco has a better handle on both his skewering of the entitled upper class (not as pointed as Paul Verhoeven’s ultraviolent satire, but a start) and the righteous anger of the targeted lower class (personified by Michael K. Williams’ resistance leader, Carmelo)."
    },
    {
      "critic": "James Rocchi",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 75,
      "summary": "The Purge: Anarchy expands on its predecessor, but the excellent news is that the sequel isn’t just bigger and badder and bleaker; it’s also better, smarter, stranger and tougher."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2014
      },
      "score": 75,
      "summary": "The movie's potential blossoms whenever it toys with the allegorical ingredients head-on. DeMonaco's script plays like a devious Brothers Grimm tale told through the filter of Occupy Wall Street."
    },
    {
      "critic": "Michael Nordine",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2014
      },
      "score": 70,
      "summary": "It's better than the first."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 70,
      "summary": "Kill or be killed isn’t the official tag line of The Purge: Anarchy, but it fits. It would also make a more suitable title for this satisfyingly creepy, blunt, down-and-dirty thriller, one of those follow-ups that improves on the original."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 70,
      "summary": "The Purge: Anarchy efficiently exploits its high-concept premise while delivering far more visceral thrills than its predecessor."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2014
      },
      "score": 67,
      "summary": "Retains the original’s premise and politics, but actually puts them to use."
    },
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2014
      },
      "score": 63,
      "summary": "Isn't a cheap knock-off but an equally effective, deliciously disturbing movie. It's bound to delight genre fans (and dismay critics, who attacked the first as heavy-handed and sloppy)."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 63,
      "summary": "The result is an action-oriented survival tale, not unlike the kind of movie that Stallone or Schwarzenegger might have made back in the '80s."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 63,
      "summary": "The film is at its best when it focuses on the more specific conflicts of five people thrown together on Purge night."
    },
    {
      "critic": "Kevin C. Johnson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 63,
      "summary": "Like the first movie The Purge: Anarchy, is trash masking as social commentary, and its depiction of unrelenting, sanctioned violence can be hard to stomach."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2014
      },
      "score": 63,
      "summary": "DeMonaco may doubly, sometimes triply, underline the story's governing theme of social power and how it's exchanged, but the rage and lucidity of these ideas resonate."
    },
    {
      "critic": "Mike McCahill",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2014
      },
      "score": 60,
      "summary": "The franchise is a low-risk work-in-progress, but DeMonaco is improving as a shotmaker."
    },
    {
      "critic": "Inkoo Kang",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "Ultimately, “Anarchy” is too cartoonish in its politics to gain the allegorical resonance it clearly strives for — and worse yet, it's just no fun."
    },
    {
      "critic": "Simon Abrams",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "So weak on a basic storytelling level that it makes you want to nitpick everything about it, from characters' generically illogical decisions (ex: Why are you running towards mounted guns?) to its cheap-looking, jiggly hand-held cinematography."
    },
    {
      "critic": "Bruce Ingram",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "In The Purge: Anarchy, unfortunately, grim and brutal is pretty much all we get."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "The Purge: Anarchy is a good deal bloodier, but also — gulp — a good deal better than its predecessor. Make no mistake, a good \"Purge\" does not equal a good movie, but the post-apocalyptic thriller is slightly more interesting because it takes itself, and its menace, more seriously."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "The Purge: Anarchy improves upon the original, but it's still a long way from being the sort of smart, savage satire it would have to be to fully exploit such a socially charged hook."
    },
    {
      "critic": "Loren King",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "Give credit to writer-director James DeMonaco for at least attempting to give his action thriller some heft with a plot that concerns our obsession with violence, ham-fisted as it is. But The Purge: Anarchy is still just an excuse to bombard us with high-powered weaponry, armored vehicles, vigilantes, and masked marauders in creepy Joker-like makeup."
    },
    {
      "critic": "Andrew Lapin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "It needs to be emphasized again for the record that The Purge: Anarchy is a tremendously stupid film... But there’s an almost-camp quality to how DeMonaco takes this stupidity to greater heights, building a complex mythology around the plot like a giant moat around a pillow fort."
    },
    {
      "critic": "Joe McGovern",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2014
      },
      "score": 42,
      "summary": "When the situation is played totally straight, as it is for eighty percent of the running time, the message is boring: We'd all commit murder, theft and anarchy if only we could. With a narrative as depressively simplistic as that, we do find ourselves identifying with the characters in the movie—counting the minutes until the Purge is over."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2014
      },
      "score": 40,
      "summary": "Mainly, though, this is a humorless film that skimps on the delicious opportunity for spousal retribution."
    },
    {
      "critic": "Kerry Lengel",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 40,
      "summary": "You'd expect the sequel to be an improvement based on production values alone, and you would be right, but not by much."
    },
    {
      "critic": "Guy Lodge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 40,
      "summary": "For all the philosophical and metaphorical shortcomings of his script, however, DeMonaco is an efficient orchestrator of action."
    },
    {
      "critic": "John Semley",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 38,
      "summary": "Soulless and idiotic and abysmally scripted as it is, Anarchy, like its predecessor, feels mournfully relevant."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 38,
      "summary": "It’s preachier, more diverse in its casting. All of which make it more specific and limit it. Throw in generally lackluster performances and illogical plot twists and “Anarchy” is seriously crippled."
    },
    {
      "critic": "Gabe Toro",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 33,
      "summary": "This one veers further from actual horror into an action picture. “The Purge” tries to unsettle. The Purge: Anarchy wants you to cheer."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 25,
      "summary": "The film defies one of the fundamental rules of capitalism: Exploitation of the proletariat may be well and good, but don’t execute them all. At the same time, “The Purge: Anarchy” obeys a cardinal law of Hollywood: Shoot first and ask questions later."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 25,
      "summary": "I’ve read ingredients labels that were scarier than The Purge: Anarchy, a plodding horror flick that mistakenly thinks it has big ideas."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 20,
      "summary": "The film’s “What if?” scenario takes the germ of an interesting social-science idea and lets it rot in a nasty, ethically questionable cesspool of junk cinema."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2014
      },
      "score": 3,
      "text": "I thought the first one was better: at least the idea was new, and there was much more tension. This one is just an action-packed thriller, with the occasional jump scares, with less believable supporting characters and a tendency to simplify politics and... racial stereotypes. Not extremely ghastly, but still definitely not worth spending the money. Maybe the time, if you get what I mean.",
      "total_reactions": 2,
      "user": "nicholasbert"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 3,
      "text": "A squeal that doesn't even try. Remember last year with the first Purge movie and I really didn't like it, but this movie is nothing different. This movie is still filled with stupid characters that make stupid choices throw out the film. They is this one scene in this movie where these homeless people are hiding underground trying to get away from this horrible event and they are hiding in complete darkness and nobody can't see them. but these people with flamethrowers come underground chasing are main characters not seeing the homeless people, and then the homeless people got up from there hiding places, and started running in past them for no reason at all. Overall this movie is nothing much as a violent train wreck.",
      "total_reactions": 2,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2014
      },
      "score": 6,
      "text": "The first PURGE was that rare conceptual film that could actually contain a plot through to the end. THE PURGE:ANARCHY is even better! Exciting filmmaking with a super cast but best of all, THE PURGE: ANARCHY is real B-movie complete with overt political message that will kind of touch your heart and piss you off. A winner!",
      "total_reactions": 1,
      "user": "LowbrowCinema"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "With It's amusing acting from It's brilliant (and unique cast) and a story that actually brings \"The Purge\" to a greater height, The Purge: Anarchy finds James DeMonaco creating a sequel that succeeds as a definite improvement over the original.",
      "total_reactions": 1,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "Definitely a better picture in comparison with the first Purge movie! It has an ok characters, an interesting plot with well done ending! Its flaws aren't substantial enough to bring it down",
      "total_reactions": 1,
      "user": "PeteStaiv"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2014
      },
      "score": 2,
      "text": "Anarchy fails to deliver on almost all levels. The tension failed to come to fruition, the direction was poor and the acting almost unbearable to watch. What's more, the filmmaker know this. I didn't even know about the films existence until two weeks before it's release because of its terrible promotion. It's clear to me that the Purge: Anarchy is merely an attempt at scraping together the funds to tide the producers and the cast over. I don't anticipate a sequel, and if a third film is made, I doubt it shall come back from this shameful performance.",
      "total_reactions": 1,
      "user": "ToughCrowd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2014
      },
      "score": 2,
      "text": "I have problems sleeping at night, but I was out cold for about 5 minutes during this movie.  I can't say the whole film is predictable, because I expected twists or surprises.  There was maybe half of one.  Characters are boring, the violence is boring, the plot and setting (2023 looks like now) are boring, the ending is unsatisfying, and the bad guys are boring (HOW CAN THE BADGUYS BE BORING IN A MOVIE LIKE THIS?!).  Go watch the new Mad Max trailer for 2 hours instead.",
      "total_reactions": 1,
      "user": "daroczi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2014
      },
      "score": 2,
      "text": "A plot that took on the perplexity of a universe where \"the purge\" exists was a vast improvement from what was essentially just a home invasion in the first movie. The positives pretty much stop there. Poor acting, screen writing and what seemed like poor direction in what the producers wanted The Purge: Anarchy to be once again ruined the potential of the purge concept.",
      "total_reactions": 1,
      "user": "b735"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2014
      },
      "score": 2,
      "text": "*SPOILERS INCLUDED* I went to go see this movie with my friends and while they all thought it was a great movie me and my boy Saucy Johnson thought otherwise.  First off, the sound effects set on the movie were way too high... At one point a gun was placed on the counter and it sounded like a real gun went off in the theater.  It was unbearably loud.  I had to cover my ears during some gun scenes.  Oh and forget it... As soon as I saw a turret i knew my ears were abouta bleed.  Even covering my ears it sounded loud.  Second, the movie was extremely racist.  So what ALL wealthy families are white and  EVERYONE in the government is white??  Nah not a chance, even if its a majority white at least have the indecency to add a few other races so it doesn't seem like you are trying to be racist.  Adding onto racism, everyone in the NFFA  is black.....  Couldn't just add one white guy!?  The dialogue was poorly made.  They made Liz \"the girl with blonde hair\" such a typical dumb ****  Seriously who wears high heels on the day of the purge.  Also acting like such a **** when the Sergeant saved her and then wanted to continue without them.  She was screaming on top of her lungs to not leave them.  Like are you serious?! The guy saves you and wants to do something and you're going to act mad selfish and scream... attracting purgers...  Not to mention the scene in the end when the sergeant got shot and Eva and Cali(mother and daughter) ran out of the CAR to go to him and yell to the guy if he had a CAR!  YOU JUST CAME OUT OF A CAR WHY THE HELL YOU ASKING IF HE HAS A CAR IF THERE IS ONE 20 FEET AWAY!  The ONLY thing that was good in this movie was the Sergeant cause he was a badass, the rest of the actors/actresses were trash.  Awful movie, racist, the END.",
      "total_reactions": 1,
      "user": "pinghera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "Why was this lousy, ultra low budget, vile, sadistic, formulaic, boring as hell little thriller released in 2:35 widescreen?  Because the producers and distributors are jackasses that either don't know what they're doing or erroneously think that with 16x9 TV having taken over, the cinema screen needs to go wider across the board?  Or is it because the jackass filmmakers delusionally think they are David Lean?  It's not even photographed well, particularly a scene with a flashlight in a tunnel where the blue flares hitting the lens look so out of place as to be animated in or something?  Fire that color grader!  And director and DP take yourself back to film school and get an education where you learn what is acceptable and what is just your childish indulgences!",
      "total_reactions": 1,
      "user": "AxeT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "Sitting in the theater,and lost interest before the first hour was over. The  problem with this movie is that the objective is to not get purged, and these idiot characters are gallivanting up and down the streets of NYC. Whaaaa?..seriously? Their sitting ducks. Targets. The writer could have at least had them in a place other than right in the  middle of NYC. This movie is just silly.",
      "total_reactions": 1,
      "user": "amf5300"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "there are two good charters and that is all the good I can give this movie because the purge anarchy is boring. like the lst purge movie. but HOW DO YOU MAKE PEOPLE KILLING PEOPLE BORING.",
      "total_reactions": 1,
      "user": "teddyluke"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "Now let me start off my saying that I am probably one of the only people who enjoyed the first Purge movie. I thought it was an original concept and even though it was a home invasion thriller it had many twists and turns that kept me on the edge of my seat! The Purge: Anarchy takes everything that I liked about the first film and makes it even better! If you're looking for a good edge of your seat thriller this summer, you'll definitely want to catch this one in theaters! You'll be glad you did!",
      "total_reactions": 3,
      "user": "chrisjones914"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "Not nearly as unnerving or interesting as the first film. The politics are mundane. Casting the white folks as the wealthy purgers (and the stupid couple breaking down and stranded in the city) is ignorant.  Casting the masked street gang as all young black males is equally as ignorant.  It's slightly thrilling, but SO much more could have been done with the concept.",
      "total_reactions": 5,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "While this is definitely an improvement over the last Purge movie, The Purge: Anarchy plays it safe. This idea could be expanded so much more with the right director and cast, but the movie settles for less than it's worth. Obviously, a third installment will be made, and hopefully it will be even better. But, the one plus in this movie is that the story is better, and it's more watchable than the last one.",
      "total_reactions": 5,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2014
      },
      "score": 1,
      "text": "The concept: one night a year, all crimes are allowed. This time, instead of one family's home being invaded, the action takes to the streets, where our protagonists are on the run. The premise is improbable enough, but this plot extends it to simply stupid: the characters are lame and the situations are absurd. Worse of all, the violent acts are dull and unoriginal. Many of the potentially best kills are dispatched off-camera or in a blur. There's nothing about this sequel that vaguely resembles the gripping original.",
      "total_reactions": 7,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "Cinematography is cool at times. Other than that I didn't feel a slightest emotional attachment to main characters. They were just dull and irritating thanks to idiotic script and dialogs.",
      "total_reactions": 10,
      "user": "Superstring"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 3,
      "text": "I went into The Purge: Anarchy expecting mindless entertainment, nothing deep or Oscar worthy. I really liked the first Purge movie. I think the concept is very interesting. However, this one felt like they tried way too hard to make a deeper meaning and emotional connection. Firstly, the characters in this movie are AWFUL. I really, really disliked all of them. They aren't bad people, but they are very fake people. They try to seem sympathetic and take some moral high-road, but it just comes off as staged. I was really hoping about 20 minutes into the film that everyone would die. The \"twist\" to the movie is that the government is now killing people during the purge because citizens aren't doing a good enough job at controlling the population. Why a government would want population control was never elaborated on. Maybe they wanted to decrease their tax base?It's really obvious that this is what is going on from very early on. However, the makers of this movie think their audience is completely stupid and continually threw out \"hints\" about the twist and then in the very end let the government guy have a whole monologue explaining his devious plans. I actually laughed because I was like- DUH! Jeez. I am actually writing this review to try and get the attention of the people who are going to make The Purge 3. Dear whoever you are: if you want to have character development or a story about a specific character stick to one and don't try to give us equal half-stories about 20 of the characters. Also, no one thinks this should be a horror film. Inserting random scenes to make people jump is super lame. Stick to the good thing about this series and that is the premise and the crazy ways people think of to kill one another.",
      "total_reactions": 6,
      "user": "khaleesi"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "“Just remember all the good the purge does.”",
      "total_reactions": 4,
      "user": "NightReviews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2015
      },
      "score": 3,
      "text": "Instead of just being exactly what it is (a normal horror/slasher film), this movie decided to had small amount of very heavy handed political messaging; just like the first one. Even if you take that away, this movie was extremely predictable. I was literally saying what is going to happen next right before it should have happened as if the writers had a 'how to make a slasher movie' handbook they felt they had to stick to. I'm sure they will make another one, because they definitely have enough to go off of to continue this seemingly forever in the way Saw did.",
      "total_reactions": 2,
      "user": "dijavantewow"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "The purge anarchy is a different improvement from the first one given the premise its given  , it may deliver its thrills that were better than the first but it still lacks emotional power and it lacks in other aspects as well ..just a movie that's more for entertaining purposes.",
      "total_reactions": 2,
      "user": "david1997"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "Muy entretenida pelicula. con accion, sangre , gritos  de todo un poco. una pelicula quepodras disfrutar con palomas solo el final si le faltaba o esperaba mas.",
      "total_reactions": 2,
      "user": "Roachramirez"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "A major improvement on the first purge movie where it is way better, interesting and very intense. Despite also some predictable plot twists all the way through, it deserves credits.",
      "total_reactions": 2,
      "user": "HaithamB"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "A hybrid of violent thrill and political message, Anarchy is a refreshingly intelligent horror movie. By drawing the action onto the streets and through a range of environs, the sequel covers most of the wasted potential of its predecessor.  Though a horror, Anarchy avoids tacky, dull torture porn and instead relies upon its multitude of creative villains, superb slow-motion camera pans, tense atmosphere and sudden shocks to make the audience jump.",
      "total_reactions": 2,
      "user": "patferg"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "Thank god, this film, unlike the first atrocity, captures what the purge actually is and keeps you ready. Although at times there are so obvious moments most of the film keeps you second guessing until the final moment. I hope to see a third film similar to this and not like the first one. 7/10, Better than the original, intense, more story driven and epic.",
      "total_reactions": 2,
      "user": "0Bennyman"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "text": "THIS MOVIE IS UTTERLY DISGRACEFUL and EVIL. I really think that movies like this should be BANNED. The concept undermines law and order and damages society. It implies that there are many (racially/sexually-motivated) suppressed haters in society, waiting desperately for a chance to be free to kill, which is untrue. The rich and well-educated are often very good people in society e.g. the Queen, Richard Branson etc. who would no doubt strongly condemn any such concept and behaviour. The police and law-enforcers are made to look two-faced, which is disgusting. The police devote their lives to justice and do not deserve this sort of portrayal. They should make movies that teach people to be allies in society and make people proud to be allies in society. This movie will make good people angry and may gave them a tension headache!",
      "total_reactions": 7,
      "user": "Christopher_J"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "What if all crime was legal once a year? What would you do? How you would you do it? you can quote \"cleanse your soul\". Does murdering really solve anything? These were the questions asked in James DeMonaco's engaging (sometimes thrilling) escapade \"The Purge\" a little film that took the box office by storm. Now, over a year later, it's beginning to feel like \"The Purge\" is becoming an annual gathering.",
      "total_reactions": 5,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "Okay guys, come on. It wasn't that bad. In fact, it was quite enjoyable. I mean, it wasn't the best movie this summer. By ANY stretch of the imagination, but it was, in my opinion, a good movie. Very disturbing, but a delectable treat.",
      "total_reactions": 5,
      "user": "natevirno"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "After the housebound claustrophobia of the first instalment this second film takes the terror into the wider arena of the streets. At its core this is a morally reprehensible and despicable premise pandering to the baser instincts of human nature, which we can only hope remains a filmic fantasy. As a movie, fans of the horror and thriller genres will be in their element. Directed with cold efficiency, atmospherically photographed and grippingly edited the film makes many social political statements along the way. Surprisingly the story strands come together fairly well and generally make for credible viewing. However, a scene in which the protagonists take sanctuary in a house of a friend strikes a definite false note and is risible in its ridiculousness.",
      "total_reactions": 3,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "This movie was much better than the first. I don't understand why its getting as much hate as it is. Don't get me wrong, The Purge: Anarchy is far from amazing but it deserves more credit. This is what the original Purge should have been like. If you liked the concept in the first but hated the movie, I recommend seeing this.",
      "total_reactions": 3,
      "user": "Ripred"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "The Purge: Anarchy may not be amazing, but it's a huge step up from the first movie. The Purge: Anarchy focuses on 5 characters. The first two are a couple named Shane and Liz who are driving to one of their sister's house in Los Angeles to wait out the Purge when their car is sabotaged and breaks down in the downtown area.  Meanwhile, police sergeant Leo Barnes goes out into the streets to get revenge on the man who killed his son. The last two are a mother and daughter, Eva and Cali, who are rescued by Leo after a group of men breaks into their house and attempts to kidnap them. The five people meet up and attempt to survive the night together. The concept of this movie is great, meanwhile the movie itself doesn't execute it as well as it should. The plot is pretty interesting including a lot more thrill than the first movie. The people purging are more exciting and although it doesn't give a lasting scare, this movie still does have some good jump scares. If you liked the first Purge movie or thought it was okay you will enjoy this movie. Don't expect too much, but the concept and the plot of this movie are very interesting to watch.",
      "total_reactions": 3,
      "user": "GuyWhoReviews"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2014
      },
      "score": 6,
      "text": "Definitely better than the first film as it isn't restricted to just a single house for the setting. However, that's the only real improvement this sequel offers. While the bigger setting did allow for more entertainment than the first film, there weren't very many new elements introduced. Sure they tried to throw in some new interesting scenarios here and there, but none of them were particularly memorable. As for the cast, Frank Grillo delivered a rather solid lead performance. The only annoying and unlikable protagonist in this one was Zoe Soul's character. Overall, it managed to entertain while it lasted and easily outdid its predecessor, but it wasn't exactly a game-changer if you know what I mean.",
      "total_reactions": 3,
      "user": "moviemitch96"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2014
      },
      "score": 1,
      "text": "Crap movie, its a lot like the first except it take place outside! so yeah its a bit more entertaining but nonetheless its not very good. we have a group of 5 characters who are all boring except the lead guy and none of them die so its pointless?!..... i mean its not like we care about them lol. the premise of these movies has potential but they still ruin it!! the next one will be even worst and its all downhill from there! (look at Saw and Paranormal Activity)",
      "total_reactions": 3,
      "user": "himynameisart"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "I watched this with an open mind, as I had no prior knowledge whatsoever. The concept, or plot was quite under thought. As the events came to be, it became more and more like a bad B horror movie. A husband that walks away from a son, wife and daughter in a life and death situation. Yeah, that would happen. The worse part, and most difficult to believe (even in a fantasy), was when common neighbors turn to cold blooded murderers just because the opportunity presented itself. This was BY FAR, the worse box office movie that I have ever seen. I disliked it so much that I became a member to warn the world not to waste 2 hours of their lives. It was written to appeal to 4th graders, and with all the violence and sickness in our world, this was the last pile of garbage that anyone needed to spread. This is coming from a 44 year old adult, whom of which loves a great action flick, and has no problem with violence if it is part of the story line. Sorry to tell you all....this was the most pathetic excuse for a movie that I have ever seen. respectfully, casho",
      "total_reactions": 3,
      "user": "casho"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "text": "Worst movie EVER. boring and unrealistic it is true big screen crap. very stupid concept with even stupider execution. Feels like the twilight of “What if?” scenarios.",
      "total_reactions": 13,
      "user": "Hoxton"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "If I could sum this movie up into one word it would be \"Phenomenal\"!!!!! I just finished watching it and I will first say that I loved the first movie a lot but the sequel kicked everything into gear 100% more then the original. The story was better it focused on five individuals coming together to survive the night and being centered on Frank Grillo as \"Sergeant\". The action was Top-Notch with Tons and Tons of violence which I absolutely love. I must add that them taking the movie to the streets did it wonders and I don't ever jump in movies but there were one or two jump scares. The acting was very good but obviously the star was Frank Grillo who kicked Ass in acting and just being Awesome. I will say overall that this is a must see movie especially if you liked or loved the original then go see it Immediately and you will not be disappointed I promise you that. The best horror/thriller movie I have seen in a long long while.",
      "total_reactions": 15,
      "user": "GreenGoblin215"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "Honestly I'm just sick of dusty hating every movie. Everytime I like a movie he posts screenshots of metacritic scores and tries to demean me for liking it. If Chris likes it then it's a good movie.",
      "total_reactions": 4,
      "user": "Kmagaro74"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "This movie wasn't eye-opening, but it was decent. I mean, the premise behind the movie is unique and interesting, but the way it's portrayed is a little strange. I mean, after six years, most people have accepted and almost enjoy the purge? I feel like they should still be adapting to it. As for the characters, what was the couple doing out even close to when the purge was going to start? Any person with common sense would have been locked inside, windows closed a day before it started. In conclusion, the scenes are interesting enough, but I somewhat dosed off during the slower, running around parts.",
      "total_reactions": 2,
      "user": "mgastryker"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "Why I gave The Purge: Anarchy a 10.",
      "total_reactions": 2,
      "user": "inktomi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2014
      },
      "score": 1,
      "text": "It may seem like all i write are bad reviews, but I feel good movies speak for themselves but people NEED to be warned about awful ones - LOL. That being said, this sequel is god-awful.  I really enjoyed the first Purge movie but out of the 5 \"lead\" characters, I was rooting for four of them to get their heads blown off so I didn't have to listen to the drivel they were spouting throughout the movie.  WAY to much is going on in this flick. There is the 5 main characters \"fighting\" to survive, the government conspiracy, and the underclass rebellion.  The rebellion story is so unnecessary and I knew that ultimately they would save the day for our characters. boring and predictable.  Why do these characters feel it is necessary to try to talk about moral issues as they are \"slinking\" through the streets trying to \"survive\".  Even tho the one enjoyable lead (the guy who was out to actually do some Purging) tells them to shut up repeatedly they blabber on endlessly trying to convince him to be a good guy making a lot of noise along the way giving away their location repeatedly to the bad guys.  The teen age daughter was SOOOO annoying.  Really disappointed in this sequel.  Hokey, bad dialogue, bad confusing plot.  But the worse sin overall was it was really really BORING",
      "total_reactions": 1,
      "user": "brentwshelton1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2015
      },
      "score": 9,
      "text": "Having loved the first movie, despite it being rather stupid, I was really looking forward to the sequel when it came out summer of last year. It took me a year to finally get around to this, but I'm glad I did. The Purge: Anarchy is an action horror film and a sequel to 2013's The Purge. Both films take place in the near future where the US government sanctions an annual 12-hour period where all emergency services are suspended and all crime, including murder, is legal. While the premise itself is completely unrealistic and stupid, it is extremely interesting and original. The first Purge takes place in 2022 and only took place within one house that was being invaded by some purgers. It was a major letdown for some, but it was incredibly entertaining for me. The sequel takes place a year later and is really the Purge movie everyone had hoped for. It tells of five people who are simply trying to survive the night on the streets of LA during the Purge. The Purge: Anarchy rights most of the wrongs of the original Purge and doesn't mask itself by being a home invasion thriller or revenge flick. Anarchy is definitely its own unique movie. It does introduce some new ideas to the Purge story. It shows that not everyone purges just because they want to; some do it for revenge and some do it just to stay alive. The film also shows what the richest people would do. They hold auctions where poor people are auctioned off to upper-class purgers, and the scene showing this is probably the most interesting scene in the movie. Not only does The Purge: Anarchy show off some well-executed ideas, it's also an incredibly thrilling and entertaining movie from start to finish. What made this movie so fun to watch was that each character had their own unique struggles and reasons for being out in the Purge, and there was some great acting from the entire cast to make them even more interesting and real. The Purge: Anarchy proves a significant step up from the original film, and it's the perfect summer thriller film that I would recommend to almost anyone.",
      "total_reactions": 1,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2016
      },
      "score": 8,
      "text": "It's a very absurd movie, but in that respect it's no different than everyone's beloved super hero action porn. Definitely a lot more fleshed out than the first. I was able to get quite attached to the characters and though the story was a bit slow at times the second half really gets going. It has a very mad max feel as if for 12 hours the country falls into an apocalypse. In the end though if you can't role with the silly premise than it won't be enjoyable and there's quite a bit of brutality to it so it's only going to appeal to a niche audience. (The Fight Club kind of audience).",
      "total_reactions": 1,
      "user": "YoloSwag4Doge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "It delivers the anarchy the title implies, which is good considering it was what the first needed and was sorely lacking in. This sequel takes the great concept of the first movie, the annual \"purge\" where all crime is legal for 12 hours, and uses it to bring unique, crazy, and occasionally tense scenarios. It's political and social commentary is still lacking, but overall there's still enough fun here to make it worth a watch.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "More of the same from the first movie except this time we get less interesting characters with worst acting skills but the tradeoff is more purging. Like the first one, it comes across as being more of a standard action film then truly terrifying.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "The sequel is actually better than the original. It is more fun, more intense, and better acted. The actual plot is not as stupid as it sounds. By not over-thinking the story, I was able to enjoy it.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "Meh. Not really worth the theater visit, maybe a rent when it's on Netflix or Redbox. I would not buy it because it's a one-shot movie. Kinda cliche, except for the ending. Acting was B-level at best.",
      "total_reactions": 0,
      "user": "Bshop"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "Don't know why this is getting mixed reviews. I thought it was great. A brilliant thriller. Pretty tense, better than the first IMO. It's sort of like what Aliens was to Alien. The same core experience, just on a larger, more epic level. I really liked how the movie was able to tell all of these different stories, and make you care for all the main characters involved. If you liked the first movie, or even felt a bit \"meh\" about it then I'd still recommend that you watch this.",
      "total_reactions": 0,
      "user": "Patrick94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2014
      },
      "score": 5,
      "text": "Leap years better than the first but you still have to wonder why does  everyone act like morons on the purge.  From the stupid masks to the over acting idiot screaming Release the Beast what's really the point.  Frank Grillo does add a really strong presence to the movie and there are times (when you forget about the ridiculious premise) that work as just solid action.  C",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "t has its moments of **** dialogue, silly storyline, unrealistic nature, etc., though it befits from a better storyline, greater action, and a open world view. Though I wouldn't consider this a good movie by any means, it's a major step up from that generic and **** original. Overall it's not all bad and has some creepy moments that will leave you on the edge of your seat. 6.5",
      "total_reactions": 0,
      "user": "bmaster4616"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "Largely an improvement on its disappointing predecessor, The Purge: Anarchy offers a little slice of what hopefuls for the original wanted : decent acting, gritty violence, and a reasonably compelling story. Thankfully, whilst not entirely successful, most of that was offered.",
      "total_reactions": 0,
      "user": "sammurphy66"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "The sequel that no one wanted (but personally i thought purge needed one), Has came back with an idiotic characters who make dumb choices en order to  survive the purge. The first purge was actually entertaining also suspenseful it's just the characters were retarts classic ones in a horror movie that is the problem with",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "The Purge: Anarchy es una película potente que supera de una manera espléndida a su también buena predecesora.",
      "total_reactions": 0,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "The Purge : Anarchy is by far better than the first one.More,action,better acting and some \"horror\".Frank Grillo is an amazing actor and he proves it in this movie.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "Rarely happens that sequel is better than the predecessor. Story is better, fantastic choice of actors and their good performance made this movie better than it should be..",
      "total_reactions": 0,
      "user": "SpiRo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "Oddly enough everything here is slightly above mediocre. The Purge: Anarchy has a very specific target market but the pure questioning and lack of pretension (although holding contrivances) make this action thriller consistently enjoyable to watch. There's no doubt this director writer has genuine passion and clearly some unthought anger too.",
      "total_reactions": 0,
      "user": "Poundtho"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "10 times better than the first a better story and actually scary an amazing thrill ride for all horror fans its political and i hope they make a 3rd 4th 5th 6th and 7th purge movies",
      "total_reactions": 0,
      "user": "BLAZETHEMCKIDD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "I was glad to hear that The Purge was getting a sequel when I saw the trailer, I found that the first movie had so much potential but it really didn't reach it. However much like the previous film The Purge Anarchy had a great trailer that brought people into the theatre to watch it that allowed it to make huge amounts of money without spending much on a budget. I didn't really care for the cast through most of the movie. I would've liked to have seen more from Michael K. Williams who played a relatively minor role in the film. However the film continued to keep me guessing and the last ten minutes were really what made the movie for me. I'm expecting a third Purge film and I'd like to see more improvement because the sky is the limit with this idea.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "Saying this movie is a horror movie is kind of misleading. It was more of a survival movie with some good suspenseful scenes. They did a great job of filming it and I was quite surprised that the amount of blood in the movie was so low considering it is about a government sanctioned murder rampage. Don't think there isn't any violence though because there is quite a lot of that in this movie.",
      "total_reactions": 0,
      "user": "paulwasthere"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2014
      },
      "score": 2,
      "text": "Its no different than any of the other horror movies. it was a disappointment. The acting in it was poor, and it felt almost as if the movie was rushed.",
      "total_reactions": 0,
      "user": "seeingcrimson21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "Summary: The Purge: Anarchy has some nice shots, a creepy atmosphere and Frank Grillo's dynamic performance; also, James DeMonaco is becoming in a better director. Sadly, it is still not good enough. 60/100 [C+]",
      "total_reactions": 0,
      "user": "GuillermoBM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2014
      },
      "score": 1,
      "text": "Wow...did no one get what this movie is about? The \"New Founding Fathers\" grant everyone the \"right\" to kill people for 12 hours out of the year....for \"population\" control. They run around with fully automatic weapons killing each other and screaming about how its \"their right\" granted to them by the government.",
      "total_reactions": 0,
      "user": "WeNotYou"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 4,
      "text": "This movie looks good and it's well acted, but the narrative is all over the place and the convoluted direction certainly doesn't help make it make any sense. The \"Purge\" movies just aren't that good, but as long as people keep going to see them, then we're just going to be stuck with them and probably annually just like the purge in the movies. Ugh...",
      "total_reactions": 0,
      "user": "WJS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "\"The Purge: Anarchy\" 10 Scale Rating: 5.0 (Mediocre) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "So much better than the first!  But really, that's not saying a lot...  The action and development in this squeal really is quite good.  I was expecting almost nothing from this since the first movie was so predictable and bad.  For having a cast of no names it really was an impressive movie.  If I had to compare this to anything it would be that this movie is what '28 Weeks Later' was to '28 Days Later'.  Much more action, several more characters, and best of all it wasn't completely predictable.  A good rental for action fans and gore hounds.",
      "total_reactions": 0,
      "user": "Stevesitz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "É muito difícil hoje em dia uma sequência superar seu antecessor, porém a sequência de Uma noite de crimes, conseguiu isso com sucesso. O segundo filme consegue ser melhor que o primeiro em todos os aspectos, no suspense, na ação, nos efeitos e na trilha sonora.",
      "total_reactions": 0,
      "user": "GabrielSchmidt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "The Purge Anarchy captures the idea behind the Purge so much better than the first movie, which i would say is mediocre at best. Instead of keeping the film contained to one house like the first one did, it took us to the streets during purge night following 5 characters. Although I do have some problems with this movie I would say it is a massive improvement over the first one. The biggest problem I have with the movie is the pacing of action and the acting at times, which can be wooden and cringe worthy in places, the writing could have been better but it isn't horrible although I do think the writer completely missed the mark on the 'horror' genre here jump scares do not make a horror movie. in summery i would say if you have thought about watching The Purge Anarchy then it is a good action movie with some jump scares thrown in the mix.",
      "total_reactions": 0,
      "user": "Robb-Fury"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Excellent filmmaking, great plot, fast pacing, likeable characters, and amazing action. Everything I wanted out of the first Purge film. The casting is superb and the way all of the characters storylines fall together is phenomenal. One of my favorite films of 2014. Bravo James Demonaco!",
      "total_reactions": 0,
      "user": "JamesTheCreator"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "One year after the events of The Purge, The Purge: Anarchy begins. The movie follows three groups of individuals: a separating couple(Zach Gilford and Kiele Sanchez), a mother and daughter(Carmen Ejogo and Zoe Soul), and a heart-stricken father(Frank Grillo). Grillo is ready to purge and is out for vengeance when he stumbles across the other four characters needing rescue. He has to hold off on his mission to save this group of unfortunate people. They aren’t only trying to survive the civilians purging, but another group is purging as well. The group of five is forced to trust one another on a night when no one can be trusted.",
      "total_reactions": 0,
      "user": "OptiNuzPrime"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2016
      },
      "score": 7,
      "text": "For me this movie was between mixed and positive - 6.5 basically. The action part and suspense and all that was really good and the movie was exciting to watch throughout, plus this one was better than the first one, but anyway, some of the ideas or what happenned there at some parts felt so dumb or so unrealistic that it made it harder to watch it without laughing etc at some moments. Anyway, if you watched first one and thought it was ok, then you will like this one more and will actually enjoy it, if you hated the first one, then these Purge series are not for you. If you were not hating or liking first movie, then give this one a chance so that you know where you stand.",
      "total_reactions": 0,
      "user": "Ralfbergs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "Not my movie type, but I actually enjoyed the movie alot! So I'll give the movie 8 out of 10. Very exciting, a lot of tension. I'll look forward to next purge movie.",
      "total_reactions": 0,
      "user": "NukaCocaCola"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2016
      },
      "score": 10,
      "text": "I love the movie, as I loved first one, but this one is even better cause there is great factor of unpredictability !",
      "total_reactions": 0,
      "user": "Ramzo1247"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2016
      },
      "score": 7,
      "text": "The Purge:Anarchy builds on the original, bringing in more moral and political themes, which suit the setting perfectly. While not perfect by any means; sometimes the plot was a little dull and the action repetitive, it was certainly an improvement from the original and showed us the purge from the eyes of a different demographic",
      "total_reactions": 0,
      "user": "LtPaul"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2017
      },
      "score": 3,
      "text": "The Purge: Anarchy is better then the first movie that's not saying much. The first 20 minutes  before the purge I thought was great but then it starts to be the first movie again but with it outside.",
      "total_reactions": 0,
      "user": "reviewfrom19842"
    }
  ]
}