{
  "mc_avg_user_score": 4.5,
  "mc_metascore": 39,
  "mc_mixed_rating_frequency": 30,
  "mc_movie_name": "The Gunman",
  "mc_negative_rating_frequency": 24,
  "mc_positive_rating_frequency": 17,
  "mc_pro_critic_reviews": [
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 75,
      "summary": "Basically, The Gunman is a movie that asks audiences to sympathize with the equivalent of Lee Harvey Oswald — that is, an Oswald who definitely did it. Oddly enough, it succeeds, partly because the moral climate it presents seems so confused, but mainly because of Penn’s particular aura of irascible integrity. He’s the most irritated action hero since Harrison Ford."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 70,
      "summary": "It’s clearly a directorial accomplishment to assemble this level of acting talent in one movie and come away with something so – well, “bad” is not sufficient to capture the idiot glory of this motion picture."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 67,
      "summary": "The Gunman becomes a highly capable shoot-em-up but not much else."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 63,
      "summary": "The best excuse for watching The Gunman is Penn. His first mainstream leading role in a decade is worthy of comparisons to Matt Damon in the “Bourne” movies; yet it’s also disappointingly shorn of the humor and humanity of which this great actor is capable."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "Sean Penn’s bad side makes for good action-drama in The Gunman. There’s a grubby, redemptive quality that makes this tough-minded flick feel like the son of “Serpico” and “Salvador.”"
    },
    {
      "critic": "James Dyer",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "Sub-Ludlum plotting but stylishly executed, this offers a fun night out but is far from a nailed-on franchise-starter."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2015
      },
      "score": 58,
      "summary": "Sean Penn doesn’t make movies very often these days. So when he does, you go in with certain expectations. Sadly, it’s best to leave them at the concession stand if you’re planning on enjoying The Gunman."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "The Gunman passes the time, but it never quite reconciles its conflicted nature. It’s not smart enough to be a paranoid thriller, nor fun enough to be a blood-soaked action flick."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "The movie wallows in remorse. Not only is the main character paralyzed by it but the filmmakers seem to believe that every Caucasian member of the audience should face up to White Guilt for the way in which the Industrial World has encouraged unrest in Africa so resources could be strip-mined. How's that for an uplifting action movie premise?"
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "I doubt The Gunman will do much to advance Penn’s foray into action-hero bankability, and that’s probably a good thing. He’s too fine an actor to be mired in nonstop shootouts while flashing his pecs and looking scowly."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "In fact, no one in The Gunman looks happy. And what happened to chivalry? If a fierce squad of goons is coming after you and your ex, whom you still love, and there's only one Kevlar vest to throw on, don't you offer it to her? Apparently not."
    },
    {
      "critic": "Peter Sobczynski",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "The Gunman isn't the worst action film that you will see this year — you will be lucky if you even remember anything about it a couple of weeks after seeing it — it will probably go down as one of the more dispiriting ones."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "Has there been a more tormented or intense study of the ambivalence of revenge than Penn’s performance in Eastwood’s “Mystic River” (2003)? Penn might not agree with Eastwood’s politics, but when it comes to probing a killer’s soul he couldn’t find a better model."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "Director Morel brings some style and speed to the proceedings, though I found The Gunman increasingly numbing in the carnage department. Compared with someone like Neeson, Penn's avenging angel is a less relatable fellow."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "With a script co-written by Penn himself and based on a well-regarded novel by the late French crime writer Jean-Patrick Manchette, this one has to have some meat to go along with the gunplay, right? Sadly, no."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "The Gunman is too disorganized and sloppy to make sense as political commentary or to work on the most basic level as a globe-trotting chase thriller."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "Penn doesn’t work much, and this idea of combining his two careers — as actor, producer and co-writer, and as humanitarian — may have its heart in the right place. But take away the preaching, and this is just Penn’s version of a late-career Mel Gibson movie. He should be better than this."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "Penn’s vanity — both in the way he shows off his bod and in the way he drives home the nobility of the once-wayward Terrier — is either the most deeply annoying thing about The Gunman, or the one thing in it that actually works. I’m leaning toward the latter."
    },
    {
      "critic": "Ben Nicholson",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "With no fun to be had, The Gunman also lacks essential thrills. If Sean Penn is winging for an action-hero renaissance like Neeson's, he'll be in need of material a lot more compelling than this."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "Instead of a pot-boiling crime noir like the one that exists in the pages of the late French novelist Jean-Patrick Manchette's \"The Prone Gunman\" (which sounds better in French), the adaptation is a frustrating fiasco that kills the material and squanders its exceedingly fine cast."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "It’s not a hard and fast rule, but in general when the main character, sometime in the third act, says, “I did some bad things ... ” and stares off into the middle distance, the implied end of the sentence is “including this movie.”"
    },
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "A garbled mélange of arbitrary, unsatisfying action and token remorse."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "The Gunman is a predictable slog through action-movie tropes, and Penn's intensity isn't a good fit."
    },
    {
      "critic": "Steve Davis",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "When Bardem is onscreen, the emotional stakes are high, engaging you in a way the principal storyline fails to do. It’s a masterful turn by a masterful actor, one that’s blissfully on-target in The Gunman."
    },
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "Thanks to ‘Taken’ director Pierre Morel, this too often feels like just another slice of brainless Eurotrash, packed with saw-it-coming plot twists, half-hearted car chases and an angsty hero with mega muscles and zero charisma."
    },
    {
      "critic": "James Mottram",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "A genuine disappointment, given the talent involved, and a rare misstep for Penn, who can’t save this moribund vanity project from flatlining."
    },
    {
      "critic": "Fionnuala Halligan",
      "publication": "Screen International",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "A muddled bid for political relevance has led the film-makers to drag on The Gunman’s primary mission: to entertain."
    },
    {
      "critic": "Leslie Felperin",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "Ripe, borderline hammy turns from Javier Bardem, Ray Winstone, Idris Elba and Mark Rylance add some spice."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 38,
      "summary": "The only redeeming feature about The Gunman is its exotic locations."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 38,
      "summary": "Watching Penn pump iron and denounce capitalism for two hours would be roughly as illuminating as this monotonous Euro-thriller."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2015
      },
      "score": 38,
      "summary": "The lack of any visual ingenuity, reflexivity, or awareness of genre tropes diminishes the intermittent pleasures of the action's slightly involving kineticism."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 35,
      "summary": "It’s one thing to bring a gravelly gravitas to characters like this, but Penn suffers and glowers so much that it weighs down the material. If he plans to strap on the Kevlar in future, he might consider lightening up a little and saving the intensity for more serious movies."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 33,
      "summary": "There's also something tired and way too familiar to the story of a white guy who acts as the savior of Africa while the only major black character in the movie stands ineptly on the sidelines."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 30,
      "summary": "The result is a relentlessly dour film livened up only by Bardem’s shameless scenery-chewing and the occasional jolt of action. Otherwise, it’s an endless frown of a movie that does little but confirm that Penn’s talents, while impressive, aren’t limitless."
    },
    {
      "critic": "Guy Lodge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 30,
      "summary": "Penn’s veiny, sweat-glazed biceps are the most objectively impressive feature of this rote, humorless thriller, a distinctly unconvincing attempt to refashion the star — who also co-wrote and produced — as a middle-aged action hero in the Liam Neeson mold."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2015
      },
      "score": 25,
      "summary": "A dumb, loud action movie that aspires to forcibly entertain and provoke thought but fails miserably."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 25,
      "summary": "The Gunman degenerates into dreary setups for guns and gore. Penn merits more. So do we."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 25,
      "summary": "Sean Penn smokes, glowers and shows off his knotty naked torso in this vain, risible misfire of a thriller about a reformed killer, from \"Taken\" director Pierre Morel."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 25,
      "summary": "The Gunman veers dangerously close to camp in the final scenes. If you make it that far without walking out."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 25,
      "summary": "The Gunman may start as a genre exercise of promising purpose, but it winds up being just a lot of bull."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 25,
      "summary": "For meat-headed incoherence, a badly written, poorly directed and confusingly acted muddle of global nonsense, The Gunman is another ill-conceived entry in the latest dopey trend of middle-aged men blowing up stuff."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "Good production on the vistas and action sequences, but lackluster story and imprecise use of the veteran actors hamper the movie. With credible cast touring different memorable cities, the film is visually engaging for most of the time. It also delivers a couple of devastating action choreography of Bourne level. However, it trudges through bland story of stereotypical espionage and uninteresting romance. While the collective acting prowess is barely able to keep the film interesting, these experienced actors surprisingly don't perform consistently enough to fully maximize their potential.",
      "total_reactions": 2,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "Sean Penn is on the run after the guys who hired him to assassinate a major figure are out to eliminate him. His plight takes him down too many talky pathways and dull romantic moments. Since it's directed by Pierre Morel (who did the original \"Taken\"), the fight scenes are flashy and violent. There just aren't enough of them. Penn's very fit body (which is shown off plenty) belies his craggy, rough face, which is locked in an intense scowl. A forgettable film.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2015
      },
      "score": 3,
      "text": "Sean Penn character is literally not sympathetic enough to make you wanna root for him. Aside from a not so strong script, there's not much in the movie that can save it from disaster.",
      "total_reactions": 1,
      "user": "Rodrigo2803"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "It's pretty watchable, but it's just so darned generic.  Seems almost entirely purposed as a vehicle for Sean Penn to show off his guns (and pecs).  He's really the best part of the movie, but the entire enterprise is so \"Euro\"... no really pop to any of it.  And the typical cat-and-mouse chase crap at the end is SO routine.",
      "total_reactions": 4,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "It's unfair to say \"The Gunman\" is a bad film. After all, it's expertly shot, scored and edited. The actors authentically portray their characters and Sean Penn, expectedly, is exceptional as Jim Terrier. The plot is credible once we accept that, like most movies, it's a work of fiction. Yet \"The Gunman\" still fails on a thematic level. It's major problem is that it lacks focus. It attempts to provide a character study within the context of a political thriller through the convention of an action film.",
      "total_reactions": 4,
      "user": "danielgreen"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2015
      },
      "score": 1,
      "text": "How many times can this same plot be done?  Poorly written, poorly directed badly acted. The Gunman is just another shoot stuff up, blow stuff up, make lots of noise and flames boring movie. Ca someone in Hollywood please make something creative already.",
      "total_reactions": 2,
      "user": "copabeat"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "If you're looking for a simple enough action movie, this is definitely okey. Seeing Sean Penn in this movie, can probably feel odd to some, I basically don't care. You'll have a couple of ridiculous scenes where Penn seems just to want to show off his body, a few short annoying moments. The plot is predictable if you have some intelligence, but I didn't mind that.",
      "total_reactions": 2,
      "user": "Idiota150"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2015
      },
      "score": 3,
      "text": "Remember that time Matthew Fox was in that Roshamon rip-off set in Spain?  Or that time that they remade The Taking of Pelham 1 2 3 for some reason?  No?  That's a shame, because either is more memorable than this late-career paycheck for Sean Penn.  In a loving ode to both Safe House and the Constant Gardner (that's what they did, right?...intentionally combined the most boring parts of these movies to cinematic test of fortitude for the casual observer), Sean Penn gallops around the world kicking all sorts of bad-guy-butt like only a 54-year-old can do these days.  Somebody done him wrong...and they're about to get theirs once he figures it out.",
      "total_reactions": 3,
      "user": "ScrawnyPunk"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "I saw the \"The Gunman\" in a cinema chair. For me it was simply one of the best movies I've seen lately. The story and the suspense held me to the chair until the end of the movie. In the background there is much reality that is unknown in the interests of a large multinational and its ability to achieve its goals. Great movie.",
      "total_reactions": 3,
      "user": "nrasteiro"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2015
      },
      "score": 1,
      "text": "Sean Penn's grumpy, irritated spy in The Gunman, is by far his most pathetic role yet. After all, Director Pierre Morel takes the helm of this \"spy clearing his name\", seen-it-all-before action thriller. With a great cast, including- Idris Elba, Ray Winstone and Javier Bardem, how could it be THIS bad? Turns out, the lazy writing, tiring plot and so-so characters made the film unbearable if it went on for another hour. But there is a heavy amount of bloody, gleeful and slick action to behold, also it's a well shot movie as well. Javier Bardem's nerdy looking villian doesn't hold up the movie until it's rushed final minutes. Overall, The Gunman is a well shot, but tiring film, that really knows how to fire than entertain.",
      "total_reactions": 1,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2015
      },
      "score": 3,
      "text": "Sean Penn has consistently been one of the best actors in Hollywood for the past twenty years but since he won an Oscar in 2008 for Milk he seemed to cutback on the roles he's been playing and many of these roles were supporting characters. The Gunman is Penn's return to a leading role where he seems to be taking a page out of Liam Neeson's book and looking to become an action star now that he has aged. Pierre Morel, the director of the original Taken film, is the director for the Gunman which had me interested but sadly the film just does hold up. The plot is sub-par and confusing in many places. The action isn't bad but its not going to be making any headlines and the characters are forgettable despite a pretty strong cast. The trailers promised a lot in this film that was almost non existent in the film. Idris Elba was one of the top billed characters in the film despite getting about 2 minutes of screen time in the film. The action is also often replaced with boring and cheesy drama and no one wants to see that.",
      "total_reactions": 1,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "no guns in the movie sean pean takes his shrit off and 2nd worst of the year the the hole movie suck sean pean is not a good actor and also every actor in the movie sucks",
      "total_reactions": 6,
      "user": "REVIEWERWILL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "Sean Penn joins the ever growing group of ageing actors becoming action heroes in this new effort from the director of Taken. It may want to think it is more upmarket and intelligent than its counterparts, dealing as it does with foreign aid in the Congo, but in the end it's just another shoot-em-up. An eclectic cast including Ray Winstone and Mark Rylance try and bring gravitas to the material but in the end they are fighting a losing battle.",
      "total_reactions": 0,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "If you enjoyed Blood Diamond with Leonardo DiCaprio then you will view this as a milder version. The Gunman was better than expected because it delivered good performances and worthy actionable scenes. It flowed well, surprisingly, Sean Penn is a great action character for his age as well as in great shape.",
      "total_reactions": 0,
      "user": "chughead"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2015
      },
      "score": 4,
      "text": "In theory, everything was perfect. An action movie directed by Pierre Morel (the brilliant Taken 1 and the awesome From Paris with Love) and starring Sean Penn, Javier Bardem and Idris Elba.",
      "total_reactions": 0,
      "user": "RealMuthaF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2016
      },
      "score": 7,
      "text": "When an assassin becomes a target!",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2015
      },
      "score": 1,
      "text": "So Sean Penn went to the gym. After a rather nice workout, he took a good look at himself and thought: \"Gee, I'm a ripped, nice and hot mofo! This deserves a treat!\"",
      "total_reactions": 0,
      "user": "Erik_Imsen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2016
      },
      "score": 3,
      "text": "Generally interesting concept but poorly done, averagely acted and badly developed plot. Sean Penn is not a convincing muscle tough guy and apparently he only ages by shaving his beard thing... only to be watched if the only other option is being stuck in a lift with a big man suffering terminal flatulence.",
      "total_reactions": 0,
      "user": "Paulystan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "This was a great \"action\" movie. Compared to modern actions flicks of today, this one far exceeds the norm. Great production quality really ties together the momentum of the story with a solid performance from Sean. Other actors seem to fall flat when placed juxtaposition with Sean. Either they are making him look really good, or they were just terrible. You decide.",
      "total_reactions": 0,
      "user": "Acefire"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2016
      },
      "score": 5,
      "text": "I liked the action parts of the movie, felt like a proper action movie, the actual story felt a bit weird and missing something, and maybe a bit even unreallistic I don't know. Also I did not like that it was unbelievably predictable. Also not sure if Sean Penn is the best guy for action movies, but he was decent here in my opinion unlike others say here.",
      "total_reactions": 0,
      "user": "Ralfbergs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2015
      },
      "score": 2,
      "text": "Awful movie.  Sean Penn as love interest to a lovely young lady made me cringe.  He looked like an old fart on steroids, lots of them.  I had to fast forward through love scenes, couldn't stomach them. Story was so ridiculous when he got spells from illness yet took out bad guys like there's no tomorrow.  Snooze between dumpsters and good to go.  Would have played slightly, and I emphasize slightly, more believable if they hadn't thrown in the brain damage.  Ray Winstone and Idris Elba were good;  both should have had a lot more screen time.  Javier Bardem overacted when he was \"drunk and was otherwise still quite bland.   Story very predictable in a lot of parts, clues as to what was coming were really in your face.  Yeesh, what an absolute waste of time.",
      "total_reactions": 0,
      "user": "metaguest"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2015
      },
      "score": 5,
      "text": "Starring Sean (If Liam Neeson is making money doing this crap then I can to) Penn, Javier Bardem and Idris Elbow. Considering a lot of people seemed to hate this film I find that a little harsh. Even with its predictable story and action sequences it actually manages to pull itself together to make a decent only gonna watch it once action flick. Aside being a tad too long it's watchable and enjoyable in the moment, can't really expect much more from these sort of films. Recommended cause there's nothing else out.",
      "total_reactions": 0,
      "user": "Rebecca31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2016
      },
      "score": 1,
      "text": "Really terrible, annoying, waste of my time. The plot is so farfetched why would anyone want to assassinate an african cabinet minister everybody knows they have no power at all and eliminating a minister doesn't change anything it's the president who has the final say. I have never been this irritated by a movie from start to finish and the only reason i endured it was i needed to see how much worse it could get. The love storyline is senseless, unnecessary and manipulated to pump up Penn's ego.",
      "total_reactions": 0,
      "user": "nosma"
    }
  ]
}