{
  "mc_avg_user_score": 6.1,
  "mc_metascore": 49,
  "mc_mixed_rating_frequency": 87,
  "mc_movie_name": "The Mechanic",
  "mc_negative_rating_frequency": 14,
  "mc_positive_rating_frequency": 65,
  "mc_pro_critic_reviews": [
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2011
      },
      "score": 80,
      "summary": "Feels fresh and satisfying. Maybe it's the presence of Jason Statham, the British action star who has a physicality like no other actor out there right now."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2011
      },
      "score": 75,
      "summary": "Like the original, it is a moody, atmospheric film, one boasting significantly more depth than your typical blow-'em-up."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2011
      },
      "score": 75,
      "summary": "Short, fast and nasty, The Mechanic is considerably more fun than the rather lethargic original."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2011
      },
      "score": 75,
      "summary": "To the extent that it's original, The Mechanic is insane, bordering on gloriously insane."
    },
    {
      "critic": "Josh Modell",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2011
      },
      "score": 75,
      "summary": "Couple that with actual acting-Statham is the most winning action hero around, and Foster brings some nuance that the script probably doesn't deserve-and it's bloody fun."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2011
      },
      "score": 70,
      "summary": "Quick, capable, thoroughly bloody action film."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2011
      },
      "score": 70,
      "summary": "The action is entertaining enough, and it's kind of fun to follow the intricate plotting and planning of the jobs."
    },
    {
      "critic": "M. E. Russell",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2011
      },
      "score": 67,
      "summary": "Improves on the original in at least one key way: Its lead characters appear to have souls."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2011
      },
      "score": 65,
      "summary": "Mostly, The Mechanic creaks and groans as it goes through the motions, and not even its lavish violence - which includes much smashing of heads and a nasty screwdriver stabbing - is particularly electrifying."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2011
      },
      "score": 63,
      "summary": "Despite a certain emotional chill, what holds this Mechanic together is - no surprise - the core Carlino story."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2011
      },
      "score": 63,
      "summary": "Brisk, brutal and unconcerned with collateral damage, The Mechanic doesn't pave much of anything new in the assassin-for-hire genre. But when it kills, it does so with style."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2011
      },
      "score": 63,
      "summary": "Adequate light entertainment for those who enjoy thrillers, but it is uneven and the underwhelming ending will disappoint those who enjoyed the delicious irony served up by its predecessor."
    },
    {
      "critic": "Mark Jenkins",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2011
      },
      "score": 60,
      "summary": "The movie is crisp and contemporary enough to inaugurate another franchise for Statham."
    },
    {
      "critic": "Brian Miller",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2011
      },
      "score": 60,
      "summary": "Jason Statham bares his six-pack before speaking his first line in this humorless, efficient remake of the 1972 Charles Bronson hitman movie."
    },
    {
      "critic": "David Hughes",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2011
      },
      "score": 60,
      "summary": "Better than \"The Transporter\" but not as much fun as \"Crank\"."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "The result is just good enough to pass as an action flick you watch with the forgiving gaze that comes from too many beers and too little sleep."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "Has a deliberately minimalist, retro look to it as well."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "An intermittently arresting, mostly standard action entry that deals death noisily more than cleverly - a lot like the original."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "It'd be nice if Jason Statham and Ben Foster, The Mechanic's mentor/protege duo, could crack a smile. Once."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "The Mechanic remains singularly uninvolving - a rote exercise in a genre with characters so familiar they barely register."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "An intriguing plot is established, a new character is brought on with a complex set of problems, and then all the groundwork disintegrates into the usual hash of preposterous action sequences."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "As it is, The Mechanic is ham-fisted pulp, like Robert Rodriguez's \"Machete\" taking itself seriously."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "Like many action stars, Statham is good at cool brooding, but West's frantic style works against this."
    },
    {
      "critic": "Una LaMarche",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "The Mechanic runs on violence, and when no one's being riddled with bullets or getting their hand shoved into a garbage disposal, it lags. That said, the \"action\" sequences are so frequent and bloody that they render plot nearly obsolete."
    },
    {
      "critic": "Brian Lowry",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "In essence, this one is the equivalent of the \"B\" movies that flourished during the original's era -- and it proves middling, and occasionally muddled, on almost every level."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2011
      },
      "score": 40,
      "summary": "The only bit of machinery that makes the film move is Jason Statham, who's provided the steely saving grace in so many modern action movies."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2011
      },
      "score": 40,
      "summary": "There's some limited entertainment to be found in a movie as insistently conflicted as The Mechanic, but the accretion of sadism, humorlessness and antediluvian sexual politics is finally more exhausting than enlivening."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2011
      },
      "score": 40,
      "summary": "It's so played out at this point that not even the enjoyably no-nonsense Statham can pump any life into it."
    },
    {
      "critic": "Mark Keizer",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2011
      },
      "score": 40,
      "summary": "The new film could have benefited from even a moment of genuine reflection. Being a mechanic seems like a thinking man's occupation. The Mechanic, though, barely has a thought in its head."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2011
      },
      "score": 40,
      "summary": "It's a pleasure to watch the granite-faced action star do his own stunts, particularly a death-defying leap from a bridge. Yet everything feels hurried."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2011
      },
      "score": 38,
      "summary": "It's a modestly effective but jaw-droppingly violent picture."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2011
      },
      "score": 30,
      "summary": "Mr. Statham, the specialist in English tough guys who was so affecting in \"The Bank Job,\" has more to offer than The Mechanic has the grace to receive."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2011
      },
      "score": 30,
      "summary": "West (Con Air) saturates his imagery in a sickly, sulphurous stew of rotten-egg yellows and oranges, making a mediocre picture downright repellent at times."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2011
      },
      "score": 25,
      "summary": "Even by the sloppy, soulless standards of hit man movies, The Mechanic is a mess."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2011
      },
      "score": 25,
      "summary": "What's remarkable about the remake is its nastiness."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "\"The Mechanic\" is a action movie with mind blowing sequences and bad ass acting by Statham. The only problem is that the movie knows what it has to offer. In other words, the movie is considerably predictable.",
      "total_reactions": 3,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "At this point, when I go to a Jason Statham movie it is very hard to be disappointed.",
      "total_reactions": 1,
      "user": "GarrettTanner"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "An explosive action movie with Jason Statham at its best. I believe its an all around action thriller. Its packed to the brim with explosions, headshots and even a destructive car chase. The Mechanic certainly fixed things well for me to enjoy this movie from begining to end. Well worth a watch",
      "total_reactions": 2,
      "user": "Karan_Khanna"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2011
      },
      "score": 3,
      "text": "I called a Mechanic, and he broke my film.",
      "total_reactions": 2,
      "user": "TitusPrime"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "The discrepancy between the critic and civilian scores on this movie is interesting. It's actually quite a good movie of its type - an action thriller.  Both Jason Statham and Ben Foster do excellent jobs as the protagonists, the plot is fun, the villain is villainous. It moves along crisply and I thought it was better than the  Charles Bronson original (which is pretty good considering this one doesn't have Charles Bronson). If you want a straightforward action flick you'll enjoy this one.",
      "total_reactions": 1,
      "user": "weisberger"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "This is probably Jason Statham's worst film yet (and I'm a fan). He plays the typical hit man: a cold-blooded loner of few words who likes classical music. He teams up with Ben Foster (to add a bit of acting) and they pull off a few absurdly implausible kills. The atmosphere is glum and the action is violent without being particularly inventive.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "Jason Stathom is the Clint Eastwood of Action flicks.  He doesn't say much, his facial expression says it all.  He doesn't stretch with this role - in fact they could have called it Transporter 4 with a few changes, but the partnership with Ben Foster is a good change of pace.  As Stathom movies go, this one is somewhere in the middle.  Entertaining, holds your attention, but not his best, and a little too predictable.",
      "total_reactions": 1,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "Statham does it again. Another au courant, fast-paced, high octane \"Transporter\" progeny whose on-screen action is so entralling that it's run-time seems to fade as swiftly as its direction. Like its cinematic predecessors, \"The Mechanic \" makes for a great popcorn action flick that never loses your attention, and leaves you in your seat anticipating and wanting more from Statham's tough guy mein. Contrarily, when viewed more closely, the same Hollywood errors are mainfested. The first of these is the lack of depth. Statham and Foster move from one hit assignment to the next without much happening in between the various sequences. One minute you see the two men holding up a photo of their next mission, and the very next scene you see them hacking into a building and carrying out their duty with untenable ability. And what about this infallibility? When we are first introduced to Foster, he is an anguished, morose, hate-driven young man whose only sense of continuity is the vengeance of his father's killer. We see this desperate young man seek counsel from Statham and in a blink of an eye, without the film's care to show how, is transformed into a merciless, killing machine with a repetoire of skills, so vast as if to be acquired over many years. But nonetheless, despite the display for such, Foster suddenly emerges as the perfect accomplice. Aside from the rushed, under-developed writing and substance, \"The Mechanic\" is a highly enjoyable treat for the everyday, casual moviegoer. For you, the movie has plenty of surprises, explosions, sex, and ass-kicking. Statham doesn't disappoint, and continues to awe audiences with his feral physicality and winsomely, reticent, yet palpable demeanor. Like any other film of the genre: get comfortable, leave your intellect at the ticket office, relax, grab some popcorn, and sit back as the 92 minute run-time unfolds before your very eyes. You're not going to want to miss a second!",
      "total_reactions": 1,
      "user": "FDT44"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2011
      },
      "score": 4,
      "text": "Pretty much your typical Jason Statham movie with your typical car chases gun battles and fights, but not as exciting. I felt like there could have been more intense action sequences and a more developed plot. The movie was entertaining only because Statham was in it.",
      "total_reactions": 1,
      "user": "BShea423"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2013
      },
      "score": 5,
      "text": "Solid acting, Solid action, and an overall interesting plot. I agree that it is a bit predictable and it doesn't really break the norm of a normal action film. It's not bad though, Worth checking out.",
      "total_reactions": 1,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 4,
      "text": "The hitman wants some information and he won't accept silence as an answer. During a home invasion, it appears as if Arthur(Jason Stratham) will bring harm to an innocent girl, which runs contrary to his proclamation that he only goes after people who had it coming, but now, in a strange kitchen, we find the self-described mechanic threatening to grind a young woman's hand down the garbage disposal, unless her father fails to divulge the whereabouts of their duplicitous boss, Dean Sanderson(Tony Goldwyn). \"You bastard!\" screams the prostrated mother, held down, face first, at gunpoint by Steve McKenna(Ben Foster), Arthur's apprentice(and receptacle for penitence). Surely, there's no need for names, since the mechanic, under normal circumstances, eliminates any chance for collateral damage via his meticulous planning, largely because he's a sociopath with ethics, an honorable killer. The father, the man on the spot, slow to react, as a result, prompts Arthur to make good on his threat, and for a couple of agonizing seconds, he has us going, has us believing that the girl will be needing a prosthetic, but it's steak, not phalanges and worse, that creates the pulverizing noises. This mean streak, albeit a fake one in service of a hoax, evokes Stratham's predecessor, the late Charles Bronson, whose minimalist take on Arthur Bishop in the 1972 original differs in that his hitman, a mustached hitman, largely acts apathetically toward the murdering of innocent bystanders. The wordless sixteen minute opening to the Michael Winner film climaxes with a fiery apartment complex explosion, destruction on a scale wide enough to have claimed additional lives, on top of the original target. Compare that to the beginning of the remake, in which the clean shaven assassin takes out the Colombian druglord without having to molest one member of the kingpin's minions who occupy the opulent mansion. And unlike the assurance he gives Steve(during his on-the-job training) that the man they had just killed was an unscrupulous arms dealer, the Bronson vehicle never makes reference as to why the incinerated man was selected for removal. On another job, the underrated actor breaks the neck of a hapless fast food worker, for no other reason but to steal his Chicken Lickin' vehicle. Whereas Stratham's mechanic derives no gratification from his outlaw profession, Stratham's forebearer takes delight in seeing a man squirm for his life, even if that man is a confidant. In the hyperkinetic remake, Arthur shoots an incapacitated Harry McKenna(Donald Sutherland), his wheelchair-bounded mentor, in a parking garage without any histrionics, or sense fun and games. To the mechanic, killing a man in cold blood is business, not pleasure. But the seventies era original has its namesake torturing his prey, prolonging the inevitable on a deserted beach where McKenna is repeatedly shot at, near-misses meant to provoke a spontaneous coronary attack. Modeled after James Bond, the mechanic, in actuality, seems closer to the Bond villain, who often toyed with the secret agent rather than simply killing him. Alas, McKenna doesn't escape; he dies, but the mechanic's impish spirit could have easily resulted in McKenna's bolting, due to the hired killer's penchant for drawing things out. He has no scruples, this mustached mechanic; he enjoys his work, as opposed to the remodeled Arthur Bishop, who expresses remorse for the systematic execution of Steve's father, most explicitly, in a scene where the mechanic can't bear to glance at a picture of the murdered man which the son, his future protege, hands him. In Winner's film, the moviegoer never gets the sense that Bronson cares, one way or the other, about orphaning Jan Michael Vincent. The Lithuanian gives away nothing. Stratham, on the other hand, gives away too much. The spirit of Bronson, or more pointedly, the spirit of the justified homicide that ran through the films Winner made with his muse, lies within Steve, who attacks a would-be carjacker and a would-be rapist, which are the sort of violent counter-attacks against minorities(black) that got \"Death Wish\" charged with racism, and also, galvanized sold-out audiences, who couldn't get enough of vigilante justice, back in the politically incorrect days of the early-seventies. The ending, predicated on the notion that the mechanic has no conscience, is duplicated in the remake, but it's rendered nonsensical by Stratham's attempt at a thoughtful performance. As a result, the mechanic seems too sensitive, too self-reflective to begrudge a son's right for vengeance against his father's murderer, by inflicting some unmotivated vengeance of his own.",
      "total_reactions": 0,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2011
      },
      "score": 5,
      "text": "what is the most surprising aspect is that, the movie has a good tone of vibrant colors which are rich and delivers the same old fashioned action stuff in 90 minutes. the way it begins is something to be noteworthy. the beginning stunt will decide the way the movie is going to turn. once from that we always realize that it is full of action. so considering the action movies in general, what we expect is some good doses of action scenes with hint of novelty in execution. to the most surprising factor, the action scenes are not up to the mark when compared to previous jason sthatham movies. there are nearly 5-6 scenes which involve crude violence. after the first scene, the movie takes a stroll in the park, for about 30 minutes. may be the director had lost his mind to continue the plot and so connects the vengence drama in between. after drinking some water, which he decided after sometime, he brought back the story to life. but now the viewers are already exhausted. director would not mind a few minutes of break. so thats how the cliched first half raps up. when viewers are back on seats, the director promises novel action scenes in second half and with some twists in the climax, movie goes to a full heap potential. some where the movie lost and some where it regained. the last scenes of the movie would infact be surprising but, i do not think so it was a perfect end. looks like a classy! vengence drama filled with action scenes and some interludes of script called the mechanic. vulnerable trained and persons who does assignments to clean targets silently. looks like the director had his last few drops of ink and might have been frustrated with the way the narrative went. he did not cleanly do the assignment here, there were lot of mishaps and content weakness. the mechanic -- imposed itself for jason sthatham only. rest characters are filled and cliched with lack of emotions and life to them. together we can conclude that the movie is no special here. regular doses of action, vengence effect and some dejavu feeling. disturbing for younger generations and even not appealing for all classes of audiences. only action movie lovers would like it. but i would get a feel if expendables was way better than this one. but both of them share a thing in common , lack of script and narration... let me say that depends on your personal interest and if you are a die hard fan of jason sthatham , then keep the initial stunt and the climax stunt in your mind. forget the rest. not worth the penny.",
      "total_reactions": 0,
      "user": "sreekiran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "This was a great movie with action and some minor twists as a thriller. After seeing a few of Jason Statham's other movies I was expecting a great movie and it lived up to it. It actually superseded my expectations as he was playing the role of hitman.",
      "total_reactions": 0,
      "user": "kingshahid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "It was predictably shallow on plot and large on action but sometimes I enjoy a simple action flick. My biggest complaint will go unnoticed by all but the true gun geeks out there. The close up of an ejecting case in slow motion was obviously a blank round. Its a stupid complaint I agree, but if your going to the trouble of filming it up close and in slow motion you should get it right!",
      "total_reactions": 0,
      "user": "gunnyart"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 6,
      "text": "Overall, it was about what I expected.  A lot of over-the-top, unrealistic violence.  Which is kinda of what I wanted, so I did not leave disappointed at all.  It's definitely worth a rental if you are into these types of movies.",
      "total_reactions": 0,
      "user": "pete409"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "Exactly what is expected from a film with Statham in a leading role.  Ben Foster is a good addition to the cast,  and Sutherland senior is always a joy to watch.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "What's next, Jason Statham in '' The dishwasher ''. This movie is like a 9th Transporter or something. But I still enjoy it. There was some scenes that you say '' Man, he just got own '' or '' That sh*t was bad ass \". You couldn't really see the action very well because the cameras were moving really fast, then somebody dies and you're wondering what just happened. It's still an enjoyable movie and a good one to see with some friends. Jason Statham was awesome in this movie, just like all of his other ones.",
      "total_reactions": 0,
      "user": "scrieciu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "I really enjoyed this movie. Not perfect but a great action packed thriller. Special effects were cool and the actors did a great job. No complaints. Solid movie! Go see it!",
      "total_reactions": 0,
      "user": "Amp191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "The Mechanic is a short, sharp burst of robust action-schlock. The action sequences themselves are excellent; full of excitement, descent stunts and minimal CGI trickery. The acting is also a notch or two above average. The plot and dialogue are very pedestrian, though. There just aren't any surprises in the story or script. That said, The Mechanic barrels along so quickly that it hardly matters and it easily steamrolls the likes The Transporter in the entertainment department. Basically speaking, it's a good action flick.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2011
      },
      "score": 6,
      "text": "Not a bad action/thriller movie. I always enjoyed Jason Statham movies...sure they are a lil outrageous (Crank, Transporter) but I enjoy those kind of action movies and this has plenty of action. A decent cast, not cheesy lines, plot is good, didnt really fool me but overall its a decent popcorn flick that shouldnt be taken to seriously.",
      "total_reactions": 0,
      "user": "MrRiggs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "This movie is a violent, occasionally gruesome action movie that should satisfy any action-movie needs you have.  I only rate it low because I felt that the script had potential to be much greater than it is.  The idea of a \"mechanic\" who has to reconcile his violent career with his own life and morality could have been very interesting.  Instead, The Mechanic goes straight for predictable action.  That's not bad.  It just could have been more.  And considering that this is a re-make, I felt like they should have taken the time to develop the plot further.",
      "total_reactions": 0,
      "user": "williamthewise"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "I was very encouraged to find this site. I wanted to thank you for this special read. I definitely savored every little bit of it. Singapore Company Registration",
      "total_reactions": 0,
      "user": "melindahills"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "Yes this film was predictable, and yes assassin films have been done to death, but....I must say I was thoroughly entertained while watching this film. Jason Statham will probably never win an Oscar, an he has let himself fall into the same rut of being type casted as the \"bad boy killing machine\" but hey, he's good at it. With the success of Transporter and  Crank....The Mechanic smell like another action hero series to me!!!",
      "total_reactions": 0,
      "user": "MrC3030"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2011
      },
      "score": 4,
      "text": "The Mechanic had bad acting, absolutely terrible script writing and a plot that seemed to be held together with 3 year old Blu-tac (you know, when it has gone all hard and not sticky anymore). There are so many actions films out there that are great fun to watch for men and women alike though so I just kept thinking: why?!",
      "total_reactions": 0,
      "user": "hesaidshesaidfm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "The only reason why I watch this movie is because of the leading actor Jason Statham. In my opinion he did a good job on playing his role in this movie. A lot of actions going on even tho some part a little bit ridiculous. A scene where you find the lead character is like a superman (invincible? you know what I mean) is all there. If you're looking for a fun action movie to watch, I think this movie is pretty good! One of the movie that you should check if you're Statham fans.",
      "total_reactions": 0,
      "user": "WaGyu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "I went to see this movie expecting action and that is exactly what I got. Sure the movie was predictable but who really goes to see a kick a$$ show with Jason Statham for anything more then good fast action... not me. He is the top action actor at present and the movie was well edited and flowed very nicely. Unlike Faster which was a little too slow given the name, The Mechanic was exactly as portrayed in the trailer. Definitely the perfect \"guys night out\" movie to see.",
      "total_reactions": 0,
      "user": "Peter_Labose_LA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "Very good movie, Jason Statham looks like he is having a decent time if you have seen movies like \"Chaos\" or \"The Transporter\" its one of those kind of movies. it does go on to tell what a mechanic really is but only in a brief description. very fun movie though it does a good job doing character development in till it comes to him killing his friend and it doesn't give that much of a back-story but you are suppose to feel sorry for this character. it does really good though when it shows how Jason Statham is feeling sorry for what he did and he really does good showing the psychological impact it has of someone killing their good friend.",
      "total_reactions": 0,
      "user": "Uncle_Darais"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2011
      },
      "score": 3,
      "text": "This movie suffers from a really big problem: not enough Statham. Seriously. I was expecting a Jason Statham movie. What I got was an extremely weak buddy movie about some other guy we don't know anything about, except for that his dad got shot. Jason Statham works best alone. Crank? Solo act. Transporter? Solo act. This? Crap. Statham barely does anything cool throughout this entire movie, his sidekick either gets the good scenes or completely ruins everything with Jason in it. Not recommended, not even if you really, really like Jason Statham.",
      "total_reactions": 0,
      "user": "duffeknol"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "Jason Statham cant be killed! He's a beast. I enjoyed this film so much. The beginning had me worried because of how slow it started but once it picked up it didn't let go until the credits rolled. Good job to Simon West for making his best movie since Con Air",
      "total_reactions": 0,
      "user": "boxenford92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "Statham is brilliant yet again. He may not be in line for an academy award but that is not what he is going for. Solid action performance in a reasonably entertaining film.",
      "total_reactions": 0,
      "user": "MitcheyBabes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2011
      },
      "score": 5,
      "text": "The Mechanic is an alright film. Had very good fighting scenes and Jason Statham did a good job for his performance. Theproblm with the film is that it wasent amazing and some scenes are just quite boring. I would give this film a high rental.",
      "total_reactions": 0,
      "user": "Edward9630"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2011
      },
      "score": 6,
      "text": "It's a typical Jason Statham film. Simple, short and lots of action. Although it was good the ending is dissapointing. Nevertheless, the film is fast-paced with no pointless bits in it. You can't go wrong with 88 minutes of action.",
      "total_reactions": 0,
      "user": "sinadoom"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "Love the action!!!",
      "total_reactions": 0,
      "user": "schwarz_kellogg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 4,
      "text": "On the plus side some well crafted action sequences, well-shot and edited. This one definitely looks good in parts. But, and it's a big but, the plot is an absolute joke. Two souless characters posing as anti-heroes. The Mechanic has no heart and that is the worst part about it.",
      "total_reactions": 0,
      "user": "nickclarivette"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "In recent years, Director Simon West has become known for turning simple action movies into big hits, thanks his unique story lines. The story doesn't actually mean as much in action films as it does in other genres, because as long as people are getting killed and things are blowing up, most action fans are satisfied. Simon West wasn't and in recent years, he has given us some great stories to go along with the amazing action. His most recent film is actually a remake of the 1972 Charles Bronson classic, by the same name. The Mechanic is a code name for CIA hit-man, Arthur Bishop (Jason Statham). For years, the Mechanic has gotten the job done without question, until one day his next target is revealed as his mentor. The stories are similar, but the special effects and action moves are much more intense, and we have Jason Statham to thank for that. This man has single handedly taken action films to another level. For those unfamiliar, the man speaks several different languages, is trained in dozens of forms of fighting, and he's quick with a joke, many of which are unscripted. Every film Statham does is entertaining for his tremendous moves and unpredictability. The Mechanic gives Statham the chance to show off his talents and for that, I loved it, but trying to modernize the original story without changing it all that much, makes things feel a little outdated. I found many things to be tame by today's standards and the film itself does suffer because of it. Statham is paired with Ben Foster and that's problematic for the film as well. Foster is not known as an action star, he's the complete opposite of Statham, and in this case opposites do not attract, they had no chemistry whatsoever. In my opinion, Jonathan Rhys-Myers or Alex Pettyfer would have been a much better choice, but I am just a reviewer. That being said, the Mechanic isn't a bad movie, it has all the moves and wit of a typical Statham movie, but the story is more than a little outdated and aside from Statham and Sutherland, the casting left a lot to be desired.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "\"The Mechanic\" is an entirely enjoyable action flick if you've only seen three or four other action movies, which is about equivalent to half a Michael Bay film. It considers the expectations of its audience. Guns are shot, stunts are pulled off, and cars are thrashed all over. But the real joy in movie-watching usually comes from the unexpected, which is a fact that this movie is either too lazy or too ignorant to recognize.",
      "total_reactions": 0,
      "user": "AutiTakahashi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "A typical action movie, with guns, fights and explosions, but a lot of fun to watch. Some fairly brutal fighting as expected from almost any movie with Statham in it, worth watching.",
      "total_reactions": 0,
      "user": "khvivi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Good movie but had flaws sadly it wasent More interesting but hey what can you do.This is worth the watch though its a good classic move.Jason statham is one of the best actors.",
      "total_reactions": 0,
      "user": "M9ki"
    }
  ]
}