{
  "mc_avg_user_score": 7.7,
  "mc_metascore": 62,
  "mc_mixed_rating_frequency": 45,
  "mc_movie_name": "The Help",
  "mc_negative_rating_frequency": 25,
  "mc_positive_rating_frequency": 332,
  "mc_pro_critic_reviews": [
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 100,
      "summary": "The Help isn't intended to be so much a movie about the ugliness of the era than an optimistic tale of what can spring from that kind of ugliness, about the ability of people to love one another even when they're surrounded by hatred. And on that level, The Help succeeds wonderfully, a warm and sweet song of hope."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2011
      },
      "score": 91,
      "summary": "The Help has a saucy, humorous side."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 88,
      "summary": "A deeply touching human story filled with humor and heartbreak is rare in any movie season, especially summer. That's what makes The Help an exhilarating gift."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2011
      },
      "score": 88,
      "summary": "Davis and Spencer give faces and fully-fleshed out lives to women who must have been more than what they did for a living as The Help."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2011
      },
      "score": 85,
      "summary": "The \"black maid\" may be a cliché. But when was the last time we saw a story told from her point of view?"
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 80,
      "summary": "The Help definitely worked on me as a consummate tear-jerker with a terrific cast, and it's pretty much the summer's only decent Hollywood drama."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 80,
      "summary": "Laughter, which is ladled on thick as gravy, proves to be the secret ingredient - turning what should be a feel-bad movie about those troubled times into a heart-warming surprise."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2011
      },
      "score": 80,
      "summary": "A stirring black-empowerment tale aimed squarely at white audiences, The Help personalizes the civil rights movement through the testimony of domestic servants working in Jackson, Miss., circa 1963."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2012
      },
      "score": 75,
      "summary": "The Help's most apparent flaw is a tendency to paint with broad strokes. With only a few exceptions, it avoids shades of gray."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2011
      },
      "score": 75,
      "summary": "It's a movie of terrific performances and rousing comeuppances, with a side order of corn pone for the soul."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2011
      },
      "score": 75,
      "summary": "The Help will make you laugh, yes, but it can also break your heart. In the dog days of August moviegoing, that's a powerful recommendation."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 75,
      "summary": "The Help sidesteps easy sentimentality. As the film's heart and soul, Davis and Spencer add vast reserves of depth and dignity to a crowd-pleasing tale."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 75,
      "summary": "Good story, great characters, a setting plucked from history - and a multiracial, multigenerational ensemble cast stacked with fabulous actresses. But the thing that makes The Help such a rousing crowd-pleaser is its generous helping of baked goods."
    },
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 75,
      "summary": "Like its characters, it has its faults. But overall, it is a movie of imaginative sympathy that gets into the skin of its characters, into their hearts, and, ultimately, into ours."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 75,
      "summary": "This is a good film, involving and wonderfully acted. I was drawn into the characters and quite moved, even though all the while I was aware it was a feel-good fable, a story that deals with pain but doesn't care to be that painful."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 75,
      "summary": "Davis is reason No. 1 the film extracted from Kathryn Stockett's 2009 best-seller improves on its source material."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2011
      },
      "score": 70,
      "summary": "Instead of plunging us into a racist past, however, The Help takes us on a pop-cultural tour that savors the picturesque, and strengthens stereotypes it purports to shatter."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2011
      },
      "score": 70,
      "summary": "The acting is uniformly excellent, and the cause - dragging the beginnings of civil rights into Jackson, Miss., at great risk - couldn't be nobler. What the film lacks is a strong point of view."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 67,
      "summary": "It's a carefully manicured, almost genteel piece of moviemaking. The film is paradoxically both rousing and lulling."
    },
    {
      "critic": "Ella Taylor",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2011
      },
      "score": 65,
      "summary": "Big hair, fine period frocks and interior design lend The Help a pleasingly retro look. Yet for someone who grew up in Mississippi, the director has little sense of place."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 63,
      "summary": "Director Tate Taylor is a childhood friend of Stockett and hasn't done much else, which may be why The Help feels clumsy but well-intentioned."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 63,
      "summary": "It's a credit to the cast and to the worthiness of the idea that this overlong movie works at all. But those of us who already know that racism is bad could use a little more challenge and a little less help."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 63,
      "summary": "The movie is too pious for farce and too eager to please to comment persuasively on the racial horrors of the Deep South at that time."
    },
    {
      "critic": "Anna Smith",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "A simplistic portrayal of historic race relations boosted by terrific performances from some of the best actresses working in Hollywood today. Sure, it's corny, but it mostly works."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2011
      },
      "score": 60,
      "summary": "For every obvious turn The Help takes, there is Davis, the ideal counterweight."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2011
      },
      "score": 60,
      "summary": "It's a tough, beautifully judged performance (Davis) - it gives this too-soft movie a spine."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 60,
      "summary": "Save for Ms. Davis's, however, the performances are almost all overly broad, sometimes excruciatingly so, characterized by loud laughs, bugging eyes and pumping limbs."
    },
    {
      "critic": "Kirk Honeycutt",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2011
      },
      "score": 60,
      "summary": "Taylor does capture the Jim Crow era and its anxieties well, but his characters tend toward the facile and his white heroine is too idealized."
    },
    {
      "critic": "Ben Sachs",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "As in many reductive period pieces, there are no real characters here, just archetypes, namely reactionary cretins and sensitive souls who anticipate modern attitudes."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "The Help may be more interested in the moral at the end of the story than the story itself, but what saves the film from its meticulous one-dimensionality is that nuanced, deeply moving cast."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "Typically, this sort of film is an earnest tear-jerker with moments of levity. Instead, what we have here is a raucous rib-tickler with occasional pauses for a little dramatic relief."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "As affectionately as Taylor has brought The Help to the screen, and as gratifying as it is to watch Davis and Spencer bring Aibileen and Minny to palpable, fully rounded life, their narrative, like \"The Blind Side\" a few years ago, is structured largely around their white female benefactor."
    },
    {
      "critic": "Meghan Keane ",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "If you can suspend your disbelief that a cute 22 year-old had the power to succeed with civil rights where Martin Luther King and President Kennedy failed, The Help actually has a lot to offer."
    },
    {
      "critic": "Karina Longworth",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "We get a fairly typical Hollywood flattening of history, with powerful villains and disenfranchised heroes."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2011
      },
      "score": 40,
      "summary": "The Help is a high-functioning tearjerker, but the catharsis it offers feels glib and insufficient, a Barbie Band-Aid on the still-raw wound of race relations in America."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2011
      },
      "score": 40,
      "summary": "Emma Stone, for example, is no one's idea of an ugly duckling. And though she offers a sincere effort, she never quite settles into the role of Skeeter."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2011
      },
      "score": 40,
      "summary": "Spencer, a superb performer mainly known for small character parts, gives a star-making turn as the won't-take-no-guff Minny."
    },
    {
      "critic": "Sara Maria Vizcarrondo",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 40,
      "summary": "A chick flick for do-gooders, The Help suffers from a malady common to the discrimination drama: its treatment of inequality is more condescending than the prejudice it aims to remedy."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2011
      },
      "score": 33,
      "summary": "The whole thing is rigged for crowd-pleasing payoffs - a bit about chocolate pie gets more mileage than a Prius - and those payoffs are about honoring white viewers for not being horrible racists. Kudos to them."
    },
    {
      "critic": "Andrew Schenker",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 25,
      "summary": "High school creative-writing-class ironies of all kinds abound in The Help."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "Sweet Black Angels",
      "total_reactions": 1,
      "user": "outsidein"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "In my opinion, this is a movie well made. The acting is pretty good, especially from the actresses who played the maids. The movie also gives us a glance at how african americans were treated back in the 1960's, a time where african americans still did not have the rights they deserved. The Help is a movie worth seeing.",
      "total_reactions": 1,
      "user": "TheMovieCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "One of the most inspiring movies I have ever seen. The only flaw is at times bad dialogue, but otherwise, this movie is a must-see and is a true Oscar winner.",
      "total_reactions": 1,
      "user": "Freakazoid1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "I can honestly say I thought this movie was going to be incredibly sappy and cheesy, and was not much looking forward to seeing it.  While it did tidy-up the plot a bit too neatly towards the end, for the most part it felt surprisingly real, at least within the trappings of the film. You should go into the movie thinking that it is a work of fiction based on a real time period in U.S. history, and not look for everything to seem absolutely realistic within the context of that actual time period in U.S. history. The acting was superb across the board. This should be the film that makes Octavia Spencer and Jessica Chastain stars; their characters felt like breakout roles for them. This should be the film that makes hearthrobs out  Chris Lowell and Mike Vogel, two stunningly gorgeous men who seem to have real acting chops to match. This film should remind us what cinematic treasures Cissy Spacek and Cicely Tyson are. This film shows that Emma Stone and Bryce Dallas Howard have more impressive acting ranges than one might think based on their past work alone. However, the star of this film is Viola Davis, who is deserving of serious Oscar-buzz. Emma Stone may have top-billing for the film, but Ms. Davis's Aibileen Clark is the heart and soul of the film. You laugh with her, you cry with her, you get angry with her. Its one of those rare performances that breaks your heart and at the same time gives your heart hope. It is one of the best performances I have seen in a film in awhile, and should vault Ms. Davis on to the A-List of actresses working today. Besides the performances, the sets, costumes and all other technical aspects of the film seemed stunningly authentic. As I said before, if there is anything to fault this film for, its that the storylines wrap-up a little too neatly at the end. It also may bother some that the Emma Stone character Skeeter leaves for NYC while Minny and Aibileen stay behind in Mississippi, but at least the filmmakers take the time to address that situation in the film, with Minny and Aibileen urging Skeeter to go against her feelings that she is betraying them by leaving them there. In the end, she leaves and Minny and Aibileen are still in Mississippi, still dealing with the harshness of discrimination. Yes, that frankly sucks, but it is probably fairly realistic to that time period, and there is some hope given to Aibileen and Minny at the film's end, hope for a better life with greater dignity. This film was made to be inspiring and uplifting, and it left me with those feelings in spades.",
      "total_reactions": 6,
      "user": "jasher"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "t's an entertaining movie for white folk who need to convince themselves that they rise above the trashy white southern women depicted in the film. The black women are noble, and all, but one, white woman is a caricature of southern segregation and divided class. It's another chick flick of the south along the lines of \"Steel Magnolias\" and \"Fried Green Tomatoes.\" The subject matter: the economic enslavement and debasement of poor minority women to a racist elite is a far too serious and shameful part of our history to be taken this frothily. But I guess that like \"All In the Family\" if it takes comedy to get our history of racism, however briefly, into the consciousness of those too busy to notice then that's what it will take.",
      "total_reactions": 3,
      "user": "jeremyp"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "As usual with book-to-silver-screen adaptations, THE HELP was not quite as good as Kathryn Stockett's novel off which it is based.  However, it was very faithful, at times funny, and, like the book, extremely poignant.",
      "total_reactions": 3,
      "user": "Spielberg00"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "Every minute while watching The Help, I was constantly surprised. At first, the movie seemed to me a simple story a young woman trying to become a well known writer collecting testimonies of black maids; but is so much under it. There is a society that lives in a perfect but paradoxical situation. This is formed by small families, in which neither of the parents have time to raise their children, so that job is done by a black maid, which in some cases are treat like a slave. The relation between the housewife and the maid is ruled by an unbreakable protocol; the black employees must use another bathroom than the family, different dishes to eat, not share food or drink with a white person and not touch a white adult because they can spread disease; but, and here is the paradox, they can take care of the children. Another paradox is that the white people treat the blacks as if they were animals, when twenty years ago, they criticized the Germans for their treatment of the Jews. I know that those things are on different levels, but both violet human rights.",
      "total_reactions": 3,
      "user": "NedRyerson1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "57 yr old white guy.  Thought it couldn't be that good.  Boy was I wrong.  Stayed up late to watch it all.  Give the Best Actress award to any of the women.  Loved it.  Thanks for making it.",
      "total_reactions": 2,
      "user": "chandutt"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "It was a very good movie that depicted the lives of black maids back during the time of Martin Luther king jr. It shows their rough lives and how a woman plans on publishing a book about their lives and experiences. The black people were treated very inhumanly in those days, sometimes seen as property. This movie did a great job at showing all of this happening. The acting was great, the history was accurate, and you felt part of their story. The ending was happy and sad, but you enjoyed it the whole time. It had many very funny scenes too!!! Many that you will be repeating for days!!!!",
      "total_reactions": 2,
      "user": "Ironmonger"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "I love this film is very interesting, I suppouse that the rhytm can be slow, but this film have a drama part, comedy, is a big film, with an incredible cast. I love The Help.",
      "total_reactions": 2,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "A movie packed with powerful performances by all the actresses. The movie brings out the overly denied message of discrimination; the movie is set in the state of Mississippi, known for its unfair treatment toward the colored people. Skeeter's an aspiring writer who needs one big break to enter the world of writing and decides to write about the unfair treatment of the women in her town, with the help of a domestic maid and as the bigotry exacerbates, more women come forth to narrate their tale of prejudice and wish anonymity. It's an equal mixture of sombre and humor. Octavia Spencer was rightly awarded the Oscar.",
      "total_reactions": 2,
      "user": "koundinya"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "I like it cause Emma is in it. Haha :D But I think its a great movie. Aight? So.. Yeah.",
      "total_reactions": 2,
      "user": "MontiYan"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 5,
      "text": "The Help is well intentioned. That doesn't make it any less racist in its (fictional) storyline based on the south in 1950's America, with the idea that only a white woman can help black women find their voice. The only reason to see this film is the talent put forward by the electrifying Viola Davis and the gutsy performance from Octavia Spencer. Other than that, there's not much here with substance, and the more horrific events of the 1950's seem to be glossed over.",
      "total_reactions": 5,
      "user": "TastyJamProject"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "It is incredibly hard to sit through because you get so angry, but its incredible performances and comedy make up for it. I almost gave this movie a bad rating,but I give this movie 60% of a good movie.",
      "total_reactions": 6,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2011
      },
      "score": 2,
      "text": "\"The Help\" tells us nothing new. Anybody who didn't know what it had to say has been in a coma for over half a century. But that isn't my problem with it.",
      "total_reactions": 14,
      "user": "NeverLift"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2011
      },
      "score": 1,
      "text": "The director, Tate Taylor, knows exactly how he wants the audience to feel about every character and every scene.  He leaves almost no room for you to make up your own mind and so the deck continually feels stacked.  You're not watching reality unfold, you're watching propaganda.  Bryce Dallas Howard's character is set up to represent the racist white south.  But her character is so devoid of any redeeming qualities that she feels like a straw-woman, and the effect is that the movie says very little other than \"bad people are bad\".  Most insulting to the audience's intelligence, the last 45 minutes of the film consist of 6 or 7 manipulative tear-jerk-er scenes in a row.  Complete with swelling \"please cry\" music, a forced break up scene, a \"group standing up and applauding\" scene, and a \"crying child saying goodbye\" scene.  No movie cliche' is spared.  I think this would be less objectionable in a film about young lovers, or a boy and his dog.  But when you are making a movie about \"the help\" in the south, a minority group whose story has (according to the premise of the movie) not been told, then you owe it to them, I think, to just tell the story and leave out the \"tear-jerk-er\" play book.  So I'd go beyond saying this is a bad movie.  It is a socially irresponsible movie that sets itself up to be something it isn't: the story of \"the help\".  Peeking through all the stupid Hollywood tricks is Viola Davis, whose performance suggests to us that underneath this trite movie was a real complicated story to be told, about real people.  It is rare that an actor can transcend material like this, and the movie is worth seeing just for that amazing feat.",
      "total_reactions": 5,
      "user": "jdicksteihn"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 0,
      "text": "This movie is **** racist. It pisses me off that it has the audacity to abuse actual clips from the civil rights movement. **** this movie, it is condescending, patronizing, artificial, superficial, and pandering. The worst kind of movie, one that tries to be about big ideas when it couldn't even manage small ones. Stupid, stupid movie. It reminds me of Uncle Tom's Cabin all over again. WTF is all I have to say.",
      "total_reactions": 7,
      "user": "todayor"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "The trailer really undersells this film. Underneath a seemingly light-hearted shell, the writer and director do an excellent job in infusing a sense of impending doom, danger, and sickness in this little Southern community. It would have been an excellent companion piece to Mississippi Burning.  I don't mean to suggest that the film overly intense - it's not.  But amidst the humor and heart-warming moments is a very \"real\" sense of the ugliness and inequality of the times which I didn't expect.  Octavia Spencer and Viola Davis are incredibly good in this movie, and I'd be shocked if both are not nominated for a bunch of year-end awards. Who would have thought that a movie this rich would have been released in August??",
      "total_reactions": 1,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "â",
      "total_reactions": 1,
      "user": "BHBarry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "What happens in Mississippi, stays in Mississippi. For the next few weeks, as part of their missing persons investigation involving three civil rights workers, last seen registering black people to vote, Agent Rupert Anderson knows that some tough sledding is in store for he and his younger, somewhat green partner, so to lighten the mood, he sings a KKK rally song, which inspires Agent Alan Ward to complain that he \"can do without the cabaret,\" because the Kennedy boy just doesn't \"share [his] sense of humor.\" In kind, the former redneck sheriff responds, \"Sometimes that's all you have left.\" Later in Alan Parker's \"Mississippi Burning\", after the church bombings and lynching, you know, your garden variety Klan mischief, Ward asks, \"What's wrong with these people?\" clearly aghast at the unrelenting and pervasive ugliness of your typical segregated town. Now he understands that the old man never meant to be ha-ha funny. In record time, he reaches the same point of resignation which inspired Rupert to drive past the state limits, so many years ago. \"These people crawled out of the sewer Mr. Ward, maybe the gutter is where we should be,\" yells Anderson, when he tries to convince the principled straight arrow FBI man that the time for diplomacy is over. Being black, Minnie knows the feeling first-hand, so the maid gets down and dirty, just like her enemies, when she decides to fight the power. \"The Help\", in addition to being lambasted by critics for telling a black story from a white perspective(the same kneejerk reaction that greeted \"Mississippi Burning\", even though the 1988 film largely transcended its racially-condescending narrative trappings, unlike other movies of its ilk, such as \"Ghosts of Mississippi\" and \"The Long Walk Home\"), the detractors also balk at its comedic moments. True enough, Jim Crow is nothing to laugh about, but, to reiterate Anderson's sentiment, \"sometimes that's all you have left,\" therefore the maids laugh so as not to cry, the same defense mechanism which the filmmaker, and also, the audience uses to combat the horrors of institutionalized racism. So while the maids conspire in the kitchen against their white employers by laughing at Hilly's practice of \"puttin' pencil marks on the toilet paper,\" it's only because Minnie chooses to put on a brave face for her best friend Aibileen. Like Agent Anderson, they laugh out of resignation. In the face of such abject humiliation, what other choice does the maid have? If she cries about it, then Hilly Holbrook, the housewife-turned-reactionary social activist who drums up neighborhood support for separate toilets, comes out the victor in the whole \"coloreds only\" bathroom dialogue. Worse still, were Minnie to get mad about the employer-enforced ban on having access to the indoor facilities, she'd probably end up in prison, just like Sofia in \"The Color Purple\", when the outspoken \"Negro\" insults the mayor's wife, and then for good measure, knocks out her husband. A person of color simply can't attack racism in that fashion. Agent Anderson can. because he's white, and in the barber shop scene from the Parker film, he does, purposely nicking Clinton with a straight-edge razor, before shoving the deputy's face against the mirror, and through gritted teeth, says, \"You got a stupid smile, you know that, pal?\" which is to say that the sheriff's right-hand man has a s*it-eating grin. Since Minnie's arsenal for revenge precludes any sort of physical contact with her employer(conversely, the FBI agent was just getting warmed up; he ends up tossing Clinton around the shop like a ragdoll), not without some serious repercussions, so \"The Help\" employs the maid with the next-best available weapon: comedy, in order to settle an old score, while at the same time, maintaining her status as a free woman. Given that the social context is segregated Mississippi, and  not swinging London(the setting for \"Austin Powers: The Spy Who Shagged Me\"), where eating s*it has a chance of being funny, the chocolate pie which Minnie laces with her own feces, in a sense, acts as a performative violence, and not the puerile hijinks that the film's critics purport it to be. This is not a gross-out comedy, after all; it's a gross-out drama, in which the grotesquerie masterminded by the subjugated black female can't begin to match the grotesquerie of the racist milieu that she is powerless to overcome. To be fair, the critics have a legitimate gripe, in regard to the writer as being another example of the trope familiar to this genre: the white savior who is going to save black mankind, but unlike \"To Kill a Mockingbird\", where the film is told through Scout's eyes, the narrative belongs, not to Skeeter, but to Aibileen. \"The Help\" ends with the suggestion that the maid will write a book of her own. \"The Invisible Woman\", perhaps, an answer to the 1952 National Book Award-winning novel by Ralph Ellison.",
      "total_reactions": 1,
      "user": "Shiira"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "This movie boils down to a feel good movie with some good acting. the acting and set locations and film methods save an otherwise LifeTime channel  movie.",
      "total_reactions": 1,
      "user": "G-Phone"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "The Bottom Line:  Viola Davis and Octavia Spencer save this film from being a two-dimensional pat-on-the-back for non-racist white people in the 1960s.  Every time the story gets a little too sappy and cut-and-dry, Davis' Aibilene returns to the screen to bring a complexity to the film that I don't think actually exists in the original book.  The film is wildly uneven, I think precisely because of the skilled, seasoned Black actresses' ability to create accurate complexity out of cardboard characters contrasting with much younger, less experienced white actresses unable to the same. In the end, it succumbs to its movie-long desire to tie a nice bow around a situation that, in 1964 in Jackson, Mississippi, was everything but harmonious.",
      "total_reactions": 1,
      "user": "SusanS"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "The good performances outweigh the flaws in this film.  All the main character performances are excellent.  The rest of the cast are interchangeable bigoted caricatures, which gives the film a feeling of unrealism at times.  My mother was born and raised in Mississippi and I can tell you not all southerners felt the way the bigots in this film do, although watching this film you wouldn't know that.  It would have been nice to have one or two more women, other than Skeeter (the main character), rebel against these atrocities.  I thought they were going to do that with the Celia character but she never really develops enough.  Still, the acting is great and you really feel for these people and root for them.  This is the kind of movie that Oscars love.  I just hope they don't forget Bryce Dallas Howard's fantastic performance as the hateful bigot, she was fantastic.  Many times the hateful people in films get ignored at Oscar time.  Lastly, if you are into interior design you will enjoy looking at the 1960s designs of the home's interiors.  They did a great job of set design.  It's kind of funny looking at the cars because they are all pristine!  Since they had to use restored cars from that time period there isn't a speck of dust on them!",
      "total_reactions": 1,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2012
      },
      "score": 4,
      "text": "\"To Kill a Mockingbird\" came out 50 years ago and the film (and most likely the novel) are far superior to this film in every way.  It wouldn't be fair to compare this to such an obvious classic except for the fact that I keep hearing rumors of it being Oscar worthy.  The classic film, of course, has the iconic 'white savior' played by Gregory Peck, but the character is portrayed as a complex man of pure ethics grappling with the issues of his time in a way that isn't clueless about his actions and understands full well the danger he's placing himself and his family in when he decides to cross the hard coded color lines.  This Skeeter character is more concerned with advancing her career by being controversial than making real change.  In short this film is a Disnified version of 1960's race relations, pretty to look at and light on meaning.",
      "total_reactions": 1,
      "user": "skantea"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "My wife grew up in the south and wanted to see this movie.  Not excited to be there, I expected it to be melodramatic and unmoving.  The story is all too real even if the characters are fictional.  The acting is excellent.  It is the story of real courage in difficult times.  Even if as predictable as Titanic, it is well done and worth seeing.",
      "total_reactions": 1,
      "user": "retiredat56"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2012
      },
      "score": 0,
      "text": "The movie, had one big problem. It was boring! As I started watching the movie, I knew how it was going to end. There were no suprises, or twists. Just a boring story, with some characters who you should feel sorry for and some characters who you should feel angry against.",
      "total_reactions": 7,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2012
      },
      "score": 5,
      "text": "The actresses all had their own part to play in this sugar-coated brightly coloured drama, and I can certainly say for a fact that, for the time these people are living in, I thought it looked quite mawkish in terms of the good intentions of the few whites that helped the black servants. These actresses are incredibly talented, I'm not denying that, but that certainly does not dispute the fact that many of them had to act like they were probably living in a gingerbread house and wearing sweets, instead of living in normal houses surrounded by poverty and racism. Westernised? Yes. But fascinating? Of course. It's the interpretation that matters, but the people who made this film just didn't seem to get it quite right.",
      "total_reactions": 1,
      "user": "EssenceOfSugar"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2011
      },
      "score": 0,
      "text": "this movie's too hard to understand..... i think that a movie shoud have  Understandable Plot,Clear Motive, and  a movie should also be entertaining.i think this movie looked more likely a documentary than a movie.",
      "total_reactions": 7,
      "user": "nashville13"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Really good movie, great acting, really recommend it. In other news, I am pretty sure that in 40 years or less there will be a movie similar to this, maybe titled The Friends, but centred on gays. Humans never learn.",
      "total_reactions": 1,
      "user": "Soulshock"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2012
      },
      "score": 5,
      "text": "Amid much fanfare I reluctantly watched The Help. Unless it was a true story or based on such, the subject was uninteresting. Yet I gave this long film a shot. The idea of black women raising rich white children in the south, is not foreign even to those of us in the north. At one time we had such a person but more a helper not a parent substitute. The characters seemed stock and what happens is rote. Some performances were very good especially by Ms Davis, Ms Spencer, and Ms Chastain. There are no surprises here. It seems to have struck a chord with women but it could not sustain my interest for 2.5 hours. In summary, some strong performances, mildly interesting subject, but mundane and too long.",
      "total_reactions": 1,
      "user": "RobinsNest"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "The Help is just another racial movie about the past. when are we going to make movies that are different. yes there was some strong acting but i can't get over the fact it seems there are many of the chessy kinds of movies. time to grow up",
      "total_reactions": 5,
      "user": "csw12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 5,
      "text": "A sappy melodrama, that emphasizes far too much than the light tone of the dialogue and characters can handle. For one thing, it was too cute, too much of the emotional side of race, so much that it made me almost queasy. The acting is either at par or above par, depending on the character. Octavia Spencer is the light at the end of the tunnel; her vulgar,obstinate, and disdainful Minny has both comedy and drama thread into the character. Jessica Chastain is the lantern, with a cutesy and light-hearted role. That being said, Viola Davis, Emma Stone, and Bryce Dallas Howard are just a few matches. The film itself, is quite hard to see through sometimes.",
      "total_reactions": 1,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "I love this **** ****sjdjdjrfhffbggbvbfhfhvhfhfhfhfhfhdurjrrurururrurutytytydkapalsiekwaka",
      "total_reactions": 3,
      "user": "MissDrae"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2012
      },
      "score": 6,
      "text": "\"The Help\" has all the right ingredients: a moving story, excellent acting, serious drama, but also charming humour. Indeed, it manages to succeed on many fronts. While it surely does not bring anything new or revolutionary to the film world, it is a definite feel-good film, despite its thematic. This, however, is one of its main problems too. It manages to diminish the civil rights movement to the easy-breasy work of good-willed white people, while taking away all agency from the African Americans. Yes, it is their story that is told, but it is only told due to the willingness and enlightenment of the white saviour woman, played by Stone. Yes, I agree with what many people have already pointed out, which is the emotional reality and believability that the actresses got to portray. This is hard to take away from the performers, despite of the problems of the film. The excellent performances by Davis, Spencer, and Chastain were spellbinding. It was very nice to see so many good African American actresses do truly beautiful work and be recognised for it. Technically, the film is very good, but the issues are in the actual story, but that is also the problem of the book. As I said before, the film does not offer anything new, anything daring, challenging, nothing we haven't seen before. While potentially being the most charming film of the year (if one ignores the racial implications), it is definitely not the best one. Nonetheless, it is certainly a good film, with amazing performances that are worth watching, and a story that will warm one's heart or make one very critical of America's view on race and its racialised past (and present)!",
      "total_reactions": 0,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "The Help is a crowd pleasing bit of fluff that doesn't really dig dip into the true ugliness, pain and complexity of the race issue.  However, it still works thanks to the excellent performances by the entire cast.  Viola Davis, Bryce Dallas Howard and Jessica Chastain are especially good.  But say what you will about whether or not the film portrays the issue of race accurately and honestly, it still wins you over with its enormous heart.",
      "total_reactions": 0,
      "user": "BKM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "I'm only contributing because of the inane responses by some \"viewers.\" Too many people have already lauded this excellent movie for me to add much of substance. I was deeply disturbed by the movie and the inhumane manner in which so many whites treated their black employees. For the Nashville dude who wonders - \"this movie's too hard to understand,\" it's about racism buddy, u know the South. And for the other dude who says we know all this already, it needs to be repeated over and over - this is how Americans treated other Americans because of their skin color! A great movie.",
      "total_reactions": 0,
      "user": "movieboy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "Admirable effort but I'm not sure it lived up to all the hype. I'm a pushover for a tear jerker but was never moved to that point. The characters (both white and black) may have been authentic to the early sixties but having not lived through those time they felt sort of cartoonish and unbelievable to me. I hope for a day when stories of racial prejudice aren't entertaining because we can no longer relate to them.",
      "total_reactions": 0,
      "user": "gunnyart"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "While I have not read the book and was frankly a little scared I was walking into another Steel Magnolias (one of the worst movies ever made), I walked out surprisingly pleased and entertained with an enjoyable story, talented acting and characters worth caring about. Follow up discussion with those who have read the book, I learned it was pretty true to the book, but the parts that bothered me as a viewer, such as the lack of depth around Celia's past, a deeper understanding of Minnie's abusive marriage, etc. are all told in a more detailed way in the book.  However, those who have not read the book will still find this movie rich enough in story and an emotional connection to the characters to enjoy this film beginning-to-end.",
      "total_reactions": 0,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "A heartfelt and moving story with terrific performances which deservedly won the best ensemble award in the Screen Actors Guild awards.  The subject matter might be tough but the script is intelligently written and with good use of humour, so it does not feel heavy.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "A journalism graduate (Emma Stone) decides to write a book from the POV of black maids in her 60s Mississippi town. The story alternates between her upscale friends (who practice an embedded type of genteel racism) and the maids (who quietly suffer the indignities). The performances are all-around exceptional, but Viola Davis' subtle torment is a surefire award winner. The gorgeous period styling and assured direction also contribute to this Oscar magnet: a funny, warm and powerful cinematic classic.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "Having been a young man during the period the movie is set in, and having an ancestor who served as a major in Union Army during the Civil War; I was pleased to see this wonderfully acted movie dealing with the day to day struggles of good and honest people caught up in a racist discriminatory system that was an affront to all Americans, black and white. The movie paints a poignant and powerful picture of the evils that bigotry and racism create in even otherwise good people. The Help is deserving of a wide audience, and hopefully will receive Academy Award recognition. Certainly Ms. Octavia Spencer deserves to be recognized twice... once for her exceptional acting, and once for her culinary skills.",
      "total_reactions": 0,
      "user": "makrtik2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "Emma Stone plays Skeeter, a young women who writes a book about the lives of the black maids, who had been treated awfully, in order to help them by expressing their point of view threw the book. I haven't heard of '' The Help '', until a day before it was released, so I didn't had any intention to see it at first. I gave it a chance, and it was a wonderful movie. This might be nominated for best motion picture of the year. The story really captivated me, and you could feel anger for the white people who mistreated black people. That's just not right. Also, in some scenes, the humor was at the right time, which was hilarious. The movie is 145 minutes long (2 hours and 25 minutes), but the plot is so interesting, that you don't feel like it's never going to end. There was this funny scene when Minny Jackson (played by Octavia Spencer) totally owned Hilly Holbrook (played by Bryce Dallas Howard). You will find out when you will see it. Everybody did a great job in their performance. It's a surprisingly good movie, one of the best this year.",
      "total_reactions": 0,
      "user": "scrieciu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "Moving, realistic, funny, very well crafted, great story I loved, Viola, Spencer and Chestain spectacular, also the cast that made this movie was a charm.",
      "total_reactions": 0,
      "user": "wishmaster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "This was the most amazingly wonderful movie. I had been avoiding it because I thought it was going to be a depressing downer but I am now so glad that I went to see it.  We need to be reminded that there are everyday incredible heroes that are the reason that we slowly make this world a better place.  The acting was awesome, Octavia Spencer and Viola Davis were great as were Emma Stone and Bryce Dallas Howard. Direction was splendid.  This movie drew me in and kept me there.  Wonderful.",
      "total_reactions": 0,
      "user": "Bama72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "I wasn't sure what to expect going into this movie, I really didn't know anything about it other than it was called The Help, that Emma Stone was in it, and it had something to do with maids, and for some inexplicable reason I though it was going to be a comedy, don't ask me why I just thought it was going to be one, don't get me wrong it has it's funny moments but it's a drama first, and a really good one, honestly the movie is done in such good taste, it doesn't favor one side over another as it shows the good and bad things that both did (seriously the pie thing was pretty bad, funny but bad), it's sweet, funny, and emotional, with fantastic acting and writing you'll find yourself loving the characters with all of your heart, and I 100% believe that this movie should get a perfect 10/10 from me, it truly stands out among other movies as an exceptional experience, movies like this are rare, it shows you that something beautiful can come from an ugly experience, that love can come from hate, that we are all equal and deserved to be treated as such, and that if we are willing to open our hearts to one another and drop our hatred the world can be a much better place, and for that, for doing what few other movies want to do, I give it a 10, and recommend it to all, a must watch.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "The director Tate Taylor bet in simple stories in the design of the Crusades and that was his biggest hit, the film ended up making a decoy of both public as prizes, should appeal to all audiences, despite being a drama.",
      "total_reactions": 0,
      "user": "jimmytancredi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "I just walked away from this movie this afternoon thinking, \"wow.\" It's probably not historically accurate, but the story and the acting were powerful. What a wonderful cast. It was laugh out funny at times, made me cry once, and was a honest and heartbreaking view into the lives of people in the year and location (1960's in Mississippi) from their perspective. There are at least two actresses who deserve Oscar nominations from this movie, maybe more. I highly recommend this movie.",
      "total_reactions": 0,
      "user": "ksb"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "A contender for an Oscar as the best picture of the year.  Drama, comedy, heart-break, the ugliness of segregation, this film has it all.  Viola Davis gives an award winning performance.  A not to be missed film that will leave you with a lasting impression.",
      "total_reactions": 0,
      "user": "gfny"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "The Help is at once a joy to watch for its absorbing yet haunting story and for the superior acting by Viola Davis and Octavia Spencer.  On the other hand, it is nauseating at times to suffer through the scenes of outright cruelty perpetrated by the white women of the south in the early 1960s.  It is one thing to read about Jim Crow in a book or listen to an old person nowadays discussing what it was like, but to see reenactments of just how dehumanizing and vindictive the times were is just unsettling.  This is an important story, fictional yes, but representative of a time and a place which reminds the audience just how ashamed we should be at aspects of our past.",
      "total_reactions": 0,
      "user": "CitizenCharlie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "I loved this movie, I think it portrays a very important time, that wasn't so long ago. The cast is pitch perfect, and it is a well executed all around film.",
      "total_reactions": 0,
      "user": "cleverwabbit"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "Pleasant film.  Great work by Chastain, Spencer, and Spacek.  Viola Davis is fine and Emma Stone is a bit boring.  Adaption of the work for film is done well.  Technical aspects are good.",
      "total_reactions": 0,
      "user": "NJWolfgang"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "A powerful film......difficult to watch at times, but it all rings true and painful. The performances are all top-notch with Davis offering the most truthful one. This film is really nothing new, but it still makes for a good story and sends a good-hearted message. It was easily worth the price of a rental!",
      "total_reactions": 0,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "A great film that truly excelled in its simple 60's suburban-like story, great & believable acting and the   mood of the film which gets deeper and deeper as the movie goes by. A film that has the whole package.............",
      "total_reactions": 0,
      "user": "aaronpaul121"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "I enjoyed this movie although I never read the book I still went to go see it and I thought this movie was good it showed that emma stone can other movies that are not comedy over all it was great movie.",
      "total_reactions": 0,
      "user": "bigfre"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "Finally saw this movie the other day after it being in my theater for over 2 months. Everybody whose ever walked out of this movie is always pleased and tells me how great of a movie it was, and some even say its been their 4th or 5th time seeing it! I had the same reaction. I walked out of this movie very pleased indeed. It was veryy good, excellent performances all around from everybody in the film. Emma Stone is becoming a phenomenal actress. Don't shy away from the lenghty running time, you don't even realize you've been in the theater for 2.5 hours. It's the opposite of a movie that makes you give constant double takes at your phone, you will be engaged, interested, and you will fall deep into the story and the emotions of the characters. Fantastic movie based of a fantastic story. 9.5/10",
      "total_reactions": 0,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "The Help may be a little to long for some viewers but for the ones that stay emotionally invested in its interesting story line it more then pays off. The strongest performance by Emma Stone in her young career, thats not the shocking part; she is out shined by performances from Bryce Dallas Howard and Octavia Spencer. These actors in my mind are deadlocked as nominees for Supporting Actress of the year. This is my second pick for for motion picture of the year!",
      "total_reactions": 0,
      "user": "filmtrashreview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "A film that is well acted but it suffers from being cliched and already made in other films. Also the film is racist in it's potrayal of the whites in the 50s. overall a film that feels like it is lacking. It could be lacking in many areas but at the end when the credits are rolling one just feels that you watched a descent film that you will forget about as soon as you walk out of the theatre.",
      "total_reactions": 0,
      "user": "cabrita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "The Help is a racially themed film that's probably a bit too pretty and crowd pleasing. Getting down to the gritty meat of the matter would have been a far more effective way of telling this story, rather than the fluffy-comedic style we get; sprinkled with instances of tears and drama. Despite this, its light tone made it quite entertaining and the instances of drama were natural and fluid. Its colourful cast shines, particularly Dallas Howard, Davis and (the adorable) Jessica Chastain. And the colourful character-serving costume designs shine as well. Comparing this flick to the Blind Side is an insult. Despite its light material, it dealt with the racial matter with a bit more depth rather than the blatant charity root (taken by the Blind side). This is an okay movie with a lot of personality but it could use a bit more heft.",
      "total_reactions": 0,
      "user": "lahaine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "Sweet, momentous, and sometimes pretentious, this film has almost nothing wrong with it. It's like that sweet homemade dish that isn't your favorite, but when you look back on it, it has nothing wrong with it at all. Exceptional acting, deserving awards in every corner of the cast, emotion, drive, importance, and some spices of tears and some spices of comedy. it's one of those special movies that will definitely make you laugh, and definitely make you cry. Most importantly, though, it will definitely make you care. And that's what this film succeeds in doing. It puts you in the shoes of Skeeter and makes you feel painfully for the undermined and underprivileged blacks in 1960 Jackson, Mississippi. Definitely a keeper.",
      "total_reactions": 0,
      "user": "MovieMachine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "It let me down how much this movie pales in comparison to book, not that it doesn't happen often but in this particular case this is so blatantly true, since most of the emotional and clever pieces were left aside.  Still I have to bow down before Viola Davis, whose performance is supreme.",
      "total_reactions": 0,
      "user": "Belmsher"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "As a Jacksonian, I wondered if the movie would remotely compare to the novel. I was extremely pleased to find an incredible cast who was obviously passionate about the project. The accents were spot-on instead of the usual Hollywood mangled twang that might as well be nails on a chalkboard to a Southerner. The historical accuracy is extremely well-done and I felt right at home in the setting - I should since I live in the neighborhood in which the story takes place! I Each actress brought her character to amazing life and I haven't seen such performances since a classic like Steel Magnolias. If you don't shed a tear or two amidst your laughter, then have your emotional machinery checked. Brava, ladies - you did an incredible job!",
      "total_reactions": 0,
      "user": "mosby76"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "I just watched to movie this afternoon with a friend that had also read the book.  We were both in high school during the early 60ths, but in CA.  This movie and its content was so impressive.  The theater goes applauded at the end.  It deviates from the book only by not giving so much detail, but the message is there beautifully.",
      "total_reactions": 0,
      "user": "Redhead"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "Though it doesn't go deep on its polemic themes to makes this story a shocking, intense one, \"The Help\" stars an amazing ensemble cast whose charismatic performances are enough to glow even the toughest-heart.",
      "total_reactions": 0,
      "user": "Potter17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "This is so far the best movie of the year. This film has the best cast of any film since \"Inception\". Viola Davis, of course, stands out as the best, but so does her best friend, Minnie, played by Octavia Spencer. While people focus on these two, there are many others who are ignored. Allison Janney delivers her trademark comedic but stern performance, Cicely Tyson is great but short, Jessica Chastain gives the best dumb blonde ever, and Bryce Dallas Howard is wicked and shocking. But Emma Stone gives the second best performance of the movie, who is like a pre-tabloid Lindsay Lohan mixed with Julia Roberts. Her wits, charm, and dialogue are what makes her a beacon in a dark movie. Besides the cast, the writing, art direction, cinematography, costumes, and makeup are highlights. I also loved the ending song, which should be nominated for an Oscar. Possibly the best drama film I've seen. Period.",
      "total_reactions": 0,
      "user": "buellerbueller"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "This movie was simply GREAT!  My grandmothers, aunts, and mother all did housework for whites in the South during this period.  This film really showed me how degrading this work could be, literally a step up from slavery.  No one ever viewed it from their perspective.  It was a tearjerker, but still funny.  It was excellently paced and superbly acted.  If you can't get out of your own life for 1.5 hours, and appreciate another's struggles and victories then this is not the film for you.  Those people who sell this movie short really disappoint me, because I have seen many, many movies and consider myself to have \"high brow\" tastes, but was so pleasantly surprised by the quality of this movie.  This is literally the best movie out there right now, especially if you are tired of Hollywood summer blockbusters (I know that I sure am).",
      "total_reactions": 0,
      "user": "Drussmd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "I remember the \"help\" when I was a boy in PA. They were the most important individuals back then, because the raised us. We foolishly looked down on then and teased them, but we knew they loved us. This movie is their story. It's low keyed but passionate.",
      "total_reactions": 0,
      "user": "Allessio77"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "To me this is one of those movies that is just off of being really good, but it is just missing a few little pieces that would make it special. It was still an enjoyable couple of hours considering the other movies in local theatres right now.",
      "total_reactions": 0,
      "user": "TindleBay14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "I absolutely loved this movie, i thought it was a really emotional, at times heart breaking, it was funny and exceptionally acted! This movie is brilliant throughout although maybe a little slow theres enough humour to keep you interested!Its a powerful story about a white woman clearly influenced by her own experiences with The Help that she decides to write a story, or a true account of collections straight from The Helps mouths!It truly is a fantastic movie it is brilliant and i loved every minute of it !",
      "total_reactions": 0,
      "user": "rafael14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "Rent-it - This racially hyper film about some extraordinary women in Mississippi during the 1960s is carried by its talented cast who make it a touching and satisfactory drama.",
      "total_reactions": 0,
      "user": "RyanPratt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "This was a beautifully filmed period drama that will be nominated, but won't win, for the Best Picture Oscar.  The acting category, on the other hand, is a different story.  Viola Davis gives the performance of a lifetime, and she deserves to win an Oscar.  Emma Stone, Jessica Chastain, and Bryce Dallas Howard also give very strong performances in this slightly tedious and lengthy film.  A bit of trimming would have helped the pace tremendously.",
      "total_reactions": 0,
      "user": "CincinnatiDave"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "It wasn't as \"amazing\" as I was told but I did enjoy it! I didn't care for the ending.  I need closure when watching a movie and you definitely don't get that.  The acting was great.",
      "total_reactions": 0,
      "user": "Hallie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "I cannot understand who doesn't love this movie ! It was amazing. That's literally the only work to describe it. Great adaptation from the book, and the actresses didn't disappoint at all! Funny, charming, sad, rage inducing, hilarious, and moments that make tear up, it's the perfect movie about racism in the south. Truly amazing. I'm not a crier, but i bawled at the ending. LOVED it. LOVELOVELOVE.",
      "total_reactions": 0,
      "user": "jillmacintyre"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "Yes, it is a little cheesy and sappy at times with some dodgy southern accents and some unexplained plot-points, but nevertheless, The Help is a great film adaptation that is realistic and has committed performances from its cast members, especially Viola Davis, Bryce Dallas Howard and Jessica Chastain.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "Surely, this will be among the bests for this year and of the decade. Great acting from the cast--perfect ensemble. Great story, great screenplay. Looks like this will be one of the front-runners in the 2012 Oscars.",
      "total_reactions": 0,
      "user": "aozeta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "\"The Help\" is quite extraordinary in how it deals with delicate issues like race relations in the 1950's. The acting is just about near perfect with standouts including maids Viola Davis, Octavia Spencer and the town racist Bryce Dallas Howard. The musical score is delightful and the costumes stay true to the decade in question. The dialog can be somewhat corny at times but one minor blemish(s) on an otherwise perfect film is fantastic. I had high expectations before I saw this feature but the final outcome has blown me away.",
      "total_reactions": 0,
      "user": "eTurkey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "While its subject is the division that changed an era way back in the sixties, 'The Help' manages to offer a safe and optimistic tale out of a difficult and testing time in American history. The film has centred itself around the African-American maids predominantly working in Jackson, Mississippi as they carefully detail their day to day lives working for the white women of the town, they do so through the energetic and openness of Skeeter Phelan (Emma Stone), who sets out to write a book anonymously to highlight the situations these women endure. This is a definitely a safe film, and while does tend to only touch on some of the ugly and chaotic times of the era, it also seems like this was intentional, instead offering the good that can come out a situation such as this, it is willing to show great emotion while also keeping themes arms length, it delves and paddles its feet slightly on racial abuse but never plunges too deep. Skeeter sets her sights on two maids to begin her book, her backstory showing that she has difficulty fitting into the society she once lived in, these two maids are Aibileen Clark (Viola Davis) and Minny Jackson (Octavia Spencer). As wonderful an actress as Emma Stone is, the film belongs to these tow characters, they could have easily won out the entire show on their own.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Yesterday, I had a 3 hour break in-between classes, and a free movie on my AMC Stubbs card, so I went to the movies. Unbelievably the only thing playing at my time was one of the movies I didn't want to see, The Help. Isn't it funny how the movie you never want to see always turns out to be great? The Help is based on a book by the same title, and follows a young writer, in the mid 1960s, looking for an idea. At a party, she notices how horrible people are to the African American help and decides to write their story. Of course it's a scandalous idea that can get them all killed, but Skeeter finds one woman brave enough to tell her story. This movie is funny, heartwarming, and inspirational, not to mention the acting is top notch. Viola Davis deserves an Oscar nomination for her performance, which is one of the strongest I've seen all year. The Help is an amazing story, with a terrific cast, and a big upside. It has a unique and inspiring story that takes us back to a very tumultuous time in American History, and I can't recommend it enough!",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "A little too long. Fair editing and screenplay. Doesnt have new things to say. And a bad finale. Gets its power from three actresses (Spencer, Chastain, Davis).",
      "total_reactions": 0,
      "user": "cosmic_shame"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "This movie was so enjoyable. From the rich characters (both good and evil), the writing and pretty sets and costumes. This story could have easily devolved into sappy schlock, but I think for the most part it felt genuine. Of all the female centered stories of the South, this is one of the better movies to have come along in a long time.",
      "total_reactions": 0,
      "user": "katharineclark"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "This four Oscar-nominated film has finally set ashore here in the theater and is destined to be a gratifying crowd-pleaser. It is a resourceful reference to the color discrimination period almost 50 years ago in USA. The film is able to find its resonance elsewhere in the world painlessly, even for a Chinese like myself, discrimination is commonplace among human societies, and we can all empathize with the characters and enjoy the theatrical conflict with some well-infilled satisfaction after a lengthy 150 minutes. From director/writer Tate Taylor (who has a supporting role in another Oscar-favorite WINTER'S BONE 2010), THE HELP interweaves a lively portrait of the bitterness and felicity of the lives of black helps, through a young white girl's intervention to harness their stories as the source materials for her book. Maybe one can argue that all the twist-and-turn is too hoary for the audience in the 21st century, but propped by an all-out effort from a superb cast, the film miraculously enjoyable and the epiphany comes with a perfect tempo, arguably a supporting role, Viola Davis demos a tenacious mojo on screen and her emotional flare-up is wondrous to watch, Octavia, Bryce, Jessica are among the elites of the nearly all-female supporting groups (Viola and Octavia is my current win in the leading and supporting actress respectively), and old hands like Allison, Sissy, Cicely and Mary also showcase their meticulous scene-stealer dexterity. All these accompaniments has induced that Emma Stoneâ",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "Amazing film with a very talented cast. It deserves all the nomination it has and the awards it has won. By far, the best movie of 2011 I've seen. A must-watch.",
      "total_reactions": 0,
      "user": "KleineSean"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "I'm 14 years old, I'm the only one of my friends that appreciate this kind of movie. But when I saw this film with my friends at the cinema, everyone was in love. We thought that was meaningful and talks about a good argument, it was funny, interesting and dramatic at the same time. And it wasn't slow or heavy. But I think that the film can't have a Oscar for Best Movie. Maybe for best actress or/and for best supporting actress. I enjoyed this film so much, I liked all the actors. Even the \"villains\". Howard's character was detestable but her interpretation was brilliant. Also the drama of Viola Davis and the comedy of Octavia Spencer was amazing. The only thing that I think was not so clever was the cake thing, but it didn't change anything in my opinion.",
      "total_reactions": 0,
      "user": "Roadie_42"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "OUTSTANDING, indeed it is. I am really not a fan of books taken into the silver screen but this sure got me really interested getting my own copy, the story of jews and black slavery of course will always be a sure hit and stories such as these will just have to have a different dress to wear and this one got the best gown indeed, formula: experience~ but of course will never fail you, the concept of real narration from the maids made it so warm and heart breaking that their own experiences in each house hold will definitely pinch your heart as the story goes on, I did cry for like every sob story told and how depressing life could have been if I were in the position of those oppressed, everybody would be able to relate to this for each one of us may have experienced a situation when being you, yourself ~seems to be a big problem for you to run a smooth life. I appreciated the humor and positivity that the black people have, they were in fact a shot of life, a breathe of fresh air with all those white trashy principles of \"perfection\" that bombard them, the blacks in this picture were framed beautifully that I saw how special and unique their personalities are, happy, creative persevering and name it, they are unsung heroes of the white's earlier generations. Inequality has always been a constant burn in the universe, the favored and the unfavored, the lucky and the unfortunate, realistic as it sounds that the world is a struggle of the opposites well life will definitely move forward and hopefully soon, all the colors of life from the darkest shade to the lightest will blend to when all is well.",
      "total_reactions": 0,
      "user": "PRANSESA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "This film is impressive, it always atracted my atention, was brilliant the way of give the side of the maids at that time, hilarious performance by Octavia Spencer, she earned those awards. A film highly recommended",
      "total_reactions": 0,
      "user": "GabrielaRodB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "Absolutely amazing!",
      "total_reactions": 0,
      "user": "ScarTissue1990"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "The Help is a gift. A truly special gift of filmmaking. It's the perfection adaptation of an already perfect novel. Tate Taylor along with his starry ensemble of characters make for one of the very best films of the year. Only issue here is that Viola Davis missed out on the Oscar win.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "The big surprise was that this movie was a lot more than what the trailers were offering. It is a movie with a lot of heart and fantastic acting. The pacing feels perfect and the emotion comes out so naturally, nothing ever feels forced. The humor is well balanced with the more heavier scenes. It is just a perfect film.",
      "total_reactions": 0,
      "user": "AwesomeReviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "A well executed story. The directing added nothing exciting to this film, but the wonderfully entertaining characters stole the show. It was sincere in its storytelling. It was serious when it needed to be serious and funny when it needed to be funny. This movie did not need any help capturing the hearts of many.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "This film is really good, great performances from a brilliant cast, every part is really well played, the story well written and with real heart and emotionality.  Octavia won the Oscar for best supporting actress and is brilliant in it, however, it's Viola Davis's acting performance that really stands out, she is excellent in this movie and i'm stunned she didn't get more recognition.",
      "total_reactions": 0,
      "user": "mrjeffsir"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "I shall speak the truth about films that desrve more than what they are given. Like Zack Snyder's latest live-action flick \"Sucker Punch\", \"The Help\" deserves more recognition and admiration as it is an incredible experience for movie-goers. It really warmed my heart, made me laugh, made me frustrated at some points because of racism, made me feel what those women felt and films like this are the ones that are lost in flavor and essence in the present, but are missed in the future. This is such an extraordinary work of art. Definetly, deserves a ten and if there would be an 11, I surely would've given it that!",
      "total_reactions": 0,
      "user": "jetpackulley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "The Help is a truly fantastic film that displays every ounce of movie magic one would hope from a film. While not as challenging of its racial elements as it should be and built on the trope of an educated white person helping minorities, The Help rises above these conventions with a truly heartfelt and triumphant story. Even more, the acting lifts the film into a different stratosphere. Led by Viola Davis, Octavia Spencer, Emma Stone, and Jessica Chastain, The Help is a real showcase for its actors who all steal the show in their own ways. Additionally, the film is really well paced. For a film that is two and a half hours, it never slacked and had no filler. Instead, it is a well cut and well paced film that never really slowed down, instead providing entertainment for the entire runtime. Overall, The Help is a very good film about its stated subject and shedding light on the lives of these women who raised white children in the south for so long.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "I love this movie , The pie was really funny all the actors and actress they did a great job and this movie look's like another sissy spacek movie The Long Walk Home 1990.",
      "total_reactions": 0,
      "user": "barnet42"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "[The Help] is, in some ways, crude and obvious, but it opens up a broad new swath of experience on the screen, and parts of it are so moving and well acted that any objections to what's second-rate seem to matter less as the movie goes on.",
      "total_reactions": 0,
      "user": "Dollis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "The Help isn't the best film ever made. It doesn't pretend to be. For what it is, The Help, for me, is a great movie if you are willing to sit for an hour and half and marvel at the performances. It's supposed to be feel old, and while it may seem predictable- it is actually a very emotional movie that made me tear up. Nominated for an Oscar (and having seen Viola Davis act) It it was one of the best movies of the year.",
      "total_reactions": 0,
      "user": "JawsLaxerDrama"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "Seriously, a great film! The story is touching, emotional, powerful, but also humorous at times which is not always an easy combination to fulfill. Besides the powerful story, the absolute best thing about the film is the acting. Great performances all around. Emma stone is fabulous; she has one moment in particular that cuts you right to the heart (for those who have seen it, you know what I'm talking about). Viola Davis shines as the lead maid and Octavia Spencer is equally as brilliant. One performance that isn't getting as much attention is Allison Janney. She's absolutely stunning and I don't think the film would be as good without her. The performance for me though is by Jessica Chastain...a truly fascinating character fueled by a masterful performance. I really really hope she wins the Oscar for Best Supporting Actress; it looks like the award will likely go to her co-star, but Chastain is as deserving! She made this film for me and I can't wait to see her future work. The Help is a must see film! A wonderful story fueled by beautiful performances. Nominated for 4 Academy Awards including Best Picture!",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "Very inspiring and entertaining movie. It was funny and sad at some parts. I would recommend this to anyone. Emma Stone and Jessica Chastain's performances were flawless. But all the performances were good. Extremely recommended to anyone.",
      "total_reactions": 0,
      "user": "mds03"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "i absolutely loved this movie  awesome story  awesome picture and it gives you kinda of a peaceful feeling while watching this movie  emma stone done a spectacular job  i can't think of one thing negative about this movie.",
      "total_reactions": 0,
      "user": "ExKing"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "To see a film that was hilarious as well as touching was definitely what I felt was a successful film. Under James Cameron's Titanic, this is my favorite drama.",
      "total_reactions": 0,
      "user": "sil3nt_nick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "The Help is one of the most gripping movies I have seen in a long time, once you start watching you virtually can't move. This is a example of a successful movie that will always continue to keep to clued to the screen. Never have I watched a movie where you cry and laugh at the same time. A must watch for everyone, you will not be disappointed!",
      "total_reactions": 0,
      "user": "busbfran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "The Help is an interesting movie, that truly shows us how the US was in the 60s and I really liked it!",
      "total_reactions": 0,
      "user": "TheApplegnome"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "The Help is one of those movies that captures the era of civil rights very accurately, except it's told through the maids and butlers and \"the house help\". It is very funny at times when it's appropriate, and dramatic and sad when it needs to be. To watch this film, just flip through your movie channels on TV, because it's one of those good movies that's always on.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "Irresistibly likeable and incredibly heart-warming - The Help not only boasts brilliant performances, but has a consistently sweet and funny tone which adds to the films already warm premise.",
      "total_reactions": 0,
      "user": "sammurphy66"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2016
      },
      "score": 8,
      "text": "An ambitious piece of fiction with heart, soul and a lot of heart.  This film doesn't browbeat the audience with the message of race against race but still maintains the hardships of the time and fills one with a sense of what it might have been like to live in a World where prejudice and racism was more open than it is now.",
      "total_reactions": 0,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "what a good movie about  someone who helps this maid through segregation  in the 50\"s . Good Movie . grade A+ ..................................................................",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "The Help es una película que te atrapa con su buena historia, y no solo por eso, si no también por lo muy bien que está dirigida esa historia, a parte de las buenas actuaciones.",
      "total_reactions": 0,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "The performances were really good and the movie is true to what happened in this time.But,the movie is not entertaining and seems really long.Certainly not a bad movie but,it's certainly not a good movie.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "Una película hermosa, que muestra la realidad de Estados Unidos en esa época, con actuaciones maravillosas, una historia hecha para hacerte llorar, una de las mejores películas que he visto.",
      "total_reactions": 0,
      "user": "elsylorena"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "Excelente película, tiene un reparto de soló mujeres de primera. Las actuaciones de Viola, Octavia, Sissy, Bryce Dallas, Jessica y Emma son bien logradas. El desarrollo de la historia fue muy bien logrado. El desarrollo de los personajes excelente. El final fue lo más triste de la cinta (por la historia).",
      "total_reactions": 0,
      "user": "JosMi1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "so emma stone is killed by the goblin why is she here? is it because a woman writer doesn't make sense.....??  but seriously I love how the starts as a fourth wall breach framing device with her looking into the camera as such... I feel compelled to skip ahead. ..but i finally get tot see what ambrosia is....weird how i thought that the first maid might strangle her with the cord...no?  wait is that Bryce dalla howard....and shes  talking to gwen stacey from the new spider man but she was the previous gwen stacey....?is this a ritual or something....race disputes are always a cover up so im done on this movie.....its time to move on emma stone....and die in the clock tower. ..because the hotter gwen stacey's ass would blind us all for years....when hers isn't even a year",
      "total_reactions": 0,
      "user": "CameraBounceGod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "I thought this movie was really good. It had a good story and it was different over the fact that a white female during the time period wanted to write a book about the lives of African American women during the time period.",
      "total_reactions": 0,
      "user": "smtaufiq"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2016
      },
      "score": 9,
      "text": "The Help has great scenes and strong performances from all the cast that contribute to the film success. Add to that the film touching subject about U.S dark past. Overall, a great film.",
      "total_reactions": 0,
      "user": "geo333"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2015
      },
      "score": 10,
      "text": "How can I characterise this film? It is truthful and unique,sorrowful and  making me laugh-out-loud, bright and very kind. I'm talking about \"The Help\" directed and adapted by Tate Taylor from Kathryn Stockett's novel of the same name. And I want to share my emotions with you about this film, because for me it is the magnificent example of the opposition between rich, beautiful and putrid inside American people of the upper class from the one side, and from the other - generous, wise, miserable African Americans with a big hearts.",
      "total_reactions": 0,
      "user": "Samarushka"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "A great story and a wonderful cast combine to make this drama a must-see.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2016
      },
      "score": 10,
      "text": "\"The help\" let me thinking about many interesting things when it ended, it was something really well-done from the beginning to the end with a very good structure, amazing performances, appropriate settings and an artistic vision about life during that era dealing with a very controversial topic and playing with dynamic and contrasting characters, I can see passion in this movie, It really shows in a certain way the reality in that time but always justice.",
      "total_reactions": 0,
      "user": "David05"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2016
      },
      "score": 6,
      "text": "One genre of film that begs comparison to its predecessors is the Southern Fried Roman à clef. Unlike most serialized fictional film fare, this genre is tied inextricably to the history of The South, which for bad or good, will always be a topic of debate. The cinematic adaptation of the best-selling novel The Help places it smack dab in the middle - pardon my patois - of the struggle for Civil Rights and in the company of other luminary films such as To Kill A Mockingbird and Fried Green Tomatoes.",
      "total_reactions": 0,
      "user": "Cinemaphile"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2016
      },
      "score": 10,
      "text": "The movie The Help was released August 10, 2011, a mere two years after the book written by Kathryn Stockett was released, and took society by storm. Its thought-provoking plot drew the viewers in and attacked their thoughts with the social issues of the 1960s. With its superb and undeniably fantastic characterization, an inspiring and thought provoking plot, and “down home” roots of the South, The Help touches all types of movie lovers.",
      "total_reactions": 0,
      "user": "rhoul"
    }
  ]
}