{
  "mc_avg_user_score": 6.1,
  "mc_metascore": 63,
  "mc_mixed_rating_frequency": 49,
  "mc_movie_name": "The Last Exorcism",
  "mc_negative_rating_frequency": 34,
  "mc_positive_rating_frequency": 82,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "I went in to this movie hoping for a cheesy, poorly acted movie I could really tear to pieces. What I got instead was a surprisingly good, genuinely creepy film. The Last Exorcism really got to me with it's ambiguity as to whether the supernatural were involved in the events, or if it was just a bunch of superstitious swamp dwellers refusing to break from their faith. The ending was abrupt, which at first I found irritating and unfufilling, but thinking back, I think it adds to the ambiguity present throughout the movie.",
      "total_reactions": 2,
      "user": "WombatCannon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2012
      },
      "score": 3,
      "text": "Why is it that every movie trying to be a mockumentary thinks editing between 2 or 3 shots is possible with just one camera? Not to mention that the person filming feels compelled to stay focused on the scene regardless of their own safety. Pretty silly stuff and takes me right out of the action.",
      "total_reactions": 2,
      "user": "XerSMMack"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "There's definitely some screams in this film. It starts off like a dull, documentary and then it turns into a fright fest. The film is filmed by one camera man who can be heard in the film to give it the effect of it being a documentary. You are tricked into thinking that the movie won't be scary at all but things change dramatically leaving you shaking in your seat. My boyfriend and I seen this film and even he was jumping with fright so don't get into a false sense of security like I did. If you prepare yourself for this movie then you might not get too much of a shock when people actually die in it.",
      "total_reactions": 1,
      "user": "Jems"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "Though this film starts off slow, the character development is really very good and the ending is well worth the film, as you don't really know whether this girl is possessed or not, it makes you think and when the ending does come around, you will be happy with what it gives you as looking back the ending makes a lot of sense.",
      "total_reactions": 1,
      "user": "yetifarmer09"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Very very smart and original.  And fun.  And creepy.  The first horror movie I've ever seen where I actually believed the main characters' behavior.  And when we thought about it later,  more and more pieces fit together. We loved it.",
      "total_reactions": 1,
      "user": "joan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "I didn't have much high expectations for the film, maybe expecting a \"Paranormal Activity\"+devil spoof. After a realistically shocking 87 minutes, I knew from the bottom of the heart that I was wrong.",
      "total_reactions": 3,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "The first 45 minutes of this movie mess is nothing but talk.  Audiences, especially teens, expecting to be scared or shocked will be so restless by the time anything happens they'll probably storm the box office demanding their money back.  When the action moves to anything the least bit interesting, it is so staged as to be laughable.  Paid critics everywhere have become so full of their self-importance they've forgotten how to criticize a movie for it's worth.  This movie is a waste of good film stock.  I don't get today's critics.  They feel it necessary to tear apart a worthwhile movie while letting clap-trap like this one slip by.  Common sense will tell anyone with any intelligence to head for the exit post haste!  I did not find one frame of this film interesting or believable.",
      "total_reactions": 4,
      "user": "TheUnpaidCritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2010
      },
      "score": 3,
      "text": "The professional critics truly missed the boat on this one. I was under the impression that it would be part Blair Witch, part Paranormal Activity, but a more intelligent version of both.  Hardly.  It's definitely creepy at times, but the rural house thing was done MUCH better in Texas Chainsaw, and the possessed girl was done better in hundreds of other movies.  The finale feels absolutely tacked on.  Preposterous, silly, and just not scary in the least.  I actually got a little annoyed when I got to the theater and saw the film is rated PG-13.  Seriously??  How can a first-rate, non-Hitchcock horror film be rated PG-13?  I guess the mutilation of animals, the birth of some mutant baby, and the eventual decapitation of a lead character aren't worthy of the \"mature themes\" moniker.  If that's so, how the hell do you then give Orgazmo an NC-17???  Be that as it may, this sucker is simply not worth the money.  Doesn't hold a candle to Paranormal Activity. Or Blair Witch.  Do not bother.",
      "total_reactions": 4,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "This is a very good movie.  It's a little slow in the beginning but this is done for character development more then anything. The plot of the movie isn't original- an innocent girl is suspected of being possessed in a Christian farming community- but it is the movie's ending that sets it apart. A must watch for horror fans.",
      "total_reactions": 2,
      "user": "Tyj"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "Better than I thought it would be. Better than most modern PG-13 horror wanna-bes. Maybe it's not the next \"Exorcist\", But it's without a doubt up there with the Cloverfields of the world.",
      "total_reactions": 2,
      "user": "tigerfan814"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "A character-driven thriller that will bore anybody who enjoys the current generation of slasher movies. Yes, if you can't wait for the next installment of Saw/Hostel/Rob Zombie's Whatever, you will probably dislike this movie intensely. If you're considering renting this once it comes out on video, you've been warned.",
      "total_reactions": 2,
      "user": "feardrinker"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2010
      },
      "score": 0,
      "text": "i cant believe i watched this fecal matter. I was somewhat entertained up until the ending which was more retarded than any movie I've seen. well i gotta keep putting in more characters so this wonderful review shows up.",
      "total_reactions": 2,
      "user": "Lrg"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2010
      },
      "score": 1,
      "text": "This is the worst horror movie i have ever watched i mean at the beginning it's building up suspense to whats ahead infact some bits at the beginning are rather funny but when it actually comes to the \"horror\" bit you realise that this is just an attempt to recreate paranormal activity/rec  the only times i jumped was because she jumps right at the screen and of course you are going to jump when the screens massive but if i was watching that at home i cn honestly say i wouldn't have moved of my seat. Okay the characters were believable but the acting at times was rather cheesy and what i would say the worst part of this is is the ending. I could actually tell where the story was going and it led to an attempt to recreate the blair witch project but failed. It was so rushed it was unbelievable and they could have done so much more but what they tried to do was recreate the girls predictions which was pointless as the ending made no sense in the fact that ALL the people were devil worshippers seriously give this one a miss it is the biggest load of crap i have seen in a while",
      "total_reactions": 5,
      "user": "cremeegg88"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "Watching this movie was a waste of my freaking time, I sit there, at the premiere right in phoenix, waiting to shat myself anytime during the movie, and what do I get, I expect a real dude who does exorcism in the movie, to actually be a exorcist, and not even 15 mins does he say that he doesn't even believe that it exist, that its all in your mind? What the hell? All it is is dry humor that I rather go watch the dreaded Lottery Ticket instead, at least it have some humor that wasn't as unhumored as this was, and after an hour into the movie, they already show you all the scary parts in the previews, seeming it to be good at all, this movie is a utter joke, nobody should ever see this. And on a extra note, what is up with the entirely disappointing ending? They even show the ending on the preview, and all the man does is walk up to the fire and the stupid chick dies, and then you see the chicks brother kill him? What a waste of time, please if you wan't to at least see something decent, go see Jennifer Anistons new movie, at least the ending won't be as bad.",
      "total_reactions": 2,
      "user": "Tsunastar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "As \"found films\" go, the horror sub-genre's \"Citizen Kane\", hands down, is not \"The Blair Witch Project\", the 1999 digital marketing sensation that first alerted Hollywood to the power of the Internet, while scaring technology-addled moviegoers with the power of suggestion, or last year's overrated \"Paranormal Activity\", an underwhelming digital video shocker of which its attempts to jolt you with disturbed baby powder and bed sheet blowings in a haunted suburban home, couldn't begin to compete with the classic black of the Maryland woods. (In this day and age of CGI effects, you could say that \"The Blair Witch Project\" reinvented the dark.) As found films go, though, nothing compares to the infamous \"Man Bites Dog\", the 1992 Belgian production about a serial killer and his complicit crew who shoot a documentary about killing, that undoubtedly inspired Daniel Myrick and Eduardo Sanchez to simulate reality by abstracting the cover art for the Spinal Tap album \"Smell the Glove\" in Rob Reiner's 1984 mockumentary \"This is Spinal Tap\". As found films go, however, \"The Last Exorcism\" differs in one important aspect; whereas \"The Blair Witch Project\" and \"Paranormal Activity\" went without an original score, this latest self-reflexive movie experience does. The seemingly improper utilization of music seemingly demythologizes the conceit that the doc-in-the-making was discovered at a presupposed crime scene, since a soundtrack breaks the reality of \"reality\". Like its aforementioned predecessors, \"The Last Exorcism\" ends with a death, a closed ending that really isn't closed at all, because such pseudo-amateur movies invite the moviegoer to imagine the document's journey from the police evidence room to the screen. The music creates in your mind an awareness of the post-production; a hypothetical person in the editing bay who, rather than preserve the integrity of the \"found footage\", made the creative decision to sensationalize death by commissioning a soundtrack, making what would become \"The Last Exorcism\" a more commercially viable property. What if that hypothetical person turned out to be the reverend himself? The last time we saw Cotton(Patrick Fabian), he was approaching the apocalyptic-looking bonfire with his cross, just before the producer and cameraman run for their lives. How do we know he died? We don't. In the film's final moments, the desperate fleeing of the overwhelmed crew finally ends when Caleb(Caleb Landry Jones) strikes Gerad(Tony Bentley) dead, so consequently, the farmer's son is first on the scene to recover the incriminating footage. Now why would Caleb implicate himself as an accessory and first-hand participant to these cultist murders by delivering the doc-in-the-making to the proper authorities? After all, we're watching the whole ordeal that went down in that small Louisiana town. Would Caleb really out his fellow satanic church parishioners, witnesses to the unholy birth of Nell's child, who could all be identified when Gerad pans across the crowd gathered in the field leading up to the platform where Nell lies prostrate with the kindly old, local preacher and his rotund wife. All these filmic ambiguities help invent a postscript that can be conjectured through what we learn about Cotton. Mainly, the man has no scruples. His agenda, the exposing of fundamentalist Christianity as a fraud, in which the son of a preacher man wants to come clean as a longtime charlatan, will come at a cost: his father's reputation. Secondly, the man is an \"entertainer\"(his wife's words) who didn't believe in demons. Ever the showman, for the sake of preserving character arc, the music that accompanies Nell's possession would reflect Cotton's previous skepticism about supernatural occurrences(the music bolsters the case for demonic possession at a time when the preacher wasn't a true believer in the devil, and most likely, God), and his natural-born instinct to manipulate an audience. Arguably, Cotton lives; he killed Caleb and desecrated the memory of the fallen film crew by dumbing down the \"documentary\" with subjectivity. Why? He has no health insurance.",
      "total_reactions": 1,
      "user": "Shiira"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2010
      },
      "score": 3,
      "text": "Extremely disappointing. The first forty five minutes of the movie are boring. I can handle alot of dialogue, but only if it is interesting. This, I am afraid, was not interesting. The movie is at its best when you are wondering whether or not the young girl is possessed, or just crazy. While there are truly creepy moments, they aren't creepy enough to warrant a positive review. The best scene is in the barn towards the end. The ending, however, absolutely ruined the movie completely for me. Absurd, ridiculous, and basically ruined the best part of the movie... the mystery of possession. I couldn't help but think a middle school student wrote the ending.",
      "total_reactions": 1,
      "user": "alexrobertsteac"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2010
      },
      "score": 4,
      "text": "It ALMOST hit the nail on the head.... but it didn't. It has potential for a decent horror film but it lacks... Horror!! The best parts are in the trailer, and the gory parts are for you to figure out. (PG-13) I give this movie a 4 just because of the girl. She did some good possession acting. But other then that, you're not missing much. There's something about this moc-doc that's just hard to believe, maybe it's because I'm watching it in a theatre and not discovery channel. Go rent the original Exorcist; it cost more money to make.",
      "total_reactions": 1,
      "user": "EMelo01"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2010
      },
      "score": 3,
      "text": "An interesting premise but the execution never quite works.  Ashley Bell, as Nell, is the best thing about the movie - and Caleb Landry Jones, as sibling Caleb is effectively creepy and threatening.  I can see where the filmmakers were going with this -- but disappointing payoffs fail to reward the patience of this audience member.  The Blair Witch Project did this first -- and did it MUCH better.  Still, this movie can be admired for working within an obviously meager budget.",
      "total_reactions": 1,
      "user": "LeapYearFilms"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2010
      },
      "score": 0,
      "text": "This was the worst movie I have ever been to! The best part of the whole experience was at the end...my sister yelled \" I paid for this\"? Everyone laughed and was in agreement. It was a waist of time and money!",
      "total_reactions": 1,
      "user": "TDE1975"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2010
      },
      "score": 0,
      "text": "This movie, is horrible. It's not even scary, it has a weak storyline, and its boring as hell. The ending sucked too, please... don't see this movie for Gods sake.",
      "total_reactions": 2,
      "user": "Seba"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "WHAT THE HELL was that ending all about and how come it had a soundtrack when it was a \"found\" video camera??? Right until the last 5 minutes i really enjoyed this film. It was a perfect mix of hocum horror and popcorn fodder humour. It was a ride..and then...just as it built up to a the time old suspenseful good v evil climax....again...what the hell? I looked around the faces of people in the cinema and to a man they all looked totally bemused. I still am.",
      "total_reactions": 1,
      "user": "trilby"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "OK thriller.  Took too long to get into the action of the main plot line...but once there it was very good (unfortunately that lasted only ~30 minutes).  The ending was a major disappointment.   Not going to spoil it here.",
      "total_reactions": 1,
      "user": "shooter17"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "Slightly disappointed in the lack of genuine scares, but it's a creepy enough addition to the genre, with solid performances, great music and a strange off-beat humour (a warning though - avoid if you are an immature teenager with no respect for others and lack patience to enjoy a gore-free, old-fashioned horror movie!)",
      "total_reactions": 1,
      "user": "grindhouse83"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2010
      },
      "score": 4,
      "text": "The Last Exorcism starts out with an interesting premise, but falls apart as yet another poorly rehashed mash up of The Exorcist (1973) and Rosemary's Baby (1968).",
      "total_reactions": 1,
      "user": "JustinSmith"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2010
      },
      "score": 2,
      "text": "\"The Last Exorcism fails to deliver what it is supposed , a good old fashion horror film , i felt like i was watching the Blair Witch Project , but on some levels the film manages to thrill you but not much , The whole movie falls apart after the 1st half\" .. D-",
      "total_reactions": 2,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2010
      },
      "score": 1,
      "text": "This is one of the worst movies of all time for my taste, at any time scared for a moment. The only interesting detail is to see the actual fraud are those who practice an \"exorcism\", which leads you to believe nothing of what you see.",
      "total_reactions": 1,
      "user": "Eliut"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 1,
      "text": "This movie is so stupid-i made really dumb movies look awesome, this movie does not function correctly to be a successful horror movie. I would rather scrape my eyeballs with a spoon than watch this movie. READERS BEWARE: YOUR IN FOR A CRAPPY MOVIE",
      "total_reactions": 4,
      "user": "RyanLopez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "This film will disappoint many because of the way it was advertised. It was promoted as a horror movie, but it is a bit more than that. It's a good mockumentary that manages to tell a compelling human story, while also having enough scary moments to satisfy people that aren't 15 years old expecting the 21st century version of The Exorcist.",
      "total_reactions": 0,
      "user": "terrence0258"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "This was a very scary movie with a disappointing ending. I was terrified watching through the hand held camera through many of the scenes but the movie just ended abruptly. The last few minutes of the movie were just silly in my opinion. One critic on here said it right\" this movie could have been great\". I enjoyed most of it but was in shock when the credits rolled...",
      "total_reactions": 0,
      "user": "pagepirate"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "Sometimes scary, many times just plain blah...a little slow, but at times it was even funny...but what did totally make it horrible?? THE ENDING WAS TOTAL C&$P!!!!",
      "total_reactions": 0,
      "user": "gegenski"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "very good acting creepy and dark parts the ending could have been a lot better. the end could of been so better they could have done a little more with nell at the end insted of the satanic group",
      "total_reactions": 0,
      "user": "elmstreet10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2010
      },
      "score": 5,
      "text": "It was a good movie til the ending. First and second acts were very well done, but all that great build up falls beyond flat in the final act. The characters work, the scenery works brilliantly, the plot works more or less, but all that is useless in the end. I am horrified at the critics. How did this get such good reviews?",
      "total_reactions": 0,
      "user": "TheSkaAssassin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2010
      },
      "score": 5,
      "text": "The film fed on the idea that the mind and people around a subject can cause the belief that one is possessed. It also leaves you wondering whether the victim in this case is one of these cases or an actual case of possession. It walks a fine line of religious doubt that is both engaging and suspenseful. Unfortunately, it takes its excellent premise and decides to destroy it in the last ten minutes of the movie. Extremely disappointing ending to an otherwise engaging film. I don't recall the last time a movie so destroyed itself in so little time as this one.",
      "total_reactions": 0,
      "user": "jaxmanjoe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "Really good movie. Shot in the style of 'mockumentary', it follows a preacher who has come to realize that God isn't really.... all that real. He wants to show exorcists for the charlatan's that they are, and sets about doing so with a camera crew following him. The movie is very slick, smart, and scary. You will leave scared. I don't know the last time I left a movie like this genuinely scared, and checking over my shoulder.",
      "total_reactions": 0,
      "user": "mattlimes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2010
      },
      "score": 8,
      "text": "From the trailer, it seems as though it's one of those horror flicks that keep giving you a dose of horror every second from start to finish. Wasn't I wrong. The film is basically a documentary in which a renound reverend is visiting a small family in Ivanwood, Louisiana. Before you walk out of the theater, give the movie 20 minutes, it slowly becomes more entertaining. When visiting, he tries to force a demon out of her by performing an excorcism. Simple right? So after, the reverend leaves and that seems to be the end of it. But the exorcism didn't go as planned, especially with the reverend's exorcism expertise. A simple but entertaining plots and events start to unfold, which turns this movie directed by Eli Roth into an unusual but unique horror film. It might dissapoint some fans looking for true CGI demonic horror which can look fake at times, but definitely a movie that hinders classic and raw horror that should give some people a jump or two.",
      "total_reactions": 0,
      "user": "Film_Fanatic_15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "The POV mock-documentary style horror has become something of a favorite of mine. I've never quite understood the denouncement of these films simply because they aren't real. Movies are about suspending reality and this style is no different. I remember watching The Blair Witch Project for the first time. I was absolutely convinced that it actually happened. That made the film 100x more enjoyable. While nowhere near as thrilling as Blair Witch or Paranormal Activity, The Last Exorcism is a worthy successor in the genre.",
      "total_reactions": 0,
      "user": "sailoraide"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "This film is very smart in the I-Phone kinda way. It is very progressive, addresses many different views about how people see the Christian church, and scares you in the process. If you're looking to see a horror film look somewhere else. If you want to see a good movie watch this!",
      "total_reactions": 0,
      "user": "jjnoahjames"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "Hm, ok, nice one, but pretty predictable. Acting is not so great, and maybe that is the main flaw of the movie. Its fine paced movie, but ending is a bit disappointing...i cannot give less then 7 points just because i waited it for so long so i can  find  dozen of things that i like, even if it will look forced:(",
      "total_reactions": 0,
      "user": "aryanrule"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "I thought this documentary style horror was put together relatively well. Nice cast and location. I feel that certain parts could have gone a little more in depth, while other spots could have been shortened and cut out. Overall though I would watch the movie again, but not by myself...not because I thought it was scary or anything lol, only because I like to get other peoples' vibes on movies that have mixed reviews. I especially thought the ending was quite interesting.",
      "total_reactions": 0,
      "user": "schmidtface"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "Amazing performance by all those involved. The movie was hilarious at times, horrific at other times, and made you think about the debate between religion and science. This movie fits in one of my favorites now.",
      "total_reactions": 0,
      "user": "kingshahid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "The first hour of THE LAST EXORCISM was pretty good, it had it's creepy moments, but the end just ruined it. The ending could have been as good as the first hour of the film.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "This one prevented me from sleeping easy that night. Although it's not the best documentary-style horror movie we've come accustom to, it still had the same effect that the first Paranormal Activity had  me.",
      "total_reactions": 0,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2012
      },
      "score": 1,
      "text": "I had high hopes for this movie. The trailer made it look thrilling and scary. However, as soon as I started watching it, I was disappointed. This movie was a huge waste of time and money. I have to say that I am utterly disgusted that this joke of a movie made a higher score than The Rite. I would place this right below The Devil Inside. The ending was horribly cheesy and left me wondering what on earth just happened.",
      "total_reactions": 0,
      "user": "Britt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2012
      },
      "score": 6,
      "text": "Like many other films, The Last Exorcism has joined the storm of \"documentary\" style films. At first, to be honest, it seems rather annoying - the whole thing, not just the fact that is a documentary-style film. The acting looks forced, which is true throughout most of the film, since the actors are trying to look as if they are not acting. The notable exception is Ashley Bell, who plays the role of the possessed girl, which she does excellently! Nothing but words of praise for her. And, apparently, she did all the acrobatics with her body herself, no CGI -- she's a ballet dancer, hence extremely flexible (just an interesting fact!). Overall, the story is rather interesting, and when you think you've got it figured out, it shifts and completely changes your perspective. As I said before, at first it seems predictable and boring, but the film builds very nicely and is actually a rather interesting, intelligent horror. It does leave the audience with a ton of questions, which might be intentional, but one cannot be really sure. It has lots of thrills, though, they are not properly dispersed throughout the whole film, but are built one onto another throughout the film. While that may not provide entertainment non-stop, it becomes rather effective. Overall, pretty good, scary horror, without too much gore, but lots of thrills. Worth the while!",
      "total_reactions": 0,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "I did enjoy this movie. It is different, but it worths the ride. However, I can see why some people do not like it; which paradoxically seems to be one of the reasons why I love it. The performances were great, and they created the right atmosphere. Great art direction and a good storyline. The Last Exorcism is gripping, intense, the suspense is permanent and I didn't want it  to finish!. It had great momentsand at times I felt afraid. I recommend it but I don't want to give away much...you have to experience it!",
      "total_reactions": 0,
      "user": "RegOz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 4,
      "text": "I love mockumentary style films; there's something about that style of film making that's extremely interesting and appealing. Add to that a eerie setting and solid lead performances and you get a good film, right? Meh...while there are some elements of the film that I really liked, there were some inconsistencies that ultimately made this film less effective and it tried to be. There were some nice twists, but the ending didn't add up at all.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "I have seen quite a few exorcism movies, most of them being trash, and this is probably the first legitly good exorcism based film I have seen. It's not scary or suspensful, It's just enjoyable.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "Really powerful and enjoyable, it has good scenes of possession, the 2nd best exorcism since \"The Exorcist\" it is smart and original, a scary PG-13 feast, the acting is great and intense, this is a true horror movie without tons of blood and sex, it is horror at its best",
      "total_reactions": 0,
      "user": "HaithamBayazeed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "Very smart, scary, original, and entertaining. Great performances from all the actors. So much better than the second one. It is without a doubt one of my most favorite horror movies ever.",
      "total_reactions": 0,
      "user": "mds03"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "\"The Last Exorcism\" is terrifying and good with an original plot, it is a well made movie, but it has a boring build up and a late climax, but with great performances especially from Ashley Bell and her creepy back bend.",
      "total_reactions": 0,
      "user": "AReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "You can tell you're in for a bad horror film when you find yourself laughing at the \"horror\" scenes. This movie just wasn't scary. Not at all. In fact, I found myself laughing at just how poorly done some of the \"scares\" were. And to top it all off, the ending just sucks. It's a damn near insulting ending.",
      "total_reactions": 0,
      "user": "shprea"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "The Last exorcism was like a documentary.That's what reminded me. It had no suspense and terror until the last 20 or 30 minutes and in the first 45 minutes we don't even know if the girl is actually possessed or not. I liked the fact that it shows that exorcists can be a fraud. However the film was stupid and not interesting. I liked the girl's performance. The end was the best for that movie and I have to admit that i really want to watch the second part though the first one was not really good",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "I originally wrote this one off and didn't bother watching it when it came out because all \"found footage\" films are the same but this one was awesome.  While I didn't find it scary, I found it really interesting and enthralling.  The lead character, the fallen preacher who lost his faith and sees that all he once thought was bogus is real, was fantastic to watch.  His performance carries the film and, when you add that to the interesting journey the preacher takes, you have a film that, despite not having any real scares, is pretty entertaining.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "Good!! Scary and very suspenseful!!! It's not The Exorcist but it makes sense and it's a good movie to see with your friends!!! It's recommended from me!",
      "total_reactions": 0,
      "user": "JohnnyStephens"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "This was a pretty interesting take on the exorcism genre. I wouldn't say it's outright scary, but it's very creepy and interesting throughout, even if the pacing is a little slow. My only complaint is that the ending is feels rushed, but it's recommended if you like found footage or exorcism movies.",
      "total_reactions": 0,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "One of the lamest Horror movies that I have seen in recent memory. We don't need anymore exorcism movies we all know that there is really only one good one. Really all the characters were annoying and the only part I enjoyed was the last few minutes.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2015
      },
      "score": 7,
      "text": "Nice film, pretty efficient, unsettling, creepy and frightening at times. Well acted, well paced and just a quality movie overall. For any fan of horror films, I recommend checking this one out, it is not special or original, just very well made.",
      "total_reactions": 0,
      "user": "Urbanlistener"
    }
  ]
}