{
  "mc_avg_user_score": 7.4,
  "mc_metascore": 74,
  "mc_mixed_rating_frequency": 59,
  "mc_movie_name": "The Town",
  "mc_negative_rating_frequency": 37,
  "mc_positive_rating_frequency": 406,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "I often find myself rating a movie against my own expectations.  My expectations were relatively modest for this film, but it greatly surpassed them. I expected great things from Jeremy Renner, and he delivers in a big way. He might be one of the best 2 or 3 actors out there.  Ham is serviceable, but his part isn't written to be an equal partner in an adversarial relationship like McNulty and Stringer Bell are in \"The Wire\". His part is too simplistic, but he plays it well. The only true weakness in the cast (and she's not even that bad) is Blake Lively.  Rebecca Hall is one of my all-time faves, and she delivers here, too.  One of our critics calls this a cross between \"Heat\" and \"The Departed\".  But I felt it was more like a cross between \"Heat\" and \"Good Will Hunting\".  Affleck's character pondering leaving this small corner of Boston is so similar to having to \"go see about a girl\", it's almost like we were back 10 years.  But it's not a real problem with the film. You write what you know. The pace of the film is terrific, and you should be riveted for much of it. (Oh yes, the two fathers are tremendous in small roles.) I won't say more other than it's a very solid film.  Great way to kick off the fall season.",
      "total_reactions": 10,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "\"The Town\" is daring and tense; its a rare gangster movie that is abundant with strong action and appealing force to the audience. Bravo Mr. Affleck, Bravo!!",
      "total_reactions": 3,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Wow! What a terrific film. I was incredibly surprised. I was pretty much dragged to the theatre by my brother, and I was very happy that I got to see this. I was sitting on the edge of my seat for half of the movie! It was incredibly suspensful, and even some jokes here and there. and I really liked the ending. i would recommend this film to anyone. go see it!",
      "total_reactions": 2,
      "user": "joeys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Finally a thriller that is actually intelligently written, acted out and overall packaged! It is always a fine balancing act to make a film with such thematic be really good and effective. Without unnecessary car chases, violence (all the violence is rather appropriate in the film), \"The Town\" represents what every thriller ought to be. With an impressive cast, led by the excellent Jeremy Renner and Rebeca Hall, as well as director/writer/leading actor Ben Affleck, the acting in the film is excellent. Great ensemble, with Jeremy Renner really standing out as one of the best performances - matching up to his performance in \"The Hurt Locker.\"",
      "total_reactions": 2,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "This film shows that Ben Affleck has completed his career turnaround and it shows he belongs in the list of elite directors. In The Town, a story of a group of bank robbers, Affleck is able to show us the layouts of Boston, give us some epic action sequences, and some amazing performances from the cast. Affleck, Hall, and Renner show that they are actors with a mission and that mission is an Academy Award. I wouldn't be the least bit surprised if any of them are nominated this year. Hamm is not given enough to work with and can't make his character seem appealing to anyone. Lively was a pleasant surprise and turned out a good role completely away from her Gossip Girl style. While Cooper and Postelwaithe are not n the movie for long, they milk the little time they have to churn out great performances. Overall this film will keep you thoroughly entertained and has enough substance to make a legitimate run at this year's awards.",
      "total_reactions": 2,
      "user": "Chonquist"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "A great second outing for Ben Affleck as a director, The Town is an effective and gripping heist film, with many great performances and strong direction. The film successfully manages the difficult balance between character moments and dynamic action sequences. The performances are across the board solid, the stand out being Jeremy Renner, who I had high hopes for after The Hurt Locker, whose Jem is crass and bold, but Renner makes his brusque attitude understandable in the circumstances he lives in. Rebecca Hall also is amazing as Claire, who is the audience's entry point into the events unfolding. Hopefully this film will allow Affleck to get more work as a director, because he has definitely proven himself a promising one.",
      "total_reactions": 2,
      "user": "SmellyCat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "It takes place in the city of Charlestown, MA, where apparently there are a mass amount of bank and armor car robberies.  Ben Affleck plays Doug MacRay, the leader of a crew which robs said banks and armor cars. In this team includes Jem Coughlin, played by Jeremy Renner (who has a great performance in this movie), and two others (who are pretty much no names in Hollywood), and each of them are just as bad ass as MacRay.  The opening scene has the team robbing a bank, while they wear Grim Reaper-like masks, and we get introduce to our leading lady Claire Keesey, played by Rebecca Hall. The robbers go through this entire bank with precision and grace that it looks almost like an art.  However, the silent alarm is tripped and they end up taking Claire as a hostage, just in case. When the close is clear, they drop her off unharmed and the FBI immediately ask her what she knows.  With the possible risk of her identifying the culprits, MacRay takes it upon himself to check on her and see if shes going to talk, but by doing this leads to an unforeseen relationship between the two. This is the first movie directed by Affleck I've seen (haven't gotten around to Gone Baby Gone), and I'm impressed on his work. People often comment on his acting ability but as for his directing, it's top notch.  The movie has the intense feel of a crime thriller and makes you care a little bit for Affleck's character, who is just trying to get out of the heist game and make a life thats better than this. Not only is Affleck on par with the movie, but the rest of the cast is great as well. Jeremy Renner gives a great performance as Affleck's best friend/partner in crime and Rebecca Hall is a great leading lady.  Even Chris Cooper, who plays Doug's father is good for the short time he has on screen. The camera work could of used slight improvement, because it does the \"shaky camera\" technique, and often gives me a headache.  The other thing I guess i have a problem with is Affleck as the lead. It kinda seems like an ego trip for the director to be also one of the lead stars, but most actors/actresses are starting to direct and put themselves in their own movies, and it works occasionally , and this is one of those times where it does work.",
      "total_reactions": 2,
      "user": "Jaxsem"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2010
      },
      "score": 8,
      "text": "The Town is at its best whenever the bad guys are up to no good.  The cast is very fitting indeed with Affleck and Renner as the key \"bad guys\", Hamm as their adversary and the always brilliant Postlethwaite as the don.  Brought me memories of \"Heat\" and  \"Break point\".",
      "total_reactions": 2,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "Sadly The Town is not as finely executed as the bank robberies it portrays on screen. It does not completely stall, but Affleckâ",
      "total_reactions": 2,
      "user": "volcboy84"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2010
      },
      "score": 8,
      "text": "Ben Affleck's \"real\" directorial debut definitely lives up to it's unoriginal title and intriguing cast. Never has a movie just felt so normal, so engaging, it leaves the audience to become strays in the theater. The film quickly learns to be intelligent, but simplistic at the exact same time. The action reaches it's peak near the end, because there was a slight lack of it for the rest of it. The interaction between the characters in average dialougue can make you wonder how this movie can be interesting. Well, it works!",
      "total_reactions": 2,
      "user": "Film_Fanatic_15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "I don't like Ben Affleck as an actor. I think he's very overrated and quite bland. As a director thou, he is now 2 for 2. The town was a terrific story based on actually events. The action sequences are phenomenal and the story was pretty solid. The crappy bawston accents did make the dialogue a little difficult to understand but overall, I feel like this was a great film that defiantly lives up to the hype. It worth checking out.",
      "total_reactions": 2,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "Everyone really hit their stride with this career making movie. Affleck reinvented his career and became the next big thing (again) and Renner, who absolutely killed it in this movie, starred in several big films soon after. The Town is one of those movies that you are going to be very satisfied watching, There's no real bad thing I can say about it.",
      "total_reactions": 1,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "A single square mile in Boston called Charlestown contains more bank robbers than any other municipality in America/ And it is here where the setting of one of the best films of 2010 takes place. \"The Town' is a powerful force that explores thoughts deeper than that of most films about organized thieves.",
      "total_reactions": 1,
      "user": "AutiTakahashi"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "Wow, this movie is an absolute 12!!!  By far the best movie I've seen in 10 years.  It's simply riveting.  Run, don't walk, to see it.  I smell an Oscar!  We are going to see it again.",
      "total_reactions": 9,
      "user": "moviehead"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "No offense to him as a person but other than Good Will Hunting, i find Ben Afflecks acting to be a joke. Though in this movie which he also directed, he is an intriguing character. I went into the movie thinking a wasted 6.50 on another turd flop of a movie but left with the satisfaction that it is one of the better crime dramas i have seen since  The Departed.",
      "total_reactions": 2,
      "user": "InClass"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2010
      },
      "score": 2,
      "text": "Ben Affleck is the badass with the heart of gold, please.  This is just his poor attempt at trying to be Matt Damon in Good Will Hunting or Leo in The Departed.  We get that you love Boston, so do I, but as much as you were trying to be \"authentic\" to gritty Charlestown you cast Gossip Girl as a crackhead townie.  I didn't care about any of the characters nor did I think any of them acted appropriately (Best example is Rebecca Hall's character, wtf is her deal).  The story was lame and uninteresting and the ending was unrealistic and overdramatic.  I think it's just riding on the coat tails of a Boston setting and some good robbery masks.",
      "total_reactions": 11,
      "user": "Fulchizzle138"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "â",
      "total_reactions": 1,
      "user": "BHBarry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "Wish I could give them movie a 7.5, but 7 will have to do. This movie had a lot of hype and I think my expectations were too high. It was a solid flick, but not a movie i'll be watching over and over again (i.e., departed). The action was solid, the acting was a little all over the place. Supporting case was probably all better than Ben. He got yolked up for this movie and looked the part, but I just felt like he was pretending to be bad ass instead of just being bad ass. One thing that I found a little lackluster in the film was the tempo of the music. A lot of scenes had little to know soundtrack. It might just be my personal taste, but I love when the music and the action just sync and you're totally lost in the scene. Certain points had it, the last heist (for sure), but for the most part I think Ben went w/ a realistic approach. I recommend this movie, but don't expect the movie of the year, just another solid entertaining action flick.",
      "total_reactions": 1,
      "user": "Frmz84"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "The Town is very much a sappier version of Heat.  That being said, it's not a bad movie.  It just wasn't nearly as good as I was expecting it to be.",
      "total_reactions": 2,
      "user": "emcoffey3"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "With two movies under this surprising filmmaker's belt, one commonality stands out; aside from, do we dare say, the auteur's fondness for time-lapse photography(he likes fast clouds), and that is his tendency to uphold the sanctity of motherhood, at the expense of the best interest for the child. Patrick Kenzie, the low-rent gumshoe played by Casey Affleck in \"Gone Baby Gone\", not only sees law and order in terms of black and white, his monochromatic worldview extends to people as well, best exemplified in the penultimate scene where he \"[does] the right thing\" and calls the cops on Jack Doyle(Morgan Freeman), who helped orchestrate the kidnapping of a little girl. Despite his girlfriend's protestations, Patrick insists on reuniting the child with her druggin' and whorin' mother(played by Amy Ryan). How can the detective be this unbending and injudicious, so unseeing of the big picture at hand? How can the protagonist, the hero we're supposed to relate with, let us down so badly? It's blood simple. Provincialism is the cause root of Patrick's blindness; he never left Dorchester, and as a result, the Massachusetts native never attained the proper perspective of its denizens, especially Helene, because he's one of them, a lower-class Bostonian with the same issues about race and social class, the same type blood. Twice, on separate occasions, Helene utters the n-word in Patrick's company without a reprimand, without even flinching. His complacency toward the racial epithet materializes as a real blind spot when it's revealed that the black chief of police keeps a white wife. As a counter to Angela's advisory against pursuing the letter of the law, the primordial Patrick, the hard-scrabbled street kid whom the soft girl tamed in high school, returns with a vengeance, when he asks with some bitterness and wounded pride, \"Why? Because he has money and makes her sandwiches?\" Is Patrick lashing out at Doyle's class, or race? The moviegoer gets the answer in the closing moments of \"Gone Baby Gone\", as the detective sits with the returned girl on the parlour sofa. Only then, after it's too late, over the blare of a cartoon from the electronic babysitter, does the detective practice introspection. Whereas Patrick Kenzie never left Boston, Doug McCrae(Ben Affleck) returns to Charlestown after his professional hockey career goes nowhere. According to Jem(Jeremy Renner), his almost famous friend thinks he's better than the other neighborhood boys-turned-hardened criminals(an accusation that's right on the money), unlike Patrick, who doesn't give up on Helene's potentiality as a mother, which in effect, validates his own self-worth as a bred-and-born townie. While Patrick, arguably, is a closeted bigot, Doug's brand of intolerance seems more rooted in class. Rather than improve the life of the child he fathered with Jem's sister(played by Blake Lively), the disposable girlfriend, the barfly he f****, Doug leaves behind the stolen loot with Claire(Rebecca Hall), the woman he makes loves to, his ticket out of Charlestown(as Angela was Patrick's ticket to liberate himself from the sociological limitations of his own town); he leaves behind a little girl in hell, likewise, with an equally unfit mother.",
      "total_reactions": 2,
      "user": "Shiira"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2010
      },
      "score": 6,
      "text": "This is a movie full of hits and misses.  Ben Affleck directing is a hit.  Ben Affleck acting is a miss.  I personally feel that Mr. Affleck suffers from the terminal disease of being too-likable-in-a-normal-sort-of-way.  The kind of likeable that I would have over to watch a hockey game.  Not the kind of likeable that I would believe could rob banks and have one of the hostages fall in love with him.  There are other actors out there who suffer from a similar disease of being too good looking to be believable.  Luckily, there are some other very qualified personal who are able to make the most of their characters.  And Affleck allows them the space in order to do it.  The movie clips along at an efficient pace and effectively balances out action and drama.  The action scenes are well executed and get the adrenaline pumping, but I found some of the smaller scenes were handled more clumsily.  This was a disappointment considering Affleck's previous film Gone Baby Gone.  In particular the scene involving Renner, Affleck and Hall sitting at a cafe would have produced it's menacing intentions more effectively using subtlety rather than telegraphed acting and dialogue.  The movie closes out with more hits and misses, but Affleck still shows promise as a budding director.",
      "total_reactions": 1,
      "user": "shanebot"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "I watched The Town knowing that (a) it starred Ben Affleck; and that (b) it *might* have been directed by the same person. Nothing more.",
      "total_reactions": 1,
      "user": "rnnbrwn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "Don't be fooled by the fact that Affleck is in this - it's actually pretty good! Slightly predictable popcorn film, but with some good performances and a decent script that make it better than most. Worth a punt.",
      "total_reactions": 1,
      "user": "bobbsyw"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2011
      },
      "score": 3,
      "text": "Here we have another attractive woman who falls in love with the lame anti-hero as soon as he tells her the time of day. Why don't these women ever have boyfriends? Or even friends? Half way through the movie the FBI figures out the robbers are Ben and co. So they set a plan in motion involving a slut obsessed with Ben that may or may not work. Meanwhile Ben and his posse walk out their front door and rob two more banks. Having someone watch their house I guess is just too much expenses for taxpayers to handle. In between well shot but completely illogical action sequences you'll find this conversation repeated ad infinitum: \"This is what we do. This is the life we chose.\" Sigh...This movie is a joke. Then the ending is a twist of the knife.",
      "total_reactions": 2,
      "user": "supersigy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "An above average heist movie that does its job well. Was hoping that this would be an Oscar worthy flick that would grasp me like The Departed and Gone Baby Gone did. While Ben Affleck did a nice job directing and put in a solid acting performance there wasn't enough of an attachment between the viewer and the characters.",
      "total_reactions": 2,
      "user": "becker4prez"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2010
      },
      "score": 5,
      "text": "I was disappointed in this movie.  Resembled Heat with Val Kilmer, but much slower.  I could not get invested with the characters enough to care about them when it was needed the most. I found myself bored by the long pauses between action scenes.  I understood the need for it, but the way it moved was just to slow for me.",
      "total_reactions": 2,
      "user": "bishopsring"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2010
      },
      "score": 4,
      "text": "This movie received a mixed response from me. I expected much more from Ben Affleck's skillful directing. Jeremy Renner, Jon Hamm, & Blake Lively seemed into their respective roles, however Affleck and Rebecca Hall were in their own little worlds. Pretty disappointing, however I liked the intelligent plot and jokes through the movie.",
      "total_reactions": 2,
      "user": "mrcritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 5,
      "text": "Negatives - Lots of cliches, unintimidating bad dudes, cheesy Boston over the top accents, Ben Affleck is in it.",
      "total_reactions": 1,
      "user": "BoredatWork"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "Who knew that Ben Affleck had such talent -- not only as an actor, but as a director?  Considering how lousy most of this summer's movies were, I'm amazed that this excellent offering has scored only in the mid-70s.  And, am I imagining it, or are most of the 7-or-lower reviews below a bit vague -- lame, even -- in comparison to those that praised the film?  Me, I'm looking forward to Affleck's next project.",
      "total_reactions": 1,
      "user": "MargateExpert"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2010
      },
      "score": 8,
      "text": "Set in Charlestown the \"Town\" reminds us of films like \"The Departed and \"Mystic River\", it's paced perfectly and the acting is mesmerizing.",
      "total_reactions": 1,
      "user": "Duke"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "I watched the DVD having seen only the original trailers and expecting an action/heist film. I got that for about 15 minutes at the beginning and 15 minutes at the end. The rest was a long-winded (2 hours) drama about the developing relationship between three of the characters involved in the robbery at the beginning of the film. If you're looking for an action type flick you might want to pass. If you're an Affleck fan you will get a decent film that will help him climb back up to the top of Hollywood where he one stood alongside Damon.",
      "total_reactions": 1,
      "user": "JookyDFW"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2011
      },
      "score": 1,
      "text": "The problem with movies starring Ben Affleck is...Ben Affleck. He ruins every movie he is in because he is so incredibly full of himself, and apparently no director can get that out of him.",
      "total_reactions": 11,
      "user": "Nazgulero"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2011
      },
      "score": 2,
      "text": "Despite the decent Boston accents that everyone handles acceptably - despite great character actors Pete Postelwaite and Chris Cooper in tiny underutilized roles - despite the fact that somehow Jeremy Renner managed to snaggle a nomination for Best Supporting (ensuring that he will continue to be typecast as a sociopath ad infinitum,) this is a predictable heist movie with extraneous amounts of foul language and unnecessary violence making up for anything close to character development. By the time the inevitable happens, I couldn't care less who was going to make it out alive.",
      "total_reactions": 1,
      "user": "Mermama"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2011
      },
      "score": 5,
      "text": "It copies the central theme from the movie Heat and throws a bit of James Bond style chase scenes in it but the overall affect is  weak. Some parts are great but there is some shortcuts taken in the script which can leave the viewer somewhat cheated.  Its an Ok movie but not one to watch a second time.",
      "total_reactions": 1,
      "user": "MorriBey"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2011
      },
      "score": 2,
      "text": "This movie sucked.  Every character was stereotypical - the bank robber with the heart of gold, his buddy the over-the-top f*ckup (worst criminal ever, seriously), the damsel in distress who seemingly has no perception or awareness at all and the FBI guy who gets outsmarted at the end.  I think I wrote this on my lunch break in 7th grade... and then threw it out because I thought it was too cliche.  Cool shootouts and Nun robber masks though, but that was what, 3 minutes out of the whole movie?",
      "total_reactions": 1,
      "user": "BobaFett666"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "It's good",
      "total_reactions": 1,
      "user": "tomfleet94"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "The town is a film to look at in two different ways. It can be your standard action film with average acting and poor story or a film that mixes story and a action brilliantly. I would say the first choice was more accurate.",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "After seeing Gone, Baby, Gone I had some expectations for this film and am happy to report it met or exceeded most of them. This film spends a lot of time in the gray areas where good guys aren't so nice and bad guys aren't so mean (sometimes.) That might sound like the standard anti-hero theme we've seen so much in Goodfellas, Sopranos, etc. but this film still managed to make a couple unexpected turns. Can't ask for much more than that.",
      "total_reactions": 0,
      "user": "whit"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "The Town should've been re-titled \"Boston Heat,\" since it pays heavy tribute (I'm in a good mood, so I'll refrain from using the word rip-off) to Robert De Niro's great heist flick. But all in all, that's not such a bad thing...",
      "total_reactions": 0,
      "user": "Deconstructor1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "The gritty feel and good acting saved this for me despite the fact that I did not quite believe the romantic part of the story line. At this point I would watch Jeremy Renner in anything, though -- and Rebecca Hall is remarkably real as well.",
      "total_reactions": 0,
      "user": "Lyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "The Town is an intelligent thriller, with interesting dynamics between the characters, excellent performances across the board and proof that Ben Affleck is a terrific director.  Whilst the plot and heists are not exactly original, the story unfolds at a perfect pace, and the action scenes and acting are beautifully down-played giving the film a real authenticity and genuine emotional core.  Having been impressed with his previous effort, Gone Baby Gone, and marvelling at the terrific trailer, I was not disappointed by Affleck's latest.  He is a truly talented director, alongside his writing and acting skills, which have been seriously underestimated after the Gigli Ben-nifer debacle, and I look forward to his next venture.",
      "total_reactions": 0,
      "user": "grindhouse83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Great movie. Exceeded my expectations. Ben Affleck is great, I like when him and Damon can use their Boston accents in flims. Jeremy Renner really surprised me. I thought he was better in The Town than he was in The Hurt Locker. I don't care how trashy Blake Lively looked, I would still kiss her face.",
      "total_reactions": 0,
      "user": "MPVahalik"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "The Town' runs on a very simple premise, executed particularly well by Ben Affleck, the star and director of this film. Affleck plays Doug MacRay, the leader of a group of bank robbers in a small Boston-area town, and it turns out that they're no amateurs; in fact, they've been doing this for years. It's this small town's underground crime family, an accepted aspect of their culture. Doug decides he wants out of the \"family business\" after falling in love with the hostage from his previous robbery, and this marks the beginning of a dastardly explosive chain of events that lead up to a colossal conclusion. While there are some plotholes here and there, they're barely noticeable since the film moves in a rapid \"Nolan-esque\" pace. Most of the characters in 'The Town' are pretty stereotypical and the story is somewhat clichÃ©, so why did I like it? Probably the same reason everyone else liked it: it's just so much fun! The stereotypical characters don't end up so stereotypical when they're portrayed by an outstanding cast (including Jeremy Renner (Hurt Locker), Blake Lively, Jon Hamm and Chris Cooper), and the story moves by so quickly that we have no time to argue with any implausibilities. It's a genius technique that's being used more and more lately, most notably so by 'The Dark Knight' and 'Inception' director Christopher Nolan. It's easy to get lost in these films if you think too hard, which is why you should only focus on what's simply being presented. It's what films are for, and both Nolan and Affleck demonstrate this superbly. Now here's me thinking too hard, because some things in 'The Town' were indeed confusing. For instance, if these guys have been robbing banks for years, why are they still poor? Where is all of the money going? Why do the banks continue to have poor security? Why are the feds just now catching up? The way these questions are avoided shows a surreal style of realism that is nothing short of spectacular. While these holes are avoided, we're expected to just roll with it, and if you do just that, it's definitely going to be one of the most entertaining films you see this year. The whole \"backing out\" plot is a classic that has been somewhat overused throughout film history, but it is handled well in 'The Town.' Doug represents an inevitable \"flaw\" that always marks the end of an ongoing system, that system being the success of the robberies. When one specimen, in this case Doug, decides to turn against the system, it is a break from the conventional, what critics look for in movies, character development! Affleck plays a believable character going through a mental struggle to obey or betray his \"family traditions, and Renner shines as his brother, a tough guy who sometimes makes ignorant decisions. Honestly though, he's one of the most intimidating film characters I've seen this year. Like I said before, they're mostly stereotypical, but they're acted out very well. I'm a sucker for good heist films, and this one goes down with the newer 'Ocean's Eleven' and 'Dog Day Afternoon' as one of my favorites. It's loud, intense, and action-packed, not to mention some of the coolest robbery sequences I've ever seen in film. If you want something smart and philosophical, this wouldn't be my first recommendation, although I wouldn't say it's not smart. But if you're down for something that never lets go of your attention, then this is a great choice.",
      "total_reactions": 0,
      "user": "AwesomeDragon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "I read the book and although many scenes in the movie played very different from what happened in the book but I thought they did a fantastic job depicting the characters as Chuck Hogan created them in the book. In addition the film complemented the book in such a great way I think it made the story even better and the alternative ending was great. Although, I would have liked Jemâ",
      "total_reactions": 0,
      "user": "lisar1185"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Although many action films have their adversity of progressing the storyline and plot, 'The Town' directed by Ben Affleck shows the perfect storyline and even solid action performances.",
      "total_reactions": 0,
      "user": "Paul_Yoon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "This is really a good movie. Just see it. (score 9)",
      "total_reactions": 0,
      "user": "Zlatan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "At times stylish, sometimes well-acted, and mostly nicely filmed, \"The Town,\" in the end, left me a bit flat and disappointed.  What was missing?  Well, I don't know for sure.  I think a lack of focus contributed to the sense of incompleteness.  Too many issues, some only partially resolved. Mostly I was entertained and  the grainy, gritty texture of the cinematography lifted my expectations for the underlying story.  But instead of a tight, cohesive beginning-to-end tale of a hardened criminal trying to rise above his circumstances, the storytelling sprawled across the screen in a series of loosely connected scenes and performances that eventually, like Ben Affleck's Doug, just left.  It's a credit to Affleck's somewhat surprising ability as director/actor that this stew stays together at all.  Not a bad picture, at all, but the bones were there to deliver something much, much better.",
      "total_reactions": 0,
      "user": "T-Pity"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "While Ben Affleck has exceeded any expectations I had for him since first seeing him in Mallrats many moons ago, his better-than-average performance in \"The Town\" has been entirely overrated, as has the movie.  I, unfortunately, had my expectations pretty high when I read the hype surrounding this movie.  Unfortunately, they weren't met.  \"The Town\" is certainly a fine film, much better than most fare from Hollywood.  However, the flow of the movie seems elementary with scenes and storyline elements lasting unnecessarily long.  The sudden fade out that end also threw me for a loop.  It was mechanically clumsy, perhaps having more to do with editing than directing, but it was a valiant effort nonetheless.  Being a huge fan of Boston, having just spent a large amount of time there in the last year, it was interesting to be reminded of all the places I had visited.  Also, my baseball pants did a dance when they robbed Fenway.  There was significant dialogue that was so muddied in Boston dialect that it was difficult to follow.  There were also unfinished storylines, inexplicable progressions and some difficulty emotionally attaching to the plight or life of the characters.  Blake Lively was the biggest surprise in the smallest role as Jeremy Renner's sister and Ben Affleck's former lover.  She was in the movie only a little, but had a tremendous impact and showed range I wasn't aware she had.",
      "total_reactions": 0,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "The Town is a great start to the fall movie season. Like Michael Mann did with Los Angeles in Heat, Ben Affleck has made Boston a major player in the cast.",
      "total_reactions": 0,
      "user": "JGKrump"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "I love this movie.  My only criticism is at times the dialogue is so thick and mumbled I could not make out the words.  So when you see it go to a theatre with good audio system!  It could be this was intentional to give the film gritty, natural feel, I don't know.  I was pleasantly surprised the lead of The Hurt Locker had co-starring role.  Don Draper, aka FBI agent, at first I felt was underwhelming, but he delivered by films end too.  This is a great friggin film!  Anyone who says otherwise liked Sex and the City 2.",
      "total_reactions": 0,
      "user": "mrknowitall_not"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2010
      },
      "score": 8,
      "text": "Ben Affleck has been given so much **** I've realized something though. Just because the guy has chosen to do some really repugnant movies, doesn't mean he's a bad actor. If I played for the New York Islanders that wouldn't make me a bad hockey player. It's the team that sucks.",
      "total_reactions": 0,
      "user": "Bairdo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "Another great film by Ben Affleck.  Manages to do something similar to so many heist films in the past, yet in a very unique and affecting way.  Very enjoyable.  Holds your attention.",
      "total_reactions": 0,
      "user": "hypnowheel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "This is one best movies I have seen in years, though I did go in with modest expectations. Let's face it: Affleck has given us \"Gone Baby Gone\" and \"Good will Hunting.\" But he also given us \"Pearl Harbor\" and \"Gili.\"",
      "total_reactions": 0,
      "user": "letter27"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "Very good movie. Excellent sound, the car chase thru the Boston neighborhood is really good. The street scenes were filmed to give a sense of the neighborhood. The script was very smart, the movie well directed. The acting was very good. You never really knew for sure how the movie was going to end. All in all, my wife and I give it 3.5 out of a 4 star rating.",
      "total_reactions": 0,
      "user": "allfish"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "\"Ben Affleck Directs a stunning masterpiece , in this one of kind thrill to the min thriller , that will keep you on the edge of your seat, The Town is one of the best films of the year which include Oscar worthy performances from John Ham & Jeramey Renner\" .. A-",
      "total_reactions": 0,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "First off, the one thing that this movie lacked was originality.  It was a combination of Good Will Hunting, The Departed, Heat all rolled into one.  You knew what was going to happen, and there were no surprises. On the plus side, Jeremy Renner was absolutely excellent in this film, as was Blake Lively.  Outside of Affleck, the accents were done well, and the characters were all strong and compelling. I understand its his thing to pick one neighborhood in Boston whether that be Charlestown, Southie, Dorchester, etc. and find a blue collar story to tell, but I for one am growing rather tired of it. Find a different perspective, and take a chance.",
      "total_reactions": 0,
      "user": "imart5"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "Ben Affleck proves that he can not only act but direct too. He perfectly adapts the novel from which it is  based and make into something interesting and entertaining to watch.",
      "total_reactions": 0,
      "user": "AwesomeAndy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "Ben Affleck has become one of my favorite directors of the last few years, if for no other reason than his skill behind the camera has been such a refreshing surprise.  Gone Baby Gone certainly got my attention, although it had its share of shortcomings.  With The Town, Affleck flexes considerable confidence directing not only balls-out action sequences, but quieter, more intimate moments between characters.  He gives his actors plenty of room to breathe, and each of the stellar cast has at least one memorable scene.  Affleck as an actor is at his best here, as well, although I don't believe his character quite earns the fate that is written for him.",
      "total_reactions": 0,
      "user": "BrokenHelix"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "A Brilliant Film - Jon Hamm and Jeremy Renner Deserve Oscars - Ben Affleck, Blake Lively, Pete Postlethwaite and Rebecca Hall also deserve recognition - Better than Heat - My Favourite Movie of the year so far - Unmissable!",
      "total_reactions": 0,
      "user": "dgr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "A good action, gritty film that allowed you to overlook the reality flaws. If only the ending could have done so. The ending is so reality flawed that it almost lost me as an a viewer.Still, it was better than I expected and I thought the performances were good, particularly Jeremy Renner.",
      "total_reactions": 0,
      "user": "JamesL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "http://mushreviews.blogspot.com/2011/03/town.html",
      "total_reactions": 0,
      "user": "Kingmush"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2010
      },
      "score": 5,
      "text": "This film was a solid second effort, but like Gone Baby Gone suffers from a lack of realism.  The acting is very fine, particularly from Jeremy Renner and John Hamm, and the action scenes are extremely well directed.  However, the story just didn't work for me. Perhaps Affleck should hand over the writing to someone else for his next film.",
      "total_reactions": 0,
      "user": "conschobhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "Okay Ben Affleck can direct and he's not bad as the lead in this.  Some of you won't like the ending but no one got on anyone's case for the way Shawshank Redemption ended so chill out.  This is one of those crime films that coaxes you into sympathizing with the crooks, you want them to get away, well at least a few of them.  Depending on how much you know about Ben Affleck you might be able to detect a subtle autobiographical undercurrent smuggled into the plot.  Just like his character, BA seems to have transcended his roots and left the unsavory aspects of his past behind him once and for all.",
      "total_reactions": 0,
      "user": "jtatsiue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "Ben Affleck's latest directorial effort stars him as the leader of a quartet of rough bank robbers in the Charlestown section of Boston. After he falls for the hostage from their latest heist, he tries to go straight. While the performances are uniformly strong and the action is taut, the predictable story and indulgent soliloquies keep the film from being as powerful as it might have been. One thing I don't understand: why do Affleck and John Hamm (the FBI guy) always have thick 5 o'clock shadows?",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "This film only needs merely a sentence from me, and here it is. This is one of the best films of the year, and you must see it immediately; because not only is it epic, it is breath-stealing, fast-action, awesomeness.",
      "total_reactions": 0,
      "user": "Thebangtrain"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "The Town is a very solid movie. It's just not very memorable. It has a little bit of everything that you want in a movie - solid actors, character development, plot, and action sequences - but it lacks a 'wow' factor. You can't wrong seeing this movie, but you won't be missing anything special if you don't see it either.",
      "total_reactions": 0,
      "user": "AaronM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2010
      },
      "score": 6,
      "text": "Barely in the realm of thumbs-up.  It's busy, it's gritty, and Affleck went to some trouble to make the people appear real (no botoxed babes in cake makeup).  Rebecca Hall is appealing, Jeremy Renner is seriously unlikable, and Affleck is not bad, but at no point to you *really* care about the people or the outcome of the movie.  Yes I *did* want Affleck to get away at the end, but was I cheering when he did?  No.  I looked at my watch a lot during this flick...",
      "total_reactions": 0,
      "user": "ccstone"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "A solid follow-up to Affleck's fantastic and underrated \"Gone Baby Gone,\" \"The Town\" is an extremely entertaining, albeit somewhat generic, crime thriller. The cast, even Blake Lively, is great, and Affleck shows that he has a real career ahead of him behind the camera.",
      "total_reactions": 0,
      "user": "Tony"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "Loved this film. Catch it on DVD/BLU-Ray if you missed it in the cinema. Wrote an extensive review here: http://seanryanmovies.blogspot.com/2011/02/town-2010-review.html",
      "total_reactions": 0,
      "user": "seansshack"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "The movie was a little slow about 75% of the way through but that is the only complaint. Great cast. Fantastic story. Even better action. Might not be completely plausable but that is why it makes such a great movie. I would advise making plans to go see this.",
      "total_reactions": 0,
      "user": "Paint"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "It seems that most of us grow up with some version of the family business. Hollywood in itself is a prime example. The Barrymore name has been ever present as long as making movies has been a business. As a child is raised into the family business there comes the time to make the ultimate decision. Do you rebel and become something else? Or do you find comfort in the continuation of way of life? But what is a person to do if there is no way to rebel from the family business without dire consequences.",
      "total_reactions": 0,
      "user": "Hemetsphere"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "this movie was amazing.",
      "total_reactions": 0,
      "user": "markypoo92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "So far this is my favorite movie of the year.  Though I'm not sure if that's saying much this year.  It was so much better than what I expected.  Affleck proves that he is a contender in the Director's chair. About the only negative is Jon Ham's borderline acting skills. This movie was compelling from start to finish.  All the other acting was strong, including Affleck.  But Affleck's true calling is directing.  I look forward to seeing future movies from him.",
      "total_reactions": 0,
      "user": "cinescribe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "This film was action packed and the acting was quite good. It kept the audience enthralled at times yet in the end it left us wanting more. I went into the film with zero respect for Ben Aflieck and left believing he was capable of much more than \"daredevill\".",
      "total_reactions": 0,
      "user": "BentleyD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "Having lived in Boston and worked in law enforcement, Charlestown is portrayed very well, an Irish crime center, bank robber capital of the states, probably the world. I enjoyed this movie, although there were no real surprises in the story. Ben Affleck was very good, the whole cast was excellent, great car chase, the stories action was a bit forced. But all in all good film to see, I think you will enjoy it.",
      "total_reactions": 0,
      "user": "Withnail"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2010
      },
      "score": 8,
      "text": "I will be honest... the only thing I expected from Ben Affleck was disappointment.  I was wrong, totally wrong.  This is a heist movie, an action movie.  But it is also about Affleck's struggle with morality, loyalty and love.",
      "total_reactions": 0,
      "user": "TSud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "honestly, i expected more..although it didn't bring anything new to the silver screen, the movie was enjoyable, but when you have set the bar with inception-like movies it's really hard to be blown out with this film...the acting is great, a great cast but i feel that something is missing..i'm not a fan of the love story in the movie, but i enjoyed the action scenes and their tensity..i wish the characters had a better connection with the viewers....",
      "total_reactions": 0,
      "user": "TheGorilla"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2010
      },
      "score": 4,
      "text": "Didn't really want to go see a Ben Affeck movie.  Never thought much of him infront or behind the camera.  I liked the movie though mostly because it's a \"gritty\" hard knocks story.  I also lived in Boston for a while so I appreciated the setting.  But, true to form, the story has some inconsistencies, includeung Ben's come and go accent.  Plus, the story works it's way around a dumb question which ruins a movie that had a real chance to be very good.  People seem to like action and romance so it's doing well with the masses.  Entut certainly not a must see.",
      "total_reactions": 0,
      "user": "perfectd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Ben Affleck's previous work, Gone Baby Gone, is center around Boston. And in The Town, Ben Affleck revisits his hometown to do nothing more than talk trash on it. He must've really hated this town because both of his movies portrayed nothing but evil of Boston. Nevertheless, The Town is beautifully directed, written with great wit, and acted with much style. The story centers around a bunch of bank robbers who have been successful at what they are doing. But the success comes to an end when Doug (Ben Affleck) decided to have a relationship with hostage Clairre (Rebecca Hall). As the relationship develops, Clairre finds out that Doug is a bank robber and it gets complicated. Meanwhile, Doug was having a casual sexual relationship with his friend's sister Krista (Blake Lively). Being jealous of Clairre, Krista decided to rat Doug and her brother's bank heist to the FBI resulting in a lot of stylized gun fires and great driving scenes. The end is obvious but it has a sad element that Ben Affleck wants the viewers to feel. Writing, acting, and directing the whole film, Affleck's got a lot on his table but still manages to pull off every single role. As a writer, along with two others, Affleck was able to collaborate his knowledge of the Boston language and the wit of actual screen writing. As a director, he was able to direct a great gun fire sequence and a stylish car driving scene. As an actor, Affleck's performance would place second behind Jeremy Renner's. The Oscar winner continues to boost up his already impressive career with The Town. Jeremy Renner isn't new to playing a **** yet violent guy, but he especially stood out here with his badass attitude. Blake Lively's role was small but she gave it her all. You couldn't see her cuss in a Boston accent and have sex with Ben Affleck in Gossip Girl, could you? Well, there's the other reason to check it out. While filled with much thrillers, the film also showed emotions. Helped by one of this year's best ensembled cast and stylish directing by Ben Affleck, The Town is an award-winning film. OscarBuzz: Best Picture (good chance for a nod, not win), Best Screenplay (guarantee a nod, good chance for win), Best Supporting Actor (Jeremy Renner, good chance for a nod and win)",
      "total_reactions": 0,
      "user": "OscarPicks2010"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "I was quite happily surprised by this film. Very little cliche in the dialogue and a little bit more in the events that occur in The Town, but the heart of the film beat out all of the pure violence to make it a little less of an action film and a lot more of a drama. Great job on Jeremy Renner's part as well as on Affleck's for a great direction. Not a nominee for best director at the Oscars this year, but it would be great to see him up there. In a year of a king with a speech impediment, a man who invented facebook, a doppelganger fearing ballerina, and many others, this film puts itself up with the big dogs, but falls a tad short of being properly recognized. This was a good film. At moments when I was really worried for The Town of being predictable or cliched, I was happy to find original plot twists, though minor and a very nice look on the business of robbery in the town where it flourishes the most. The whole \"robbers are people too\" theme seemed a tad bit cheesy, but after saying this I feel bad because this is a good movie, not one of my favorites, but it does it's job of providing smart dialogue, good performances, stylish action sequences and great direction.",
      "total_reactions": 0,
      "user": "D-Slice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "If you liked Heat, The Departed or Inside Man this movie is for you. Very well acted by the leads Affleck and Renner with good cameos by Chris Cooper and Pete Postlethwaithe. Affleck does a good job behind the camera to with a script that has charactors that feel real and well choregraphed action scenes. A great heist movie that deserves to be seen by more people than would usually watch this type of movie. Affleck is making waves after Gone Baby Gone and now this.",
      "total_reactions": 0,
      "user": "allystew"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "It beats most heist thrillers, but I was expecting more from Ben Affleck's sophomore directing effort than tight shootouts and good acting (Jeremy Renner, Rebecca Hall, one of Affleck's best performances).  Glaring script holes and contrivances leave me hoping \"Gone Baby Gone\" wasn't a fluke.",
      "total_reactions": 0,
      "user": "blok"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "If you think Ben Affleck is a great Actor, you should take a better look at GOOD WILL HUNTING (1997). If you think Ben is a great Screenwriter, you should see more thoroughly in THE TOWN. In thiz last movie, he also directed it. For me, Ben is the third talented Actor-Director in the past decade, beside Clint Eastwood and Mel Gibson. Thiz is his second long feature after respectable GONE BABY GONE in 2007. The Town is Charleston-Boston, where everybody knows everybody.  It revolves around the bank thief Doug (Ben Affleck), his partner in crime James (Jeremy Renner), along with their former hostage Claire (Rebecca Hall) who will be having a love affair with Doug later, and a FBI agent Adam (John Hamm). All of them got tangled into cat and mouse situation. First half of the movie, it is introducing the characters and situations. Then the second half, it flips over nicely and everything is mounted up very well. I think Ben is success with his directing method bcoz he does not exaggerate things up, he just let every thing flows naturally. Yes, he is playing save here. The factors that empower thiz movie are simply a good script and consistent Actor performances. Ben himself shows a very calm and convincing performance. As well Rebecca Hall as his love interest, Hall delivers a precise fragile and lovable character. Jeremy Renner is deathly awesome with his street-gang attitude. Most of the supporting Casts deserve honorable mentions as well. Blake Lively as Doug former-girlfriend and single parent, I have never seen Lively blends into thiz kind of troubled character. Chris Cooper as Doug behind-the-cell father, it only took one scene but it is surely memorable. And the last but not least for me, it is Pete Postlethwaite as Fergie the flower man who is the brain of the crime. There is strange feeling by only hearing his intimidate and unique accent. In the end, we realize it is The Town that could change people, and the people are just victims. It is harder to change the system than the person itself. But to change the system, it should start by changing the person as well. And thiz will be a never ending circle. It is totally out of our control. But we can control something, for me it is waiting for another Ben next project. I will see him again, on thiz side or the other.   Visit My Blog on JONNY'S MOVEE: http://jonnyfendi.blogspot.com",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "In a way this film is not satisfying because it appears too realistic. We are so used to stylized action that the \"real\" thing, in this case, is rather boring. For an action movie The Town is not exciting or surprising enough, and for a drama it fails to be emotional. It does not even achieve to convey that robbing a bank is bad for all of us. Breaking the rules/law hurts the system of the polis that most of us agree to live in because of the rights and the security we are promised from it.",
      "total_reactions": 0,
      "user": "juliankleiss"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "One of the most underrated movies of 2010. It definitely did not get the attention or recognition it deserved. Despite the awkward attempts at Boston accents, the acting, script, and direction was strong.",
      "total_reactions": 0,
      "user": "shakeel7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2011
      },
      "score": 5,
      "text": "I didn't think it was all that. The acting was good but it's a dvd rental if you ask me.This movie received a mixed response from me. I expected much more from Ben Affleck's skillful directing. Jeremy Renner, Jon Hamm, & Blake Lively seemed into their respective roles, however Affleck and Rebecca Hall were in their own little worlds. Pretty disappointing,",
      "total_reactions": 0,
      "user": "manwe7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "Generally I think this film has been a bit overrated. The use of the Boston locale is done beautifully but the plot strains credulity over and over. Twice we see the criminals being set upon by dozens of cops -- the first time in a car chase through incredibly narrow streets -- yet they manage to get away with barely a scratch. The love story never really takes hold either, so a major part of the plot mechanics fails to engage. If you're willing to forgo some believability then this is an entertaining two hours but for gritty realism you'll need to look elsewhere.",
      "total_reactions": 0,
      "user": "DoubleBlue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "The plot is common, conventional, and even cliche. Thank for awesome direction and cinematography, and also intense action. While The Town glories in genre tropes it also dumps any overt stylings, keeping the action alive and lithe.",
      "total_reactions": 0,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "The Town proves that Ben Affleck has escaped the \"cheesy surfer dude\" roles. This guy knows how to tell a story, and how to direct one. He proved that with Good Will Hunting (one of my all-time favourites), Gone Baby Gone, and now with this. The film is gritty, intense, dramatic, and romantic when it should be. I was especially impressed with Jeremy Renner (who was nominated for his role) and Blake Lively, who gave a great performance with her small role as a drugged-up mother who needs some serious help.",
      "total_reactions": 0,
      "user": "tbagurdrumset94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Sorry wrote the post 20 mins in.  It's Heat except he lives. Still very good but only because heat was that good. Heat with Ben's Boston treatment that leaves a lot to be desired.",
      "total_reactions": 0,
      "user": "Ghouse23"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "It`s not just a sequel. It`s more like a rebirth in fast-paced style.",
      "total_reactions": 0,
      "user": "shakinha"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "The Town is a terrific action movie and one of the best films of the year.  Ben Affleck is in fabulous form as both actor and director in this heist movie. A well-written script and a superb setting; Boston, which actually plays a big part in the film. The story follows a master thief (Affleck) who inadvertently falls in love with one of his heist victims (Rebecca Hall) and begins to re-think his life. Amongst this is an Oscar worthy performance by the awesome Jeremy Runner and a strong performance as usual by the late Pete Postlethwaite, recognition to Blake Lively and Rebecca Hall who were great. A great action/heist movie with some excellent performances.",
      "total_reactions": 0,
      "user": "Rosco"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "Affleck proves himself with this film.  His direction is top notch.  The script is excellent.  The performances although you may have seen these types of characters a hundred times before are played as if you'd never seen them before.  There's little to fault.  Affleck uses Boston like it was part of his cast.  Jeremy Renner is a stand out but then so is Affleck.  I didn't really expect to like this that much but I have to admit I was riveted.",
      "total_reactions": 0,
      "user": "NJWolfgang"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "The movie The Town is full of drama, action, and a lot of crime. The movie has a lot of suspense that will keep the viewers in their seat. This movie is not like other movies; it offers a great story line and has a good location on where it is filmed. It is filmed in The Charles-town neighborhood of Boston. The neighborhood has that rough feel to it that makes the whole look of location a good one.    The Town is a movie that has a lot to offer in one drama film.  The actors in the movie make it a lot better. The cast includes Ben Affleck, Rebecca Hall and John Hamm  and Jeremy Renner and Blake Lively, these are just some of the main cast mates in the movie. There are many other actors in the movie that complete the movie scene. The actors/actresses that had a part in the movie have also been in other drama/action films before. They all know how to play their part and make the movie complete. What makes any good drama film good is how your purpose your part to the scene.    Some reviewers might say they picked the wrong characters for the film. I disagree I feel that the characters they picked for the movie is what makes it better.  Ben Affleck the director of the movie and the one of main character has been in many drama films before. Ben has also made a debut in another drama film â",
      "total_reactions": 0,
      "user": "rachel234"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "Some good performances from Affleck, Hamm and especially Blake Lively. Some sequences required too much suspension of disbelief for my taste. Although sometimes a little too \"by the book,\" Affleck shows promise as a director.",
      "total_reactions": 0,
      "user": "BamaFalstaff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 6,
      "text": "The Town is a decent attempt by Ben Affleck and for the most part is entertaining. I did however find the acting a little over done and forced - the characters never seemed to stop yelling and swearing at each other for no real believable reason other than the director wanted them too. The last act was interesting in an action oriented way and was well directed. Not the greatest movie, but good enough to be entertaining.",
      "total_reactions": 0,
      "user": "davenbettridge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "Much better than I expected. Ben Affleck should stick to his Director's Chair, it suits him just fine(See Gone Baby Gone). A compelling thrill ride.",
      "total_reactions": 0,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "Selena is evolving much more at time. Looking behind for Kiss & Tell you can realize her grow. Mature vocals and independence define this album!!!!!!! One of the best of year!",
      "total_reactions": 0,
      "user": "DannMoura"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "I saw the directors cut of this film witch adds about 30-40 minutes to the movie and i its just really boring to me they just over developed the characters, the actors just kept taking and taking and  the action scenes added no thrills or suspense. As to the story its fine as its simply to follow. The action was great but again they just talked to damm much. If you have not seen this movie and are planning to see it make sure you are plenty awake.",
      "total_reactions": 0,
      "user": "moviesRawsome"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "Awesome Movie, Ben Affleck has more success as a director than as an actor, and The Town and Gone Baby Gone are very good examples of that. The concept of the film were so amazing, very well written and with a complex story and interesting, there wasn't a second of the movie that I was less interested, Jeremy Renner completely dominated his last scene, he really knew what he was doing, Rebecca Hall was other pleasant surprise, so overall this movie was one of the best movies in 2010.",
      "total_reactions": 0,
      "user": "FIlmsareawesome"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "Overall a great movie. A little bit slow in the first half of the movie, other than that i would have gave it a 10. Great effects and i loved the realism. Some scene of this movie gave me chills down my back. From the masks, to flash grenades. Also, Great special features.  Definitely one to pick up!",
      "total_reactions": 0,
      "user": "hamadcritics"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "Ben Affleck leads and directs an excellent cast in what can only be described as the most intelligent and grounded heist movie in a long, long time.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "Ben Affleck has made another exceptional crime movie, following up Gone Baby Gone with this gem that takes place in the town he loves so much -- Boston. Affleck directs and stars in this story about Charlestown, a Boston neighborhood where bank robbin' runs in the family. Jeremy Renner is phenomenal. Affleck himself is very very good. I didn't expect to love this movie but I loved it.",
      "total_reactions": 0,
      "user": "tallmanwriting"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "Greatest thriller of all time. I thought this movie was going to be soo bad. But once i watched this movie with Deadlybrooke i thought this was the greatest movie of all time. I watch it from time to time and it gets better every time i watch it",
      "total_reactions": 0,
      "user": "RonaldOVOXO"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "A meticulous look at bank robberies in Boston, specifically Charlestown, over the past several years. Boldly delivered performances--along with fine direction from Ben Affleck.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "Ben Affleck is continually proving himself to be a very talented director. The story is perhaps just a little too slow for my liking but I really enjoyed the chemistry between him and Jeremy Renner. Everyone pulls their weight in this slow-burning, bank robbery thriller.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "While a decent heist thriller, 'The Town' sadly isn't much more than that. When the film is concentrated on anything besides the love story between Ben Affleck and Rebecca Hall, it's pretty interesting. Sadly, the love story is anything but interesting. Most will disagree, but I found the romance to be dull and lifeless. There's a 2 and half hour extended cut of the film that, to me, only makes matters worse by extending the romance. I wanted to like the film more and hopefully get past that main gripe, but I just couldn't. Jeremy Renner steals the show here, although I really did not find his performance to be great enough to be an Oscar contender. I think. As you can tell, I find 'The Town' to be over-rated, but that doesn't mean I didn't like it, it just means that I found nothing special about it. It's good for a single viewing, but I have no real reason to see it again. 7/10 for theatrical version, 6/10 for extended cut.",
      "total_reactions": 0,
      "user": "Captain_Kirk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "This is no Departed, but Affleck, in the second film he directed as well is very good. The Town is a well-paced thriller, and is highlighted by Jeremy Renner, who is extraordinary here.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "\"The Town\" proves once again that Ben Affleck not only knows how to work in front of the camera. It's taut, brilliant, and modestly optimistic.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "So excellent! I would have loved to see this film grab the 10th Best Picture nominee slot last year...one of the best films of 2010. Ben Affleck has really turned into a great director.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "Ben Affleck has directed 3 great movies. But the last one, Argo, is definitely better. Not the most impressive ever or passionate or fun, but it´s flaw-less. This second one (The Town) is well executed, is interesting enough, but there were moments in the film when I thought it was going to be so great, but it never got there. I found the ending predictable, or at least like I´ve seen similar things in some other movies a while ago. Good film for a new director. But not one that will stick with you",
      "total_reactions": 0,
      "user": "sanyrub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "The Town is a very good thriller.  It's nearly a great one, but falls just shy of that mark.  It's extremely well acted, and I actually believe Affleck did a better job directing here than with Argo.  A noticeable tension runs through the film, mostly due to the realism of the whole thing.  You really get the feeling that this is a lived in world and not just a studio's production.  The love story dealing with Affleck's character and a hostage actually gives the movie more meaning instead of making it feel cheezy, which is a hard thing to do but it still slows down the pacing too much.  The action scenes are done with vigor and energy, which is refreshing compared to other films' usually flat time fillers.  Where the movie does fall kind of short is in its formulaic one last job scenario.  The screenplay is actually extremely well written and full of fiery dialogue exchanges and desperate situations, but it's all set in a limited frame.  I let Inception slide with its one last job cleche because it was so innovative in other areas and not affected or limited by that plot point at all.  Despite these gripes The Town is still an exhilarating, engaging, and surprisingly atmospheric crime thriller which is definitely worth buying.  It's too bad that it only got one Oscar nomination.",
      "total_reactions": 0,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "Ben Affleck shows he is a very talented director and does a strong job on screen as well.  The robbery scenes look good and Jeremy Renner is good as well.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "Before his academy award winning movie \"Argo\", Ben Affleck has created this intense crime thriller that proves that he's got what it takes to make a Bad-A** movie. It is tremendous in storytelling. Even though the love story portion is a bit strange, it still manages to work fantastically. Plus, it features a tremendous ensemble of actors such as Ben Affleck, John Hamm, Blake Lively, Rebecca Hall and of course, Jeremy Renner. They all really keep the story very well interesting and entertaining, especially Jeremy's portrayl of James Coughlin. It's also thrilling with the bank robbery scenes. God were they intense. Overall, it's a crime thrilling 21st century version of \"Heat.\"",
      "total_reactions": 0,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "All i can say is wowwww!!!!! One of the best movies of the 21st century.. i gotta say this is in my top 10 favorite movies of all time.. ben affleck has found his calling as a supreme director... i love the authenticity of this movie actually taking real life people from the streets of Charlestown and putting them in movie.. the setup w fenway park and how they take down the cathedral of boston is simply amazing! Ben affleck not only directed a gem here but he also put up an oscar wwinning performance in my opinion.. especially w the way hisaccent was.. this is a great masterpiece and shouldnt be thought of anything less",
      "total_reactions": 0,
      "user": "jpwelsh101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "I know this film got great reviews, but it just didn't do it for me. It felt like I had seen this all before (and I have! In i.e. Heat). The characters were mostly unlikable to me, and the love story hard to believe. It's not a bad film, but it's not one of my favourite heist movies and it's hardly original....",
      "total_reactions": 0,
      "user": "ypomoni"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "Riveting drama by Ben Affleck, falling only a hair short from perfection. The execution is done with a touch of sense and reality, and the style of filming and the way it jumps from scene to scene keeps your eyes glued to the screen.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "Much better than the overrated Ben Affleck's movie \"Argo\". Engrossing cliffhanger simply.",
      "total_reactions": 0,
      "user": "najlepsza"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "The Town reminds me a lot about another film named Heat from 1995 starring Robert De Niro and Al Pacino. Like Heat, The Town gives a message, that message is that heist movies are not only about explosions and guns. The Town has very nice dialogue and camera work. Great performances from Affleck, Renner, Hamm and Hall",
      "total_reactions": 0,
      "user": "heeldavid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "This movie is really well structured and the acting is really good.Jeremy Renner was probably the best of them.The story is original and the robberies are exciting.Unfortunately there is not enough action and there is too much slow moments in the movie.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "Ben Affleck did a great job on this and think he even brought his career back up from this film, not saying that because of how he did in the movie but I think he actually did because of the other films he has done and also not all about Ben Affleck but everyone did a great  job in the film. Also easy to get sucked into these characters that they build up, wasn't really unrealistic and sort of smart or cool in a way how they did some things",
      "total_reactions": 0,
      "user": "edpoopstuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "Better than your average hollywood action-crime movie but still lacking originality. Ben affleck is handsome but that's it............................",
      "total_reactions": 0,
      "user": "Jumpman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2016
      },
      "score": 8,
      "text": "WHAT I LIKED: A crime thriller with surprising depth; 'The Town' isn't just great edge-of-your-seat cops and robbers stuff - it genuinely makes you understand both sides too. That's a rare thing, and it's only possible with this mad yet successful story and script. I just love the idea behind the whole thing as it also allows for these surprisng social narratives and brilliant character interactions to come together really well. The reason the experience you have watching it is so great though is that it's all delivered so expertly, thanks to an excellent performance from Affleck behind the camera, and from his strong supporting cast in front of it.",
      "total_reactions": 0,
      "user": "BarneyOnMT"
    }
  ]
}