{
  "mc_avg_user_score": 7.9,
  "mc_metascore": 68,
  "mc_mixed_rating_frequency": 26,
  "mc_movie_name": "The Way, Way Back",
  "mc_negative_rating_frequency": 5,
  "mc_positive_rating_frequency": 162,
  "mc_pro_critic_reviews": [
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 100,
      "summary": "The jokes are often double-edged, the performances always spot-on. The Way, Way Back doesn't re-invent the teenage turning point genre, but Faxon and Rash offer a breezy new spin. You'll see more inventive movies this year but few more endearing."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 100,
      "summary": "Authenticity gives the movie its witty, heartwarming, hopeful, sentimental, searing and relatable edge. It is merciless in probing the tender spots of times like these, and tough-guy sweet in patching up the wounds."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 100,
      "summary": "It's a joyous movie, the best one I've seen in a very long time."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2013
      },
      "score": 100,
      "summary": "With his rapid-fire delivery and big heart, Rockwell makes Owen his version of “M*A*S*H”’s Hawkeye Pierce, but the film’s layers of well-observed truths go deeper than that."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 88,
      "summary": "It's funny, affecting, and appealing, and more worthy than much of what's out there. Often, coming-of-age stories rely forcefully on formulaic narrative developments but The Way Way Back remains fresh from start to finish."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 88,
      "summary": "The Way Way Back gets it wittily, thrillingly right. It turns the familiar into something bracingly fresh and funny. It makes you laugh, then breaks your heart."
    },
    {
      "critic": "Bill Zwecker",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 88,
      "summary": "Co-writers/directors Faxon and Rast have created a little gem of a film. Without question, The Way Way Back is the best coming-of-age movie of the summer and should be seen by audiences of all ages."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2013
      },
      "score": 83,
      "summary": "Co-directors Nat Faxon and Jim Rash, who won an Oscar for writing \"The Descendants,\" are smart enough to mostly stay out the way and let this talented crew bring their script to life."
    },
    {
      "critic": "Anna Smith",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2013
      },
      "score": 80,
      "summary": "This also marks what may be Allison Janney’s funniest performance to date: her cheerful, outspoken drunk next door is an absolute hoot."
    },
    {
      "critic": "Olly Richards",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2013
      },
      "score": 80,
      "summary": "A film for every age, whether you’re an awkward kid, former awkward kid or awkward kid-adjacent. Funny, real and uplifting. A film that reaffirms your belief in the human spirit."
    },
    {
      "critic": "James Mottram",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2013
      },
      "score": 80,
      "summary": "If the Collette/Carell reunion suggests Little Miss Sunshine, it’s not quite that crowd-pleasing. But, crafted with much TLC and sympathy, it’s perfectly tailored to the tongue-tied teen in us all."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 80,
      "summary": "The Way, Way Back is way, way good -- and a welcome breath of fresh air at the summertime box office."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2013
      },
      "score": 80,
      "summary": "In a movie with uniformly outstanding performances, Rockwell, as ever, is especially good. So is Carell, playing against type. But what makes The Way, Way Back stand out is Faxon and Rash’s obvious familiarity with what Duncan is going through."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 80,
      "summary": "Beautifully executed, loaded with sharp observational moments, and never cheats either its characters or its audience by descending into raunchy teen-movie cliché. This is a delicately balanced and often very funny holiday alternative suitable for pretty much the entire family."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 75,
      "summary": "Aiming for a middle path between drama and comedy, The Way Way Back is so overloaded with jokes that it could sink in the water hazard, but on the final scorecard, sure enough, it’s in the hole."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 75,
      "summary": "Sometimes you have to praise a movie backwards. In a season of clamorous action pictures, dopey comedies and grisly horrors, The Way Way Back is notable for what it doesn’t do. It doesn’t yank on your heartstrings, though you’ll be touched gently at last."
    },
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2013
      },
      "score": 75,
      "summary": "A sly, richly modulated, emotionally engaging, and brutally honest film."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 75,
      "summary": "The movie’s a minor pleasure rather than a major work. But minor pleasures have their place, especially in summertime, and at its best The Way, Way Back goes down like a popsicle on a hot July day."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 75,
      "summary": "The Way, Way Back is balanced, satisfying, wholesome. Dig in."
    },
    {
      "critic": "Ella Taylor",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 75,
      "summary": "The Way, Way Back isn't exactly memorable, and strictly speaking it would do just fine on a small screen. But unlike the glib \"The Descendants,\" which is also about, it's smart, funny and moving about human weakness."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2013
      },
      "score": 75,
      "summary": "The performances and the ready supply of one-liners make this an amusing look at a new generation getting lost down memory lane."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "There's something slightly formulaic and familiar about Nat Faxon and Jim Rash's coming-of-age film The Way, Way Back, but not enough to dampen its crowd-pleasing charm."
    },
    {
      "critic": "Cory Everett",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 75,
      "summary": "Comedy is hard all on its own, but comedy that resonates is a rare thing indeed. So it’s admirable that Rash and Faxon are continuing to head down that path they started with “The Descendants,” even if this film isn’t quite as refined."
    },
    {
      "critic": "William Goss",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 75,
      "summary": "Faxon and Rush’s screenplay doesn’t deviate too far from formula, but their sturdy direction, bolstered by handsome production values, evokes a wistful sense of carefree summers and conjures up a potent amount of simmering teenage angst beneath the frequent chuckles."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 70,
      "summary": "It is derivative and too deliberately zany, but still a heartfelt charmer."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 70,
      "summary": "Despite the familiarity of this setup, Way Back is a charmer, putting refreshingly little emphasis on Duncan's romantic needs and allowing family melodrama to erupt and simmer down without pat resolution."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 63,
      "summary": "Features one of the best endings in recent movie memory — and as we all know, endings are the hardest. If it takes some predictable twists and turns to get there, well then, accept it and move on."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 63,
      "summary": "The film's not as good as its cast, but The Way, Way Back has its moments."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 60,
      "summary": "The Way, Way Back has the charm of timelessness but also more than a touch of triteness. Its situations and feelings seem drawn more from available, sentimental ideas about adolescence than from the perceptions of any particular adolescent."
    },
    {
      "critic": "Staff [Not Credited]",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 60,
      "summary": "The Way, Way Back is a crowd-pleasing summer treat, predictable in its sweetness but satisfying all the same."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "The story of a teen desperate for a father figure who finds encouragement from a wild-and-crazy water-park employee -- rather than from the guy auditioning to be his stepdad -- can be explosively funny in parts, but overall feels pretty familiar, relying more on its cast than the material to win favor."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 58,
      "summary": "Just about everyone and everything in The Way, Way Back feels programmed, as though the film were written using Mad Libs."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 58,
      "summary": "Small touches point to a slightly better movie hiding beneath most of the routine, particularly the respectable finale that stops just short of the clichéd resolution expected of it. On the whole, however, The Way, Way Back dances to a tune we've heard too many times before."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "The coming-of-age tale The Way, Way Back is sweet, heartfelt and utterly trite and predictable from beginning to end."
    },
    {
      "critic": "Steve Davis",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "That’s the central problem with The Way, Way Back – it’s more manipulative than truthful."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "The story doesn’t feel dramatized. It feels pitched."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "Like \"Little Miss Sunshine,\" the movie stars Toni Collette and Steve Carell in a story about a dysfunctional family trip, though like \"Adventureland,\" it’s really about a teenager finding acceptance at a local theme park."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "There’s a potentially compelling story here about children of divorce and the tentative ways they set about forging their own relationships, but the filmmaking is too rudimentary to draw it out subtly."
    },
    {
      "critic": "Sam Adams",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "Even by adolescence-is-hell standards, this poor sap is the embodiment of how ugly the so-called wonder years can be for some — a painful notion that’s as close as Faxon and Rash’s directorial debut comes to evoking an emotional response that hasn’t been sifted through dozens of nigh-identical films."
    },
    {
      "critic": "Damon Wise",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "There are plenty of comic moments...But The Way, Way Back is very rarely laugh-out-loud funny.  Unfortunately, neither is it very involving."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2013
      },
      "score": 38,
      "summary": "Praises the electric carelessness of teenage angst while depicting it as if it were ultimately no more exciting, though no less pleasant, than an hour in the wave pool."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "Some movies are just meant to tell a little story and not be some big deal. That's all this was and it succeeded. If you can't relate to someone in this movie, well you live a nice life. OK, I would have given this an 8, but honest to dog, it made me cry a little. That never happens. Even the hokey predictable ending was satisfying. The story didn't spin off into some complex plot, it just moved along character-driven, illustrating the pitfalls of blending families. It's the first time I enjoyed Carell, he was believable for a change. I was so happy the kid met Rockwell, everyone needs an adult who isn't a parent.",
      "total_reactions": 2,
      "user": "Edeltraud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "So 'The Way, Way Back' was just released in England, and because I'm a huge fan of 'Little Miss Sunshine' I checked it out. I wasn't disappointed. GREAT FILM! Absolutely hilarious, it found that perfect line between comedy and sad reflection, which 'Little Miss Sunshine' did so well, you can really feel the presence of the producers in this film which if you're in doubt of whether to see this film or not should reassure you.",
      "total_reactions": 2,
      "user": "McLaughlinViews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "This movie was absolutely brilliant. It touches on your heart strings. The characters all had strong personalities except for the protagonist, which made him stand out the most. I could really feel the pain of the protagonist and the ending was fantastic. This movie is a must see.",
      "total_reactions": 1,
      "user": "Morfiss"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "The Way Way Back could have been as good as Little Miss Sunshine but manages to make you weep with great acting from Sam Rockwell, excellent screenplay which is included with masterful direction. Must watch this season- hardly, doesn't deserve to be missed.",
      "total_reactions": 1,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "One of those feel good films that everyone can relate to in some way. You can't help but feel bad for the kid sometimes and feel so overjoyed when something good happens. Basically, this movie connects you emotionally to this character and the character development is marvelous. And Sam Rockwell? I want to be his friend in real life. Brilliant.",
      "total_reactions": 1,
      "user": "JCouch777"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "Great movie! It manages to touch your emotions and make you wanna cry. The plot is interesting and makes you feel sorry for the main characters. I highly recomend people to watch this as I was emotionally touched by this movie.",
      "total_reactions": 1,
      "user": "Pomegranate23"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "A super sulky pubescent (Liam James) is stuck with his mom and her bf (Toni Collette & Steve Carell in a non-comic role) at a summer beach house. He finds fun and friendship at a local water park. The plot's familiar, so it's up to the storytelling and characters to make it special. Sam Rockwell and Allison Janney create enjoyable people, but the rest of the people aren't especially interesting. It's predictable and things take too long to happen. Except for Sam Rockwell (as the mentor), things aren't that funny or heartfelt when they do.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 0,
      "text": "There are good movies, bad movies, and movies so south of bad that I had to walk out early on. It's so much worse than terrible that it was painful to sit through the \"humor.\" I don't know whether to be more surprised that only two users rated it negative or that so many people liked it. I am certainly surprised that Andrew O'Heir gave it 80. Basically you have parents who treat their children terribly, which isn't funny, and running gags like unsuccessful lazy eye surgery that really isn't funny. Add to that the fact that Janney either has no flair for comedy or her director has no talent for comedy, or both.",
      "total_reactions": 5,
      "user": "Taplinger"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "So 'The Way, Way Back' was just released in England, and because I'm a huge fan of 'Little Miss Sunshine' I checked it out. I wasn't disappointed. GREAT FILM! Absolutely hilarious, it found that perfect line between comedy and sad reflection, which 'Little Miss Sunshine' did so well, you can really feel the presence of the producers in this film which if you're in doubt of whether to see this film or not should reassure you.",
      "total_reactions": 2,
      "user": "ZakM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "Perhaps the most beautiful film I've seen in a year. It will make you laugh, it will make you cry. It has the whole package. A great script, and not a single bad performance. Steve Carell plays the bad guy very well. Which is surprising, i didn't know he could pull it off. Sam Rockwell....well, rocks. Totally brilliant. And the rest of the cast are top-notch.",
      "total_reactions": 0,
      "user": "adhamhany"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "What most impressed me, was Steve Carrel with the role of the bad guy... With most of time facing the reality, it makes the movie be such a great experience to have. Its really amazing and worth to watch.",
      "total_reactions": 0,
      "user": "Nicholasandrew"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "While critics are always on the lookout for the next Citizen Kane  and score poorly when a film fails to come up to scratch  those who aren't paid to go to the movies are on the lookout for good entertainment for 90 minutes. This delivers.",
      "total_reactions": 0,
      "user": "GeorgeBailey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Loved every second of it. Moving film that's both warm and funny and intelligently-written. If you love coming-of-age dramas, this falls in line with this year's \"Kings of Summer\" as one of the best of the year.",
      "total_reactions": 0,
      "user": "Friskytiger81"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "Director debut from Oscar-winning writer-duo Nat Faxon and Jim Rash (THE DESCENDANTS 2011, 8/10), a diffident but sensitive 14-year-old boy Duncan (James) unwillingly spends the summer vacation with his mother Pam (Collette) and her new boyfriend Trent (Carell) in a beach house where he cannot fit in and is constantly under strains with the domineering Trent, coincidentally he forms a bond with Owen (Rockwell), a happy-go-lucky clerk in the local water land “Water Whizz”, after clandestinely takes a part-time job there, Duncan experiences the time of his life and the dreary summer does’t seem to be so unbearable.",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "I care very little about the similarities between the Way, Way Back and ever other coming-of-age story. I care only about the uniqueness of its presentation and that is where this film is able to stand out.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "The Way, Way Back is one of the best films of the year. The strength of the film is making you feel for the main character for what he is going through. It mixes comedy and emotion perfectly and gives an ending that simply is remarkable.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "Movies like this are hardly ever enlightening, but that doesn't make a difference because it is a great movie. It is a difficult to balance both comedy and drama successfully, but the film makers delivered well. Wonderful vivid supporting characters.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "I can’t believe this movie isn’t popular with the teens.",
      "total_reactions": 0,
      "user": "JrAgujaIsAGleek"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "The Way Way Back is generally your run-of-the-mill coming of age drama, but luckily, I not only love the genre, but this is a great example of the genre. Sporting a well-written script packed with drama, laughs, mild romance, charm, and just enough adolescent angst, The Way Way Back is a very well done coming of age drama. Liam Jones is great in the lead role, though often outshined by Sam Rockwell, who is absolutely impeccable here in a role that exudes charisma and charm and was truly meant for him, without question. Toni Collette, Steve Carell, and AnnaSophia Robb are also all very good in this one, though really the whole cast brings their A game. The film is well directed and well told for the most part and really has very few faults. While the romantic elements can seem cheesy and it does break no new ground, that is is not really a negative to me, as it does strike a chord at moments and makes you laugh at others. Really, I cannot ask for much else from a film. This one works from every angle.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "Sweet movie but fairly simple plot.  Seems like it takes place in a few days.  As a coming-of-age-working-at -an-amusement-park flick, Adventureland was better.",
      "total_reactions": 0,
      "user": "Burbis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Sam Rockwell absolutely shines in this hard-trying-to-be-indie movie. Much of the cast, including the gormless, charmless, expressionless 14 year old lead, struggles hard to be likeable. Steve Carrel, for the first time is the dick. And he isn't convincing. Just kind of ruins him for me. But Rockwell and his quirky, larger-than-life character does stand out from the cardboard characters and rescues an otherwise dull movie. His friendship and the way he fathers shy insecure Duncan is the genuinely heartwarming core to this movie. And it outshines the other storylines.",
      "total_reactions": 0,
      "user": "WadeVS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "I give it a 10, cause it was a real good summer movie. You can really feel for the characters situations.It`s funny, awkward, and has feel good moments.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "I love The Way, Way Back. It's the first 10/10 I'm awarding all year and for a good reason. All around the board spectacular performances, Sam Rockwell particularly shines. I loved it.",
      "total_reactions": 0,
      "user": "SimpleMethod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "Very nice little film. Good script with a heart and great character development. The whole cast does a great job but Allison Janney and Toni Collette are especially good in this. Both are actresses with a lot of experience and it shows. They are great. The main character (the teen boy) does a great job too. It is a movie with a little bit of comedy but also some really touching moments, especially towards the end and the mother´s situation. I recommend it without a doubt.",
      "total_reactions": 0,
      "user": "sanyrub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "My new favorite film of the year.  This film's got everything strong writing, strong directing, and strong acting.  The best part of this film by far is Sam Rockwell he is pin point perfect, just down right hilarious.  Similar to one of my favorite films of 2012 The Perks of Being a Wallflower, The Way Way Back is even better. A+",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "As a teenage boy myself, this film hit all the right notes for me. The cast was brilliant, and did an incredible job. Sam Rockwell especially shined as the kind of cool adult us teens look up to, who isn't as level headed as he seems. Steve Carrell was a convincing scum bag, and the scene near the end where Carrell and Rockwell meet almost broke my heart with the beautiful way Rockwell defended poor Duncan. The story was hilarious, but never unrealistic. It had its comedy gold moments, and it's bluntly truthful moments. Overall, this film had one of the strongest scripts of the summer, and it's certainly one of my favorite films of the year.",
      "total_reactions": 0,
      "user": "Chabooski"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Sweet, satisfying...and my favorite film so far this year. Liam James stars as 14-year old Duncan, who's dragged by his mother (Toni Collette) and new beau (Steve Carell) to the beach to spend the summer. Allison Janney is hysterical as the next door neighbor and Sam Rockwell is the mentor I wish I had growing up  This coming-of-age film was smart, funny and really hit home for me personally. The last 20 minutes were a misty blur. I will definitely see this film again.",
      "total_reactions": 0,
      "user": "ArtK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "Underwhelming. Allison Janney is great, as is Sam Rockwell, but I felt The Way, Way Back lacked a satisfying ending. Perhaps the filmmakers wanted to avoid a crowd-pleasing finale, but the movie is already chock-full of cliché moments. And at times it felt I was watching two different movies  one exploring the trials of divorce, and the pain of infidelity, and then another filled with teenage angst and a stereotypical coming-of-age-summer.",
      "total_reactions": 0,
      "user": "LOTR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2013
      },
      "score": 9,
      "text": "I really enjoyed this coming-of-age story.  While the story of an awkward teenager coming out of his shell thanks to the wisdom of a glorified goofball/slacker is nothing really new, writers/directors Nat Faxon and Jim Rash made the film feel fresh and unique.  The funny parts are really funny and the drama is blended perfectly to give the film a very human approach.  Add in great performances from Liam James, Steve Carell, Toni Collette and, most importantly, Sam Rockwell and you have the makings of a very endearing, very amusing movie.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "Disappointing. Sam Rockwell and Janney characters were over the top.  Didn't care about any of the characters.------------------------------------------------------",
      "total_reactions": 0,
      "user": "sirgarland"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "This movie is pretty damn good, though it certainly is not for everyone, it's a fun coming of age story.",
      "total_reactions": 0,
      "user": "lazatoy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 9,
      "text": "The Way Way Back is a wonderfully crafted coming of age story with two great teen actors and a showboat-y performance from Rockwell. While he is in all his waterpark gear and flirting with the e employees, we almost forget that he played a crazy prisoner in \"The Green Mile\". Toni Collette and Steve Carrell make up a talented supporting cast. The direction, editing, cinematography, and script are all on par to make for a very enjoyable film.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2013
      },
      "score": 9,
      "text": "\"The Way Way Back\" is a stunning film that focuses on telling the plot through subtle comments and camera angles.",
      "total_reactions": 0,
      "user": "Fortifier"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "Every performance in the film is perfect, particularly Sam Rockwell's hilarious turn as the water park manager. Rockwell is reason enough to see the film, and shouldn't be forgotten come awards time.",
      "total_reactions": 0,
      "user": "ambender"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "Nice movie,performance is very good.Nice and enjoyable movie,perfect line between comedy and a sad reflection but still not a movie too good for some awards,at the point of comedy the jokes are very clever.Its definitly worth watching.",
      "total_reactions": 0,
      "user": "Azdaja"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2014
      },
      "score": 9,
      "text": "very nice movie.. really refreshing.. the whole cast did their roles very well. and really touching and beautiful climax. really we do things to protect ourselves because we are scared.",
      "total_reactions": 0,
      "user": "vishnu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2014
      },
      "score": 9,
      "text": "One of the best movies i have ever seen. it was a movie which had a mixture of comedy, romance and adventure which really brought out the best of the movie. It really touches your heart and shows you how a shy boy like \"Duncan\" becomes someone who is confident about himself through the help of his friends.",
      "total_reactions": 0,
      "user": "waterpolodude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Either Liam James is a brilliant actor or is so naturally awkward I could just punch him in the face. Steve Carrel shows he is more then just a character to laugh at and can deliver a performance unlike any other he has done before while still being believable. Sam Rockwell made this movie wonderful along with his supporting cast and excellent writing from Nat Faxon and Jim Rash. From start to finish I enjoyed this movie even though I wanted to punch the main character in the face to toughen him up. I couldn't help but smile all the way through. i would give it an 8-8.5 but this rating system doesn't let me do decimals.",
      "total_reactions": 0,
      "user": "HonestReviews9"
    }
  ]
}