{
  "avg_user_score": 6.1,
  "metascore": 52,
  "mixed_rating_frequency": 149,
  "movie_name": "The Interview",
  "negative_rating_frequency": 136,
  "positive_rating_frequency": 331,
  "pro_critic_reviews": [
    {
      "critic": " Tess Hofmann",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2014
      },
      "score": 91,
      "summary": "Comedy is most effective when it’s taking a risk. Here, the directors took a big risk, and managed to finesse something shocking and novel out of the familiar Franco-Rogen dynamic without overplaying their hand."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2014
      },
      "score": 91,
      "summary": "The Interview is laugh out loud funny all the way through, and once again proves that Rogen and Goldberg will do anything, no matter how dark, for a big laugh, and that character is just as important as punchlines in their work."
    },
    {
      "critic": "David Ehrlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2014
      },
      "score": 80,
      "summary": "Fashioning \"The Great Dictator\" and \"Inglourious Basterds\" into a cross joint and then lighting it from both ends, Goldberg and Rogen’s second directorial effort follows the hysterically violent misadventures of idiotic talk-show host Dave Skylark (James Franco, hamming it up) and his underachieving producer, Aaron (Rogen)."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "Within the bloodshot-eye perspective of their other stoner comedies, it’s bluntly funny and ever-so-slightly sweet."
    },
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "Crazy funny."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "The North Korea scenes are often very funny, with many of the jokes coming at the expense of the fish-out-of-water visitors."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "The Interview sticks to the anything-for-a-laugh plan for nearly the entire journey, with far too many jokes about things going in and coming out of rear ends."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "It's stupid. It's in bad taste. It impossible. I know all that. Look, Quentin Tarantino killed Hitler in \"Inglourious Basterds\" and the neo-Nazis stayed quiet. It's a farce, people."
    },
    {
      "critic": "G. Allen Johnson",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "No matter what you think of dumb comedies, The Interview, thanks allegedly to Kim, has gone from disposable to indispensible cinema. It’s a must-see movie in the context of what has happened, and will spark a discussion of, in comedy, how far is too far?"
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 70,
      "summary": "If Amy Pascal loses her job over this, it will be an outrage. The only thing about which we disagree is The Interview. She hated it; I think it’s a blast."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 63,
      "summary": "Randall Park’s interpretation of Kim is dark, and darkly funny, a delusional turn with wincing, believable bits of psychoanalysis."
    },
    {
      "critic": "William Goss",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2015
      },
      "score": 60,
      "summary": "Considering how its inflammatory ambition and scattershot execution put it closer to Spies Like Us than The Great Dictator on the political comedy spectrum, The Interview should ultimately stand as the boastfully juvenile lightning rod that modern American culture deserved — no butts about it."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 60,
      "summary": "Real-life geopolitical blunders aside, The Interview generally hits its marks. And every time it does skid into juvenile idiocy — with too much scatological humor, for instance, and an overuse of “you-go-bro!” attitude — it follows it with a stride or two toward uproarious meta-satire."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2014
      },
      "score": 60,
      "summary": "Both Rogen and Franco, who have marvellous chemistry and exude good cheer, continue to tweak their personas in this very amusing, very imbecilic film."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2014
      },
      "score": 52,
      "summary": "While The Interview never slacks in its mission to tell jokes, it's such a messy and meandering movie that it never quite lands as a satire of politics or the media or anything else."
    },
    {
      "critic": "Brad Wheeler",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "Elevated to some vague level of importance, not on merit but by circumstance."
    },
    {
      "critic": "Steven Boone",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "I didn’t laugh once, but there were several lines that, in context, got a wide fool-grin out of me."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "Every once in a while, a movie is more than a movie, but it’s surprising when that becomes the case with a punk-ass comedy, one that’s more puerile than pointed yet not without some good laughs."
    },
    {
      "critic": "Bob Mondello",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "It's not a political satire, or even satire of tabloid journalism. It's just another \"bromance,\" with jokes so bad (they are) \"freshmanic.\""
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "The Interview is pretty much what everyone thought it would be before all the trouble started: a goofy, strenuously naughty, hit-and-miss farce, propelled not by any particular political ideas but by the usual spectacle of male sexual, emotional and existential confusion."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "The more desperately a comedy tries to be outrageous, the less likely it is to be outrageous -- or even just funny. And that's the fate that befalls The Interview, which offers a few moments of casual brilliance... but otherwise trips itself up in the threads of its contrived absurdity."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "Hate to say it, but this film ain’t half the satire it could have been."
    },
    {
      "critic": "Joe McGovern",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "It's a pity that the film is bereft of satiric zing, bludgeoning the laughs with a nonstop sledgehammer of bro humor."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "The joke barrage becomes hit-or-miss, as if the creators — including screenwriter Dan Stewart, working from a story by Rogen and Greenberg — don’t know or care which is which."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "An intensely sophomoric and rampantly uneven comic takedown of an easy but worrisomely unpredictable target."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "Considering the controversy and chaos Sony Pictures Studios is undergoing because of it, The Interview fails to live up to the hype, floundering as a rowdy comedy as it grows duller by the minute."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2014
      },
      "score": 42,
      "summary": "Even if the film were sharper, even if it was made by satirists on the order of Stanley Kubrick and Terry Southern in their “Dr. Strangelove” days, I would still argue that greenlighting such a film is a blunder. The exercise of free speech does not exempt one from the consequences of stupidity."
    },
    {
      "critic": "Ken McIntyre",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "Undeservedly controversial comedy lacks both laughs and nuance. The best bit they could come up with is Seth Rogen shoving a rocket up his bum."
    },
    {
      "critic": "Andrew Lapin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 40,
      "summary": "Even with a strong first half lampooning the vapidity of American news media, The Interview is the worst thing Rogen has ever done."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 38,
      "summary": "So this is the little movie that caused the big fuss. And little it is, a dopey bro-com that piddles along delivering mild laughs until it turns overly, unamusingly bloody in the climactic scenes."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2014
      },
      "score": 38,
      "summary": "It essentially uses a major global issue to cheaply dress up what is two hours of hit-and-miss erection jokes."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2014
      },
      "score": 30,
      "summary": "An alleged satire that’s about as funny as a communist food shortage, and just as protracted."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2014
      },
      "score": 20,
      "summary": "In the real world, a debate has been raging over what does and doesn’t constitute torture. In the movie world, there’s no debate; watching The Interview is torture from almost start to finish."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 11,
      "pos_reactions": 20,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "Unfortuately this is not an intelligent comedy, as they used to be. Please go back in time and watch Spies Like Us, if you want a real politically incorrect comedy. I was really annoyed by this wanna be autrageous comedy. Just skip it, save your money and time. Only the original SNL was able to make real comedies and satire.",
      "total_reactions": 31,
      "user": "ArkhamKnight"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 22,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 0,
      "text": "Cheap humor and even cheaper script. Probably the dumbest comedy I've seen in last few years. Kids may love it, but that's pretty much it. If not for all the Sony hacking fuzz, this comedy would probably be rated even bellow 5.4 score. They literally paid Eminem to show up in the film for a minute (which has nothing to do with the movie plot what so ever). As if they added Eminem just to advertise the movie. It's an insult to IQ.",
      "total_reactions": 36,
      "user": "MarkT2014"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 16,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 0,
      "text": "i was bored.  if i had a forward button i would have push it a lot of times.  sure a few scene where funny as heck but over all wait for the dvd and rent it.  i got a free ticket to it  that's the only reason i even went to see it",
      "total_reactions": 28,
      "user": "SHORTFINGER"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 18,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 0,
      "text": "If it wasn't for the Sony hack (hoax?), nobody would even care to mention this piece of ****. Dumb humor, annoying main protagonist. It's not even in the ballpark of the vicinity of the neighborhood of political satire or any satire at all for that matter. Don't waste your time!",
      "total_reactions": 32,
      "user": "urogomphi"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 15,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 0,
      "text": "OMG, the media hype got me! I was sucked in & regret it now. Thank goodness it’s over! The news hype is the only reason I saw it. Watched the clock more than the movie. It's an embarrassing disappointment to see such poor work from Hollywood--Sony must have been smoking too much pot with Rogen to think the script was at all funny. I think I chuckled 2 times. Very dissatisfied & could not wait for this movie to be over. Don't waste your money but more importantly, don't waste your time. I think Sony exaggerated the hack just to get people to watch this movie because they knew it was going to be a flop!",
      "total_reactions": 28,
      "user": "82taho"
    },
    {
      "neg_reactions": 16,
      "pos_reactions": 17,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 0,
      "text": "The hacker should have deleted this film while they had the chance. Do not watch this film thinking its my right blah blah blah, it is just a very bad movie actually the worst film i've seen this year.The film is so over hyped but it's nothing but toilet humour and retardation. kim jong un has nothing to worry about the film should never have been allowed to be produced. it's attempts at satire is poor the jokes are made for 10 year olds and Seth rogen simply plays the same character in all his films. If its yellow or red on metacritic than save yourself the money.",
      "total_reactions": 33,
      "user": "ericsea13"
    },
    {
      "neg_reactions": 21,
      "pos_reactions": 17,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "This is not a political satire. It is a satire on the media. It is about how the media appeals to our emotions to get us to feel a certain way about certain things. It is about how our opinions on certain events are mainly driven by how the media portrays them. This is a recurring idea throughout the movie, and it takes many forms. It criticizes the United States a lot more than you would think as well. The movie's screenplay deserves credit for its shrewd observations of the media and human emotions, and for its exciting story line. The opening scene, a song, is simultaneously hilarious for its lyrical content, and chilling for its disturbing social implication. In terms of comedy, there are a few clever jokes written, but the comedy, while there is a lot of it, mainly comes from the performances, especially from James Franco and Randall Park, who also both perform well in their dramatic scenes. The scene with the actual interview is one of my favorite scenes of the year. The movie deserves Oscar nominations for Franco, Park, and for the screenplay, but of course that will not happen, because the movie will be scoffed at by people who will never give it the credit it deserves simply because they will never be able to see past the fact that it is a James Franco / Seth Rogen comedy.",
      "total_reactions": 38,
      "user": "MichaelDN"
    },
    {
      "neg_reactions": 67,
      "pos_reactions": 26,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "Best movie I've ever seen in my entire life! I laughed through out the movie. James Franko and Seth Rogan are such a great team, especially when it comes to this movie.",
      "total_reactions": 93,
      "user": "SudoNoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "Most of the jokes in this movie were over the top and just meant as an insult, direct, unmasked and therefore not my type of humour. I laughed at times at some more clever things, but most of the time the movie is quite predictable and what you see is what you get.",
      "total_reactions": 2,
      "user": "Mantis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2015
      },
      "score": 5,
      "text": "Despite its initial hype concerning the actual North Korean government threatening the US because of this movie, \"The Interview\" turns out to be a major disappointment, with the buddy chemistry between Rogen and Franco failing miserably and the plot hitting a huge downfall starting from the second act.",
      "total_reactions": 2,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "I didn't find the movie to be entirely funny. Granted there are scenes here and there that were hilarious, such as the irony of Katey Perry's \"Firework\", but the movie as a whole was not funny. Rather, as a South Korean, I was offended and left me wander if this is how US sees Koreans of BOTH nations.",
      "total_reactions": 2,
      "user": "sgy0003"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "The film that almost caused the collapse of a film studio and nearly led to WWIII should really be a lot better. A TV chat show host is going to North Korea to interview Kim Jong-Un when the CIA get involved and tell him he must assassinate the leader while he is there. There are laughs to be had here but they are few and far between. As with all comedies from the Seth Rogan camp, scenes are allowed to go on way past their natural end point and it would seem most actors are told to go as BIG as possible. Worst offender here is James Franco, whose performance is nails-on-a-blackboard annoying!! In the end this is a inconsequential film that doesn't deserve the publicity that North Korea has given it, and in a years time we will all be struggling to remember what all the fuss was about",
      "total_reactions": 1,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "I wouldn't be surprised if Sony hacked themselves to help create some buzz for this stink-fest.  The controversy and the international issues it caused were much more entertaining than the actual movie itself.  Not a good film.",
      "total_reactions": 1,
      "user": "nightblade00"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "I dont know why so many people dislike this movie, its maybe because of type of humor. Yes, its childish and fart jokes etc.. But i really liked it, i like rogen humor and franco's acting, its their another typical movie. If you like them, you will like this. They hate us cause they ain't us!",
      "total_reactions": 1,
      "user": "SkillJam"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "The Interview is decent comedy that has its highs and lows while some of its jokes can be completely hilarious that your about to start crying some can fail miserably. Like me if you are a fan of other Seth Rogen and Evan Goldberg movies i have no doubt you will end up liking this movie but for me personally i thought this was a (middle of the pack) movie they've done together. I mean its not as bad as \"The Green Hornet\" or \"The Guilt Trip\" buts its not as good as films like \"Superbad\" or \"This is the End\" its like the same level as their previous movie Neighbors. James Franco was clearly the star of the movie pretty much all of the funny parts involved him while Seth took the back seat on this one and was for the most part forgettable save for a couple scenes.",
      "total_reactions": 1,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "Totally in line with most Rogen/Franco films. Mostly hilarious, a few jokes fall flat, and some questionable material. But reading the ridiculous click-bait articles about this movie \"It's racist\" \"It's sexist\" \"It makes light of North Korea\" are just click-bait. This movie is about as offensive as the Wedding Crashers. It's bawdy humor folks, grow up, Seth Rogen make a sex joke? Color me shocked.",
      "total_reactions": 1,
      "user": "TheWaffle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "Funniest movie I've seen since This Is The End. Quite possibly the comedy or top 4 movies of the year. Its must buy or rent. If you did not like Neighbors or This Is The End you probably will not like this movie",
      "total_reactions": 1,
      "user": "Red-Opposom-098"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "The Interview is exactly what you expect it to be, a Franco-Rogen comedy with little in substance or themes outside their recurring joke repertoire. Although the film restricts its use of crude teenage humour, the overall tone never really goes beyond an adolescent mind. Are James Franco and Seth Rogen funny? Yes. Did this film cross any lines in terms of political content? Not really.",
      "total_reactions": 1,
      "user": "TheFilmFanatic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "My very low expectations of this film were completely wrong. This movie is funny and it did make me laugh a lot. . Maybe not for those who like all black and white, this comedy has a lot of gray humor. Take this movie for what it is, obviously is not Shakespeare but a mature and funny comedy. I really enjoyed the film. But be aware, this is not rocket science! But who cares there are moments that are simply hilarious.",
      "total_reactions": 1,
      "user": "Batushai"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "A good movie funny nice but as much as frist of it. That might at last 20 minutes make you bored. Some times that's very stereotype but good at all. That makes you laugh. What that most of today movies can't.",
      "total_reactions": 1,
      "user": "parsa2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "Pretty damn funny in its own right, the Interview is incredibly entertaining and funny thanks to Seth Rogen and James Franco, but, unfortunately, has been overshadowed by controversy. 8/10 (Great)",
      "total_reactions": 1,
      "user": "Le__Xenomorph"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "Not the best comedy in the world must be admitted, far too many repetitive homosexual jokes in there. If this movie had not all the publicity around it, it would have flopped, but because of all the media hype (promotions) this movie will do well. I see why north korea would be unhappy, this movie really embarrasses them lol. But any more so than Scary Movies? National Lampoons? Final word: Spoof movie poor general comedy, but quite funny depications of korea leaders.",
      "total_reactions": 1,
      "user": "kevbroughton"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "This was straight up the greatest movie I've ever seen. ''The Interview'' brought some of my greatest laughs to the theater with me. Overall I would give this movie a 1000 out of 10 if I could.",
      "total_reactions": 1,
      "user": "JJDTheSaltySock"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 0,
      "text": "Once I saw Franco and Rogan on the cover I knew it was gonna just a stupid Seth Rogan movie with same ingredients: dick jokes, raciest jokes ( if you're free to talk doesn't mean your not offensive ), and an Eminem reference ( just like in Superbad and Funny guys ) the only thing that was missing was Jonah Hill",
      "total_reactions": 7,
      "user": "kobomk"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "The movie was better then what I expected it to be. had some funny parts in it. for a movie that was close to two hours. it didn't drag on, a soild 5 out of 10 stars!",
      "total_reactions": 12,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "For a film that caused a lot of havoc and controversy, I was expecting it to be a lot more humorous than it was.  I think if they made more witty jokes instead of ass jokes, then it could have been way better. It was just plain silly and trivial. I mean, if Kim Jong-Un is smart enough, he should feel like an imbecile getting so worked up about it after seeing that. Still though, it did make me laugh a few times but eh.",
      "total_reactions": 15,
      "user": "LaraR"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "I love Seth Rogan and James Franco, and I loved This is the End, but  I did not love this movie.  Something in me tells me the \"hack\" may have been a big publicity stunt to generate hype, because without all the hype, I could easily see this movie being a huge bomb.  It did have funny parts, but the plot and the humor overall was sub-par from what I expect from this team.  It seemed the anti- North Korea parts were overblown and really not needed.  Did we really need to see Kim being blown apart in slow motion, or poo himself?  Overall the publicity stunt that came with this movie was much more impressive than the movie itself.",
      "total_reactions": 5,
      "user": "athinnes"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "The Interview appeared to not be worth the controversy. This movie was funny at times but not like what I had hoped. It may be the controversy that surrounded this film that will result in its downfall. Its not the worst movie I ever saw but it certainly wasn't worth all the drama. Of course its offensive, in the beginning it appeared to be fairly non-controversial but the ending will surly offend some people. I was disappointed with James Franco in this movie, it seemed like Seth Rogen took the beat seat although he was a co-writer, but his role was tolerable. James Franco seemed like he was playing himself and it made me lose some respect for him as an actor because he was a stupid douchebag for the whole movie. Obviously Sony has lost 44 million on this movie and will likely not come close to gaining it back with the film being in a limited amount of theatres. I wanted to like this movie but to me its a bust. It wasn't worth pissing everybody off.",
      "total_reactions": 5,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "2/5★ Not since Kim Kardashian has so much been made out of so little. The Interview offers little that is truly intelligent and if you are familiar with the movies that Seth Rogen and James Franco make together then you know what to expect: vulgarity, immaturity and sophomoric humor that we feel a need to apologize for laughing at. The irony is after all the reports of the horrors of North Korea that have been given little notice, the headlines and furor caused by this stupid Hollywood film has brought more attention to the matter then anything else and if that isn't the ultimate satire and sad commentary on the world today I don't know what is.",
      "total_reactions": 5,
      "user": "reellm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2014
      },
      "score": 1,
      "text": "The movie was painful to pay 6 bucks for, and even more painful to watch. It is horribly and excruciatingly \"bro-tastic.\" I didn't even laugh until the 10-minute climax sequence, which itself was only a little funny. Long story short: this is a comedy movie aimed at the 12-15 year-old male age demographic.",
      "total_reactions": 5,
      "user": "galleyh4us"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 0,
      "text": "If you like the Family Guy formula of constant old media references and dragging out a joke for 10 minutes you might like this movie.  For those above the age of 5 however you might want to stay away from it.  I'll summarize the majority of the plot for you:  Kim Jong Un likes Katy Perry and Seth Rogen has to put something in his ass.  Those \"jokes\" easily take up 30 minutes of the movie each.  Comedy gold!",
      "total_reactions": 14,
      "user": "breathassure"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 1,
      "text": "i gave this film a 1 for the 1 time I laughed through the whole film...... this really was a bad bad and unfunny film. Think the whole hack thing was desperate PR for how bad the film was.",
      "total_reactions": 13,
      "user": "EvilPumpkinhead"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "While I strongly support free speech, I can't really recommend this movie to anyone.",
      "total_reactions": 16,
      "user": "royal_peacock"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "Decent movie, but it's not worth the money in the cinema. If you like the actors you like the movie, the humor is their trademark. But I would recommend to view it somewhere online.",
      "total_reactions": 12,
      "user": "Star_Wars"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2014
      },
      "score": 1,
      "text": "I admit that after all of the drama I really wanted to see this movie.  I didn't really expect it to be good, but what I saw may have been one of the worst and unfunniest movies of all time.  The jokes in this movie must have been written my immature 12 year olds.  I gave it a two only because it wasn't visually terrible.  The only movie I've ever shut off in the middle of it was that awful Adam Sandler Chuck and Larry movie.  I really wanted to shut this one off.  But I watched it all because of the hype.  My penis could have wrote better jokes.",
      "total_reactions": 4,
      "user": "pete409"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "Unsurprisingly, The Interview offers little more than a cheap attempt at a promising premise. As Americans, we find this subject and the subject of free speech fascinating--however, this film relies much more heavily on cheap humor than what could've been much more clever.",
      "total_reactions": 4,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "The Interview is totally superior when it comes to acting, storyline and chemistry between characters. There are much sick, funny and entertaining moments in this film, but the second act is disappointing. It’s less funny and more serious. The movie is overall less entertaining than what I expected, and that includes the ending, which could have been much funnier. There are much slow scenes, and the screenplay should have been better. But it’s still one of the films of 2014 that’s worth watching.",
      "total_reactions": 4,
      "user": "TheApplegnome"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 0,
      "text": "A dictatorship mockery has gone wrong. Even \" jack and Jill\" is a masterpiece next to the interview. A silly plot, over usage of gay jokes/ references and dodgy Korean accent. It is absolutely unfunny and insulting.",
      "total_reactions": 11,
      "user": "Sebe2012"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 0,
      "text": "Wanted to know what all the sony commotion was about.",
      "total_reactions": 14,
      "user": "Erazor"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 0,
      "text": "Think about the poor misfit kid from your public school, then imagine the bullies made a move to make fun of him and all the school watched and laughed.",
      "total_reactions": 7,
      "user": "lorne_kelly"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 1,
      "text": "Not as good as it is hyped.",
      "total_reactions": 10,
      "user": "Nobilis1984"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "Despite its overuse of trivial jokes, The Interview is an otherwise well acted and hilarious satire on both North Korean dictatorship and the American media.",
      "total_reactions": 3,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "You need to go into this movie with an immature attitude. If you do that, then I promise you then you will enjoy this movie. It has funny references to other movies, James Franco and Seth Rogen are both fantastic in the film and I absolutely adored the \"Firework\" song in the movie.",
      "total_reactions": 3,
      "user": "MelonsAndPizza"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 2,
      "text": "Ignoring the Sony hack and all the political crap associated with it, this movie was garbage. The entire plot is set up only to make North Korea look bad, not that it is unwarranted, however none of the jokes were original or actually made me laugh, they just felt forced and did not add to the humor at all. The only part that actually made me laugh was the beginning with eminem and the fight scene behind the cameras during the actual interview.",
      "total_reactions": 11,
      "user": "Melterx12"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 2,
      "text": "Foreign conflict movies used to be smart and funny; movies like Spies Like Us, MASH, Dr. Strangelove, Top Secret!, Stripes and so on but The Interview takes Kim Jong Un combined with a fart joke and makes and entire movie disguised as a media satire comedy out of it.  Really though, what would you expect from two stoners who know nothing but potty humor?  The Interview has an okay start but ends up being something in the 'worst things you have ever watched' category.  This movie extra sucks for all the negative hype it generated only for the payoff to be worth nothing.  The world is going to see this movie after all the threats that have been made and digital hacks that have been accomplished and say \"They deserved it.\"  For Seth Rogan to go on television and say that this movie wasn't created to cause controversy makes him just as idiotic as this movie was.  This movie relies on celebrity cameos and bottom of the bucket humor to keep it going, but again, we've seen the same in every other one of his movies so not sure why I expected anything different.  Only difference between this and his other 'great' works are that instead of this one being based in a frat house its based in the in the real life setting of the supreme leader of North Korea WHO just so happens to be a film buff, like his insane father, as well a hot head about global relations at the moment; so for Rogan to say nothing was intended by this movie is a total lie.  Maybe years down the road when this conflict is over, yes, but not in the heat of it.  If this fat, unfunny stoner really just made things for the world worse over a nearly unwatchable 'comedy' then I vote that it's time for this guy to go away.",
      "total_reactions": 8,
      "user": "Stevesitz"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 3,
      "text": "Sony is overestimating their work. People (and me) curious about North Korea, the most mysterious country in the world. But Sony has done one of the most rubbish propaganda film. Rogen & Franco did try their best but can help its have-no-brain script & incredibly terrible plot. W/o helps of North Korea hackers, this film will never stand even a single day in US cinemas.",
      "total_reactions": 13,
      "user": "mikhailduong"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "Kim Jong Un probably was responsible for the Sony hack. Maybe he ordered it after he saw the trailer. Then after the accusations of said hack they demanded to co-investigate or else. Things where heating up, North Korea was bringing their army in a state readiness. The keys for the nukes where already in the ignition and all battle-stations manned. WWIII was looming over Western Civilization. The end of mankind was nigh. All this probably happened while Kim was waiting for his copy of the film to arrive (on a Harddisk with a truck coz their internet was down thx to the Yankees). When he did finally see it he came to realize: this is just another stupid Seth Rogen comedy full of fart and f*ck jokes. I'm not wasting my Nukes over this! Soon after they released their statement that they didn't approve of the film's release (or any other future Seth Rogen comedies for that matter) but wouldn't retaliate. The world was safe again.",
      "total_reactions": 10,
      "user": "Apemonkey666"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 2,
      "text": "Thankfully I did not pay for this POS movie. It has only a couple of jokes and they spam these over and over. If you like jokes involving various references to genitalia and bodily functions this is the movie for you. If you have half a brain stay away.",
      "total_reactions": 5,
      "user": "raporgi"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2015
      },
      "score": 4,
      "text": "Were it not for the hack, this movie would have been an unknown bomb quietly fizziling to an early DVD release. Now, that is irony.",
      "total_reactions": 5,
      "user": "Costs1129"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "Moderately amusing.",
      "total_reactions": 7,
      "user": "tvnewsguido"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "It had some funny scenes. But overall it was meh and I don't understand all the hype. It seems like the Sony Hack(hoax) was a PR stunt for a bad movie. Offensive toilet humor, Seth Rogan is the same old typecast joker character. Don't pay money for this.",
      "total_reactions": 9,
      "user": "snorlax634"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 1,
      "text": "This is a truly terrible movie. It's boring and, unfortunately, not funny at all. The acting is poor and the plot horrendous. People will see this movie because of the hype (I did), but you should resist and pass over this movie.",
      "total_reactions": 9,
      "user": "klspindler"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "Not so bad. I wasn't expecting much so I guess I was pleasantly surprised. A decent comedy. Not sure if it's worth seeing in the theater. Will probably have a pretty good dvd release. All the hacking publicity probably actually saved the movie. I wouldn't be surprised to learn that Sony has actually created the entire hacking scenario. So not as bad as some say and definitely not a 10. Rogan is better than Franco, some good laughs.",
      "total_reactions": 13,
      "user": "04holland"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "Thoroughly impressed as usual by the chemistry between the star cast, but the North Korean side left much to be desired. There were quite a few cheap gag moments and 'bro humour' but I'd be lying if I said I didn't enjoy the hell out of them.",
      "total_reactions": 14,
      "user": "gaybaby"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "An enjoyable yet uneven comedy.  The first third of the film is as good as any comedy this year.  The middle is the weakest part as the film struggles when the C.I.A. gets involved.  The finale though does help bring back some of the laughs from the begining.  Overall the film had enough laughs to get a low 7.  B",
      "total_reactions": 12,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "Good clean fun, but and if Kim Jong Un had kept his paws off of it, it likely would have had a short life.  The laughs are underwhelming though not unfound.",
      "total_reactions": 6,
      "user": "cbe"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2015
      },
      "score": 1,
      "text": "\"The Interview\", as most everyone with a television set or newspaper knows, is the story of a plot to kill the leader of North Korea under the guise of a televison interview conducted by a US talk show host. The movie stars Seth Rogen and James Franco with support from Diana Bang, Lizzy Caplan and Randall Park. Co-directed by Mr. Rogen and Evan Goldberg and written by Dan Sterling, the movie, despite its hype and international notoriety, is simply stated, not a good film. No matter how risque or far out a plot or film may be, if it is funny it can be tolerated. This film is neither funny nor clever. It is amateurish, its humor is immature and insulting and some of its scenes contain tasteless conduct that is best characterized as just plain repulsive. More like a home movie made by people with money to pay for good sets, the film is awkward and not worth the $5.99 I paid for it on VOD. If one didn’t know better, it could be thought that the entire \"threat\" regarding the showing of the film was prompted by the producers in order to invite controversy and interest in an otherwise unworthy and poorly made film. I give it a reluctant one rating. The low quality of the movie \"wreaks for itself\".",
      "total_reactions": 4,
      "user": "BHBarry"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "This movie does not live up to Pineapple Express but it does give a few good laughs, there is also moments where you think, \"that's not funny\"., some of the content is accurate in relation to how North Korea misleads tourists with fake shopping centres and actors, to make their community look normal. Overall it's worth a watch but it's a so/so movie.",
      "total_reactions": 4,
      "user": "order"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "I did find the movie enjoyably funny, it was not the best movie, better than some movies. I feel the the hack at Sony probably bolstered the sales and hyped the movie up a bit. I don't feel the movie was ever in any real danger of not being released, but I do feel that Sony played up that end of it fairly well and as a result probably help the digital sales of the movie. I did enjoy the movie enough to give it a positive score here.",
      "total_reactions": 4,
      "user": "PsuedoYou"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "The comic chemistry between James Franco & Seth Rogen makes them one of the most enjoyable teams in movies today and this latest effort maximizes the combo. Franco (creating one of his most delightfully funny characters ever) plays a tabloid TV host who travels to North Korea with his producer (Rogen) to interview Kim Jong-un. This is the type of madcap mayhem they do so well: lots of dick/ass gags, wacky interplay, outrageous stunts and homoerotic slants. The energy never slacks and the laffs are constant. If you like screwball comedy (with a definite juvenile sensibility), you'll be very entertained.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2015
      },
      "score": 2,
      "text": "An occasionally funny trip that appears to have been written by horny, high school boys, too often just plain stupid and gross. With the absolutely worst performance by James Franco. The opening song by the little Korean girl is hilarious as are the opening talk show satire with cameos by Eminem and Rob Lowe.",
      "total_reactions": 2,
      "user": "ErichSchoe"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "Wow, after Neighbours and a few recent films from Rogen and Franco this didn't seem like much, but it gets better even when it start off and feels like an over the top wolf of wall street type flick, it never runs out of gas. It felt like it was in touch of the hands of Tarantino, the mix of violence and humour made it come off as badass. Peter Travers of Rolling Stone magazine said it best in his review, it's a farce people get over it.",
      "total_reactions": 2,
      "user": "devo-nc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "One of few comedies in recent years that had be laugh out load several times through out. It's a shame it didn't get a box office release because it would have made some serious bank. It's a hilarious comedy and a must watch for sure.",
      "total_reactions": 2,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "This movie is very funny. I wasn't sure if I was going to like it because it's made by the same people who made This is the end, which I didn't love. I did enjoy Bad Neighbours though. This movie is a great time, If you like pretty much any of these guys other movies, you are probably going to like this movie.",
      "total_reactions": 2,
      "user": "flametail23"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "Walked out!  Beyond belief bad!",
      "total_reactions": 2,
      "user": "AxeT"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "\"The Interview\" 10 Scale Rating: 4.0 (Bad) ...",
      "total_reactions": 2,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "A very funny film in my opinion, it kept me laughing throughout. The humour may prove to be a little juvenile for some peoples tastes, but those who have enjoyed Rogen's films in the past will find the Interview right up their street.",
      "total_reactions": 2,
      "user": "ant387"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "If Dumb and Dumber 2 and Blended could actually procreate during a stoner pitch session about North Korean dictatorships, this would be the pathetic result. The most cardboard dialogue, insipid dick jokes and wooden caricatures ever to make it on film, and by two people who were either out of their minds on bad ecstasy when they decided to greenlight this, or are both seriously in the declination phase of their respective careers. Not even worth watching for free!",
      "total_reactions": 2,
      "user": "larale"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "The Interview might not be as funny as we expected to be but it delivers just enough laughs and silly jokes that still makes us laugh.The Interview will be not a good film without the main actors,The Chemistry between James Franco and Seth Rogen is fantastic.",
      "total_reactions": 24,
      "user": "JohnKristofer"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "The funniest movie I have seen all week.  I agree with the chronicle review, the movie is not necessarily great on its own, but in context is definitely worth seeing and thinking about the free speech issues surrounding it.",
      "total_reactions": 9,
      "user": "foundationcitiz"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "Its a pretty fun and comedic movie especially if you like North Korean parodies . While not the best ,it is enjoyable and fun to watch . Just ignore those negative reviews (probably some N.Korean clones accounts anyways lols) .",
      "total_reactions": 9,
      "user": "Agentsmithy"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "First off, I can't understand the general negativity this movie is receiving. This is definitely the funniest, and most original mainstream comedy I have seen in years. The first 30 mins left me worried that the movie would be not great. James Franco's character is really dumb and kind of annoying, but as the story progresses, I grew to appreciate his 'lovable idiot' quality. There is a fair amount of toilet humour, which always lowers the quality of a movie if applied in heavy doses. I think that 'The Interview' tread that line very closely, but because of the overall quality of the characters, story, humour, I can abide the somewhat liberal helping of dick jokes. ​Rendall Parker, the actor who plays Kim Jong Un, does a great job and deserves juat as much credit, if not more than Rogan or Franco.",
      "total_reactions": 9,
      "user": "MovieReviewGuyd"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2014
      },
      "score": 0,
      "text": "This movie does not deserve any thoughtful review.  Total and utter rubbish.  Plot is stupid and jokes are not funny. Do not waste your time watching this movie.",
      "total_reactions": 9,
      "user": "olatrif"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 0,
      "text": "Apparently, my first review of this movie is was removed because I commented that the movie is racist and offensive to North Korean people. So, it is OK to make this kind of movie, but to comment it as offensive is censored. Great freedom of speech. By the way, move is junk and I am european citizen.",
      "total_reactions": 25,
      "user": "ratimir"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "The Interview may not live up to all the hype and attention it has been getting lately but still is a very funny movie even when some of the jokes fall flat. It's stupid, its crude and a typical Seth Rogen film.",
      "total_reactions": 23,
      "user": "csw12"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "Because, reasons.",
      "total_reactions": 14,
      "user": "V3ndetta"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "i didnt expect to give this a 7 outta 10, not a Rogen fan and i think that Franco should stick with self mutilating films.",
      "total_reactions": 7,
      "user": "lordslayer"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "If it weren't for the hacking controversy surrounding this film, it would just be a blip on the radar of averagely funny comedies that come down the pipeline. But thanks to those hackers, a movie that I would otherwise either not have seen or just put on as background noise while I did other work became the center of attention for me and my entire family (young children excluded) for two hours. I'm so glad Sony decided to release this on YouTube. It was completely worth the $6 bucks (not worth the cost of a family's night out at the movies though.)",
      "total_reactions": 7,
      "user": "kriebelr"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "Funny and crude comedy. Love the LoTR jokes made throughout the movie. Praise the supreme leader Kim Jong Un!!! A lot of people may not like seth Rogen's movies, but this one was really great.",
      "total_reactions": 22,
      "user": "KevowOfRice"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "Top film! Best movie I've ever seen last years! The Interview is absolutely hilarious with great chemistry between James Franco and Seth Rogen. Show the diffrece between South North and America.",
      "total_reactions": 15,
      "user": "Kordun"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "This movie is both good and horrible, depending on how you look at it. If you were expecting action comedy, then no. It's really not that good.",
      "total_reactions": 10,
      "user": "0-LuftWaffle-0"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "The interview comes off as kind of lazy, but in the best way. The first hour might have a lot of talking, but it is Rogen and especially Franco, who mines most of the films laughs, that make the endless banter engaging.",
      "total_reactions": 10,
      "user": "ryanneevman"
    },
    {
      "neg_reactions": 15,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "The Interview is absolutely hilarious with great chemistry between James Franco and Seth Rogen. It is worth the wait, and I am glad because it is the #1 comedy of the year.",
      "total_reactions": 24,
      "user": "HaithamB"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "I wouldn't see this movie if it was the last movie on Earth. I just have a very bad feeling that United States and North Korea are gonna go to war. I just feel it.",
      "total_reactions": 8,
      "user": "Tison"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "Really funny film, the humour written into this film is very well done. It's one of the only comedy films out there that actually makes me laugh out loud rather than just smile and think \"thanks funny\". Some people are reading into it way too much for political and actual fact accuracies causing them to be clouded with their opinion. Some aspects are a bit silly but overall a 10 out of 10 from me.",
      "total_reactions": 8,
      "user": "smithjake14"
    },
    {
      "neg_reactions": 21,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "Obviously all these fancy critics are going to say the film is bad, especially since it's a Rogen and Franco movie and Sony used a smart marketing ploy to popularise it in a way no other company has before, but all that aside, this movie is actually still bloody hilarious! Excellent pisstaking of Kim Jong Un and has quite a lot of funny scenes (Hint: If Katy Perry is playing, you're probably going to be laughing soon).",
      "total_reactions": 33,
      "user": "slicshuter"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "Very funny movie. It is funny and at the same time serious. It also sends a message about democracy and totalitarianism. Unbelievably good.",
      "total_reactions": 11,
      "user": "Ed_"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "This Movie provides every ounce of fun that this is the end brought us if not more. If you enjoyed this is the end you will leave the theatre still trembling from full body laughter",
      "total_reactions": 11,
      "user": "Borderlander"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "Funny movie; i'll have to admit this is no oscar material, but i got lots of laughs and great moments. Thanks to Sony for distribute it online. this was a great idea.",
      "total_reactions": 14,
      "user": "stejimenez"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "I wanted to see what the fuss was all about and watched this online.  If it hadn't been for all the fuss it probably wouldn't have been on my radar.  It was a good, fun movie and I enjoyed it.  Props to North Korea for probably making this film vastly more profitable than it would, otherwise, have been.",
      "total_reactions": 18,
      "user": "TheAzureDream"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "It's a fun movie, but not necessarily funny at all times. I chuckled for the most part of the movie - only a few jokes made me LOL. Franco delivers a hilarious performance, but Rogan doesn't disappoint either: their chemistry is what makes this movie fun to watch.",
      "total_reactions": 9,
      "user": "zaninif"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "\"The Interview\" is the funniest movie I have ever seen this year. I laughed through out the movie. James Franco and Seth Rogen did a very great job at this film. Even though, most of the people think that this film is a bit of a disgrace, because of the idea of North Korea nuking us, but I said that is true and total BS. Movies are made to entertain us, to give visual on the stories that most people imagined of making (even if it's a work of fiction), and Comedy is an invention that help us find humor and laugh with joy in our hearts. So, to let set the record straight here, the movie was Awesome, Funny and Engrossingly smart",
      "total_reactions": 9,
      "user": "jaystcloud926"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "A really funny movie and a very liberating one. I'm glad Sony released it, we can't let a dictator tell us what we can and cannot watch. It may not be the funniest movie of all time but it had plenty of good laughs. This may go no to be the most watched movie of all time though, considering the publicity!",
      "total_reactions": 9,
      "user": "CNpaddington"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "Just watched this movie with my friend and we laughed through the whole movie. It is HILARIOUS! A fine example of when the critics are just too boring and serious. The Rogen-Franco duo did it again and this time they even put a spotlight on a serious problem! I can warmly recommend this movie for anyone who like these guys previous movies and stuff like South Park ect. GREAT FILM! I cryed twice from laughing :'D",
      "total_reactions": 9,
      "user": "GustavS"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "Despite all the controversy behind this project, it was all worth! It may not be Rogen's funniest project, but it's filled with hilarious raunchiness that he's usually known for. James Franco steals the show, the premise is mind-boggling insane and the climax is unbelievable! It may not have been fully fleshed out in structure all the way through, but there's still a lot to enjoy in this controversial comedy! I give it an A-!",
      "total_reactions": 6,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "Well, after seeing this last night, I'm glad Sony grew a pair and decided to release it after all, because it was actually quite hilarious. Seth Rogen and Evan Goldberg (who  made their directorial debut with last year's This is the End) didn't disappoint with this one. I, along with a packed audience was laughing the whole time. Seth Rogen and James Franco are both hilarious together once again. Randall Park was also surprisingly funny as none other than Kim Jong-Un. The story was funny and great fun to watch and I understand why it created a lot of controversy. However, all I care about is that this film was fortunate enough to see the light of day and I, along with many others who were anticipating it were able to enjoy it. Overall, if you're fans of James Franco or Seth Rogen and you enjoyed their past movies (Pineapple Express, This is the End), you'll probably enjoy this one too.",
      "total_reactions": 6,
      "user": "moviemitch96"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "Many of the jokes in \"The Interview\" and much of the comedy itself is pretty \"juvenile\": poop/ass jokes, contrived LOTR & Miley Cyrus references, random dick & drug-related comedy, childish thrills/over-the-top acting, somewhat unnecessary gore, etc. 75% of the jokes are unnecessary, and admittedly only 25% of the jokes are truly NOT \"lazy\", \"cheap\", or crude. Yet this film is an OK, decent and funny comedy, around as good (a little better or worse than) other comedies. Then why is it getting mixed reception, you might ask? Well, think of it this way: all movies have certain target audiences the movie is meant for. Silent films, chick flicks, B-movies, biopic dramas, erotic XXX films, etc. These films aren't exactly meant to be enjoyed by the majority of the general public; they're most likely going to be enjoyed by a certain demographic. Likewise, \"The Interview\" is meant for a late teen/early adult public that likes R Rated comedies and satirical entertainment filled with pop-culture references (such as Family Guy or South Park). However, due to all the controversy and publicity this movie is getting (over NK's condemnation of the film and the hacks Sony has suffered from), a lot more people are seeing it than anyone could've once thought . People are seeing it to support free speech and as a sense of patriotic duty, to see WTF everyone is talking about, and to just be a part of the national buzz on the film. Now, is this a good thing for NK's current SUPREME LEADER? No. (He's kind of a mockery now--\"that fat little NK dumpling is an international joke\" according to one Metacritic user.) For freedom of speech? Debatable. For Sony? To be honest, I can't see Sony making much of a profit from online downloads and VOD purchases/rentals. But I could be wrong. Will The Interview change the way we watch movies? Maybe. Will it be the \"firework\" needed to cause a coup d'etat/revolution in NK? Who knows?",
      "total_reactions": 6,
      "user": "AGarcia732"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "It had enough gas to launch maybe not into high earth orbit but enough to reach NK..was better than I expected some funny moments the Skylark rapper interview really slapped the happy face sticker on gay media marketing manipulations..",
      "total_reactions": 6,
      "user": "AlmostFinished"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "The Interview was comedy gold and is definitely worth the price of renting and streaming on the line. The Seth Rogen/James Franco bromance has been hit and miss in the past but this movie was a definite hit. Most of the humor hinges on the absurd and the duo, especially Franco, delivers those scenes flawlessly. I also loved the supporting cast, especially Lizzy Caplan playing the attractive CIA agent and Randall Park doing a marvelous job portraying Kim Jong-un. Overall, while I know this isn't a comedy for everyone, I think a lot of people will be able to find plenty of laughs in the ridiculous plot and even more so in the hilarious way in which it unfolds.",
      "total_reactions": 3,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "Another boring, awful movie with juvenile humor expected from Seth Rogan. I am really happy to know we almost started an international war over something as stupid and awful as this. Good job America, our values are safe.",
      "total_reactions": 3,
      "user": "kuehnau"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "The Interview, upon first glance, might look like an offensive, stupid, incompetent piece of lowbrow cinema representing freedom of speech. And that's exactly what i thought it was gonna be going in. Despite the controversy and people saying it's great, I had my doubts.",
      "total_reactions": 3,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "The Interview is certainly not going to be for everyone. I'll start off by saying the comedy, while funny at parts will certainly not appeal to many people as it mainly aims at people who like Seth Rogen / James Franco films. Some of the humor in the film isn't really in context with the scene it is said in, but sometimes it still is amusing. Overall it's not really a bad movie as a lot of people say it is, but it certainly could be better done than the form that it is in now. It depends on what your personal tastes are in movies, so you should watch a scene or two from the film and see how you like it and go from there.",
      "total_reactions": 3,
      "user": "TheBaconWalrus"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "Me he reído mas de lo que pensaba. Polémica aparte, es una comedia en la línea de los últimos filmes de Rogen, si te gustan te gustará este y si no, pues no. Es algo mala al principio pero va ganando puntos conforme avanza. Algunos diálogos son muy absurdos pero divertidos. Para pasar un buen rato.",
      "total_reactions": 3,
      "user": "CPD98"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "Ok, this movie is more a STUPID comedy then a \"Social satire.\" Honestly, if you weren't expecting a Stupid, goofy movie based on its stupid, goofy premise of two likeable journalists assasinating Kim Jong, then I don't know what to tell you, *face palm* Anyway once you've realized the stupidity of this film you realize that there are different levels of stupidity and once you do that that, you will realize that if there ever is such a thing as GOOD stupidity, this movie would be a perfect examples. Not all the jokes made me laugh out loud but a good amount did and the several LOTR references made me smile. I bought this movie for $15 because I already had a good idea on how the movie would work and the type of comedy it intends on using. If you have a stupidity tolerance SIGNIFICANTLY lower than mine I would recommend that you rent the film online for $5, it'll be worth the time. :)",
      "total_reactions": 3,
      "user": "tormentor55"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "I'm so glad I didn't pay to watch this one. It's just more of the same gutter humor and shallow acting Hollywood is shoveling these days. The pigs at the trough slop it up and so they keep making more of it. To be honest, If you know anything about what life in North Korea is like, then you would realize that this film is only a shade better than making a comedy out of liberating nazi concentration camps. Distasteful, in poor judgment, and par for the course...",
      "total_reactions": 3,
      "user": "WARCHILD"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "Way better than I expected... Funny moments, the plot was executed (no pun intended) in a different manner than what I assumed. This movie had the potential to be much better if the Quentin Tarantino style ending and the teenage sex jokes were limited or even better, abandoned. The story began with the main character reflecting on the direction of his career after running into an old school mate. This is the catalyst for arranging the interview. The \"interviewer\" should have been naive versus a \"dumb blond\", the \"sexy comrade-ette\" not so cliche and the plot should have focused on media manipulation aka \"spin\" and / or \"\"who's playing who\" which was the best part of the interview.",
      "total_reactions": 3,
      "user": "netteann"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "Don't expect to be watching a Oscar worthy serious movie. This movie is meant to be fun, and silly. You have to channel your inner teenager and just have fun, If you liked pineapple express then you will enjoy this movie. I laughed and had a good time watching it.. if you have a super mature state of mind and are all serious then you will hate every second of this movie and you will hate yourself so much for watching it.. Nothing wrong with enjoying a bit of immature fun silly humor every once in a while",
      "total_reactions": 3,
      "user": "MusicMedic88"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "Awesome movie.  Easily one of Rogen/Franco's best, another quality delivery.  Anyone who can't see the humor in this movie is only seeing the basic shock humor and not the intelligence that shows up often in Rogen movies.  Acting could've been better but it's still better than Lord of the Rings.  I particularly liked the many subtle political points this comedy reveals which I think accurately depict political economics and the dilemmas individuals have within both societies.  More to think about than Hunger Games 1, that's for sure.  And the music and camera work was fantastic.",
      "total_reactions": 7,
      "user": "keemt"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "The Interview is pure hate, and I loved it. It begins with a rape joke sung to you by an eight yr old girl. Then it expands out on why Ryan Seacrest and Kim Jong Un are the same guy. There were about a dozen moments where only one person in the theatre was laughing. The room had about 25 people there and it was almost never the same person. This movie WILL offend you.  I haven't been to one of those in a while.",
      "total_reactions": 11,
      "user": "katoytoy"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "This was a decent enough film with good production values. I can see why KJU would be incensed, it's pretty insulting to him and his regime. Most other films just make oblique references to enemy world leaders but this one called him out and even though it's humor/satire you can understand why someone with KJU's ego would be torqued. Seth Rogen, as director (and actor), put this together well for the most part. There were some scenes that didn't rise above the juvenile and should've been cut but if you forgive quickly and move on then you're rewarded with richer humor and alot of gay play. And it has an explosive, action movie, feel good ending so it's a fun watch.",
      "total_reactions": 11,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "Funny movie. My whole family laughed a bunch during it!",
      "total_reactions": 11,
      "user": "fosemuz"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "Whoever thought trying to stop this movie from being shown has backfired. Now many more people will see this movie who had not planned to see it. I'm one of the ones who would have seen it anyway since I see almost any movie. The movie has some hilarious laugh out loud moments and that's why it's getting a 7. But it has more moments that just aren't funny. The funniest scenes are the ones that involve the Korean leader and the scenes showing how much they hate us. How true. Their suffering makes them hate us for our prosperity. If anything comes from this movie, I hope his people wake up to what a horrible leader he is and overthrow him. Trying to stop this movie has only resulted in magnifying the N Korean leader's deficiencies. No wonder someone wanted the movie stopped, so I'm glad they figured out how to distribute this movie. Now let's see what happens. A war fought via Internet is so much better than a war fought with soldiers.",
      "total_reactions": 15,
      "user": "ledaumas"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "It was actually a lot better than what I expected. perfect 10 to balance out all the **** reviews.Filler to meet character minFiller to meet character min",
      "total_reactions": 4,
      "user": "Luxangel7"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "There once comes a movie that stirrs up major controversy, but ultimately ends up being an okay film. Such words can be said for Seth Rogen and Evan Goldberg's The Interview. This raunchy comedy pokes fun at the supreme leader of North Korea, Kim Jong Un. The story is basically,  James Franco plays Dave Skylark, an interviewer whose show Kim Jong Un loves. Also tied to this man is Aaron Rappaport played by Seth Rogen who is the show's producer. Okay, this movie had major hacking stuff and North Korea hacking our Xboxes but seriously, its not that bad. Yes it has racial jokes that might offend some people,  but its funny I have to admit. The film's story falls flat during the end, and it gets boring during scenes. But its all good and Randall park as Kim Jong Un is epic. I thought that this was an okay bro comedy. Watch it if you like raunchy comedies or are just fans.",
      "total_reactions": 4,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "Cruel, racist, unfunny and awkward. The Interview shows a very inappropriate message, disrespectful dialog and it was poorly directed, poorly acted and poorly written. This movie should not have been made in the first place. It should be banned from theaters, online, app stores and from the shelves in stores. I thought Batman and Robin was the worst",
      "total_reactions": 4,
      "user": "TheLatinoCritic"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "This move is a fun time. Anybody who says this movie is garage obviously didn't see the movie. This is a comedy people why are you expecting some amazing plot? This movie will make you laugh throughout the whole movie! this is something many comedies forget about in the second half. Good movie overall theirs one scene i really love when james and seth get off  the plan in Pyongyang james made a little speech at the end of the speech james said ko neichi wah this was so funny because thats a Chinese statement. His ignorance was really funny.",
      "total_reactions": 18,
      "user": "danthebro"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "Meh, its okay. I mean, I watched it because i enjoy satire, and this is satire. Within the first few minutes, the movie is making fun of social minutes, the news, and North Korea, and I respect that. But it just kinda slowly falls apart into a dumb flick that I wish had ended sooner then it did. Should you watch it? Sure, its streaming on YouTube for $6 and I got a few laughs outta it. Is it good?No.",
      "total_reactions": 5,
      "user": "Garfoodle"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "This movie is basically Pineapple Express. If you like stupid jokes then it's for you. They only lightly touch on the north korean brutality though, so points off for missing a big opportunity.",
      "total_reactions": 17,
      "user": "Lokathor"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "Randall Park gives a superb comedic performance. His scenes with Franco work perfectly and are hilarious. Its a screwball comedy. No reason to read more into it than that.",
      "total_reactions": 6,
      "user": "Proteus"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "Seth Rogan is always reliably funny, but it is James Franco's eccentric character that really adds on the laughs. As far as comedies go, this is probably the funniest one I have seen this year.",
      "total_reactions": 6,
      "user": "Trev29"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "Takes the absurd, R-rated comedy genre into some controversial new territory. So much so that thanks to the movie's plot about the assassination of Kim Jon-Un it almost looked like this film wasn't going to be released. Thankfully it was as this is often a hilarious comedy.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "This movie deserved to cause all that controversy, but I still hoped it would be released. It was not a funny movie at all, but it was still entertaining somehow. That's all I'll say: unfunny toilet humor, but still managed to be a fun film to watch, kinda like the Hangover 3.",
      "total_reactions": 1,
      "user": "Mattyice"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "Ah yes, The Interview. Unless you live under a rock with no access to news you probably heard everything about it. A movie surrounded by so much bs that I simply had to see for myself what the fuss is about. Well, as it turns out, not much. A decent average movie. It is certainly one of the better comedies released this year but thats about it..",
      "total_reactions": 2,
      "user": "Tessara_Vejgan"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "Clearly not the \"important\" film that overzealous patriots are claiming it to be, \"The Interview\" is still an amusing enough watch and will be well liked by fans of Seth and James.",
      "total_reactions": 2,
      "user": "manofthemoon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "It's the typical Seth Rogen/James Franco shtick. If you like that sorta thing, you'll like this movie. If you don't then you'll laugh at this movie's bizarre, yet controversial premise.",
      "total_reactions": 1,
      "user": "ThatCooperGuy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "The Interview, while funny throughout is plagued by awful writing regarding Skylark. The character completely took me and my friends out of the movie, and were it not for him, the straight man characters could likely have held up much better.",
      "total_reactions": 1,
      "user": "melongod"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2015
      },
      "score": 3,
      "text": "since i haven't seen it and judging from the comments of everyone this is one i will definietly pass",
      "total_reactions": 1,
      "user": "eldavidson"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "The Interview is what you would come to expect of a Seth Rogen movie, nothing more nothing less. Though not as good as his other directorial effort, This is the End, The Interview has its quotable lines and of course genius cameos. The Interview will bring out laughs from those who tend to laugh at a Seth Rogen film. I would be surprised if someone was surprised by The Interview.",
      "total_reactions": 2,
      "user": "ajarias96"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "The is by far the WORST movie ever made. I wounder what got into Sony's minds that drove them to produce such idiotic, stupid, talent-less, horrendous film. I recommend that you absolutely do NOT see this film.",
      "total_reactions": 1,
      "user": "Thebossman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2015
      },
      "score": 9,
      "text": "The chemistry between James Franco and Seth Rogen is so good in this movie.Their chemistry is almost as good as Channing Tatum and Jonah Hill in the Jump street  franchise.This movie is hilarious it's got really great performances and once you see it you will understand why it has garnerd controversy.",
      "total_reactions": 1,
      "user": "Latingamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "Really really weak movie and I'm totally tired of Rogan and Franco.  Its got all their usual stuff, party scenes set to rap music white boys like, I love you man bits, Seth Rogan sex scene nobody wants or finds funny, really horrible I'm so wasted acting but oddly a lack of the usually weed jokes but they may have just run out of those or maybe its an international film thing.",
      "total_reactions": 0,
      "user": "mustard_tiger"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "Like most have said, an okay movie, not great, not a classic, and it will be easily forgotten within a year, even with the media hype. It was absolutely a Franco/Rogan love letter to each other with Rogan flying a little bit higher, but not by much.",
      "total_reactions": 0,
      "user": "Rtheom"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "No film in the history of cinema has had more press than the Interview. It almost started a war and made world headlines for almost a week, still it lost money, and is considered to be one of the biggest flops in recent history. In The Interview, the hottest duo in comedy, Seth Rogan and James Franco team up for their third feature film together. This time the pair play a TV talk show host and his producer respectively. Their show is like a combination of Maury and TMZ, and is considered by most in the media to be a joke. Wanting to change that image, the team decide to get in contact with the reclusive leader of North Korea, Kim Jong Un, for his first televised interview. Once announced, the duo is contacted by the CIA, who wishes to recruit them to take Un out. The first time I saw Rogan and Franco together was in Pineapple Express, and I thought it was one of the funniest films I'd ever seen. They have terrific chemistry and I expected great things from them in the future. It might have something to do with the fact that their characters are always so similar, but the more I've seen them together, the less impressed I've been. Seth Rogan is kind of annoying to begin with, especially that chuckle of his, but it's usual balanced out by Franco's extreme behavior. In the Interview, this dynamic didn't work, as Franco's character and portrayal was even more annoying than Rogan's. The cameos may have been impressive and so was all the attention this film received, but the truth is that many of the jokes were amateurish, and the film was a giant step back from Pineapple Express. When people work together, especially comedic duos, the films are supposed to keep getting funnier and more outrageous, but Rogan and Franco seem to be going the other way. The Interview isn't a great story and it isn't that funny, in fact, it's more frustrating than anything else. I love both Seth Rogan and James Franco, they've both given me hours of quality entertainment, but sadly enough, I can't add the Interview to that list, as it's bark was much worse than it's bite.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2015
      },
      "score": 2,
      "text": "Imagine if North Korea depicted Americans as overconsuming imperialists with no hearts who only care about pleasure. Would it be funny? Maybe, depends on comedic talent. Would it be tasteless? Not more than The Interview, in which North Korea is depicted as a country to be corrected by two murderous journalists. I liked the jokes, but overall the concept is a tasteless disaster, and the sort of 'medicine' Americans would hate to taste themselves.",
      "total_reactions": 0,
      "user": "mrnice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "If you like the James Franco Pineapple Express sense of humor you will really like this movie. I thought it had an interesting plot and definitely had some very funny lines that will be classics. Like when the CIA shows up at their house after they had a party. James Franco owns his narcissism better than almost anyone else.",
      "total_reactions": 0,
      "user": "khaleesi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "This movie definitely has it's funny moments but it has an equal number of so-so moments. Although overall pretty good it definitely was not worth the controversy that it caused.",
      "total_reactions": 0,
      "user": "moonman1994"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "The Interview is positively the most stupid espionage movie ever made. But if you can not take it seriously, as it certainly isn't supposed to, the surprisingly good plot filled with plot twists and the humor will keep you entertained throughout the movie.",
      "total_reactions": 0,
      "user": "mmrventricle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Absolutely hilarious, they nail every stereotype so precisely, especially with such tropes in american television nowadays. An overall, silly, controversial comedy that had me in stitches",
      "total_reactions": 0,
      "user": "TrilobiteG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "The interview is a movie which I like to call the poor man's Pineapple Express. The movie is a stereotypical stoner movie with very stupid and easy to spot jokes and conclusions. Such as a character talks about their \"stank\" member and continues to talk about it even when shushed by his friend in front of a all business no jokes type of character. The movie does stir up a couple laughs from me but it is hard to recommend when some of the jokes just fall flat and are left there to let it sit in with you. The only surprise the movie gave was the fact that the protagonist Dave skylark did not get with the good looking cia agent. The only risk this movie takes is taking a shot at North Korea. Overall the movie is alright, if you are feeling \"patriotic\" and want to stick it to North Korea then go watch this movie. However it is a movie that can be forgotten and the movie would not have been remembered if it wasn't for the controversy.",
      "total_reactions": 0,
      "user": "arcangel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "This movie is so funny, it is amazing, the small brow-american jokes were hilarious in this one, every one of them on the spot, on time, without been too gross. and then again that is depends on your personal scale.",
      "total_reactions": 0,
      "user": "ozzsoffy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2016
      },
      "score": 0,
      "text": "Easily one of the worst movies containing James Franco and Seth Rogan that I have ever seen. If it wasn't for the Sony hack, this film would have gone nowhere. I wouldn't be surprised if Sony paid to have this movie hacked just to give it some publicity, its cheap comedy with a cheap script that seems like it was written by Adam Sandler after \"Jack and Jill\" flopped. I'm so glad that I didn't pay for this movie, it was that awful.",
      "total_reactions": 0,
      "user": "bfoore90"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "One of the best comedies I have seen. Satirical humour about today's media. Gross out humour that is way over the edge. Great script and cast....amazing. If you are a fan of comedies I recommend this movie.",
      "total_reactions": 0,
      "user": "Chowda"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "Not a big Seth Rogen fan, but this was pretty good for simple laughs.  It made me laugh a lot.  The sensationalism around the release made me watch it, but its probably the best Seth Rogen film I've seen.",
      "total_reactions": 0,
      "user": "Zenzukai"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "The Interview es una película de comedia que si bien no es tan superficial, resulta bastante divertida y entretenida y eficaz.",
      "total_reactions": 0,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "the Interview can be best summed up as having a terrible beginning, an ok middle and a completely ridiculous end. this is very lowbrow humour trying to disguise itself as political satire and i think it would have been better in the hands of writers like Matt Stone and Trey Parker who have more experience in this field. Seth Rogan is pretty good but i really don't warm to James Franco in this role and if it wasn't for the controversy I think the film would feel kind of being in poor taste and probably be forgotten.",
      "total_reactions": 0,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "If you watch this movie you absolutely have to have an open mind. It is awesome, and hilarious from the beginning to the end. It just isn't that kind of fancy super high quality stuff, it is a movie designed with the one and only purpose of being ridiculous, and it does that really well. It has a lot of stupid jokes, it's always exciting, and if you only want to be entertained, without really questioning the art, this movie is for you. The performances by both of the main actors are excellent, also the one by Randall Park as Kim Jong Un, and all the theme about North Korea is very original and very much to appreciate. It is a real shame that people will not be able to watch this in there.",
      "total_reactions": 0,
      "user": "Dokalu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "An acceptable comedy with a good amount of laughs and a fairly interesting plot that will most likely entertain you for the running time. I was honestly surprised to find it was 2 hours long.",
      "total_reactions": 0,
      "user": "Dodenkyshen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Overall a very good, enjoyable and funny movie. The movie got a bit more boring in the middle, still enjoyable though. I do not understand the many bad reviews the film gets, this film really doesn't suit you, nor does any other kind of sarcasm. The entire cinema i was in in Germany laughed at 80% of the funny things. 8/10 because of the sometimes bad translation as well as the middle part",
      "total_reactions": 0,
      "user": "iSynthesis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 2,
      "text": "This movie... I really wanted to like it! I thought that maybe it could be a movie that is perfect at what it wants to be... But no. What I got was a movie with jokes so low, that I can kind of understand why someone might be mad that he was shown in this movie, even though you can way overreact as we saw lately in the news. I think that this movie missed its target and became a abomination of comedy which is at such a low joke line that you ask yourself if it could get any worse.",
      "total_reactions": 0,
      "user": "SchalgdenKumpel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "Worst movie I have ever seen. Stupid plot, bad acting and lame jokes. It was my fault for not watching the trailer or reading the reviews as I assumed that because it was about North Korea it was going to be an intelligent piece of work/documentary. My ignorance led to me sitting through excruciating torture in the cinema. Thankfully I fell asleep half way through!",
      "total_reactions": 0,
      "user": "agir002"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "The fact that a movie is made to enhance the freedom of expression is admirable and filmmakers’ bravery to make a movie about the most isolated country is to be praised. Although a heroic act is making the movie, it lacks typical elements of an award winning comedy. Instead of using typical elements of fantasy or comedy, the filmmakers overuse sexual satires which makes the movie more a commercial one than a movie of art.",
      "total_reactions": 0,
      "user": "Armin_Abbasi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "It's what I expected with these two guys. Dick jokes and a lot crude content. It doesn't mean I hate it or love it. But it was just a refreshing childish action-packed comedy that kept me laughing for hours. But it did have some Jokes that kept me with a serious face.",
      "total_reactions": 0,
      "user": "DavidV293"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Geez North Korean these no need for violence, it's only a freaking movie. What do you expect from the writer (Seth Rogen) the man who writes dick jokes and other dirty humor in his movies?.",
      "total_reactions": 0,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "I guess it speaks volumes that it took me so long to view this \"movie\"! Let's start with the fact that I like comedies when they employ more than goofiness for laughs. This movie is for kids, people stoned out of their gourd; (Rogen, Goldberg, and Franco), and anyone with a  predisposition for laughing hysterically without cause. For me, if you have to search for humor in something purported to be comedy the creators lost their way. You can find plenty reviews describing plot details and hysterical scenes, but not here. I couldn't sit through it to the end, so I really don't know when or if it ever got funny.",
      "total_reactions": 0,
      "user": "Eizozy_uno"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "I can't believe we as the America public made such a big deal about a harmless, terrible, crude, and irrelevant film. It's funny at points, but not nearly worth how much hype we all gave it.",
      "total_reactions": 0,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2017
      },
      "score": 7,
      "text": "Comedy has been known to be the most subjective, controversial and risk-taking genre, depending on what it is you are satirizing. When it involves politics, especially a controversial political figure, you are putting your reputation, and in this case, life (as well as many others) at risk. 'The Interview' finds Seth Rogen and James Franco in their most ambitious premise yet. Franco plays a hotshot entertainment host named Dave Skylark, whose show mostly revolves around interviewing big-name celebrities (we see Eminem making a cameo) as they reveal some of their hidden secrets (apparently, Eminem is gay!). Rogen plays Skylark's best friend and producer, Aaron Rapaport, who grows concerned for the show after hearing that it isn't intelligent enough television, especially when there are other bigger stories out there that are worth telling to the world, rather than a celebrity coming out of the closet. It's shocking news, but it shouldn't be classified as \"news\". One day, CIA Agent Lacey (Lizzy Caplan) meets up with Skylark and Rapaport to discuss some secret task. Dave is told he must interview North Korea's Kim-Jong Un (a very charismatic Randall Park), but he must also \"take him out\", in other words, kill the controversial figure, then everyone should be at peace. Both guys seem unsure about this, but at the same time, this would do well for their show, as they won't be interviewing big-name celebrities with shallow gossip. This is a political figure they will be dealing with, and it could be the most important interview for their show. This movie stirred up so much controversy as it led to the hacks of Sony Pictures, not to mention that several theaters pulled the movie from release, meaning that it can only be watched on VOD, or elsewhere on the internet. In other words, Sony took a big gamble funding this movie, and its writers and directors, Seth Rogen and Evan Goldberg, were ballsy enough to even come up with this idea. Mixing propaganda and comedy is not unusual, look at what happened when the great Charlie Chaplin made 'The Great Dictator' (1940) which was a massive parody on Adolf Hitler, who was a huge threat at the time. More often than not, I give credit to Rogen and Goldberg for having the guts to come up with such a risky premise, possibly aware of how controversial it was going to be. Although, I can't imagine they saw the hacks coming, leading to such an extent. The film is very funny from time to time, Rogen and Franco, once again, share terrific chemistry as bromantic buddies. Randall Park is electrifying as Kim, and the film does stay on track for the most part. There are times where the film tries too hard to be the typical Seth Rogen style, pot smoking, penis joking, party hard and swearing at every minute comedy. But, if you've seen a few of his other films... this shouldn't surprise you. The jokes do get old after the first half-an-hour or so.",
      "total_reactions": 0,
      "user": "MrMovieBuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 2,
      "text": "I don't know were to start. I will just say the movie is BAD. The Interview had such a bad comedic theme, made no sense and I did not even finish watching it.",
      "total_reactions": 0,
      "user": "kf62w6"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2015
      },
      "score": 8,
      "text": "HAHAA sometimes the best humor these days is the ridiculous, crude, unintelligent kind.",
      "total_reactions": 0,
      "user": "acaiberry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2016
      },
      "score": 9,
      "text": "This movie is amazing! But is a creeper. I watched it the 1st time and hated it, was so annoyed by it. But for some reason I watched the dvd again because I love \"seth & james\" together. I love the way they interact. The second time I watched everything clicked. I loved the cast and all the inside jokes. \"you honey dicking\" F-ing awesome! Lets talk about eminem in the opening, \"hector bisexually reck your rectum\" lol. James franco is really good in this role and delivers a very halirous performance. Seth plays the strait guys role sort of but is amazing too. I really had a blast watching this. So many funny moments. Its a movie the more you watch it the more you notice, things you missed the 1st time. Highly recommended.",
      "total_reactions": 0,
      "user": "stevedfld"
    }
  ]
}