{
  "avg_user_score": 4.9,
  "metascore": 21,
  "mixed_rating_frequency": 11,
  "movie_name": "The Angriest Man in Brooklyn",
  "negative_rating_frequency": 12,
  "positive_rating_frequency": 9,
  "pro_critic_reviews": [
    {
      "critic": "Jesse Hassenger",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2014
      },
      "score": 33,
      "summary": "As broad as Williams goes in these scenes, it’s not really his fault. He’s acting out a screenplay, credited to Daniel Taplitz, that’s peppered with bad writerly flourishes."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2014
      },
      "score": 30,
      "summary": "Though much of the script borders on unbearable, compounded by “Juno” composer Mateo Messina’s tell-you-how-to-feel score, writer Daniel Taplitz manages to sneak in some poignant self-help aphorisms here and there."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2014
      },
      "score": 30,
      "summary": "The silliness of the conceit is far from the biggest problem in a picture that has no clue what to do with the wealth of talent in front of the camera."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 30,
      "summary": "Performance aside, the film never quite manages to figure out what it’s actually about."
    },
    {
      "critic": "Nicolas Rapold",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 30,
      "summary": "The movie is predictably sentimental at its root, but it’s also meant to be comedy, partly resting on Mr. Williams’s energetic but failed attempt to play a jerk."
    },
    {
      "critic": "Jen Chaney",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2014
      },
      "score": 30,
      "summary": "The movie plays out like an improbably plotted work of overly aggressive schmaltz."
    },
    {
      "critic": "Calum Marsh",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2014
      },
      "score": 30,
      "summary": "Much has changed in the two decades since the release of Joel Schumacher's Falling Down, but, as The Angriest Man in Brooklyn flatly reminds us, the grievances of America's petulant middle-class men apparently have not."
    },
    {
      "critic": "Glenn Kenny",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 25,
      "summary": "It all leads up to some very bad green-screen work depicting a dangerous traipse around the Brooklyn Bridge, and reaches a sort of epiphany with a view of a floating carousel. Yes. It is very much that kind of movie."
    },
    {
      "critic": "Drew Hunt",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 25,
      "summary": "Robin Williams once again proves he can insufferably crank the energy to 11 without batting an eye, only this time his frenzied comic demeanor is replaced with equally harried contempt."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2014
      },
      "score": 25,
      "summary": "The jovial, hyperverbal comic has played against type before, but his presence feels like epic miscasting in this underwritten dramedy."
    },
    {
      "critic": "Matthew Kassel",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2014
      },
      "score": 25,
      "summary": "Mr. Williams’ performance is so grating that you may find yourself more infuriated than amused."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 20,
      "summary": "The movie doesn't even need five minutes to signal that it's already a goner."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 20,
      "summary": "Phil Alden Robinson’s overheated dramedy feels disconnected from reality in every emotional way."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "What the critics say about the writing are correct.  However, the cast with a surprisingly, brave cameo by a beloved actor elevate the weak material into something watchable.",
      "total_reactions": 1,
      "user": "JPLV"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2014
      },
      "score": 5,
      "text": "There's an interesting idea at it's core, but it's material ends up feeling too cheap and dull. Especially for the likes of Dinklage, Williams (R.I.P.), and even Kunis. It's their performances that keep the movie from totally feeling like it should have been a straight to DVD release.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2014
      },
      "score": 1,
      "text": "The Angriest Man in Brooklyn made us angry for wasting our time watching this appallingly lousy film which is in bad taste throughout.  It is not a comedy since there are no laughs.  It is not a drama, there is none.  It is loaded with offensive, foul language which serves no purpose.  The point of the film might have been to live life to the fullest. It did not come near making that point properly.  On the contrary, it made the point that one would be better off never to watch such horrible mess of a film.",
      "total_reactions": 1,
      "user": "arterifell"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "This was/is Robin's non-comedy Masterpiece.",
      "total_reactions": 1,
      "user": "SmarterThanYou"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "This was awesome, perfect part played by Robin an Opus Magnum in reflection of his passing away.  I believe this is a part which allowed him to share how he really felt even to the point of ending his life at the Brooklyn Bridge. The movie is a message and there is method in the madness",
      "total_reactions": 1,
      "user": "tRICKmr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2014
      },
      "score": 0,
      "text": "Very bad writing, one dimensional characters, and a huge pile of over acting. Not worth a second of anyone's time. I pity anyone that took part in this film, and I shun the writer and the director.",
      "total_reactions": 0,
      "user": "lilkillpappy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "It was a remake of the Israeli movie 'Mar Baum'. Kind of incorrect to call it a comedy movie when it is a dark comedy. Enjoyments from both the genres are different. You know it was one of the last movies of the legendary actor Robin Williams. That was not the reason for me to like it. The story begins to build on a silly reason, but it was a partially unique concept. Opens like a regular comedy and then turn over to the actual meaning for the contents it deals. Like the cancer theme movies it gets emotional in the later parts. There's no twists, but convinces the effort they had tried to end it on a high note. Sadly, it kind of depicts the actual life incident of Robin Williams. It is a great loss, I grew up watching 'Jumanji' and 'Flubber' and definitely he's going to live forever through his movies.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2015
      },
      "score": 1,
      "text": "As one of Robin Williams last film credits, I really REALLY tried to like this movie. The writing in this movie is all over the place and at times it can be difficult to determine what the films message ultimately is. Not to mention that the casting of Williams is totally wrong. I almost think the film would have played out a lot better if Dinklage and Williams had switched places.",
      "total_reactions": 0,
      "user": "Urby"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2014
      },
      "score": 3,
      "text": "The Angriest Man in Brooklyn isn't that unique nor so original, instead it is a heartwarming movie that reflects the importance of families, friends and how your actions change others' feelings towards you. So it this type of movie, a 78 minutes of those messages, some giggles, but excellent performances. Nothing extraordinary, but typical and forgettable.",
      "total_reactions": 0,
      "user": "MovieReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 3,
      "text": "\"The Angriest Man in Brooklyn\" 10 Scale Rating: 3.5 (Bad) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "This movie has an alright plot which is watchable. It is listed as a comedy but it isn't really a comedic matter, though I did find the jokes funny. At times it can be boring but the acting makes the watcher want to keep watching.  No where near one of robins best movies.",
      "total_reactions": 0,
      "user": "Shedegg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "I am not going to mistake this for a classic.  The writing was not the best.  The acting was overdone at times.  But, the movie succeeds where it may have intended.  It made me miss my dad and it put a tear in my eye.  So, I give it probably double points for that alone.",
      "total_reactions": 0,
      "user": "MrAllan337"
    }
  ]
}