{
  "mc_avg_user_score": 6.7,
  "mc_metascore": 61,
  "mc_mixed_rating_frequency": 52,
  "mc_movie_name": "The Karate Kid",
  "mc_negative_rating_frequency": 37,
  "mc_positive_rating_frequency": 150,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "\"The Karate Kid\" is a pretty good remake of the 1980's version. Jackie Chan is always cool, but unfortunately he is the only person that handles the movie wisely. Don't expect anything from Smith's kid.",
      "total_reactions": 9,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "\"I Was Ultimately Shocked by this Compelling remake , tho running 2 and a half hours , the violence is toned up for a PG movie , but this movie is one of the many feel-good movies of the year , and i enjoyed almost Every second\" .. A-",
      "total_reactions": 2,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "This movie is a great remake of an awesome movie. It paves a decent story and has a pretty good set of characters. The film changes the background of the original, and does it well. The choice of using kids instead of teenagers wasn't good, and makes the movie slightly takes a downside turn. This movie is great otherwise and is very underrated.",
      "total_reactions": 2,
      "user": "Jboy2468"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "In probably one of the biggest reversal of expectations I've had for a movie for a while, I really liked the new 'Karate Kid.' It was similar enough to the 1984 original to conjure nostalgia, but carried its own charm that really made it worthwhile to see. At 140 minutes the movie is long (especially for now when most people complain when a movie is more than 2 hours), but it uses the running time wisely - both to give depth to Dre's character, and do something that summer blockbusters rarely so these days: build anticipation.",
      "total_reactions": 1,
      "user": "ryancarroll88"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "I've never watched any of the Karate Kid movies, but I have heard that they made a remake of the original. So, I got it on dvd for christmas almost three months ago. I watched it once and I really liked it. The character development was amazing, The actors were amazing, The music score from James Horner has heart and emotion, and the Jaden Smith and Jackie Chan make a great screening team in this awesome and powerful remake.",
      "total_reactions": 1,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "Another great movie. I haven't seen the original version from 80s, but judging by the other reviews it's a great remake. I can't see why anyone would watch the movie because of Smith's kid, since this one is worth watching for Jackie Chan.",
      "total_reactions": 1,
      "user": "iAGR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "I loved it! I did not think it would be so good. Loved the story, and I think the kids a great actor! Most of the people who hate it, are just mad about a child hood movie being redone. It`s good enough to watch again!",
      "total_reactions": 1,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Favorable over the original.",
      "total_reactions": 1,
      "user": "sil3nt_nick"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "Jaden Smith's first star vehicle The Karate Kid (the movie was sold out since the 11:15am show when I saw it) and....wow. I was truly impressed as I only went in with modest expectations. Not only was it a very good remake, it's the best movie so far this summer, and it stands on it's own two feet and surpasses the original in a lot of ways (which one is better will probably be generational. From the standing ovation these kids at the theater I attended gave this film I'm pretty sure from 15 or so on down, it will be this one.) But first off, let me start by saying this: To anyone who doubts that Jaden Smith can act (which he ironically already proved in The Pursuit of Happyness), is a star, or deserved this movie: See The Karate Kid. I don't care how you see it. Pirated. Bootleg. Or the old fashion way (like I saw it cause I'm cool like that) by buying a frickin' ticket and sitting in an auditorium with a bunch of cheering 10 year olds (I swear I've never seen kids give a movie a damn near standing ovation like they did during this film's finale). Jaden Smith has just silenced his haters. From here on out, if you don't like Jaden Smith: fine. Whatever petty reason you've given yourself to make you not like an innocent 10 year old. Fine. But you can't say he's not talented. Cause he is. If nothing has proven it to you before, THIS will. He carries the film on his little shoulders, shows leading man qualities (has a 10 year old ever done that?!?!? And Im being serious here). Has a ten year old ever acted in a film and not only carried it but possessed the charm, charisma, quick wit, comedic timing, dramatic presence and physicality of a hero all in the same movie?!?!? I shutter to think, I couldn't think of any leaving the theater. If they have, please point them out to me so I can say bravo to them to. His performance was truly great and the fact that he did all of his own stunts and clearly learned kung fu and looks not only believable but in command of the craft is some sort of a mini-miracle. This little dude is miniature Will Smith of the highest caliber. He WILL be a star (pun, intended). Only thing can stop that is, well, him. Barring any personal issues, the kid will go far. Very far. He has it all. And as cliche as it may sound the biggest development to come out of the Karate Kid is that \"A Star is Born\". Don't believe me: watch it for yourself. But I digress, I only spent so much time on the Jaden issue because all the unwarranted hatred thrown his way is beyond disturbing. I have never seen such vitriolic speech directed towards a kid in my life. Not even the kid from Problem Child and he was a certified a-hole! But anyway, the movie is good. Jackie Chan was surprisingly really good (and I mean really really good like Oscar-nominee good) in a dramatic turn as Dre Parker's mentor. The action was better than the original's and the heart and soul was just as engaging and entertaining. Though lacking the iconic \"wax on, wax off\"-moment what they do with \"jacket on, jacket off\" was truly surprising and pretty good stuff when you realize what Mr. Han was really teaching him. Instead of the \"Crane Kick\" we do have another pose and it's pretty damn good too. To me, the original will always be special. I remember Daniel-son, and Mr. Miyagi is a fuggin' legend in every sense of the word. I'm actually utterly surprised this remake was so well made and engaging. Even though every one in the theater knew the outcome, everyone was still cheering and/or elated and moved by the movies \"big moments\". That in itself is pretty impressive. It's like if people were still surprised even though they knew who the killer(s) were in Scream 4 before seeing it. Could you imagine that? Yea, I couldn't either. Which is why I'm surprised at how good this remake was.",
      "total_reactions": 3,
      "user": "Huey_Freeman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 4,
      "text": "The original Karate Kid is not necessarily a classic in my eyes, but it is a film that I remember watching it as a child.  So I was not too ecstatic watching it except for the fact Jackie Chan was in it, someone who actually has knowledge of martial arts. The film does an adequate job in recreating the \"classic\" film with its somewhat altered story of the cliched \"boy gets girl\" and \"boy gets revenge.\" But what makes this film from being a good movie is the age of the characters.  While I am not saying Jaden Smith, son of Will Smith, is an unsuited actor, but the age of the children is too young to be effective.  Is a 10 year old vengeance really valid, or is it just an act of impulse?  What made the original movie lovable was that the audience connected with the main character and ended up rooting for him. It is kind of difficult when the person you are cheering for is fighting for simply a frivolous rivalry.",
      "total_reactions": 2,
      "user": "RyanGee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "sexy beast movie id like to have sex with it jayden is soooooooooooooooooooooooooooooooooooooooo   hhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhooooooooooooooooooooooooooooooooooooooootttttttttttttt",
      "total_reactions": 2,
      "user": "GRFSisawesome"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "I don't know if it's because i set my \"mental karate movie bar\" to low, or because it is actually a good movie but i liked it.  The plot was interesting and the actors played very well, Jaden Smith showing that he has much potential in the acting career and Jackie Chan, being more serious than funny this time, pulled it off and gave a great performance.  Good movie.",
      "total_reactions": 1,
      "user": "Razv"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2011
      },
      "score": 4,
      "text": "Will Smith's son cannot act. This movie takes away all meaning from the original and blows it up with special effects and horrible acting. If you loved the orginal, you will hate this!",
      "total_reactions": 2,
      "user": "Iqbal"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2010
      },
      "score": 3,
      "text": "Jackie Chan was great in all of his scenes. Jaden Smith was passable, especially considering how young he is.  But what ruined this movie for me was Dre's horrible, ineffective mother.  She spends much of the movie being tempermental, abrasive, and neglectful of her son.  She often has no idea where he is, letting him wander around on his own and get in trouble in a new country they know nothing about.  She  is oblivous to his problems for much of the movie and spends the final act cheering as her young son is kicked and punched in mortal combat while other kids are getting beat senseless.  She manages to look hesitant after he is seriously injured and then continues to fight, but shows no sign of objecting.  In our last view of her at the end of the movie, she's paying more attention to the trophy than to her own son who is still injured and limping around the platform.  Someone call family services!",
      "total_reactions": 2,
      "user": "UnpopularTruth"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2010
      },
      "score": 3,
      "text": "I didn't enjoy the film very much. It was predictable and boring most of the time. Watching this I felt as if I were a very little child again, it's so childish. Don't watch this as a sensible adult.",
      "total_reactions": 1,
      "user": "Florian"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2010
      },
      "score": 6,
      "text": "All in all this remake of the 1984 hit is not nearly as good as the original, but doesnâ",
      "total_reactions": 1,
      "user": "Duke"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 1,
      "text": "This movie could have been a really good movie if they didn't use the title of Karate Kid and if they didn't use Will Smith's son.",
      "total_reactions": 3,
      "user": "digitalbeachbum"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "horrible. a 12 year old kid moving to china from america is unrealistic. the chinese education system would kill anyone raised in american education system. the plot is also cliche  some guy comes to china,he gets bullied,a kung fu teacher magically pops up and teaches him karate(??? karate isn't kung fu derps nor is it chinese or japanese),he uses the karate to kick the bully's ass.",
      "total_reactions": 1,
      "user": "georgez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2011
      },
      "score": 6,
      "text": "movie was good. i say good not best because of the boring first half. nearly initial 40 minutes has been wasted without getting involved in the script. the next 20 minutes was beginning to pick the momentum. but again movie went on slow side. the last 30 minutes was amazingly surprising. climax was amazing. jackie chan and jade smith on screen chemistry was perfect as a teacher and student especially after the car scene, where jade picks up jackie and training begins. good in parts and boring first half. you can watch the movie for second half.",
      "total_reactions": 0,
      "user": "sreekiran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "If you had never saw the original, then this would have been an even better movie than the 8 I am giving it.  Granted, it was predictable, but still done really well.  Jaden Smith is a very talented actor, and does a tremendous job in this film.",
      "total_reactions": 0,
      "user": "pete409"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "The highest praise, in my opinion, for the new Karate Kid movie would be that it will make this generation's youth as enthused about martial arts as its predecessor. And thus, such praise is in fact appropriate and well-deserved. Very well acted and beautifully directed. Can't wait to own the DVD.",
      "total_reactions": 0,
      "user": "AaronM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2010
      },
      "score": 8,
      "text": "Jackie Chan as never seen before. The movie is not really about Kung-fu, but the interactions and the filming perspective. There's a particular scene where I defy someone, following the movie, not to have a tear or two well up. I found it appropriate for children to view on several layers. It has a more believable plot than the original, plus it's not as annoying.",
      "total_reactions": 0,
      "user": "Aedman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "Remakes are always a touchy subject. Especially when it is done with a movie people cherish and love like \"The Karate Kid.\" When I heard that it was going to be remade, I was personally excited because I didn't grow up with the original \"Karate Kid\" movie. I can see however how it might upset some people that someone is messing with one of their childhood memories. I must admit though, I did have mixed feelings when I found out who would be playing the lead roles. I was excited to hear that Jackie Chan was playing Mr. Miyagi, but I was a little worried when I heard that Jaden Smith would be taking on the role of Daniel-san.",
      "total_reactions": 0,
      "user": "PYRiAH"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "The new Karate Kid movie is just as good as the original,  while I thought that having Jaden Smith curse was uncalled for, and some of the things they added were cheesy, it's still a great movie.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "The Karate Kid reboot is a surprisingly great film full of color, meaning and heart. The Chinese location also adds a nice travel-porn element to the proceedings as well. The Karate Kid is superior to the original in pretty much every way.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "The movie was very good. But I still think the original was better because to be honest, they imitated every single thing that happened in the original. But it's still a great movie.",
      "total_reactions": 0,
      "user": "MichaelD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "Finally and at least for me, thiz is the best Jackie Chan acting of all time, especially in Hollywood movies. Commonly, he always performed comical elements into his characters. But on thiz one, he turned successfully into deep and serious character. I think Jackie also realize he cannot depend on his martial arts forever (since SHINJUKU INCIDENT (2009)), considering his age which is 56 thiz year. Yes, it is still using the same formula. It is what we saw on THE KARATE KID quadrilogy (1984-1994). In the other hand, the Casts are amazing, to put Will Smith son, Jaden Smith to become the disciple and Jackie Chan as the master. It is spectacularly ingenious combination. Beside of that, the setting in China was exotic and wonderful. They kept the famous title, but actually it is all about Kung Fu. I did not understand why most of critics underestimated thiz movie. What I observe, everything is already maximized. The plot was the same, but the atmosphere was renew and absolutely refreshing. The movie is not just fills with great action scenes but also thoughtful life philosophies inside. -Life will knock us down,.. But we can choose to get back up- is definitely will be one of the memorable quotes. It is not Jaden Smith best performance, but what amazed me is how his attitude and body language looks similar to his father on some moments. The scene stealers are two chinese kids around Dre character (Smith). First one is a girl who becomes Dre lovely friend, Meiying (Wenwen Han) and Cheng (Zhenwei Wang) as Dre furious foe who appears with firm performance. I will watch closely what development may comes to thiz potential young Action Actor in coming years. The film directed by Harald Zwart, The Dutch Director, nothing is special on him. In fact, many of his directing was corny and typical children movies, such as: AGENT CODY BANKS (2003) and THE PINK PANTHER 2 (2009). In thiz case, it is exactly what we need to make thiz new Karate Kid. In thiz movie, the story telling has detailed chronology. As a consequence, the film duration is practically a little bit long. But every scene, every character, and every action was fantastic. It wont bore us at all. Bcoz everything is Kung Fu!",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "Although I haven't seen the original Karate Kid, I loved this one. It's full of action, love, and interesting facts about Kung Fu that make me want to learn more about it. Its long, but the pacing is great, I felt like this was going to be like Avatar where the start and the end would be great, but the middle would be boring, that doesn't happen here, the entertainment is throughout in the Karate Kid. The experienced  I had with this movie couldn't have been experienced by someone who watched the original, because by the end of the film, I didn't know who was going to win the final fight, and I found myself really in the moment, and at that point I realized what a great film this is. Add Heart and a great story with great music, sound effects, special effects, and all of that, this makes for one hell of a movie",
      "total_reactions": 0,
      "user": "Jdude1006"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "A remake of such a popular film as the original 'Karate Kid' is risky business, but luckily this 2010 edition actually surpasses it, and probably the most ingenius thing about it, was the casting of Jaden Smith in the leading role. He is a charming, sympathetic, funny and charismatic young guy, and throughout the film he actually shows some good acting chops too. The film is perfect in its approach to the material, as it doesn't take itself too seriously and all of the more mellow scenes are done with a good balance. One of the most entertaining films of 2010!",
      "total_reactions": 0,
      "user": "Einardur"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2011
      },
      "score": 9,
      "text": "dsfbffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffff",
      "total_reactions": 0,
      "user": "stakan_kefira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "A good job updating a movie that was never a classic but was an iconic movie of the 80's, The fight scenes are more believable and arguably it is Jackie Chans best role.",
      "total_reactions": 0,
      "user": "rotku"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2012
      },
      "score": 1,
      "text": "A terrible movie with terrible acting, an obscure plot, a horrible soundtrack and a whole lot of dreadful karate. The original one is way better than this one..........",
      "total_reactions": 0,
      "user": "aaronpaul121"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "As it is turning out, 2010's almost a nice year for remakes (Predator. The Crazies). But when I first heard of the remaking of Karate Kid, I dissed it off almost completely. I mean, does the John Avildsen classic need a makeover when the 1984 film itself is so iconic? Can we really like the changes (wax to jacket, white kid to black kid, Pat Morita to Jackie Chan) and call it a standalone remake? Will Jackie Chan give a strong supporting role? Is Jaden Smith going to give a performance that'll mark his name in the Young Hollywood A-list? Will it show off fighting scenes that could match the original's? Will there be tweeny kissing scenes (eww)? Is it going to be inspirational? Is Lady Gaga included in the soundtrack? The answer to all these, my friends, is yes.",
      "total_reactions": 0,
      "user": "itz_giological"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "I'll be honest, I was expecting this to be a waste of my time. i was pleasantly surprised. there are some moments of awfully wooden acting from side characters, but overall a well planned and executed movie. I enjoyed watching the film and I would recommend this film to anyone who wanted a good film.",
      "total_reactions": 0,
      "user": "MrCinnamon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "It's safe to assume that People who gave this film a mixed or negative review have obviously compared it to the original Karate Kid. The original Karate Kid is a classic and it is way better than this Version, I won't deny that, but I still love this Film. People expectations are too high for this film. No remake or reboot is going to replace the original Karate.",
      "total_reactions": 0,
      "user": "Chrislake94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "(I'll preface this by saying I have NOT seen the original).  Karate Kid, more correctly called Kung-fu Kid, was a fun, attention-holding and, at some points, surprisingly deep film that uses Jackie Chan and Jaden Smith to the fullest it possibly could.",
      "total_reactions": 0,
      "user": "CRL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "The 2010 version of THE KARATE KID was a fairly decent way to re-imagine the 1984 classic--with an African-American tween, in China, with Jackie Chan.",
      "total_reactions": 0,
      "user": "Spielberg00"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2011
      },
      "score": 2,
      "text": "I was a little surprised when I heard that Columbia were making a reboot of the Karate Kid series set in China, and so, being someone who never watched the series as a kid, thought I'd indulge myself when it screened on HBO OnDemand. It was terrible. Coming as someone who grew up at an age where films for younger audiences actually had some semblance of meaning and purpose, the Karate Kid struck me as nothing short of a cheap thrill created for no other purpose than to create a big bang at the box office. With a plot riddled with cliches, and stir together a cast of characters with as little emotional depth as a canker-riddled prostitute in a gay bar, the Karate Kid is the epitome of everything wrong with the generation of children we have today. Parents who have children at home, do yourself a favor and do not bother watching this film.",
      "total_reactions": 0,
      "user": "boisson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "They did the best job possible to try and make this into a good remake of the older Karate Kid movies, and it succeeds for the most part, because the story was handled pretty well.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Not having watched the original, I found this film entertaining and has a good winning spirit. The casting was great: Jaden Smith was excellent at his role, and surprisingly works really well with Jackie Chan.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "A well-acted family film that falls down and gets back up far too many times to be believable.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2014
      },
      "score": 5,
      "text": "The average remake of a classic, the new \"Karate Kid\" is less exciting and entertaining and more Jaden Smith trying to get his shoe in the door. See it if your kids want to, but not for yourself.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "The original 80's flick was heartwarming, this remake is in china and has one terrible actor Jaden Smith. I did not believe his acting, the only person who saves this movie is Jackie Chan. It's cliche'd and it copies off of the original scene to scene. Grade C",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "Film çok güzel sadece okul sahnesi biraz az çocuk eğitime başlayınca ilk arkadaşı bidaha film'de gözükmüyor Bilmiyorum ama İnallah 2. film çıkar",
      "total_reactions": 0,
      "user": "canyigiterol"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "It doesn't have any kind of originality, but \"The Karate Kid\" still brings a satisfying update on the original while also delivers some decent performances from its cast.",
      "total_reactions": 0,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "Filme muito bem feito e muito bem dirigido. Pegou o melhor de Jaden Smith na atuação e mandou ver. Jackie Chan também fez uma ótima atuação, assim como os outros.",
      "total_reactions": 0,
      "user": "f3l1p3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "It SHOULD have been called the Kung Fu Kid. It's not even Karate!!!! And the casting was a little silly with Dre Parker's love interest (Awkward for a 12 year old anyways) was obviously too old for him. Jaden Smith was 11 in the making of this and his female love interest, Wenwen Han was 15 for most of it. I just couldn't buy them together, or even in the same grade for that matter.",
      "total_reactions": 0,
      "user": "commish_guy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "I have to say it followed the typical kid becoming something story plot. Boy moves to new place, meets girl, then bully. That being said, maybe I'm just too picky about remakes or maybe its too high of a shoe to fill.",
      "total_reactions": 0,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2015
      },
      "score": 9,
      "text": "Absolutely touching movie almost made me cry at times. The karate was done very well, and the acting was also very impressive. At 2 hrs. 20 min, the film feels so short and I want to watch Jaden Smith and Jackie Chan make another movie together.",
      "total_reactions": 0,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "The Karate Kid was an amazing movie of 1984 , in 2010 , was slightly exciting, but surprisingly, also certainly entertaining, good job of Jackie Chan and Jaden Smith.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "it is pretty meh most of it is not that good.But the tournament battles were entertaining and helped make the movie a bit better then just a terrible remake.",
      "total_reactions": 0,
      "user": "Jollyjoe1000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2016
      },
      "score": 0,
      "text": "On 'The Island Of Completely Unnecessary Remakes' there is a shrine for this film where the others go to pay homage.",
      "total_reactions": 0,
      "user": "YorkMan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "It deserves to be renamed because karate is not a Chinese origin. That's Kung Fu.... despite the erroneous mistakes, this Karate Kid does what it does to live up to the original.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2016
      },
      "score": 5,
      "text": "The Karate Kid [2010] is undoubtedly has the push towards a family movie watching evening with the popcorn and the coke, if one puts his/her nostalgic feel aside. it's a brand new movie, so there is no reason to compare it with the earlier versions other than the name which is absolutely irrelevant with the film [cliche cliche cliche]. It followed the skeleton of the movie from 1984 also, but in the end it never mattered a great deal.",
      "total_reactions": 0,
      "user": "bardhanjoy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2016
      },
      "score": 7,
      "text": "This movie is good but I have 2 problems that I can't get over it.The problems are that this movie got some scenes that are stupid and just boring.But this movie is funny,awesome and got good action.So I am giving this film a 7.3/10",
      "total_reactions": 0,
      "user": "shadowguy654"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2016
      },
      "score": 8,
      "text": "Karate Kid overall is a good film. I like the casting choices, I think young Jaden Smith did a good job with the role. The story is also good and overall its just fun to watch.",
      "total_reactions": 0,
      "user": "MasterRiley"
    }
  ]
}