{
  "mc_avg_user_score": 6.4,
  "mc_metascore": 54,
  "mc_mixed_rating_frequency": 49,
  "mc_movie_name": "The Men Who Stare at Goats",
  "mc_negative_rating_frequency": 35,
  "mc_positive_rating_frequency": 92,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "Apparently based more in fact than you might believe, this movie is by turns satirical, amusing and poignant. An original indie with a great cast. Clooney and Bridges do not disappoint",
      "total_reactions": 1,
      "user": "tonyGreen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "I really don't understand why people hated this movie. It's hysterical! Clever, dry and flat-out nonsensical. Fantastic cast and extremely entertaining.",
      "total_reactions": 1,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 4,
      "text": "The cast and premise are great, but the scriptwriting falls flat.  It should have been much funnier, but it was well acted and had some good moments.  You can't help feeling that the talent was largely wated.",
      "total_reactions": 1,
      "user": "billanschell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "I liked it and was touched by this story about beliefs, like winning a war with love instead of violence, the movie made â",
      "total_reactions": 0,
      "user": "arakaki77"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "A trippy movie that manages to be funny as hell while making very little sense. That's how I would sum up this movie, but then, it wouldn't be entirely fair; the beginning and the middle of the film were very good, but the end made me frown a lot - while laughing or grinning like a fool. I wasn't sure about the motivation of the characters, really, or the big picture behind it all, but I guess I'll get it one day. Or not.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "The critics may have been a touch harsh here, but generally, I cannot fault them too hard here, as this one is pretty middling as an overall film. Pretty funny at times, The Men Who Stare at Goats manages to be a satire that takes itself a touch too seriously and goes a little too deep into the \"bad weird\" territory for me, in that it goes weird, but is not funny in doing so, just weird. At those moments, this one is off-putting. However, luckily, the moments where it is some quality satire and quite funny outnumber them. Also in the \"pro\" corner for this one is the great cast. I really liked George Clooney and Ewan McGregor here. Jeff Bridges and Kevin Spacey were not quite as good, but still turned in assured performances here. Ultimately, the moments where this one struggles mightily is when it takes itself too seriously and thinks it is being truly profound. As I said, these moments are not many when compared to the strong scenes, but those strong scenes are also short of being great. Overall, this one is an above average film that hits \"pretty good\" territory at moments, but is largely middle of the road.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2014
      },
      "score": 9,
      "text": "A little gem, as crazy as poignant!! You enjoy every minute !! Ewan McGregor and George Clooney give us a fantastic duo, full of surprises, emotion and, mostly, laughs... A good reflection on the importance given to our faith. I love this parallel between the wacky humour's side, and the serious side, at the end of the movie... Yes, after all, we all need Jedi Knights !!",
      "total_reactions": 0,
      "user": "Harmonic"
    }
  ]
}