{
  "mc_avg_user_score": 7.8,
  "mc_metascore": 73,
  "mc_mixed_rating_frequency": 102,
  "mc_movie_name": "The Hangover",
  "mc_negative_rating_frequency": 90,
  "mc_positive_rating_frequency": 736,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "This movie is brilliant. I think one of the stupidest movie in the world, but it makes me laugh and has a great cast with actors appreciable and estimable! Great film!",
      "total_reactions": 1,
      "user": "Zula"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Great movie! extremelly true and funny! Very funny, I would say! Will recommend! People who think this movie is not good, I think they should watch The Box...(Cameron Diaz). After that, they will appreciate it a lot more and realize that the money spent on making the move has not been wasted!",
      "total_reactions": 15,
      "user": "makakus"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2011
      },
      "score": 2,
      "text": "I sometimes wonder if i just watched the same movie as everyone else...it was quite possibly the worst film i have seen in years. dumbed down jokes, repeated scenes, terrible acting and poor storyline. I'm guessing it appeals to people who have been in this situation......",
      "total_reactions": 6,
      "user": "badbrush"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "The Hangover is one of the best \"straight-out\" comedies in the last decade! It is not the 'intelligent' type of comedy, such as \"Lost in Translation\" or \"Sideways,\" but it's a crowd-pleaser!! The hilarious screenplay is just perfectly written and, quite frankly, though the situations are completely insane, they seem rather believable in the film. The cast is also rather good, so overall it is a great comedy that will make you laugh harder than the vast majority of comedies out there, nowadays! Great film!",
      "total_reactions": 3,
      "user": "smijatov"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "\"The Hangover\" is a brazenly brainless comedy that doesn't know what its doing. But guess what; that's why its funny.",
      "total_reactions": 8,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2011
      },
      "score": 5,
      "text": "I wanted to like it, I really did.",
      "total_reactions": 7,
      "user": "Boosemo12"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 0,
      "text": "This is the most overrated mess known to man. Someone seriously needs to explain the Hype cause I dont get it. Its Stupid, Not funny at all. over rated to the fullest.",
      "total_reactions": 15,
      "user": "Cazatuz"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2010
      },
      "score": 2,
      "text": "It shows how bad the movies are for THE HANGOVER to get this score. This movie sucks so bad I shut if off in the middle. I couldn't take it anymore. What were you all smoking when you went to see it? Crack?",
      "total_reactions": 8,
      "user": "zig16"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 1,
      "text": "Take the movie Dude Where's My Car, remove the plot, cast and humor.",
      "total_reactions": 6,
      "user": "Leinad177"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2012
      },
      "score": 3,
      "text": "This movie barley ever made me laugh. The plot line was terrible, all the humor was childish and the characters were annoying. If you like movie plots were people get drunk wake up in the morning not remembering anything with stupid obvious humor though out  be my guest. This movie is an example of why all the other countries hate us.",
      "total_reactions": 6,
      "user": "7dogguy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 0,
      "text": "if you saw the previews, you saw the movie. it's obvious the guy who wrote it had a few funny ideas about all the funny things that can happen when your drunk and decided to make it into a movie. the movie is basically getting from funny moment A to funny moment B.",
      "total_reactions": 2,
      "user": "jbobbyjon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "'The Hangover' is one of those buddy comedy films where you have to stop asking questions, grab a bucket of buttery popcorn, sit back and enjoy the ride. Character development is virtually non-existent and not everything is correctly wrapped up and explained by the end of the movie. Regardless this is a truly funny feature. The unpredictably and random events are what I'm sure most people will highly appreciate. The lack of a proper narrative is fine and although some people might be put off by the nudity I thought it was brilliantly amusing",
      "total_reactions": 2,
      "user": "eTurkey"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2011
      },
      "score": 3,
      "text": "I just didn't get it. Everyone kept telling me The Hangover is the funniest movie of the decade so I expected the funniest movie of the decade. I didn't get it. The movie had it's funny moments and it certainly is a quote-able movie, but I didn't think it was anything remarkable.",
      "total_reactions": 5,
      "user": "savannahrummel"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 2,
      "text": "This movie is just bad. The jokes are simple and cheesy, the whole \"plot\" of this movie is about friends who go to Vegas (just like everyone else has for the longest time). after a night they cant remember the guy who is getting married is lost and the rest of the movie is spent trying to find him. If you like simple stupid movies like those who have will ferrel in them then you'll like this movie. If not then skip it and see something alot better.",
      "total_reactions": 5,
      "user": "Psyco6"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 4,
      "text": "After the movie, I felt drowsy.",
      "total_reactions": 3,
      "user": "TheGorilla"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2011
      },
      "score": 2,
      "text": "I like JoelZ's response below \"no particaular scene really stands out, just brilliant from start to finish.\" Usually when something is **** brilliant, you can at least pick one stand out scene, my man. One long cliche for the McDonalds public. Enjoy!",
      "total_reactions": 3,
      "user": "Scraper"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2011
      },
      "score": 4,
      "text": "Yeah in parts it was funny but by the time I watched it all my friends had told me it was amazing and the hype was just that hype. The film was predictable and if I watched it more than once I would probably give up after about 20 minutes because I would realise how bad it was the first time round.",
      "total_reactions": 3,
      "user": "Toby023"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2011
      },
      "score": 0,
      "text": "This is the first comedy I watched where I did not laugh once. Not once, I am serious. What is the problem with this movie ? First of all, it is very obvious that these guys are not friends, but just actors working together. There is not the slighest feel of a real bond between these guys. They never act like friends, they never talk like friends. Then, each one of the main characters is a cliche, at its worst. The nerd, the fat guy, the handsome guy, and the reliable dreamgroom.",
      "total_reactions": 7,
      "user": "Nazgulero"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "Sadly the film lacks a huge amount of heart, but where it lacks in that category it makes up for in tons of laughs, fantastic performances, and originality. I give this movie 73%.",
      "total_reactions": 4,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "its been along time since i seen a comedy that gave me a good laugh . the hangover turned out to be the first one in a long time to do so. its jokes can be clever , rediculas and ruanchy but pulls them off pretty well. after waching it 3 times which i dont think ive done for any commedy since the wedding crashers i can still get a few laughs out of it . its a solid commedy in years where every other one is very predictable or about as funny as waching a door close .",
      "total_reactions": 2,
      "user": "ArkonBlade"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "Are you kidding me?How can you not like this movie.Every part of this movie is amazing and funny.I have been waiting for a movie like this to come out for years.This is the kind of movie you can watch over and over again and relate to it in one way or another.I hope they make a sequel cause it's set up were it can have a great sequel.Great movie!",
      "total_reactions": 1,
      "user": "Jobadkins"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "There are plenty of great moments in this raunchy comedy and it's definitely the funniest movie of the 2009, combining abdsurdity and vulgarity like I have never seen before.Still, I also feel like it relies too heavily on shock value to induce a response from the audience rather than actual substance (though I'll feel that way about any movie that feels the need to show an old man's ass crack for no reason). It's not brilliant but it definitely gets the job done, and then some.",
      "total_reactions": 1,
      "user": "ryancarroll88"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "I agree with my sweet heart husband, This movie was and still very deep, If you talk about real this movie real than real, trust this word and believe it.Just watch with more focus because every part relate the other and never never change your mined to watch it, watch this movie over and over because  very grate movie. I give this movie 10",
      "total_reactions": 2,
      "user": "Lamyaaadkins"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "One of my favorite comedies of all time. Purely for entertainment. Not a kids movie whatsoever.",
      "total_reactions": 1,
      "user": "DualRadius"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "LOVED IT!!!! Can't wait for the 2nd one to come out because I enjoyed the whole story and 'Alan' is a hoot!! I watch this movie again and again. Hope the 2nd is just as good OR better!!!",
      "total_reactions": 1,
      "user": "gofigure"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "This was one of those movies I had little expectation walking into. It turned out to be hilarious. Now I have this urge to go to Las Vegas. The second part to hangover just sucked so this first installment really gets its thumbs up!",
      "total_reactions": 1,
      "user": "kingshahid"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "It's a good movie, there's no denying that, but it just didn't meet the expectations set by my friends and some of the reviews I read. I'm not the kind of guy who is too critical on comedy movies, but I just didn't find this THAT funny. Some jokes were forced, and some plot elements were just stupid and unfunny. However, the movie did have a lot of extremely memorable and hilarious quotes, and Alan is a hilarious character. The plot is kinda dumb, but obviously it isn't meant to be taken seriously, so who cares? I'd recommend seeing it with friends, and it's definitely worth watching.",
      "total_reactions": 1,
      "user": "MagmaWalrus"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "Quite Frankly one of funniest movies since Knocked Up. And newcomer Zach Galifianakis Steals the show. Though it has its flaws the movie simply cant be missed.",
      "total_reactions": 2,
      "user": "Stephchan1901"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "This is a great \"Vegas\" movie.  It has its share of laughs and very well-done sequences, with a bit of humor for everyone, though it specializes in the vulgar.  The main reason I truly like this movie is because it is a comedy that doesn't sacrifice the plot for cheap jokes.  The story is well-done and well-presented, and makes the viewer care, or at least wonder, about how it is going to end.  Unless you have a very dirty sense of humor, it won't be hysterical by any stretch of the imagination, but the quality acting and script delivers both laughs and a story.",
      "total_reactions": 1,
      "user": "BoySamusMetroid"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "The Hangover is a story about...Do I really need to tell you the plot to this film? I'm sure you could work it out from the title, as well as from this review The Hangover is probably the funniest movie to come out during the 2009 movie season. The laughs flow out naturally, be it from the main four cast members, from characters who appear one time (the cops especially) or just from a random reveal (wait for the valet to return, and wait for them to open the trunk) Not everything is revealed (Where did the chicken come from?) and some suspension of disbelief is required (Mike Tyson has no guards to stop three men taking his tiger?) but trust me, this film leaves you in stitches so many times and is so fun, you won't care. Oh, and once you've finished watching this movie, stick around during the credits where you'll get a montage of pictures showing a number of things the characters did back in their forgotten night A film you won't want to forget",
      "total_reactions": 1,
      "user": "roddersj04"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Very funny movie. It has alot of funny moments, hardly a time where the laughing stops, the actors do an amazing job and you want to stick around for the credits.....trust me.",
      "total_reactions": 2,
      "user": "xXAnthonyXx"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "HIlarious film. While not every part was good, The majority of the film was hilarious and it featured quite a few priceless moments. I really enjoyed it.",
      "total_reactions": 1,
      "user": "asylumspadez"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2010
      },
      "score": 5,
      "text": "The Hangover was a movie that I tried really hard to like (not a good thing), but found that it just wasn't that funny or creative to me.  I don't know if I had too high expectations about how it would play out, but the \"jokes\" seemed to be a formula of: take a basic subject/concept and add a totally unrelated twist that makes no sense other than to be just totally random, and then you have comedy.  The weird thing to me is that I normally like weird, strange, nonsense as well, but the Hangover just seemed like the writer was trying to imitate that style, but found mediocrity instead.  I'm not going to bother commenting on the story, because it really has no bearing on the overall movie.  As a comedy it just needs to make you laugh, with the story coming in a distant 2nd.  Not a bad comedy, as it did have its moments, but to me it was pretty stale overall.",
      "total_reactions": 4,
      "user": "zombiehampster"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "HAHAHAHAHAHAHA. That is really all I have to say about this movie. Superb laughs, and a solid storyline. There aren't many comedies that achieve this.",
      "total_reactions": 1,
      "user": "Badsniper"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "I am not going to review this film because it is a) shallow in tone and b) hilarious in its shallowness... but we all knew this anyway...instead I will leave you with these words: \"Any film that makes you want to watch the credits is worth as much as you are prepared to pay...\" 94/100",
      "total_reactions": 1,
      "user": "NicoDaFlagburna"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "This is a hilarious movie that I highly recommend, the cast works together wonderfully, and the script is hilarious, it's packed with crazy twists and turns throughout, I just wish there had been less nudity, but this is still a great movie.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "the best comedy movie ever",
      "total_reactions": 1,
      "user": "glend690"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "Director Todd Phillips has a knack for making some of the best buddy comedies. Road Trip, Old Scool, Starsky & Hutch, and the upcoming Due Date starring Robert Downey Jr. and Zach Galifianakis. I didn't care for most of the previous titles, except Old School. It took me a long time to see Old School, but when I did I was thoroughly satisfied. It wasn's the movie itself that I fell in love with, as much as the genuine feeling of comradery and friendship between Mitch (Luke Wilson), Frank the Tank (Will Ferrell) and Beanie (Vince Vaughn). That is the very same feeling I get when I watch The Hangover. The actors all have a chemistry that makes you believe what's happening to them, no matter how outrageous it is. Zach Galifiankis was the best. What a great way to break onto the movie scene, after a decade of extra roles, and tv spots. The slogan, \"Some guys just can't handle Vegas\" is perfect. Without saying, if you saw the trailer you alreay know that the premise of the story is a bit extreme, but I never got the feeling that events from the film were beyond the realm of reality. Another great thing about this movie was the cameos. I'm always a sucker for good cameos, and The Hangover doesn't disappoint. I loved the appearances of Ken Jeong as the gay Chinese gangster Mr. Chow, Rob Riggle as the over-caffinated cop, and Mike Epps as black Doug. Oh yeah, and that other Mike too. Although, they probally shouldn't have spoiled that one in the preview. With so much going on in the story, this film could have easily had a few unfilled plot holes, but I'm happy to say that it didn't. The only question that went unanswered was how that chicken got in the hotel room. The Hangover was one of my favorite films of the summer. That's saying alot because there were quite a few great movies that came out in the summer of 2009. Todd Phillips may use the same basic buddy comedy palette for each of his movies, but why shouldn't he? It works. I can't wait for Due Date. And if theres any truth to this, we should be expecting a sequal to The Hangover. My fingers are crossed for that one.",
      "total_reactions": 1,
      "user": "RJSmoove"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2011
      },
      "score": 9,
      "text": "One of the funniest films you will ever see. Simple as that. This film has some of the most hilarious and memorable quotes and scenes ever and Zach Galifianakis! This film focuses upon a Wolf-pac, four hungry wolves, running around the desert in Las Vegas looking for strippers and cocaine... Well not quite! It's about four men who go to Vegas for a bachelor party only to wake up the next morning and remember nothing from the night before and to top it all off the groom is missing! From then on in its just a laugh-out-loud, hilarious, just incredibly funny comedy featuring a cameo from Mike Tyson. One of the best comedies ever made, unmissable!!!",
      "total_reactions": 1,
      "user": "Rosco"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "Truly one of the best comedy's of the decade. This movie was non-stop hilarious with a great cast. The situation they were in was just comical the entire time. Zach Galifianakis was the best part of this movie. The movie needed him to make this movie be able to get the phrase, best comedy movie ever!",
      "total_reactions": 1,
      "user": "jstrickler872"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2011
      },
      "score": 7,
      "text": "One of the best comedies of recent years and one most people can relate to (although not on such a grand scale) of memory gaps or complete blanks after a good drinking session. The gags are predictable but still make you laugh and the cast is perfectly suited to the roles.",
      "total_reactions": 1,
      "user": "rotku"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "Brilliant! This film did what many comedies fail to do......make you laugh! Casting was perfect and the performances are top-notch, with Galifianakis stealing the show immediately! This is also a film that oddly enough has some pretty darn good cinematography with Vegas as a backdrop. This one will be remembered for a long time!",
      "total_reactions": 1,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "funny as hell................................................................................................................... good comedy movie.   the casting was excellent.",
      "total_reactions": 1,
      "user": "lovemusic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "This is one of the funniest films I have ever seen! In every single scene there is comedy. Everyone I know loves this film. I know some people who have laughed so much throughout the film that they have made themselves cry from laughter. I do not know a single person who does not like this film. I cannot wait for The Hangover part 2",
      "total_reactions": 1,
      "user": "Smallville-Fan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "An AMAZING movie! One of the funniest movies ever created! Everyone who watches it laughs, everyone single one of them! A truly amazing film with a simple but hilarious plot and awesome acting! You really have to see this one!",
      "total_reactions": 1,
      "user": "WeKnowFilms"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "It's not a terrible movie, but an extremely overrated one (at least in my experience).  First, I considered the cast.  \"Wow, Zach Galifianakis!  I love his standup.  It'll be cool to see how Hollywood implements his strange brand of humor.  Ed Helms!  He's so talented.  He was great on the old version of The Daily Show and The Office.\"  After that I had about a hundred people come to me and say it was the best comedy ever made.  --  So it's probably safe to say my expectations were too high.  But even considering that, there's nothing mind-blowingly funny about it.  Sure, there are a few moments that had me laughing pretty loudly, but most of the movie involved long stretches of the same joke played out over and over. --  (Main characters learn something strange about the night before.)  (Main characters look at each other shocked and worried.)  True, the things they learn are different, but the punchline is always Ed Helms looking confused.  --  Bottom line, I saw it, thought it was okay, and never cared to watch it again.",
      "total_reactions": 1,
      "user": "Raught"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "\"The Hangover\" - One Line Review!",
      "total_reactions": 1,
      "user": "LevelsAndGear"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "A sidesplitting raunchy comedy from the director of Old School. I was a little skeptical going into this one because some of my friends that recommended it to me don't have the best taste in the world.  This movie was all about the shock factor. The second viewing is not nearly as funny, but it's still entertaining.",
      "total_reactions": 1,
      "user": "j30"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "Undeniably a bit overrated and over-hyped, The Hangover is still a moderately funny movie about a Vegas night gone wrong.  Bradley Cooper, Ed Helms, and Zack Galifianakis all fit into their roles perfectly, though I wish Justin Bartha had gotten a little more air time.  Really, as long as its particular brand of humor appeals to you, this movie is a fun way to spend an hour and a half.",
      "total_reactions": 1,
      "user": "CRL"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "Simply, it's one of the funniest, most original comedies of the 00's. Every single actor putting on a perfect comedic performance, Galifianakis especially (not to mention perhaps the best cameo of all time from Mike Tyson).",
      "total_reactions": 1,
      "user": "JawsPapi87"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "This is a fun, all be it overrated, adventure comedy. Zach Galifinakis provides most of the hilarity, and Ken Jeong is amusing but sometimes cringeworthy. The plot is clever, the writing is sharp, and the characters are loveable. It's a fun ride.",
      "total_reactions": 1,
      "user": "alexandergreen"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "While there are quite a few priceless moments in this film, It can get a little boring at times and it does lose its interest quite a bit by the end of the film. Still a solid comedy none the less.",
      "total_reactions": 1,
      "user": "spadenx"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "Like Batman:Arkham Asylum, this is WAY better than any promotional material would lead you to believe. Genuinely funny moments throughout, and brings laughs to all age (but you should keep it away from the younger kids, as there are hookers and roofies and a good amount of swearing) groups while sticking with the story and not getting carried away. There is an unfortunate under utilization of Justin Bartha, but the rest of the cast (including a hysterical and beautifully played EP, if you will, of a role from Mike Tyson. (too big to be a cameo, but too small to be a starring role.)) more than make up for it, especially Ken Jeong. Get it on Blu Ray. Its good to have on hand when your buddies come over and you can't find anything to watch.",
      "total_reactions": 1,
      "user": "ryallen"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "I really liked the movie and its easily one of the best comedies you will ever see. A lot of over the top hilarious moments and the cast does a great job at playing their part.",
      "total_reactions": 1,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "The Hangover is the funniest movie of the year. It brings with it a different style of comedy. Everybody has memorbable lines. It starts off with a bang and leaves you laughing until you can't breath.",
      "total_reactions": 2,
      "user": "csw12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "First off, I would give hangover a 9.5 out of 10. It's freakin hilarious. Acting is amazing. Everyone is hilarious and shows that everyone is having a great time. Score is pretty good, and the story is good. Overall, this is a hilarious comedy that everyone old enough should go and see. This is highly recomended.",
      "total_reactions": 2,
      "user": "Juanolo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "let me just start by saying that this is not just one of my favourite comedies, it is also one my favourite movies. It is absoluteley hilarious and I loved it. This is definitley a must see!  if you are looking for a great comedy than you have found your movie. definitley check it out. I highly reccomend it!",
      "total_reactions": 1,
      "user": "rblastamy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "A decent movie. Had alot of humour in, no doubt about that. Characters were interesting and funny. Acting was very good. Only one part (spoiler) is when they actually find their friend, turns out he was on the roof all along. Only reason why he couldn't get down was because the door was locked from the outside. Why didn't he go yelling around on the roof for the people down below? He even threw a madrass on a tower spike of the building, yet he didn't go to the workers that went up with a crane to remove and yell for help? Why not throw things down onto the streets below to get peoples attention? That was the most retarded thing I've ever seen in a movie in a long while. What was the director thinking? Other than that really stupid thing it was a decent movie.",
      "total_reactions": 0,
      "user": "Petrovita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "This movie is just comic genius, and far beyond what I expected it to be. This movie is probably one of the best, original comedies of all time.",
      "total_reactions": 0,
      "user": "CursedKnight187"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2014
      },
      "score": 7,
      "text": "A couple of days before his wedding, Doug drives to Las Vegas with his three buddies for bachelor party. Unfortunately the three groomsmen wake up the next morning with Doug missing and, unable to remember a thing, the trio must attempt to retrace steps from the night before in order to find their friend and get him back to in time for his wedding.",
      "total_reactions": 0,
      "user": "drlowdon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "The Hangover is a funny movie, which makes you laugh several times with the crazy characters, that the film has.",
      "total_reactions": 0,
      "user": "Caestus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "these are the kind of clever plot devices that lead to the best comedy. that is really all there is to say about this movie.",
      "total_reactions": 0,
      "user": "bram29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "A terrific classic. An awesome idea executed hilariously, it is highly entertaining a lot more watchable than most of Todd Phillip's films that I've seen.",
      "total_reactions": 0,
      "user": "devo-nc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "A true example of how comedy movies should be like! This movie has a great story line, script, acting & ending. Everything happened with very few expectancy and raised high curiosity in me as I continued watching. I loved that feeling! Truly pure, funny, honest & real. Gotta love Bradley Cooper in this one.",
      "total_reactions": 0,
      "user": "jzme"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2014
      },
      "score": 5,
      "text": "The Hangover is a fun caper which takes \"what happens in Vegas, stays in Vegas\" to the next level.  Still, I will admit to being slightly let down overall. Good, not great.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "Wonderfully hysterical with an impressive clever script. Great characters all around, but Zach Galifianakis absolutely stole the show. A fun movie that doesn't only look fun for the actors, but for the people watching it to.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "I love Todd Phillips and in my opinion this is his crowning glory. The film is funny though out and although it seems slightly dumbed down, I think it works especially with the characters. Zach Galifianakis steals the show whilst the cameo from Ken Jeong comes in as a close second. One of the best comedies in a long time, even the credits are funny!",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "The Hangover was a well received comedy that managed to capture the heart of many Americans. That said, you know there's an issue when the credits are the best part of a movie.",
      "total_reactions": 0,
      "user": "stefrank"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "you've got to be kidding me!!! all those negative reviews are **** !!!",
      "total_reactions": 0,
      "user": "funckygarcon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "\"The Hangover\" is a comedy film, which is great. It haves great actors, and a funny plot. But, sure, not for kids. However, It's worth and I recommend for the comedy fans.",
      "total_reactions": 0,
      "user": "FilmReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "A film that does not personally favor. Sometimes it makes you boring. The scored with 5 argument is good.",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "Great pacing, outrageously comical situations, and memorable. It is a blast the first time you see it, but there is nothing you can appreciate further after watching it a second time.",
      "total_reactions": 0,
      "user": "Seriosity"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Fairly hysterical comedy overall that's ridiculous without being overtly silly, and irreverent without being clearly crude.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "One best written funniest comedies ever that can get a little old but still stands as an unforgettable film.",
      "total_reactions": 0,
      "user": "TheWalrus2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "This film is pure comedy gold and a perfect look at what guys can get up to on a wild night out in Vegas! It's a thoroughly enjoyable film with likable characters, especially our leads, and some very funny things happening throughout. Alan, in particular, is a great character and Galifianakis does a top job there! It's also a great film to watch with friends, or if you have been lucky enough to of been to Vegas and know what it's like to spend the night there (which I can say I have!)",
      "total_reactions": 0,
      "user": "survivorfan989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "It was a crazy funny adventure that you end up following closely to figure out what the hells happening. Zach Galifinakis has a breakthrough performance that will jump-start his comedy career. Funny but it gets so ridiculous that I don't care after a while.",
      "total_reactions": 0,
      "user": "Summersausage"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "Enjoyable ride throughout the movie.. watching everything fold after the chaos was super fun.. great performance by the cast.. some good jokes here and there, but whats really good about the movie is the experience..",
      "total_reactions": 0,
      "user": "Khris"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "One of the funniest films of the last few years. This film has likable characters mixed with bizarre situations which create some great comedy. The actors have great chemistry and will guarantee at least a few laughs with it's crazy humor.",
      "total_reactions": 0,
      "user": "ninja_dolphin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 9,
      "text": "\"Hey, you guys ready to let the dogs out?\" - Alan Garner",
      "total_reactions": 0,
      "user": "Marica"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "And yet. If you're male or if you're female, if you're squeamish about raunchy comedy or if you love it, if you're aware of Zach Galifianakis' patented brand of absurdity or if you're new to it, you will laugh at The Hangover. You may laugh so hard that you're a little ashamed of enjoying something so silly. And after quoting all the best lines with your friends, you may still be laughing so hard that you want to see it again. Comedies this good don't happen by accident, even if a little organization could have made The Hangover much better than what it is.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2013
      },
      "score": 3,
      "text": "Total crap. One of the most overrated films of our generation. It's unrealistic, ridiculous, offensive and not funny at all. The only positive aspect about this movie is that it's unpredictable, but I honestly don't know if that's a good thing or a bad thing in this stupid production.",
      "total_reactions": 0,
      "user": "adamSv94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "the Hangover is definitely the best comedy movie i have seen  and the reason is the simple concept  4 guys go to las Vegas and one of them disappear and certain things happen that you can't explain and at the end everything will fall right in his original place and you start to connect the events together  it's hilarious i loved it and the fact that at the time were Bradley Cooper and Zach Galifianakis are not well-known comedian  which is a lot better than bringing some comedian who will take over the movie and destroy the story with his attitude just like any Adam Sandler movie  and the surprise value is what make's the movie great so i don't think that making a sequence out of this gonna work",
      "total_reactions": 0,
      "user": "ExKing"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "Original, fun and great!!!! I died of laughter. I recommend it to everybody. Zach did a great job, and other actors were good too. PUT THIS MOVIE ON MUST WATCH LIST!!!",
      "total_reactions": 0,
      "user": "RobyLula555"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "This is the movie that became an instant classic. It's outrageously hilarious and fun to enjoy. The storyline is very original and works very well. I mean finding out what happened after a massive hangover is really interesting to watch. Plus, the characters are hilarious, especially Alan. Alan is definitely the best part of the movie. He's that idiot that we've all come to know and love. He steals every scene he's in. It's hard to pick a favorite moment in this movie, but there are so many scenes I just couldn't pick one. Yet at times, the story sort of slows down at some parts, but automatically picks it back up. Overall, it's a hilarious and original idea that we'll always be known as one of the greatest comedies ever made.",
      "total_reactions": 0,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2013
      },
      "score": 1,
      "text": "One of the worst movies or maybe the worst I have ever seen!!! I think I just wasted my time. But there are a lot of people like The Hangover and are keen to follow its sequels. But I'm sure I won't do that. I won't.",
      "total_reactions": 0,
      "user": "Masoud1986"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "\"The Hangover\"  is a very funny movie, with some great characters.  I loved the direction and actors!  I do not understand WHY, people are being so NEGATIVE towards this movie.  I watched this in the theaters and the audience loved it!  I love the whole series!",
      "total_reactions": 0,
      "user": "DFWJD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "One of the best comedies ever made. All the actors were good. The plot was good and it have some mysterious things too. For example where is dug. A must-see comedy, maybe the best of its kind",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "One of the funniest movies to come out in a long, long time and the highest grossing R-rated comedy of all time, The Hangover was just laugh after laugh.",
      "total_reactions": 0,
      "user": "George-roots"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "The whole idea of this film is funny enough. It seems stupid;cheesy, but that is what makes this film funny, in some of the events of this film. although i feel the film would not run so smoothly if  Galifianakis, who pulls this movie along, was not in it (due to a great comic performance). That said each character has a personality that stands out  and develops as the movie continues, in till you feel like you know each character inside out. i feel though some jokes were too cheesy and do not compare as well to other comedies. overall this film was enjoyable.",
      "total_reactions": 0,
      "user": "turbulentmaniac"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "To be honest, I can't see why this movie was so popular, and how it got two sequels. It was unmemorable, unfunny, and felt like a bad knock-off of \"Dude, Where's My Car?\".",
      "total_reactions": 0,
      "user": "ItsRaininMen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "One of the best comedies ever. Period. A great start to an epic trilogy. 10/10. Just a question for the viewers: who is funniest out of the wolf pack",
      "total_reactions": 0,
      "user": "Popcorn12345"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "The Hangover is one hilarious, laugh-out-loud riot. The themes of the movie are all so accurate, getting every detail of a bachelor party and the Vegas happenings are amusing and crazy. You'll have fun with this movie.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "This movie is hilarious, four best friends go to Las Vegas to give one of their fellow wolf pack members a bachelor party. When they wake up after a huge hangover they realized they have been drugged and cant remember anything. Zach Galifianakis is hilarious and is an amazing comedic actor. This movie is great and should be watched by anyone who enjoys having a good time.",
      "total_reactions": 0,
      "user": "SJ-ULTI-Reiews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "The Hangover is long and  loose.",
      "total_reactions": 0,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2013
      },
      "score": 0,
      "text": "One of the most over rated films I've ever come across \"you must watch it it's so funny\".. watched about 40-50mins and had to turn it off bad acting, awful dialogue and it's not funny at all I think I may have smirked slightly during the time I watched it. Basically if you want to watch a film where every 2 mins they say \"what did we do last night? we were so wasted\" this is for you.",
      "total_reactions": 0,
      "user": "LeFroglet"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "The Hangover is a relatively funny and raunchy comedy that delivers the laughs without re-inventing the genre with any originality. A fun time-pass film.",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "Everyone was saying this was hilarious, so I watched it. I wouldn't go so far as to say the laughs are non-stop, but there are some and the cast is good enough to pull them off. Nothing too special.",
      "total_reactions": 0,
      "user": "KaptainHutchino"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2014
      },
      "score": 9,
      "text": "This really pleasantly surprised me when I saw it at the theatre. It certainly lived up to its hype, and made overnight superstars of both Zach Galifianakis and Bradley Cooper. Unfortunately, like any other zeitgeist film like Pulp Fiction, you then had to trip over the countless ripoffs. Don't bother with the sequels!",
      "total_reactions": 0,
      "user": "talisencrw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2014
      },
      "score": 9,
      "text": "The Hangover is an outrageously funny film, with scenes that'll have you wetting yourself with laughter. I can't really think of anything bad to say about this film it doesn't even start off slow or get boring towards the end like some comedies do.",
      "total_reactions": 0,
      "user": "Daniel2651"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "Great comedy, surprise hit in 09. Love that **** the characters and the ideas were new and    just funny    af",
      "total_reactions": 0,
      "user": "iCronic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "The Hangover is a 2009 American comedy film, co-produced and directed by Todd Phillips and written by Jon Lucas and Scott Moore. It is the first film of The Hangover trilogy. The film stars Bradley Cooper, Ed Helms, Zach Galifianakis, Heather Graham, Justin Bartha, and Jeffrey Tambor. It tells the story of Phil Wenneck, Stu Price and Alan Garner, who travel to Las Vegas for a bachelor party to celebrate their friend Doug Billings' impending marriage. However, Phil, Stu and Alan have no memory of the previous night's events and must find Doug before the wedding can take place.",
      "total_reactions": 0,
      "user": "Marick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "he Hangover begins and ends conventionally but, in between, it's not afraid to go off the rails. Unlike most so-called \"comedies,\" this one can claim the virtue of being reasonably funny. It never tries too hard, the actors have a good sense of comedic timing, and none of the jokes are drawn out for too long. And, although The Hangover doesn't have the heart of, say, Knocked Up, it displays an affection for its characters that most comedies don't. I wouldn't go so far as to claim the men and women populating the production are three-dimensional but they escape the low orbit of simple caricature. There's a little more going on here than vulgar humor and that makes The Hangover worth the price of admission.",
      "total_reactions": 0,
      "user": "MovieManiac83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "Some of the most memorable images in The Hangover come before the action even begins. The credits roll over forbidding shots of Las Vegas at dusk that suggest menace lurking just beneath the party-friendly surface. What happens there stays there, we’re frequently told, but what about the untold stories that end badly? The Hangover doesn’t really run with that idea. In fact, once it establishes its promising premise, Todd Phillips’ film doesn’t really run anywhere so much as amble. It’s an agreeably unambitious comedy that might be called a romp, if that word didn’t imply a little too much energy.",
      "total_reactions": 0,
      "user": "moviemayhem"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "The Hangover is hanging in there. While usually comedies don't always grant me laughs, this movie almost did and that's a succeed. Don't miss your shot to watch this if you have a Blu-ray or DVD copy of the Hangover.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "WHAT I LIKED: Suprisingly, the plot is the best thing about this film as it's a mystery for the audience which is very exciting. The unravelling is great and you really feel the characters pain, and so when something funny happens it adds some great 'comic relief'",
      "total_reactions": 0,
      "user": "BarneyOnMT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2016
      },
      "score": 2,
      "text": "Not funny, just not funny. I don't know how awful the sequels turned out to be but this was just stupid. No desire to see anymore. Just a pile of **** that people continue to buy into",
      "total_reactions": 0,
      "user": "AaronWasserman1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2016
      },
      "score": 7,
      "text": "The immaturity of ostensibly grown-up American men is an inexhaustible subject, or at least one that has yet to exhaust American movie audiences and the well-paid guys who cater to their entertainment needs. Todd Phillips, the director of “Old School,” “Road Trip” and an HBO documentary called “Frat House” as well as a writer of “Borat,” has shown himself to be an adept and tireless connoisseur of male boorishness and stupidity, though the crude humor he dispenses is frequently leavened by nuggets of inventiveness and wit.",
      "total_reactions": 0,
      "user": "MovieMasterEddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2016
      },
      "score": 10,
      "text": "the script is unique, the acting is superb but overall the hangover is a ridiculous hilarious movie that nothing short of relatable in almost every possible way",
      "total_reactions": 0,
      "user": "UNARMED_JORD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2017
      },
      "score": 0,
      "text": "Le début du film et son point de départ sont les mêmes que dans le (très bon) Very bad things, je partais donc sur un a priori favorable. Les comédiens n'ont par contre rien à voir : dans \"trip\" ils sont soit mauvais, soit complètement et débilement cons, à un point tel qu'ils n'ont pas besoin de se forcer pour paraître plus cons qu'ils ne le sont.",
      "total_reactions": 0,
      "user": "Broyax"
    }
  ]
}