{
  "mc_avg_user_score": 2.6,
  "mc_metascore": 47,
  "mc_mixed_rating_frequency": 43,
  "mc_movie_name": "The Box",
  "mc_negative_rating_frequency": 136,
  "mc_positive_rating_frequency": 35,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "This film started as a simple morality vehicle, but ended as a deeply religious and human narrative regarding not only morality, but original sin and pulls symbolism from the Garden of Eden to exhibit the fall of man from a very interesting perspective. The acting was more or less unremarkable but the cinematography and audio are sublime. Do not be discouraged by the negative reviews. The only explanation that I can offer for low marks is that the reviewer wasn't expecting to see an actual film, and instead was expecting a cookie cutter sci-fi/horror summer blockbuster that is neither memorable nor engaging. If that's what you're after, enjoy saw 14. If you're looking for a narrative thriller with a little substance, check this one out.",
      "total_reactions": 1,
      "user": "garbawnzo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "The Box is a confused and strange film that many focus on confusing the audience and WTF moments instead of anything else. The film got ruined half way through.",
      "total_reactions": 1,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2012
      },
      "score": 4,
      "text": "What starts off as a promising film to some extent slowly but surely begins to unravel itself from that decently tied knot after the first thirty minutes. After that, it's all downhill for 'The Box'. While the premise itself is somewhat interesting (based on a 1970 short story titled \"Button Button\") the screenplay fails to maximise whatever potential the story might have had, instead decides to capitalize on a plot line that is incredibly far-fetched and never makes perfect sense. Regardless, I'm sure *some* fans of the psychological thriller genre will enjoy.",
      "total_reactions": 1,
      "user": "eTurkey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Wonderfully weird and imaginative. This is a sci-fi cult classic that fell under the radar, but it is a really great film. I heard a lot of people bash this thing, but this movie is about much more than a box and a button. If you're not a sci-fi fan and not used to this type of film, it might be a bit confusing, but stay with it. I think it's well worth it.",
      "total_reactions": 1,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "The Box pushes your buttons.",
      "total_reactions": 1,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "This movie as not as bad as people make it out to be. I'll admit, there are some vaguely explained moments, unconvincing acting (thank you Cameron Diaz), an ending that leaves you unsatisfied, and some plot points that aren't tied together.",
      "total_reactions": 5,
      "user": "HCorrell"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2010
      },
      "score": 6,
      "text": "The Box must be one of the most absurd movies I have seen for the year of 2009. I must admit itâ",
      "total_reactions": 1,
      "user": "thelordoffilm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2010
      },
      "score": 0,
      "text": "This is the WORST MOVIE I HAVE EVER SEEN! MEANINGLESS, NO POINT OF VIEW WHATSOEVER, UNRELATED SCHENES AND MESSAGES AND CHARACTERS. TOTALLY WASTED MY TIME. SPENDING SO MUCH MONEY FOR B---T. THIS MOVE JUST BLUE IT! TOTAL FAILURE...",
      "total_reactions": 1,
      "user": "makakus"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "esta película es una prueba ingeniosa para la mente  aunque es un poco lenta su historia salva a esta película de caer en el basio en el que han caído varias películas que intentan lo mismo",
      "total_reactions": 1,
      "user": "diego9901"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "The box is a good/bad movie its plot is really weird and acting really sucks at times but its one of those movies that when startt watching it you have to see it to the end",
      "total_reactions": 0,
      "user": "moviefreak12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "Lewis family finds a box on the porch of their house. It is an ordinary box with a button. Later, mysterious old man comes to tell them how the box works. If they push the button, someone on somewhere will die, and they received one million dollars. They have 24 hours to decide. Norma and Arthur Lewis starred by Cameron Diaz and James Marsden. The mysterious old man played by Frank Langella, that we recently see him act impressively in FROST/NIXON (2008). The Director is Richard Kelly. The Director of DONNIE DARKO (2001) whose received many good reviews from movie critics. Personally, I did not enjoy DONNIE DARKO that much. The most interesting in thiz movie is our curiosity about what is really happens. Too see this kind of movie, we had to put aside our logic for a while. Because anything we see in thiz movie is very absurd. Thiz story had been told in one of the episode of TWILIGHT ZONE series in 1980s era. The film has setting in 1976. I think the Creative Designer Team already done their job very well. Everything we see is truly 70s. The music was also thrilling, like we had been watching 70s horror movie. In the end, there will always be dilemma in our life: Is there something we already done? Or, something that we did not do? Visit My Blog on JONNY'S MOVEE : http://jonnyfendi.blogspot.com",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "I have no idea how a movie of this quality rank could get the hilarious 47 out of 100 points. This is literally a masterpiece, one of the best movies made recently.",
      "total_reactions": 0,
      "user": "promato"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2015
      },
      "score": 2,
      "text": "\"Disconnected mess\" describes this confusing piece of garbage perfectly. The first 30 mins are promising and then it all falls apart. The only reason it gets a 1 is that there has to be a lower rating for movies like Christmas with the Kranks.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2013
      },
      "score": 1,
      "text": "The trailer for this film made it look amazing but it left and lots to be desired It's more dire then Dani its like a rape on your mind is completely confusing and one of the worst film I have ever seen ever. The film of the box is aptly named Because Belongs 6 feet under the ground where nobody can find it ever again  Warning this film may cause silicides",
      "total_reactions": 0,
      "user": "BlackAlpha"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2015
      },
      "score": 5,
      "text": "\"The Box\" under a single perspective was a bit interleaving and topics of beyond and what a box to be able to do, but we do not know if that really happened , but it was chilling , but also less interesting.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2015
      },
      "score": 1,
      "text": "I honestly could not believe that the person who made Donnie Darko also made this. So the film has a good opening 10 minutes, It sets up the characters and an interesting lot development. Then all of a sudden the films plot takes an absolute nose dive of stupidity into an enormous pile of ****  and just when you think it couldn't get any worse the plot starts rolling around in **** back and forth with the appearance it is going somewhere but keeps stopping and going back the way it came never leaving the pile of **** it is entrenched in.",
      "total_reactions": 0,
      "user": "AnarchyAus"
    }
  ]
}