{
  "mc_avg_user_score": 6.1,
  "mc_metascore": 33,
  "mc_mixed_rating_frequency": 30,
  "mc_movie_name": "The Haunting in Connecticut",
  "mc_negative_rating_frequency": 16,
  "mc_positive_rating_frequency": 35,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2010
      },
      "score": 3,
      "text": "At its core, Connecticut is a fairly warm, heart-rending family movie frequently disguised as a low-grade horror movie of shoddy writing and cheap thrills.",
      "total_reactions": 0,
      "user": "FitriAmirrol"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "i like haunted house films but this one loses alot of points for going all hollywood and not sticking to what was said to have happend by the family. ive seen the documenty on discovery channel before i seen this film they went way off course in the last half of the film. as a horror film its so so but i cant give alot of praise to some thing that abandons its source material.",
      "total_reactions": 0,
      "user": "ArkonBlade"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "This is a pretty standard jump scare haunted house movie.  The acting isn't horrible but it's nothing to write home about.  The movie plays up the based on the true story angle but if you watch the special features on the DVD you learn that the vast majority of this movie is fiction.  The biggest example being the burning of the home at the end.  It never burned down... ever, yet the end of the movie says that the house was \" rebuilt and resold\".  Somebody does live in it now but it never burned to the ground or had the dead no decomposed bodies built into the walls.  So taking that in to effect we see that the movie isn't really based on the true story making it just another cookie cutter haunted house film full of predictable jump scares.  This is a good movie for middle school and high school kids to start their interests in horror movies.",
      "total_reactions": 0,
      "user": "moviegrabbag"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "I admit, this was a really good movie. I did jump and scream a few times. It does deliver thrills, chills and scares. I'd definitely recommend this movie.",
      "total_reactions": 0,
      "user": "JosephRunzThiz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 5,
      "text": "I thought the acting was pretty decent and as such, I feel quite bad rating it 5/10, but for me, this was one of those films that you forget after it's finished. I think the reason behind it being so forgettable is pretty simple: the film relied almost 100% on jump scares and so once you've scared the crap out of the person sitting next to you by unexpectedly jumping out of your seat and perhaps needing a quick underwear change, you pretty much instantly forget that moment where something big and scary was loudly thrust into your face. A phrase that could quite easily be misinterpreted...anyway! On the whole, it was okay. Although it was, in a way, pretty inevitable I did find the ending quite disappointing. This film was in no way subtle or clever enough to really scare me and stick in my mind, hence the fairly low score. But it was relatively entertaining, it wasn't a monumental waste of time and it would be a fairly decent choice with a few friends over.",
      "total_reactions": 0,
      "user": "Nixy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "The Haunting in Connecticut is a 2009 horror film directed by Peter Cornewell and inspired by the real events. The plot tells the story of Matt Campbell, being a cancer patient, is forced to move to a location that is close to the hospital in Connecticut. Arriving at the house Matt realizes that there are presences but that only he can see. The film is a great underrated horror where there is an air of anxiety thanks to the excellent actors and scenes of fear that never exaggerate.",
      "total_reactions": 0,
      "user": "Mad_Hatter91"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2013
      },
      "score": 2,
      "text": "Same cliché as Amityville story, and calling it a true story is insultingly stupid. The whole thing feels like a boring B-movie, with cheap \"jump scares\". Honestly I was not scared or intimidated for a second. which is a sign of a very bad horror-haunted house movie. Overall the same haunted house movie you have seen 100 times already. Not recommended.",
      "total_reactions": 0,
      "user": "oliver1h"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "The haunting in connecticut has a good plot and starts with a good idea. It has great atmosphere and it is dark which is a good thing for a horror film. Also it is good for horror films to scare  a thing that this movie doesn't. It is annoying and boring and there is not actually a perk of  watching that film. It is lame and uninteresting as the plot goes. It would be great if someone at least would die or even explain the movie better. Nothing happens and that is bad as the trailer shows good stuff.",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2014
      },
      "score": 4,
      "text": "The Haunting in Connecticut is just more \"people-move-into-haunted-house-hear-weird-noises\" genre fare that offers nothing more than what we already know, and is completely predictable from start to finish. The movie is not special nor original, it's just kind of \"there\".",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "Amazing film, and the critics should really rate this movie higher. The jump scares are actually scary unlike most ghost movies. This film is worth the watch.",
      "total_reactions": 0,
      "user": "ricky1121"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2014
      },
      "score": 2,
      "text": "Jesus christ, was this a disaster. I haven't laughed so hard at a horror movie in my life... and not in a good way! So many \"scares\" were actually hilarious because the loud sound the movie used was so cheesy. It was as if they typed \"scary noises\" into google and used some of those. The story also didn't make a lick of sense either. I will say that the acting and cinematography were great, but those were the only good things about this movie. Definitely don't recommend this unless you want a good laugh.",
      "total_reactions": 0,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "I think that's a great movie. You just need to understand the story and watch with attention the movie, because I really like it...................................................",
      "total_reactions": 0,
      "user": "soloms"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2015
      },
      "score": 2,
      "text": "The concept is okay and the acting is pretty good, but as a scary movie, it sucks. It is very cheap, jumpscares and loud sounds, no suspense, no tension, no buildup and the ghosts looks like they are out of a Goosebumps episode. Very poorly executed, cheesy and messy. Looks more like a made-for-TV horror flick or a TAPS episode.",
      "total_reactions": 0,
      "user": "Urbanlistener"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "This was a pretty good movie. It was scary at times, and was kinda disturbing as well. Is it one of my favorites, no. But is worth buying on dvd and watching as many times as you want. Go give it a try, it's a good movie, and deserves at least at 40/100 from critics.",
      "total_reactions": 0,
      "user": "calebowensmall"
    }
  ]
}