{
  "avg_user_score": 3.2,
  "metascore": 24,
  "mixed_rating_frequency": 15,
  "movie_name": "The Loft",
  "negative_rating_frequency": 62,
  "positive_rating_frequency": 25,
  "pro_critic_reviews": [
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 50,
      "summary": "It all sort of comes apart in an orgy of clumsy over-explanation that doesn’t truly explain anything. But the quintet is well-cast."
    },
    {
      "critic": "Katie Rife",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 42,
      "summary": "Besides being an early contender for the worst date movie of 2015, The Loft is a film that can’t decide what it wants. It’s a male fantasy, and a cautionary tale. It’s sleazy in concept, and timid in execution."
    },
    {
      "critic": "Joe Leydon",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "The five leads earn kudos for their ability to come across as something approaching credible."
    },
    {
      "critic": "William Goss",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 40,
      "summary": "For the most part, The Loft struggles to engage even on the level of tawdry potboiler, joining the forgettable ranks of 2005’s \"Derailed\" and 2008’s \"Deception\" as yet another underwhelming one-night stand."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 40,
      "summary": "Whatever fun there might be in the guesswork is wiped away by the realization that Van Looy has made a puzzle for a puzzle’s sake, to no discernible thematic end."
    },
    {
      "critic": "Simon Abrams",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2015
      },
      "score": 30,
      "summary": "The Loft's boorish leads aren't sensible enough to be worth caring about, making the film's character-driven conclusion feel like a self-defeating cop-out."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2015
      },
      "score": 25,
      "summary": "There’s no redeeming this softcore nonsense, which plays like a script that “Storage Wars” stumbled across in Joe Eszterhas’s old locker."
    },
    {
      "critic": "Peter Sobczynski",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 25,
      "summary": "This long-delayed would-be erotic thriller is a shabby bore that promises viewers any number of kinky thrills and then proceeds to deflate those expectations."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2015
      },
      "score": 20,
      "summary": "This silly chamber piece about sex and murder elicits only yawns, interrupted by the occasional unintentional giggle."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2015
      },
      "score": 20,
      "summary": "Erotic thrillers are a time-tested genre, but this effort, scripted by Wesley Strick, is neither erotic nor thrilling."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "summary": "All the men's wives are shrews, prigs or doormats; all the conquests doe-eyed blonds with sucked-in cheeks. All the dialogue is as witty as this exchange: \"You're a sick f---!\" \"No, you're a sick f---!\" They're all sick f---s, frankly, and the actors are dreadful while playing them."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "Everyone seems to hate this movie and I can kind of understand why but to me this was a cool, sexy, twisty and entertaining thriller. I do actually genuinely like this movie. The plot follows five married guys who invest in a loft so they can take their mistresses their and then one day they walk in and find a dead body and they must find out who did it. now none of these characters are necessarily likable but the performances behind them are pretty good. Karl Urban is great as per-usual, James Marsden is a stand out and gives the best performance in the entire movie, Matthias Schoenaerts is also very good reprising his role from the Belgium film, Eric Stonestreet is serviceable to his role but not really all that good and Wentworth Miller is just plain awful and awkward in his role. Rachel Taylor is quite surprisingly good as one of the mistresses and Isabel Lucas is really hot (she sheds a lot of skin and it is kind of awesome) and has definitely improved on her acting skills. While the film is very confusing and takes a little too many twists here and there, I did enjoy the unraveling and the motives, it kept me guessing until the end. My biggest issue with the movie is its ending it just felt a little too nice for how dark and serious the movie is. In the end I found this to be a very entertaining movie that I would go back and watch again because of its ensemble and its fun plot. I know it has a 0% on rotten tomatoes and everyone seems to be hating it but I really like and  I give \"The Loft\" an A-. It is now in my list of guilty movie pleasures and underappreciated movies.",
      "total_reactions": 6,
      "user": "moviemikey98"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "I completely disagree with the American press. This movie is phenomenal! It’s about 5 guys sharing a loft where they can bring their mistresses and eventually end up involved in an investigation that could land them all in jail. The movie has a very strong story that underlines the plot where it is going. This genre of erotic thriller is difficult in some parts of America. That is why the Belgian Director Erik Van Looy decided not to organize a press vision in advance. Perhaps he should just have done that given their pulverizing and ridicilous reviews. Apparently the American press has less difficulty with someone shooting forty men down than with five men who cheat!! The theme of premeditated adultery caused bad blood with the US press. That five adult males take a loft to jointly deceive their wives sometimes could shoot down the wrong way at the puritanical Americans, Van Looy had expected. But the press reviews are so over the top that they cannot be taken seriously because they prefer to pretend as if adultery does not exist. Just go look it up in theaters or bluray and decide for yourself!",
      "total_reactions": 6,
      "user": "Olibolli"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "\"The Loft got terrible reviews, it has a very rare 0% on Rotten Tomatoes so it interested me even more and i had to go watch it. So was it really that BAD?!? No it actually wasn't, at least for me. The acting is OK it's definitely not Oscar worthy and it's also not terrible. I thought Wentworth Miller was pretty decent, why people are calling him the worst actor in the movie is beyond me, if anything every actor was on par with each other. The film has so many plot twists and it gets annoying after a while, I could have done with one less twist. The way the story is told is in present tense as well as flashbacks between the present scenes and it's OK, but it could have been told better. There is some comedy relief mostly done by Eric Stonestreet also known as the fat guy from Modern Family. The movie had some potential but it kinda missed the mark, you wanna see how everything plays out but you also don't really care for any of the guys because they're all D-bags. Also I didn't buy that all 5 of them were friends. The movie would have been better had they added a thriller sense to it or just more suspense! I did enjoy it nonetheless, it did interest me and i honestly wasn't bored with it at all! Idk why critics tore this one apart, sometimes they just like doing that. If people can find enjoyment in movies like Tammy, Ouija and Transformers 4, why can't I somewhat enjoy this one ?! I'm giving The Loft a 6.5/10 it has its moments, but you're left thinking it could have been WAY better. Also I didn't like the ending. Is it worth watching at a theater? ehh, no not exactly. I don't regret it, but I also wouldn't say it's a must see at the theater lol. It's worth watching at least once, like a rental you'll either like it or not. I did like it but i know it had many flaws! I'll probably get it on bluray.\"﻿ DON'T LISTEN TO CRITICS ON THIS ONE!",
      "total_reactions": 2,
      "user": "himynameisart"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "The film's mystery is obvious and predictable but there is a twist on top, the script is terrible the writer of the other remakes in 2008 and 2010  Bart De Pauw and  Wesley Strick script is laughable the romance is corny and their mystery is well done. You have talented actors so why are they in this film? It's the script that makes them terrible. We have two remakes that should not been made. The director of the original Erik Van Looy returns with more and more **** directing. The film gives us clues and good suspense the way we look at Karl Urban, James Marsden, Chris Vanowen, Wentworth Miller, Matthias Schoenaerts. The women in the film are terribly written; the film represents women as a whore of cliche's. But the film has a Hitchcock thriller and times it can be great it's gripping. Grade C+",
      "total_reactions": 2,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 3,
      "text": "An erotic thriller that tries so hard to be clever and unpredictable it ends up being a convoluted mess of a film, and a waste of a highly capable cast.",
      "total_reactions": 2,
      "user": "SolInvicta"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "Five married men enjoy sharing a beautiful apartment for their trysts, until a woman turns up handcuffed to the bed and dead. This is a classic whodunit with flashbacks to lay out the clues and every character having a motive. The plot keeps you guessing, but the suspicious glances, sometimes portentous dialogue and the director's stylistic flourishes get in the way of any tension. On the positive side, the movie's got an attractive, able cast and a high-end look. If you don't delve too deeply and appreciate this film as a crime puzzle you might enjoy trying to put the pieces together.",
      "total_reactions": 3,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "Yuck! Not even worth the trouble of writing a review. Sickening. Boring. Dumb.",
      "total_reactions": 4,
      "user": "jagxjr15"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "Infidelity burns, friends might not be there to share the heat. The concept of having a getaway place to fornicate is enticing, if one is seriously considering such sexual mischief The Loft serves as a guide of what should not be done. Boasting good cast and decent drama thriller, the film has pretty interesting twists and turns. However, the use of multi-perspective in varied timelines is occasionally as messy as the portrayed adulterous acts.",
      "total_reactions": 1,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2015
      },
      "score": 5,
      "text": "The Loft had so much potential with an interesting plot and a great cast ensemble but it ultimately failed to deliver the goods. I largely blame the director here. Erik Van Looy tried to do too many things and none of them really worked. The cinematic effects used came off as pretentious and unnecessary and the twists at the end felt out of character and unrealistic. Overall it had certain strengths like solid acting and decent character development but it was not a good movie.",
      "total_reactions": 1,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2015
      },
      "score": 2,
      "text": "Who cares are the key words that surround this movie.  All the characters are terrible people who you realize in the first 20 minutes are just a waste of time.  The end of the movie is absurd don't waste your time.  D-",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 2,
      "text": "Let's talk about The Loft...god help me.",
      "total_reactions": 0,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "I have to say I am surprised at the allergic reaction to this movie from most critics. There are moments of real tension, a fair amount of humour, and the acting from the five leading men is very good. It's not the most cerebral film and it certainly doesn't merit or require repeated viewing, but there are some satisfying twists at the end and it is never boring.",
      "total_reactions": 0,
      "user": "frootee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2015
      },
      "score": 7,
      "text": "The twisty plot translates to any culture. I really like James Marden here, but the film lacks the thrill.",
      "total_reactions": 0,
      "user": "alexa417"
    }
  ]
}