{
  "mc_avg_user_score": 7.3,
  "mc_metascore": 94,
  "mc_mixed_rating_frequency": 142,
  "mc_movie_name": "The Hurt Locker",
  "mc_negative_rating_frequency": 229,
  "mc_positive_rating_frequency": 1003,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "Great movie! Unlike other war movies about recent conflicts such as Jarhead, this movie is actually entertaining, with some of the best tension filled scenes you will see. And the performance by Jeremy Renner in the lead role is fantastic. I understand that many parts of the movie are \"unrealistic\", as many people have complained about, but 100% of fictional movies are unrealistic. They have spice up aspects of life to make the film entertaining. I don't believe they mean any disrespect to those in uniform. They're merely trying to make the movie entertaining for the audience. But I understand this is a sensitive subject.",
      "total_reactions": 2,
      "user": "Andy86"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "As a character study, the film does a pretty decent job at exploring the psychological impact of war. Following a three man EOD team, there's no plot in the traditional sense, but we see how the group dynamics unfold and the eventual revealing of all their own hurts that were previously locked away. For example, William James' addiction to danger and inability to enjoy civilian life, and Sanborn's fear of dying unloved with no family to remember him by. This helps add a layer of complexity that subverts the idea of the unfazed and glorified soldier. This isn't anything new, but I thought it was an interesting character portrayal nonetheless. The film's erratic cinematography and effective use of sound also do a good job at heightening the tension and paranoia during particular scenes.",
      "total_reactions": 1,
      "user": "gloriouspotato"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2015
      },
      "score": 10,
      "text": "Something about this movie is really interesting to me and I can't quite put my finger on exactly what it was. I think it was partly due to the style and way the film was presented, where anything could happen at any time, and how suspenseful each scene was. However, there were some problems that I feel it had (excluding all the comments about how non accurate it was to what REALLY happens with EOD teams in iraq, cuz everyone seems to be commenting on that) I feel it lacked a solid meaning in the end. I understand the theme of his \"war addiction\" but the movie as a whole didn't seem to touch on that at all until the end. if the film makers were going for that feeling to be taken away from the movie, they didn't seem to stress it enough. Nonetheless i enjoyed it and I am a fan of war movies that aren't just about the typical war fighting and this is one of them. Props to the filmmakers for this new style.",
      "total_reactions": 1,
      "user": "Young_Nacho"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2016
      },
      "score": 10,
      "text": "An important, intense, nail-biting experience -- really quite unforgettable.",
      "total_reactions": 1,
      "user": "avamiller21"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2012
      },
      "score": 2,
      "text": "I dont know WHAT have everyone found in this movie.Absolutely NO realism , horrible stroy about the stupid war done by American politiciand only for their own joy.Even the soldiers of US army laugh at it. You can call me stupid or something but i think - the only reason this film has got the Oscar - is because the women.You know what i am talking about.",
      "total_reactions": 4,
      "user": "JakeSTALIN_RUS"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Easily the best movie made about the Iraq War, and one of the most memorable war movies I've seen in general. The director, Kathryn Bigelow, charges almost every scene with suspense and tension, producing action sequences more exhilarating and gripping than most high-budget blockbusters. Also, wtf with people complaining about the movie's real-life credibility? It's not like \"Apocalypse Now\" represented the Vietnam War as it was, it just tried to be a great movie, which it was and \"The Hurt Locker\" is the same.",
      "total_reactions": 15,
      "user": "ryancarroll88"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2012
      },
      "score": 1,
      "text": "This is an excellent example of the politics of movie making. It's been said that this movie will demonstrate how the war in Iraq is remembered. This upsets me due to the lack of realism. Most noticeably, the fact that three soldiers do not run into the darkness alone to chase something that they may have seen. Nor did we risk soldiers to defuse bombs past the first months. Further, it's a rip off of the Lethal Weapon prototype. Unstable white guy paired with veteran black guy and they have over the top adventure. But the real insult? From the accounts of multiple vets, I have been told that District 9 was more realistic as far as reminding them of combat situations.",
      "total_reactions": 6,
      "user": "Redfordsto"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "text": "all my EOD friends thing this movie is the best comedy scifi they've ever seen. complete garbage, oscar winning my ass. I know people complain that it's a movie not a documentry, but come on you have to stick to reality at least a little bit. the scene where he pulls all those heavy artillary pieces out of the ground by the det cord and blasting caps... come on was he superman? each one of those wieghs at least 50 pounds. This movie was \"based\" off of a soldiers EOD experience, if he had done half of what he said he did in the movie he'd still be jail. this is just another movie made to get an Oscar, nothing more",
      "total_reactions": 6,
      "user": "uxoguy05"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "Please for anyone watching this move it is not at all accurate.  EOD rarely disarms bombs as it is too dangerous.  NCO's don't punch superiors in the face, you certainly would never find a SFC getting hammered drunk or sneaking off the fob by himself to interrogate someone, it is simply false.  These are huge falsehoods that completely turn the move into 100% fiction beyond the fact that the war in Iraq actually happened.  These would be the kinds of stories you would hear from an EOD private who was in the Green Zone for 12 months.  Anyone else who ever set foot in the middle east can tell you what a complete load of BS this movie really is.",
      "total_reactions": 6,
      "user": "dsj556"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 3,
      "text": "Its a downward spiral with overated movies. Inception,Monsters. I cant help but think its the pitch and the hype that does it when the Emperor has no clothes. Lets say its 'Eagerly awaited, theirs 'Oscar Buzz' before it even comes out and without paying attention that the 'Buzz' is coming from the people who market the movie.  I dont care who your are and how much you say you like this, I say your lying to yourself as its slow paced and boring (odd for a explosives movie) yet I argue with a mass of people who are eager for the new McMsg burger because someone on tv told them to.",
      "total_reactions": 3,
      "user": "guitarmahn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2013
      },
      "score": 4,
      "text": "This movie works only because it appears so real, it's the source of the suspense, the action, the atmosphere, characters, plot... etc. This is also why it fails. While it may be more accurate than many other war movies, this one was built on realism. However an informed viewer will note that the movie does not portray well the soldiers' lives and the Iraq war. Many bomb squad members said so themselves, including the ones that were interviewed by the movie makers. All the portrayed military operations are inaccurate. This movie is a lie. However can it still be viewed as a regular war action movie? I'm afraid not. Without the sense of reality the movie loses all interest. To conclude, not only does this movie fail at what it sells for, which is a close enough portrayal of wartime, it also fails as an action movie. The only praise I can give is the amazing work achieved by the actors. You will enjoy this movie though if you do not know much about the Iraq war, like most Americans unfortunately.",
      "total_reactions": 3,
      "user": "Roeyl"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 4,
      "text": "This is a movie about bombs. Lots of bombs. Desert bombs.",
      "total_reactions": 3,
      "user": "G_Thomas_Boston"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2011
      },
      "score": 0,
      "text": "the worst movie I've seen.... is not about war.... is about American idea of hero... Its boring and don't have argument ... I can't understand how this movie won an oscar",
      "total_reactions": 10,
      "user": "nanna"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2011
      },
      "score": 0,
      "text": "That people are giving this movie a ten, and that it won an Oscar shows just how desperately out of touch Americans are. Gross inaccuracies aside, and this movie is riven with them, the fact that this director had so much going for her in terms of the innate interest stories like this generate, and the timeliness of its release, and she blew it so completely, is very telling. It tells of incompetence,  and indifference to the people she pretends to care for and about. If she really cared, then the amateur to the stark errors she makes in this movie would have been removed, and she would have gotten at least some things right. Otherwise you're just out to make a name for yourself, and f*** you for that.",
      "total_reactions": 5,
      "user": "egovirus"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "Overrated movie, with unrealistic characters and no real story.  Too much stupid Bravado and machismo.  I am reviewing this because Zero Dark Thirty is out and while Katherine Bigelow is sexy, she only got to be a director, because she was married To James Cameron. Nepotism.  I have no interest in seeing more fictional US military drama.  I'll pass.  Hurt locker was not that good.",
      "total_reactions": 5,
      "user": "wisertime"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2011
      },
      "score": 2,
      "text": "this movie is a disgrace to the armed forces and has debased the Academy Awards by winning the Oscar for best movie. If you like cowboy movies, you'll recognise the characters but feel let down by pretty much everything else.",
      "total_reactions": 15,
      "user": "Damian"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "The movie's quiet tension adds realism to the movie, making it one of the true modern war films. However, the film's noticeably lethargic pace will make you bored. In the end, \"The Hurt Locker\" is just a decent movie that presents real life situations in modern warfare; no more, no less.",
      "total_reactions": 10,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2012
      },
      "score": 0,
      "text": "I realize this review is coming a little late but I see the same director is now birthing another one of her 'realistic' films about war  (Zero Dark Thirty).  I love hard hitting action films as much as I HATE political propaganda and that is what the Hurt Locker is.  I was completely bored with the \"crazy-American-cowboy standing-alone -against-all-the-whimps\" theme.  Maybe this film director/writer should  join up and see what a real war feels like.",
      "total_reactions": 6,
      "user": "Itchy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2011
      },
      "score": 2,
      "text": "One of the more over-praised movies in recent memory - really just another hyperkinetic mess from Kathryn Bigelow (one of the more over-praised directors working today). The main character is a cliche, the \"loose-cannon\" action hero, only in this case there is no explanation for his risk taking. Jeremy Renner plays the character with his typical lack of range or subtlety. The only interesting actor is Ralph Fiennes as the leader of a band of mercenaries, but he's only on screen for a few minutes. Altogether a waste of time.",
      "total_reactions": 4,
      "user": "StPaul1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "Personally, I don't feel that \"The Hurt Locker\" deserved all those Oscar awards and that it's slightly overrated but I don't deny that it's a really damn good film. It's tense, complex, violent and action-packed. The story is well planned and written and the acting is fabulous.",
      "total_reactions": 4,
      "user": "Official"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2013
      },
      "score": 3,
      "text": "\"The Hurt Locker\" is, at times, very gritty and gripping entertainment. Clearly, it caught the imagination of the Hollywood Limousine Liberal reviewing establishment, who gave it very high marks and ceded it a number of significant awards.  But how good is the movie?  Not really that good.  In particular, the movie presents a very destructive and inaccurate portrayal of what soldiers are really like.  Nobody as reckless and irresponsible as the main character would last ten minutes in a special weapons unit of any kind, let alone one involved in demolition work. The fact that so many Hollywood reviewers accepted such a ridiculously inaccurate portrayal establishes that this kind of portrayal is currently Politically Correct. It is what Hollywood wants to believe soldiers are really like. A true work of art worthy of a best picture award would find the incredible drama present in the lives of our soldiers' *as they truly live them*.  Besides being inaccurate, the movie is also, in places, simply distasteful.  In constructing my final rating, I penalized it on that score.",
      "total_reactions": 4,
      "user": "JimInNashville"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "Entertaining, yet not anywhere near to reality. You wouldn't go off base by yourself without your gear. You wouldn't do half of the things they they did in this movie.",
      "total_reactions": 4,
      "user": "contract"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "When Sergeant James takes over a highly trained bomb disposal team stationed in Iraq, he surprises his team with his reckless and dangerous methods. As the battle continues all around them the team attempt to curb their new leader before his actions have serious consequences for everyone.",
      "total_reactions": 2,
      "user": "drlowdon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "This is a great set up for what could be a killer war movie. But it isnâ",
      "total_reactions": 2,
      "user": "NathanFlynn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "The Hurter Locker might not be the best movie of the year but it certainly deserves more recongnition. A movie with such intense scenes and perfect editing that combines the drug of war within and on the ground.",
      "total_reactions": 2,
      "user": "csw12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "I cannot deny that 'The Hurt Locker' has a very specific power that does, in a way, attract people to it. It is a very boldly done war film about all the individual consequences of a war, something that has not been a standard topic of the genre. Yet, I was bitterly disappointed by it all, as it proved to be a disgustingly blatant work of American propaganda, whereby their political aggression is presented as a burden to those that willingly participated it. Who the f**k cares about what the war did to someone who, under the pretext of 'liberalization and democracy', behaved like a bloody dictator? I was utterly disappointed by all the awards the movie gained and I must say that the critical universal acclaim somehow escapes me, as I don't see any relevant acclaim that should be attributed to the movie. It is slow, effectively boring and dull, one-sided and biased and it actually borders some propaganda work, but without the chauvinistic subtext. But, yes, the glorification of the American Soldier (just to make it clear - America is not the problem here, it is the glorification of a phenomenon that should be condemned and I would say the exact same things if the film was about Congo, Cambodia, Britain or Guatemala) is there and it is absolutely sickening (I actually fell asleep for 20 minutes and when I woke up I concluded that I haven't missed a thing - enough said).",
      "total_reactions": 2,
      "user": "Arthur_S_Poe"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2011
      },
      "score": 0,
      "text": "Meh, I'm just gonna cut the **** this is one horrible movie. The fact that it won best picture of the year just shows how hollywood is all biased and about politics and congress. Over the years, the oscars have become nothing but a pitiful embarrassing sham with incredibly ridiculous nominees and arrogant hosts. You might as well pin it next to the VGAs in how pathetic it is. It's plot? You've heard it before, some guy goes to iraq, shows the hardships of the war, some people die, comes back to america, goes back, done. Nothing of interest or originality at ALL in this movie. Hell there's not even a story. Best part of all is the stereotypical black guy as the tough militant, nothin against black people, but the way they always portray them as bad ass military guys in tight uniforms is laughable. Really it's just an advertisement for the american military and government. It has what the government wants. Portray the US as the good guy and Iraq as the bad guy. Make working for the military look bad ass with some sniper rifle scenes and you got yourself a subliminal message \"join the military\" and a good ol **** you to avatar.",
      "total_reactions": 9,
      "user": "NoBS"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 3,
      "text": "This film is vinegar. Low budget unknown cast with cameo appearance by Guy Pearce and Ralph Fiennes who's flippant delivery summed up this film and probably his pay check.Guy Pearce gets killed before the credits finish.",
      "total_reactions": 7,
      "user": "wine-or-vinegar"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2011
      },
      "score": 1,
      "text": "I seriously felt like shooting my self in the head...... over Americanised **** basically all hyped up trying to say Americans are the heroes even though they have killed more of their own than they have saved (SPASTICS)    XD",
      "total_reactions": 7,
      "user": "1234"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "One of the most outstanding war movies this century.  I am a surprised a woman could even direct something as good as this one. Some people should really think about it, because it is kind of true. I am sure some people jsut hate it just because it beat Avatar in the oscars",
      "total_reactions": 12,
      "user": "Ransack"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2011
      },
      "score": 1,
      "text": "The first time I saw the trailer of the movie, I thought it wouldÂ´ve been an interesting one. I was wrong. It started OK but from there on it was totally boring. Critics applaud the film for the \"suspense\" in it and the performance by Jeremy Renner and its photography and storyline. What storyline? The film features a lot of \"tense ful\" bomb defusing moments or in other words, \"suspenseful\" situations one after another that, really, lead to no conclusion. The guy easily defuses the bombs with almost no problems. A rookie soldier would've made those scenes a little bit more tense...maybe. The characters were forgettable. There is no character development in the film. The scene where James is trying to \"find out\" who killed the little Beckham also has no conclusion because he just randomly went to the house of this professor and asked what happened to the boy and moments later he goes back to his base. Also that night, the bomb squad heads to this place where, yes you guessed it, another bomb has blown. And the three are in pursue of the responsibles for that bomb. In the end, one of them gets shot and no one is captured. Bottom line, the film's about suspense situation after suspense situation that lead to no conclusion. A great film is one that introduces new artistic ways for filmmaking, a good story, which this film does not have, good character development and a good screenplay and the list goes on and on. The Hurt Locker has nothing of those.",
      "total_reactions": 10,
      "user": "mdfize"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 2,
      "text": "This movie gets a 2, reason being because CG effects were great and acting was as well. However, the cast didn't fit together also these little cameos by famous actors were just boring and pointless. This movie won a bunch of academy awards and I don't know how? Hollywood is just lame in giving awards sometimes. They just give them to look good and to either make people mad or happy. This movie just makes you feel like you should die or try to die as you keep watching or living out your life. Yeah you could watch it, but don't expect to feel anything after this boring anti-war movie. It's basically just about being obsessed and it's like who cares give me something with meaning, you're taking up my life's precious hours!",
      "total_reactions": 5,
      "user": "epictvsaga"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2011
      },
      "score": 1,
      "text": "Some cool moments (like the sniping, didn't make any sense that a guy who disarms bombs knows how to spot and snipe guys makes no sense, to their own expertise or the story-line)  but the plot and characters, especially the main character ticked me off. The black guy constantly trying to kill the main character was the breaking point for me. We need to support our troops not act like every CO is a bastard with his men trying to kill him. The unpatriotic views makes me sick. The and the fact it has gotten great critic reviews is slander. One of the worst war movies I have ever seen.",
      "total_reactions": 5,
      "user": "Prowler477"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 3,
      "text": "I understand the importance of creating heroes surrounding the American military; however, I found this depiction overly run-of-the-mill. Sure, Jeremy Renner gives a fine performance--but I'm left missing some much needed heart.",
      "total_reactions": 5,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 2,
      "text": "I really didn't like this movie. it obviously didn't deserve an Oscar as Avatar was nominated this year...",
      "total_reactions": 5,
      "user": "Kiva"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2014
      },
      "score": 2,
      "text": "I suspect the high reviews that critics have given this is due more to the fact the media is filled with liberal defeatist cowards because the film itself was boring, boring, boring. I could hardly stay awake.",
      "total_reactions": 6,
      "user": "AtomicDog"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Realistic or not this is a great film. The plot was laid out in an organized fashion, no cliche twists that make the viewer feel smart. The characters were well written and are open to interpretation. The amount of small details and varied sequence of events makes an easily film to watch multiple times.",
      "total_reactions": 3,
      "user": "eggfillet"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2011
      },
      "score": 4,
      "text": "I was extremely disappointed with this movie, the story is boring and the characters are impossible to like, there was only one good part and it was extremely short and had all of the movie been like that moment it would have been fantastic, but instead it's a bad movie that isn't enjoyable.",
      "total_reactions": 3,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "Entirely typical wartime propaganda that actually very forcefully tries to paint the citizens of the country being attacked and exploited as the bad guys. Absolutely vile.",
      "total_reactions": 3,
      "user": "raidet"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "**** awesome movie. Enough said but since there is a 150 character min I mus say random **** Blahahahahah Dick fart lolololololololllllllllllllllllllllllgfgfgf",
      "total_reactions": 4,
      "user": "TheTacoShack"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "Hurt Locker was very good. The acting was really fine, the plot moved along and it exceeded my expectations. There was a nice sense of humor within the continued suspense. The connection between the protagonist and the boy selling DVDs humanized the already very human story.",
      "total_reactions": 5,
      "user": "lholz"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2011
      },
      "score": 5,
      "text": "Full patriotism without good history.",
      "total_reactions": 5,
      "user": "eduardopo"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "I went into this movie expecting Black Hawk Down but I wasn't disappointed when i didn't get it, instead i really enjoyed the slow paced yet interesting story. Critics enjoyed this movie for a reason, they are professionals who have studied hard in the field of film, they know what they're talking about.",
      "total_reactions": 5,
      "user": "chicagopiano"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "this movie is beast!!!!!!!!! all the negative reviewers suck. thats right mofos.... you suck!!!!! the best war movie that ive seen, and the greatest movie since shawshank!!!!! hell yea!!!!!",
      "total_reactions": 5,
      "user": "Peter"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "A war movie with real complicated protagonists. Great tension, great action but great psychological intrigue too. War is a drug, and so is the movie",
      "total_reactions": 1,
      "user": "tonyGreen"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "Well deserved Oscars. Jeremy Renner's performance was memorably outstanding. I watched both HL and Avatar the week before the Oscars and I found this to be more engaging and thrilling than the flashing lights and sounds of Avatar. I'm not saying that Avatar wasn't a good movie but how many people actually saw HL before Avatar? 48 million to 2 billion box office gross (rounded down)",
      "total_reactions": 1,
      "user": "ZMP17"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "I certainly did enjoy this movie. Characters were more likeable than I thought. However, I felt the plot involving the Beckham kid wasn't resolved, and that still bugs me.",
      "total_reactions": 1,
      "user": "gm101"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "Direction is excellent the actors are perfect but the plot is a little weak. The director has done a perfect work also the main actor is absolutely perfect.",
      "total_reactions": 2,
      "user": "riverwalker"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "This is a great movie, the film captures the real emotion of being and war- People have empathy during this movie, you can feel the bullets. It is one of the best movies of the decade. It's sad if you can't handle violence but you wanted to see it. It was one of my favorites",
      "total_reactions": 3,
      "user": "RyanLopez"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2011
      },
      "score": 5,
      "text": "This is the most overrated film of last decade in my opinion. How did this win best picture? Sure, the movie gets the intensity of the Iraq war on screen in a good fashion, but with awkward pacing, boring situations, and most importantly, a nonexistent story, The Hurt Locker really is \"Hurt\" by many of its flaws.",
      "total_reactions": 1,
      "user": "Moviebuffreview"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Certainly one of the most emotional movies I have ever watched. I was completely immersed in the characters and story line. I was left both breathless and aching for more. I was still thinking about it months later. Can any film expect more than that?",
      "total_reactions": 1,
      "user": "ZoeR"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Unconventional war film -  Kathryn Bigelows independent film puts all politics aside and portrays the genre of war film in a fresh and different way.",
      "total_reactions": 1,
      "user": "Sindri"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "Good to see a war movie that is not all about shootouts and gunfire but it's not the best war movie by a long shot. The acting and directing is good and it held my interest but that's about it.",
      "total_reactions": 1,
      "user": "rotku"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "I did not care about watching this movie, yet having seen it I can agree that it is a great action film. The Hurt Locker creates a great amount of tension in many of its scenes, and it is a very exciting film. The acting is brilliant, particularly that of the lead, which contributes to the story's believability. In different times it probably wouldn't have won an oscar, but ultimately whether it did or did not is irrelevant. The Hurt Locker is more than worthy of watching and very entertaining.",
      "total_reactions": 2,
      "user": "Cotts1988"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "The Hurt Locker is no ordinary war film. In fact, setting aside the iconography and setting of the Iraq war, it's scarcely a war film at all. Rather than making an explicit judgement about the Iraq War, the film instead shifts focus to people and relationships, and how a single moment can change your life forever, or suddenly end it. The best, and most thought provoking scene in the film is one of relative calm, when EOD Seargeant Will James (Jeremy Renner) is on leave from active duty, and looks simply lost while wandering down the cereal isle of an American supermarket. Renner is excellent as James, who is essentially an adrenaline junkie, an addict to thrills and near death experiences, and who is obsessed with getting his next fix. Anthony Mackie and Brian Geraghty also impress as James' squad-mates, a by-the-book straight man to James' impulsive maverick leader and a jittery and inexperienced young specialist respectively. Guy Pierce and Ralph Fiennes are good as always in minor but quite pivotal roles. The characters are layered and interesting, the expertly paced, sweat-inducing bomb disposal scenes smartly replace the standard running-and-gunning battles found in almost all other war films (there's only one straight gunfight, and even that is drawn-out and minimalistic) and Mark Boal's script is believable and dramatically affecting. I'm quite ashamed to admit that this is the only one of Kathryn Bigelow's films I've seen, but she's undeniably talented behind the camera, grounded and naturalistic in her style (other than using a little well-executed slow-motion for the biggest set pieces) and most pleasingly, unlike her ex-husband Mr Moneybags Cameron, she doesn't yet appear to have been consumed by her own hype. The Hurt Locker is a masterful piece of dramatic storytelling, an excellent analysis of the driving forces of humanity, and one of the cleverest examinations of the impact of war to ever grace the silver screen. It's a crime that no woman before Bigelow has won the Best Picture Academy Award, but The Hurt Locker sets a fine example as the first film to break this trend, and it didn't need in excess of $200,000,000 to do it.",
      "total_reactions": 1,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "This is a great picture that is able to capture a tense moment on film. There will be a great deal of intensity that will place you on the end of your seat. This is the best war movie of the decade.",
      "total_reactions": 1,
      "user": "cylixdemas"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "This little Kathryn Bigelow box-office failure ended up proving that it was the little engine that could. It defied the odds: it was a Summer release that was under-viewed but somehow managed enough buzz to rightfully overtake the box-office behemoth \"Avatar\" at the Academy Awards and take Best Picture. It may not be a film for the actors, but it is a film for anybody who likes to be wowed by amazing sights and amazing direction.",
      "total_reactions": 1,
      "user": "Beau"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "If I had the choice between The Hurt Locker and Avatar winning Best Picture. I probably would have gone with this movie. I watched 60 minutes segment of the real bomb squads in Afghanistan and this movie was really accurate. The movie is really intense and has electrifying performances.",
      "total_reactions": 1,
      "user": "j30"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "I watched this movie a long time ago, and i jut recently came back to this review because this movie was featured in the \"biggest gap between critics and fans article\" so i thought I should look into it because this movie was just fantastic, and I'm really disappointed as to why this movie was on that article. First things first, this movie is not a patriotic movie; this movie is there to show the dehumanizing effects warfare can have upon a person, so I don't know why people can call this a \"flag-waving\" film when it clearly shows a man practically abandoning his own child to re-immerse himself in warfare. Second, a lot of people complain about the \"Sniping\" scene as being too boring or just plain unrealistic; this is not Call of Duty, okay... When it comes to sniping in real life, it can take hours to kill a specified target, there is no killstreaks and no quickscoping and if staying in the hot sun all day means that the enemy won't snipe at you back, then that's the best option to take to make sure you get out of there alive (the only thing that seems unrealistic is how an IED Unit has great skill when it comes to using an M107, that evades even me, but that's not reason enough for me to call the whole scene unreal). In truth, this is one of the greater military movies that I have ever seen (It defiantly stacks up mo movies like Apocalypse Now and Platoon, not saying its better, that's up to you, the viewers) and this movie didn't deserve to be in the previously mentioned article just because its not CoD-leveled action or just cause it doesn't have explosions every single microsecond. Definitely a movie worth watching (if you haven't already) if you are into the classical Vietnam-era films, you won't be disappointed.",
      "total_reactions": 1,
      "user": "Seifer706"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "I am not quite sure what exactly Kathryn Bigelow is trying to accomplish here. She makes a good work by adding tension and realism in some scenes and film itself is well-shoted, but 'The Hurt Locker' spends too much time talking about, well, nothing.",
      "total_reactions": 1,
      "user": "Potter17"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "THE HURT LOCKER is an emotional, well-directed and well-acted war film that is quite well made.",
      "total_reactions": 1,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "The Hurt Locker is an energetic, pulverizing movie that really shows you what its like for the troops on the other side of the country, and, is supremely well acted. Go see the hurt locker while you can",
      "total_reactions": 1,
      "user": "kingasa2020"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "In a few short moments...everything will change, in this instance, for all war films to come.",
      "total_reactions": 1,
      "user": "StevenF"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "7 out of 10 by users as of December 2011, really? It deserves better than that! Sure, it is no Saving Private Ryan but it has a VERY intelligent plot involving bombs and the war sequences are entertaining. Besides, the reconnaissance scenes are very unfolding and suspenseful which is the most thrilling part of the movie.",
      "total_reactions": 1,
      "user": "Jedi_Jettson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "I liked it. I thought the movie was original (which is rare these days) and well worth the watch. The acting was good, the movie was suspensful. The one flaw with it is that the climax wasnt satisfying. The entire film built up to this point that just totally let me down, Even to the point where it was a bit predictable. Still, It was a good film and worth the watch.",
      "total_reactions": 1,
      "user": "spadenx"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "This is a very good movie. I don't know why so many people are whining about the fact that this isn't realistic. It's a film, it's art, it's fiction, if you can't watch a movie without thinking it's ALL true, and it's all realistic, then you shouldn't watch any movie. Of course the protagonist takes risks which can not be the reality, but it's movie - use your imagination, this is made to entertain people, it's not a documentary, just enjoy it, don't think too much. Great acting by all actors - I believed the emotions, very well done - nice cinematography as well!",
      "total_reactions": 1,
      "user": "Dongangstar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "An intelligent movie that intrigues and excites. It is dramatic, tense and the odd bit humorous. This is one of the few films that I would actually call a masterpiece",
      "total_reactions": 1,
      "user": "Connor_Monteith"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "Typically for the US. Don't get me wrong this is a really good movie. But the whole time I had the feeling this is a \"come on and join the army - it's great here\" movie. Sure there is violence and war and bad times and everything but the way it's shown to the audience is like a propaganda movie pro army - and that's what I ment by typically for the US. Hollywood can't produce movies without this sideeffect and that's a little bit annoying. It should be an anti-war movie but it's more like a pro-war movie. Beside that it's a really good movie!",
      "total_reactions": 1,
      "user": "JaySupertramp"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "First off, this is a 9.75 out of 10. Near perfect. Acting is really good. Everyone give a really good job. Score is really good. Story is really great and is also intense. It's a great war tale of the US bomb squad. Plus some scenes in the movie can be so intense that'll it'll keep you guessing what'll happen. Overall, this is a amazing movie. One of the greatest war movies ever. Highly, highly recommended.",
      "total_reactions": 1,
      "user": "Juanolo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "The story of â",
      "total_reactions": 1,
      "user": "AwesomeReviewer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "It's a great movie very good story the only part I didn't like is when he sees bekham again after he thinks he's dead and he disses him??? WTF?? All he wants is to do is play  some soccer and he disses him? Really??? I really hated that scene and for that I give it an 8 but overall good movie way better than jarhead tho.",
      "total_reactions": 1,
      "user": "owendreamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "A well crafted, well acted, tense war movie. The book ends of this movie are about as entertaining as a film can be. My problem with this movie comes in the middle third. There are some things at play here that took me out of the film completely and seem very out of place with the rest of the movie. Overall this is a very strong film.",
      "total_reactions": 1,
      "user": "seancriswell"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "Finally a war film about the middle east that doesn't try to be too intelligent yet is seemingly aimed at intelligent people. A wonderful film which was hands down better than Avatar though I did think that other films were overlooked for Best Picture. Jeremy Renner evolved in this film from supporting actor in an action film to a fantastic lead in a serious film. This was a huge turning point within his career.",
      "total_reactions": 1,
      "user": "dev92"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "This is a great movie and one of the best war films I ever watched. The only thing that I didn't like was the use of the shaky camera, but it doesn't really distract from actually telling the story. Personally, I just don't like shaky camera but most of the time it was used in this film was from the main characters' perspective (you got a glimpse of what they saw). When I actually did see the shaky camera it didn't really physically make me nauseated but it did annoyed me.",
      "total_reactions": 1,
      "user": "Penner"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "I found myself liking the first half of the film a lot, but when the film hits the unnecessarily long sniper sequence, it all starts to go down hill. I never really found the 2nd half to be as compelling as the first half, and I started to care less and less with where the plot was going. In the end, The Hurt Locker is a decent, but severely over-rated movie.",
      "total_reactions": 1,
      "user": "Captain_Kirk"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": ": This movie told that war is a terrible place to live and when go in so deep in the war it becomes a drug and you don",
      "total_reactions": 1,
      "user": "ROHITBATMAN"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "Jeremy Renner is great in his role, but for me the film didn't live up to my expectations due to its length and not having as much action as the trailer showed.",
      "total_reactions": 2,
      "user": "Jack97"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Oh my God! One of the most perfect movies I've ever known. You could probably split this thing in half, and make two great works of cinema. There is so much suspense and drama packed into each and every beautifully shot scene that it almost calls forth the sweat on your brow. I ventured further onto the edge of my seat than I knew was humanly possible. When these soldiers are attempting to diffuse mysterious explosives, it almost feels like your well-being is in the balance as well. This long, exhilarating piece is just pumping at the edges with pounds upon pounds of heart-racing, pipe-bursting tension. The Hurt Locker is slow, punishing and weighs down upon you with a pressure that you don't want to stop. Masterful cinematography, directing, acting and vision. Everything is flawlessly clear both visually and intellectually. At no point did I find myself asking about the plot or wondering why something happened. It carries the mark of a great movie which is, you come close to forgetting that it is a movie at all. It becomes real. It leaves you utterly and hopelessly captivated. This was a film made with clarity, vigilance and purpose. So damn good I can't stand it. One for the ages.",
      "total_reactions": 2,
      "user": "YoursTruly"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "This is a very good movie about the Iraq war. I like Jeremy Renner a lot. the cast is very good and the story is awesome. I like this movie a lot. Best movie of 2009",
      "total_reactions": 1,
      "user": "Wiesy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "Despite the high degree i gave to  the film, but the film was a disappointment,  think it's not worth to win the Oscar for best film, there are no any surprises in the film at all, and there are some stupid behaviors  of the film main character Jeremy Renner and also the film pictures  the Iraqi people are very weak and I am an Iraqi I do not deny that, but say it was exaggerated, but what I liked most in the film is the realism in the presentation of the facts, And location of the filming that is very similar to the Iraqi environment despite the fact that the film images in Jordan",
      "total_reactions": 2,
      "user": "RAEDALSDI"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "Though it seems its inaccuracy and marketing hooks have struck a chord with a few, I found The Hurt Locker to be an enjoyable film. Ironically, it gives you a nice break from the typical explosion-after-explosion-war-action flick despite it focusing on EOD, with a slower pace and likable characters.  It holds just enough tension without crossing over into tedium, and uses it to its advantage to progress the story.",
      "total_reactions": 2,
      "user": "cmyk"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "Usually I don't really enjoy war films, but this one is fantastic. I've never seen a movie of this genre which is as genuine and gripping as \"The Hurt Locker\" with stunning actors and a touching story. Kathryn Bigelow's film leaves me stoked behind.",
      "total_reactions": 2,
      "user": "mailinh"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "I enjoyed Bigelow's film very much--it's a very accurate depiction of the unique problems both of the war in the Middle East and that soldiers of any war face--that fighting and surviving is all they know, to the deficit of everything else. I understand why it was shot the way that it was, though handheld, jerky movement isn't my cup of tea. This film gets a lot of hate because it beat out Avatar at the awards ceremonies. Though it's a very good film and deserving of great recognition, I don't think it's the best that Bigelow can do. I'm curious what she's going to try next.",
      "total_reactions": 2,
      "user": "talisencrw"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "''Excellent.'' ''Brilliant!'' ''Full of Suspense and Intensity.'' '' An Absolute Knockout! The first 12 mins will mess-up your life. One of the Best Films of the decade. The Best Action film I've seen in year's. The Actors are winning. The Film editing is brilliant. The Best Action-'Thriller ever made! Renner, Mackie and Gerahty were Terrific.",
      "total_reactions": 2,
      "user": "JpJuario"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "It's rare to find a realistic intelligent film. This is one of them.",
      "total_reactions": 1,
      "user": "MarkT2014"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "Every single negative review I see on this site is due to \"inaccuracy\".  Film is art ladies and gentleman, not reality.  No matter the subject matter, any and all disbelief should be suspended when watching film.  This is a classic mistake of many movie goer who expects realism.  Look at elements and themes within a film, and stop tallying up real life impossibilities.  This film is a masterful work of art, thematically and emotionally.  There is a reason for the 94 meta score on this site, it does not lie.  The film is great.",
      "total_reactions": 1,
      "user": "ChazeMan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2015
      },
      "score": 10,
      "text": "First of all, this movie is not 100% realistic. If you want that, go watch a documentary or war footage. This was still produced by Hollywood, but I guarantee it is the most realistic war movie Hollywood has produced in a long time.",
      "total_reactions": 1,
      "user": "Regn752"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2016
      },
      "score": 9,
      "text": "Once again, I feel disappointed with users. The Hurt Locker will make you keep on loving and loving because of its side-to-side story that just can't move anywhere from the locker.",
      "total_reactions": 1,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "This movie was intense from beginning to end. However, it's the only film I've watched that I have loved and hated the cinametagraphy at the same time. Well placed and with fantastic directing one of the better was movies ever made. I'm very glad this won Best Picture.",
      "total_reactions": 1,
      "user": "AquaMorph"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "One of the best war movies i seen!! Very real and very intense!! Good movie worth the watch.",
      "total_reactions": 1,
      "user": "choomtabi31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "A masterpiece of cinema plain and simple. It's wonderfully crafted, perfectly paced, with incredibly tense sequences that would have made **** proud. It also deals with the effects of war on the human soul without ever being ham handed or melodramatic. Along with Saving Private Ryan and Letters From Iwo Jima it's the finest War film I have seen of the last 20 years.",
      "total_reactions": 0,
      "user": "Christopher_G2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "New man joins bomb disposal team in Iraq, day-to-day job of diffusing bombs & avoiding crossfire, camaraderie, conflict, decisions.",
      "total_reactions": 0,
      "user": "ERG1008"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2010
      },
      "score": 4,
      "text": "This movie is like a 4 day old pizza. Bland, run of the mill, and generally lucklustre. The fact that it scored the Oscar nod only confirms the suspicion that politics, rather than substance, is the name of the game when the red carpet is concerned.",
      "total_reactions": 0,
      "user": "optic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "I think hand-held camera is a modern technique in nowadays cinema. Thiz movie was using a lot of those shaky-camera techniques. The picture painted by no specific tone. All we saw just what we saw through our naked eyes. I knew that maybe they just wanted to capture things as realistic as they could get. But is that effective? Personally for me, I do not like it at all. The conventional movie makers had been trying to brush their picture into some kind of atmosphere. There is the art. If we let everybody treats the movie like thiz. I think anyone could make thiz kind of movie as long as they had their expensive digital camera. The movie played by second-class Actors which the most proportion went to two characters (Jeremy Renner and Anthony Mackie). Their performances were adequate. The other Casts were: Brian Geraghthy, Guy Pearce, Ralph Fiennes, David Morse, etc. The story itself contains no main-plot. We are just watching case by case about what is happening. The only thing that I respect on thiz movie is how the action scenes go. Previous warfare movies relied on big battle scenes with Big Boom Bang, like we saw on SAVING PRIVATE RYAN (1998) and BLACK HAWK (2001). But thiz movie was using The Horror Formula (That was what I called). The scenes had been trying to create the tension by waiting something to happen next. Some of scenes were successfully pace our adrenaline. The movie directed by Kathryn Bigelow, The Director of POINT BREAK (1991) and K-19: THE WIDOWMAKER (2002). Overall, it is not a great warfare movie ever made compare to legendary APOCALYPSE NOW (1979) or FULL METAL JACKET (1987). Although I am fully support a woman Director to direct thiz kind of genre.",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2015
      },
      "score": 10,
      "text": "I have never really enjoyed war films. I am by no means a pacifist, but to me all the stories seem to be the same, and until now, I've been uninterested. It wasn't until viewing the Academy's best picture of 2010, The Hurt Locker, that I started to see things differently. In these films, it's not so much the story line that matters, but rather the characters that are featured in the film. The description of The Hurt Locker is just as bland as any other war picture, the story of a unit in Iraq that is responsible for disarming explosives. What makes this film so unique and made it the best film of 2010 was William James, played remarkably well by Jeremy Renner. Renner is known as an action star, so when I saw him nominated for best actor, I couldn't believe it. The truth is Renner's performance in this film was outstanding, because for once, he simply played himself. Renner may have been portraying a Sargent in Iraq, but the personality was his own. Director, Kathryn Bigelow, has become known for letting actors be themselves in developing their characters personalities, to the point where even some of the dialogue was in the spur of the moment. The Hurt Locker is a powerful film, with remarkable events and heartbreaking moments, but it's the films personality that is larger than life. I enjoyed every second of this film and it was truly the best choice the Academy could have made for best picture.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "This is a prime example of an over-hyped movie, that in all cases did not deserve an Academy Award. The plot is incoherent - each and every scene is pretty well executed and tense, but the story just drags for too long and just does not make sense as a whole. The acting was pretty good though - Renner's performance as an adrenaline addict was pretty remarkable. All in all not bad, but not very good either.",
      "total_reactions": 0,
      "user": "jakub02"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "I personally think it's incredibly underrated by users. Hurt Locker was a well done film. It was interesting to watch, well acted, and manage to suck you in all at the same time. Definently worth watching imo.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "It is certainly an attention grabber the moment the movie begins, but then it seems to just be repeating the same sequences over and over until it is a little boring. Editing was great along with the script. Overpraised, but it still a good movie that has a lot of great qualities.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "It was honestly nothing more than ok. The acting was really good and the directing was good, but at the end of the day, I'm not entirely sure what the plot was (yes, he disarms bombs, but it leads to nothing), which is an obvious turn off and it's honestly really slow at times. Unsure how this won an Oscar.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "At its best, Hurt Locker totally captivates the feeling of being there alongside Jeremy Renner and defusing the bomb rigged to explode. But sadly if you look past it's peaks moments, you find confusing scenes and poor acting. As an European, Hurt Locker doesn't really give you that much content or make you attached to the characters. I had absolutely no feelings towards Sergeant James (Jeremy Renner) and his crew, and because of this the tension about the bomb exploding or not was weak. It doesn't help at all that the characters have almost no background, especially the lead character was left blank.  There are some great scenes like the sniping on the desert and defusing of the car bomb. but to balance it out there are some odd ones like the scene in which they have a drunken brawl in the barracks. Also the plot is a confusing mess of highlights, that doesn't seem to start or end. The shots are beautiful and sharp, and the scenes are very real-like. A lot of the credit for the movies success goes to the film editing and cinematography departments. Somehow i still feel the movie is widely overrated, and doesn't really bring anything new or make the existing better. I think this is a national matter and Americans do enjoy this film more than us Europeans do, the subject of Iraq war is somehow reluctant to us, and bonding with the EOD-squad in two hours is very hard.",
      "total_reactions": 0,
      "user": "Tupe_N"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "The Hurt Locker is spectacularly suspenseful.",
      "total_reactions": 0,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "An excellent movie. Well-made and well acted, The Hurt Locker is an evocative and poignant picture of the War in Iraq and its soldiers. Jeremy Renner's character in particular is one of the most interesting characters in a war movie to date: A Cavalier and Good-Natured Cowboy in an IED suit.",
      "total_reactions": 0,
      "user": "Caesaroctopus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2017
      },
      "score": 3,
      "text": "This movie is not only blatantly inaccurate for a war movie, for a work of fiction it is still scripted and directed very poorly. How this movie became hyped by the press is beyond my understanding.",
      "total_reactions": 0,
      "user": "Xaotic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "This is a truly powerful film.That job is pretty though and the movie shows it perfectly even if the movie is inaccurate with this job.With a very good script,an original idea,convincing characters and very good acting,The Hurt Locker is an awesome movie.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 1,
      "text": "It is an absolutely horrible , one sided movie that brings nothing new to the white screen . Oscar winning ? It is rather embarrassing . I would expect from bigelow something brave and innovative. I wonder we Hollywood will be brave enough to the Iraq war and face with reality .",
      "total_reactions": 0,
      "user": "Sebe2012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "The Hurt Locker isn't about war, per se. I personally am not a fan of violence and for that reason tend to shy away from these types of movies as well as knowing a lot about combat, like was happening here. But I still found myself sitting at the edge of my seat (or bed) in anticipation.",
      "total_reactions": 0,
      "user": "hanneguacamole"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2016
      },
      "score": 0,
      "text": "This movie came out while i was in Afghanistan hunting IEDs. This hero filled war porn does not reflect what we did and makes a mockery of the teams of men who worked as professional, cohesive units to do this very difficult job that the cowboy protagonist does all my himself while in a constant state of rebellion and with total neglect for the intricacies of army teamwork.  My mother saw this film it put all sorts of new dread into her for my safety. That pissed me off too. Clearly I'm biased and maybe if I were a civilian I might like this sort of film but from this Vet's perspective Hurker Locker gets two raging thumbs down.",
      "total_reactions": 0,
      "user": "John154"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2016
      },
      "score": 10,
      "text": "Im truly interested into watching a quality films only. And I think I developed a sense of quality film production. This is the one. Totally satisfied with actors and the writing. The only thing which sucks is  -> the film like this should be longer for 1 hour more like 3.5 hours of   \"highly realistic film\" which  suck my attention for the whole film into it and when it was done I wanted more but. If you want highly relistic film and anter into film to forget eistence than action drama hurt locker is for you.   A MUST TO SEE.... very cool. actors does not feel to act at all ut so real....",
      "total_reactions": 0,
      "user": "virtualPresence"
    }
  ]
}