{
  "mc_avg_user_score": 5.2,
  "mc_metascore": 28,
  "mc_mixed_rating_frequency": 35,
  "mc_movie_name": "The Ugly Truth",
  "mc_negative_rating_frequency": 46,
  "mc_positive_rating_frequency": 58,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "Your average romantic comedy. Butler and Heigl have fun with the roles but nothing else in this film tries to impress or entertain above the average level. Standard.",
      "total_reactions": 2,
      "user": "TargetF209"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "A predicable but extremely enjoyable movie that uses its characters to its advantage to give the audience the best experience possible. The Ugly Truth is a hilarious romance/comedy with a Stella cast and plenty of collective laughs!",
      "total_reactions": 1,
      "user": "busbfran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2010
      },
      "score": 2,
      "text": "I fell asleep at the cinema despite people roaring in laughter. I kept asking myself what was so funny. The movie was predictable from the beggining as I tried to enjoy it I failed and left Kathrine Heigl at a hotel room.",
      "total_reactions": 0,
      "user": "kk10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2011
      },
      "score": 4,
      "text": "Katherine Heigl and Gerard Butler are charming and funny at times. However, The Ugly Truth is immensely predictable and overly cliched, lacking both intelligence and chemistry between its leading actors.",
      "total_reactions": 0,
      "user": "KendylKlownfish"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2011
      },
      "score": 3,
      "text": "A weak romantic comedy that revels far too much in sex, sex references and pretty much anything else to do with sex. In fact, I can't think of a single joke that was unrelated to sex. I have no problem with sex jokes but when they are the only jokes on offer it makes the movie into a one trick pony. It pigeonholes itself into one form of comedy and this begins to grate very quickly. The chemistry between the leads is none existent as is a reason why they would like each other in any way beyond the physical. Their characters are unbelievable and the supporting cast is unmemorable. The Ugly Truth is so transfixed on pushing the boundaries of sex in comedies that it forgets that its primary job is to entertain.",
      "total_reactions": 0,
      "user": "ImUnavailable"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 2,
      "text": "Perhaps the worst movie I've ever seen. Katherine Heigl puts on a dreadfully self-conscious performance but of course it's difficult to act with a script that tries so hard to out-do superior comedies in raunch and humor.",
      "total_reactions": 0,
      "user": "JawsPapi87"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2011
      },
      "score": 0,
      "text": "If this movie was simply just a bag of awful jokes and formulaic rom-com cliches (yes, the movie actually takes itself seriously in the third act), this would just be a very awful romantic comedy. The movie attempts to be equally sexist in both regards, as if that somehow makes things better. But the problem is that the men and the women are portrayed as sexist in different ways. Men are given the treatment of shallow and sex-fueled without making light of the fact or satirically poking fun at it, while women are painted as the shrews that Heigl accused Knocked Up of representing. Oh, and here's cinch, the movie actually says that the men are right.",
      "total_reactions": 0,
      "user": "J-Shap"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2011
      },
      "score": 1,
      "text": "Started so good but ended been the same **** romantic comedy is the reason why **** like twilight exist, because the good romantic movies are now forget because of this **** movie style",
      "total_reactions": 0,
      "user": "RodrigoBGC"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "Gerard Butler is hilarious and Katherine Heigl is great and one of the more unique actresses in Hollywood. Together they have great chemistry in The Ugly Truth. The only real flaw in my opinion is how predictable the movie is though. Like most chick flicks, five minutes into the movie you know exactly how it's going to end. The crude humor is somewhat fresh in the genre though, as it's more of a guy comedy style, so it's still worth a watch.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "A 4? I can not believe .. How does such a good film can have a punctuation so low?",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "People, this is not such a bad movie!!!",
      "total_reactions": 0,
      "user": "cilincescu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "Must have seen this 100 times. Same old stuff, different actors. Boy meets girl, boy and girl fight, boy helps girl get other boy, girl and boy #1 realise they are in love....Why did I bother? Oh, yeah..for Gerard Butler...",
      "total_reactions": 0,
      "user": "ypomoni"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2014
      },
      "score": 3,
      "text": "Trite and fake... Despite what the title would like to tell you, there is nothing really truthful in this plastic fraud.",
      "total_reactions": 0,
      "user": "ArjanS87"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "A formulaic romantic comedy that has a predictable plot and has a poorly weak script, that has a terrible message also is sexist. The script written by three women Kirsten Smith, Karen McCullah (Legally Blonde, She's The Man) Nicole Eastman, who know somethings about women and know nothing about men, they were going to make an unpleasant man character, that men couldn't relate to, but they were too dumb to realize that all men could agree with Mike Chadway, it's like they meet a douche bag guy and thought: Hey he's really mean and sexist, so this how all men are and let's make a movie about it. You can't expect anything really it's just a typical average Katherine Heigl movie, where she always plays \"the good, like able girl\" and how she wants a man, you think she known better after starring in Judd Apatow's raunchy funny \"Knocked Up\" but now she stars in a bunch of lazy rom-coms. In Sacramento, a TV producer Abby Richter (Heigl) is romantically challenged and can't a good man that fulfills her; produces a morning show that's about to cancel, due to it's low ratings. To increase the ratings, her boss (Nick Searcy) hires Mike Chadway (Gerard Butler) to host the morning show, Mike hosts the popular mannish show called \"the ugly truth\" were he talks about what men want in a relationship. Of course Abby doesn't think that her boss hiring him was a good idea, so she hates him because he's sexist and disagrees with his strong beliefs of women and dating. So she lets him help her get her dreamy surgeon Colin (Eric Winter) next door. So Mike teaches her how to flirt, how to dress, act sexually. The film is obviously mean't for dumb people, but the film didn't fool me. But the film is pleasingly glossy and snarly, also has perfect comedic timing not to mention sexy. The chemistry between Heigl and Butler is charming and humorous, Butler masterly does a well built job as this mean spirited character and Heigl is striking and good as always, not mention cinematographer Russell Carpenter captures Heigl's beauty stupendous. Director Robert Luketic (Legally Blonde) makes this rom-com glossy, fun and is gifted when it comes to comedic timing also does a fine job with cinematographer Russell Carpenter. Grade B+",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2014
      },
      "score": 3,
      "text": "'The Ugly Truth' maybe has a \"hot\" cast but the ugly truth is that this movie relies on a lame script, boring dialogues and an amount of unfunny sentences that makes this flick unwatchable",
      "total_reactions": 0,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "An unlikely pair have to work together.  He helps her \"catch\" her dream guy by telling her what to say and do, knowing what guys like, the ugly truth about relationships.  The friction between these two is what makes an interesting story.",
      "total_reactions": 0,
      "user": "smiyamot"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "This was so funny. First ten minutes or so didn't think it was going to be very good, but then it really picks up. Good chick flick .",
      "total_reactions": 0,
      "user": "avamiller21"
    }
  ]
}