{
  "mc_avg_user_score": 3.7,
  "mc_metascore": 34,
  "mc_mixed_rating_frequency": 26,
  "mc_movie_name": "The Smurfs 2",
  "mc_negative_rating_frequency": 73,
  "mc_positive_rating_frequency": 32,
  "mc_pro_critic_reviews": [
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2013
      },
      "score": 70,
      "summary": "The genially goofy shenanigans, incredibly corny punchlines and Hank Azaria’s go-for-broke performance as the incompetent wizard Gargamel are very much the same ― an entirely welcome thing in a summer movie season full of so much apocalyptic Sturm und Drang."
    },
    {
      "critic": "Mike McCahill",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "The interplay between animated and live-action elements remains a selling point: Hank Azaria again gives exemplary pantomime as Gargamel."
    },
    {
      "critic": "Derek Adams",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 60,
      "summary": "What isn’t so charming is Azaria’s irritatingly over-egged impersonation of the Child Catcher in ‘Chitty Chitty Bang Bang’ – that and the headache-inducing 3D."
    },
    {
      "critic": "Steve Davis",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "Does the world need another movie about a bunch of miniature, blue-skinned humanoids with bulbous noses and perky bobtails; gnomelike creatures who wear floppy caps, live in mushrooms, and use the word “smurf” in every other sentence? Someone apparently thinks so."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "The trouble with this stunted sequel is that the doughy, blobby-hatted Smurfs are mostly window dressing for an abrasive slapstick bash built around a tiresome kidnap plot, pancake-flat gags about Facebook and ''Smurf-holm Syndrome,'' and Neil Patrick Harris mugging his way through the role of a daddy with daddy issues who once again helps out our heroes."
    },
    {
      "critic": "Bruce Ingram",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "The Smurfs 2 probably isn’t any worse than you might expect. On the other hand, it’s almost certainly not any better. It’s just a matter of figuring out how much punishment you’re willing to endure for the sake of the small child you’re taking to the movies."
    },
    {
      "critic": "Sean O’Connell",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "Almost everything about Smurfs 2 signifies an improvement over the original."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "Just as with the 2011 film \"The Smurfs,\" the new The Smurfs 2 is a passable mediocrity."
    },
    {
      "critic": "Loren King",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "That the mushroom-dwelling blue creatures still manage to be endearing even in their second big-screen extravaganza (in 3-D, no less) is about the best that can be said of The Smurfs 2."
    },
    {
      "critic": "Justin Lowe",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "Beyond a few chuckle-worthy one-liners and some amusing visual comedy, there’s not much to engage adults, although the wee ones should be distracted enough."
    },
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "It’s just a big blue blur – too anodyne to elicit more than heavy sighs, too full of Smurfs not to recommend solely to the under-eights."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "It would be too much to say that there’s a good movie somewhere inside Smurfs 2 looking to get out. But it wouldn’t be too much to say that sometimes, the movie we do have tries harder than we might expect."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "Unlike that earlier live action/animation hybrid, however, which had a cheery, almost campy New York fashion-industry setting, The Smurfs 2 is mostly loud and unfunny."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "A new, not very engaging movie featuring a lot of blue skin and household-name voices."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "There are a few laughs here and there, along with a couple of jokes for grown-ups uncomfortably squeezed in. But this is a movie made for two groups: small children and people who have fond memories of the TV show."
    },
    {
      "critic": "Matt Patches",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "Patient Adult Smurfs will be checking their watches as Excitable Child Smurfs lose themselves in the high jinks."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "It's the kind of cinematic cotton candy that youngsters will gobble up. Even more importantly, it's relatively quick, painless stuff when compared to so many other pint-sized entertainments out there."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 38,
      "summary": "This insipid, and sometimes awkward, blend of animation, computer generation and live action wastes a ton of talent and lacks a true sense of whimsy."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 38,
      "summary": "Filled with Smurf wholesomeness, Smurf puns and posi-Smurf messages about never giving up “on family,”  The Smurfs 2 still sucks Smurfberries."
    },
    {
      "critic": "Laremy Legel",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 35,
      "summary": "The Smurfs 2 is not so much of a film as it is a collection of images and sounds that bludgeon you."
    },
    {
      "critic": "Kevin McFarland ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 33,
      "summary": "The film undermines its rudimentary plot points at every turn with base humor."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 25,
      "summary": "In the ’80s, I hated Ronald Reagan, Bob Dylan and the Smurfs. It’s comforting to know I got one thing right."
    },
    {
      "critic": "Phil Brown",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 25,
      "summary": "Only adults with 'Smurf-holm syndrome' could love this film."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 25,
      "summary": "The Smurfs 2 doesn't even pretend to be anything more but the most base, sugar-coated family entertainment, the kind of things that parents won't even be able to comprehend, much less enjoy."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 25,
      "summary": "Raja Gosnell's particular zeal to modernize the Smurfs only develops this would-be family comedy into a shamelessly manipulative smurftastrophe."
    },
    {
      "critic": "Neil Smith",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2013
      },
      "score": 20,
      "summary": "It’s the same sappy drivel as before."
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 20,
      "summary": "Its tolerant messages remain buried beneath lame pop-culture references, hectic slapstick, fart jokes, and endless Smurf-puns that—Azaria's funny, over-the-top cartoon villainy aside—make one pine for the Smurfpocalypse."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 20,
      "summary": "The problem with Smurfs 2 isn’t the message, it’s the way the film repeats it so baldly and emphatically that even the youngest kids can get it. Also, the way it surrounds that message with groin-smashing and farting."
    },
    {
      "critic": "Simon Abrams",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2013
      },
      "score": 12,
      "summary": "Despairingly bland."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "summary": "There's so much torture and suffering in this movie, it starts to feel like \"Zero Dark Smurfy.\""
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "My review is simple  I took my three kids (ages 7, 5, and 3) to see it and they all laughed the entire time.  That's the target audience, so it works.  Most adults will not enjoy it, but it's not really for us.",
      "total_reactions": 2,
      "user": "ScrawnyPunk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "A pathetic unfunny film where it is so obvious that the people behind this had no intention of even trying to make a somewhat decent film. The live animation is horrible and kids will certainly not find this even remotely enjoyable.",
      "total_reactions": 2,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "The worst movie i ever seen in my life.Seriously,avoid this at all costs,no matter if you want to see or  not,avoid this awful movie at all costs.A total waste of money.",
      "total_reactions": 2,
      "user": "FRG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "This movie is one of the worst movies I've watched.I mean it has no story at all.And I don't think they should make another smurfs movie cause I know that It will be terrible.",
      "total_reactions": 2,
      "user": "ERB2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2013
      },
      "score": 3,
      "text": "While I fortunately have no idea how this stacks up in comparison to the first Smurfs movie, The Smurfs 2 is a tragic attempt at family storytelling that pales in comparison to the excellent crop of animations from earlier this year. When Smurfette (Katy Perry) is abducted y Gargamel (Hank Azaria) and his new creations, the Naughties, two white Smurfs called Vexy (Christina Ricci) and Hackus (J.B Smoove), Papa Smurf and a small group head to the real world to save her with the help of their human friends. While not completely unwatchable, The Smurfs 2 is a film solely aimed at children so therefore its bright, odd but supposedly wonderful things happen and it all works out in the end. It also means that the grown ups are forced to take their kids to it and must sit through some of the worst dialogue and story ever to grace the big screen as talented actors such as Neil Patrick Harris and Brendan Gleeson are forced to act like irrational buffoons. Harris gets the worst of it as he acts like a spoilt 14 year old boy for most of the movie (with a cringe worthy step father bonding relationship thrown in for good measure.). The voice work is find and the film doesn't drag per se but it doesn't entertain anyone but people who don't know any better and probably the criminally insane. My suggestion is if you have children wait for the DVD and then leave it for them to watch when you are out and the babysitter has to be forced to watch it.",
      "total_reactions": 1,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "I actually liked the first smurfs movie so i was looking forward to seeing what they could do with this and when i saw it i was dissapointed at how rubbish the film was. I got not many laughs out of this film and some parts where just boring for me. But i will praise the 3D that was really. Even though that i hated it kids still seemed to get a laugh out of it and even some adults will enjoy it with there families i just didnt like it",
      "total_reactions": 1,
      "user": "cool1707"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "Okay, yeah. It was a bad movie. But it was still funny. I found myself laughing at just how dumb the movie was, which to me makes it a little better. Also, John Oliver does the voice of Vanity, which is always a plus in my book.",
      "total_reactions": 1,
      "user": "shprea"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "This is truly one of the worst films I've ever seen in years, the first smurfs movie was horrible and it made a lot of money and this is even worse, poor done script, bad acting, bad CGI, Tasteless jokes and insufferable, now the cartoon that I Watched back in the 80's was one of the best cartoons ever made, cause it had something that the current smurfs movie lacked and that's a story.",
      "total_reactions": 4,
      "user": "thebestoftimes"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "Kids will enjoy the Smurfs because it's what we've now taught them, as a society, is a good movie for them. We're to blame here. Because we know that's not the case. We know there are animated films out there of merit that both kids and adults can enjoy together. But for some reason, a few of these animated movies go the route of being egregiously simple-minded and repugnant.",
      "total_reactions": 4,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "I enjoyed The Smurfs for what it was, seeing childhood characters on the big screen, interacting with humans, in a live action 3D animated film, it was funny and entertaining. But The Smurfs 2 recalls everything The Smurfs delivered to us, added with some new story and slapstick humor, it wasn't funny enough and wasn't that much entertaining, in fact, it was boring, recommended for only under 8, for them it will be the event of the year.",
      "total_reactions": 4,
      "user": "MovieGoer14"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "I never expect Avatar-like or Pixar like CGI from any movie, but these are terrible for a live action animated film! I can put this into the category of bad FX (where i put Jack the giant slayer as well!) Story wise, this is just a passable movie that single-digit-aged viewers can enjoy!(but forcefully) Shameless product placement,Strained plot contrivances, toothless humor are filled in this overstuffed plot! Just the same as the first one!(or even worse) Easily the worst animated film of the year, as everyone expected!",
      "total_reactions": 7,
      "user": "117dilushamc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "I cannot believe I spent my money in this kind of movie. The trailers make you hope a lot, but it disappoints you in every sense of the word. In my opinion \"The Smurfs 2\" deserves the \"Golden Raspberry Award for Worst Movie of the Year\". If you really want to see it, buy a copy, do not waste your money.",
      "total_reactions": 2,
      "user": "AlessandroOdo"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2013
      },
      "score": 0,
      "text": "Nutshell review: this movie stinks. Worse than this, buried beneath the all-sortsa-people-make-family message (delivered only sightly less heavy-handedly than the sledgehammered-into-the-frame product placement) was THIS message: The grey Smurfs are 'bad', and worthless to their creator Gargamel. They later become 'good' and of critical value to him, and are subsequently accepted into the Smurf community AFTER THEY CHANGE THE COLOR OF THEIR SKIN. Great message for the kids there, Columbia. I want my money back.",
      "total_reactions": 3,
      "user": "caveatscoti"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "This movie is meant for kids and people who love the smurfs tv show not for any adult and it does very well to please this category. The first movie wasn't great but this is head and shoulders better.",
      "total_reactions": 19,
      "user": "MRbossFTW"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2016
      },
      "score": 6,
      "text": "I liked the first one. Admittedly it's kind of hard to complain about this one as well. It's perfectly suitable for kids. The younger the better though. It's humor isn't sophisticated enough to make it a hit for the whole family. It's probably better to leave this one as a watch exclusively for the kids.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "I'm not sure if I like the first one or this one more. The absence of Gutsy and Brainy didn't work for me well, and the rescue part took a while, but that's pretty much all that I disliked about this movie. The action was fun, the character relationships were heartwarming, and the Smurf computer animation is still a wonder.",
      "total_reactions": 1,
      "user": "InverseCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 3,
      "text": "SMURFS !!!!!!!!!!!!!!!!!!!!!!!! . the only smurfs know is how to take shrooms . its kinda boring but its kinda gay . if 5 years old watch this they have a drug problem . but its 55 % enjoyable 99 % awful . Grade C- maybe a D-",
      "total_reactions": 1,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "OK been waiting for months for The Smurfs 2 finally arrived at the land of smiles (just about the most fitting place for Smurfs to live!)",
      "total_reactions": 0,
      "user": "Good-Smurf"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "Bringing the original to an even more unremarkable state, \"The Smurfs 2\" is plain out awful. With its overabundant uses of the word \"smurf\", and several other ludicrous remarks, adults and even kids will most likely be bored by the film, which is a huge disaster, as even kids find joy to almost everything put out there. With the lack of strong story elements, a handful of absurd jokes, with characters that have zero character development, or plot twists and turns, \"The Smurfs 2\" hits a low for kids film.",
      "total_reactions": 0,
      "user": "jeff_reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "I didn't care for the first film because it was just an annoying mess of bad jokes and bad acting--However, the special effects were decent.  Not much has changed in this sequel as the jokes are still really, really bad and the acting is hammy and groan-inducing but the story did feel like they were trying to add some emotion to it as we see Smurfette deal with the isolation of feeling like she doesn't belong mirrored with Patrick's stepfather desperately trying to be a positive influence in his life.  Sadly, this emphasis on story elements that feel like they have some heart to it are still surrounded by bad \"blue\" humor and acting gorged on scenery.  But the special effects are still decent...",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "I was not sure what to expect when walking into Smurfs 2.  Knowing the target audience was for little children, I didn't feel I was bound to enjoy the little blue critters for 100 minutes. Though I still wasn't a fan of the film, I did find myself laughing a few times, and seemed to be entertained with the story.",
      "total_reactions": 0,
      "user": "AlexProductions"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "The Smurfs 2 is a cool movie; a Rescue Mission movie. I like to impress Disney to get the Smurfs.",
      "total_reactions": 0,
      "user": "Oscar95"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2013
      },
      "score": 3,
      "text": "The vast majority of times the second is worse than the first, but Batman: The Dark Knight change that, The Smurfs 2 also did just a little better. There are several characters who never have imagined Peyo and entered in this film (as socialist and party planner). I seemed unnecessary wear and tear Brendan's character and the young Jacob Greeson Tremblay artante becomes to some extent. Another bad thing is that the plot remains very similar to that of the first (involving more than one theme in Smurfette). And another bad thing obvious end. What I liked entertaining and fun with good comedic moments for the younger children. Hank Azaria is a good actor who comes with snug Gargamel Peyo.",
      "total_reactions": 0,
      "user": "JNOTR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2014
      },
      "score": 2,
      "text": "Disappointing in every aspect. Smurfs 2 is a far cry from its predecessor...gone are the wise cracking, scene stealing favorites from the Smurfs first big screen, big city adventure. While the interaction between real life humans and make believe is as smooth as before, this is not nearly enough to make up for rushed scenes, poor character development and an unimaginative story line. Even the youngest critic in our house was bored and uninterested, despite an ongoing love and continuous playing of The Smurfs (1).",
      "total_reactions": 0,
      "user": "rjsluvbug"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 2,
      "text": "\"Smurfs 2\" 10 Scale Rating: 2.0 (Terrible) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2015
      },
      "score": 0,
      "text": "everything that was wrong with the first film which was alot like the terrible jokes boring plot ETC is back in ten fold this sequel is insufferably **** one of the most unfunny films i have ever seen",
      "total_reactions": 0,
      "user": "TheDude-"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2015
      },
      "score": 1,
      "text": "I saw this with my friend, and none of us were laughing. Its got bad jokes, a weird story worst of all, the most annoying song EVER! At least they're not making a third one... wait, they're rebooting it? NOOOOOOOO!",
      "total_reactions": 0,
      "user": "YellowKirby"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2015
      },
      "score": 1,
      "text": "And they won't stop with these Smurfs movies. Grab your equipment and call it a day while you're watching the movie. The equipment is there so you won't get annoyed by the Smurfs' singing.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2016
      },
      "score": 0,
      "text": "A sequel that does nothing to improve on the original, the smurfs 2 is just two stupid, boring, and completely uninteresting in any ideas it tries to crack.",
      "total_reactions": 0,
      "user": "gameguardian21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2016
      },
      "score": 2,
      "text": "The first movie was passable yet mediocre kids entertainment. The second movie is so much worse. There given an even worse script this time. how could this be rated higher than the smurfs which is while not far better is just a generally better acted and paced movie overall. Gone is the sometimes funny antics of gargamels cat, gone is neil patricks harris good acting skills gone is the bumbling yet evil wizard garagmel. Now he is just bumbling and not very evil. once again smurfette is an annoying damsel in distress and were stuck with two horribly portrayed smurf creations. The people behind the making of this were clearly not even trying to make a good movie. Everyone took 3 giant steps back from the last movie. What a forgettable and lame excuse for a children's movie",
      "total_reactions": 0,
      "user": "nahtan1244"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2016
      },
      "score": 2,
      "text": "The smurfs II is illogical, that uses the same bad story-telling and the same characters, with a very simple plot, nothing interesting to show, and a normal message that is not the same as its predecessor. Of course,Mathis is one of the worsts sequels ever. There's only a bad quality in this film, and nothing else.",
      "total_reactions": 0,
      "user": "Futuredirector"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2016
      },
      "score": 0,
      "text": "The first one may have been bad, but this is even worse. The kids is my theater were not laughing, and I fell asleep during the movie. Bad acting, bad plot, bad characters. hated it.",
      "total_reactions": 0,
      "user": "superbat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2016
      },
      "score": 1,
      "text": "The Naughties? SERIOUSLY!? Look, you may have a young target audience, but even my 6 year old cousin found that name unoriginal! Trust me though, that's not all. I do give credit to the movie that it's at least trying something newer than the first movie, but the jokes and scenes are so forced and clichéd. The only enjoyment from this movie is Hank Azaria as Gargamel. It's a fitting casting choice and he is quite good in this. Everything else about the movie will prompt smart people to stay the smurf away!",
      "total_reactions": 0,
      "user": "TheLonelyCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2016
      },
      "score": 5,
      "text": "OK been waiting for months for The Smurfs 2 finally arrived at the land of Peace (just about the most fitting place for Smurfs to live!)",
      "total_reactions": 0,
      "user": "SimpsonFans"
    }
  ]
}