{
  "mc_avg_user_score": 6.5,
  "mc_metascore": 53,
  "mc_mixed_rating_frequency": 13,
  "mc_movie_name": "The Big Year",
  "mc_negative_rating_frequency": 7,
  "mc_positive_rating_frequency": 30,
  "mc_pro_critic_reviews": [
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2011
      },
      "score": 83,
      "summary": "Frankel's movie is as refreshing as a walk in the woods and surprising as a chance encounter with the best that nature can offer."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "The Big Year is getting the enthusiastic support of the Audubon Society, and has an innocence and charm that will make it appealing for families, especially those who have had enough whales and dolphins for the year."
    },
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 70,
      "summary": "The Big Year turns out to be one of the smartest and funniest films this year."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 70,
      "summary": "If you're in the mood for some feathery fluff of the happy-sappy-and-not-wholly-unpleasant sort and need a break from snark, there is The Big Year."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 70,
      "summary": "Like birding itself, The Big Year rewards patience. It respects both the integrity and the eccentricity of the avian obsession, and it communicates something of the fascinating abundance and weirdness of the animals themselves."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 70,
      "summary": "The Big Year is better when it is examining the obsession of the birders, and Martin, Black and Wilson are enjoyable in toned-down mode."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 70,
      "summary": "Genial and mild, The Big Year doesn't give in to the temptation to juice up its story with outsized caricatures or inflated dramas."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 70,
      "summary": "The uniformly winning cast, led by Steve Martin, Jack Black and Owen Wilson, and the ultra-accessible touch provided by director David Frankel provide for a constant steam of gentle mirth, if not huge laughs."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2011
      },
      "score": 67,
      "summary": "The more I sat through it, the more it won me over in its very benign high-concept way. It's like \"City Slickers\" remade for the Discovery Channel."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 63,
      "summary": "Inspired by Mark Obmascik's book, the tale focuses on universal themes of pursuing a dream and tapping into an adventurous spirit."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 63,
      "summary": "If anything, The Big Year plays like Ron Howard's \"Parenthood'' with birds instead of children."
    },
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 63,
      "summary": "With ambitions greater than comedy and results that fall short of character study, The Big Year is neither fish nor fowl."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2011
      },
      "score": 63,
      "summary": "What this film from the director of \"The Devil Wears Prada\" does manage is a gentle amiability."
    },
    {
      "critic": "A.A. Dowd",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "The School of Rock funnyman flies highest; passion, be it for rare birds or the Yardbirds, is a plumage he wears wonderfully."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "This one could have flown over the cuckoo's nest, or smacked into a glass pane, but instead lands in the middle of the road where quirky and popular meet."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "Black fans may hardly recognize him, because for once he plays a person instead of a walking comedy mask atop a Buddha belly."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2011
      },
      "score": 58,
      "summary": "Even though none of these guys is ready to kick the bucket, The Big Year has an unmistakable affinity with \"The Bucket List.\""
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "The Big Year puts the focus on people who aren't inherently interesting - or funny."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Yet despite the efforts of an excellent cast headed by three top comedy names -- Owen Wilson, Steve Martin and Jack Black -- and tons of beautiful scenery (mostly British Columbia and the Canadian Yukon), this movie stubbornly refuses to take flight, or generate more than a few chuckles."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "The result is an offence-free, mild entertainment in which everyone from cast to scriptwriter seems to be winging it."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Those who should go near The Big Year, if not flock to it, are fans of avians, mild PG comedy and gorgeously shot travel footage dotted with humans."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Somehow, the comic chemistry never seems to ignite in The Big Year."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "This is a gentle, diffident concoction. But it has barely enough pulse to power a hummingbird."
    },
    {
      "critic": "Brian Lowry",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Director David Frankel's picture delivers sweet and (more rarely) amusing moments, but this odd duck never completely gets off the ground."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "I wish all the agony in The Big Year was leading up to something fascinating in the end, but the most inviting thing in the movie was the exit door."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2011
      },
      "score": 42,
      "summary": "In The Big Year co-stars Owen Wilson and Jack Black appear on the verge of succumbing to the same terminal blandness that's gripped Martin for so long."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 40,
      "summary": "The Big Year's biggest disappointment is its inadequacy in elucidating the passion of the birder. What ardency, and what an exceptional, impenetrable world they move in. I for one wanted a better look at it."
    },
    {
      "critic": "Bill Weber",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 25,
      "summary": "Director David Frankel can't lend the inflated sitcom dilemmas of the characters any life, and most mysteriously screenwriter Howard Franklin, whose work in the '90s frequently had appealing quirk and flavor, gets the dubious credit for adapting a 1998 nonfiction book about these hobbyists' pursuit of pink-footed geese and Northern Shovelers."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 25,
      "summary": "Why does The Big Year's trailer intentionally hide what the film is really about? Here's why: Because bird-watching - or birding, as practitioners prefer to call it - makes for a stupefyingly boring movie."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "Who knew that a movie about birding could be so fantastic! It'a excellently written and casted. The humor is fantastic and you will truly be invested in this film until the end. Getting to see the birds was also surprisingly enjoyable. In the end I loved the movie. The combination/rivalry of Jack Black, Owen Wilson, and Steve Martin is fantastic. An all around terrific movie.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "This movie is soooooo underrated!!! One of the best movie surprises I've bumped into in I don't even know how long.  I picked up the 5$ special at Walmart thinking oh gee some slapstick comedy to kick it on a Friday evening.  I was sooooo surprised.  This is brilliant. It's beyond brilliant.  I'll bet half of the reviewers didn't even \"get\" what they were doing with this movie, because they don't particularly \"get\" into nature. --Take another look;  there's more than just nature going on if you watch carefully!   Delicate satirical reference and parallels just out of reach of the obvious and beautifully executed. The bargain basement DVD comes with a great \"extended cut\". I just regret there isn't some \"behind the scenes\" takes on it as well.",
      "total_reactions": 1,
      "user": "iokuok2iok"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "It's not Transformers, no... but this sweet, charming and gentle comedy is a real delight for birders and non-birders (who may wonder why all the fuss.) I went to the movies with only moderate expectations, and half way through found myself thinking, \"this is delightful.\" Come for the birds, stay for the comedy...there's plenty of each!",
      "total_reactions": 3,
      "user": "hollyv"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "I thought the Big Year was great!  Story was really well written, acted and directed.  Subtle, adult humor - not the nonsense written for 12 year olds (no offense to 12 year olds).  The characters were well drawn and likable.  What a great cast - I love Jack Black best when he's not stuck in slapstick, silly comedies.  He's got an emotive face and deeper acting ability than he's ever given a chance to showcase in some of the more shallow comedies into which the industry has niched him.  If you ever saw his first hit - High Fidelity with John Cusack - then you know exactly what we've been missing from him in the last several years.  Steve Martin is the subtle gem that I like best - similar to recent role in \"It's Complicated.\" Owen Wilson was great as well.  They're all funny guys and don't have to try hard to be likable or humorous here.  I'm completely bewildered that this movie hasn't done better at box office.  Everyone in my theater seemed to really enjoy it.  I think they just promoted it badly - they gave fans the expectation of another obvious comedy instead of a movie done with more sophisticated humor than your average 12 year old is interested in, so the wrong people went to see it and the right audience has stayed away.",
      "total_reactions": 3,
      "user": "DeniseIsGreat"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 0,
      "text": "I an truly amazed that this pantload of a movie got a single score above a zero. The only way that's possible is if those reviewers happen to be one of these weird \"birding\" nerds. To be perfectly honest, we felt completely ripped off by the false advertising of this piece of crap. In the previews, in every single interview with the cast, there wasn't one mention of a bird or \"birding\" in any capacity...it was made to look like something similar to The Bucket List, with the cast doing a bunch of crazy things over a year. NOT WATCHING FREAKING BIRDS! Maybe not the worst movie ever, but surely in the top 10, and definitely the most dissapointing I have ever seen. I can't for the life of me figure out why any of those guys would ever even consider doing this movie. Anyone who rated this above a zero has been eating way too many retard sandwiches...",
      "total_reactions": 7,
      "user": "corc79"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Underrated movie.",
      "total_reactions": 1,
      "user": "Prantare"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "I went in with low expectations and walked out shocked from the disappointment with the box office. I found this movie delightful. It was fun and adventurous. They shouldve promoted this movie better. Some comedic lines here and there and a great, wonderful story. I never had too big of an interest in birds but wow are there alot of categories of birds. This movie was very interesting. With powerhouses like jack black, owen wilson, and steve martin and this movie only made 3 mil opening weekend? Thats shocking. If you enjoy a heartwarming film with a powerful cast you must see this movie. You wont regret it. 8/10",
      "total_reactions": 1,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "I did enjoy The Big Year very much . Im not gonna put it as a Comedy film but Its was very amusing .The Big Year is like an amazing Documentary about birds , About The Watcher and about the world. I like adventure and Birds and this movie showed that perfectly . Story was good but could be better . David Frankel's directing was really really good, The Movie Had an amazing ensemble cast and they all played so well. Find out so many things about Birds and The World , The Big Year is a very educational movie . Overall This movie will make u wanna fly like those birdwatchers .",
      "total_reactions": 1,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2012
      },
      "score": 2,
      "text": "Would anyone ever watch it apart from the director and the producer and their closest relatives that stand by them through the thick and thin if it was not for Black, Martin & Wilson playing?",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "The Big Year was a pretty great film. It was subtle, bittersweet and unpredictable. I expected the usual Hollywood rom-com  slapstick farce and was pleasantly surprised. Great stuff.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2012
      },
      "score": 5,
      "text": "One thing 'The Big Year' is, is not humorous. Nor is it particularly clever or thoughtful. What exactly is this movie about then? Despite it's unoriginality the story itself is fresh. There haven't been too many films made about birdwatching let alone 'comedic' ones. The frequently changing setting matters not as the locations are simply stunning and makes some of David Attenborough's documentaries seem dull in comparison. You won't churn out any laughter with TBY but as long as you realise it's simply a quaint, little feature then you simply *might* enjoy it.",
      "total_reactions": 0,
      "user": "eTurkey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "I watch the other day this film, and after, I think yeah, the metascore is correct, the big year is not a sorpresive or bigger film, have some moments, but is good for a sunday.",
      "total_reactions": 0,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "The Big Year is an excellent MOVIE. It does not slide into a category well and that hurt the marketing. So, three comedians who are very good dramatic actors make an old fashioned movie that combines a depthful story, some soft humor and a lot of thoughtfulness- try to put that in a trailor.It is a movie about choices, sacrifice and ambitions.  See this movie!",
      "total_reactions": 0,
      "user": "siempre"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "This is not just a movie about \"bird nerds\". It's all about true life priorities for everyone and also it's about the sacrifices one can make to achieve his goal. So this isn't an ordinary comedy movie, it carries a nice idea.",
      "total_reactions": 0,
      "user": "StaticSpine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "Martin's a great actor, sure wish I could have seen it. But kept thinking about how many times I would have gone bankrupt (about 500 - 600) and how many jobs I would have lost (about 1200-1500) during just ONE year.",
      "total_reactions": 0,
      "user": "calhounite"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2014
      },
      "score": 9,
      "text": "i gave it 9 out of 10 purely based on it's merits to entertain, the problem for most people have with this movies is there are no explosions, dramatic action scenes or any of the other typical Hollywood tripe, it does exactly what it says on the tin and no way throughout the movie did i find my self thinking this is boring i want to turn it off.",
      "total_reactions": 0,
      "user": "damageplan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "If you can get past the obviously obscure subject matter, you'll find a really sweet film beneath.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "So this movie is FANTASTIC! But it is not for anyone. People who love traveling to places like Ushuaia or Tasmania, true trekkers. People who love and appreciate nature. And people who appreciate the gist of the movie, which deals with the conflicts of handling dreams, that torturing feeling that you have to accomplish something beyond the ordinary, and the need to stay realistic while dealing with these dreams and feelings. That's a marvelous theme for a movie and the big year is simply an elegant, successful approach to represent it. Not every one will appreciate this movie because it is not a movie meant for every one. But is a very good movie if you have the spirits for it.",
      "total_reactions": 0,
      "user": "TLHG"
    }
  ]
}