{
  "mc_avg_user_score": 8.0,
  "mc_metascore": 71,
  "mc_mixed_rating_frequency": 65,
  "mc_movie_name": "The Girl with the Dragon Tattoo",
  "mc_negative_rating_frequency": 38,
  "mc_positive_rating_frequency": 583,
  "mc_pro_critic_reviews": [
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 100,
      "summary": "If there's a complaint, it's that it flirts with rambling once the main case is solved -- nearly 20 minutes before the movie ends. But Fincher uses that remaining time to expand on Lisbeth's character, which is hard to hold against him."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 100,
      "summary": "The Girl with the Dragon Tattoo can stand on its own as Fincher's valentine to goth girl power, detective stories, and the grotesqueness of the human heart."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2011
      },
      "score": 100,
      "summary": "The resulting film is neither better nor worse than the Swedish film, but it's more cinematic."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2011
      },
      "score": 100,
      "summary": "Fincher has made The Girl With the Dragon Tattoo into an electrifying movie by turning the audience into addicts of the forbidden, looking for the sick and twisted things we can't see."
    },
    {
      "critic": "Read full review",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2011
      },
      "score": 90,
      "summary": "This is a bleak but mesmerizing piece of filmmaking; it offers a glancing, chilled view of a world in which brief moments of loyalty flicker between repeated acts of betrayal."
    },
    {
      "critic": "Calvin Wilson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 88,
      "summary": "The film isn't quite as edgy as Fincher's best work - \"Seven,\" \"Fight Club\" and \"Zodiac\" are masterpieces of modern angst. But the director brings a fresh eye to what might easily have been an unnecessary rehash of the 2009 Swedish adaptation."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 88,
      "summary": "Under the direction of David Fincher and with a screenplay by Steven Zaillian. I don't know if it's better or worse. It has a different air."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 88,
      "summary": "Fincher's electrifying storytelling makes the most of unsettling visuals, large casts, complex plots and sharp dialogue."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 88,
      "summary": "Chemistry is one of the few things left filmmakers can't fake with CGI, and the dynamic between Craig and Mara in The Girl with the Dragon Tattoo is so sensational, it instantly propels the movie beyond glossy, high-toned pulp into something far more affecting."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2011
      },
      "score": 88,
      "summary": "This beautifully taut and terrifying thriller is faithful to its source in just about every way that matters."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2011
      },
      "score": 88,
      "summary": "This film has two of Fincher's happiest trademarks: It's full of information and stretches over a remarkably long time (165 minutes), yet it's neither confusing nor overextended."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 85,
      "summary": "Craig has one clear advantage over Michael Nyqvist, the actor who played the same character in the Swedish Girl movies: He has erotic charisma to spare, as opposed to Nyqvist's perfunctory, doughy sexuality."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 83,
      "summary": "Mara's Salander is the film's lifeblood, a shrewd yet vulnerable outsider whose resilience and pluck help Fincher elevate The Girl With The Dragon Tattoo above the standard procedural. But just barely."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 80,
      "summary": "This is an immersive and powerful thriller, driven by terrific leading performances. It's mostly really good and then it wears out its welcome."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2011
      },
      "score": 80,
      "summary": "The movie plays to Fincher's strengths, with its dark elements and cool feel, combining for a bracing pop-culture experience."
    },
    {
      "critic": "Damon Wise",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2011
      },
      "score": 80,
      "summary": "A tough, post-punk Tintin-meets-Klute for the Occupy Wall Street set, this kinetic, hard-edged thriller is the perfect festive comedown for Fincher fans and dysfunctional families everywhere."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2011
      },
      "score": 80,
      "summary": "As classy a film as could be made from Stieg Larsson's sordid page-turner, David Fincher's much-anticipated return to serial-killer territory is a fastidiously grim pulp entertainment that plays like a first-class train ride through progressively bleaker circles of hell."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2011
      },
      "score": 78,
      "summary": "It's a knockout, sucker punch of a performance, and although it doesn't completely erase the memory of Rapace (and why should it?), Mara's doomy gaze cuts through the hype and bores straight into your soul."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 75,
      "summary": "I don't think I've seen an actor do more with deadpan expressions than Mara does in this movie. Her face doesn't move but, whether she's tasing a man or standing in front of a mirror watching a cigarette dangle from her mouth, we respond to her."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 75,
      "summary": "The coolness here has its creepiness, as in the dispassionate way Fincher depicts Lisbeth's rape and her subsequent, harrowing revenge, but the suspicion remains: Fincher didn't make this movie his own because he doesn't consider it his own."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2011
      },
      "score": 75,
      "summary": "Not too surprisingly, Fincher doesn't bring his auteur A-game here, though his crafty B-game is better than most. As well, the break-out performance of Rooney Mara as the semi-feral computer hacker, Lisbeth Salander, gives the film a residue of authentic anguish."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2011
      },
      "score": 75,
      "summary": "In any language with anyone at the helm, Lisbeth is still a killer."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2011
      },
      "score": 75,
      "summary": "There's powerful craft here, and Larsson's story has more than proven its ability to grip. But missing almost entirely is a sense of urgency and discovery."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2011
      },
      "score": 75,
      "summary": "The most coldly compelling version yet of the tale dreamed up by the late Stieg Larsson."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2011
      },
      "score": 70,
      "summary": "Has much to recommend it - high-end craftsmanship, a singular heroine, a labyrinthine mystery, an intriguing milieu - yet lacks a vital spark."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2011
      },
      "score": 70,
      "summary": "David Fincher's American remake of The Girl with the Dragon Tattoo adds nothing to the previous adaptation, but it's certainly the more evocative piece of filmmaking."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2011
      },
      "score": 70,
      "summary": "Dragon Tattoo is too neatly wrapped up, too fastidious to get under your skin and stay there."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2011
      },
      "score": 63,
      "summary": "From him (Fincher), we get – what? – a faithful adaptation that brings the dazzle but shortchanges on the daring."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2011
      },
      "score": 63,
      "summary": "The Girl With the Dragon Tattoo may want it both ways, getting its tawdry kicks while tsk-tsking those who deliver them in real life, but Mara's bristling, unbridled performance gives the film the ballast it needs to pull off that curious, undeniably engrossing, balancing act."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2011
      },
      "score": 63,
      "summary": "The great screenwriter Steven Zaillian's elaborate, convoluted script, so muddled that even after it's over you still don't know what it's all about, is a drawback - but the movie is a master class in sinister style, tense and deeply uncomfortable."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2011
      },
      "score": 63,
      "summary": "The difference between Niels Arden Oplev's adaptation of Stieg Larsson's The Girl with the Dragon Tattoo and David Fincher's own is not, as some might have hoped, the difference between night and day, but between curdled milk and a warmed-over holiday second."
    },
    {
      "critic": "Ben Sachs",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2011
      },
      "score": 60,
      "summary": "The task of dramatizing this proved too difficult for Niels Arden Oplev when he directed a Swedish adaptation in 2009, but as Fincher demonstrated in \"Social Network,\" he knows how to make information technology eerily seductive. Unfortunately Larsson's salacious plot elements - mass murder, Nazism, and the like - feel just as shallow as they did in the earlier version."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2011
      },
      "score": 60,
      "summary": "He (Fincher) gives in to its mimicry of an Agatha Christie parlor game. Only instead of Miss Marple, the old-gal crime-solver with piercing blue eyes, we get Lisbeth Salander, pierced goth-girl investigator with raccoon eyes."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2011
      },
      "score": 60,
      "summary": "Fincher's film tips much more in the indulging direction of crowd Comic-Con - delighting the franchise junkie above all other considerations."
    },
    {
      "critic": "Sara Maria Vizcarrondo",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2011
      },
      "score": 60,
      "summary": "You'll be happier with the film if you don't expect fidelity to source material, but that doesn't mean you'll hate it if you loved Niels Arden Oplev's movie."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 50,
      "summary": "Fincher is a master of mood and atmosphere, but this chilly, efficient movie never transcends the shallowness of its source material."
    },
    {
      "critic": "J. Hoberman",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 50,
      "summary": "The remake is an altogether leaner, meaner, more high-powered, stylish, and deftly directed affair, though similarly hampered by a too-long narrative fuse."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 50,
      "summary": "This film's cold, almost robotic conception of Salander as a twitchy, anorexic waif feels more like a stunt than a complete character, and so the best part of the reason we care enough to endure all that mayhem has gone away."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 50,
      "summary": "Seeing Fincher's version is like getting a Christmas gift of a book you already have. This edition has a nicer binding and prettier illustrations than your beloved old paperback, but it's essentially a reproduction of the same old dragon. Dragon Tat-two."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2011
      },
      "score": 50,
      "summary": "There are waves of brilliantly orchestrated anxiety and confusion but also long stretches of drab, hackneyed exposition that flatten the atmosphere. We might be watching \"Cold Case\" or \"Criminal Minds,\" but with better sound design and more expressive visual techniques."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 38,
      "summary": "The Girl With the Dragon Tattoo is, as you'd expect, rubbish, but the word is slightly too kind. The David Fincher film (like the very similar Swedish one - released in the US just last year! - and the book) is not even good rubbish."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "Following the very successful adaptation of Stieg Larssons millennium trilogy into three very successful Swedish language films, it came as no surprise when Hollywood announced that it would be making an English-language version of the series. Director David Fincher was announced to craft the first book in the series, The Girl with the Dragon Tattoo. The new version follows very close to the original material with one fairly big exception which I will detail later in the review. Daniel Craig stars as Mikael Blomkvist, who at the opening of the film has recently lost a court case for which he was being sued for libel by a prominent business figure. His career is in ruins and virtually all of his savings gone as a result of the trial and punitive damages. So when he is contacted by an attorney representing the wealthy and powerful Vanger family, he agrees to meet. Although highly reluctant to take a meeting, Mikael takes the four hour train ride north of Stockholm to a cold and remote island to meet with Henrik Vanger (Christopher Plummer). Henrik wishes Mikael to investigate the disappearance of his niece some 40 years earlier, a niece vanished under the familiesâ",
      "total_reactions": 4,
      "user": "garethvk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "I am quite frankly gobsmacked at the reviews this film has received. This film was my joint favourite of the year, tying with drive. Me and my girlfriend have read the books within the past year, and sat down to watch the extended version of the Swedish film the night before. To both of us, the difference was like night and day. The pacing in the Swedish version was plodding, and Lisbeth felt far too friendly (as did Henrik Vanger). And despite it being an extended version, so much great stuff from the books was omitted.",
      "total_reactions": 3,
      "user": "Olly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "This movie adaptation was as good as it could be and I have no criticisms in that regard but the problem occurs when it is compared to the novels which is unfair because not every detail can incorporated into the actual movie. This movie was very well done in terms of production and Rooney Mara was phenomenal as Lisbeth Salander. The original swedish verions were also very good but they should not take away from what this version has to offer. The two trilogies can be compared and contrasted to no end but each should not be viewed as better or worse based on the other. Apart from these comparative issues, the movie was excellent but not everyone will be able to enjoy the depth that this movie offers without reading the books. I do hope that adaptations of the next two books are made and that they are done just as well as this one was.",
      "total_reactions": 3,
      "user": "owmynose9000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "\"The Girl with the Dragon Tattoo\" was an extremely interesting and intense film. Though some elements of this film were not necessarily for me, primarily the rape scenes, I was still very able to appreciate its beauty. It is a bit long (about 2 hrs 45 minutes), but the pace and the variety of scenes allowed the movie to flow seamlessly and created a very aesthetic atmosphere. I would recommend this movie to anyone who enjoys a good mystery, since this movie is chock full of them. I see that most of the bad reviews on here are from people complaining that a remake was unnecessary since the original Swedish version came out just recently. Honestly I feel that it was a smart move to make an English remake to appeal to the predominantly English speaking countries. Having not seen the original, I canâ",
      "total_reactions": 3,
      "user": "mvpReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "This is yet another masterful addition to the David Fincher canon. His movies are distinctly unique among modern Hollywood. On one hand, they are highly commercial, slick action pictures; on the other, he imbues his films with layers and layers of intriguing, dark and perverse subtext. All his films are just dense with juicy details and character idiosyncracies. I thought that this film trumped the swedish version because it revealed deeper shades of the characters and their lives (much is unspoken but evident in character behaviour) as well as the overall aesthetic atmosphere, which to me were synonomous with the most intriguing aspects of the book. I thought in terms of plot development and detail, the swedish tv series and subsequent movies had a lot more literate exposition and they included more detail from the plot of the novel, but imho I agree with Fincher and Zaillian's perspective of dialing down extra plot detail in order to have a clear expose of the main themes of the book. Fincher does not shy away from the grim horrors of male domination, in fact the elements of sexual abuse in this film are evoked so clearly, graphically and painfully that it has the capacity to disturb on a profound conscious level. Fincher knows very well that the real plot of these stories deals with rape and sexual torture in our society. Overall the film's aesthetic quality is unsurpassed, Fincher remains one of the few modern hollywood auteurs. His keen eye for visual precision and atmosphere as well as the suberb music of Trent Reznor and Atticus Ross make for a thoroughly mesmerizing adaptation. I believe added viewings of this film are necassary (Like all of Fincher, and great films in general).",
      "total_reactions": 3,
      "user": "Radicalist"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "The US version of the Girl with the Dragon Tattoo proves to be a very well-done film and in my opinion is an improvement over the Swedish version. I know there are a bunch of disgruntled fans of the original Swedish version that don't like this film but I think that it works well and the characterizations are good in their own right. There are some changes to the US version from the Swedish version, especially towards the end but in my opinion it flows better than the Swedish version and I found the ending to be much more satisfying than the Swedish versions ending. Also, you simply cannot beat Trent Reznor's and Atticus Ross' score for the film. Rooney Mara is simply outstanding and brings a different interpretation of Lisbeth that I felt was better with the more vulnerable characteristics. Noomi Rapace's more confident an empowered version is also very good and I don't want to take anything away from that either. This film also provides a good opportunity to create better sequels. After the original GWTGT, the next two swedish films were really weak and were disappointing efforts. Hopefully Fincher and company return to bring the other two books to the screen.",
      "total_reactions": 2,
      "user": "kid_a2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "I was fully prepared to loathe this film. I was very affected by Larsson's written work. (I sent for English publishers editions rather than wait for the douche American conglomerates' one-year-between-volumes of the trilogy separation) I think that the Swedish versions are absolutely what the novels demanded and are sufficient on their merits to have been the only cinematic versions. That said, I left the theater just pleased, and impressed. I hd fears of any overly glamorized, sanitized Hollywood version. Fincher has brought none of that to the screen. This is as stark as it should be. Daniel Craig is very good as Kalle Blomkvist and Rooney Mara is a more damaged Lisbeth. My only serious quibble with this film is Fincher's decision to have Blomkvist be a father and in touch with his daughter and ex-wife. I se nothing added to the character (in fact I think that Larsson intended that Mikael be a self-absorbed workaholic, as Larsson seems to have been). I sincerely hope that this Dragon Tattoo version earns enough to provide backing for an entire trilogy. If that comes to pass, inclusion of the daughter and ex-wife characters promises the possibility of some cheesy plot devices that will ruin the remaining chapters if used. If Fincher avoids that temptation and pitfall, the debate will rage for decades to the delight of film geeks everywhere!",
      "total_reactions": 2,
      "user": "jaf48"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "As a big fan of the books and the Swedish movies, went to see the Fincher movie with my husband and sister who are equally big fans of the books and Swedish movies.  All three of us LOVED this new version.  The plot followed the book closely, Rooney Mara and Daniel Craig hopped right out of the book.  Fincher improved on the original and was a big hit with the three of us.  BRAVO!!!  Haven't seen it???  GO!!! NOW!!! Then post your review.",
      "total_reactions": 2,
      "user": "tush915"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "The girl who plays her has sexy pics at http://xxxfever.info username wildnout14 I have to say she is very stunning and a great actor too.................................",
      "total_reactions": 2,
      "user": "Wildnout14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "I was skeptical going into the theatre about how great this film would actually be and almost expecting to be let down, especially considering how much I enjoyed the Swedish version. Noomi Rapace was, in my opinion, the quintessential Lisbeth Salander, and I thought there was no way Rooney Mara could compete. I was, however, quite pleasantly surprised--she actually pulled it off! Though perhaps her portrayal of a more vulnerable--and dare I say likeable--L.S. may not be very true to the book, I did find myself caring more about her, and I think that this less abrasive depiction will be more appealing to people who have not read the series and therefore know very little about her past. My biggest complaints were actually quite small and therefore don't subtract from my rating, them being that it did run on a bit long after the climax, and that the more, shall we say 'disturbing' scenes, although still quite upsetting, were toned down a bit too much for my liking and were not as potent as they were both in the book and the Swedish film version. All in all, it was incredibly entertaining and I recommend anyone to see it!",
      "total_reactions": 2,
      "user": "patchoulirad"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "This movie was amazing it was a great, dark, mysterious film. David fincher knows his stuff. When the trailer came out I knew immediately I was going to see it even though I knew nothing about it. It pulled off its longness really well to, you didnt feel like it was dragging on forever. I don't know why this hasn't been getting as much love as other movies, It was freakin awesome! Go watch it! It's pretty close to a perfect movie!",
      "total_reactions": 2,
      "user": "DrumsNStuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Hell yeah this is the type of movie that I like to watch on Christmas. I have never read the book but saw the Swedish version of the film. This was hands down my second favorite movie last year. Rooney, Rooney! See was flat out great. I hope she wins the Oscar for all the stuff she had to learn  and for powerhouse performance that made me scared of her. Can't wait for the next two.",
      "total_reactions": 2,
      "user": "PyschOutBaby"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Funny... as opposed to most people who've seen Girl with the D..T..., I felt it was trite and somewhat stupid. A Silence of the Lambs knock-off. The \"out of country\" feel calculated to pander to an insular American audience' sense that \"they been somewhere else.\" In other words, if you juice up the beautiful Swedish landscapes with a lot of violence and sadism -- it's a SALE! Lord knows, those Hollywood marketeers know their sheis. Really! Nazis... why didn't they just make them Nazis AND zombies?! And the secret room... wooooooo! I'm sure they got a lot of that in Sweden. The parts of the movie that had any relationship to reality, no one would believe. And of course, the quintessential evil male -- what modern movie would be complete without him? And of course, to pander (there's that word again) to the innate (and base I might add) human tendency towards self-righteous violence -- we must first:",
      "total_reactions": 2,
      "user": "CalvinCoolidge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "In my oppinion in this year it is one of the best films and I like it ! I think that it can take an Oscar like a best film of the year but , it can't ...",
      "total_reactions": 2,
      "user": "paulgreen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "I am going to go out on a limb and say this but \"The Girl with the Dragon Tattoo\" was the best film in 2011. Daniel Craig showed us a role that he proved that he could play well and the newly talented Rooney Mara was the best part of it. There are movies where you can tell whether or not they put a lot of effort into it and this proves that they did. The story line was phenomenal, the actors were great, the cinematography really shined and the original score behind it was also as great. In my opinion the best part of the film was the Female Lead, Rooney Mara, who plays Lisbeth Salander in the film and plays it with a passion like no other. Pick it up on DVD on March 20.",
      "total_reactions": 2,
      "user": "a7xfan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "I loved it! I personally liked it a lot more than the Swedish version (both are brilliant films). A little long. Rooney Mara is brilliant, we'll be hearing about her in the future. The opening credits are super stylish and epic.",
      "total_reactions": 2,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "Brutal, dark, intense, shocking, interesting, and enjoyable, these are just some of the words I would use to describe this movie, it's fantastic but not in the way you'd expect, honestly after watching this I was pretty surprised at what I just watched, let me just tell you this it's earned it's R rating, and that this is definitely one you don't want to end up in the hands of a kid, the plot is enjoyable, it has a fantastic soundtrack, and Daniel Craig and Rooney Mara both deliver outstanding and exceptional performances, Rooney Mara's performance as Lisabeth in particular was phenomenal, she made her character come to life and made me want to learn everything about Lisabeth, and I hope they make the sequels just so I can, it's an outstanding, intense, and fantastic movie experience that I highly recommend, just be sure your ready for it first.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Absolutely awesome! Everything about it is just great. Fincher did an outstanding job. I have read all three books and seen the original foreign films and I gotta say Fincher's version is the best. I don't see any reason to hate on this movie just because it was made after the original, if you like the original better that's great, watch it over and over again. As for me, I'll be watching Fincher's version over and over again simply because I enjoyed it alot more. It looked better, it was acted better and the music was freaking fantastic! Trent Reznor and Atticus Ross are geniuses, I think the music may have been my favourite part of the movie. Although it did make a few changes to the story that I'm not entirely happy about, this movie did the book justice and was awesome from beginning to end!",
      "total_reactions": 1,
      "user": "Goffery"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "A remake done really well that complies with the plot and understand when it is terrible violence suffered by women and when they are horrible people who violate them. Excellent photography and the dark atmosphere and dramatic film, fantastic actors especially that of Rooney Mara, who has managed to give us a wonderful interpretation of Lisbeth.",
      "total_reactions": 1,
      "user": "Mad_Hatter91"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Outstanding movie. The details of the plot were somewhat modified from the book yet in no way did that diminish the story. Best movie I have seen in quite some time.",
      "total_reactions": 1,
      "user": "msbooboohat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "After a very slow and unfocused first hour(out of the 2.7 hours) the film engages and impresses. Is it better than the original, no. Does it take away from the original, no. It stands on it's own. Mara is fine, but not anything award-worthy.",
      "total_reactions": 1,
      "user": "TakeOne"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "Fincher at his best.  This movie is electrifying from the very start. There is an edge to it that is sustained throughout. Reznor sets the tone with a tremendous score, and the acting is superb.",
      "total_reactions": 1,
      "user": "trujustin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "This is a good movie . This one is available at http://tinyurl.com/MovieStreamingOnline",
      "total_reactions": 1,
      "user": "koplop"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "Impressive movie has to be on of the most challenging for daniel craig, things like this happen all the time its not a safe world and if you do get free from something like this you always remember it. Unique movie thought...",
      "total_reactions": 1,
      "user": "M9ki"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "I have special love for the original Swedish version which I listed as my fourth favorite film of 2010.  If that movie didn't exist, I may have very different feelings about this one - for good AND for bad.  Rooney Mara is terrific in this role, but I don't think she's necessarily better than Noomi.  Noomi had that smoldering, caged heat feeling about her.  It was more of a masculine slow burn, whereas Rooney is much more feminine, and her character is a bit less focused.   Both are solid in their roles, but I think I prefer Noomi's take on it.  The Swedish version focuses much more on the the mystery of Harriet's death, and it's much more process-oriented, which I preferred.  The Fincher film glosses over much of the detail of that investigation ,and I feel that if I hadn't seen the original, I might have been a bit lost with regard to the family tree, the unlocking of the old photographs, and the tic toc on the day of the car crash on the bridge.  I also liked the original's resolution of the murder mystery storyline much more, with Harriet coming back from Australia - the acting and the sense of relief was palpable and enormously satisfying.  Comparatively I didn't feel that Christopher Plummer cared nearly as much to see her.  Now, on the other hand, the \"theft\" sequence with Mara draining bank accounts and her subsequent show of real love for Bloomquist at the end was much more fleshed out - and to a more satisfying degree - in the Fincher film.  The bottom line for me is that there's nothing like the first time, and this film simply didn't stack up to the power of original which really did cut like a knife. To me, it's a classic.  To compare these two to another pair of films - I loved Let The Right One One, the Swedish original, but Let Me In, the American version, stacked up very well against it.  It brought something special to the story - perhaps more so than than Fincher's Dragon Tattoo does.  ALL this being said, I certainly was entertained by Fincher's movie and recommend it.",
      "total_reactions": 13,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "The best movie I've seen all year. Mara Rooney deserved top billing!  Struck me as much as Saving Private Ryan: fascinating to watch, parts of it were shocking, and I spent a long time thinking about it afterward.",
      "total_reactions": 11,
      "user": "Reymont"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "Just finished the 3 book series and watched the movie tonight.  Overall, I thought is was very well done.  Of course, there were details and side stories that were left out; however the overall story and relevant material were handled exceptionally well.  It was well acted, suspenseful and worth the price of a movie ticket.",
      "total_reactions": 6,
      "user": "Lomoech"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "David Fincher's \"The Girl With The Dragon Tattoo\" is exceptional. I write this having read the novel only one week before. It was amazing to see a master filmmaker lend his vision and excellent craft to a story that I truly enjoyed. Fans of the novel will note that a few side-plots are deleted and unfortunately a very revelatory journey at the end of the story is omitted. But the the detailed character development, thriller, mystery, romance (?), and real-life horror elements are all there.",
      "total_reactions": 10,
      "user": "Matt_Weaver"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "I have not read the books, nor have I seen the original version of the movie.  Therefore, some of my pet peeves about the Girl with the Dragon Tattoo may lie somewhere in the story itself rather than the editing.  Don't get me wrong.  The movie is great.  I immensely look forward to sequels.  Rooney Mara's performance alone is enough to want to see the series continue.  The entire cast is fantastic, but what seemed to bug me most during the movie is the extended amount of time spent on some elements of the story, like her being a ward of the state, but how much time wasn't spent on explaining the backstory re: Daniel Craig's lawsuit and relationship with Robin Penn.  A lot effort was spent building up the need for Christopher Plummer to hire Daniel Craig to solve this mystery, yet very little into connecting Craig and Mara together.  For someone so unsociable, she unnaturally connected quickly with Craig.  Then, when it was all said and done, the story seemed to wrap up too quickly as compared to the build up.  So, while the story was good, the directing was good and the cast was good, the piecing together of the film itself seemed haphazardly done.  Was this editing? Was it the story itself? At 2:34 long, I would have expected a better flow, but nonetheless, my high expectations were met and I look forward to more.",
      "total_reactions": 5,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "I've read some of the reviews on here, whining about the fact that it's a remake of the original movie, or that the book is better...blah blah blah.  That is a really unfair attitude to throw on a very well made film.  The cinesnobs seem to really have it out for this one.  If you're Swedish, I can understand that attitude. I singularly enjoyed not having to read subtitles.  David Fincher did a wonderful directing job, as always.  Daniel Craig is too cool for school. Rooney Mara is awesome. Great titles. Good music. I was just so thrilled to not be insulted at the megaplex.  I think we all can agree that that is an absolute rarity these days.  To the snobs...save your venom for Transformers 4 or Mr. Popper's Penguins 2.  Sheesh.",
      "total_reactions": 5,
      "user": "drm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "God Damn, this film is excellent. Fincher has that signature style that keeps audiences entertained and engaged with the story, characters, and dialogue. I can honestly say that there was nothing that i disliked about TGWTDT. I was a little skeptical about how the soundtrack would turn out, because I'm not a huge Trent Reznor/Atticus Ross fan, but it surprisingly complimented the movies dark and ominous tone in the most subtly effective way possible. The cinematography is nothing short of amazing, along with the lighting, sound, and editing. Fincher has this uncanny ability to keep the camera \"calm\" in the brutally graphic, high-tension scenes. I could go on and on about how good this film is, but just go see it for yourself.",
      "total_reactions": 5,
      "user": "PollosHermanos"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "Anyone that is complaining about how this is a remake of a movie that came out last year, the original film of the same name actually came out in 2009. Also, it is a remake, but it's a remake by one of greatest directors in our time, David \"F*ckin\" Fincher. Deal with it, not every American saw the original film, so give the remake a break everyone. Next, Daniel Craig is a marvelous actor throughout the film, next with Rooney Mara, who was also in the film \"The Social Network.\" The film looks beautiful, Fincher's creative way of capturing the settings and the realistic emotions of the characters are superb. You can see prior films by Fincher in this film, including \"Se7en\" and \"The Social Network.\" The soundtrack is also great by Trent Reznor and Atticus Ross, who previously created the soundtrack for \"The Social Network.\" All in all, everyone who is \"angry\" about this remake should shut it and just enjoy the film as it was intended from Fincher's and Zaillian's perspective.",
      "total_reactions": 5,
      "user": "AV_critic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "David Fincher's take on The Girl With the Dragon Tattoo is a bleak, gruesome, and some times hard to watch film, yet its amazing style and intriguing story keep the audience captivated.  We don't want to watch, but we can't look away because Fincher doesn't hold back and because every moment Rooney Mara's Lisbeth is on screen she commands attention.  She gives perhaps the best performance of the year and even tops Noomi Rapace's amazing portrayal of the same character in the Swedish version.  It seems many critics have decided to diss this movie on the only basis that it came out so soon after the Swedish version.  These critics/people are trolls and should be ignored.  Remakes and alternate adaptations should be able to stand apart and be judged on their worth rather than on their predecessors.  All in all Fincher's version is on par with the Swedish adaptation, though I felt the longer drawn out ending in the American film was inferior to Niels Arden Oplev's ending version.",
      "total_reactions": 5,
      "user": "MagnificentM"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "Better than the Swedish version and stays surprisingly true to the text and does not hold back in terms of nudity and violence as North American films often do. Rooney Mara makes for an excellent Lisbeth Salander while acting under Social Network Director David Fincher once again.",
      "total_reactions": 5,
      "user": "mccooper"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "This movie is a solid 10. They made some changes from the book of the same name. It's hard to say it's better than the book but I can say it's an upgrade over the Swedish film adaptation. Rooney Mara is perfect as Lisbeth and Daniel Craig gives the best performance of his career as Mikael. David Fincher did an amazing job directing as was expected. There's chilling and intense moments as well as endearing ones. It's all highly effective. Truly brilliant.",
      "total_reactions": 4,
      "user": "bone"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "It's fantastic. Go see it. The actors are great, David Fincher is a great director, and the music is great. One of the best movies of the year, and as far as I can tell the only serious contender for best picture.",
      "total_reactions": 4,
      "user": "wordy_actions"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "I saw this movie without seeing any of the swedish films or having read any of the books. I thought this movie was amazing. I thought everything about it was amazing.  I went home and read that about half of everyone who saw it thought the original was superior, so i watched the first swedish film. THE SWEDISH FILM DOESN'T EVEN COMPARE, IT IS A PILE OF GARBAGE COMPARED TO FINCHER'S VERSION. David Fincher told the story perfectly, and then when i watched the swedish version, i was like \"what is this\" a story is barely present, and is told so horribly.",
      "total_reactions": 4,
      "user": "averystr"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "First I want to put a stop to all those people out there claiming this is a remake. That's like saying I'm making a Frankenstein movie today would be a remake over the bunch of others that came out before that was adapted from Mary Shelley's book. This movie is Fincher's adaptation on Stieg Larson's novel of the same name. Just like the Swedish one was there adaptation of the same book. It's a 2nd American, Fincher's, whatever you want to call it, adaptation of the book. Now that I got that out of the way I gotta say it's rare to have a movie come out as good or better then the book. Godfather for example but this \"adaptation\" of Stieg Larson's novel in ways is as good if not better then the book. I am a fan of the Swedish adaptation and though it followed the mystery element of the story I was disappointed at the key elements they took out from the book that were important to building depth  and substance to the characters. I thought non readers of the book were a little robbed on knowing more about the unique and original character of Lisbeth Salander. David Fincher brought those elements into this movie so well that I felt after seeing it that somebody could watch the movie and get everything from the book without reading it. The story was told so beautiful keeping the character depth, the elements, and the story true to the book. Fincher even shortened long sequences in the book into brilliant short scenes that in a way was better then the book. The parts they took out were minimal things that didn't effect character building or the story one bit and even thought what they left out should've been left out of the movie when I first read it. There's even a slight twist at the end that was welcoming to me that read it differently. It was a twist that didn't effect the story and I actually enjoyed it more then how it played out in the book. The nice grey hue Fincher films it makes it look like a disturbing cold winter that I felt in the book. Throw Trent Reznor and Atticus Ross's music into the mix really put to ear the feeling and emotion taking place throughout the story. Fincher being known for his amazing and original open title sequence doesn't let us down. Opens to Karen O Trent Reznor and Atticus Ross remake of Zepplin's Immigrant song really get's you into the mood for the movie and only gets better from there. If you're looking for a great mystery with dark elements this is your movie.",
      "total_reactions": 4,
      "user": "edhubie"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "David Fincher returns to his roots and directs a near perfect neo-noir pyschological thriller. Rooney Mara also returns from her minor role in The Social Network and proves that she is more than capable of becoming an A-list actor. If the film only focused more on Lisbeth's dark past rather than glossing over it, the film would be perfect.",
      "total_reactions": 7,
      "user": "Alexander_Fred"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "I LOVED the original, Swedish version.  I though \"ok, this will be good, but it's still a remake.\"  Sure, the film is a remake of the Swedish version because \"American's don't read subtitles,\" but usually they aren't as good as the original, they certainly don't surpass it, TGWTDT did that.  It's better than the already great original film.",
      "total_reactions": 6,
      "user": "bjnotnj"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "Excellent. Engaging for the whole time. I'm thinking Brendan shouldn't go to anymore movies... just in case they might be a remake; it is obvious he didn't judge this movie on it merits. Though it is a long movie, it keep me wondering what was going to happen next, and I wasn't bored (and I don't like movies over 2 hours, just too self-indulgent by the director usually) but this one succeeds where other directors and editors lose their way.",
      "total_reactions": 7,
      "user": "nameless"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "The Girl with the Dragon Tattoo of Fincher was doomed from the beginning to be compare with the Swedish version. The problem is that after this comparison the American production was totally degraded. Although the story is very attractive and scary, this is not a point for this movie, because there other one has it too; then we have the plot, here the development of the actions happen in a darker atmosphere, but everything is less emotional and more carnal than the film of Niels Arden Oplev; in other words this picture is the Hollywood alter ego. And as an ultra-commercial movie have parts left over, which were shown implicit by the Swedish one (an extraordinary film is the one in which the viewer has to interpret or deduce some parts of the plot). Finally we have the contrast of the protagonists: Daniel Craig gives a weak performance, the one of Michael Nyqvist is a lot more convincing as Blomkvist. About Lisbeth Salander, which is a much more difficult role, I think Rooney Mara capture it more than Noomi Rapace, and that interpretation pulls this movie up.",
      "total_reactions": 4,
      "user": "NedRyerson1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "Wonderful movie by one of the best directors of this generation. I especially enjoyed the intro. And to everyone saying how it's a remake I am pretty sure you are wrong. Yes I've seen the foreign one but I think this is simply the american interpretation of the book rather than a remake of the foreign film.",
      "total_reactions": 2,
      "user": "TTW107"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "The whole point of making the film for English audiences is so we can watch the movie with people speaking English.  So what do they do?  Make all the actors have a thick accent and mumble the lines so they are hard to understand.  I would say I missed about 20% of the dialogue due to poor enunciation and bad recording, not to mention the irritating loud electronic soundtrack which drowns out some of the dialogue as well.  There is a large cast of characters and it is important to hear what they are saying so you can keep up with the story.  Still, the acting was good to great (Rooney Mara is especially noteworthy) and the story was good.  I felt it was one of those never-ending movies, where you think it's over but it continues on.  Overall a solid movie, but not as good as others in the genre such as Silence of the Lambs.",
      "total_reactions": 7,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 0,
      "text": "Holy overrated dog sh*t batman!!!  I don't get it!!  I sat through the first 55 minutes of this excruciatingly, boring and emotionless crap.  What movie did all these people see???  I know professional critics get paid off by the studios to give good reviews but do users also get money???  As of now there are 312 positive reviews for this lame movie?  I need some cash so please give me the name and number of the studio head that paid all of you off to give this atrocity positive reviews.  Everyone out there, SAVE YOUR MONEY AND TIME!!!  AWFUL!!!",
      "total_reactions": 3,
      "user": "VanHatin"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2012
      },
      "score": 4,
      "text": "Itâ",
      "total_reactions": 5,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "I approached the Tattooed Girl phenomena with a rare privilege: first I saw the 6 episode original swedish Millennium miniseries that inspired Fincher et al. And like so many I was completely absorbed by this girl and basically the whole cast. The story really comes together and the center is the Millennium magazine. So why did the Americans have to do a remake? Mara doesn't add a single bit to Rapace's excellent portrayal of the disturbed heroin and an oscar nomination to boot? Does Craig make a better Blomkvist? No. Perhaps the bleak winter up in northern sweden was better represented (the series shows a climactic perfect sweden which is quite laughable). I won't be holding my breath to see part 2 and 3 which are in the works because they already exist: you just have to read the subtitles (they really do speak swedish there don't they...)",
      "total_reactions": 5,
      "user": "Jluis"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2011
      },
      "score": 3,
      "text": "The movie that didn't need to be made. I agree with the reviewers who've said that this movie is a poor clone. Rooney Mara (sorry, I'm sure I'll like you in your next movie-- as long as it's not as Lisbeth) just made me wince; every scene she was expected to improve on Noomi Rapace's performance -- a fools errand. Daniel Craig just looked silly with his glasses hanging off his face, trying his best to look bookishly smart. I like both these actors, but the original set the bar; why mess with something that worked just fine? (Well, the obvious answer is that you can make money just by producing an English version of this popular work; never mind if it's artistically a bad choice.) As Dr. Evil told his (not so evil) son Scotty; \"You're semi-evil. You're quasi-evil. You're the margarine of evil. You're the Diet Coke of evil. Just one calorie, not evil enough.\" That's how I felt after seeing this; the real deal was already made.",
      "total_reactions": 14,
      "user": "Malthus"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "There is no need to see this film if you have already seen the original film. The changes made do not justify sitting through 2 hours and 40 minutes of mostly dead frame that you know what is coming up. If you have not seen the original films, then I recommend going but be prepared for a film that is at least 40 minutes too long. After an hour and a half, I was looking at my watch. Fincher did nothing to improve upon the original except to wrap everything up quickly at the end. Once Plummer disappeared. the pace really slowed and so did my hopes.",
      "total_reactions": 7,
      "user": "JamesL"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "I'd been looking forward to seeing David Fincher's remake of THE GIRL WITH THE DRAGON TATTOO, since it was announced he was doing it. Unfortunately I came away extremely disappointed. The original was much better. This American remake was frankly boring, and had I not seen the original, I wouldn't have any idea what was going on plot wise.",
      "total_reactions": 7,
      "user": "Mike_Ock"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "A mess. Worth seeing, perhaps, for the spectacle of Rooney Mara killing off Lisbeth Salander - death by overacting. The very worst moment of the movie - watch carefully for it - comes when Daniel Craig offers L.S. the chance to pursue a serial killer of women: watch Rooney Mara's reaction. The movie dies there, if in fact it ever was alive (yes, possibly it was, all the way through the opening credits). Actually, I did thoroughly enjoy myself exactly once: during the previews, at the end of the preview for Rock of Ages, when the words \"Coming Soon\" appeared and someone in the audience shouted, con brio, \"We want it now!!\" That wasn't bad acting.",
      "total_reactions": 15,
      "user": "roscoeswaffle"
    },
    {
      "neg_reactions": 17,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2011
      },
      "score": 1,
      "text": "Pointless remake. lamest part is the original swedish version is actually far better than this thing. I like the original trilogy, this isn't ''bad'' but I feel ripped off... why should I pay 10 bucks on theather to watch a movie I already own on Blu Ray at home, which can be watched over nine thousand times with infinite peeps for only 15 bucks.",
      "total_reactions": 19,
      "user": "Haristo"
    },
    {
      "neg_reactions": 17,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2011
      },
      "score": 1,
      "text": "They should rename this film \"The Girl who looks like a Bay Area Tranny\". In Hollywood she fights off the bad guys, in reality she would be fighting off her crystal meth addiction. If she were a gorgeous brunette I would probably rate this movie higher.",
      "total_reactions": 18,
      "user": "JamesSteal"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "The Girl with the Dragon Tattoo was a pretty good remake and it's a bit different from the original movie, but it still holds up pretty more. The story takes place were these two people must find a missing teenage girl by the old rich guy. It's a pretty good story and it's very shocking that every scene were Fincher takes a dark chill since he did in Seven and Panic Room. The characters are good including Daniel Craig was a right choice to be a cool detective and Rooney Mara did a fine job as a goth girl with the styling dragon tattoo (that's what they called for the title). The girl is very mysterious, smart, dark, clever, and sometimes I really enjoy were she acts like she's involve for the situation that she needs to concentrate for the mission along with the detective. The remake is good and Fincher did very well from the original that it's similar to the three based on the series that people might sink into.",
      "total_reactions": 1,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2012
      },
      "score": 3,
      "text": "I couldn't find much to like about this film, the cinematography was poor / borderline amateurish, the acting was mixed, ALL the themes were depressing (i could forgive this i guess), i had no interest in discovering 'who dunnit' as it felt like there was no engagement with the viewer, the lighting made the sets seem staged, plus a lot more.",
      "total_reactions": 1,
      "user": "randomstupid"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2012
      },
      "score": 4,
      "text": "If you have seen the original, and I recommend it very highly you will find this American remake laughable.  While it is loudly distracting with bass heavy music, and a highly expensive overdone opening, it is never so disappointing as when they take a strong representation of blind justice and insult you by rewriting her as subservient and submissive in order to actually appeal to you as a watcher.  As if the book's and original film's version of this character's character were too impossible to grasp.  It is a Disneyland version of a very good book and original film   Thpppp. Big fat raspberry.  A visual 8, a storyline 1.",
      "total_reactions": 1,
      "user": "Simpkj1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "Fincher is an excellent filmmaker, and  the movie clearly captures the excitement and dark, sinister tone of Larsson's novel, at least on one level, though the last 15-20 minutes of the movie seem rushed (and it's hard for me to believe that viewers who haven't read the book can follow all the detail) The casting is also outstanding. Lisbeth is clearly the most compelling character in the book (and movies); but although she is (and should be) a kind of cypher (in fact, the excessive psychologizing of her character in the second two books/movies detracts, I believe, from her compellingness), in this version I think she is TOO much of a cypher (due to the lack of intensity in Mara's portrayal). Also, by downplaying the background of Blomkvist's (and Larsson's) liberal, muckraking, anti-authoritarian views, it's less clear in the movie exactly why Lisbeth might be so attracted to him (though it's still a  middle-aged male's fantasy that she makes love to him...twice, after being raped by her similarly middle-aged guardian). Whether the film should have been remade, or which version is better seems to me to be a moot point. I found both of them to be guilty (very guilty) pleasures. I do, however, look forward to Pedro Almodovar's gender-bending Spanish remake in which Javier Bardem plays Lisbeth,,,",
      "total_reactions": 1,
      "user": "metamotivcritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "As much as I adored the first, Swedish adaptation of Stieg Larsson's novel, I was intrigued, for once, by a big-budget Hollywood remake as soon as David Fincher was announced as director. A jet-black murder-mystery which analyses the darker aspects of human nature seemed the perfect project for the director of Fight Club and Zodiac to helm. In a lot of ways, Fincher doesn't disappoint. Like all his films, it looks great, flows well and keeps you engaged throughout. Rooney Mara is quite captivating as the new Lisbeth Salander, and smartly has a different interpretation of the character from the acclaimed performance of Noomi Rapace. Stellan Skarsgard and Christopher Plummer also impress as Henrik and Martin Vanger respectively, both either equalling or improving on the performances of their Swedish film counterparts Sven-Bertil Taube and Peter Haber. The rest of the cast are decent enough, apart from one extreme disappointment - Daniel Craig. He doesn't give a particularly bad performance as such, but is completely miscast as Mikael Blomkvist. Blomkvist should be an everyman - someone you wouldn't look twice at in the street, someone who's perhaps put on the pounds in recent years as he approaches middle age. You should not cast an international sex symbol as such a character, and the notion that Daniel Craig \"gained weight\" for the role is laughable - he still looks too lean and Bondlike to portray a slightly-past-his-prime journalist. There are some truly stunning sequences in the film, particularly the opening titles with accompanying cover version of Led Zepplin's 'Immigrant Song', which resembles a strange hybrid of a James Bond title sequence and a Marilyn Manson video, and sets the right tone for the film. The shots of the arctic Swedish landscapes are also stunning, and credit must be given to cinematographers Jeff Cronenweth and Fredrik Backar for complete mastery of their art. Trent Reznor and Atticus Ross deliver another great soundtrack in their second collaboration with Fincher - their eerie, dark, electronica-driven music is perfect to reflect the personalities and state of mind of the numerous fractured, tortured souls we follow throughout the film. Also worth noting is a very unexpected and very clever use of Enya's Orinoco Flow in a key scene in the film - I won't spoil it for you, but suffice to say, the result is one of the funniest, yet most utterly terrifying film horror moments in recent memory.",
      "total_reactions": 1,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "I really don't know what to think of this film.  It was great in itself, but I can't help but compare it to the Swedish version, which I thought personally was slightly better.  I guess most of my disappointment stems from the fact that it doesn't feel that much different besides how Lisbeth is portrayed and shaped.  Lisbeth in the Fincher film seems more shattered, while Lisbeth in the Swedish version seems more determined.",
      "total_reactions": 1,
      "user": "Tazmania32"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "Alright, let's get one thing straight. David Fincher directed an ADAPTATION of the original novel by Stieg Larsson. And it's an EXCELLENT one at that.",
      "total_reactions": 1,
      "user": "RenegadeNorman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "I have read all three books and seen all three foreign films. It is difficult not to draw comparison to the book and original film. A book is always better than the film made of it. The \"Girl;\" trilogy is no exception. The book clearly defines and fleshes out the characters and continues to add / remove layers of personality as it goes forth. Hollywood must have thought that very few would have seen the original film, that makes some sense,nor read the book, that makes no sense as they removed key parts from the book and miscast two characters. The story itself is often confusing as are the characters, who is related to who, how, motivations, etc. etc. But this is the MacGuffin; in the end, it doesn't matter; what makes the book thrilling, can't put down is Lisbeth. She is why we keep reading and watching. Ms Mara is mysterious, provocative, frenetic, sensual, enigmatic, and \"is\" Lisbeth; she is every bit as good as Ms Rapace. She drives the book and film. Bloomkvist must be cast perfectly to help us empathize with Lisbeth. Mr Craig is unable to do that. He is not vulnerable nor cold enough; he appears to be  under water, finding difficulty with his role. Ms Wright is also miscast; she is not the sensual, yet strong, then vulnerable, force in Blomkvist or Millennium's life. The role is way under written from the book to be hardly existent. She is a strong presence in the book and key to how / why Bloomkvist does what he does. The movie leaves out a pivotal relationship, Lisbeth's girlfriend and instead throws us a gratuitous sex scene with no bearing on anything. In the book there is mistaken identity and revenge surrounding this missing character. Of course Hollywood tones down the sexual violence and shortens the film and this hurts it over all. The original movie while not an \"A\" is far superior but it's worth it to see this one for Ms Mara. On my scale the original is a B+ (8); this version is barely recommended, which is a B- on my scale so just a 6 here and only to see Lisbeth",
      "total_reactions": 1,
      "user": "RobinsNest"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2012
      },
      "score": 1,
      "text": "I'll reiterate what others have said: this is a totally unnecessary remake of a much better Swedish film.  Daniel Craig is a bore, the girl is merely adequate and this version is nowhere near as creepy as the Swedish version, which is available via streaming on Netflix.  Director Fincher did much better in this genre with Se7en and Zodiac.  Skip it!",
      "total_reactions": 3,
      "user": "MikeRG"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "There is plenty of sex in the American version of The Girl with the Dragon Tattoo which Liz and I saw last night at the AMC Van Ness at the first screening of this long awaited film.",
      "total_reactions": 4,
      "user": "Leerossh"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2011
      },
      "score": 4,
      "text": "I think the Fincher film is a reasonable effort but I found an interesting analysis of the original Swedish version at www.4thdimensionfilms.wordpress.com.",
      "total_reactions": 3,
      "user": "4DFilms"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2011
      },
      "score": 1,
      "text": "Edeltraud Dec 25, 2011 10 This may be an obnoxious observation, but if one of the themes is female empowerment why isn't the name of the movie \"the woman with the dragon tattoo\". Lis is in her 20's and an independent person ( despite guardianship). Clearly, she is exploited by the author and not respected as an adult.",
      "total_reactions": 7,
      "user": "Edeltraud"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2011
      },
      "score": 2,
      "text": "do you want to be entertained? then don't see this movie.",
      "total_reactions": 4,
      "user": "Quarri"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2011
      },
      "score": 3,
      "text": "The only people rating this movie over 40% are those that have not seen the Swedish version. Do yourself a favor and watch that one rather than this crappy version.",
      "total_reactions": 5,
      "user": "frontsquats"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2012
      },
      "score": 0,
      "text": "I joined Metacritic to comment on this film.  Count on Hollywood to botch a genuine classic - the Swedish original.  I would have given it a lower rating except that people who have not either read the book(s) or seen the previous version(s) might like David Fincher's current flick.  HOWEVER (where do I start), the current cast is OK, but not up to comparison - especially Fincher's Rooney Mara as super-sleuth Lisbeth Salandar vs. the amazing portrayal by Swedish actress, Noomi Rapace.  And the relationship between LS and her male counterpart, Mikael Blomkvist, seemed pretty superficial - not the intense mysterious personality of the original heroine.  All that aside, here are my biggest beefs with the plot:  (1) the  court-appointed guardian of Lisbeth, Nils Bjurman, was cast showing a soft side - totally in contrast to the evil, sadistic villain we grew to hate in the book.  (2) In the rape revenge scene, how was the tied-up Nils Bjurman supposed to use  the wire cutters left him by Lisbeth to free himself - with his knees? (3)  Why does the ultra-careful, think-of-everything Lisbeth toss her jewelry in a sink and blond wig out the train window, exposing herself to capture after you know what  (if you read the book)?  And finally, (4)  the ending - since Fincher ignored the actual story plot - didn't make any sense connecting the many, many dots in this incredibly intriguing story.  If you really want to see a better version, see the original on DVD - either sub-titled or with English dubbing (which wasn't bad).  I'm glad I have all three Swedish films in my library - absolute classics!  But pass on Hollywood's unfortunate flop.",
      "total_reactions": 9,
      "user": "slotownfolk"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2012
      },
      "score": 1,
      "text": "I was really disappointed by Fincher's remake.  It pales in comparison to the Swedish version. I guess it would be acceptable if you haven't already been spoiled by the superiority of the original.",
      "total_reactions": 1,
      "user": "Draxex"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2012
      },
      "score": 0,
      "text": "This film is utterly unsatisfying.",
      "total_reactions": 1,
      "user": "HDeezy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 2,
      "text": "I will tell you that I didn't read the book so I cannot make any comparison with the movie. The movie though is totally disappointing: bad acting, slow pace, annoying and totally unjustified sex scenes... Also I'm wondering why did they need to remake an already boring swedish movie with british and american actors playing swedish characters?",
      "total_reactions": 1,
      "user": "tscarp"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2012
      },
      "score": 1,
      "text": "Too much un-needed explicit sex, and rape scenes if it weren't for the gratuitous sex scenes it would have been an enjoyable movie. The plot was good, acting was good. Had to fast forward many scenes, especially the rape scene and the oral sex scene. I don't know why  they choose to put the trash in this movie.",
      "total_reactions": 1,
      "user": "boops11"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "I must admit I was disappointed with Mara's performance as Lisbeth.  Lisbeth is a complicated character with complex emotions who suffers from constant inner turmoil.  I was looking forward to seeing an actress's attempt to convey such complex behavior.  And after all this is a story driven by a female lead character.  Unfortunately I can't even recall seeing any versatility or depth in Mara's performance.  She had only one facial expression, that of contempt for anyone who was present.  And her delivery of lines was not memorable in the least bit.  I believe what made this movie successful was the director's ability to put Mara into situations that were interesting.  In conclusion, don't watch this movie if you expect an inspiring or moving portrayal of Ms. Salander.  *Definitely give the English dubbed version of the Swedish movie a try, the voice acting is excellent, and quickly you can't even notice that its dubbed.",
      "total_reactions": 1,
      "user": "scorpionex"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "This is a very interesting and exciting movie.  Plus for the voyeurs a couple of nicely graphic sex scenes.  The movie moves forward from a journalist losing his job to taking on an assignment of what ever happened to a long-since-vanished member of a large Swedish family.  The person who know is a family member, and family members live far apart on apparently a large wooded island.  When the truth is known it is very different that I thought it would be, and in a way very satisfying.  This is worthwhile.   Go see. Oh yes, a note on the rape scene:  As seen and heard on local TV every night be prepared for anything and everything.",
      "total_reactions": 0,
      "user": "georgeblomme"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "I've read the books and seen the original Swedish movies - I'm a fan. This was very well made, engrossing, enjoyable and well worth the time spent. The fact that I knew the plot and had seen the prior film did not diminish the experience - it was intriguing to see what another director would do with the book, and he did a great job. Go see it - you won't be disappointed (as opposed to the Mission Impossible film, by the way, which was ridiculously bad. Just had to put that negative plug in there).",
      "total_reactions": 0,
      "user": "weisberger"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "Slick... Stylish... Smart... Sexy... Scary... Not for the faint of heart or the prude.  I like a good mystery especially one that keeps you guessing but it should have come with cliff notes because it was too hard to follow. Secondly, It really would have been a better film if it were shorter. The climax was suppressed because they tacked-on an extra storyline to the last twenty minutes. Finally, \"Q\" would approve of all the  \"gratuitous sex and violence\", (or in this case \"sexual violence\"). Unless you are a hardened masochist you WILL be shocked and offended. I had better not see anyone taking their minor children into this one. All that said... I thought it was a pretty great adult film.",
      "total_reactions": 0,
      "user": "gunnyart"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "Not even Fincher with admittedly inspiring casting, and an impressive list of nail biting movies such as \"Seven,\" \"Fight Club\" and \"Zodiac\", was able to emulate the edge of the Swedish original film which in turn could not compare with the depth of the original material in the book.  And although Craig, in contrast with Nyqvist in the original film, brings extra umpf with the surplus of erotic charisma needed to unfold the book's main character, it is the other way around between Mara and Rapace who steals the show in the Swedish version with her unflinching raw performance of one of the most complex characters on the silver screen to date.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "If you've seen the original Swedish version, there's not much new here. If you haven't, this is the American-language adaptation of Stieg Larsson's novel about a journalist (Daniel Craig) and his unusual assistant (Rooney Mara). He's hired by a wealthy old man to solve the mystery of his missing granddaughter, but discovers a series of brutal murders. Meanwhile, she's got her own problems, when she's enlisted to help him on his search. This film, which runs 2:38, unfolds with a slow anxiety, but never really manages much tension. Even the violent scenes are underplayed. Perhaps it's that cold Swedish outlook. The musical score is often pervasive and occasionally in the way. Director David Fincher has crafted a compelling, but slightly-confusing film.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Freaky. Dark. Weird.  I'd never read the books, but I was curious.  I haven't worked my way through the Swedish versions of the films yet, either.  This one will inspire me to do that, for certain.  I don't want to say I loved it, but I certainly did get captured by most of the elements of this movie.  Lisbeth is a great shot in the arm for women in cinema.  If you're a fan of cold weather, this movie is gonna be a treat for you.  I would rate this higher, but I was left a little unsettled by it.  I would say all my friends who enjoyed Silence of the Lambs will want to see this one.  The world is a dark and dangerous place.  You never know what you might find when you dig a little.",
      "total_reactions": 0,
      "user": "Finnatic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "I don't think this is as good as the original Swedish version but it is not a bad remake. The problem for me was that once you've seen Noomi Rapace in the role of Lisbeth Salander you realize that her performance just cannot be improved upon.",
      "total_reactions": 0,
      "user": "olympians"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "The question is, would you rather watch an excellent David Fincher film or have the world's most passionate feminist scream in your face and then punch you in the stomach? You can have both here without the physical pain of course, but you better have something soft and warm to hug by the time the credits appear.",
      "total_reactions": 0,
      "user": "johnmilas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "from Kate Winslet in \"The Reader\" did not see nudity as explicit and worked. Rooney Mara endorsed this film where there is also praise for the editing and sound fabulous.",
      "total_reactions": 0,
      "user": "wishmaster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "I have to stay really honest here, and I must say that I haven't seen a better movie in past, well, year and a half, maybe. I'm so captivated by it, and I still think about the movie's plot and the characters, who did an amazing job, especially Rooney Mara. I haven't seen the Swedish version yet ( the original - always the best ) but this movie is quite perfect. I usually oversleep movies, but dude, was I awake. It kept my attention till the end. I highly recommend this movie.",
      "total_reactions": 0,
      "user": "TheGorilla"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "The Girl with the Dragon Tattoo is a really great thriller with good central performances. It has just the right amount of creepiness to give it that nerve-wrangling edge. It isn't quite perfect, however. It's overlong and has a far too many subplots (probably set ups for the sequel). That said, the meat of the movie is fantastic... It just needed a little bit more of the fat cut off.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "A definate must see movie even without being as good as the original Swedish movie. David Fincher has done a great job with making this movie so soon after the original and still making his \"own\" movie. I'm just glad that so many more people will get to see this movie and be exposed to the great story behind it, as I know so many people who don't watch foreign films. A great performance from Rooney Mara should get an Oscar nod. Some tough scenes to watch means this is isn't for everybody, but for those who brave it will be well rewarded.",
      "total_reactions": 0,
      "user": "allystew"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "Solid movie, and unexpectedly excellent acting from Mara - absolutely great in the role and very brave / honest / touching in the way she did it. To me, the first 2/3 of the movie worked much better than the last act, both in terms of plot and pacing.",
      "total_reactions": 0,
      "user": "jonh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "David Fincher did his lurid best. See this English adaptation with fresh look. Rooney Mara's Lisbeth Salander is different with Noomi Rapace's. And also the movie, although a drawback but it's different air. Not Fincher's best work but it also great in every level.",
      "total_reactions": 0,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "If the scene of the opening credits already affirms that it will be a heavy dip in a violent world, covered with dense blackness and incendiary, what follows is an attempt to reveal this evil once hidden behind the power and the many untruths that people from the story are trying to impose itself. The corrupt businessman to the meticulous killer, maybe even beyond that. The great ambition of the film is pervaded all these facts by the figure that resonates with insane intensity of credits lost in the narrative development, Lisbeth Salander cultivates in her \"inability to live socially\" - which the state condemns a hallucinatory force in her proper strangeness of being. Her impenetrability marks the film, or perhaps the latter is molded to it.",
      "total_reactions": 0,
      "user": "jimmytancredi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Excellent drama and suspense in this film all the way through.  There were some unnecessary scenes that were a little over  the top for my taste but overall a very enjoyable film.",
      "total_reactions": 0,
      "user": "gfny"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "The original \"The Girl with the Dragon Tattoo\" was an exemplary film. It had great characters and an extremely smart and suspenseful plot. Then David Fincher's version of the film came out and totally blew the original out of the water. The characters were fleshed out more, especially the exquisite Lisbeth Salander played beautifully by Rooney Mara, who totally deserved Best Actress over Meryl Streep's wooden Margaret Thatcher. To put it bluntly, Mara's Lisbeth was a total bad ass, which was extremely needed. She played the character to a T and was more convincing than Noomi Rapace's portrayal (no offense Noomi). Daniel Craig also did a great job at playing Mikael and did the character more justice. The film was long but the length was needed. It took out all the filler nonsense of the original film and added more well-needed detail and style. David Fincher redeems himself a hundred times over after giving us the utterly terrible \"Social Network\" and re-instilled much needed faith back into his film making capabilities. It was taut, sleek, stylish, suspenseful and utterly provocative. Dark, graphic, and disturbing are age old trademarks of Fincher (see Fight Club and Seven) and he went and brought them back with a vengeance in this beautifully crafted and well-needed improvement to \"The Girl with the Dragon Tattoo\" series and can't wait to see what wonder Fincher brings to the table with the sequels.",
      "total_reactions": 0,
      "user": "schmageggey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "Great movie! Full of action, drama, and suspense. Another amazing movie by David Fincher! This movie was just a joy to watch the entire time. Can't wait for the next installment!",
      "total_reactions": 0,
      "user": "jstrickler872"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "Unsatisfying.  David Fincher who was at the top of his game with The Social Network runs all over the place with this piece and never manages to maintain a real focus on what the focus point of the film is about.  There are just too many subplots that supposedly drive what should be the main focus which is the serial killer that gets just lost in the translation.  Seven and The Zodiac did this much better.  Rooney Mara is quite good but her performance certainly did not merit an Oscar Nomination.  Daniel Craig is a standout as is Stellan Skarsgaard and Joely Richardson.  The music seemed retrofitted and at times competed with the film and became glaring and just noise.  The cinematography which seems to be used to underscore the mood of the film lacks a certain crisp quality that would enhance the whole process.  There is so much here that could have made an incredible film and yet all we get are loose threads.  There's nothing that creates a bond between the characters and the audience.  It's almost as if the author created all these little sub plots just to deliberately derail the focus of the story and actually succeeds.  Hanna was a better film than this with Saorise giving a much better performance in that vehicle than Rooney Mara does in this one.  Like any of us really believe that Rooney Mara was driving that motorcycle.  Dainel Craig gives credence to the investigative reporter and underplays enough to make him convincing.  Three quarters through the film it's pretty clear that Stellan is the villian.  The only piece that was surprising is that Harriett never died and was actually still alive yet there is little detail given to that subplot.  Fincher's direction is very even but empty.  The screenplay is just all over the place.",
      "total_reactions": 0,
      "user": "NJWolfgang"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "Fincher is once again brilliant and his films still remain an event.  Rooney mara's performance also is on the line of perfection. I am excited for his next film.",
      "total_reactions": 0,
      "user": "cabrita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "Stylish, Intense and interesting. The Girl with the Dragon Tattoo is an excellent film made by very talented film makers. Although there were a few things that were missing from the original, I found this version more enjoyable and entertaining and many important aspects of the film were explored deeper. The central character of Lisbeth is a fleshed out more and I felt I got to know the character better. The pay off to the intense scenes are also more rewarding. Perhaps the movie went 15minutes too long but it didn't worry me too much as I enjoyed the character so much. Be prepared for some intense graphic scenes but there is a point to it all. Recommended.",
      "total_reactions": 0,
      "user": "davenbettridge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "David Fincher's return to serial killer territory is a welcome one, The Girl with the Dragon Tattoo is an excellent crime thriller and one of year's best films. The modern day master of tension crafts an abrasive yet engaging movie, which tells the popular murder mystery story in an eclectic way. It can be considered an improvement from the Swedish version thanks to intriguing storytelling, the more detailed focus on the investigation and the portrayal of some characters. The crafts in this film were also top notch from its atmospheric score to its pulp film editing. Rooney Mara gives an edgy performance as the iconic Lisbeth Salander (applause) and I've always had an issue with Blomkvist's character but Daniel Craig did a good job portraying him in this adaptation. Despite my enthusiasm I'm not certain how thrilled I am about a sequel to a movie of this sort, but I'll wait and see how it goes.",
      "total_reactions": 0,
      "user": "lahaine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "Smart, gritty, well-paced, and beautifully shot, this incarnation succeeds in every way that the original failed. Featuring excellent direction by David Fincer and strong performances from Daniel Craig, Christopher Plummer, Stellan SkarsgÃ¥rd, and a magnificent, career-defining performance from Rooney Mara in the titular role, The Girl with the Dragon Tattoo' is most certainly a must-see for any fans of dark drama. A+",
      "total_reactions": 0,
      "user": "Mathos22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "One of david fincher's best films. Sure, at first it starts out kinda slow, but it speeds up. And once it does, it's like a punch right in the gut. Its brutal, intruiging, and captivating all at the same time. The best crime thriller i have ever seen.",
      "total_reactions": 0,
      "user": "Mcc123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "I thought this was a very well made film. Fastest 2 and a half hours I've ever spent at the movies. Funny, the book is too slow, and the film may be a little too fast.  I understand why, because the paperback of the book runs at 600+ pages. But I think I would have been a bit lost if I hadn't read the book beforehand.  The narrative suffered a little in my opinion. I wish the whole libel case subplot could have been even more condensed than it was, so as to leave more time to develop the central mystery. I felt that section of the story lost some impact, especially the final revelation of what happened to Harriet. (Then again, it fell rather flat in the book as well.)",
      "total_reactions": 0,
      "user": "pegasus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "When I heard David Fincher was remaking the excellent Swedish film The Girl With The Dragon Tattoo, I wasn't as worried as most people were. Fincher, having made Seven and Fight Club, I thought the source material was right up his alley. The film itself doesn't surpass the Swedish original, but is well acted and a well made film. The score is excellent by Trent Reznor and Atticus Ross. I guess the one thing is missing is the discomfort from the original.",
      "total_reactions": 0,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "David Fincher definitely kept his charm on The Girl with the Dragon Tattoo . Its an amazing mystery film that I was waiting so long. Amazing screenplay and amazing directing . Daniel Craig was really good at his role  . Rooney Mara definitely pulled off her emo look and her acting was her best (undoubtedly ). Filming location was in one word AMAZING . It was perfect for the film . It was Snowy , Dark , Cold  , The three best weather for an amazing mystery .",
      "total_reactions": 0,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "De la part de David Fincher, rÃ©alisateur de Se7en, j'en attendais beaucoup de ce remake amÃ©ricain et seconde adaptation de l'oeuvre de Stieg Larsson, Ã  commencer par un travail soignÃ© au niveau de l'atmosphÃ¨re. L'envie de voir un vÃ©ritable chef-d'oeuvre qui s'est confirmÃ©e dÃ¨s le (sublime) gÃ©nÃ©rique de dÃ©but, ce dernier nous mettant immÃ©diatement dans l'ambiance. D'accord, il n'y a pas trop de prises de risques, du fait que l'ensemble reste fidÃ¨le Ã  l'esprit du livre. Mais ce remake se montre bien plus imposant que son prÃ©dÃ©cesseur suÃ©do-danois. Il faut dire que le casting est de qualitÃ©, au point qu'on laisse de cÃ´tÃ© les acteurs originaux (Rooney Mara remplaÃ§ant sans mal la pourtant excellente Noomi Rapace); que l'ambiance du film est au-delÃ  de mes espÃ©rances car Ã©tant prenante, dÃ©rangeante et palpitante (grÃ¢ce aux effets sonores et Ã  la BO); que le scÃ©nario est lÃ©gÃ¨rement diffÃ©rent (question dÃ©tails); et que l'on ne s'ennuit pas une seule seconde pendant 2h38. Bref, une rÃ©ussite!",
      "total_reactions": 0,
      "user": "avatar16"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Woefully miscast, Daniel Craig is way too cool and confident for the character part and is one of the main negatives. The other is that the movie attempts to differentiate itself from the original mainly with a faster pace .. which is the general reason US movies suck when compared to European counterparts.",
      "total_reactions": 0,
      "user": "jjolla88a"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "Initially one would think it was too soon to remake the original Swedish version of the movie, unless there are people out there who find reading English subtitles objectionable. This film was definitely in English, presenting the typical Hollywood paradox of how to indicate that the characters are really of another linguistic background. This has been a problem since the first war movies where the Nazis are speaking English, usually with a German accent, and occasionally cursing in German. In this movie, the Swedish persona is communicated partly with the British accents of Daniel Craig and Joely Richardson and an occasional toast of Skol! Stellan Skarsgard, in the pivotal role of Martin Vanger,  is one of the few speaking English with a Swedish accent. Americans Robin Wright and Rooney Mara have the added challenge of reciting their lines with a vaguely British accent to indicate they are Swedish. The bad guy in the gruesome rape scene is a Dutchman speaking English, and Christopher Plummer is actually Canadian, but speaks with such slow, deliberate elegance, you think he's Swedish. It gets complicated. Background signs and coffee mugs are all in Swedish, since the film was shot in Sweden. But having decided to remake the movie, the film is there to be watched (or rented), and it does compare well to the intensity and drama of the original Swedish production. Some of the story details have been changed, to no purpose, for the alterations neither downgrade nor enhance the quality of the narrative. The best reason to see this film is to watch the performance of Rooney Mara, a newcomer, who in a previous life shows up in Internet photos looking like a sweet and innocent child with long, dark hair. She has transformed herself inside out, practically changing her skin to become Lisbeth Salander. If you saw the original, you won't even remember Noomi Rapace in the same role, because Rooney Mara's intensity just wipes out all previous recollections. The artful cinematography aptly describes the bleak, desolate landscape of a Swedish winter. But the main drawback is the same one that flawed the previous version--the brutality of the rape scene is too graphic and too realistic. Cinema is art, and graphic brutality does nothing for the artistic vision being so carefully constructed on the screen. This kind of explicit rendering puts the film on the same level as inferior-quality films that do not aspire to be high art. It's a huge blotch in the middle of the film. The torture chamber at the end is also problematic. Somehow these plot elements have to be suggested rather than depicted, and I'm not sure how that would be done. But then I'm not getting paid barrels of cash to make this movie. And yes, it was a faux pas to release Dragon Tattoo just a few days before Christmas, but fortunately, the box office receipts recovered nicely from that marketing mistake.",
      "total_reactions": 0,
      "user": "ClariseSamuels"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "It seems sacrilegious to suggest this, but I enjoyed it more than the Swedish film: a greater sense of tension is created and Rooney Mara is much closer to how I pictured Lisbeth when reading the book than Noomi Rapace. And it is not a remake of that film...it is a different dramatisation of the book IMO. And a better one!",
      "total_reactions": 0,
      "user": "grangehead"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "What a bloody brilliant film.....I've not read the books or seen the Swedish versions but I was utterly transfixed from go to woe......",
      "total_reactions": 0,
      "user": "OllieWillie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "I thought this movie was decent. It just didn't live up to its Swedish counterpart or the expectations I had for it. The complexity and mystery of the movie were handicapped by the standard American strategy of bludgeoning the viewer over the head with every significant fact. This, for a Hollywood move, was pretty good though overall.",
      "total_reactions": 0,
      "user": "quitmyjob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "It’s quite an accomplishment when a fine young actress with lesser known credentials than her A-List co-star, manages to steal the spotlight away in dramatic fashion, Rooney Mara does exactly that to Daniel Craig, this remake of the 2009 Swedish film packs quite the punch in terms of mystery and intrigue, it drew me in with the separate storylines which eventually intertwined, but the lead performances are the real gold stars of the film. Lisbeth Solander is the girl in question, and what a fascinating specimen this girl is, underneath the gothic clothing, erratic eating and one night stands, Solander has a brilliant mind, but a fragile state is the even ground, we know that she has been raising herself from a young age, she does what she wants and really because she can, dresses as she does probably due to a lack of opinion from others and has taught herself to remain alone and isolated from society, yet when she is faced with a problem she will try her hardest to figure out a way around it, including her appointed guardian (Yorick van Wageningen) abusing her to the point of desperation, she isn’t a girl to be taken lightly, but she finds an unlikely friend in the man she was hired to investigate earlier, Mikael Blomkvist (Craig), who has his own problems. His story picks up surrounding a court battle which he has little chance of coming out on top, he decides to help out an old and tiring millionaire called Henrik Vanger (Christopher Plummer) who lives on a private island, cut off from the mainland, he hopes journalist Blomkvist will help him try and solve the disappearance and probable death of his niece Harriet 40 years earlier, but when Blomkvist starts to dig, he realises the mess the family is in, relatives not speaking to each other, Nazi beliefs, estranged children and how clues seem to lead back to one or the other, a family matter indeed. The paths of the two leads cross as Blomkvist seeks the help of the young Solander, and their unorthodox relationship ensues.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "By no means did I think this was a bad movie per say; however, I can say with complete confidence that it was not what I expected. This movie is not safe for children everyone, so don't bring your kids; it's a mature thriller with a lot of sex, graphic violence, and disturbing moments. Overall, this movie was good, not great, but enjoyable nonetheless to any fan of cinema. Rooney Mara did a great job in her role of Lisbeth Salander, which I don't believe many people could pull off with so convincingly. I also believe Craig did a good enough job in the moments when he needed to portray emotion, but overall his character didn't truly stand out. The rest of the actors did a well enough job with their respective characters, but no other stand outs were really present. The plot is the true show here. Based on the novel of the same name, I was very captivated by the amount of immersion and detail was in this film. That can mainly be attributed to the two and a half hour runtime, which I'm sure has many potential viewers on edge. If you're willing to sit through the somewhat slow opening of Mara's character, it really picks up about an hour in and you are treated with some great interactions between Lisbeth and Mikael. The pacing, I'm sure, will appeal to many people; it's fast and entertaining. Personally, I'm not a huge fan because it can lead to unrealistic conversations and can be a bit hard to follow how characters reach certain conclusions, but it shouldn't bother most people. Fincher does a fantastic job directing as he does in all his films. This movie does hold similar \"dark\" tendencies to other Fincher-directed movies like Se7en and Fight Club, but there are definitely moments when The Girl with the Dragon Tattoo exceeds them. I cannot personally vouch for the movies accuracy to the original novel; however, I heard from my sister that she believed that for the most part it was close to the book, but there were a few parts where it wasn't and really confused her. Given Trent Reznor and Atticus Ross's previous work in The Social Network, I had high hopes for the score of Fincher's latest. I can't necessarily say I was disappointed with the score, but it didn't fully immerse me like The Social Network's brilliant score. Given Lisbeth's detestable behavior and character, it's shows pure talent how Fincher is able to connect us with her and care about her, at all for that matter. And by the end, you'll really feel for her in the sequel preparing conclusion. With everything accounted, this movie definitely has some faults and some confusing moments, but I found it to be very entertaining (albeit very dark), gripping, and definitely not feeling like two and a half hours. But I must once again stress the point: DO NOT BRING KIDS TO THIS MOVIE.",
      "total_reactions": 0,
      "user": "GradGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "This film is great I wish I didn't see the Swedish version cause I hated knowing what was gonna happen but I have to believe for the people who didn't see it it was amazing..",
      "total_reactions": 0,
      "user": "Pnhtwinz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "Having viewed the Swedish Millennium Trilogy, I have newfound respect for Fincher and Zallian's Dragon Tattoo film. It's impeccably shot(as expected), but I think they made many good choices as it relates to improving the source material(cinematically speaking). I even think they improved the latter narrative and suspense in most cases. The trouble with the Dragon Tattoo movie is the pacing between Salander and Blomvquist; it's jumpy and at times unnecessarily speedy. It also tries to much to adhere to the source material, when I think they could have made a few more changes and cranked up the 2 hrs and 44 minutes into some more meaty details regarding the plot. I hope they radically change films two and three if the trilogy is going to be remade. The Swedish/Danish production falls flat by film 3 in a big way, and Lisbeth Salander character deserves a better story.",
      "total_reactions": 0,
      "user": "SirEddieCook"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Return of the Jed.. Fincher. I loved the swedish trilogy, and my favourite books are Stieg Larsson's creations. Noomi Rapace was the perfect Lisbeth for me, and I didn't like Rooney Mara before.. But.. It's a great movie! Mara is brilliant, and Craig is better Mikael Blomkvist than (my favourite swedish actor) Michael Nyqvist. Fincher is back!",
      "total_reactions": 0,
      "user": "schrodinger"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "out of DETECTIVE movies...sherlock holmes, tinker and Dragon tattoo..this one is the best by far...will keep you guessing and the chilly baltic sea locales will keep you extra chilled.",
      "total_reactions": 0,
      "user": "timbosabo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Well this movie, pretty much answers any cynics that it could never top the original. The director pretty much did not care and gave the movie a personality that makes an almost perfect thriller. It's weird that the changes from the original movie and the source of it all, make this a great movie, which is tidied up to focus on whose the killer rather than the bigger, more complicated picture. Craig and Plummer provide two great characters which are easy to like. Mara is great as well and provides a different side of Lisbeth than Repace. This movie can also sum up all of Fincher's work...this is how varied it all is. It could be almost perfect if it weren't for the final part. It opens up to the possibility of a trilogy and ends kind of stale, because the movie already climaxed and kind of doesn't want to end.",
      "total_reactions": 0,
      "user": "Jefflyn90"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "This is a great movie, highly recommend all to watch it. I saw both this version and the Swedish version, The English version was WAY superior. I cannot wait to read the book.",
      "total_reactions": 0,
      "user": "Rhern26"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "While it's certainly not as great of film as the Swedish version, this American remake still provides an intriguing mystery even if the plot points have all been covered before. The movie is over two hours long, but with the storyline and Fincher's pacing, the whole movie goes by rather fast. I already knew the storyline, and I never felt the movie drag. I can only imagine how fast this movie would fly for those unfamiliar with it. The performances are also solid. Craig plays a good Blomkvist, but the real standout is Rooney Mara. When I heard that \"The Girl with the Dragon Tattoo\" was getting an American version, my prime concern was who would play Lisbeth Salander as credibly as Noomi Rapace did in the Swedish film. Then when I found out Mara was cast, I had my doubts. It was kind of like when I heard Heath Ledger would be playing the Joker in \"The Dark Knight.\" But just like Ledger, Mara turned all of my doubts away the second she appeared in the film. I'm not going to go so far as to say I liked her better than Rapace, but the fact that she was able to go toe-to-toe with her was pretty damn impressive. She definitely has an exciting career ahead of her after giving one of the most transformational performances of the year. In fact, she is pretty much the only reason to see this if you have read the books or seen the Swedish film. If you haven't seen the Swedish movie be sure to do so before you see this. Like I mentioned before, the mystery here is intriguing, but in the Swedish version it is absolutely fascinating, and it all has to do with the pacing. Yes, the pacing is faster here causing the running time to breeze by. But the Swedish version played it smart. It took its time slowly enveloping you in the mystery. This is an element that's missing here, and it constantly keeps this version from reaching greatness. Also, Fincher spends far too much time developing a subplot at the very end. The Swedish version wrapped up the same subplot in a shorter amount of time, giving us the exact same information in a more efficient and focused way. What I would recommend is this. First, rent the Swedish movie and avoid seeing this in theaters. Then, rent this version when it comes out on DVD. It'll make for an interesting comparison to see how two expert directors (one unproven, the other legendary) helm the same story.",
      "total_reactions": 0,
      "user": "JollyG87"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "This movie was just brilliant. Arguably my favorite movie of the year David Fincher brought us something that only be described as cinematic art. Fincher struck gold with his Lisbeth, Rooney Mara. She steals the show as is made obvious by her much deserved Oscar nomination. She really should win in my opinion but probably won't because the Academy messes up most of the time. Really just a beautifully written, perfectly acted, and professionally directed work of art. Perfect.",
      "total_reactions": 0,
      "user": "ryanjdrf1992"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "meh, not really that much to say about this, it's enjoyable and adequately paced. having a boring tuesday afternoon and apparently nothing better to do  watch this",
      "total_reactions": 0,
      "user": "oggret"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "Does the international sensation The Girl With The Dragon Tattoo live up to all the hype? In my estimation, no! There is no denying that the story is amazing. The book may be amazing, and the original Swedish version of the film might be equally amazing, but David Fincher's adaptation of it is not. From the very beginning it seems as thou he's trying to turn this story into something it's not, a sequel to Seven. The story is fantastic, however, there are so many odd names and so many mumbled lines thrown at you so quickly, that you're easily confused. At many points in this film I was confused, and even when the killer was revealed, my reaction was \"which one is that?\" Besides being confusing, the film has about an hour of footage that has nothing to do with the main story and just adds to the overall confusion of the film. Like I said, the story is really good, the actors were really good also, but the film was just very long and confusing, and to be honest, I really wasn't all that impressed by it.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "Although a negligible amount of minutes longer than the Swedish version, it has so many extra parts that are totally not necessary and detract from the main aspects of the film. I found the final act particularly dragging. The film was also too glossy for such a gritty story.  That said, it is still a decent film due to the source material and overall good acting",
      "total_reactions": 0,
      "user": "caswak"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "Millenium trilogy? What's that? I haven't read Larsson's books, I haven't seen the previous movies. Probably that's why I'm able to give this movie a sound 9. I don't care if this is a good adaptation of Larsson's book. What I can say is that I was simply captivated by this movie for 2,5 hours. The plot is good, makes you wonder, fear, doubt, and shock all the time. The gloomy atmosphere of a Northern Swedish town with a lingering mystery that surrounds the Vangners' possession is overwhelming and well presented. Trent Reznor's music is just great in stressing the hideous danger that creeps literally out of everything: iMacs, forests, photographs, neat Swedish homes etc. The acting of Craig is good (and just that), while the critic appraisals for Mara's performance are justified -- she is truly mesmerizing as Lisbeth Salander, and her acting, in which she speaks more with her eyes than actually words, is fantastic. The director of photography and the editing team did also a great job: fast-changing scenes truly capture all the necessary elements, gestures, and moments. What are you waiting for? Go watch it!",
      "total_reactions": 0,
      "user": "JudgeHolden"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Hell hath no fury like a woman scorned.",
      "total_reactions": 0,
      "user": "JKingham"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "This is a very complicated case.  Basically, this is a well done remake of a well done foreign film.  Fincher played it safe with this one.  I don't think he surpassed the original aside from the soundtrack.  Ignoring that this was Fincher and the exceptional original film, I would give it 9/10.  Considering that this was Fincher and a perfectly good Swedish film exists, I give it 7/10.",
      "total_reactions": 0,
      "user": "turingmachine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "After seeing the film, I was left with the impression that you only truly get to understand and enjoy this film if you have read the book before hand. I got the feeling that if I hadn't read the book, I would be left confused and unable to appreciate everything that happened. Having said that, I was intrigued to see how the story would be condensed into a film, and enjoyed this interpretation immensely. The cast are very good, and Rooney Mara was brilliant as Lisbeth Salander. Would recommend highly!",
      "total_reactions": 0,
      "user": "Christlewiski"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "Being a fan both of the books and the Swedish film, I found it very hard to objectively review the American version of the Girl with the Dragon Tattoo.  Over Xmas I got my hands on the original extended version of the Swedish films (9 hour miniseries) which I am in the process of making my way through.  Unfortunately,  it was only a matter of days between seeing the Swedish version and the American version in the Theatre. It was very hard to look past all of the small differences made for the American film.   There were some really good aspects to the American film that are worth mentioning.  I definitely felt that both the tone, music and cinematography of David Fincher's Film was superior to the Swedish film.  I also enjoyed both Stellan Skarsgard and Daniel Craig's performances.  I think anyone who goes to see this film, who has not yet been exposed to either the books or the Swedish movie will be blown away by it.  There were a few annoyances thought - and if you have seen the other film or read the book - it may reduce your enjoyment of the film.  The terrible accents were a distraction.  I hated that they gave Mikhail's character a daughter (I can't help but feel that this was only added to satisfy some censor's want to show the negative consequence of Mikhail's womanizing) and I liked the harder Lisbeth of the Swedish version (not that Rooney Mara was weak, or that her acting was bad, but she came across a bit softer than Rapace's Lisbeth).  That said I think it was still a very good film.",
      "total_reactions": 0,
      "user": "Sicksweet"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "David Fincher never fails me, even including the underwhelming THE CURIOUS CASE OF BENJAMIN BUTTON (2008) (which I think I seriously need a re-watch), the American remake of THWTDT is as excellent as its Swedish archetype if not excels in every aspect. Karen Oâ",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "The movie wasn't perfect, but it was good. The actors were amazing and Lisbeth Salander came to life in my opinion. At first I thought a lot of the book was left out, but if you have read the book you can tell why a lo was left out, yet the movie was still almost three hours. See it.",
      "total_reactions": 0,
      "user": "xZOMBx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Not nearly as dark as Id hoped, but a really great movie regardless.  I can't wait to read the novel, which as always I hear is better.  Someone said this is a remake of a foreign film; I saw this one on a lark with a friend the other day - had no idea!",
      "total_reactions": 0,
      "user": "Erika22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "This is an incredible movie. Having seen the original Swedish version of the movie I was able to compare them both. Both takes on Lisbeth Salander are amazing and each actress brings something a little different to the role that's one of the most difficult characters to play in any movie in a while. The U.S. version of the film is more stylish and clean than the original - the opening credits play like a James Bond opener complete with a cover of a Led Zeppelin song by the always awesome Karen O. In addition, Fincher adds an extra 20 minutes to the movie after the big climax that work perfectly to extend on Lisbeth as a character. While this also works as a more elaborate ending wind-down than the original, I agree with the critic that said that neither movie is superior to the other as they compliment each other very well and ultimately make for an even more solid understanding and likability of the story and characters. That being said, you don't have to have seen the original to enjoy this movie. It's still hard not to get wrapped up in the mysterious case until the very end and find compassion for Lisbeth as the movie unfolds. But while there are so many good things about the movie just make sure you know what you're getting yourself into by seeing it - there are multiple scenes that are difficult to watch but are equally as necessary to the story... maybe not the dismembered cat, though. But once you get passed the darker scenes what you're left with is an incredible story and film with gifted actors and actresses portraying characters who, regardless of appearance, prove to be incredibly human. Rooney Mara's take on Lisbeth is easily the standout of the film as she brings a needed vulnerability to the role but commands your attention every time she's on screen - I couldn't take my eyes off her. Anyway, what I'm trying to say is that it'll be very hard to find any complaints with David Fincher's take on 'The Girl With the Dragon Tattoo'. It's easily worth seeing again and I can't wait for the much-needed sequels in the, hopefully, near future.",
      "total_reactions": 0,
      "user": "Groover733"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "I was a little disappointed with this.  I'm a huge Fincher fan, recently The Social Network really surprised me considering it's dull subject matter, and I was constantly on the edge of my seat.",
      "total_reactions": 0,
      "user": "nascent"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Well, I can't help comparing it to the sweedish version which I loved. I loved the first half of this one betterr but. Was just not as satisfied at the end I was confused with the last half hour, I need to see it again. Over all great movie and definetly worth seeing. Extremlygraphic and disturbing at times...be prepared.",
      "total_reactions": 0,
      "user": "ilikemovies88"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "This is an engagind movie, yet, that is all it is. I heard so much about it! I thought it would be original and gripping, not just a fun, 'refined' cliche but what I found was that even though it has good elements, The Girls With the Dragon Tattoo is still little more than an average movie. This film recurs to stereotypical situations and characters to create tension. They are well developed but the movie lacks depth. Still, I enjoyed it so I went and rented the 2nd and 3rd sequels They were bad! Truly disappointing...Boring!. This one at least, has a defined plot and keeps the suspense until the end.",
      "total_reactions": 0,
      "user": "RegOz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "I'm one of those snobs who feels like the original Swedish version was a little better.  The first half of this version felt rushed while the latter half seemed extended--drawn out for every minute it was worth.  I did think the casting was superb and was glad they didn't water down the sensitive parts for the American audience.  All in all a solid effort.",
      "total_reactions": 0,
      "user": "Pahn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "I liked it. Solid performances by the cast. It was an interesting mystery that was nice to see unfold. I think the huge flaw of the movie is that it was a bit too long for my taste. Other than that, It was good.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Undoubtedly, the best motion picture of the year. Besides the great screenplay and perfect music it has magnificent view in every moment. Outstanding performance of Rooney Mara made this film. It is more than thriller, more than drama. It is the whole life in the one film.",
      "total_reactions": 0,
      "user": "philGab"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "This movie exceeds my expectations of my all-time favorite book. When seeing it, I was worried that it would be a rehashed clone of the Swedish hit movie, but, to my delight, I was wrong. Once the opening credits started, I knew I was in for the ride of my life. This movie, led by supreme acting by Mara Rooney, is artistic and moody. It is deeply disturbing, and does not shy away from its dark subject matter. The only complaint I can say is that for a movie set in Sweden, the accents are from all over the world. Daniel Craig never drops his British accent, and even Stellan Skarsgard lacks a Swedish accent. Only Mara Rooney embraces the role completely, and takes the movie from a good movie and ensures it to be a mind-blowing movie.",
      "total_reactions": 0,
      "user": "FlorenceWong"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "An amazing movie: definitely one of the best of the year of 2011. Craig and Mara were gods... A truly great thriller. The opening scene is perfectely obscure and awesome; its even appropriated to say: legendary! The movie begins very calm and starts to speed up. David Fincher - I did not liked that much The Social Network, but this one? This one you got it right. Keep up the good work (like Benjamin Button and Fight Club...)! I strongly recommend!",
      "total_reactions": 0,
      "user": "joaofariaff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "Best remake so far,,if you already watched the original dont watch it anymore,,Rooney Mara was awesome,very good acting,,she deserve an oscar for this,,Daniel Craig very good,,and a cool opening,,thuoght i was watching james bond filmm..",
      "total_reactions": 0,
      "user": "zidroj2008"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "Rooney Mara vs. Noomi Rapace, that is the question.  There is no real way to review this movie for me without comparing the two versions.   I really love the Swedish version, so I was a little hesitant about seeing the American remake.  However, a friend told me that is was good, and I should see it, so I did.   This is what I think; the American remake is a solid movie, and in some cases it may be more true to the book (thatâ",
      "total_reactions": 0,
      "user": "BadMovieLover"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "David Fincher doesn't need great source material to turn in celluloid excellence: The Social Network proved that if one does than something great will occur, but the original 'Dragon Tattoo' novels are not such material. The Swedish adaptation left me cold feeling back in 2009, but given Fincher's track record, I felt like I owed this film a shot. When the opening scene of the film opens with Vanger's phone call, I started to get antsy, is this going to be a shot-for-shot redux? No. No, it's not. The pulsing opening credits scored to Karen O's \"The Immigrant Song\" made me quite aware of that.",
      "total_reactions": 0,
      "user": "nevermindpopfil"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "Iâ",
      "total_reactions": 0,
      "user": "TruAlbino"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "David Fincher's great direction...",
      "total_reactions": 0,
      "user": "MickeyMickMic02"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "Hopefully is the best movie of 2011, quite interesting script, two characters as different as they seems, a perfect combination as a team. Just one well done movie.",
      "total_reactions": 0,
      "user": "GabrielaRodB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "This movie is a modern masterpiece. Incredibly well done, with amazing performances and a golden direction from David Ficher. Far superior than the swedish version in all the possible ways, and true to the book, this is what Dragon Tattoo fans were waiting for.",
      "total_reactions": 0,
      "user": "arthurdepr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "I loved that some of the cast went for scandinavian lilts to their accents, and some of them didn't. She's great, but the whole thing is such obvious trash, that the director's good taste and desire for realism makes the whole thing a bummer instead of a juicy guilty pleasure. Definitely a miss, despite the craft on display.",
      "total_reactions": 0,
      "user": "robozot"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "Simply put, good but not amazing.  I prefer the original miniseries from Sweden (the 6-part series, not the condensed 3 films, which remove almost 1 hour of content).  While this was faithful for the script, one of the main problems for me was the English language, as it does not fit the setting of the film and loses some of the realism and grit present in the originals.  That being said, Craig and Mara are a convincing pair, which makes this a good alternative for people who dislike reading subtitles.",
      "total_reactions": 0,
      "user": "OnAnarchy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "This movie may not be perfect but it definitely grows on you, and Fincher has still got it. Rooney Mara, who bagged two nominations (the Golden Globes and the Oscars as well)  for her goth-punk character  Lisbeth Salander, pours her heart and soul into it . Her performance is the best part of the movie. But mind you, this movie isn't for the faint of heart, But a must watch for Rooney's Electrifying performance as Lisbeth!",
      "total_reactions": 0,
      "user": "Ips207"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "LOVED THE CASTING. DAVID FINCHERS PERSONAL TWIST. ALL OF IT. Haven't read the books or the seen the first takes of the films, but I loved this one and hopes Fincher signs on to Direct the second and so on and  so forth.",
      "total_reactions": 0,
      "user": "zacthecreator"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "I liked this movie. The whole investigation is so captivating and casts were great. Rooney Mara is just amazing being Lisbeth, so real and raw. I totally believed that person that she is. Plot  and script were also good. Although some parts can be quite boring, but you just can't take your eyes away from Lisbeth, the girl with the dragon tattoo.",
      "total_reactions": 0,
      "user": "jzme"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Why did I watch it?",
      "total_reactions": 0,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "Good. Love the actors and the the tone of the movie. Its has some plot issues. It can be watched  but don't really let under 17 people watched as they will either be board or just freak out as is a complex story.",
      "total_reactions": 0,
      "user": "deamonhunter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "The Girl With The Dragon Tattoo es la mejor pelicula que he visto desde hace mas de un año. La actuacion de Rooney Mara es perfecta y magistral. Daniel Craig nos da otra solida demostracion de su talento y es aun mejor que la version sueca. Me encanto y aunque dura casi 3 horas me parecio intrigante y inteligente.",
      "total_reactions": 0,
      "user": "ObbiePR18"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "Engaging, intelligent, fantastic performances all round, masterfully shot and directed, David Fincher didn't put a foot wrong with this beautifully crafted thriller.",
      "total_reactions": 0,
      "user": "RedAFX"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "Great movie! I have not yet read the books, but I definitely did not expect the plot to be what it was. Mara Rooney was fantastic as well! I think that her role was very inspirational for women, and definitely got my adrenaline going, that's what makes a good movie-when the audience can connect with the actors through emotions and actions. Can't wait to read the books!",
      "total_reactions": 0,
      "user": "badesign88"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "Another Fincher classic, that's all I could think after leaving this film feeling satisfied as always.  I had not seen the original Swedish film before I saw this (I did a few weeks after), and found that both had definite strengths and weaknesses.  Call me a sucker for Fincher's style, but I preferred this version.  Mara is perfect, Daniel Craig is charming and reeks of class as always, and everyone else is absolutely top notch.  The process of the investigation leading up to the climax is all masterfully done by Fincher, he demonstrates further that there is no one better at building modern murder mysteries.  The only instance in which this film falters is the last 20 minutes, after an intense climax and satisfying resolution we are treated to more of the story.  It feels a little drudging and after dealing with so much ferocity in the last two hours it was difficult to become invested in the separate story (introduced in the very beginning for Craig's character).  Either way, this is required viewing for any Fincher fan.",
      "total_reactions": 0,
      "user": "CriticalState"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "Yes, I have watched the 2009 Swedish film. Yes, I have read the book trilogy. No, I do not think David Fincher's adaptation is worse than the Swedish film. It does not mean I think it is great either. However hard it must've been to adapt Stieg Larsson's trilogy to the big screen, I feel this film came closer to achieving the goal than the Swedish version, which - and I'm not speaking metaphorically - made me fall asleep (and I'm used to watching Bergman in Swedish!). The characters are well constructed, and I feel the actors playing them are better suited than the ones in the previous version (I mean, Erika is supposed to be attractive, Lisbeth is supposed to be a sociopath). Rooney Mara shows she has the potential to be one of Hollywood's great names. The photography is wonderful, with every single frame capturing the scenery beautifully. I would recommend this film to a friend, but I would specially recommend it to someone who has no plans to read the trilogy.",
      "total_reactions": 0,
      "user": "Delixu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "I've seen both the original & this remake and I have to say that although Fincher's version obviously looks better, has better production design and values and cool soundscapes by NIN they both have a very similar feel and it's probably a matter of personal taste which one you prefer. But if you have seen one you don't real need to see the other.",
      "total_reactions": 0,
      "user": "Apemonkey666"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "I thought this was excellent.  Being a big fan of the book and Swedish film, I was prepared to be disappointed, especially after Noomi Rapace was soo good in the original.  Rooney Mara's take on Salander is different but just as good, and I was really impressed by the film.  Less depth but more polished.",
      "total_reactions": 0,
      "user": "Ducatiman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "Compelling and, at times, brutally graphic mystery that entertains and signals the arrival of Rooney Mara as a star, but runs about a half hour too long, dragging at the finish.",
      "total_reactions": 0,
      "user": "JTKelley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "This movie was shocking in many ways - an excellent adaptation of the book, which was a shock - on par or better than its foreign counterpart - and a very engrossing cinematic experience, not to mention an incredible journey into the depravity of the darkest of mankind.  I found this movie hard to watch at times but was compelled to not shy away as it hit me in the face with the reality of the book and the deep understanding I felt toward the characters.  The acting is superb and the soundtrack is some of Trent Reznor's best and most mature work to date.",
      "total_reactions": 0,
      "user": "Nataraja"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "It has moments of grimness and Rooney Mara scenes that desperate teenagers will love but The Girl with the Dragon Tattoo has unbearable pacing and a scattered plot that doesn't really make sense.",
      "total_reactions": 0,
      "user": "Jack97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2014
      },
      "score": 8,
      "text": "USA update of the original.  I went in expecting this to be inferior to the well made Swedish version and that was the consensus that I heard about the film. It does do somethings better than the original though, i found this one to be more tense (helped by a good score) in terms of narrative structure even though I knew the outcomes.  The small intimate action scenes are also better in this version.  The minor issue with this one is that the woman who played the original Lisbeth is so good in that role that it is a difficult act to follow.  The actress playing her is fine, but the Swedish one is just more intense and more believable at times (dare I say i found here a little more attractive as this one is extremely thin.)",
      "total_reactions": 0,
      "user": "JamesCannon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2012
      },
      "score": 3,
      "text": "I was really disappointed with the movie, Lizbeth is the story her skills & life is the essence of the story & they butchered her part. There was nothing to show her computer hacking / programming super abilities which are essential in her role & her life.",
      "total_reactions": 0,
      "user": "Kooka"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "The Girl with the Dragon Tattoo is full of twisted characters that need to be locked away from the rest of us!It`s a mystery movie that mostly takes place on an  Island that feels like a cold prison for the privileged.The Main character is odd but interesting. I didn`t know much about this movie but was surprised to like it so much since it`s really not the kind of movie I normally watch.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Featuring an uncommonly sensational performance from Rooney Mara, David Fincher's take on \"The Girl With The Dragon Tattoo\" proves to be a cerebral, vicious and worthy addition to his repertoire overall.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "Well, it's complicated thriller far enough! The naked cruelty limits the sensitive audience while the tightly prescribed story keeps you deep breathing.",
      "total_reactions": 0,
      "user": "Mackey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "After a sloppy hour, where you feel like you just made a mistake by starting this movie, the plot starts to catch up and the characters start to unfold. I haven't read the book, but the plot totally hooked me, and I loved every bit of it when the movie started to progress. Rooney Mara did a superb job on portraying Lisbeth.",
      "total_reactions": 0,
      "user": "ZekeMarsh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "First of all, I'm a huge fan of the original Swedish film and Noomi Rapace's fantastic performance, but this one, OMG. Simply said, David Fincher's 'The Girl With The Dragon Tattoo' is a phenomenal masterpiece. I've watched this film five times and I still can't get enough of it. I can write hundreds of essays about this film, it's a perfect film for film students to deconstruct and study about, but moreover, it's incredible entertainment. It's impossible to talk about the film without raving about Rooney Mara's hypnotic performance, which I believe is better than Noomi Rapace's performance. This girl does it all in this film, she is completely unafraid of the camera, it's as if David Fincher yelled ''action''  from another closed room and let her do her job on her own or with a cast mate in another. I seriously can't wait for the sequel...",
      "total_reactions": 0,
      "user": "LebohangK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "Here comes an interesting and engaging thriller that presents itself with all kinds of twists and turns. While it may be to grotesque at times it still engages you as an audience member guessing what's going to happen next. The movie has a great cast led by Daniel Craig and Rooney Mara delivering a true oscar nominated performance. It also looks outstanding with its bleek setting and tremendous cinematography by Jeff Cronenweth. Overall, it's an outstanding fast-paced thriller filled with twists and turns. I give it an A!",
      "total_reactions": 0,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "I liked it, but I wasn't blown away by the movie. Even at two and a half hours, the story still feels cramped. This should come as no surprise, as the original book is about 600 pages of solid writing. Some elements had to be changed/cut out for the sake of pacing and cohesiveness, but overall the movie mirrors the book almost completely. Daniel Craig gives a good performance, but I felt like he was somewhat limited by the script. Rooney Mara fares better, bringing Lisbeth Salander to life, but I can't say that her performance was Oscar worthy.",
      "total_reactions": 0,
      "user": "skoorviel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "This film is a masterpiece. I've seen the Swedish one  I think) and  I have to say that the american is much better. The actors are fascinating. Daniel Craig, which is not one of my favorite actors impressed me and Rooney Mara was beyond excellence. The plot though it is based on a book is smart and it has suspense through the whole movie. I can't wait to see the next one. Plus, David Fincher did a great job in this one. A must-watch",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "Thanks to David Fincher, the world now has Rooney Mara to admire (and stare at). She plays the Goth misfit Lisbeth in this film, her first lead role, and she’s actually pretty good. She does revenge particularly well. A fierce character, while not dominating every scene, Rooney dominates the film. She is the one we think a hour later.",
      "total_reactions": 0,
      "user": "theseparator"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2016
      },
      "score": 8,
      "text": "A beautiful, touching and sometimes horrifying film. Rooney Mara beautifully captures the character of Lisbeth and her chemistry with Craig is wonderful. The best part? The score by Trent Reznor and Atticus Ross.",
      "total_reactions": 0,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "Best editing in a film adaptation you will see this side of the decade. The film runs at an arduous pace, yet that is welcomed by the audience due to its gripping story. Rooney Mara is strong, rugged, yet very human as Salander.",
      "total_reactions": 0,
      "user": "usherd369"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2016
      },
      "score": 0,
      "text": "Another vapid Americanization, which as usual loses all character of the foreign original. Even American remakes of earlier American movies seem to have become like this. Hollywood is just punching in their time card and getting paid, another day at the movie assembly plant producing meaningless products.",
      "total_reactions": 0,
      "user": "Charlemagne"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "The dark seeps out of the screen like living thing, evidence that The Girl with the Dragon Tattoo is more than a paycheck to director David Fincher, who has improbably affixed his own imprint on a movie that comes weighted down with possibilities and expectations no filmmaker should have to contend with. Aided by a tightly-wrapped screenplay adapted from Stieg Larsson's global best-seller by Steven Zaillian, Fincher strips the material to its skeleton, then adds back the sinew and tissue to create something that is unmistakably The Girl with the Dragon Tattoo, but in no way a carbon copy of the earlier Swedish movie or the book itself. This is what a movie adaptation should be: a film whose base narrative has its roots in the source material but whose soul can be identified through the images that unfold on screen.",
      "total_reactions": 0,
      "user": "MovieManiac83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2015
      },
      "score": 10,
      "text": "One of the best movies I have ever seen. The plot, the scenery, the acting, the audacity with which the movie has been shot is just amazing. Even though everyone is praising Rooney Mara; I just loved Daniel Craig.",
      "total_reactions": 0,
      "user": "underin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "A compelling ride for die-hard fans of the book series, dramatic thriller enthusiasts, as well as anyone who enjoys Fincher's darker works.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2016
      },
      "score": 7,
      "text": "No one should making the Girl with the Dragon Tattoo look so dull just by looking at it. It's not what you're thinking. It's the Girl with the Dragon Tattoo that makes us want to wear one just for the heck of it.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2016
      },
      "score": 1,
      "text": "really very bad. riddled with logical errors and b.s but you wont care because its so detached and boring.",
      "total_reactions": 0,
      "user": "iplayandwatch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2016
      },
      "score": 9,
      "text": "The dark seeps out of the screen like living thing, evidence that The Girl with the Dragon Tattoo is more than a paycheck to director David Fincher, who has improbably affixed his own imprint on a movie that comes weighted down with possibilities and expectations no filmmaker should have to contend with. Aided by a tightly-wrapped screenplay adapted from Stieg Larsson's global best-seller by Steven Zaillian, Fincher strips the material to its skeleton, then adds back the sinew and tissue to create something that is unmistakably The Girl with the Dragon Tattoo, but in no way a carbon copy of the earlier Swedish movie or the book itself. This is what a movie adaptation should be: a film whose base narrative has its roots in the source material but whose soul can be identified through the images that unfold on screen.",
      "total_reactions": 0,
      "user": "MovieMasterEddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2016
      },
      "score": 7,
      "text": "Having read the book and seen the original Swedish film, I had no reason to see David Fincher's The Girl WithThe Dragon Tattoo in theatrical release. However, an appreciation for his visually distinctive films necessitated a revisit to this familiar plot. Steven Zaillian's adaptation is workmanlike, but ultimately fails by softening the most important character, Lisbeth Salander, downplaying her brilliant sociopathy. Fincher has a wonderful eye for the austerity of Swedish Winter, but he'll never be accused of being an actor's director.",
      "total_reactions": 0,
      "user": "Cinemaphile"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2016
      },
      "score": 7,
      "text": "The whole point of making the film for English audiences is so we can watch the movie with people speaking English. So what do they do? Make all the actors have a thick accent and mumble the lines so they are hard to understand. I would say I missed about 20% of the dialogue due to poor enunciation and bad recording, not to mention the irritating loud electronic soundtrack which drowns out some of the dialogue as well. There is a large cast of characters and it is important to hear what they are saying so you can keep up with the story. Still, the acting was good to great (Rooney Mara is especially noteworthy) and the story was good. I felt it was one of those never-ending movies, where you think it's over but it continues on. Overall a solid movie, but not as good as others in the genre such as Silence of the Lambs.",
      "total_reactions": 0,
      "user": "TheArchetypes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2016
      },
      "score": 10,
      "text": "can you spell classic? cause i just did. bang. great flick. gfdsgfsgdfgsdfgsdfgsdgsdfgsdfgsdfgsdgsdgsdgdsfgsdfgsdgsdgsdgdsfgsdgdsfgsdfgsdgsdfgsdfgsdfgdsf",
      "total_reactions": 0,
      "user": "oiajhiofgqjworg"
    }
  ]
}