{
  "avg_user_score": 6.6,
  "metascore": 62,
  "mixed_rating_frequency": 60,
  "movie_name": "The SpongeBob Movie: Sponge Out of Water",
  "negative_rating_frequency": 44,
  "positive_rating_frequency": 156,
  "pro_critic_reviews": [
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2015
      },
      "score": 88,
      "summary": "The jokes are consistently hilarious, with enough variety to tickle the funny bones of old salts and young fishies alike."
    },
    {
      "critic": "Gwen Ihnat",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 83,
      "summary": "The visual effects and fast and furious quips combine for that rarest of releases: one that both parents and kids can enjoy (just like the show), leaving viewers of any age hoping that the next SpongeBob movie isn’t an entire decade off."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 80,
      "summary": "The spirit of the series remains true: cheerfully random jokes, blink-and-you’ll-miss-them references and, above all, a silly, stubbornly sentimental streak that only the crabbiest cynic could dismiss."
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2015
      },
      "score": 80,
      "summary": "At times there’s a genuine sense of daring to the film’s freewheeling anarchy, its refusal to stick to a central theme or impart any sort of lesson."
    },
    {
      "critic": "William Goss",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 78,
      "summary": "It’s high-brow, low-brow, and just about every brow in between, replete with meta winkiness and manic energy."
    },
    {
      "critic": "Nicolas Rapold",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 70,
      "summary": "The new film displays enough nutty writing and sheer brio to confirm the stamina of its enduring and skillfully voiced characters."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 70,
      "summary": "As tiresome as those live-action sequences are, they are more than outweighed by laughs — some riotous, some groaning and some very, very befuddled, but none predictable."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 67,
      "summary": "The SpongeBob Movie: Sponge Out of Water is a mild lark. It's odd, off-the-wall, and has enough jokes and gags that if you're forced to take your little one to the theater, you won't spend the entire time looking at your watch or planning your escape."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 67,
      "summary": "The film is frantic from start to finish, and I suspect it will wear some people down completely. I thought there was a point where it stopped being funny and started being exhausting, but my kids went positively ballistic for it."
    },
    {
      "critic": "David Hiltbrand",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "By the time the end finally arrives, you realize you haven't laughed in quite a while and, instead, have been thinking about the chores you have to do after you leave the theater. As diversions go, that's pretty diluted."
    },
    {
      "critic": "Christy Lemire",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "Zany and zippy as you’d expect, The SpongeBob Movie: Sponge Out of Water remains true to the surrealism of its animated television roots."
    },
    {
      "critic": "John Semley",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "Save for some halfway inventive touches, such as a meta-turn that evokes Chuck Jones’s surrealist Merrie Melodies short Duck Amuck, Sponge Out of Water coasts on its 3-D CGI shtick, sacrificing the giddy whimsy that recommends the SpongeBob series for more boringly Hollywood whiz-bang action."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "Ultimately, for the show’s fans, it may not matter if “Sponge Out of Water” shows a hint of mildew. After all, my co-critic’s most enthusiastic note — “Hilarious!” — was written before the lights even dimmed."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "The gags, puns mostly, skew quite young. And those things Spongebob does that drive his onscreen castmate nuts — the shrieks and giggles and songs — are pitched to be a lot more irritating to adults than to small fry."
    },
    {
      "critic": "Eric Henderson",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "Its dedication to the transgressive power of frivolity remains the franchise's greatest weapon."
    },
    {
      "critic": "James Luxford",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "The wayward narrative will appeal to fans as much as it will befuddle newcomers, making for an imperfect but hugely endearing family adventure."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "The film moves like a pyjama case full of angry weasels, and finds ingenious ways to cram every scene with just one more loopy, disposable gag or slapstick thwack. It may not be the year’s best animated film, but it’s almost certainly the most."
    },
    {
      "critic": "Kevin Harley",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "Next to message-laden, CG-soaked kids’ animations, SpongeBob stands alone. His return is a skittish but winning splash of nonsense: dip in."
    },
    {
      "critic": "Nick de Semlyen",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "Over-familiar and the first half's pace is sea-sluggish but with inspired touches."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 60,
      "summary": "What saves the film is that it is also packed to the gills with the classic slapstick sweetness that makes SpongeBob — in or out of water, on big screen or small — hard not to laugh at and love at least a little. Giggle, giggle."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 60,
      "summary": "It’s amiable goofiness, delivered at an emphatic, feverish pitch. Inevitably, what works fine in 11-minute episodes becomes strained over 90 minutes on the big screen, especially during a grating musical number about teamwork."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2015
      },
      "score": 60,
      "summary": "It isn’t just the sheer density of jokes that is impressive, but the diversity."
    },
    {
      "critic": "Michael Rechtshaffen",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2015
      },
      "score": 60,
      "summary": "Rather than further expanding those seemingly limitless SpongeBob horizons, the live action/CG stuff never satisfyingly jibes with the traditional nautical nonsense down below."
    },
    {
      "critic": "Jen Chaney",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "The SpongeBob Movie: Sponge Out of Water is like the family movie equivalent of a Krabby Patty: It tastes fine and will satisfy some cravings. But it’s ultimately a product cranked out to make money and keep our consumer-driven society, much like Bikini Bottom’s, chugging along without significant disruption."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "The live-action elements — mostly in the person of Antonio Banderas as cranky pirate Burger Beard, who spends most of his time addressing a flock of seagulls — don't mesh seamlessly with the animated sequences. It almost feels like two movies awkwardly melded together."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "Squeezes plenty of color and noise from a thin concept, then runs with it until non-fanatics can’t keep up."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 38,
      "summary": "It's passable."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "I loved this movie. It was great! Had so many hilarious moments, great action, and I loved how they brought them out of water. That new scenery was great! I greatly recommend seeing this movie.",
      "total_reactions": 5,
      "user": "motleycruefan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "This movie was great, well done, great story line.  VERY funny for both kids and adults.  We saw this on opening night and the movie was sold out, not a spare seat in house, but were first in line!  We saw the 3D version and that was extra cool and amazing, even though it cost a bit more to see it in 3D, it was worth it.  Great message for the kids about team work.  Some special guest stars were a nice surprise too.  Run to see this movie...even if you don't have kids!",
      "total_reactions": 3,
      "user": "stalkb01"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "Summary: This movie was a **** mess... but I liked it anyway. 70/100 [B-]",
      "total_reactions": 2,
      "user": "GuillermoBM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "It doesn't quite reach the quality of the original SpongeBob film, but SpongeBob SquarePants: Sponge out of Water is still silly, weird fun with some genuine laughs.",
      "total_reactions": 2,
      "user": "WheelzFourReelz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "This movie was a lot better than I expected. It was really funny for kids and adults alike. I loved the ending where they were referencing Epic Rap Battles of History. The special effects were fantastic, even with the 2D style and the 3D style. This is arguably the best Spongebob movie I've seen and one of the best animated movies I've seen in a long time!",
      "total_reactions": 2,
      "user": "BV-Swifty"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "I'm a fan of the SpongeBob TV show.  I enjoyed the film, although it wasn't as funny as some of the TV episodes.  The TV show where SpongeBob sells chocolate door to door make me laugh so hard my stomach hurt.  Nothing in this film is quite as funny but it still was humorous and held my attention throughout.  The animation itself was fun to look at.  It really held the attention of the kids in the theater as there weren't any squirming talking kids while it was on.  I do wish Squidward was featured more as I like his cynical personality.  The 3D effects were good as well.  It will be a Blu-ray purchase when it comes out.",
      "total_reactions": 1,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "A lot of people thought this movie wouldn't be very good because of the changed writers throughout the show's history, but this movie was way, way better than expected. It may not be the funniest or best animated movie out there, but it still holds up very well. I'll even go as far to say some elements in the film surpass the first movie. Paul Tibbitt, if you're reading this, you did a good job.",
      "total_reactions": 1,
      "user": "xZippy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "This is classic Spongebob. Ridiculous humour, outrageous plot, complete with talking dolphins and singing seagulls.  Like watching child-friendly Monty Python. Excellent all around!",
      "total_reactions": 1,
      "user": "DrChocolate"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "I'd have to say that I was entertained but not as impressed as I was with the first movie. Mostly, the climax of the first film was far better; the supposed tear-jerking moment wasn't as strong on this one.",
      "total_reactions": 1,
      "user": "shooterboss"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2015
      },
      "score": 7,
      "text": "It has a slight inability to make jokes that work all the time, that and a little more context, but when this movie does crack the good ones it cracks them right. Not nearly as good as the first film, but a decent sequel with shimmering glimpses of the quirks our lovable characters had back in the first seasons of the show....*sigh*...",
      "total_reactions": 1,
      "user": "TrilobiteG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "If you like the show you'll like the movie.  I never really watch the show, but knowing the characters and their motivations I was for the most part entertained.  B",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "The Spongebob Movie: Sponge Out Of Water is a very enjoyable movie to watch. The humour is sharp, the animation although TV standard, is still entertaining to look at due to all of the wacky things going on screen and the live action portions contain just the right amount of cheesiness in them.",
      "total_reactions": 1,
      "user": "YinYanReshiram"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "This is the unthinkable spongebob movie! seriously it is! even though the humor has some issues, but Jonathan Aibel and Glenn Berger's script has made a laugh out loud fun time at the movies. Director Paul Tibbitt, has made this movie a blast with  fun characters a unique story also an incredbile movie. Grade A-",
      "total_reactions": 1,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "The superhero and CGI parts are easily the weakest in the movie, thankfully they don't make up most of it. It's an absolute joy to watch the whole way through.",
      "total_reactions": 1,
      "user": "powermad80"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "It stays true to it's SpongeBob style and comedy, making it a very satisfying film to watch. The plot to the film though seemed to be somewhat overdone with many incredibly strange and unnecessary scenes that will leave you thinking \"What was that?\" Although the film's plot was all over the place, it still holds itself together as a great animated film. It may not win the hearts of non-SpongeBob fans, but if you are a SpongeBob fan or you just love animated films a lot, then this is a must-watch.",
      "total_reactions": 1,
      "user": "Mcgillacuddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "If you're a fan of Spongebob, then you'll with out a doubt enjoy this movie, the humor hasn't changed and there's lots of funny moments. I'm glad the movie sticks mostly to it's standard 2D animation, with only about 20% of the movie being 3D animation. However I don't think it holds up much against the first movie, it lacked the bang and creativity it had.",
      "total_reactions": 1,
      "user": "Whopping"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "4/5★ If you are a fan of The SpongeBob, as I am, this film will tickle your fancy. Zippy, crazy and meta to the max, the mix of animation styles meshed with live action will please the pop culture enthusiast and the kids alike.",
      "total_reactions": 1,
      "user": "reellm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "(Before you read the review I did watch this when it came out in the advanced screening but never made a review back then so...... yeah)",
      "total_reactions": 1,
      "user": "Gandpug"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "Thankfully, The SpongeBob Movie: Sponge Out of Water is a really fun time. It captures the original spirit of the show and maybe in the could end up being a cult classic, especially for stoners. Smartly written and filled with multiple gut busting one liners, this is a movie that can be enjoyed by kids and adults alike.",
      "total_reactions": 1,
      "user": "Movi3R3vi3wer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Spongebob: Sponge Out of Water is a decent film, but I wish the filmmakers hadn't gone so far out of their way to reach the stoner audience. I found this Movie mildly enjoyable as it's well animated, and funny, but the story is very unfocused, and it makes a bunch of turns and has scenes that don't really further the story very well. If you watch this movie with a kid you'll have a little fun, but you may be slightly confused.",
      "total_reactions": 1,
      "user": "tjman09"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "I was quite disappointed by this.  As an adult the tv show is loaded with intelligent satire, unique and quirky humor.  The combination of high and low brow humor, slapstick and innuendo is enough to keep many adults happy and entertained.",
      "total_reactions": 1,
      "user": "Ryyx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Although I wanted more from a SpongeBob movie and while the story was whacked up and crazy, the frantic  movie itself, the humor, the impressive cast and soundtrack, and the great use of 3D really made up for the movie's painful shortcomings. If you're a SpongeBob fan, this is a real treat for you.",
      "total_reactions": 1,
      "user": "AGN"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "The movie was far beyond enjoyable, the time travelling sequences made it worth seeing in 2d and 3d, the jokes were solid (i would expect nothing less) and the adventure was grand enouh to feel this was truky a successor to the original spongebob movie. Going into the movie i was hoping for a nice chunk of traditional animation and i was definitely pleased, However i dont know if they spent enough time out if the water to really warrant the title \"sponge out of water\".The cgi was downright impressive, the animation was solid, the characters were well voiced and the movie was not what one would call predictable. The rap at the ending though, was downright atrocious.it was clearly done by the creator of \"epic rap battles of history\" and as such reeks of his \"im better than you\" \"no im better than you\"lyrical content and his copy and paste delivery style, it had nothing to do with the film we had just watched and it cuts off the closest thing you get to a play through of the spongebob theme,it smelled so badly that it costed the film a point .",
      "total_reactions": 1,
      "user": "CorporalPajamas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "ad the movie was great I imagined more and I was not disappointed but surprised so it is fair to give a 8/10 the only reason I give it 8 is because it takes 45 to an hour to understand",
      "total_reactions": 1,
      "user": "spongeswift"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Sponge Out of Water is a pretty good movie! I went to see it and I loved it! It is a little confusing at first, but is good. The only thing I don't like is how SpongeBob, Patrick, Mr. Krabs, Sandy, Squidward and Plankton are only on land for about thirty minutes! Overall, it is a good movie!",
      "total_reactions": 1,
      "user": "SpongeBobfan13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Well, I liked it a lot, but the movie advertises a lot the CGI, but the movie only has like a 30% of CGI, the rest of the movie is traditional animation, But the movie itself is great, it doesn't fall in the bad written and rushed sequels, it doesn't make me laugh a lot, a kids movie with adult jokes.",
      "total_reactions": 1,
      "user": "Gogeta149"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "Most of the jokes were flat just like the T. V. Series but that's okay. The movie was still pretty entertaining especially the CGI part. This is pretty much just the expanded version of an episode of the Spongebob shows so watch this if you like the episodes.",
      "total_reactions": 1,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2015
      },
      "score": 10,
      "text": "The SpongeBob Movie Sponge Out of Water Is Great Film I Love SpongeBob Also Love 1st Movie Animation Is Good Live Action Is Awesome Characters Is Awesome",
      "total_reactions": 1,
      "user": "jrdacosta2002"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Spongebob is funny again and also Burger Beard    .",
      "total_reactions": 5,
      "user": "DavidWarden"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "A great movie, and a hilarious one. It has a great story line, and a LOT of humor, and there are even multiple things in the movie that are from older Spongebob episodes. I recommend seeing this right away - you will not regret it.",
      "total_reactions": 3,
      "user": "pbjms"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Sponge Out of Water was a great movie,and I would watch it again and buy a Blu-Ray Edition of the movie.",
      "total_reactions": 7,
      "user": "otakudbz"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Zany, and the most quirky fun you will have at any movie. Sponge Out Of Water is a huge improvement over the first one. Sponegbob is Nickelodeon's king, it is the only reason Nick went out and made a movie for this. And believe me, it was satisfying. This movie looks and feels like it's for kids, but the humor is very adulty, and it seems like Nick wanted this to be like the first, older seasons of SpongeBob, quirky and fun. All the voices return from the show, but Antonio Bandreas played, really well, a pirate. This movie feels like a stoner drug trip, the effects are turned up so high, that the scenes move at a jarring pace. Sponge Out Of Water, kept me entertained and laughing during it's runtime. It is a a movie not only that kids can enjoy, but adults as well.",
      "total_reactions": 6,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "This is the WORST movie of 2015! EVERY joke falls completely flat. (Example: \"Aw, nuts! I'm out of nuts!\") The characters are wooden, the animation is ugly, and the script is an abomination. Any third grader could have written a better story than this. I loved The SpongeBob SquarePants Movie (2004). I love the television show. I cannot believe that The SpongeBob Movie: Sponge Out of Water was made by the same people! Whose idea was it to include the seagulls??? How the hell did the seagulls get approved by the writers, the director, the producers, or the studio executives??? Watching the scenes with the seagulls was akin to torture. My I.Q. dropped several points as a result of seeing this monstrosity of a movie. I tried to sleep, but the movie was so loud and obnoxious that I could not even get in a little nap! EVERYONE involved with this piece of detritus ought to be ASHAMED of themselves for cashing their paychecks. And what the HELL was Antonio Banderas doing in this movie??? This is where his career is at? Wow. And then, at the end, they throw in some half-assed rap songs with an island twist? Since when has rap EVER been associated with SpongeBob Squarepants??? JeeeeZuuuus! NOOOOOOO!!! See this movie at your own peril! Shame on you, Steven Hillenburg, Paul Tibbitt, Jonathan Aibel and Glenn Berger, shame on you! Give me back my 92 minutes.",
      "total_reactions": 6,
      "user": "BrookElison"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2015
      },
      "score": 1,
      "text": "If you are an adult, bring the kids to watch this movie, but leave your brain at home.   I went to watch it because MetaCritic gave it a 63.  I left half way during tbe movie, because the \"Stupid Level\" reached it's peak, and I couldn't sit there anymore.",
      "total_reactions": 2,
      "user": "wadisplace"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "This movie is great! It's great to see spongebob back to his old self (the nostalgia is real.) This is really entertaining if your an new or old spongebob fan. In my opinion this doesn't really feel like an 1 hour 32 min movie, not saying this in a bad way, but it really feels like a 1 hour 50 min movie. One problem I have is that the superhero scenes are not as long as you think, it's at least 30-35 mins of it",
      "total_reactions": 2,
      "user": "Red-Opposom-098"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "It is Great and funny i love it do more movies of  SpongeBob Movies.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!1!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "total_reactions": 2,
      "user": "ThinkKopiGaming"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Engraçado e criativo. As metalinguagens que usaram no filmes foram muito inteligentes. O 3D foi muito bem aplicado e muito bem feito e de forma alguma atrapalhou os fãs do bob 2D. Outro ponto muito interessante são as referências e homenagens que o filme faz, como a dos golfinhos.",
      "total_reactions": 9,
      "user": "ivanborges"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "The animated gang faces a crisis when the recipe for Crabby Cakes goes missing. Their frantic search leads them on land to chase a human pirate (Antonio Bandares). As on the TV show, the cheerful pace never slows, but many of these jokes fall flat. I was hoping to find sly references or double entendres for my grownup sense of humor, but that didn't happen. The kids at the show only laffed out loud 2 or 3 times. While it's upbeat and frantic, not much was original or genuinely funny.",
      "total_reactions": 3,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Want to know how funny this movie is? Some of the funniest jokes in the trailer aren't even in the movie! True, Instead of ALL the funny jokes from a movie going into the trailer.",
      "total_reactions": 3,
      "user": "Proteus"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "First of all, why in the name of satan would any critic like this movie? What are you critics on, marijuana? The story made absotivily no sense what so ever! You have a dolphin that came from a pink floyd triangle, Spongebob and Plankton made a time machine and they had the cgi for a little while and I was wanting to have that more in the movie. I have to admit the underwater animation was ok but seriously it hurt my eyes. I didn't even laugh except for the \"MY LEG!\" part. I didn't understand why adults liked it either and most of them hate spongebob and they were laughing at everything in the movie. Good GRIEF! OH and you people think that Strange Magic was weird. That movie was F***ing awesome. Way better than Spongeboob. Come on critics you guys make me sick. One more thing, my brother almost died of boredom. YES BOREDOM! And my grandma almost died to from the stupididty.",
      "total_reactions": 12,
      "user": "TakJones87"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "When I was a kid, I loved the episodes before the first movie, & the first movie was really good too. I still love those. But after the movie, the show started to lose its hilariousness & now the current season just makes me so mad. The Spongebob franchise is like Adam Sandler, its glory days were wonderful, but now I just can't stand it. So I heard this movie has the producers from the first three seasons, the only ones that ever, EVER happened, so is this movie good? Not like I wanted it to be. I saw it in 2D, but I could easilly tell when they went \"Hey! Look at our cool 3D! We're hip!\". It's not 2009 anymore, nobody gives a s*$&t;! Plus,?most of the humor was comparable to Batman & Robin. Yes, I went there. The pirate was annoying & he had seagull buddies which were like Jar Jar Binks, & It wasn't any better than the current season of spongebob. I will admit the last third act was actually better than the first two & I thought the third act was going to be the crappiest part. Other than that, a few chuckles, Tom Kenny, Rob Paulsen, Kevin Michael Richardson, & a cameo by one of my favorite YouTubers were this film's saving grace. Since my rating can't be used for the score, I'll put my rating here & my score above. I give \"Sponge Out of Water\" 1.8 out of 5 stars.",
      "total_reactions": 6,
      "user": "ChristianHannah"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "This would be without a doubt the worst movie I have ever taken my kids to. Even they were bored and wanted to leave half way through. I dozed through it and my wife fell asleep 15 min into it. Given the calibre of movies coming out, Im stunned this is even being screened. Plenty of other flicks to spend your hard earned money on. Give this one a wide berth",
      "total_reactions": 2,
      "user": "ChickenCrimpy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2015
      },
      "score": 4,
      "text": "Is it stupid, yes. Is it childish and annoying, absolutely. Does it at times kill your brain cells, of course. But SpongeBob believe it or not as some funny moments that make you believe for a few minutes that this pretty bad film isn't all that bad.",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2015
      },
      "score": 3,
      "text": "To start off i like spongebob cartoon. I gave it a 3 because my 5 year old liked it and it's not a the worst movie but def. not good one. A lot of bland and dumb jokes some of them fart jokes. The seagulls were a bad idea. Love antonio banderas but kinda corny in this one cuz of script. Really dumb story seemed written by a really young kid. Expected to see much more of the 3-d spongebob  because of trailers but was maybe last 20 minutes. I was actually starting to fall asleep btw part way through. Seems like the theater crowd was forcing laughs. And most importantly just missing some of the elements that makes the cartoon loveable and the ones that were there, were bland and forced. Don't recommend it.",
      "total_reactions": 1,
      "user": "Andresitooo"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "Dis keik is a lai",
      "total_reactions": 7,
      "user": "parenter"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "\"Would you hurry up? You're making the movie too long!\" This Overlong Movie made a lot of changes as they did in the trailer. I don't think kids could understand if the movie is too long. Then you'll child would say. \"it's not long, it's an 93 min Movie.\" Yeah, right. But good things about it it's Positive, some gags are funny, and Perfect 3D Effects.",
      "total_reactions": 1,
      "user": "IMAX500"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "This film is alright. The jokes are sometimes funny the story is okay and the 1 song is amazing.",
      "total_reactions": 1,
      "user": "sonicheroes123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2015
      },
      "score": 5,
      "text": "Even thought this movie giving you weak jokes was a disappointment, the real life acting was impressive, and so was the animation. But still, it is not a good movie. And i will tell you reasons why:",
      "total_reactions": 1,
      "user": "Kooledud"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "I am, and have always been, a huge fan of Spongebob. I grew up watching the show, and the first movie is one of my favorite movies of all time. And I guess trying to connect this movie with older Spongebob was mistake number one.",
      "total_reactions": 2,
      "user": "Jamejarrs"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "The SpongeBob Movie: Sponge Out of Water is the first film in the long running franchise since 2004’s The SpongeBob SquarePants Movie and represents a brief resurgence of relevancy for a series whose cultural significance has dwindled to a Kindergardener’s introduction to memes.",
      "total_reactions": 1,
      "user": "DRauchDoes2015"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2015
      },
      "score": 1,
      "text": "I was really excited to see this movie ever since i watched the first episode of spongebob(I put that wrong I mean I wanted a lot of movies) I loved it and of after the first movie I was really excited for this movie and was blown away when I saw this DRUM ROLL, its awful there were so many good ideas like a invasion of humans some actual action but this was wait for it boring,awful jokes,weird animation, and also the whole new scenery just made my brain break in one episode there was a bet if spongebob and his friends could stay out of water for 1 minute not 30 so you just broke one fact about this show, Good Job. I loved the first movie it was amazing the cartoon drawing just makes me want to watch right so good bye.",
      "total_reactions": 1,
      "user": "RockKing"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2015
      },
      "score": 4,
      "text": "This movie is better than the original spongebob movie. But spongebob stopped being enjoyable after the season 5 ish of the tv series, this movie did have some and i mean some funny moments. but ultimately, it was not worth redbox",
      "total_reactions": 1,
      "user": "AaronDWasserman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2015
      },
      "score": 4,
      "text": "Spongebob stopped being enjoyable after its 4th or 5th season on tv, the first spongebob movie was also very disappointing, I didn't expect anything going into this, and I was right.",
      "total_reactions": 1,
      "user": "adw55125"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2016
      },
      "score": 5,
      "text": "Nine seasons and two movies and billions of dollars in merchandising later, we still can’t get this optimistic sponge out of our minds. We still love the porous protagonist’s contagious laughter and the dimwitted laziness of his sea star friend. We still long for days in our youth when we could venture to Bikini Bottom in our minds to eat a Krabby Patty, catch some jellyfish, annoy Squidward, play karate with an underwater squirrel, and lounge out at Goo Lagoon. Now finally, in The SpongeBob Movie: Sponge Out of Water, these immortal friends of ours come to life in a modern meshing of computer technology and live action, rendered in colors and textures fresh enough for you to almost reach out and touch these icons you’ve come to love.",
      "total_reactions": 1,
      "user": "TrevorsView"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "They advertise the movie as 'sponge out of water' and show the live action stuff, but in reality they're only on land for about 20-25% of the movie, the rest is all still cartoons and underwater. Nevertheless, still funny and stayed true to the spongebob style. I just wish they'd advertised the plot properly.",
      "total_reactions": 0,
      "user": "slicshuter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "SpongeBob's return to the big screen in a grand scale.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "Nickelodeon's greatest icon - Spongebob will make you laugh once more with this fun adventure with him and Plankton! As a big fan of the series i enjoyed the plot, but i think it could've been better! Overall i really liked it and i highly recommend this to all children out there!",
      "total_reactions": 0,
      "user": "SEROJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "A movie that it would be much better if it weren't so goofy, \"The SpongeBob Movie: Sponge Out of Water\" is enough to entertain the kids, but not satisfying enough to appease demanding moviegoers.",
      "total_reactions": 0,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2016
      },
      "score": 10,
      "text": "An unexpectedly satisfying film! This movie may have seemed doomed from seeing the trailers, but those trailers were a bit misleading. The life action segments really make brief appearances and the live action battle isn't 'til like the end of the movie. So mostly a large majority of the film was the typical 2D animation. But still, there was plenty of hilarious humor and comedy, an interesting story, the characters are great, and the songs are pretty fun. They were even able to sneak an Epic Rap Battle in there which was like one of the best musicals and parts of the film. A great movie that even the adults might enjoy!",
      "total_reactions": 0,
      "user": "jacob4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "The new SpongeBob movie will probably sit close to many peoples hearts, expectantly those who remember the first movie a few years ago witch was received extremely well by fans and movie goers. This new SpongeBob movie is just like the TV show and keeps lots of the same humor that sneaks in those more adult themed jokes well still keeping it Family oriented. Obviously the story won't be anything special but the humor of how they get from point A to B is what makes this film enjoyable. For those of you who saw the trailer of all the main characters on land in Full CGI and got all excited to see a who movie like that will be sadly disappointed because that is only the last act of the film, It's a good last act but it leaves you wanting more. The animation for the Cartoon and the CGI segments of the film are done extremely well, will little minute details all over. Fans of the old TV or Movie should give this one a chance and I'm sure it's even more enjoyable with some buds and beer.",
      "total_reactions": 0,
      "user": "ToFewViews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "The Spongebob Movie: Sponge Out of Water is an entertaining watch that feels like one really, really long episode of the cartoon.  Many of its jokes feel familiar, in a good way, and there's a good balance of jokes for adults and jokes for kids.  Antonio Banderas was great fun to watch in particular.  The gag of having them out of water and as super heroes lasted a little too long for my liking, but everything came to a satisfying cartoony conclusion.",
      "total_reactions": 0,
      "user": "heatherm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "This was a very skit like film, and they really weren't out of water very much, but yet the film kept me very entertained, couldn't stop watching as the hilarious randomness went throughout the film. I would have given more than a seven out of ten average if it had a better ending, the ending was very quick as if the writer just wanted to hurry up and end the film. But still great move!",
      "total_reactions": 0,
      "user": "AnthonyJayce"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "This was a surprisingly good sequel to the original Spongebob Movie. It had dozens of funny jokes, and the 3D animation looked awesome. The plot is OK if you look very deep into it, but it's great if you don't.",
      "total_reactions": 0,
      "user": "TheAwesomeUser"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "If you are going to watch a movie about spongebob you know what you are expecting, and that is exactly what the movie does. It is funny in a way that is very similar to the original show on nick, you get a lot of completely random nonsense and plot twists. The jokes are very diverse, the same type of joke is only reused on very rare occasions. All in all i found the movie very funny and can recommend it to anyone who likes the show on nickelodeon.",
      "total_reactions": 0,
      "user": "Schnitzelkuh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "It sure is not as good as the first one but this movie does not fail to entertain me. Every scene is enjoyable and i'm sure if you're not a spongebob fan you will at least laugh just a little no matter what. In the end SpongeBob: Sponge Out of Water is definitely on my top best.",
      "total_reactions": 0,
      "user": "DavidV293"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Who known that a SpongeBob Movie produce by Nickelodeon film would actually turn out not as terrible as I thought it will just because of Nickelodeon track record of the last couple years.",
      "total_reactions": 0,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "If you want The Spongebob Movie (the original), then don't watch this film. This movie is more like an expanded rendition of the original Spongebob TV episodes, rather than a film format. The plot doesn't speak otherwise, but this spin on the \"Plankton steals the KP formula\" formula is sure to keep you interested.",
      "total_reactions": 0,
      "user": "danwest"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "I went into this movie expecting hate it but, by the end I found myself wishing it would never end. I was expecting it to be similar to newest episodes of SpongeBob but to my surprise it was more similar to the first season. It actually made me, a hater of the show want to go and watch some season 1 of the show. In conclusion if you are just looking for a good watch this movie will not disappoint.",
      "total_reactions": 0,
      "user": "darkbloodshed13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "finally an excuse to watch spognebob as a grown up :D it was good, it would be hard for some people to see spongebob and the other characters in 3d. but it was fine in my option! most of it is 2d anyway!",
      "total_reactions": 0,
      "user": "kamhagh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "An incredible movie SpongeBob animacio'n surprised with original animation and live-action , also highlighted the work of Antonio Banderas fun as Burger Bread .",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "Just as I expected from a Spongebob movie- random, crazy but utterly hilarious. There are only a few problems. Y'know that hilarious joke in the trailer where you think Patrick has fallen in love with a woman but he's actually in love with her ice cream? Well in the actual movie they ruin the joke by making it clear that he's looking at the ice cream. Still, the other jokes were hilarious. The bits in Bikini Bottom are the best bits (and thankfully, the majority of the movie takes place there) because the superhero thing in the live action world gets old eventually. It should have just been a one off joke. But if you're a fan of Spongebob, watch this wonderfully silly and crazy movie.",
      "total_reactions": 0,
      "user": "DanBurrito"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "Cons: Uneven humor that is a hit or miss, very bizarre sequences, and only a very small portion of the movie is \"out of water\".    Pros: Surprisingly enjoyable, offers humor for wide variety of ages, and the bizarre sequences are so outrageous you might think the writers were on some sort of drugs.",
      "total_reactions": 0,
      "user": "cwilliamhud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2016
      },
      "score": 6,
      "text": "The SpongeBob Movie: Sponge Out of Water is not like me as \"a Sequel\" for The SpongeBob Squerpants Movie. The real problem are the story had 3 differents acts and it dosen't conect with the story. And some of the new characters are really annoying. But it still had that SpongeBob comedy with the return of Hillenburg. And also the animation 2D and 3D are awesome. It just for the most part is 2D and not 3D. Who those one who made the marketing, should be fired. But is still a nice film. I don´t think is great as the frist one, but is just good for my opinon.",
      "total_reactions": 0,
      "user": "CriticFer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2015
      },
      "score": 10,
      "text": "It's funny the super powers are funny and cool. it's much more hilarious then the first movie, and it just awesome, and the land scenes are great, and so  is every thing else.",
      "total_reactions": 0,
      "user": "Jollyjoe1000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "SpongeBob's back in his 2nd movie in theaters! He's only going out of water for just a few minutes of movie time (similar to how Godzilla (2014) done it). Despite that, SpongeBob has made his adventures look like he's ready for his next greatest adventure coming soon in theaters.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2016
      },
      "score": 5,
      "text": "I liked this movie more than I thought i would that does not mean i liked it though. While it was not terrible there are moments I thought should have been left out. This movie is strange to me in that its great in some places but horrible in others. The movie starts off entertaining with a pirate evading raiders of the lost ark style booby traps and starts reading the story of sponge bob to his band of talking seagulls Then we see a food fight against plankton as he is trying to steel the krabby pattty. The movie is on a good streak all the way until sponge bob loses ammo out of a ketchup bottle and it spurts and sponge bob says excuses me like he farted. What? Then this movie is back on its good streak until spongebob breaks out into a very cheesy song about teamwork. Plankton's running joke about not knowing how to say teamwork felt unnecessary and got old quick. Then the movie is on a good streak until we see the part with bubbles the dolphin who has watched over the planets for 10000 years. He shoots spongbob because he let the planets collide. I thought it was an unnecessary scene. There are other instances where i thought this movie had some unssary scenes but those were just some. However some of the jokes worked and It definitly was better than I thought it was going to be but it could have been way better",
      "total_reactions": 0,
      "user": "nahtan1244"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2016
      },
      "score": 7,
      "text": "If you do not like the series, you will not have fun, but those who like it a fun blast. The film in general is nice, very crazy, funny and silly. Antonio Banderas is irreverent and secure in his role as a pirate who wants at any cost to the Krabby Patty formula.",
      "total_reactions": 0,
      "user": "lucbevibrasil"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2016
      },
      "score": 6,
      "text": "It was okay. Nothing spectacular, I usually don't like when they make a tv show a movie but it was still cute for kids. I was a bit distracted when I was watching it because it wasn't keeping my attention but I am a Spongebob fan.. meh",
      "total_reactions": 0,
      "user": "Stargirl04"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "I wish I could have reviewed this earlier, but I didn't had an Metacritic account then. The movie is alright; the jokes are not the best but are still quite clever, and the visuals are appealing to both fans of the show and to newcomers. The only con is that the character's visuals during the live action sequences, while they are supposed to look as similar as to the original show, feel an little off to me. Overall, I would personally recommend this movie to children who are familiar of the show.",
      "total_reactions": 0,
      "user": "IAmTech"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2016
      },
      "score": 0,
      "text": "This was even worse that the first movie. Everything that was wrong with the first movie is still present here. This is one of the worst movies I have ever seen.",
      "total_reactions": 0,
      "user": "superbat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2016
      },
      "score": 9,
      "text": "Spongebob has been a long-running series for more than 10 years now, and it doesn't seem to have any sign of stopping just yet. If you thought this would be a continuation for the 1st movie, think again. In fact, anybody who has never watch the series could get in touch with the characters and story. Spongebob has not lost it's charm in this film. It's still comedic and entertaining but not enough for your grand parents to be laughing out loud.",
      "total_reactions": 0,
      "user": "wariothelegend"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2017
      },
      "score": 9,
      "text": "The Spongebob Movie: Sponge Out of Water is a funny and enjoyable continuation of our favourite undersea sponge. I was a bit disappointed by how little out of water screen time there was, but otherwise it has a lot of charm and wit.",
      "total_reactions": 0,
      "user": "MasterRiley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2016
      },
      "score": 6,
      "text": "The Spongebob Movie: Sponge Out of Water is an entertaining watch that feels like one really, really long episode of the cartoon. Many of its jokes feel familiar, in a good way, and there's a good balance of jokes for adults and jokes for kids. Antonio Banderas was great fun to watch in particular. The gag of having them out of water and as super heroes lasted a little too long for my liking, but everything came to a satisfying cartoony conclusion.",
      "total_reactions": 0,
      "user": "SimpsonFans"
    }
  ]
}