{
  "mc_avg_user_score": 8.0,
  "mc_metascore": 64,
  "mc_mixed_rating_frequency": 8,
  "mc_movie_name": "The Young Victoria",
  "mc_negative_rating_frequency": 1,
  "mc_positive_rating_frequency": 53,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Yet another movie that has amazing talent! 10 out of 10! Acting, score, and story were all linked to greatness. If you're looking for a movie with decency and morality, then this is a movie for you to watch!",
      "total_reactions": 1,
      "user": "epictvsaga"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "I enjoyed this movie but it wasn't exactly \"historically accurate\". Not ONCE did I hear Queen Victoria's true title, which was \"monarch of the United Kingdom of GREAT BRITAIN and Ireland. She was always referred to as the Queen of England. In fact all references were to England, which would have been forgivable had the writer had been a foreigner but I was shocked to see that it was Sir Julian Fellowes - who really ought to know better!",
      "total_reactions": 1,
      "user": "mischkasmum"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2010
      },
      "score": 5,
      "text": "Emily Blunt is very much excellent in this film, and definitely deserving of her Golden Globe nomination. Also, technically (especially when it comes to costume design and art direction/set decoration) the film excels. However, the story is rather slow and somewhat boring to be quite frank.",
      "total_reactions": 0,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "More than anything else, this is a simple love story between the young Queen, and her Prince. It's - seemingly - historically accurate and, actually made me want to know more about Victoria and Albert's twenty-year reign.",
      "total_reactions": 0,
      "user": "rnnbrwn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Young Victoria is an unbelievably sumptuous period drama with great turns from it's strong cast. Better still, the movie is genuinely moving and romantic without feeling forced. An excellent film.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "This is perhaps one of the most historically correct films of this genre I think I've seen.  It excels in every way from cinematography to costumes.  The performances are rich and honest.  The characters are clearly written with historical accuracy.  Emily Blunt was excellent as a young Victoria and Rupert Friend is perfect as Albert.  It was a pleasure to see Paul Bethany, Miranda Richardson and Jim Broadbent used so well as were many others.  What truly stands out here is not just the overall quality of the film but the historical accuracy.  This deserved a lot more attention than it received and in some respects was actually better than The King's Speech.",
      "total_reactions": 0,
      "user": "NJWolfgang"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2016
      },
      "score": 7,
      "text": "The Young Victoria is a lushly crafted biopic with a killer performance from Emily Blunt as the titular royal, but it does have a few problems that holds it back from being truly great. Though Blunt and the other actors are at their very best, the film feels overstuffed. As it tries to showcase many characters and multiple years of Victoria's reign, it has the problem of feeling both incomplete and overstuffed. If it wants to introduce this many characters, it needs more runtime. If it cuts some characters, it still needs to be longer to bring every other subplot to an end.  That said, the technical elements here are very good with terrific costume design, production design, and makeup/hairstyling. All are pitch perfect and perfectly capture the 1800s England feel with the correct importance and weight to the sets. The film is also well paced, even if the story does not deliver fully. Overall, The Young Victoria is an ambitious biopic that has terrific acting and a great look, but would have been better off trimming some fat and expanding on a few things to paint a more concise and direct picture.",
      "total_reactions": 0,
      "user": "Spangle"
    }
  ]
}