{
  "mc_avg_user_score": 6.2,
  "mc_metascore": 47,
  "mc_mixed_rating_frequency": 65,
  "mc_movie_name": "The Giver",
  "mc_negative_rating_frequency": 35,
  "mc_positive_rating_frequency": 98,
  "mc_pro_critic_reviews": [
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2014
      },
      "score": 75,
      "summary": "The strength of the cast speaks volumes about the \"prestige\" aspect of the production. In addition to Bridges, Meryl Streep, Katie Holmes, and Alexander Skarsgard contribute."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 75,
      "summary": "Just in the last few months, we've seen \"Snowpiercer\" and \"Divergent,\" which also deal with what happens after a civil collapse. The Giver, the latest in this weird trend, approaches a now-familiar topic from a new angle, and, of the three, it's the most visually arresting."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2014
      },
      "score": 75,
      "summary": "In its own way, the movie version — handsomely directed by Phillip Noyce and featuring an appealing, sure-footed cast of emerging and veteran actors — aptly reflects The Giver’s pride of place as the one that started it all, or at least the latest wave."
    },
    {
      "critic": "Nikola Grozdanovic",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 67,
      "summary": "So the story is relentlessly rudimentary and it’s directed in an expected, uncomplicated, formulaic manner."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 67,
      "summary": "The film begins to get a bit lost as the story develops and pushes toward a wobbly climax and conclusion. And what to make of that sled, which is the first bit of knowledge Jonas receives. Rosebud, anyone?"
    },
    {
      "critic": "Diana Drumm",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2014
      },
      "score": 67,
      "summary": "In spite of grand, world-building special effects and a stellar cast, the film falters under giant leaps of faith that land it just outside of the typical audience's threshold of suspension of disbelief."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 63,
      "summary": "While The Giver scores points for being smarter and deeper than “The Hunger Games” or its inferior photo-copy (“Divergent”), coming after all those other versions of this plot does neither it, nor us, any favors. The Giver has nothing new to offer."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 63,
      "summary": "The Giver is at its best when Bridges expounds on civilization’s lost beauty and savagery; at other times, it’s strewn with implausibility: For a totalitarian society in which everyone is monitored constantly, our hero is able to sneak around an awful lot."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2014
      },
      "score": 60,
      "summary": "By the end of the movie few won’t be rolling their eyes or checking their watch, but there’s enough that’s fundamentally good in the meat of film not to wholly reject what The Giver is giving us."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2014
      },
      "score": 60,
      "summary": "A lazy ending mars this fine, if generic, take on a much-loved YA novel."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2014
      },
      "score": 58,
      "summary": "The trouble with pet projects is that too often they are unduly do-goody, and so it is here."
    },
    {
      "critic": "Jeff Baker",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2014
      },
      "score": 58,
      "summary": "The Giver has taken a slow route to the screen, passed by newer, sleecker dystopian novels for young adults. \"The Hunger Games\" and \"Divergent\" owe much to Lowry's worldview and style while lacking her depth. What they have is strong female leads and plenty of action, elements absent in the spare parable of The Giver."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 58,
      "summary": "The Giver has an unsavory reek of box-office calculation about it, from the overworked “teens-must-save-a-world-ruined-by-adults” plot to the casting of pop star Taylor Swift in a small and irrelevant role."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 58,
      "summary": "The ironic side effect is that this major influence on today’s new class of dystopian YA smashes now looks like just another greedy knockoff on-screen—a monochromatic \"Divergent,\" or something similar."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "You wind up with a movie that plays like a low-rent \"Logan’s Run\" crossed with a UNICEF commercial."
    },
    {
      "critic": "Sheila O'Malley",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "Despite a truly pained performance from Jeff Bridges and a beautifully imagined, three-dimensional futuristic world, The Giver, in wanting to connect itself to more recent YA franchises, sacrifices subtlety, inference and power."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "21 years later, in the wake of \"The Hunger Games\", \"Divergent\" and \"The Lego Movie,\" another movie about a kid rebelling against socially imposed “sameness” is a case of the same old, same old."
    },
    {
      "critic": "John Anderson",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "What's so unfunny about peace, love and understanding? Plenty, it turns out. But for much of the movie, viewers will be asking themselves where the conflict is. And, by extension, the drama."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "The Giver doesn’t seem entirely consistent about its own rules and races far too quickly to a thoroughly unsatisfactory conclusion that raises three questions for each answer it provides."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "While the adult performances are strong, especially Jeff Bridges in the title role, youthful characterizations are not nearly as illuminating as they were on the page."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "The movie runs an hour and a half. Lowry’s book can be read in less than a day. It still gives anyone — child or adult — more than enough to wrestle with."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "The initial setup for the story is engaging enough, but Noyce and cinematographer Ross Emery have shot the whole thing in generic digital fake black-and-white, so it looks like a late-‘90s TV commercial for a soon-to-be-recalled compact car."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "It's not a lousy experience. Taylor Swift shows up in a glorified cameo. Thwaites has promise; Rush has more than that. But for a movie decrying the concept of societal \"sameness,\" The Giver is a hypocritical movie indeed."
    },
    {
      "critic": "Inkoo Kang",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "The Giver is an anti-totalitarian allegory so farcically hyperbolic it feels like only a teenager could have come up with it."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "The Giver reaches the screen in a version that captures the essence of Lowry’s affecting allegory but little of its mythic pull."
    },
    {
      "critic": "Jeff Labrecque",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 42,
      "summary": "It falls apart with a slapdash final act that doesn't work as drama or action and only serves to undermine Jonah's heroics."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 40,
      "summary": "This isn't a terrible movie. It just falls flat, in almost every way. It exists and not much else. It's all too predictable, and way too heavy-handed."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 40,
      "summary": "The Giver was ahead of its time as a book. But as a movie, it’s too late."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2014
      },
      "score": 38,
      "summary": "Lowry took chances with her novel. The movie of The Giver takes none. It's safe, sorry and a crashing bore."
    },
    {
      "critic": "David Lee Dallas",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 38,
      "summary": "The internal crisis of its protagonist amounts to the flicking of an on/off switch rather than the ebb and flow of a consciousness being born."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 30,
      "summary": "In the end, it taketh — your time, patience and faith in newly imagined dystopias — more than it giveth."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 25,
      "summary": "There are some actual big ideas bubbling around somewhere below the surface of the film, but it's so ham-handed, so unable to grapple with the full implications of any of those ideas, that it actually becomes offensive."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 20,
      "summary": "Mostly the problem is that every aspect of The Giver feels both painfully familiar and like an awkward, unsupportable stretch. For a film about the deep, hidden dangers of enforced sameness, that’s almost hilariously ironic."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "It's a sweet little story.",
      "total_reactions": 2,
      "user": "tvnewsguido"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "A good film but a lot like the also recent science fiction movie Divergent. Hollywood ripping of Hollywood? Who would think it-that would be-just crazy. Well, for what its worth this one might be the better film but since it so derivative it can't really be called original. \"So what\" I take it is the order of the day regarding hijacking someone else's movie idea in todays filmmaking world. Not that it matters much. It would just be nice if people were a bit less relying on others work in order to make a product that puts bums on seats. A trick to get people i the theatre (the promise of something neat and original)  fails in the long run. On the good side of it the work is crisp and even a bit visionary-like the early science fiction novels of the 1950's. I didn't notice if it was based on any old science fiction but it remind me of a whole bunch of things. Anyway-its a safe movie in that the violence isn't visceral (gory) and there ain't no bad words in it. Go see it. What the hey.",
      "total_reactions": 1,
      "user": "emeraldcity"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "The adaptation of yet another YA bestseller is set in a gray world of bland conformity and strict regulations. A young man (Brenton Thwaites) is assigned to receive history's memories, which changes his outlook on life. The whole things starts promisingly, as the time and place is created with cool visual elements. Only during the final act does it slow to a maudlin message movie. Meryl Streep and Jeff Bridges add some heft (Taylor Swift is unrecognizable in her role), but the film still lacks any tension or emotional payoff.",
      "total_reactions": 4,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "Hopefully the book “The Giver” by Lois Lowry, which the movie is based on, gives a lot more answers to what happened and what will happen then the screenplay by Michael Mitnick and Robert B. Weide lets you in on. The movie pulled me in and then left me hanging but not enough to want to read the book to see if the answers are there.",
      "total_reactions": 7,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "The Giver could have been one of the best movies of the year with it's deep, emotional and unique human story, but a underdeveloped film that incorporated a rushed ending, made that story feel worthless.",
      "total_reactions": 3,
      "user": "csw12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 4,
      "text": "Its just not good. Most people where forced to read the book in middle school, and well, most people try to forget those years. Not exactly sure who they where trying to sell this movie to. I mean, no kids will want to watch it because...well...",
      "total_reactions": 3,
      "user": "Garfoodle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "This move was visually stunning, and it did a great job with retaining the plot events, dialogues, and symbols of the novel, which is much more than most film adaptations can say. Most of the reviews I have read are from those who have not read the book, who are complaining about the unanswered ending. Lois Lowry purposely made the ending ambiguous, you cannot blame the movie for that (and there shouldn't even be any blame; ambiguous endings give the readers/viewers power to interpret and analyze for themselves). There were a few minor details removed from the movie, but I believe that they were left out to be able to be appropriate for younger audiences while maintaining the more mature audience who may have read the book. An example of this is the neglect of the \"Stirrings\" that Jonas experiences, which is replaced with a brief dream of Jonas kissing Fiona. An important detail left out was the House of the Old.",
      "total_reactions": 3,
      "user": "PrestonIS"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "This movie is very thought provoking. I never read the book but I will now. Considering all the awful things that are going on in the world at the moment, terrorists, riots, we know they are caused by feelings and passions. This movie shows how feelings and passions make our world awful, but it also shows how feelings and passions are positive and that we shouldn't repress them. If only the world can figure out the right balance to make feelings and passion work in a positive manner.",
      "total_reactions": 8,
      "user": "ledaumas"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "Great movie with a profound message and tremendous acting. As a viewer, you cannot help but feel how dangerously close our society today is portrayed in this film. I've not read the books, but after watching this I will be soon..",
      "total_reactions": 5,
      "user": "Spica"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "The Giver is visually arresting, well made and acted. Yes, I've read the book by Lois Lowry. Is it same as the book? No. Director Philip Noyce directs this film about Jonas, who gets recruited for a special job, receiver of memories, where his mentor The Giver tells him secrets of the past that have been hidden all these years. Love, Color, Happiness, Hunger, Birth. Those are the things that The Community doesn't have. It's a diffrent world from ours, and yes, it's pretty sci-fi. Newcomer Brendon Thwaits does a good job of acting as Jonas, he was smart and energetic. Jeff Bridges is good as the Giver and Meyrl Streep is okay as the community elder, the woman who thinks if people choose, they will choose wrong. The story is not totally the same. Some honest changes were made. The film is slow and drags a bit at the climax. But if you don't mind a good movie that treats its subject matter well. Watch, The Giver.",
      "total_reactions": 7,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "I was and still am a big fan of the 1993 Lois Lowry, it was a spectacular book that had a so-so cliffhanger ending that didn't answer any questions that the reader was left with. I will start my review at the ending because it goes beyond what the book did and gives the audience hope for the future of these characters and I liked that. People are complaining that questions are still left unanswered, I hate when people complain about these things because I feel that there some things that should be left to interpretation and that the filmmakers shouldn't have to spoon feed everything to the audience. The acting is amazing especially Jeff Bridges, you could tell that he had a lot of passion behind this project. This movie also has easily some of the most amazing visuals that are a true treat for the eyes. I loved how this movie handles its dense themes and made them worth while and interesting. Quite possibly the best thing about this movie is the way it handled the source materiel, it took some liberties and removed or altered the things that didn't work and preserved the things that were excellent about the book. This is a rare score that I give this many 10's but this is the 4th 10 of the year (alongside X-Men: Days of Future Past, Under the Skin and Chef). I highly recommend checking this movie out if you can.",
      "total_reactions": 9,
      "user": "moviemikey98"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "WOW, what a terrible adaptation. If you like slow moving storylines, unanswered questions and just plain boredom, this movie is for you!",
      "total_reactions": 6,
      "user": "dem74"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "Let me start out, Yes, I have read book, and yes I Loved the book. I think it one of the best book I've ever read. I've was excited when the movie was Announced. Then the trailer... I got nervous. Very nervous. But I was still excited. So months pasted by and I forgot about the movie until July. Then the movie came out at No.5 at the Box Office. Boys, We have a Bomb at our hands. So today, My sister decided to buy my ticket for this movie for my Birthday. After the first 10 min of this movie. I knew it was bad.",
      "total_reactions": 4,
      "user": "GavrocheMC"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "My advice? Do not listen to anyone that doesn't like this movie. They probably think The Hunger games is the most brilliant movie series of all time. This film is absolutely brilliant, and takes you on a thrill ride. It's visually beautiful, and really let's you feel the emotions Brenton Thwaites character experiences the more he learns about the past world.",
      "total_reactions": 2,
      "user": "Patrick94"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2014
      },
      "score": 3,
      "text": "The Giver took nearly 20 years to make! I was expecting a deep, emotional and unique human story. However, the movie is underdeveloped, rushed and dull. The performances don't make up to the one most major disappointment of the year.",
      "total_reactions": 2,
      "user": "HaithamB"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "I felt the movie was another one of those adaptations that did well, with a few honest cinematic elements and changes. In addition, it can provide enough entertainment to spark interest in the book. Great acting by star actors and actresses, with even a brief cameo by Taylor Swift (exceptional brief performance). However, the film's book, The Giver by Lowry would have made it difficult to come up with an intense climax as the studio's trailers made it seem. Having read the book, it was surprising how intense they were making it look. This gives the viewer a slight underwhelming feeling by the end of the movie.",
      "total_reactions": 2,
      "user": "scremptspension"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "The Giver is by far one of the best films of the year.  It's visually stunning and a very interesting blend of science fiction and social drama.  Because it is so unique, it will not be to everyone liking, hence the less than glowing reviews.  It certainly skews toward a more thinking person's palate... not your typical over-the-top special effects extravaganza.  In time, this film will most definitely end up being regarded as one of the best.",
      "total_reactions": 15,
      "user": "Dondoveeb"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2014
      },
      "score": 1,
      "text": "The creator of the classic book for which this movie was based had one request. \"Please don't turn this into a teen romance.\"",
      "total_reactions": 5,
      "user": "phildog"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2014
      },
      "score": 1,
      "text": "You think, how bad can it be with Jeff Bridges and Streep? It is dumbfoundingly trite, stupid and boring, actually. I haven't read the book, but my son the college English major said that it, too, sucked.  Sounds about right, since it would have been hard to make a movie this bad from a book that had any merit. I am encouraged, however, to see that so many others who have posted here apparently disliked the film. I'd have thought the under-30 crowd that writes most of the user reviews at Metacritic would have thought 'The Giver' profound.  I won't bore you by arguing my case, since addressing the myriad flaws and weaknesses in this film would be like critiquing the paintings of Walter Keane, or Muzak. Trust me, it stinks.",
      "total_reactions": 13,
      "user": "MargateExpert"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "Beautiful and emotional movie, capturing the importance of friendship, trust, freedom, and love. It stresses the importance of having memories, having emotions, having decisions of your own.",
      "total_reactions": 3,
      "user": "mslindachen"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "The Giver has a touching story, amazing actors and awesome scenes, the movie is good altogether, but sometimes it starts to get boring, and there are some parts in the plot that stay empty... but despite this is a great movie.",
      "total_reactions": 4,
      "user": "victorhjkl"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "So many bad movies so far in 2014 and this tops the worst of the worst. People who gave this movie more than a zero must have been watching a video on youtube and drunk while on crack. Sorry if I offended anyone but it is what it is. Did not care about any of the actors. I did not say I do not like any of the actors. I do like the main actors but they all sucked except  Jeff Bridges. What the hell were they thinking when they said yes to act in this movie. I know, take a guess. Main actors were hard up for money. MY RATING: -20. Yes minus 20. Trust me, do not support this movie by going to the theater. They do not need credit for taking a roll in this mess of a movie. Watch it on TV for free. It will be there very soon. This will take a toll on the main actors for taking part in this stupid flick.",
      "total_reactions": 12,
      "user": "bigfoot6463"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "The Giver is a film that for a good two-thirds showed a lot of promise being a faithful adaptation to the book by presenting scenes faithfully, good casting and good performances, and giving some nice visuals. Unfortunately, the film stumbles towards the third act. At first the film only occasionally touched on how bad the dystopia was but towards the end it hammers you over the head with it. It turns into a straight up good vs. evil story and is generic and cliché as possible. Once again Hollywood has taken a story that is unique and wonderful and skinned it into something bland and generic. As much as I love seeing awesome books made into movies I want to see it done well and not try to cater to the masses. This film based on a book about dystopian society feels very much like it was trying to capitalize on people’s love the Hunger Games, which also deals with rising up. I only hope that people are reading the books these films are based on as opposed to the mainstreamed versions we get now. Had the film just stuck closer to the story like it was doing pretty well in the first half or so this would have been a really nice film but because it turned into generic good vs. evil and fighting against dystopian society the film lost that special something that made the book so memorable and unique. Which is why I am forced to “Give” this movie a 5.5. Could’ve been a 7/10 but you just had to cater to the masses. I’m not too excited about Mockingjay: Part I but its starting to look really promising right about now.",
      "total_reactions": 1,
      "user": "Jacob"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "Decent film based on a young adult book you most likely read in middle school.",
      "total_reactions": 1,
      "user": "Bshop"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "Whether or not your a person that always says, \"the book was better\", book to movie adaptations will just keep coming and coming, and most of them will probably not be truly amazing. I found The Giver to be better than the average book to movie adaptation, if not a little familiar. However, this film has some special things going for it that I just don't see very often in movies these days. While I won't spoil it here, the story of this film cleverly utilizes a black and white design on the screen (does not go on the whole film, though). What could have been highly annoying and ugly actually turned out to be very unique and refreshing. The characters in this movie are pretty darn good. Your 2 main stars here are Brenton Thwaites and Jeff Bridges. They are both awesome. Plus, Meryl Streep knocks it out of the park. Odeya Rush was suprisingly very good. Everybody else was basic. The story here is definitely nothing groundbreaking, but it still offers enjoyment. Jonas is chosen to be the one who works with the Giver, and the Giver goes on to share memories of the past world that is now behind them. Watching Jonas' journey as a character finding out all of the beautiful stuff the past world had was thoroughly entertaining. This movie also has some really great lessons behind it that left me still sitting in my seat for a few minutes after the movie was over. However, a lot of the stuff in this movie can just be average, such as the writing. Plus, I felt the story could've used a tad bit more energy in some parts. I didn't walk out the theatre amazed, but I really did appreciate the lessons behind it and Jeff Bridges, Brenton Thwaites, Odeya Rush, and Meryl Streep.",
      "total_reactions": 1,
      "user": "SimpleReviewz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "Even though the young adult dystopian adventure genre has been somewhat overworked in recent years, \"The Giver\" does a respectable job of delivering the goods. Despite its occasional tendencies to drag some things out and underexplain others, it nevertheless serves up a thought-provoking story with capable performances and inventive cinematography.",
      "total_reactions": 1,
      "user": "Brent_Marchant"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2015
      },
      "score": 4,
      "text": "If you've seen any movie based off of a YA book you've basically seen this one. It's the same premise as Divergent, the same futuristic society where individuality is non-existant, and the same characters these types of films are known for. The only difference is that it's missing any sort of emotion and according to many a lot of what made the book special.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "One look at the trailer and I knew this movie was going to be bad. It was poorly adapted for the screen not just in the screenplay but in tone. Sub-par acting did not help. It was mostly just boring.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Illuminati movie!!!",
      "total_reactions": 0,
      "user": "xjun1or3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2014
      },
      "score": 3,
      "text": "The problem with 'The Giver' is that despite a concept of enticing possibilities, it just never gets going to make one sufficiently interested. I would go as far as to say that the conclusion is far better than the build up which is flat and ponderous offering little to make one care about proceedings.",
      "total_reactions": 0,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "Turning a classic and profound novel like The Giver into a potentially commercially successful and teen-friendly film that still values artistic integrity and self-awareness is already a major challenge. It's made harder when the screenplay is limiting in its breadth of thought and poorly spaced out, resulting in a crunched and insignificant final third. It's made even harder when the directing is clumsy and the ultimate image of the film never seems definitive. Despite several glimpses of beauty and talent (and less heavy-handedness than most teen-friendly novel adaptations), The Giver never manages to fly far after its takeoff, eventually descending back down to the plane of not-so-memorable young adult movies.",
      "total_reactions": 0,
      "user": "RedOwlReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "I loved reading the book in high school, college and after college. However, this is not the film that this novel was meant for. I can't believe I will write this, but I wish Aaron Sorkin wrote the screenplay. This is a very philosophical, and propagandist material and Sorkin's preaching from the pulpit of high-minded idealism approach to all of his work would work wonders.",
      "total_reactions": 0,
      "user": "aslanmane"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "\"The Giver\" seems like \"Divergent\" meets \"The Village\". This has heavy material, philosophic, and unique picture. This is more simple and less boring than Divergent, despite both of it has thought-provoking ideas. I think I'm more enjoyed this film than Divergent.",
      "total_reactions": 0,
      "user": "ugisupriatna"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2014
      },
      "score": 5,
      "text": "The Giver reminds me of two other 2014 films, Transcendence and Divergent (both of which I also have reviewed on Metacritic). Why? The Giver is similar to Transcendence because both films took a while to make (of course The Giver was in the process of being made much longer by Jeff Bridges). Both also have good and respected actors---Transcendence has Rebecca Hall, Paul Bettany, Kate Mara, Cillian Murphy, and Morgan Freeman while The Giver has Jeff Bridges, Meryl Streep, Katie Holmes, and Alexander Skarsgard. The Giver is also similar to Divergent because (I don’t like to say this, but) both YA novels and their movie adaptations have implausible utopian futures and societies.",
      "total_reactions": 0,
      "user": "AGarcia732"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "I never read the book but this is based from a book. This movie has interesting concepts and really makes you think about things that make up today's world. It is a deep, touching, emotional and unique human story. Overall, its worth a watch.",
      "total_reactions": 0,
      "user": "jacked_beast"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2015
      },
      "score": 2,
      "text": "Jeff Bridges has tried to make the novel \"The Giver\" into a film, so this is sort of a passion project for him, but the screenplay and the movie is a whole atrocity. I have read the book it was an  astonishing tale of a calm society. This film misses some of the great details that the book had, they took the main character Jonas (Brenton Thwaites) and turned him into a complete idiot in the book he did not tell anyone about his training or told what he learned such as dancing, the word 'love' or show his skills as a receiver of memory. But no! screenwriters  Michael Mitni, Robert B. Weide turned the best sci-fi of the decade into an atrocity adaptation into a best seller into film. Grade D",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "The Giver es una película adaptada de un libro que resulta atractiva, intrépida y muy interesante a medida que avanza.",
      "total_reactions": 0,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "I think that 'The Giver' it's an interesting film, with interesting ideas, but no everything on 'The Giver' it's perfect. The plot behind the movie sounds really cool, but in the develop, some moments arent' brilliant, and we can add to that other moments are boring and unnecessary. The cast it's really great, Meryl Streep, Jeff Bridges, Katie Holmes, and, Brenton Thwaites, and Alexander Skarsgård, and their performances are good, but not enough, because they do what they can with their characters, which aren't developed in an excepcional way. The script it's okay, but with the plot, some situationes could be exploited better. The movie has some interesting points, the visualy aspect that initially handled it's cool, and gives an interesting perspective to the film, and the soundtrack is another positive point, \"Ordinary Human\" by OneRepublic it's amazing!",
      "total_reactions": 0,
      "user": "NateNixon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2014
      },
      "score": 9,
      "text": "I was really surprised by this movie - I know a lot of people were expecting the Hunger Games, only to get The Giver instead. If you loved the book, you'll love the movie. Surprisingly enough in the days of CGI-overload this movie is backed with a lot of thoughtful dialogue, good acting a teeny tiny bit of action. It's a different kind of dystopia, and I'm not minding it at all. Very good! Made me cry a couple times, not a lot of things do that.",
      "total_reactions": 0,
      "user": "Metatarsals"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "I wanted to like this. There was a considerable relief watching this over watching Maze Runner. But we won't get into that. The star studded cast still couldn't make this one shine in the way it needed to. I liked what it hinted at as far as the moral boundaries and where they are crossed and not crossed. It dips into the age old questions on what is right and what is wrong. The angle is kind of different because they try to control everyone enough so that everyone does the RIGHT thing. Which seems good in thought and theory but shows up in a society just like the one you see in the movie, void of real love, affection, and feeling. Which falls the argument, if you can't feel, it means you are free from heartache, pain, betrayal, and all the bad things, so which one is really better? All that ensues and is part of the idea this movie presents, but the way it was presented was without much of anything all the entertaining...which is kind of important because that's the point this world isn't entertaining...so why go make a movie about it? The Giver himself was pretty much the only voice of reality and reason which got annoying, I mean no one else even bothered to think of other things? How does the giver have those powers anyway? Wasn't explained very well, and if they didn't want their thoughts to be opened why did they even bother having the whole giver thing made in the first place? Notable teen performances and actually a good movie for the year, not that that says much...leave this to the paper and ink boys.",
      "total_reactions": 0,
      "user": "BigZ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "he Giver is the latest novel plucked from the young-adult section of the bookshop and rushed through a studio system to result in a healthy return on investment. Recently The Hunger Games series and the standalone The Fault In Our Stars have done a tremendous job in transforming the loved novels into fitting entertainment and mountains of cash while Divergent and If I Stay have fallen flat, perceived as gimmicky and formulaic in a crowded genre.",
      "total_reactions": 0,
      "user": "Novastream"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "Anybody with an intellectual mind and opinion will love this movie.",
      "total_reactions": 0,
      "user": "Amiddleton13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "Blew me away. Was an excellent movie to watch with my wife and daughter. One of those bonding movies that reminds you to take the bad with the good, and to use both to learn and love more. I am grateful to the directors for compressing these complex ideas into such a concise and well crafted narrative.",
      "total_reactions": 0,
      "user": "Costs1129"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2014
      },
      "score": 3,
      "text": "The Giver is one of the Best books I have read of all time. However the movie failed to compare. Between the fake emotional stakes, the romance that seemed like it was 90% of the plot, and the fact that the best parts of the book weren't even in the movie. And I'm 14, the age that they wanted this movie to be for, and may I say. It was just crap. The only reason I didn't give it a zero was Jeff Bridges's acting.",
      "total_reactions": 0,
      "user": "launchpad2132"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "This film is for those who enjoy films that make you think. It's a slow paced drama film that has a unique visual style.",
      "total_reactions": 0,
      "user": "Jumpy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "I think The Giver does a satisfactory job of covering the topics discussed in the novel it is based on, but It feels slightly rushed and a little awkward. I respect the job the movie has done, but it makes the story feel way too bizarre to capture the feelings of the book. I love the soundtrack, however, and it may be the best part of the film. How do you expect the filmmakers to have Jonas not able to see color WITHOUT making the first half of the movie monochromatic and confusing everyone? It's impossible to make a perfect Giver movie, but the filmmakers gave it their best shot, and I respect them.",
      "total_reactions": 0,
      "user": "alecvl08"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2014
      },
      "score": 1,
      "text": "So unoriginal, so boring. I almost slept while watching. A similar movie; Divergent was terrible, this is way worse, so what's the word for this crap !!!",
      "total_reactions": 0,
      "user": "MuratBaykurt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "The Giver is a seemingly typical utopian/dystopian sci-fi book adaptation at first glance, but don't let that fool you. The premise brings a unique take on the dystopian genre with phenomenal visuals that accent the story-telling. However, the book's deep, thought-provoking themes and ideas are lost through the Young Adult Film mould implemented on the story. The story adds an unnecessary romantic subplot and lacks suspense or any real drama, just moving from beginning to end. Strong performances from Jeff Bridges and Meryl Streep overshadow underwhelming performances by the younger actors. Although this film swayed from the source material to fit a niche of popular films, the world created in this series is worth exploring in other films. With its different take on the dystopian future The Giver may bring colour to a somewhat black and white genre.",
      "total_reactions": 0,
      "user": "TheFilmFanatic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2014
      },
      "score": 0,
      "text": "Do Yourself A Big Favor! Listen to the Audiobook Read By Ron Rifkin, Instead!",
      "total_reactions": 0,
      "user": "DannyG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "A beautiful cast and beautiful production design and cinematography highlight this unfortunately bland film that seems to be far too complicated for its own good. Once again, another YA tale that misses the mark despite the presence of the great Meryl Streep and Jeff Bridges.",
      "total_reactions": 0,
      "user": "WJS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "The film adaption (for the most part) is true to the original book. Yes you can easily point out the changes and up until the third act I was perfectly fine with it. This is a good movie but it could have been much more.",
      "total_reactions": 0,
      "user": "Movi3R3vi3wer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "I remember when I saw this movie. It was amazing. I had never really read the book before, but as soon as I got home from the movie, I looked for the book and started reading it. Both the book and movie are amazing. Wow. The actors did a great job, especially whoever played the Chief Elder. :D",
      "total_reactions": 0,
      "user": "Cloudstar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "An amazing movie but not something I would recommend to anyone that hadn't previously read the novel.  The movie does a good job of depicting the novel but does leave some big blanks as far as not explaining why or what the community and the people in it are the way they are.  The movie and story are by no means exciting, so the action fans need not watch.  Go into this movie being ready to think.  In all though, I do believe fans will be happy with the adaptation.",
      "total_reactions": 0,
      "user": "Stevesitz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "About 5 years ago someone in a video game industry asked",
      "total_reactions": 0,
      "user": "wtfskilz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "I think the huge disparity in reception this film has earned from critics and audience may come down to a confusion just about the audience which, it seems to be, the film must be for.",
      "total_reactions": 0,
      "user": "lcb10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "An excellent movie with a lot of original ideas and some good performances, notably from Meryl Steep and Erik from True Blood! However the wholly forgettable contribution from Taylor Swift suggested she shouldn't give up the day job.",
      "total_reactions": 0,
      "user": "royphishooh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2015
      },
      "score": 3,
      "text": "the three is for the book......the movies random images for the most part get a huge annoying zero......it hurt to watch the slide scene somehow......the jump scene barely made sense......why was asher never punished.? was he..all im saying is the girls were overly attractive or whatever that is....sexual...things going on....the palm trees were not what i was picturing at all......lol  the cabin was lousy....he never looked in even...he never tranferred cold....to avoid detection....lousy",
      "total_reactions": 0,
      "user": "CameraBounceGod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2016
      },
      "score": 4,
      "text": "i didn't read the book, but anyway I didn't enjoy in this movie,  the performance was normal nothing special, I like some concepts in the movie like the idea by going from black and white to colors was wonderful which colors indicate to emotions, but nothing impressive and the actions of movie don't give you suspense or enjoy, if you like these type of movies you can watch \"divergent\" or \"the hunger game\" more better than \"the giver\".",
      "total_reactions": 0,
      "user": "mohamad91hk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2016
      },
      "score": 7,
      "text": "With impressive visual effects and wonderful cinematography and a solid story, The Giver does enough to give the audience a solid film.Overall, The Giver is a good movie for those looking to watch a movie during slow times.",
      "total_reactions": 0,
      "user": "geo333"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "It may lack some of the impact the book has, but ultimately this adaptation is stunning, beautiful, emotional, and will resonate with just about anyone. This is much deeper and meaningful than any other YA film you will ever see.",
      "total_reactions": 0,
      "user": "cwilliamhud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2015
      },
      "score": 3,
      "text": "The Giver is yet another YA movie based on a best selling book. I'd tell what it is wrong with it in one word the ending. The plot was confusing the acting was bad.",
      "total_reactions": 0,
      "user": "Connorkirker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2015
      },
      "score": 9,
      "text": "Wrapped in an exciting movie with beautiful special effects, 'The Giver' makes the case for the beauty of grown-up freedom.",
      "total_reactions": 0,
      "user": "katharris417"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2015
      },
      "score": 5,
      "text": "The concepts seemed good.  The acting wasn't horrible but overall this movie was just too slow at the start and lacked a big finish.  It is a fairly mediocre offering in the saturated teen dystopia genre.",
      "total_reactions": 0,
      "user": "TukkerIntensity"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2016
      },
      "score": 8,
      "text": "So, I had been seeing this selection on Netflix for a few weeks now. Yesterday, after having enough football, I decided to catch this movie. It was actually not bad, which is why I gave it a favorable rating. This movie hints at a Brave New World, ala Aldous Huxley. Not as bleak as other dystopian movies and similar in story to Equilibrium, without all the graphic violence. It's quite watchable.",
      "total_reactions": 0,
      "user": "Vadertime"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "I usually don't love dystopia type movies or books but this was one we had to read in school when I was younger and I enjoyed the book then and I enjoyed the movie now. I thought it was pretty well done. Nothing in the story is necessarily new or unexpected but I enjoyed it.",
      "total_reactions": 0,
      "user": "Stargirl04"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2016
      },
      "score": 7,
      "text": "When I'm too tired for clever dialogue, complex plot twists or high art, I watch movies for teens. This is one of the better recent offereings, with a coherent plot, moderate adventure, the odd not-too-violent thrills and without too much dumbing-down of dialogue. I almost felt young again. I'm not surprised that Meryl Streep and Jeff Bridges agreed to do it. It's fluff and nonsense, but it's enjoyable and entertaining.",
      "total_reactions": 0,
      "user": "shiftworker"
    }
  ]
}