{
  "mc_avg_user_score": 6.1,
  "mc_metascore": 43,
  "mc_mixed_rating_frequency": 1,
  "mc_movie_name": "The Romantics",
  "mc_negative_rating_frequency": 4,
  "mc_positive_rating_frequency": 10,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "This movie surprised me by how much I liked it. I saw it almost completely because of the amazing cast, with very little prior knowledge. The story, I thought was really good. It was realistic, and maybe a little cheesy, but it worked. The acting was very good. The target audience for this was definitely adult, even though it is rated PG-13, and only adults would really connect to it. I was very shocked to see that my theater was packed and that at the door to the movie they were giving away movie theater size posters of the movies. Overall, I highly recommend this movie, especially for mature audiences.",
      "total_reactions": 0,
      "user": "guitarplayer11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "In a weird way I loved this film. It was authentic and very entertaining. It is not your common Romantic film. Passion I think it is the tone of the film, because it is what the movie is about, not only love but passion and what it can do to a group of friends.",
      "total_reactions": 0,
      "user": "Mary7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "the romantics fares better as an in-flight entertainment or an hour long season finale to dawson's creek rather than the indie flick it tries hard to portray itself as. Akerman & Brody scenes create the only spark throughout the movie even though their characters are also as predictable and shallow as the rest.",
      "total_reactions": 0,
      "user": "istanbul"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2011
      },
      "score": 0,
      "text": "I was hoping for a entertaining thoughtful romantic movie and what I got was a tragedy. The characters were a tragedy, the plot was a tragedy, and the whole experience was a tragedy.  Pass on this one unless you are a drama queen.",
      "total_reactions": 0,
      "user": "keith625"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2012
      },
      "score": 1,
      "text": "Hoped for a romantic comedy/drama that had something to it, but it was utterly vapid. The characters (and actors) were very one dimensional. I was beyond bored within the first 15 minutes watching self-absorbed people get themselves into, and out out of, predictable situations. I toughed it out only because I thought my significant other was enjoying it only to find out that we both thought the same thing at the end. Do not waste your time.",
      "total_reactions": 0,
      "user": "NinjaEdwards"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "The Romantics was very boring. I thought it wasn't dramatic enough and it could have done better. The plot has been over done. I did think the cast line-up was great though. I recognized stars like Katie Holmes, Josh Duhamel, Anna Paquin, Malin Akerman, Elijah Wood, Adam Brody, and Diana Agron. I am not a fan of Katie Holmes, but I would have to say she did an impressive job. I think it failed because it was to predictable. I don't think this is would appeal to many people and I wouldn't recommend it.",
      "total_reactions": 0,
      "user": "Kitkatkatie360"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "The acting is not bad but the movie in general,is pretty bad.The reactions of some characters and even what is happening is barely impossible and unrealistic.But,for some reason,the movie is still entertaining.",
      "total_reactions": 0,
      "user": "Meth-dude"
    }
  ]
}