{
  "mc_avg_user_score": 6.5,
  "mc_metascore": 37,
  "mc_mixed_rating_frequency": 132,
  "mc_movie_name": "The Lone Ranger",
  "mc_negative_rating_frequency": 122,
  "mc_positive_rating_frequency": 377,
  "mc_pro_critic_reviews": [
    {
      "critic": "Matt Zoller Seitz",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 88,
      "summary": "For all its miscalculations, this is a personal picture, violent and sweet, clever and goofy. It's as obsessive and overbearing as Steven Spielberg's \"1941\" — and, I'll bet, as likely to be re-evaluated twenty years from now, and described as \"misunderstood.\""
    },
    {
      "critic": "Angie Errigo",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2013
      },
      "score": 80,
      "summary": "Talk about a pleasant surprise! Real storytelling, well thought-out and beautifully, at times insanely, executed, with excitement, laughs and fun to make you feel seven years old again."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 75,
      "summary": "A wild, wacky, wide-screen reimagining of the vintage radio serial and TV series, the film - with Armie Hammer in the hat and mask, galloping across Texas righting wrongs, and Depp as his trusty Indian sidekick, Tonto - is an epic good time."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 70,
      "summary": "If anything, it’s overstuffed with imagination and ideas, and when it comes to Hollywood movies I very much prefer that to the default setting. See it with an open mind, and you may well be surprised."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 67,
      "summary": "Hammer’s performance — always game, never mugging — certainly helps; his likable but buffoonish Lone Ranger is an essential part of the movie’s irreverent tone."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 63,
      "summary": "Though the story is mostly faithful to the established origin of the character, it's not until the last 15 minutes, when \"The William Tell Overture\" arrives in its full glory, that this starts to feel a little like The Lone Ranger. But that's too little, too late. And when The Ranger (played here by Armie Hammer) finally shouts \"Hi-yo Silver,\" the moment is spoiled by turning it into a joke."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 60,
      "summary": "The Lone Ranger is a grand folly that, in a sane world at least, would never have been made, although I’m really rather glad someone did."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 60,
      "summary": "It tickles both funnybones and eyeballs."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 58,
      "summary": "The action climax just goes on and on, making The Lone Ranger the sort of movie that delivers too much too late and still manages to make it feel like too little."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 58,
      "summary": "Depp is the only reason this haphazard take on the Lone Ranger legend exists, at least in this swollen state, begging the question of why Disney didn't name the movie Tonto."
    },
    {
      "critic": "William Goss",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2013
      },
      "score": 55,
      "summary": "The fact that Johnny Depp alone gets top billing above the title, The Lone Ranger, despite not playing said character sums up the generally misguided approach taken by Depp and the creative crew behind the “Pirates of the Caribbean” franchise in bringing last century’s radio and TV hero back to the big screen in a big way."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "Eccentric and misguided enough to be almost perversely fascinating, the film doesn’t lack nerve; it’s just not very good."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "There’s a rollicking Wild West adventure buried deep inside The Lone Ranger, a bloated, mega-budget revival of the story of the iconic gunslinger and his Native American sidekick Tonto."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "Except for the dynamite finale, The Long Ranger feels like a long, slow ride to the dump, to the dump, to the dump, dump, dump."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "Gore Verbinski’s film is an overlong array of noisy, digitally-assisted chases, shootouts, crashes and explosions with the occasional flash of homage to the “real” Lone Ranger that suggests a better movie than the pricey, jumbled compromise Verbinski delivered."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "It's a 2 1/2-hour slog, with tonal inconsistencies and monotonous, drawn-out action sequences. Scenes alternate between frenetic and tedious."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "A moderately amusing but very uneven revisionist adventure with franchise and theme park intentions written all over it...This attempt by Verbinski and producer Jerry Bruckheimer to plant the flag for another Pirates of the Caribbean-scaled series tries to have it too many ways tonally, resulting in a work that wobbles and thrashes all over the place as it attempts to find the right groove."
    },
    {
      "critic": "Bob Mondello",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 45,
      "summary": "There's a couple of hundred million dollars' worth of technical wizardry up there on screen, and nothing is at stake. Except, maybe, for some future amusement park ride, and the sequels, and toys and hats and masks. And piles and piles of silver, if enough people lay down their hard-earned dollars to hear Hammer's hearty \"Hi-yo.\""
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 42,
      "summary": "Hammer plays the Lone Ranger as a clueless, stolid square, and the resulting contrast with Depp’s cartoonishness isn’t odd-couple funny, just blah."
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2013
      },
      "score": 42,
      "summary": "By the time the origin movie stuff is wrapped up and the audience finally gets to see The Lone Ranger and Tonto on their first of their legendary deeds, it's far too late in the movie, particularly if your patience has already been drained by the simple yet over-elaborately staged plot, that struggles to be compelling."
    },
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "The Lone Ranger is content to simply pull another western trope out of the bag – the honky-tonk whorehouse, the ranch raid, the cavalry charge – give it a CGI spit-and-polish, and chuck it in the general direction of the audience. The result is frustrating, lazy and lifeless."
    },
    {
      "critic": "Matt Mueller",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "Ultimately, it’s not as awful as \"Wild Wild West.\" But we’ll hazard a guess that Pirates 5 can’t come quick enough for Bruckheimer or Depp."
    },
    {
      "critic": "Xan Brooks",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "The spirits fly in and out of The Lone Ranger at random. It's nice to see them come and go. I just wish they'd stay for longer."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "Verbinski orchestrates complex action sequences, including two spectacular bits of derring-do on a moving train, with a precision few in Hollywood are capable of pulling off. Yet The Lone Ranger, like his last two Pirates movies, seems conceived to deliver spectacle by the bulk, which means carrying the baggage of multiple subplots for the purpose of multiple climactic sequences."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "It’s impossible to know how much of Tonto’s story is tall tale or historical fact. The tactic undercuts the film’s attempt at revisionism or at best equalizes men of all races as untrustworthy tellers of of their own history. The Lone Ranger stokes the legend but its smoke signals only add to the haze."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "It’s got too much on its mind, and it’s unsure of its tone. This is the rough cut of a slimmer, better movie"
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "A very long, very busy movie that will unite the generations in bafflement, stupefaction and occasional delight."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "The Lone Ranger is a frustrating exercise in overkill, a kind-of, sort-of interesting idea buried in summer-movie excess."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "The Lone Ranger has it all, but what you end up with is not much. It's an extravagantly squandered opportunity."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "It's all too much and not enough—a succession of disparate, can-you-top-this episodes inelegantly piling up like skidding cars on a freeway. And that's not even taking into account the action scenes. Lord, those action scenes: Monotonous, loud and relentless, they're a punishing example of the self-satisfied, digitally augmented ephemera that typifies modern Hollywood moviemaking, and House Bruckheimer in particular."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "Extravagant but exhausting...this over-the-top oater delivers all the energy and spectacle audiences have come to expect from a Jerry Bruckheimer production, but sucks out the fun in the process,"
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 38,
      "summary": "This is slick trash. A bloated, unfunny, sometimes downright bizarre train wreck featuring some of the loudest, longest and least entertaining actual train wrecks in recent memory."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 38,
      "summary": "The greater embarrassment is that so many millions of dollars have been wasted on an entertainment that feels so smug, so pointless, and so thunderously empty."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 38,
      "summary": "The movie, of course, barrels toward climax upon climax, and while possibly better photographed, the crashes, bangs, and booms are no less numbing than anything else you've seen in this summer of garbage blockbusters."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 33,
      "summary": "What do you get? A reboot of \"The Lone Ranger” that metaphorically drags this noble story – and literally drags its title character – through a steaming heap of horse droppings."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 30,
      "summary": "Johnny Depp's Tonto wears a dead crow on his head in The Lone Ranger. The star himself carries a dead movie on his shoulders."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 30,
      "summary": "The Lone Ranger exists without a convincing sense of jeopardy or, more critically, any place for audiences to emotionally connect."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 25,
      "summary": "Here they're just putting \"Pirates of the Caribbean\" in a saddle and pretending we won't notice."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 25,
      "summary": "The ferociously misguided new rendition of The Lone Ranger has no legitimate reason to exist."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 25,
      "summary": "This mishmash of styles, genres and tonal shifts makes for a dizzying pastiche best described in terms of the many movies it references throughout its nearly 2 1/2-hour running time, from “Little Big Man,” Buster Keaton’s “The General” and the Monument Valley-set canon of John Ford to “Dead Man,” “Rango” and “Pirates of the Caribbean.”"
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 25,
      "summary": "In scenes such as hundreds of Natives being slaughtered by U.S. troops behind Gatling guns, we have Tonto and the Lone Ranger acting like a couple of comic-relief ninnies, screwing around aimlessly for laughs on a handcar. It's as if the movie were having a nervous breakdown. At one point the masked man gets his head dragged through horse manure. Watching The Lone Ranger, you know the feeling."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 25,
      "summary": "The sad truth is these durable 80-year-old characters, who peaked with a 1950s TV series, never even come to life in this bloated, misshapen mess, a stillborn franchise loaded with metaphors for its feeble attempts to amuse, excite and entertain."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 20,
      "summary": "Appalling in ways that you could never have anticipated. The movie mixes mismatched-buddy high jinks with scenes of carnage."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 20,
      "summary": "This smart-looking but empty adventure — with a hero that looks more Tom Ford than John Ford — suffers from a shambling script, shifting tones and a surplus of villains. Clunky and drawn out, “Ranger” shoots blanks, even with the star power of Johnny Depp behind it."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "summary": "It represents 2 1/2 of the longest hours on record, a jumbled botch that is so confused in its purpose and so charmless in its effect that it must be seen to be believed, but better yet, no. Don't see it, don't believe it, not unless a case of restless leg syndrome sounds like a fun time at the movies."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 14,
      "pos_reactions": 29,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "I felt like I needed to write a review for this because of all the negative press it has been receiving.  My wife and I absolutely loved this movie!  We were smiling through the entire movie, and everyone applauded at the end of the movie!  My wife wants to buy this movie for her dad for Christmas.  We were so glad we did not worry about the \"professional\" reviewers and tried out this movie  it was a great surprise!  10/10",
      "total_reactions": 43,
      "user": "EFYevan"
    },
    {
      "neg_reactions": 17,
      "pos_reactions": 16,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "Critics don't seem to understand the term \"popcorn\" movie. Luckily, Johnny Depp and Armie Hammer do. My family and I enjoyed this re-imaging of the Lone Ranger story. Depp does a great job, as does William Fichtner in the role of the villanous Butch Cavendish. Armie Hammer holds is own against Depp. The story has its quirky moments, especially with the ongoing bit of \"nature out of balance\", which only adds to the fun. The only aspect that I would pick on would be the extensive use of CGI in the action scenes. The critics are haters, this is one enjoyable popcorn movie.",
      "total_reactions": 33,
      "user": "JohnnyC"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "The Lone Ranger effectively made me felt something I have not felt for some time: that awful feeling of having sunk in money to buy tickets to an otherwise lackluster film.",
      "total_reactions": 3,
      "user": "neocomp92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "I would not recomend this movie to anyone, I found it to be redundent in it's continued attack on white people. I also think that there is nothing wrong with progress and it seemed to me that progress was attacked. There is something wrong with the Lone Ranger being portrayed as a bumbling boob that needs the guidance of Tonto to put on his gun belt. I bet the makers of this movie won't give any of the world wide profits to any of the Indian Nations tht they so happly exploited in this stinker. Don't let your children watch this POS.",
      "total_reactions": 3,
      "user": "rudyshell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "This would have been the worst movie Ive seen in years. Depp, you should be ashamed of yourself. No continuity, no real story line, and I left before the movie was even 3/4 through.",
      "total_reactions": 3,
      "user": "Kewldog1111"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "I know what the late Clayton Moore would have said about this travesty: \"I served with Tonto. I knew Tonto. Tonto was a friend of mine. Whoever you think you are, you're no Tonto.\"",
      "total_reactions": 2,
      "user": "nautico"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "Critics are haters. They're like blood-thirsty vampires. They feed on negative energy. This movie was actually very good, and I loved watching Johnny Depp and Armie Hammer working together as a team. The film is not nearly as bad as critics suggest, even though I have a few objections over the cannibalism and sexual undertones the movie had, since kids might have been watching. However, there are also some very humorous scenes between Depp and Hammer in the movie. Overall, I enjoyed this movie and hope there will be a sequel, though it seems unlikely. I would purchase this movie on DVD, as it very good.",
      "total_reactions": 2,
      "user": "andrewgarcia732"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "This film is very good. It is as good as when you see Pirates of the Caribbean for the first time. The main characters are easy to relate to. The action scenes are quite amazing.and the story line keeps you going.. Perfect cinema fodder",
      "total_reactions": 2,
      "user": "woo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "Whats with the negative reviews? This film is a solid 10 for me. The film has a great flow. A bit of a slow beginning but the explosions and effects are fantastic and so is the acting. The storyline isn't insanely special but none the less it's a very entertaining film. The CG may be a tiny bit off here and there but that doesn't spoil it. There's also a charm of humour in it as well which makes it great.",
      "total_reactions": 1,
      "user": "Dalek"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "Having seen how the critics trashed this movie I was expecting the worst. Wow did they ever get it wrong. To me it was the ultimate, thrilling Saturday morning western I remember seeing as a kid. Of course it was over the top and absurd in places   it was meant to be because it was such a glorious homage to this genre. Don't be put off by over-intellectualizing critics. It's a blast.",
      "total_reactions": 1,
      "user": "movieboy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "The Lone Ranger is the best movie of  2013 (so far). If the kid inside you is still alive, just ignore all the negative critics and enjoy the great movie.",
      "total_reactions": 1,
      "user": "cbibejs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "I'm sure there's a reason there hasn't been a Lone Ranger film for about thirty years. After seeing this, I know the reason why. Though Depp and Hammer are acceptable as leads and have some good chemistry between them and Tom Wilkinson is fitting as a villain, that isn't enough to save this film from bland and boring acting, a garbage script and storyline, numerous plot holes and CGI that's laughable at best. All we know is, due to the rather poor box office earnings of this film, we won't be seeing a Lone Ranger for another thirty years, and I'm quite happy for that.",
      "total_reactions": 1,
      "user": "Fozzy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "Although most people underrated the movie it is worth it to watch. The cast had many good actors if not close to great, just to mention few there was Johnny Depp, Armie Hammer, William Fichtner, Helena Bonham Carter. The movie is a typically action movie with a little bit weak story line. Yes it dose include some boring parts which add to the length of the movie. Generally it is a enjoyable movie which chance that a person will watch it 1-2 times.",
      "total_reactions": 1,
      "user": "deamonhunter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "This is a horrendous movie and it's relatively poor box office return reflects that. The main problem is the poor storyline, which tries to cover so many bases, that it has no structure and is total nonsense. This film could have either been a comic buddy story, such as Starsky and Hutch, or a more profound story looking at the interaction between Native Americans and settlers through the relationship of the Lone Ranger and Tonto. The fact it tries to cover both and more leads to confusion. The lead performances are not great. Armie Hammer lacks presence and comic sensibility as the Lone Ranger, whereas Johnny Depp is unintelligible as a mumbling, halting version of Jack Sparrow. However, the support cast, in particular Tom Wilkinson and Helena Bonham-Carter, are good. I suspect, there will be no sequel, but I also think there will be no reboot, certainly not in the near future. Who thought that the world was waiting for $215mn Lone Ranger blockbuster?",
      "total_reactions": 1,
      "user": "Elasticman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2014
      },
      "score": 8,
      "text": "Critics are being way to hard on this movie. I thought it was pretty good. At first it looks like it might be to silly, but for the most part it`s serious.I was even surprised to see some of the violence in a Disney movie.It`s a great adventure.",
      "total_reactions": 1,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "A masterpiece!! Epic!! Perfection!!!! One of the best live action films ever made!!! Do not listen to anyone and watch it!!!! You will really enjoy it!!!!",
      "total_reactions": 1,
      "user": "JohnnyStephens"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "The movie was very boring, it has no story, what is the massage of it, too long and on the top of all that it looks like it is a big mess. i really think that people give this movie a good rating  because they feel sorry for it.",
      "total_reactions": 1,
      "user": "smanso"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "You can say what you want about critics and I say plenty, but the got it right this time.",
      "total_reactions": 1,
      "user": "hendri2182"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "It might be overly long and weird (the rabbits...still doesn't make any sense), but the film is still entertaining.  Johnny Depp is the best in the film and he makes the film entertaining.  Without his presence the film gets overly boring.  I felt as if the main character was a baby- he just whined the whole time and never really did anything SUPER heroic.  No wonder why they put Johnny Depp's name all over it.  Johnny saves the movie with his fantastic acting and comedic performance.  The films music (by fantastic composer Hans Zimmer) is perfect and the action is awesome along with its eye popping visual effects.  This film is weird, but entertainingly good.",
      "total_reactions": 1,
      "user": "DibbHansen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "The Lone Ranger has good moments, but overall it is a film chalk full of pacing problems, blatant racism, and confusing flashbacks. The film starts off hot with an unbelievably cool train action scene. I found myself wondering why the critics had been so harsh on the pacing of the film, and then the next hour and twenty minutes occurred. In blatant terms, it was slow. The movie ends with another amazing action scene, but the middle drags on for an overwhelming length. Johnny Depp does not produce his best work here. Instead of portraying Tonto correctly, intelligent with a hint of crazy, he played him at times idiotic and down right stupid. Depp made the entirety of the Native American people look dumb, and because of it came across racist. Lastly, what were the flashbacks about? Why did we need to see Tonto as an old man, and what was the symbolism at the end? I missed it completely... The Lone Ranger will go down as one of the biggest box office flops of the summer, and after viewing it is understandable.",
      "total_reactions": 1,
      "user": "Luke_McLaughlin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "All the character are competent and capable when they need to be but then there drooling idiots later  Story is bad the Lone Ranger is a sad disappointment",
      "total_reactions": 1,
      "user": "dyshpo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "This movie tends to get sour ratings. But, personally, I didn't think it was that bad. I mean the action was kind of null at some points, but this movie deserves at least a 6.5.",
      "total_reactions": 1,
      "user": "Max_Fuller"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "My wife and I, who both grew up in the 50s with the TV series, absolutely loved this movie. We are admittedly Johnny Depp fans and knew from the expert reviews that we would most probably love this movie, as we rarely agree with the stiff collared professional hacks. The movie had obvious flaws like dangling plots, corny puns and character deviations from it's puritanical routes of the radio series but succeeded in it's primary goal of pure entertainment. Lighten up folks  this movie will be a cult classic.",
      "total_reactions": 1,
      "user": "tthumb"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "This film was absolutely fantastic! Not only did the film appeal to children but to all audiences by its great use of mild gore, adventurous action and tasteful humor. From thrilling fight scenes to sad death scenes, the film has you feel a great range of emotions.",
      "total_reactions": 1,
      "user": "Ahmedghafouri"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Ahead of The Lone Ranger as it made its way across the pond was a cloud of overwhelming negativity from American critics, souring the film's UK opening. Stars Armie Hammer and Johnny Depp have defended the film against this tirade, arguing that these reviews were written months before the film was released, and focused on condemning the large budget length. This side of the Atlantic, critical reception has been elevated to \"mixed\". Bracing ourselves for the worst, the revelation is that The Lone Ranger is actually a cracking film, that does not deserve its fate as the latest high profile flop.",
      "total_reactions": 1,
      "user": "Jack_Sunshine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Pretty nice action. Go and see it right now if you haven't saw it. It was really nice. This movie is underrated. I think this movie deserves to get a Oscar in the next year. MUST SEE.",
      "total_reactions": 1,
      "user": "Annthisway"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2013
      },
      "score": 0,
      "text": "At some point there was this one scene where Armie Hammer's persona was being dragged through horse fecal matter. That's exactly how it felt watching this putrid excuse of entertainment.",
      "total_reactions": 1,
      "user": "Dragonhearted"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "I absolutely loved it. I heard of all the bad things about it, which made me skeptical at first, but when i watched it I thought to myself \"Wow, this is actually fairly decent\". It adds yet another dark tone to Disney, plus more. It gets a lot of hate for some reason, and that reason will remain a mystery.",
      "total_reactions": 1,
      "user": "cag11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "All though this movie was not perfect it certainly did not deserve to get banged up by a lot of critics and others who I feel are somewhat close minded.This is the kind of movie that appeals to people with a  capability for abstract thinking and can accept entertainment which presents the unexpected.No, the Lone Ranger is not an Instant Hero and Tonto is not his servant.The plot does not always follow the linear direction that you would think.And the story told by the old Tonto is possibly that in his own mind  just a story.But these are the things I liked about the movie and thoroughly enjoyed watching it at The Family Drive-in in Stephens City,VA  with my wonderful wife,my awesome 5 month old son (who fell asleep on my chest before the movie even started) and a sky full of stars overhead.Add this one to my list of all time revisionist westerns and I am looking for more like it from this creative team.",
      "total_reactions": 1,
      "user": "atormorkan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "The Lone Ranger 1949 series was one of the biggest hits in television history, and for me this movie's accomplishment honor (not the best way but it does). Johnny Depp shows us a more like Tonto Jack Sparrow that Jay Silverheels starring. Gore Verbinski does a good direction, but I am already half sick of us do get used by Tim Burton to see Johnny Depp and Helena Bonham Carter together on screen. Armie Hammer grandly homage to the great Clayton Moore (who can rest in peace thanks to Hammer). The comedic moments manage to make you laugh out loud almost (Johnny Depp in the special). What I did not like that becomes boring and middle parts of the very fictional script.",
      "total_reactions": 1,
      "user": "JNOTR"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "Movie suffers from an identity crisis!  Depp is playing it coy and going for the laughs; Hammer is trying to play it straight and go for the action.  The scenes jump from Let's Make a Comedy to Now It's Die Hard Time.  The audience never knows how to react or relate.  It's not nearly as bad, though, as the critics would have you believe.  Interesting footnote:  at the showing I saw many waited and watched as Depp literally walked into the sunset AFTER the credits.  Most were older audience members perhaps trying to hold on to earlier memories of \"Hi, Yo, Silver.\"",
      "total_reactions": 10,
      "user": "wvmoviefan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "A slick movie like this one coming from Disney has \"Pirates of the Caribbean\" franchising written all over it, and it probably will.    That said, while it isn't the lousy movie so many people seem to be claiming it is, it's not the greatest, either.    The high point is Johnny Depp, obviously.    Armie Hammer comes across likeable enough but lacking in the charisma department severely.",
      "total_reactions": 7,
      "user": "shpostal"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Don't believe the harsh critics- this was a great summer film! Its main flaw is that it is a bit too long, but there is plenty of entertainment to carry the audience along. Armie and Johnny have great chemistry together, and it's clear they had a ball. William Fichtner is a perfect villain. Many of the reviews criticize the film for not knowing whether to be serious or funny- this is ridiculous as it's possible to go for some laughs while carrying a more serious message underneath, and I think this film has done that brilliantly. The trailers I saw before this film are all the cookie-cutter comic book heroes and fighting robots; it's great to have an alternative with horses and trains for a change.",
      "total_reactions": 7,
      "user": "madscntst"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Great summer movie.  Lots of action, very funny and beautiful visually.  Depp and Hammer make a wonderful \"Odd Couple.\"   There's so much here, so many layers of meaning.",
      "total_reactions": 10,
      "user": "meena6"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "Very, very entertaining film for the whole family. (Not for little tykes under 7, though.)  We took our 3 boys, aged 9, 13, and 14 to see this movie and for a change, all of them enjoyed it. Not easy to find a film that appeals to this range of ages. I also loved this movie and will willingly see it again. Very good story, excellent acting, and worth the price of admission. I am glad though, that it's not in 3D, which is becoming a gimmick when used in films that don't need that to be visually stimulating. This film is has stunning visuals of Monument Valley. Another of the things that amazed me the most were not the explosions or the finely executed train sequences, but the amazing make up done on all the actors, from Johnny Depp's \"Tonto\" face paint to William Fichtner's \"Butch Cavendish\" split lip and stringy hair to Helena Bonham Carter's \"Red\" and her ivory leg (it's been in trailers, so not a spoiler, I think). This is not a comedy, nor is it a \"dram-edy\", but all around entertaining. The thing I noticed most about Depp's performance was that there was nothing he did that reminded me of Captain Jack in his mannerisms and I have watched the first 3 Pirate movies many times with my kids. Sure, there are nods to Pirates and even a few of Johnny's other movies if you catch the references. I caught a couple of them. As always, Depp gives a fabulous performance and I think his new Comanche family is proud of his portrayal. Tonto, though damaged, is first and foremost a warrior and is the smart one of the duo. That crow became less of a distraction as well. It wasn't just a headpiece. I also can't say enough good things about the 6'3\" Armie Hammer who plays the title character. He's perfect and a good straight man to Depp's sometimes mischievous Tonto. I didn't find any of the humor to be dumbed-down or just for cheap laughs. Nice to watch a film with out any fart jokes.",
      "total_reactions": 9,
      "user": "mpmartin"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "Went to a matinee by myself first as I wasn't expecting much based on the horrendous reviews.  Wow,  was I surprised:  fabulous, fun-filled, entertaining film!  Convinced my daughter & son-in-law to see it last night; we all had a great time.  Getting a bad feeling, though, about the way the reviews for this rolled out.  Many could not even claim to be informative.  They were just vicious attacks.  What's going on?",
      "total_reactions": 13,
      "user": "wascalywabbits"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "This Movie was really Good so entertaining  i dont understand why critics are giving negative reviews maybe they hate being entetained  Johnny Depp is Perfect as always i think it's one of his best  Armie Hammer is surprisingly good  the movie has some great western and action moments that it's really hard to not enjoy  so if you want to have some fun go and watch it as soon as possible",
      "total_reactions": 16,
      "user": "RebelRebel"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "While not the best movie ever, this movie was definitely better than the composite metacritic score.  My wife and I thoroughly enjoyed it and my wife not being the biggest sci-fi, action, fantasy type fan said we will have to get it on dvd.  It was 2-1/2 hours long and didn't seem that long, was a good story and a good popcorn flick bringing you back to the adventurous 80s style movies that was 75% action and 25% plot.  Would see it again.",
      "total_reactions": 8,
      "user": "ThroneBender"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "GREAT Movie, very entertaining, highly recommend and can;t wait to see it again  Acting was great, the scenery was beautiful,the music was great.  The time seemed to fly by.    Fun Fun Fun",
      "total_reactions": 8,
      "user": "DeborahMcC"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Classic comedic western with the fantastic sarcasm of johnny Depp. It was everything i had hoped. Really can't understand the bad reviews by the critics  really makes you wonder if they were paid off. There is so much garbage out there, not sure why they picked on this movie. Ignore them.",
      "total_reactions": 8,
      "user": "Masha_D"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "I think the critics saw the wrong movie. This is action packed, beautifully filmed with great touches of humor. Depp gracefully steps aside to let Armie and Silver steal the movie. And do they ever! Do not listen to critics, this is the best summer movie you could possibly see! Hi Ho Silver!! The bad guys are wonderful done, scenery is breathtaking, and not a moment that isn't memorable!!! I am a  movie lover. And this is great summer film making!!!",
      "total_reactions": 8,
      "user": "kittcat88"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Was a very good movie for sure. I think that the critics get very harsh on movies like this because they are more niche movies that won't appeal to every moviegoer but instead are very well spaced and have a good amount of humor in them.",
      "total_reactions": 4,
      "user": "CKhound"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "This was just an entertaining, turn the mind off kind of movie.  The acting was good, the pacing was great.  Just don't think about it and enjoy the fun and you will like the movie.  If you are expecting an Oscar contender don't go.",
      "total_reactions": 4,
      "user": "patdingo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "The Lone Ranger is a very long way away from being excellent. However I think it is enjoyable and it delivers what you would expect from a film made by the Pirates of the Caribbean producers. Johnny Depp gives a funny and well done performance and Arnie Hammer doesn't do a bad job either. Overall it isn't the best film in the world but it was still entertaining and worth watching.",
      "total_reactions": 4,
      "user": "pondelicious"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "My husband and I saw it yesterday and enjoyed it so much we went back and saw it again today.  It's hilarious, full of action and surprise dialog (love the new definition of \"kemosabe\").  Some of the action gets pretty crazy like toward the end of Mel Brooks' Blazing Saddles; great fun to watch. Beautiful scenery. Though the story is in Texas, it was shot in Monument Valley, AZ; and parts of Utah, New Mexico and California.  Perhaps the actor chosen wasn't politically correct, but lighten up.  It's a great fun comedy.",
      "total_reactions": 4,
      "user": "dustyboots"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "One of Johnny Depp's best movies without a doubt everything about this movie is great it's so enjoyable and fun it's easily one of my favorite movies",
      "total_reactions": 4,
      "user": "redgoldgreen"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "I am so glad that many users wrote positive reviews  otherwise I never would have gone to see this movie  and it was well worth it! Professional critics are missing all the fun. Lone Ranger beats out all the other summer blockbusters; it has far more wit, much better action timing, and lots of unexpected plot twists. It's especially fun to see all the visual references to old Westerns. Johnny Depp is hilarious. It's a little long, but go and have fun  you will be well entertained!",
      "total_reactions": 4,
      "user": "jbeatay"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "Media critics are incredibly harsh with their ratings. What were they expecting? It's a summer popcorn movie.",
      "total_reactions": 4,
      "user": "Rising_Dough"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "The tone veers from comedy to drama, with both genres badly written in another example of why Johnny Depp should work with directors than can say no. Depp's claims of presenting a positive representation of a Native American Indian character seem absurd on reflection, when he has delivered nothing more than a blackface performance that borders on racism. Verbinski's direction is straight out of parts two and three of the Pirates franchise and the assumption must be that Disney execs will soon lose their jobs with another bomb to follow John Carter. The only redeeming feature is Silver the horse, who deserves his own spin off series. The Lone Ranger himself is reduced to being a feeble joke figure with which the hapless Hammer can do nothing. The worst kind of Hollywood filmmaking.",
      "total_reactions": 4,
      "user": "manofthemoon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "Despite the critical reviews and audience’s general hatred of the film, I really enjoyed “The Lone Ranger.”  The film is not without its problems as Armie Hammer’s performance is a little cheesy for the fabled hero of the old west but he eventually gets better as the film progresses.  Secondly, the story felt a little long and it tended to drag at points.  However, there are some great action sequences, William Fichtner is great as the villain and Johnny Depp is pretty entertaining as Tonto.  The film has its good and it has its bad but I enjoyed it more than I hated it.",
      "total_reactions": 4,
      "user": "RevRon"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "What a great movie.  Enjoyable time with my 13 year-old daughter.",
      "total_reactions": 19,
      "user": "DWest"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "Really, the movie isn't bad.  I am sure that you have read critics tearing this movie down, but I wouldn't agree with other users here who feel that critics simply didn't get it or couldn't enjoy a bit of summer fun.  Moreover, every critique you have heard is valid.  The thing is, while all those bits detract from the movie a bit they do not by any means ruin it.  It's still well done and great summer fun.  I don't expect it will do well at the box office though, because even if you ignore bad reviews the Lone Ranger  a movie you'd expect to pander to every demographic  will repel more than a few who would otherwise have loved it with it's body count and brutality.",
      "total_reactions": 7,
      "user": "maxhanuman"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "Johnny Depp is brilliant, the movie is excellent,  the dialog is sharp, and humorous,  the special effects are very good.  Was it really over 2 hours! The time went so quickly. I don't know why the critics are negative...perhaps they are jealous of success.  Outside of the bedroom, its the most fun you will have for 2 hours this summer,  Angels, Johnny shines brightly.",
      "total_reactions": 12,
      "user": "sesostris"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "\"The Lone Ranger\" is a perfect summer Movie i enjoyed watching it even though screenplay wasn't that strong but the movie doesnt fail to entertain you",
      "total_reactions": 12,
      "user": "screamshout"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "The Lone Ranger is one of those movies that reminds how important of a role the editor plays in making a film. Now first off, I really disagree with critics. This film is garnering a lot of hate which is quite ridiculous, as I found it to be typical summer movie fun, that doesn't quite live up to the standards of Pirates. There are two main limps that drag the film down. Its runtime, and the plot. The movie should really be about 30-45 minutes shorter, but that's a lesser complaint. The real problem is how tonally inconsistent the plot is. There will be moments when the villain cuts organs out of deceased bodies, and then immediately after there is humor from Tonto. It feels like the Lone Ranger and Tonto are in one movie, and this evil, menacing villain is in another. Also, this is surprisingly dark for a Disney movie. The villain is scary and cuts out and eats people's hearts,(brought to you by Disney, ha ha!) and even though it's being marketed as one, it isn't a family friendly movie. I went with my 7 year old brother and he could handle it, but he's got balls of steel so read reviews before taking your kids. Despite all my gripes, I found the Lone Ranger to be engaging summer fare that was just a bit too long.",
      "total_reactions": 9,
      "user": "SimpleMethod"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "Love, love, LOVE it!!! Didn't want it to end. Armie stole the show, which I didn't expect. Johnny gave an amazing performance also. The audience burst into enthusiastic applause at the end. Great fun!!!",
      "total_reactions": 9,
      "user": "mamabear0109"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "A science fiction cowboy movie similar to Aliens and Cowboys but with more laughs.  This is a good popcorn flick that runs long but it moves with lots of action.",
      "total_reactions": 6,
      "user": "gfny"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "This movie is terrific.  Very entertaining and it was not at all boring.  The action, humor and scenery is fantastic.  Do not let the professional reviews keep you from seeing it.  I intend to see it again and buy the video.  The placement of William Tell Overture was thrilling.",
      "total_reactions": 6,
      "user": "coletteozzie316"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2015
      },
      "score": 7,
      "text": "Gore Verbinski's \"The Lone Ranger\" does have way too much things going on its wandering plot and script, but hey, the movie is actually really enjoyable with Johnny Depp and his usual-comedic performances piecing this long action blockbuster something suitable as a family film of all ages to watch during the weekends.",
      "total_reactions": 3,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Much like with his first Pirates of the Caribbean film, Gore Verbinski has roved that he is a master of both spectacle and story as The Lone Ranger is an unconventional yet exhilarating tale of reinvention and revenge. While returning home John Reid (Armie Hammer) meets Tonto (Johnny Depp) during a daring train jailbreak. When John is left for dead Tonto saves him and encourages him to become something outside the law, to become a Lone Ranger. Much like Verbinski's previous effort Rango, The Lone Ranger is a twist on the conventional western and doesn't quite feel like a western at all. The Lone Ranger feels like a remarkably smart kids film as almost everything in the film happens for the sake of comedy as the film rockets along with a light hearted tone. However the film does have some disturbing moments that give John and Tonto their justifications for their vendetta meaning there are moments when the film doesn't feel like a 12A at all but a 15 meaning there are moments that may not be suitable for children, especially a rather twisted torture scene early on in the film. It's a courageous film that goes against the stereotypical western formula to become its own beast, a fast paced revenge thriller that boasts more comedy than the average buddy comedy and still has room for exploding trains, gunfights and romance. A film that is trying to be spectacular and look incredible and despite a slow opening it pretty much achieves everything it sets out to do and more.",
      "total_reactions": 3,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "The Lone Ranger is a 2013 film directed by Gore Verbinski. Directed by Verbinski I liked very much. The sets are really nice and I liked the fact that they decided to take it all with real landscapes rather than create them with CGI. Johnny Depp and Armie Hammer were a great duo, both very funny, especially the character of Tonto. The action scenes were well shot and the comic scenes are not missed at all. The only flaw is the length of the film. I did not hear it but for such a plot 150 minutes is too long.",
      "total_reactions": 3,
      "user": "Mad_Hatter91"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "This one has some funny moments thanks to Johnny Depp but is too heavy-handed with the slapstick action escapes.  I also detested the title character a bit more than perhaps the writers intended or would have wanted, since it kept me from engaging more with the film.",
      "total_reactions": 3,
      "user": "Corvin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "WTF is up with these critics. Seriously top entertainment here and they rate it an average of 3.7  These semi-intellectuals need to get their heads out of their asses and rate movies according to entertainment value. I had fun through the whole movie hence rating it a 10",
      "total_reactions": 3,
      "user": "Lehlohonolo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "Unbelievably under valued, this is a light and enjoyable movie. Johnny Depp is, for him, very understated here as Tonto and his fun playing of the character is all the better for it. In the scenes in which he plays him as an old man he is totally unrecognisable so good is the make up for his aged character. The cinematography is first rate and much enjoyment is generated from the outstanding stunt work on display aboard a fast moving train. Hans Zimmer intuitively ties everything up nicely via his perfectly fitting and, at times, beautifully melodic score.",
      "total_reactions": 3,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Anyone who does not enjoy this movie has no appreciation for the essence of a \"Summer Blockbuster\". I can only assume that the critics went into it expecting a re-boot of Clayton Moore and Jay Silverheel's classic t.v. interpretation of the 1933 radio show. Clearly it is not that. The movies is the legend told through the eyes of an aging, and possibly senile, Tonto. Accept that premise and you will thoroughly enjoy Johnny Depp's portrayal of the iconic sidekick. The critics have it wrong folks, this is a classic.",
      "total_reactions": 3,
      "user": "marinevet"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "A funny movie that is, admittedly, too long in the middle.  If they had dropped a few subplots and stuck with the two leads--who have great chemistry together--they'd have had a great movie, not merely a good one.",
      "total_reactions": 3,
      "user": "Beowulf4862"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "I do not understand the negative reviews of this film--it is very good--it does take its time to get to the main action, but it is an origins film for both Tonto and the Lone Ranger.  It is full of magic realism, an economic critique of progress in the 19th century, and an elegy for a lost world of First Nations and the environment    I would recommend this film to anyone.  It even taps into the original series musically, the modified theme.  It even ends with a Heigh-ho Silver--great effects--the horse leaping from the roof of the barn to the earth is great, and it even has echoes of LOTR:  TTT, the Comanche attack.  Go see it!",
      "total_reactions": 3,
      "user": "theoden"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "This movie was entertaining, but had a lot of problems with its characters, plot, and pacing. One of the most noticeable problems is that i doesn't really have an audience its aimed at. There are moments where poop and fart jokes are thrown at the audience and other moments where we witness SPOILER ALERT; a man eating another man's heart. Armie Hammer never became his role and at times was very awkward to watch, Jonny Depp acted well in his role of Jack Sparrow in a native american costume, but ultimately their chemistry fell face flat. The entire story is told to a little kid similarly to Princess Bride, but this format quickly becomes strange and feels very out-of-place. It had cool action scenes and a few comedic moments, but in between was just a very stretched-out boring plot that goes literally no where. Out of generosity towards the good moments in this film I will give it a 4 out of 10. Seriously that's being generous.",
      "total_reactions": 3,
      "user": "DrahgoScribe"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Saw in a full theater. Audience responded with appropriate laughter, solemn attention and a round of applause at end. I loved it. Found the acting, sets, stunts, costumes amazing-the message profound. Nature will never be in balance with man present...Great film!",
      "total_reactions": 3,
      "user": "FilmFancy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "How could the critics get The Lone Ranger so wrong. They should hang their heads in shame. This is the most heartfelt movie of the summer and one of the most interesting films of the year. It balances action and fun with a serious, and fairly bitter commentary, of big business and the plight of native Americans  something you would expect from an indie movie not a $200 million Disney blockbuster. Critics have mentioned echoes of The General (and Buster Keaton is definitely an inspiration for Johnny Depp's take on Tonto) but the real touchstone is The Missouri Breaks with Depp's hero Marlon Brando  another film that was panned for it's mixture of whimsy and brutality. (Tonto talking to Silver and baddie wearing bonnet are direct references to Missouri Breaks). If you want to see a summer film that is immensely entertaining but also has something on its mind then don't miss The Lone Ranger. The critics are a disgrace.",
      "total_reactions": 3,
      "user": "Vickimage"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "I really enjoyed it!  I feel like people made a great fuss over it being overly violent, which I was confused about, since this is Gore Verbinski, a director who typically makes very-adult children's films.  I didn't think it was that violent at all.",
      "total_reactions": 3,
      "user": "imw3d"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "Sorry don't need some critics telling me what to see and if I will like a movie or not! It was great and have seen it 3 times and will go back; thanks Disney, Jerry, Gore, Johnny and Armie for a fun 2 1/2 hours of entertainment!",
      "total_reactions": 3,
      "user": "kayceetn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "A very good movie with great action scenes and good buddy bonding. Johnny Depp is perfect as Tonto",
      "total_reactions": 3,
      "user": "hines33"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "I saw this movie on the 4th. Theater was full.   I still watch reruns of the original Lone Ranger on digital TV.  The new Lone Ranger is not a remake. It is a a NEW movie about the Lone Ranger,  story told by Tonto.  I thought that was clever. This is a Disney movie, well made, entertaining. Isn't that what movies are all about? Johnny Depp was again at his best  Armie Hammer  so so, but very good looking  I took my 4 1/2 old granddaughter and she got the humor  laughed and liked Tonto.  She made a comment about how this movie was like Rango. Even a 4 year old knows about the wild, wild west. Brilliant child!   Lots of gunfights, yeah, people get shot and die but hello its how it happened back then. IF they didn't put it in then the critics would say it wasnt true to how it was.   I don't consider it violent.  I've  seen cartoons where they get shot.   The critics suck not the movie!  They get more attention for themselves if they give a negative review.",
      "total_reactions": 3,
      "user": "emilyo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "At first we didn't want to see The Lone Ranger because of the bad reviews.  But our friends wanted to see it, so we went along.   All four of us loved it!   It had everything, adventure, love, good vs. evil, historical content ...but most of all humor and wit.  Johnny Depp was wonderful as Tonto.  All four of us loved the movie and recommend it to all. Don't listen to the critics....decide for yourself!",
      "total_reactions": 3,
      "user": "hunibunijt"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "We went to see the Lone Ranger again. I liked it more the second time. The different emotions it envokes through out the movie, is a wide range and lots of laughter.",
      "total_reactions": 3,
      "user": "mikes04239"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "Johnny Depp has been all downhill since 21 Jump Street.  He's not a good actor, he just plays the same quirky weirdo in every movie. I just don't think the Lone Ranger resonates with many people these days.  Horses, trains, what?  I did enjoy Armie Hammer though.",
      "total_reactions": 3,
      "user": "NRGMan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "The lone Ranger Is Great and wonderful film  and the dialog is sharp, and humorous, the special effects are very good",
      "total_reactions": 3,
      "user": "midoumax"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "This movie is funny and good.I can't believe the critics hate this movie I mean this movie is great especially If Johnny Depp is in the movie.",
      "total_reactions": 3,
      "user": "ERB2"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "I went to see this film with pretty low expectations, thanks to the panning Lone Ranger has had from the critics. I was surprised at how much I enjoyed the film. I mean, yes it's a bit predictable at times, and it is a long film (although I didn't really notice that during the film  I think if I were to watch it again it would feel too long and overly padded). But it is also really entertaining. My friends and I laughed a lot during the film and we all came out of the cinema having enjoyed the film. I'd recommend it to anyone who isn't going to take the plot too seriously but just wants to have fun for a couple of hours.",
      "total_reactions": 3,
      "user": "MrsW"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "The Lone Ranger is an absolutely fun summer movie starring Johnny Depp at his best  it has lot of action combined with comedy that produces something enjoyable",
      "total_reactions": 14,
      "user": "jjdonna"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "This movie was entertaining from start to finish  I laughed until I cried. In my opinion, Depp is a modern day Chaplin. It was spectacular. I am glad I did not read the critics reviews before I attended the film.",
      "total_reactions": 11,
      "user": "mgdove"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "Yet another modern adaptation that details the creation of the myth (and sets us up for sequels). This time, a city-slicker prosecutor (Armie Hammer) dons the famous mask to team up with a multi-layered Tonto (would you expect anything less from Johnny Depp?). The plot revolves around the advancement of the railroad in the Old West and so do all 3 of the action sequences, which are full of daring do and spectacular stunts. The rest of the time is dialogue in the dessert…a lot of it.,,too much (this is 2.5 hrs). And it's often in jarring modern slang. While the leads are both OK and the movie never bores, it never captures the imagination or thrills the spirit.",
      "total_reactions": 8,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "This is a summer popcorn movie, the kind best seen as a matinee or, like I did, at the drive in. Deep plot? No. But that's not what this movie is about. It's about a good guy looking to see justice done, and the adventures he and his friend go through.",
      "total_reactions": 13,
      "user": "Asrugan"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "The Lone Ranger deserved better ratings and comments than what it got. It was funny and had a lot of action. Everyone is against the idea of Johnny Depp playing tonto here i think he did a hell of a job playing the role. JD brought humor and whit into the movie which made it watchable.",
      "total_reactions": 5,
      "user": "dlmartino"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "This movie is why you should never listen to reviewers.movie was really funny!!! 80!!!! Not your grandfather/grandmothers Lone Ranger  More violent than most Disney movies",
      "total_reactions": 17,
      "user": "swwardsf"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "This surprised me. A wild unpredictable ride worth taking. Finally a big blockbuster that is mindful of the craft at hand and allows you to enjoy the quest while not entirely ignoring historical injustices. Enjoy!",
      "total_reactions": 25,
      "user": "Direct328"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "This is how Hollywood blockbusters should be made.  Don't let the critics kill this movie. This movie takes its time developing, but it has wonderful light moments (and there are plenty of them) and some serious moments too and balances them beautifully. If you're looking for lots and lots of jumpy action shots; lots of vroom vroom bang bang boom (car chases, shootouts and explosions), you get them here, but without the jumpiness, and every single one serves the plot. Depp and Hammer are great as are all the villains, and the story builds nicely to a wonderful nostalgic climax. A little slow in spots? Maybe. Some aberrant vampire bunnies? OK. But how director Gore Verbinski, the writers and editors got this one past the money men is probably a story in itself. The cinematography is gorgeous and every shot, (except for the bunnies), and every bit of spectacle serves the story. I can't remember the last time a big Hollywood movie cared about story, or characters for that matter. The only thing at fault here is the marketing campaign which gives the impression the movie is one big heartless yuck. Well it's not. And don't hold that against it. Don't let this movie die!  Go see it!",
      "total_reactions": 11,
      "user": "filmfiend"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "I actually went to a sneak preview showing last night with my wife and we both REALLY liked it.  It's mostly a drama with some action and a little comedy.  People go in expecting one thing and review it harshly when it doesn't deliver the movie they imagined.  Well I thought the mix was enjoyable and I can't wait for a sequel.  Parents with kids, a word of caution, a lot of people get killed and there is some other gore as well.  This is a more serious movie than Pirates of the Caribbean but I don't think that is a bad thing.",
      "total_reactions": 21,
      "user": "RantAboutFuture"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "I have to say I was pleasantly surprised by this movie. Though it is no high-end film, by any stretch of the imagination, it's a whole lot of fun. The actors play their roles very well, and have excellent timing. Depp is utterly hilarious as Tonto, and plays off the more serious Ranger excellently. Go see it. It's exactly what a summer movie should be; fun, exciting, with laughs and gasps abound.",
      "total_reactions": 18,
      "user": "ticktockTANGELO"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Gore Verbinski, Johny Depp, Jerry Bucheimer creates the Pirates magic in West! Action packed, Entertaining and a Wonderful Journey of 2 and half hrs. Believe me, you will want for more. Johnny Depp is simply amazing!",
      "total_reactions": 18,
      "user": "Sambit"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "LOVE LOVE LOVE this movie, and I never buy dvd's, or go to the movies twice, but I will and I did. My husband and my 10 year old loved it to. I recommend it to everyone. GREAT JOB DISNEY!!!! GREAT JOB JOHNNY DEPP, you both did something that I believe is movie making history. You educated, entertained, made me laugh, made me sad. GO SEE IT, NOW! Oh and I NEVER write reviews, but had to stick up for this one.",
      "total_reactions": 6,
      "user": "tpiquero"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "Worst movie I have seen in the recent past.  Johnny Depp brings us Captain Jack Sparrow from Pirates and basically trades the leather pirate hat for a crow hat.  He plays the same character with just a different name...no originality.",
      "total_reactions": 4,
      "user": "QCSalesRep"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "After watching the movie I'm truly speechless at these reviews. Watch for yourself, you won't know what on Earth they are talking about. I won't bother trying to defend it, go see for yourself how awesome it is.",
      "total_reactions": 2,
      "user": "Forza182"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "Great entertainment. Not sure what the critics were looking for here, giving such low grades. Action, wonderful filming, love, Indians, guns, trains ... great pace and rhythm. Of course, if you are having a \"deep\" night, you better take a book or choose a different genre, that's all.",
      "total_reactions": 2,
      "user": "Jalemany"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "The thing that made this movie so bad for me was the depressing contstant stream of good people getting killed by the bad guys, before they finally get their comeuppance in the end, including a whole village of Indians. When they show the bad guy slapping a little kid, that was the end for me. Meanwhile Tonto is some deranged mental case with a crow on his head, and the Lone Ranger is played stupidly like the main character in Green Hornet, which toatlly ruined that movie. Thumbs down!",
      "total_reactions": 2,
      "user": "luv2telldastory"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "As Bender would say, Lone Ranger is simply fun on a bun.",
      "total_reactions": 2,
      "user": "chibistevo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "Saw this movie on a whim and have regretted spending money of this train wreck ever since. People who are giving this movie 10s are either Depp fans where he can do no wrong or Disney fans thinking the same. This movie suffers from a far to long running time this movie would probably be a good popcorn flick if they cut it down, but with the length it is at it just becomes a slog of the same ole same ole. I like Depp as an actor but again in this movie he plays what he has been playing since POTC he plays jack sparrow, but now more native American. This movie just became confused for what it wanted to be after a while did it want to be a comedy but its throwing a ton of \"deep\" thoughts in there but instead of meshing perfectly this movie just comes off a confused and mixed up movie who has no idea whats going on.",
      "total_reactions": 2,
      "user": "darthrevan4ever"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "for some weird reason the critics are saying this movie is not funny and un entertaining when i went to watch this movie and there was a funny scene everyone started laughing and at the end everyone was talking about how good it was, this movie is very funny and entertaining and probably one of the better movies that are going on right now",
      "total_reactions": 2,
      "user": "genelode"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "What a way to politically correct a film, Amazing what came with the PG-13 rating. A fully engaging movie. I think Disney did a good job with its stars but I almost skipped the movie because of the explicit use of Jonny Depp in their movies and this looked like a what if pirates of the Caribbean meets the desert version of pirates of the Caribbean.",
      "total_reactions": 2,
      "user": "itriphard"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "\"McCabe & Mrs. Miller\" was panned by some critics (most notably at first Judith Crist) and had its champions like Pauline Kael. Now, over forty years since its release, this Western was my favorite of all time. Now it is a close second. \"The Lone Ranger\" is that good. Why critics panned the movie, including it is too long, is beyond me. It needed the last thirty minutes. When you see it you will have no question about that.",
      "total_reactions": 2,
      "user": "cliffpotter"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "This movie has a nice atmosphere and characters. The storyline is decent though the movie length is overextended, it could be shorter. The movie is somewhat violent at times (I expected it to be more child-oriented-like). The movie is totally worth watching. If you doubt to watch it or not, just read about the filming process and the amount of work put into it  it's really admirable.",
      "total_reactions": 5,
      "user": "StaticSpine"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "Terrible. Wow, I don't think I have ever been so disappointed in a movie that I did not have any previous connection too. Trailers looked good, looked fun and packed with historic relevance, no suck luck. Well, it was packed with hisorically relevance that was quickly turned into a joke. \"Hey we just made an emotional impact about how the Native Americans were killed by the white man. Here is a horse in a hat, in a tree to lighten the mood two seconds later... oh and hey let's play the tacky but nostalgic theme music for twenty minutes straight in what could have been an awesome action scene if not for the music...\" Tasteless and Soulless. Almost walked out. To quote Tonto, \"Never Do that Again...\"",
      "total_reactions": 5,
      "user": "Cloudlv9"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "I've been an an avid movie goer for several decades now and usually go to see 95% of everything that gets produced by Hollywood and the Europeans even the genres I do not personally like such as rowdy teenage sex comedies and slasher movies... I have seen the Ranger two times by now and what still surprises me is this unexpected, almost involuntary delight that filled me as soon as the movie started and made me smile all the way through until the very end, on the one hand, and mass demonization of a great movie by each one of those 13.5 constipated critics, on the other hand. I can understand if you didn't like a complex message of the movie, a different image of your idol heroes, violent undertones of the background story, too much conversation vs non-stop action that we come to expect after seeing all those never ending super-action flicks, even if you secretly never liked Johhny Depp after all, but COME ON! Looking at the critics ratings on this site including, you might think it's the worst movie among those listed... Let me tell you that I HAVE seen almost all of those and in my opinion only a couple of them come close to the level of quality Ranger has. I'll tell you why. 1) Ranger was made by a talented team of Verbinski, Depp and the crew who publicly admitted it was not just one of those sequels they were aiming to produce.  It was an important and challenging job for all of them and they invested their talent, skills and vision into the movie on the level  they had not done for a long time. It clearly shows and powers the spiritual strength of the movie's magic atmosphere that grabs you tight and carries you through the movie making you an emotional participant in every piece of action. Audiences get so drawn in, that they talk to the characters aloud, cry out in joy and despair and regularly applaud Tinto, Ranger, Silver and hiss at Butch. Apart from kid's movies, I could not remember ever seeing such a reaction from the audience. That in itself is a characteristic of an authentic piece of art. 2) It is one of the most beautiful, heartfelt, sad, funny, smart, disconcerting, train crashing and mind-blowing movies this year. When did you see such an impossible combination last? How on earth did they do that, all I want to know. 3) It's a new look at the genre of a western, you might even say Verbinksi and Depp created a new genre, a western with multi-layered contents, funny characters and jaw dropping action scenes. As far as I could understand this is what the so-called critics found especially irritating. An unusual combination, but since when has a new take on the old model become an artistic weakness, not a strength? It works wonderfully and leaves you just amazed by the scope of the design and implementation skill.  3) It's a device of intellectual depth but it does not feel intellectual. It feels popcorn, easy-going, laugh- out-loud and gasp at the action entertainment. Which it certainly is. God bless the creators for such a unique movie going experience. Under-appreciated or not, a good movie never gets forgotten by the grateful spectators!!",
      "total_reactions": 5,
      "user": "Liza"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "I have to laugh at all the \"10\" reviews by accounts with no other reviews ever.  Shill marketing at its finest and a dead giveaway this is one to avoid.",
      "total_reactions": 19,
      "user": "jcasetnl"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "Disney’s The Lone Ranger follows the origins of the masked rider, John Reid (Armie Hammer), and the events that lead him to become a symbol of justice in the Old West. After completing a law degree, Reid returns to his hometown, Colby, Texas, to become the city’s government prosecutor and hold criminals accountable under United States law (along with a firm commitment to John Locke’s “Two Treatises of Government”). However, when his brother, Dan (James Badge Dale), is murdered in cold blood by ruthless outlaw Butch Cavendish (William Fichtner) Reid realizes that some criminals operate above of the law and he turns to a different form of justice as a masked vigilante. As a tenuous peace between the Native American tribes and white settlers is threatened, the Lone Ranger must join forces with a heroic, though slightly offbeat, Comanche warrior, Tonto (Johnny Depp), who has spent years hunting Cavendish. Together, Reid and Tonto set out on a mission to investigate the circumstances that led to Dan’s death before more blood is spilled. In an effort to re-imagine the Lone Ranger as a modern blockbuster franchise, Disney turned to the team behind their highly-successful Pirates of the Caribbean series, including producer Jerry Bruckheimer and director Gore Verbinski, along with star Johnny Depp. Unfortunately, despite a number of strong individual components, the final Lone Ranger movie experience misses the bar (and longterm promise) established in the first Pirates of the Caribbean installment. For many audience members, Verbinski’s latest will likely succeed in delivering mindless summer entertainment with a number of humorous character moments, a quirky (albeit familiar) performance from Depp, and an elaborate third act set-piece. Yet, for all of the film’s successes, most of the core story arcs and action beats are either derivative or underwhelming  misguided in attempts to piece together a blockbuster experience out of well-known parts. A flawed but often entertaining summer blockbuster experience, The Lone Ranger falls short as a sum of its promising individual parts. Unfortunately, the mixture of two likable leads and a cast of accomplished character actors, backed by highly-successful producers and a $200 million budget, based on a well-known pair of American heroes, doesn’t necessarily deliver a quality moviegoing experience. No doubt, certain audience members will thoroughly enjoy the bangs and gags in this Lone Ranger story but it’s still style over substance at nearly every turn, and fails to evolve or elevate the series canon in any meaningful (or particularly exciting) way.",
      "total_reactions": 12,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "While I do not hate The Lone Ranger as much as the critics do I still did not love it. The movie had some good laughs, fun scenes, and a nice performance by Johnny Depp; but the interesting characters and story along with an unnecessary 2  hour running time prevent me from recommending this film to anyone. If you wind up seeing this movie though it is not terrible but at the same time there are more entertaining movies out right now that you could be seeing like Despicable Me 2 (which I have softened up a bit on), Monsters University (which made me smile a lot), and Pacific Rim & World War Z (which I have heard are really good). Or you could save up your money for the Wolverine. Again not a terrible movie I mean it is watchable but you can afford to skip this one.",
      "total_reactions": 3,
      "user": "Jacob"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "The Lone Ranger is a great movie, and it shows what a great cast can do to go beyond the stereotypical scripts of yesteryear, and give a populist hero, and a tragic, yet funny, native American, who finally can tell the story of his friend.  Great special effects, and a period dress, which is remarkable.  Now I know why Johnny Depp made a fourth Pirates of the Caribbean; so, he could do a gritty movie, which they could afford to make based on the proceeds of the PotC series.  I don't expect everyone to like the movie or even understand it.  That is what makes it a better movie.",
      "total_reactions": 3,
      "user": "cloudman"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "It's impossibly bloated and almost entirely thrown together, but thanks to the help of an appealing tone and two likable performance from Hammer and Depp, the \"Lone Ranger\" just barely makes it past watchable.",
      "total_reactions": 3,
      "user": "Compi24"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2013
      },
      "score": 0,
      "text": "The movie showed good potential at the beginning, and I was somewhat enjoying myself.",
      "total_reactions": 3,
      "user": "Qgal5kap"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "The Lone Ranger is a film that had much potential to be solid summer fun that unforgettably transformed into a lengthy, drooling two and a half hour explosion-fest gut bus.",
      "total_reactions": 3,
      "user": "Geologist"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "Another  disney film with a star studded cast. It tries to bring back some of the companies glory days but fails miserably. But has some good humor in it.",
      "total_reactions": 3,
      "user": "MRbossFTW"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "How any one could give this movie positive reviews is beyond me, at least the box office receipts and word of mouth show the truth about this movie and not the opinion of people who are entertained by a man walking around with a dead bird on his head.",
      "total_reactions": 7,
      "user": "Studivan"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "Pointless, dull, and repetitive.  The acting was disappointing  and the movie was the first in several years I walked out of after 50 minutes. I would add forgettable, but its one I will remember as a fail on the level of  the Star Wars Holiday special...",
      "total_reactions": 7,
      "user": "UnknownCritic"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "I can't believe how insanity boring all these explosions and train-wrecks can be!  This movie makes me feel nothing but disdain for Johnny Depp's portrayal of a Native American.  How insensitive is this?  What year is this that they can't find a proper actor to play this role?  Are big Hollywood stars the only thing that people care about anymore?  Depp was basically Capt.  Jack in this silly soulless film that had no redeeming qualities (unless you are a fan of overdone CG).",
      "total_reactions": 18,
      "user": "Greenlemonade"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "How anyone rated this anywhere positive is stunning. This is a huge piece of trash wrapped in a REALLY BIG BOW! Filled with explosions, CGI, special effects, and no content close to what the Lone Ranger is all about. Why they didnt title this \"Over the Top Tonto and his shoot first sidekick\" I'll never know. Worst movie fo the year so far and another big failure. First Pirates was good, second was average, third and fourth were terrible and now this. Jerry, Disney, and Depp need to Break up for good.",
      "total_reactions": 19,
      "user": "WhySoSerious54"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "the movie is filled with a lot of great action sequences but not a lot of story. You never get to know or car about the lone ranger and  Tonto. Jonny Depp and Armie Hammer a great and seem to be having fun in  the movie, but all they di is jump around a lot of fights the don't do a lot of acting, and that do a great job of that. My advice to people would be, don't expect a lot for this movie just injoy the ride. This is mindless summer fun that's all. I have to confess I did enjoy the ride. Although the movie could have been 45 minutes shorter.",
      "total_reactions": 8,
      "user": "lismis7000"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "no need to explain",
      "total_reactions": 8,
      "user": "tkhow"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "Sleeping inducing stunts, CGI blurring the line between reality and caring about the story, muddied plot.",
      "total_reactions": 8,
      "user": "kylere"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "If not for the beautiful scenery and the familiar Lone Ranger theme song at the end I  would give this film a zero.   LONG action scenes and attempts to use every \"trick\" in the book, could not save this.  the acting was horrendous and Johnny Depp is a mere stupid character of himself As one viewer said- \"popcorn movie\"-  WELL it was too long and plodding even for that title. I kept wishing it would end and then voila- another shoot-out, another train crash..........Plainly irritating and definitely NOT suitable for young kids.   if you want to see a great story about the railroads, old west and lawmen- check out the AMC show \"Hell on Wheels\"!",
      "total_reactions": 9,
      "user": "tvworks"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "Honestly, this movie would have been much better if it didn't drag on way too long. Unfortunately, it does and grows quite stale very quickly. True, it takes time to develop characters but when the movie is only 7 minutes shorter than The Shawshank Redemption, it better have some characters I am truly emotionally invested in. Unfortunately, it does not.",
      "total_reactions": 9,
      "user": "Dankas_Turtle"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "Johnny Depp did the best job possible given the circumstances. Armie Hammer? Who is he, anyway? He was by far the most bland, boring lead character I've ever witnessed in a movie. And he can't be killed? Bummer! This movie could have been so good. Instead Bruckheimer turned it into a witless, cookie-cutter, formulaic piece of typical Hollywood shlock. The plot was predictable from the get-go. The love interest barely more than a required female role so they could say they had a woman in the movie. At the end, the Lone Ranger tells Rebecca, \"I can't stay.\"  Guess what her reply is?   \"I know\"    Really? Can't she say, \"What do you mean you're leaving me, a widow with a 9 year old kid alone here in the desert with all these disreputable men just waiting to find me alone?!!\"  One scene, Rebecca (Ruth Wilson) is working on a fence with a ranch hand; her son who is at least 9 years old, is playing in the river with the dog. In 1869, that kid would be fully employed working his butt off on the fence!  The complete lack of any attention to details makes it clear this entire movie was just an afterthought and that the people making could care less what worthless cr---p they foist off on the movie going public. JB should be ashamed to have his name associated with this dog!",
      "total_reactions": 10,
      "user": "MichaelRelhan"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "The  Lone Ranger...hated by critics...loved my me!",
      "total_reactions": 5,
      "user": "smithlm"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "Its a slapstick comedy, a somber tale of discrimination and abuse, a tale of revenge, of forbidden love, of mystical creatures, of lost idealism, of greed......in short its a bit of a dizzying mess.",
      "total_reactions": 11,
      "user": "NinaC"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "\"The Lone Ranger,\" cool right!? Not in this case no. To be honest, the movie's a mess. The script is not great, the execution is all over the place, and even the guy who plays \"The Lone Ranger,\" Armie Hammer didn't act well. The movie is full of coincidences and plot holes. Skip this crap.",
      "total_reactions": 13,
      "user": "UtopianStuff"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "The Lone Ranger is a knockoff of \"Pirates of the Caribbean\" flick, but very weak. It's almost the same problem as \"Man of Steel\" does and this movie is way too dark, way too broad, and way too underwhelm. The story takes place I 1869 where we meet John Reid (Armie Hammer) is visiting to see his brother and his wife at Texas, until he meets bad outlaws to capture Butch Cavendish from prisoner and he meets a local Indian warrior named Tonto (Johnny Depp). So he and his brother must find bad outlaws in the desert, until his brother and his men where dead. Reid was saved from Tonto to bring back alive and he teams up with Tonto to face bad outlaws from justice, so he wears a black mask and becomes \"The Lone Ranger.\" We've seen too much Johnny Depp's performance like his face expressions and other roles he's been done lately, but Johnny Depp is miscast as Tonto. Tonto is the same formula as that they borrowed from Jack Sparrow roles like he done in Pirates of the Caribbean series. Depp turns very ugly and acting like a Indian stereotypical of Tim Burton's Indian Zombie and I guess that the creators want Johnny Depp to play a weak supporting role. Armie Hammer is alright in his role, but not very memorable because they forgot to stay focus on the character instead of Johnny Depp and they shouldn't just called \"The Lone Ranger and His Tonto.\" That's what is all about, The Lone Ranger is based on the classic TV series and comes along with his adventures. The characters are recycled from Pirates of the Caribbean stereotypes and also the villains are so forgettable. Not only that, the movie is also too bloody and too dark for a Disney action flick, I don't if the movie makes it promise to the audience and there's couple of scenes where they get killed, shot, and murdered in each battle scenes. There's one scene where the train gets switch into a next rail or next train is pretty entertaining that takes only 10 or 12 minutes in the final act. Outside of that, this movie is pretty weak and we're watching the same formula like the first Pirates of the Caribbean does and they shouldn't call it \"Cowboys of the Dessertain.\" Thumbs Down.",
      "total_reactions": 2,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2013
      },
      "score": 0,
      "text": "Born in 1966 I was privileged to grow up watching the Lone Ranger on TV, I was unable to catch the movie in the theaters and was anxious to see it on DVD, I can honestly say the critics got this one correct. This movie was awful and I am offended that they made the Lone Ranger character out to be this buffoon and the Tonto character a bumbling idiot. I figured the whole story out 30 minutes into it and was exhausted and stun afterwards I only sat through it because of my kids and I explained to them that this movie was a farce, it should have never been made. I am normally not hard on movies but considering myself a serious movie buff, I am completely appalled. Disney was wondering why the critics dogged it because like me they remember the Lone Ranger as a smart, charismatic man of truth and justice with a keen mind and sense of valor with his trusty sidekick ready to assist and keen as well. I think I am done now, this movie was simply bad.",
      "total_reactions": 3,
      "user": "pastor43"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2013
      },
      "score": 3,
      "text": "Two and a half hours of nothing.  There is very little character development and by the end you care about no one.  It's not one of the worst movies of 2013 only because it's fairly well made but the length makes it unwatchable. D+",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "For a movie like this, it's not really the story quality you'd expect. Sure it has its fun and exciting moments, but it never just completely comes together as a whole. The movie has some stupid moments which lingers on and on. It's basically just all over the place, but somewhat manages to work. This is definitely more of a pop-corn flick (in which people will enjoy this movie for sure). But then if you're one of those who want not only fun action, but also containing good/quality moments, then you've just wasted your money. Also, it seems to me that Johnny Depp is playing an Indian/Native American version of Jack Sparrow. When I say that, I'm talking about his mannerisms and weird off putting dialogue. Armie Hammer on the other hand didn't really work for me that well. He just didn't convince me that he was \"The Lone Ranger\". The movie does contain some good old western memorabilia that i actually loved, but overall, it's a movie that just lingers on and off in storytelling.",
      "total_reactions": 4,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "I was skeptic going in after reading all the critics reviews. They all need to lighten up a bit. My wife was sure she would not like it. We both enjoyed it very much. It did slow down in spots but if we are going to care about these characters we have to tell a story, it can't all be car chases and explosions. We laughed through the whole thing, very entertaining...i hope they make another.",
      "total_reactions": 1,
      "user": "gtreasur"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "its a good Disney movie actually the best so far i went and thought it was going to suck but it didn't its really good its 2 hrs and 1/2  best one ive seen",
      "total_reactions": 1,
      "user": "the_unknown_"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "My husband and I really enjoyed this movie! We are admittedly Depp fans, but this was not Pirates of teh Carribean. This is a pretty heavy drama/action movie with a goodly amount of comic relief. There is more gore than I would prefer, but the dialog and story are good. I am glad the campy nod to the TV series with the William Tell overture playing was at the end and short. It is not the old series, no more than the Batman movies were the original comic book version of the story. I thought the way the story was told was spot on, and the scenery and effects very good. I wish the trailers had left more surprises for you, many of the best  scenes are already partially revealed. Some people may be bothered by what I thought were serious political overtones to the Indian/settlers/railroad/cavalry relationships but i was glad that was brought out. Depp is brilliant, Hammer was very good in his quirky clean-cut straight role, I thought they were an excellent juxtaposition.  relax- I don't like most 4 star movies anyway because they are rarely any fun!  Enjoy and don't be so serious!",
      "total_reactions": 2,
      "user": "sallou"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "I and everyone I know loved this movie, no matter what their age.  Some even put it in their top ten.  It was funny, well acted, informative (sad to remind people that Native Americans were treated exactly like that by both the greedy 'railroad people' and the military), exciting and all around entertaining. I and the rest of the audience laughed at so much of the creative dialogue. Kudos to the writers. I had read about it being 'boring' mid movie. It never happened. The professional critics expected it to be the old radio or TV series rehashed.  Fortunately, it is not.  It was a new, wonderful, all around enjoyable movie.  PLEASE let there be a sequel...",
      "total_reactions": 1,
      "user": "acovello28"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "I can't understand why this movie got so many rotten critic reviews.  Because of those reviews, I had to have my arm twisted in order to see it, and, boy am I glad I saw it!  It is a truly clever and funny movie, it never drags, and it has a strong ending.  Easily my favorite movie of the year so far.",
      "total_reactions": 1,
      "user": "MMilton"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "How is this a bad movie?  It is a great movie with action, humor and more.  Johnny DEPP!  That explains that it is a great movie.  It is epic.  Will beat dick sucking movies like HER>",
      "total_reactions": 1,
      "user": "ChespinJ"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "No entiendo porque tantas criticas negativas... La película no es perfecta, pero es super entretenida, la primera hora es brillante, las secuencias son geniales, la hora y media que resta después tiene sus fallos, pero no son horribles, y la secuencia final del tren pff... increíble. No juzguen ni se dejen llevar por las criticas sin antes de ver (ese fue mi error).",
      "total_reactions": 1,
      "user": "JohnMasterL"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "The Lone Ranger seems to me very misunderstood.I love this film so much,it has great visual effects,cast and score.What more could you ask for ? Also let's not forget the very good and strong story line that absolutely keeps you invested on the movie until the very end.And the action is great too,especially one particular scene in the end that is very awesome.",
      "total_reactions": 1,
      "user": "GentM2015"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "We've been looking forward to the movie's release ever since a visit last summer to the town of Creed where portions of The Lone Ranger had recently been filmed. Usually when my expectations are high my disappointment is inevitable. I broke my own rule and read some of the critiques before I saw the movie which mitigated my expectations some. Bottom line... As a family friendly summer flick I found it thoroughly enjoyable. My family like it even more than I did.",
      "total_reactions": 0,
      "user": "gunnyart"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 2,
      "text": "The Lone Ranger is flawed in many ways. It seems that a wrong strategy has been applied from the beginning of the production. Combining the elements of comedy and fantasy with a very bitter and realistic story has chocked the movie. Unless the first and last sequences, the film's dramatic background doesn’t allow the inclusion of elements of parody, and the Mr. Verbinsky's efforts, who has already succeeded to make a perfect parody of western movies (Rango), fails. At the center (in the core) of The Lone Ranger lies a western in classical form, devoid of fantasy or Humorous arrays, that in current shape is buried beneath a mass of unfunny jokes, inappropriate special effects, undeveloped relationships between characters and numerous and futile Occurrences.",
      "total_reactions": 0,
      "user": "homandavoodi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2014
      },
      "score": 6,
      "text": "Not that bad. It's not perfect, but the movie has a lot of potential and is definitely better than the last few \"Pirates of the Caribbean\" movies. I wasn't expecting much considering the negative reviews and my lack of love for every \"Pirates of the Caribbean\" movie after the first, but overall while flawed the movie is still a decent, but non-essential watch. There are a lot of better ways to spend your time, but there is some fun to be had here.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "I understand why critics don't like this movie:  It mixes legend with comedy.  Legends are supposed to be serious, and comedy an incidental, momentary intermix if allowed at all.  Another movie, also a western, that moved the needle way over to comedy was \"Wild Wild West\" (1999), which was criticized for many of the same reasons.  More troubling for \"The Lone Ranger\" is that Tonto, the most serious and taciturn character in the original Long Ranger legend, is now the main protagonist and jokester.  And on top of that is the magical conversation between an ancient Tonto and a child, which arguably was dispensable to the plot.  All of this is not what the audience expected.  Does that mean it's bad?  Is it fundamentally flawed, the way some people feel about opera (or Broadway musicals)?",
      "total_reactions": 0,
      "user": "DLWilson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2014
      },
      "score": 0,
      "text": "Bar none, the second worst movie I have ever seen.  Like \"The Amazing Spiderman 2\", it tries to be funny and serious at the same time and fails miserably at both.  I forced myself to watch it to the end just to make sure the awefulness would continue up to the last scene.  It did.",
      "total_reactions": 0,
      "user": "Spanky"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "I'm not familiar with the original material this film is based on, so I cannot say how close or far off it is to/from that.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Great movie. I swear to god reviewers are trash..if it's not Oscar-bait they call it trash and people latch on to the reviews which just aren't made for us. It's a fun, summer, action movie made Disney style and it does it's job very well. If you can't handle that then the movie isn't for you but it has lots of great action sequences, memorable characters and some very funny parts.",
      "total_reactions": 0,
      "user": "ozlacs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 4,
      "text": "It isn't very good. But that does not mean that it doesn't have some cool entertaining scenes. It does not, however, live up to the \"Pirates of the Caribbean\" series. The script is pretty bland and its runtime is too long.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "I don't understand why the critics thought it was so bad (apparently 300 don't either). It was a god movie, and I wish it didn't do so horribly at the box office. It was action packed and hilarious. Why the heck were the critics so harsh.",
      "total_reactions": 0,
      "user": "mrmonster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2017
      },
      "score": 7,
      "text": "Championed by director Quentin Tarantino and noted film critic Matt Zoller Seitz as a prime candidate for re-evaluation, I must say that I agree. With an knack for being over-the-top, The Lone Ranger may drag in spots, but is a tremendous time with audacious action set pieces at every turn. The soon-to-be-famed train sequence at the end and the opening sequence on a different train are phenomenal. While the middle could be a bit better and the film does go on for far too long, The Lone Ranger is a fun film that feels like a throwback to the bombastic days of 1970s and 1980s blockbusters. Channeling childish energy and a sense of childlike wonder for the mystery of the film's hero, director Gore Verbinski creates a blockbuster movie that is out of place in year 2013.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2013
      },
      "score": 4,
      "text": "Disney goes all in with \"The Lone Ranger\" in the hopes of creating another successful franchise similar to that of  \"Pirates of the Caribbean,\" by reuniting director Gore Verbinski, producer Jerry Bruckheimer, and Johnny Depp. However, it becomes readily apparent Bruckheimer is attempting to launch a new Western fantasy franchise (with a price tag hovering around a quarter of a billion dollars), by simply cloning his previous lucrative endeavor. \"The Lone Ranger” suffers from an overly elaborate plot that contains a muddled sense of humor peppered with moments of out-of-place violence. The movie has an encouraging start, but slips into a lethargic second act, and ultimately ends as an overblown mess that goes on far too long.",
      "total_reactions": 0,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "It's very 'Pirates' but that's not a bad thing as I was obviously highly entertained  Visually there is plenty here to keep you amused and thanks to characters like Depp and Hammer you are never bored. As long as you keep reminding yourself not to take it too seriously you should enjoy this movie like I did. It is probably a little longer than it should be but other than that there is little to pick on what is pretty much nothing but a fun ride of a film!",
      "total_reactions": 0,
      "user": "survivorfan989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 6,
      "text": "Possibly the hardest movie to critique I have ever seen, I can't decide whether I think this is Rotten or not! 60% of the movie is Johnny Depp playing the same character he always plays and out of place euphemisms, while the other 40% is a ridiculously entertaining but unintelligent action movie full of huge machine guns and trains which can defy the laws of physics. Every time that unforgettable and universally recognised  theme song comes on you start enjoying it and then it goes back too Johnny Depp being the same unfunny character he always plays and Armie Hammer being quite annoying actually. I'll give it 3 stars because of how amazingly enjoyable the action sequences are.",
      "total_reactions": 0,
      "user": "python2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "It´s decent. It´s not as bad as everyone wants to make it seem, and not not too good either. Great things are some amazing and fun action scenes, the cinematography and the score (Hans Zimmer as always doing a great job). Overall it´s entertaining, which makes it get a pass from me. But there are some really bad things. Jonny Depp character is just too silly and his acting here is not good. Armie Hammer does a decent job (in fact I checked this movies thanks to him, I really liked his performance in Clint Eastwood´s \"J. Edgar\" with Leo DiCaprio). And there are too many silly moments mixing modern things with how the world worked back then. It doesn´t work. Still a fun watch.",
      "total_reactions": 0,
      "user": "sanyrub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "The performances are good, but the story is uninteresting and completely illogical, action kicks in and its kinda fun, humor is way overused and the movie is absurdly large, not as bad as critics say but it's not that good either.",
      "total_reactions": 0,
      "user": "ReviewZone212"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2014
      },
      "score": 1,
      "text": "The DVD came out and I thought, \"Well, maybe this movie has been over-reviewed and it simply cannot be as bad as it has been reviewed.\"   It is!   Throughout the entire forty minutes I could stand watching this thing I could just here the writers and actors and crew laughing together and saying, \"This is really funny.\"  It isn't!",
      "total_reactions": 0,
      "user": "BogKid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "I loved every minute of it.  The movie has a nice pace... seems many people are missing the point that is how The Lone Ranger became the legend that still is nowadays. How the story unfolds is wonderful. The climax is so amazing, that I was at the edge of my seat. A great adventure movie.",
      "total_reactions": 0,
      "user": "Rick_Masters78"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2014
      },
      "score": 4,
      "text": "This is another of those films that seem to only feed the ego of it's director...",
      "total_reactions": 0,
      "user": "Inlikeflynn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2013
      },
      "score": 4,
      "text": "pelicula ser tonta y predecible. the lone ranger es algo desaprovechado, pues se torna aburrida es algo ridiculo Jhonny depp y las cosas no salen bien despues de un impactante trailer, la descepcion quedo clara con 2:30 horas de intentar hacer valer un muy mediocre trabajo",
      "total_reactions": 0,
      "user": "Jmsbpp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2013
      },
      "score": 3,
      "text": "Instead of making it a comedy they should of made it an action/western that would of been better than this thing. The main actor has no personality what so ever and other characters aren't much different. I don't know didn't like it at all.",
      "total_reactions": 0,
      "user": "Tessara_Vejgan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "A movie gets hated by critics by loved by me let me say the action the soundtrack and the whole style of the movie was great Johnny Depp shines a light as Tonto great with humour and Armie Hammer as the lone ranger he was good little stupid at times but still it just a movie the only downside to this is red just get her out of the film a together get if you like pirates 1 2 3 & 4 just leave this movie alone",
      "total_reactions": 0,
      "user": "josephjacob3232"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "2 and a half hour movie that could and should be a hour and a half hour movie. They try to make the mask a symbol but fail trying. And by the end im not even sure who im rooting for.",
      "total_reactions": 0,
      "user": "Lansdenrs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "Um dos melhores filmes da Disney,Gore Verbinsky tem grandes êxitos feito,porém apenas três foram reconhecidos Pirates of the Caribbean: The Curse Of The Black Pearl 2003,The Ring 2002 e Rango 2011,deveriam reconhece The Mexican 2001,Pirates of the Caribbean 2: Dead Man's Chest 2006 e The Lone Ranger embora Pirates of the Caribbean 3:At Worlds End 2007 seja ótimo também.",
      "total_reactions": 0,
      "user": "LoRevisor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2013
      },
      "score": 3,
      "text": "I'm a little late with 'The Lone Ranger', but better never than late! Not only did the movie fail to examine themes of greed and racism (issues that were tailored for this kind of material), it failed at telling a good story, period. I thought the story was poorly framed. The constant back and forth between Tonto’s (Johnny Depp's character) retelling of the tale of the Lone Ranger to a precocious boy, always drew us out of the main story line. Johnny Depp's heavy makeup and oddball shtick is getting tired now; and the chemistry with Army Hammer’s Lone Ranger fell flat. As we've seen with the Pirates of the Caribbean movies, Gore Verbinski is no stranger to staging elaborate action sequences; but here, the action feels even more implausible and spans for way too long. This brings to the length of this movie, which has no business being 150 minutes! A leaner runtime and tighter narrative would have definitely lightened my eyelids. The only thing I truly admired about 'The Lone Ranger' was the quality of the production value. The character-centric costumes, production designs and sound designs gave it a top-notch quality that you've come to expect from big budget studio films such as this. Too bad the brain doesn't match the muscles. This dud will only be remembered for being one of 2013's biggest flops.",
      "total_reactions": 0,
      "user": "Prodigy2013"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2014
      },
      "score": 3,
      "text": "Another unique character portrayed brilliantly by Johnny Depp. In this case though the character is placed inside a world and story that lacks any real impact. All the characters around him are scapegoats who are just there for presence. It's a film that is easily forgettable despite fresh innovations. Don't watch this one in a hurry.",
      "total_reactions": 0,
      "user": "callumjsouth"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "It is a treat when Hollywood decides to remake an icon that has been in society's core for decades. The Lone Ranger has been seen both in TV and in books for children. From memory, the legend of the Lone Ranger was about a masked outlaw who was a heroic idol against crime and corruption in the Wild West, aided by his Indian sidekick Tonto. Gore Verbinski's take on such a figure seems more or less inclined to flip the coin. This is hardly surprising, Johnny Depp, in a supporting role? Horsehockey! The man can immerse himself into any role. He very well could have played the Lone Ranger (despite his age), but appears more suited in out of the ordinary characters like Tonto. I am sure some people will find it offensive that a white man portrays an Indian (it has been done before). Even so, Depp brings a fresh breath in his performance as Tonto. He is matter-of-fact, the voice of reason in the movie, and yet funny with his dead pet bird and deadpan delivery of one-liners.",
      "total_reactions": 0,
      "user": "Mothman225"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2015
      },
      "score": 7,
      "text": "This movie was better than I expected since I knew it had gotten a lot of bad press when it was in theaters. However, it turned out to be pretty good.",
      "total_reactions": 0,
      "user": "morfil"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "I can not believe the criticism about this movie was excellent mourn me laugh, and it was extremely fun the critics do not know watch movies today. they just want money",
      "total_reactions": 0,
      "user": "Osakawath"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "To save this movie from the horrid reviews of critics, I felt the need to make a review myself, I promise I'll try to make it brief (this is my first review, mind you).",
      "total_reactions": 0,
      "user": "Ganwho"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "Dramatic scenes mixed with poor humour (e.g. brave Indian warriors are decimated by the army machine guns and then we see Tonto wondering how his horse climbed on a tree), Depp playing like a wooden totem, fights which look more like a circus show, needless scenes (such as the search in the brothel) and a ridiculous hero (he acts like an idiot or follows lunatic Tonto) ‘Lone Ranger’ was almost painful. Besides, it’s idiotic that the protagonist claims to be an atheist and at the same time he is a fan of John Locke’s work: doesn’t he know that Locke’s philosophy is based on the idea that the human being is created by God? That’s why it has an immense value, objectively, and to protect and honour that value the human rights exist. It’s no coincidence that only Christian societies invented constitutions that treated people with dignity (and then other societies followed their example).",
      "total_reactions": 0,
      "user": "Dimitris01"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "From the basic stories..then now i know how the American became rich and the indian become nothin' ..",
      "total_reactions": 0,
      "user": "endonesearaya"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "This was a very cool movie, an do loved it very much. I have always loved the lone ranger, and armie played him very well. Johnny depp also portrayed to to quite well. Tis movie satisfied me very well and I hope there will be a sequel equally as good.",
      "total_reactions": 0,
      "user": "Theloneranger"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2014
      },
      "score": 8,
      "text": "The Lone Ranger is a much better movie than the critics give it credit for.  (As it's also indicated by a solid user score) Let's get the negative out of the way first. The first hour and a half was just a bloated setup.  It could have been done in half that time.  That's where the 2 points I knocked off came from.  The final 45 minutes though are as entertaining a movie can get.  It was fun and funny. I would give this a 10 if they trimmed the first 90 minutes into 45-60 minutes and then leave the final 45 minutes as is and you have a classic on your hands. I highly recommend this movie!",
      "total_reactions": 0,
      "user": "RevWynn85"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "I would see it again  My boys are running around pretending to be the Lone Ranger and Tonto. The action was great and the characters comical. Johnny Depp is always entertaining in anything he does. Disney did not disappoint in this BIG time old fashioned family fun movie we all enjoyed!",
      "total_reactions": 0,
      "user": "jjennibean86"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "Hate to disagree, but this movie is a finely tuned work of art. It puts together the best elements of this story and adds in some historical significance of how Native Americans were treated during that sad part of our country's history. Plus, there has been some excellent attention to details like Native American humor and Native American perspective. Of course it is a fairy tale, but it has all of the beauty of the best tales as well as great action, human drama, hilarious comedy, and a very good 'moral of the story'.",
      "total_reactions": 0,
      "user": "TruerThings"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "The Lone Ranger is an awesome movie that do what it suppose to do, entratain. Even being a 2.5 hours movie it does not feel like it as its filled with great action and fun moment. Armie Hammer has been totally underrated on his films but he does a great job as an action/humor actor.",
      "total_reactions": 0,
      "user": "Ramies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "I genuinely really enjoyed this movie. One of the most enjoyable and touching films I have seen in a long time. Johnny Depp was spectacular. There was always something happening behind his eyes and straight from the get go, the first time you see him on screen for this film you know youll be in for a touching journey.",
      "total_reactions": 0,
      "user": "imjoedavidson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "Not as bad as critics make it out  remember the story is told through an old Tonto, hence the \"Unreliable Narrator\" formula common in literature.",
      "total_reactions": 0,
      "user": "white_whirlwind"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "Gore Verbinski showcased his status as Disney's go-to guy for summer blockbusters by collaborating once again with his long time favorite actor Johnny Depp, but this time dressing him up as a native American rather than his usual pirate attire. However, while trying to deliver a fun, witty and smart film that pays tribute to the original source material, Verbinski fell short in these aspects. As much as I enjoyed the Pirates of the Carribean movies, I felt that this movie could have been handled in a better way.",
      "total_reactions": 0,
      "user": "snickersveluz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "Gritty and entertaining, but the lone ranger suffers from cheesy dialogue and an uncreative story, but if you are looking for a two and a half hour thrill ride look no further",
      "total_reactions": 0,
      "user": "Bradyboy12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "This is an average Disney movie. The story is good,the characters are okay but cartoonish at times and the action is good. I know a lot of people hate this movie and I can see why, but personally I thought it was ok.",
      "total_reactions": 0,
      "user": "LTR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "critics naturally get paid to critizise stuff. so a critic who would say \"hmk 264th movie of johnny depp is still great\" would do a bad job. instead a good job does the critic who critizes against all odds. what else should he do?  still a great movie. but i have to admit johnny depp really saves the day.",
      "total_reactions": 0,
      "user": "th4nat4t002"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "Amusing little movie, once again completely carried by Johnny Depp.",
      "total_reactions": 0,
      "user": "ArjanS87"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "Not bad, but not stellar. Johnny Depp is the main drive, even though the whole script is convoluted and it's pacing droning on. But you can see it once and like it, see it twice and be done with it.",
      "total_reactions": 0,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "i went into this film blind as I had no idea of the critical reviews or box offices losses.   All I can say is that I really enjoyed this movie and it was exactly what I expected  like the Mummy and Pirates and Raiders franchises.   Immediately after watching it I checked to see if there were sequels in the works.   I give it a ten for delivering exactly what it promised.",
      "total_reactions": 0,
      "user": "scottawan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "This film was fantastic!  It perfectly captured what I liked best about the old TV show.  The Lone Ranger is a condescending ass that Tonto and Silver have to save time and again.  It becomes and inside joke that we the audience are in on.  Why do they keep helping him despite his \"better than you\" attitude.  Because his heart is in the right place.  Tonto is wise, patient and witty.  Johnny Depp was excellent in the role.",
      "total_reactions": 0,
      "user": "KittyClose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "Bolstered by strong performances, brilliant visuals, and witty one-liners, The Lone Ranger is a satisfying popcorn flick, but is rather scattershot and disjointed.",
      "total_reactions": 0,
      "user": "sammurphy66"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2013
      },
      "score": 1,
      "text": "I must take exception to some of the reviews posted by my fellow cinema goers. As someone who has enjoyed Johnny Depp in everything I had seen previously, love westerns, and grew up watching The Lone Ranger, I was eager to love this film. However, its just a mess. Worse western Ive seen since the remake of 3:10 to Yuma and thats saying a lot.....",
      "total_reactions": 0,
      "user": "Cam1010"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "Critics are haters. They're like blood-thirsty vampires. They feed on negative energy. This movie was actually very good, and I loved watching Johnny Depp and Armie Hammer working together as a team. The film is not nearly as bad as critics suggest, even though I have a few objections over the cannibalism and sexual undertones the movie had, since kids might have been watching. However, there are also some very humorous scenes between Depp and Hammer in the movie. Overall, I enjoyed this movie and hope there will be a sequel, though it seems unlikely. I would purchase this movie on DVD, as it very good.",
      "total_reactions": 0,
      "user": "AGarcia732"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2014
      },
      "score": 6,
      "text": "Quite shallow in storyline. But still great performance by Johnny Depp. Overall an -ok- movie and might be enjoyed by some fans. Needs a better storyline...",
      "total_reactions": 0,
      "user": "TheGreatJoker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "I'm not a fan of the so-called \"Spaghetti Western\" genre.  I've only known the Lone Ranger franchise from a piss-poor foreign adaptation (HINT: It's from a Southeast-Asian country) of an American franchise.  Even if Johnny Depp was the selling point of this movie, Armie Hammer delivered a convincing Lone Ranger performance.",
      "total_reactions": 0,
      "user": "CLS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "Maybe misunderstood by most in their expectation of finding yet another (monotonously boring?) rendition of blazing gun super hero know all conquer all movies, but in stead being confronted with a quirky turned on the head version of the traditional? Who is the real hero? I found Depp to be classic Depp. Hammer does justice to a difficult \"understated hero\" role. Patronizing, quirky, funny, a worthwhile watch. Although, as a mainstream general superhero movie, most probably not the one to watch. I say thank you, thank you, thank you that some producers still have the guts to discard the tried and tested muffin recipe and come up with something different and fresh to entertain me.",
      "total_reactions": 0,
      "user": "jwgeustyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "great movie,i was smiling and laughing with the kids in the theatre all the time,some of my friends saw the negative reviews and were sceptical,but they changed their opinion after seeing it.",
      "total_reactions": 0,
      "user": "betgold"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2014
      },
      "score": 6,
      "text": "In Theaters:",
      "total_reactions": 0,
      "user": "exhibe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "Owen McKenna Rio Rancho, NM. Although the film strayed from the storyline of the TV series, I thought the film was entertaining, just not what I was expecting. Johnny Depp brought life to Tanto, as he does with most of his characters. Overall and enjoyable Disney creation.",
      "total_reactions": 0,
      "user": "OwenMckenna"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2014
      },
      "score": 1,
      "text": "Lead actor was by far the worst lead actor I've ever watched. Johnny Depp was in his usual quirky self. Which is becoming a bore to me. The only thing that fit in this movie, is the villain. Everything else is just forgettable.",
      "total_reactions": 0,
      "user": "gmnz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "The Lone Ranger definitely has its ups and downs.  Personal preference may alter peoples impression of the film, but it is hard to deny that this film is filled with indecipherable sequences that seem as if they were made to be pieced together by the viewer for no apparent reason.  It is a simple story that is told in a confusing fashion, and a movie that could have been presented in 1 to 2 hours is presented in a fat 2 and a half hours instead.",
      "total_reactions": 0,
      "user": "Treebeard"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 5,
      "text": "Richard Roper is right! This is the most train-wrecked movie I ever saw in my life. I Mean, Why Would it be an Oscar nominee for make-up? this was loud, Digital Explosions and terrible music!",
      "total_reactions": 0,
      "user": "IMAX500"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "This movie is a tribute to childhood afternoons spent watching westerns, and then playing outside with cap guns and cowboy hats, and as such I think it succeeds perfectly.  I think that it perfectly captures the spirit of those old cowboy shows, while being smart enough to also poke a bit of fun at them, but earnest enough to also capture that childhood magic. You can fully expect a six-shot revolver to never run out of bullets until it is dramatically convenient for it to do so, a faithful horse that will magically appear at just the right place and time when its needed (um, even if that means showing up \"Santa Claus style\"),villains with the blackest of hearts, and at least one overly gratuitous exploration of the \"ricochet\" concept. If you're looking for a \"grown up\", \"mature\" re-telling of \"The Lone Ranger\" then forget it; this is a celebration of childhood, of everything that was great and awful in those old cowboy shows. So put your cynical, grown-up, critic goggles away, grab a bag of peanuts, and just enjoy the show!",
      "total_reactions": 0,
      "user": "amishrobots"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2014
      },
      "score": 2,
      "text": "must say i didn't like it at all!!!! so boring it was and Johnny Depp's performance was so disappointing!!!!",
      "total_reactions": 0,
      "user": "CiaranMcDaid12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "I sat down to watch this movie and said \"ok let's see why the critics gave this movie such bad reviews\" and at the end, I still didn't know why it got ripped apart. This movie is fantastic. The story is gripping and provides a lot of depth. Disney utilizes the 2.5hrs the way they should be. If this movie was an hour shorter, it would feel like a rushed and muddled mess but it takes it's time and at no points in this movie did I say \"this is boring\". I am a sucker for movies with well written stories and this one delivers. Every actor and actress is perfect for their role and the story doesn't take a back seat to a shoehorned in love story (which is always refreshing). The only reason I give this a 9 instead of 10 is because I think it would have been marginally better if the kid in the fair thing wasn't in there but The Lone Ranger in no way is a bad movie.",
      "total_reactions": 0,
      "user": "MikeB618"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "Gore Verbinski's 'The Lone Ranger' is one of the most overlooked and under rated movies to come out in the past few years. Armie Hammer is memorable as the titular character, who evolves from a mild mannered city lawyer to a rogue dispenser of western justice aided by a Native American outcast. Tonto, a character that Johnny Depp makes into his own, is also a refreshing satire on the \"Noble Savage\". I would also say Depp's controversial performance as Tonto is much more nuanced to counter Quentin Tarantino's more cynically written, blaxploitation-inspired characters in films like 'Django Unchained' & \"Hateful Eight\". But while Quentin took inspiration from the drive-in classics of the Grindhouse era for his western themed films, Director Gore Verbinski attempts to emote the brisk, adventuresome, zest of Sergio Leon's \"Duck You Sucker!\"  while also infusing it with the modern novelties of a big budget and big effects. \"The Lone Ranger\" is both a wonderful homage to the western genre as well as a genuinely entertaining tale of the Wild West itself.",
      "total_reactions": 0,
      "user": "NotoriousFraud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "Çizgi filmine hem hikaye hem de ortam olarak sadık kalınmış ve ortaya uzun ama çok güzel bir film çıkmış , devamı da gelecek muhtemelen. kısacası hala izlemeyenler varsa bir şekilde izleyin tavsiye ederim.",
      "total_reactions": 0,
      "user": "MrBlackTron"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "I want to like the Lone ranger I really do but this film fails so much. the actors are really not suited to there roles especially  Armie Hammer as the title character and while Johnny Deep gets a good line every once in a while his Tonto seems way too close to his Jack Sparrow performance. some of the action sequences towards the end are good but with the film being too long and overcomplicated it's too little, too late",
      "total_reactions": 0,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "We Get To See A Nation of Thieves At Work! While the Lone Ranger succeeds in maintaining a great sense of humor throughout, and never takes it's self too seriously, this film is still able to convey some incredibly powerful messages that need to resonate with more people.",
      "total_reactions": 0,
      "user": "DannyG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "\"The Lone Ranger\" 10 Scale Rating: 4.0 (Bad) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "....................................................Super Subestimado......................................... Pelos críticos ......... Imbecis................................. E fudido na blilheteria .............................. Pelo públicos imbecis  ................. e ingratos",
      "total_reactions": 0,
      "user": "Zanessa250QI"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2015
      },
      "score": 10,
      "text": "litlle tedious sometimes    but have so much much of the best scenes of action in train    very good masterpieces train scenes...",
      "total_reactions": 0,
      "user": "sicrano"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2015
      },
      "score": 5,
      "text": "Bottom line: The Lone Ranger is fine as long as you don't expect anything more than a Western on par with Pirates of the Caribbean.",
      "total_reactions": 0,
      "user": "GregePorter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2016
      },
      "score": 10,
      "text": "..........................................................................................................................................................Very good Written Very Good Acting and Direction",
      "total_reactions": 0,
      "user": "clinteastwoo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2016
      },
      "score": 5,
      "text": "The Lone Ranger is a pretty mediocre film. The script isn't the worst thing in the world, even though it does forget about some plot points. The acting is pretty sub par all around. However, the payoff at the end of the movie is quite fun.",
      "total_reactions": 0,
      "user": "The3AcademySins"
    }
  ]
}