{
  "mc_avg_user_score": 6.2,
  "mc_metascore": 55,
  "mc_mixed_rating_frequency": 39,
  "mc_movie_name": "The Eagle",
  "mc_negative_rating_frequency": 9,
  "mc_positive_rating_frequency": 38,
  "mc_pro_critic_reviews": [
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 83,
      "summary": "The story and setting may be ancient, but under the direction of Kevin Macdonald (The Last King of Scotland), and with a nicely textured screenplay by Macdonald's Scotland coscreenwriter Jeremy Brock, the vigor is fully modern."
    },
    {
      "critic": "Michael Wilmington",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 80,
      "summary": "Exciting and even moving, this robust epic is filled with action, male bonding, and a terrifying sense of wilderness."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 80,
      "summary": "Do you like movies about gladiators? Well, lend me your ears: The Eagle will more than gratify your sword-and-sandal cravings."
    },
    {
      "critic": "J. Hoberman",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2011
      },
      "score": 80,
      "summary": "The Eagle is full of action and fleet of foot-it's a movie of smoky, lowering battlefields and trippy, space-bending flashbacks, pausing only for admiring location shots of Scotland's wild, craggy vistas."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "An honest, basic story set forth with brevity, skill, care and intelligence."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "A rip-snorting adventure tale of the sort made before CGI, 3-D and alphabet soup in general took the fun out of moviegoing."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 70,
      "summary": "The Eagle is furiously unsettled-thematically, temporally, meteorologically. Wild-eyed, long-haired Brits leap atop the Romans' shields as the soldiers blindly hack away, the bodies so close that you can barely tell the victor from the vanquished. The battles in the fog and rain have a hallucinatory power."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2011
      },
      "score": 70,
      "summary": "The Eagle is an engaging, if straightforward and one-dimensional."
    },
    {
      "critic": "Brian Lowry",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2011
      },
      "score": 70,
      "summary": "While the movie doesn't wholly succeed, there's enough to like here -- including Channing Tatum's credible performance as a tradition-bound Roman soldier."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 67,
      "summary": "Yes, The Eagle is as bad as it sounds but also entertaining, in a \"Mystery Science Theater 3000\" sort of way that Macdonald didn't intend."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 63,
      "summary": "It's pure speculation on the filmmakers' part that Gaelic pagans were adorned with bones, blue mud and Mohawks, but the fire-dancing spectacle is a welcome respite from the beefcake of the journey scenes."
    },
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 63,
      "summary": "Though not deep, the movie is diverting."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 63,
      "summary": "The Eagle becomes more interesting the further north it travels."
    },
    {
      "critic": "Kerry Lengel",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 60,
      "summary": "The many battle sequences, though carefully detailed, are lacking in energy and originality. There is some ambition here, but the results fall short."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2011
      },
      "score": 58,
      "summary": "However you slice it, The Eagle is hokum, but modern-day Scots may get a kick out of the film's depiction of their ancestors as mud-caked hellions. Modern-day Romans will have to settle for less."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "McDonald's film never really finds its footing -- and The Eagle never takes flight."
    },
    {
      "critic": "Stephen Cole",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "They're not much company, our Marcus and Esca. But there we are, mucking through crazy Scotland with them."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "A hodgepodge of bits cribbed from such films as \"Centurion,\" \"Apocalypto,\" \"300\" and \"Gladiator.\""
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "Through it all, Tatum tries like crazy to Act. His eyes pinch. His brow scrunches. Most of all, he clenches his jaw, little creases of muscle flexing below his ears as he labors to emote."
    },
    {
      "critic": "Sheri Linden",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "Plays it straight down the middle, neither pushing its contemporary vantage point nor embracing the chance for B-movie glory."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "Lumbering along for a bit less than two hours, which passes like three, it feels more like a chore than like an adventure."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "Part of the trouble is casting. This is a movie that needs a great or gonzo performer to give it depth or heft."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "The formalities of the period dialogue and a wavering, inexplicable accent test him (Tatum) beyond his limits, and the film isn't thoughtful or original enough to survive it."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "Bastardizes the source material to no good purpose, ending up with a strained combination of rah-rah, boy-bonding adventure and p.c. cross-cultural exploration."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "A mildly engaging and roughly historical action picture."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "Aside from the thin characterizations, The Eagle never manages to convey the importance of the heroes' quest."
    },
    {
      "critic": "Elvis Mitchell",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "What he's missing in The Eagle is that spark of the insane - the slightly lunatic fever that makes us unable to keep our eyes off him (Channing Tatum)."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "Manages to deliver a striking, nicely detailed, visceral thriller built on a corny, old-fashioned script."
    },
    {
      "critic": "Helen O\\'Hara",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2011
      },
      "score": 40,
      "summary": "Good fight scenes, but a confusion of plot, culture and accents make this a lesser example of the sword 'n' sandal epic."
    },
    {
      "critic": "Steve Ramos",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2011
      },
      "score": 40,
      "summary": "The storytelling falters throughout and The Eagle, despite its grandeur."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 40,
      "summary": "This old-fashioned sword-and-sandal drama has all the bread and circuses we've come to know from the movies. It flirts with interesting story choices, but ultimately, all roads lead to boredom."
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 38,
      "summary": "Nothing more than an action-packed bagatelle masquerading as history."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 38,
      "summary": "A long slog through ancient muck, so-so sword fights and dumb luck."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 38,
      "summary": "What it became was bad. A movie that hopes to blend \"Lethal Weapon\" with \"Gladiator\" winds up not being a fraction of either."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "I don't know about you, but im often bored of the formulaic samey slow motion action flicks that seem to be churned out (and hey i really enjoy a good action flick). Id class this as more of an action/ adventure - interestingly shot, and with a great atmosphere - which sticks surprisingly well to the plot of the book - helped by some decent acting.",
      "total_reactions": 2,
      "user": "Panzerfaust101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2011
      },
      "score": 6,
      "text": "I'll simply say that Shiira's review (below) is awesome.  Long-time user reviewer on the site - excellent work.  I enjoyed the movie, but scoring it is tough. It seemed to have some pacing problems, but the tone and feel of the movie were pitch-perfect.  Tatum was born to play the role, and Jamie Bell is perfect as the slave-turned-friend.  I don't think I'd easily recommend this film to friends, but I enjoyed it.",
      "total_reactions": 1,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "No mincing of words, this slave, who tells the Roman centurion in second century terms that he doesn't want to be friends. No uttering of thanks is coming forth from the northern tribesman, this Caledonian lad, only vitriol, which has been compounding itself over the intervening years with new each new increment of loss life at the hands of his people's long-standing enemy, \"The Empire\". \"I hate everything you stand for but I must serve you,\" Esra(Jaime Bell) begrudgingly tells Marcus(Channing Tatum), the day after the Roman saves the slave's life in the amphitheater, where the centurion prevents a one-sided gladiator match from taking place. Possessing the power to determine life and death, Marcus gives the thumbs up sign, swaying the other spectators to do the same, therefore sparing Esra from being hacked to pieces by an executioner-sized man swinging an executioner-sized axe. It's the young boy's lucky day: a pacifist Roman? Was there such a thing? No. This is an anachronism. The Romans were as bloodthirsty as they come, an unconscionable bunch. \"You have stolen our lands, killed our sons, and defiled our daughters,\" shouts the spokesman of an angry mob, who hold Marcus' patrol hostage, and instigates a fight in which we gravitate toward the centurion, and root for his survival, even though we know the Celtics have a right to their rage. The politics in \"The Eagle\" is tricky; it's pro-Imperialism. These Roman soldiers were depraved and incorrigible, responsible for countless crimes against humanity, and yet the filmmaker has the audience backing up this omnipotent regime in their attempt to signify their imperialism by capturing the legion's eagle standard back from the Seal People, a Pictish tribe up north. Against the backdrop of an unofficial holocaust, \"The Eagle\" has the gall to concern itself with Marcus' angst, the shame he inherits from his militaristic father, who twenty years earlier, lost a campaign against the Seal People, in which the Legio IX Hispana(Ninth Spanish Legion) and its gilded bird went missing.\"The Eagle\", based on the 1954 historical adventure novel \"The Eagle of the Ninth\" by Rosemary Sutcliff, is a throwback to that unenlightened era, whose denizens still subscribed to the manifest destiny principle, as it was reflected in its racist westerns, where Indians were slaughtered wholesale by cowboys without the moviegoer ever batting an eye. In Esra, the film has in its employ a morally compromised character to fulfill the retrogressive ideology of the movie. At the killing grounds, where the elder Aquila's legion was slaughtered, we're supposed to be horrified by the brutality enacted by the tribesmen, who, according to Guern(Mark Strong), a legionnaire survivor, had  \"hacked the feet off the dead so they couldn't walk in the afterlife.\" His words strongly recall those of Ethan Edwards(John Wayne) from John Ford's \"The Searchers\", a rhetoric that forces the moviegoer to associate the racism of the cowboy with the Scottish rebels, which positions the Romans as Indians, the victims of a despicable act, and the Pictish tribes as cowboys, the cold-blooded killers. Although the slave is prejudicial toward the Roman Empire, whose waves of marauding armies had decimated so many families like his own, the orphan joins forces with Marcus, adopting and internalizing the centurion's quest for familial redemption, and the moviegoer is supposed to accept this unilateral shift in loyalty as a byproduct of the deepening friendship between the two disparate men. That's because \"The Eagle\" merely tells us about the violence that the Romans practiced on the the wild Brits, whereas the film shows us Roman skulls, Roman bones, which has a visceral impact on Esra, we assume, since it has a visceral impact on us. Rome ends up looking like the victim. \"The Eagle\", in actuality, a western dressed in a historical epic's clothing, reimagines a \"Dances with Wolves\" that dances with hunters, where the Indian lives in isolation among the American soldiers and participates in the genocide of its own people. In a nutshell, that's what Esra does when he befriends Marcus. Marcus is like Dunbar, the union soldier played by Kevin Costner, in which the centurion has the same innate kindness and humanity, but here, these benevolent attributes are in service of the colonizing faction. \"The Eagle\" sides with the empire by overemphasizing the barbarity of the indigenous people(just like an old western), most emphatically, when the Seal father slits the throat of his young son after he allows the prisoners to escape. This indescribably cruel act gives Esra the impetus to remain with his natural born enemy. By becoming a Roman, he'll become civilized.",
      "total_reactions": 1,
      "user": "Shiira"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "Messy plot + pointless cause=Horrible Movie. The Eagle + good writing=what the f*ck are you thinking. One of the worst films ever.",
      "total_reactions": 2,
      "user": "TheGeographer52"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2011
      },
      "score": 3,
      "text": "This movie sucks, it was just that boring, and am actually surprised it got such a high rating on here, 56 is a huge stretch. I got dragged into this movie because I did not want to see The Roommate. I came into the movie with no hype or anything and expected an alright movie, and all I got was a drool fest, generic, piece of **** acting movie.",
      "total_reactions": 3,
      "user": "Intact"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 6,
      "text": "The Eagle feels a little amateurish in parts.  The acting and writing is not stellar, and the battle scenes with the camera moving all over the place is ridiculous.  You cannot tell what is going on during the battle scenes.  However, I did feel there was good chemistry between the two leads, and the main crux of the story is the loyalty and trust between master and slave.  The best part of the movie is when they are captured by a barbaric tribe, and the master becomes the slave and vice versa.  It can be slow moving in parts, but I was not bored.  Donald Sutherland was a waste - he has a small role and his character is never developed enough to give him much personality.  Another plus, however, is the beautiful countryside where the movie was shot.  Overall not bad, but could have been better.",
      "total_reactions": 1,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "The Eagle was a very thrilling movie, that brought all that it promised and more. It brought a good share of action, as well as a plot that would make since for the time period. The characters were relatable, and had a good chemistry with one an other. The main reason that I mark this movie down was because the way they spoke. The dialogue was far to modern for the time period. Other then that and the somewhat abrupt ending, a very exiting movie that's worth the watch.",
      "total_reactions": 0,
      "user": "iSniper"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "Tatum feels emotionally unattached and never quite connects, making the  whole project a bit of a bore.  He should not be  casted in anything that does not address teen girls.  And the depiction of the Scotts seemed odd - more like the men in the Amazon in Apocalypto.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2011
      },
      "score": 6,
      "text": "Channing Tatum stars as a Roman soldier on a quest with Jamie Bell, who plays his \"body slave\" (insert appropriate homoerotic comment here). Even with the historical histrionics, Tatum turns in an earnest performance. The film is shot with an artful eye: lots of beautiful scenery and interesting setups. However, the battle scenes are a useless blur that's edited in a confusing frenzy. Overall, the film is a competent effort in the genre.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "The Eagle is well worth the price of admission. The plot is slow moving at first but it keeps you wanting more as do the action scenes where is concentrates more on the battle then blood and gore.the pace of the movie again is slow at some parts as they try to introduce ever one.  But  hopefully by the end of the Eagle it will make you beg for a prequal as it did for me.",
      "total_reactions": 0,
      "user": "moviefreak12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "Great film where Jamie Bell once again proves himself as one of the World's most underrated actors. The film is there between Gladiator and things like Troy. Far better than Troy, Alexander etc with greater emotional ties to the characters and a more engaging story. Not as powerful or profound as Gladiator however. Went into the film with little expectations and was pleasantly surprised. The cinematography and scenic sets are breathtaking alone in High Def.",
      "total_reactions": 0,
      "user": "beelzie14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "Better than I thought it would be.  The action was pretty good and it was nice to have a movie without all the CGI and 3D.  The scenery was nice, the acting was not too bad, and the story was interesting enough.  The ending was disappointingly trite, I could have done without the walk off scene which was really dumb and almost ruined the movie for me, but otherwise an OK movie.",
      "total_reactions": 0,
      "user": "Bama72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "This film is about what symbols mean to soldiers. They mean more to them than civilians will ever know. The eagle is a film that shows this brilliantly. It is well film and surprisingly well acted. Be warned however, this is by far the bloodiest pg-13 film I have ever seen. The ending kinda was cliche, but  the screen with Channing Tatum holds up the eagle before a \"last stand\" battle is incredibly moving. Well worth a rental or trip to the movie theater!",
      "total_reactions": 0,
      "user": "Joe50119"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Predictable? Yes. Suspenseful? Perhaps, at times. I found it to be engaging despite the aforementioned qualities. Having lived in a similar type environment allowed me to engage in the characters revealed and the terrain on which they lived. The seal people creation is historically inaccurate on so many levels but it is a movie and such depictions, IMHO, should be permitted for the sake of entertainment provided it doesn't slam any obvious group of people or culture. There was a nice strong, masculine bond between lead characters and the non use of profanity was a welcomed rarity. I have friends who have watched it multiple times. Once was good for me, however, I did enjoy the experience.",
      "total_reactions": 0,
      "user": "Peter_Labose_LA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 4,
      "text": "Not much that is good that I can say about this movie. There are long periods of nothing that make you want to go to the grocery store for more popcorn. The lines are absurd at times. And I am still trying to understand how a handful of Romans, who had aged more than 20 years, killed many times their number in much younger seal people. All in all this movie wasn't even a good waste of time.",
      "total_reactions": 0,
      "user": "Texas_Movie_Fan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "This was a huge disappointment for me, I was hoping for another Ancient Rome based movie to compare to Gladiator.  The movie starts off well, with a little bit of suspension.  But as it goes on it keeps on going down, it just became a generic/cheesy/horribly acted movie.  Especially when the main character meets up with his father's old soldiers and that point I was ready to walk out of the movie theater (and i did indeed see many people leaving).  The only commendable thing is that it had very beautiful landscape shots.",
      "total_reactions": 0,
      "user": "bottafff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "Passable action/buddy movie with a good storyline but poor cliche ridden acting. The action scenes are good but sparse. It could have been so much more.",
      "total_reactions": 0,
      "user": "rotku"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "A+",
      "total_reactions": 0,
      "user": "Cinetim"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 4,
      "text": "The Eagle starts well - director Kevin Macdonald is clearly concerned with providing the viewer with an immersive, authentic historical world, and the details of the everyday life of a Roman soldier are fascinating to witness. Channing Tatum's Marcus Flavius Aquila also begins the film as a well-developed, compelling protagonist. Where the film begins to falter is somewhere early in the second half. Allegory between the actions of the Romans and the modern American military is heavy-handed and unsubtle, and the representation of the main Pict tribe as very akin to Native Americans is more than a little jarring. What is also laughable is the completely blatant homoerotic subtext between Marcus and Esca (Jamie Bell). The Eagle could have been a clever, compelling and believable historical epic, but instead is overburdened with pretentious intellectual baggage and some drastic misjudgements in tone.",
      "total_reactions": 0,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2011
      },
      "score": 6,
      "text": "Hadn't it been for the plot, scenery and tremendously Jamie Bell, this movie would have been a disaster. The lead guy was just awful to watch, so unconvincing, so general. Jamie Bell did a much better role, although he didn't receive the spotlight.",
      "total_reactions": 0,
      "user": "ZuZuZu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "I don't really understand much of the negative reviews towards this movie. People really expect to much and it seems like a movie isn't praised unless it has a 200 million dollar budget with top line actors and some crazy over the top special effects. This movie had a great atmosphere, some heart wrenching scenes and a great plot. Not the best movie I've ever seen but far from the worst.",
      "total_reactions": 0,
      "user": "Hybridiction"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "This movie is alright. It's aimed towards a target audience so if you are not part of the fans who love Gladiator, braveheart and movies of the like, then you might find this film luke warm, but if you do like those movies, you will love to add this film as another anglo-saxon/roman genre movie to your collection, the movie starts off well with a couple of well done fight scenes, moves on with some travel which many other reviews have panned as boring, which is rubbish because travel time is a necessity, see movies like The Lord of the rings. Simply put, This movie is not as good as some of the greats mentioned earlier, but is not poor in quality and un watchable. It's simply an alright movie, which you would likely watch if it was on tv at the time, but probably wouldn't be your first thought when choosing something to watch",
      "total_reactions": 0,
      "user": "reviewzor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "I actually really enjoyed this film. I had very low expectations, but I was completely surprised. Obviously, this is no Gladiator or Braveheart, but the film still was enjoyable and entertaining.  I still am not not a Channing Tatum fan, but he and Jamie Bell were fine here. The acting did not appear bad to me by any means. It was definitely only decent at best, but where the acting lacked, the film made up for it with other elements.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "Despite its potential, \"The Eagle\" adheres too closely to formula and is driven by stunted dialogue with sparse action scenes that do little to keep it interesting as well as a cast that aren't up to the material. It's the type of film that may have thrived in the '90s and been nominated for lots of awards, but instead ends up being one that may finally retire an overused genre.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "Easily one of the best 2011 movie because of is action and his goos acting.There is some good characters and good fight scenes.The only thing i didn't like is that there is not enough action.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "Extremely well written movie about Honor, Courage, and Sacrifice. Channing Tatum was remarkable in his role.",
      "total_reactions": 0,
      "user": "choomtabi31"
    }
  ]
}