{
  "mc_avg_user_score": 8.1,
  "mc_metascore": 84,
  "mc_mixed_rating_frequency": 6,
  "mc_movie_name": "The Cove",
  "mc_negative_rating_frequency": 8,
  "mc_positive_rating_frequency": 79,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "I think this documentry was very good and expressed a ton of information on the cruel sitution going on in Japan. I give this a 10, Rick O' Berry is truly a dolphin saver. The things he has done sacrificing his own life for the dolphins is amazing. He goes out of his own way. It makes me sad to know innocent animals are getting killed, Thanks to Take Part and The Cove, the number of dolphins being killed has decresed greatly over the years. I'm glad a group like Take Part took a step and made an impact and changes of the ways in Japan. The Cove has greatly helped and changed the outcomes of dolphin deaths a year. Good Job 10",
      "total_reactions": 1,
      "user": "tmarino14"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "In a truthful manner, I am not an individual who situates his attention on animal rights and or cruelty.  I am however, pliable to a well-done documentary that may or may not change my position on a controversial subject. The Cove is a 2009 documentary film directed by Louie Psihoyos, that documents the annual slaughter of dolphins in Wakayama Japan. A fraction of the movie plays like a common documentary film, interviewing prominent figures in the fishing business and presenting the audience facts and related correlations. While the remainder of the film is in the point of view of a crew trying to attain documentation of dolphin cruelty.  Overall, the film succeeds in projecting its point, these water-dwelling mammals are under unbelievably considerable cruelty.  The film is remarkably crafted and entirely deserves the Oscar that it received a few months back.  Although it is effective, I believe that it had a lack of what could have made it even more effectual. The part that really triggered my pathos was the actual footage of the dolphin slaughter and the risks the crew took in capturing the film.  The majority of the film focused on the facts, while the actual live filming, was in all actuality saved until the end.  If more of the film focused on the latter portion, it would have been ideal.  To conclude, The Cove is an effective documentary that is  astonishingly done in a good matter, but I have a feeling that it could have been faintly better.",
      "total_reactions": 3,
      "user": "RyanGee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2012
      },
      "score": 3,
      "text": "Well shot, but not a great film. It seems to make the Japanese look like such terrible people for killing dolphins just because Americans had Flipper and now care about that animal more than others. If you watched this and agree it's terrible because killing animals is always bad, then that is fine, but if you meat, then you have no basis to judge these people for what meat they choose to eat.",
      "total_reactions": 1,
      "user": "dijavantewow"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Any time a film has the power to stir up emotions so potently sticking as \"The Cove,\" critical acclaim is only incidental. The task of illuminating a mere, insignificant cetacean mammal, and bring about internal change within the viewer  is done here with such elegance and beauty that apathy assumes the form of genuine concern and heart-wrenching sympathy, even to the most severe of misanthropes. Before too long, you find yourself in a predicament of righful action, hindered by the antagonistic Taiji monopolizers, who, once developed, are as vexatious as a high-strung, hormonal adolescent. The manipulative effect makes for a preservation team that you can't help but root for.",
      "total_reactions": 1,
      "user": "FDT44"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2011
      },
      "score": 1,
      "text": "massively overhyped and patronising propaganda piece that clutches at any anecdote or emotional heartstring-pulling possible in an attempt to illicit outrage without ever properly investigating the facts or trying to understand why the dolphin killing continues. Repeatedly tells us how many dolphins are killed in the cove in an attempt to shock, but doesn't put this into any ecological or ethical context. Seems to try very hard to portray the americans as fearless fighters against the evil japanese dolphin-killers.",
      "total_reactions": 3,
      "user": "hwheatley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "This movie, purely based off directing aspects, can  be called a beautiful movie, the pacing, the beautiful music, the video mixing and editing, and other general directing aspects. Purely based off just how good a movie it is, I can tell you that its amazing, its beautiful, you wont see anything like it, it will make you smile, it will make you cry, it will send chills down your spine, and it will make you clench your fist in anger. This movie is truly remarkable, its extremely uplifting, and by the end of it, you have to stop yourself from jumping on the internet and buying a plane ticket to Taiji, Japan with a baseball bat in your luggage. I would recommend any one to watch it, from the people who watch it for environmental reasons, and for people that just want to see a good movie.",
      "total_reactions": 0,
      "user": "iHammer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "A raw documentary with a purpose.  Clearly difficult to make, but even more evident having seen its significance. Proves once again that humans are the worse beasts who are prepared to kill for vanity, money or power.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "If rating this movie based completely off directing aspects: it can be called beautiful. The pacing, the beautiful score, the video mixing and editing, and other general directing aspects have all been done very well. The movie manages to make you laugh, cry, smile, all in the space of few minutes. It has a bit of everything, Louie Psihoyos has done an amazing job, especially when considering this is his first piece of directing work. His next work, The Singing Planet, will be releasing in 2012, which I am much looking forward to. This is easily one of the best documentaries out there, and if some one argues that documentaries are a stale genre, show them this. It is extremely uplifting and sends a great message: if we can't fix something this small, we have no hope of fixing anything else. By the end of it, you have to stop yourself from jumping on the internet and buying a plane ticket to Taiji, Japan with a baseball bat in your luggage. I would recommend any one to watch it, from the people who watch it for environmental reasons, and for people that just want to see a great movie",
      "total_reactions": 0,
      "user": "iHammmer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "This is one documentary that is worth seeing and anything but dull and boring. This is a story of courage and a passion to undue such horrible acts. Eye opening and touching. Worthy of its Oscar.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "It's massively incredible how this film provokes such anger, tension as well as passion in it. Words can barely describe how painful and powerful this documentary is, and the lengths to which human monstrosity can extend to. I gauruntee for those who see a little glimpse of my way, you will surely stand up for it and fight against this thing--at least in disgust. The most important film to watch.",
      "total_reactions": 0,
      "user": "joomjim4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "The Cove was an incredible documentary and I highly recommend it! It definitely opened my eyes to something that I never knew was happening with the ocean animals and made my very sad that this is even going on. I hope this documentary moves you like it did me!",
      "total_reactions": 0,
      "user": "chelseyseaton"
    }
  ]
}