{
  "mc_avg_user_score": 6.2,
  "mc_metascore": 52,
  "mc_mixed_rating_frequency": 23,
  "mc_movie_name": "The Tall Man",
  "mc_negative_rating_frequency": 8,
  "mc_positive_rating_frequency": 24,
  "mc_pro_critic_reviews": [
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2012
      },
      "score": 90,
      "summary": "Ultimately his story draws more energy from class than from criminality: awash in sludgy browns and rotting greens - the colors of poverty and decomposition - this unpredictable oddity is a little bonkers but a lot original."
    },
    {
      "critic": "Richard Larson",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2012
      },
      "score": 75,
      "summary": "Illustrates the problem of class mobility with a dark, troubling premise that holds a harsh light up to our own assumptions and expectations."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2012
      },
      "score": 75,
      "summary": "In easily her best performance - and sadly, one few will see, given the film's modest release strategy - Jessica Biel stars as a single mother in Cold Rock, Washington."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2012
      },
      "score": 40,
      "summary": "Long on atmosphere and short on sense, The Tall Man becomes less gripping as it grows more ridiculous."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2012
      },
      "score": 38,
      "summary": "Spits out enough scares and twists to maintain our interest, but the film's psycho-sociological layer is almost as cheesy and unconvincing as its low-rent action scenes."
    },
    {
      "critic": "Chris Packham",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2012
      },
      "score": 30,
      "summary": "Once you get through the flaming, Bowser's Castle–like gauntlet of the rest of the story's implausibilities, you end up in a different movie than the one on the creepy poster."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2012
      },
      "score": 25,
      "summary": "The road to hell is paved with good intentions, and in a few months it will also be paved with unwatched DVD copies of The Tall Man."
    },
    {
      "critic": "Nick Schager",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2012
      },
      "score": 20,
      "summary": "The more pressing affliction in Pascal Laugier's film is the absence of chills, logic and coherence."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "The Tall Man is a 2012 thriller film directed by Pascal Laugier. Cold Rock A children are disappearing and people are blaming a mysterious entity called The Tall Man The film has an excellent director and a photograph really well done. The cast was very well chosen and the plot took a turn unexpected mid-film, which surprised me. A pretty good movie that manages to make you spend 1 hour and 40 minutes without boredom.",
      "total_reactions": 1,
      "user": "Mad_Hatter91"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "Over the past decade, children have been disappearing in the downtrodden town of Cold Rock, but now, one mother is fighting back when her son becomes the next victim of the Tall Man. Pascal Laugier, writer and director of the controversial shocker MARTYRS, returns with THE TALL MAN, a suspense thriller that marks a dramatic shift in style and tone from the director's previous film. THE TALL MAN echoes the writings of Stephen King in many ways, but mainly in its small town setting, the monster of legend that plagues the town, and in the narration that is provided by one of the town's young children. Jessica Biel stars as Julia Denning, a nurse whose selfless attempts cannot save the dying community from itself. Biel's performance carries the film, but despite her best efforts, her character simply isn't compelling enough to garner our sympathy or support. While the final reveal may seem like a cheat to the many viewers who set their sights on the supernatural, Laugier still surprises with an altruistic message of hope that few could have anticipated. THE TALL MAN will hold a certain appeal with fans of both Stephen King and M. Night Shyamalan.",
      "total_reactions": 1,
      "user": "ILHM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "Different, engaging and thought provoking. Definitely not a horror film in the traditional sense, perhaps not even a horror film at all, but definitely worth a watch.",
      "total_reactions": 1,
      "user": "Nixy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "This movie deserves more attention and higher ratings. It's so misunderstood by people. If you love crime or mystery thriller, you're gonna love this. It has so much twist along the way. Don't think it as a horror movie with blood splatering all over the place. Trust me, you'll enjoy it!",
      "total_reactions": 3,
      "user": "MisterKS"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "52? Really, critics? 52? You sad little hipsters. A movie with the greatest plot twist in the history of movies (I'm being dead serious here, the plot twist is so unpredictable and disturbing that even after it happens you just won't be able to believe it) gets an average of 52 from the critics? What a bunch of idiots. This movie is the best thriller I have seen in a while, and simply put, takes conventional movie plots and twists and completely turns them onto their heads and spins them around like an upside-down circus tent. The atmosphere is brilliant, the plot is mind-blowing, and the acting is superb. You have to watch this movie, if you don't, well, you're missing out on something huge",
      "total_reactions": 4,
      "user": "Patrick94"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "What it lacks in terror and gore it makes up for in premise. Once you see what's going on, you'll applaud the effort if not totally satisfied by it. Interesting, but there's a lot of plot holes and plausibility issues.",
      "total_reactions": 2,
      "user": "Friskytiger81"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "The Tall Man tries very hard to be something it's not, a Stephen King story. Parts of this film reek with King's influence, but I don't think he'd be all that thrilled about it. When the film first started I thought it was a pretty good movie, but by the end I was just confused. The story follows a local resident in the town of Cold Rock, who has taken over her husband's medical practice after he passed away. That resident is played by Jessica Biel, whose performance and looks are really the only reason to watch this movie. In the town of Cold Rock, the children have been disappearing without a trace and the only thing people have seen is a tall man, dressed in black, leaving the scene. Some people say he's an urban legend, while others claim to have witnessed his abductions, and the whole town is terrified. I found it kind of funny that in a town crippled by fear, not knowing whose child could be next, the kids parents, let them ride their bikes to the store and let them play alone in the fields, it's just one of many parts of this film that just off. As I said, the beginning of this film is terrific, but then it gets weirder and weirder and builds to a conclusion that doesn't make any damn sense! I know this must of have been someone's passion and that they spent years developing it, but before you released it to the public, did you bother to watch it? Jessica Biel is sexy and a terrific actress who is way too good to be doing  b-movies like this. If you're a die-hard fan, check it out, she's great, but if you're not, I'd definitely stay away from this one.",
      "total_reactions": 2,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2013
      },
      "score": 2,
      "text": "This movie was lame and really their was no point of it being called the tall man.When i looked at this movie on netflix i thought about slender and boy was i wrong.It stars Jessica Biel,Jodelle Ferland and Stephen McHattie.The movie didn't made sense cause of the title of this movie.If you've seen the whole movie then you know what i'm talking about.Jessica biel played in better movies than this and Jodelle Ferland played a character who never really did anything besides worrying about the tall man.Don't get me wrong i found one or two part interesting but the fact is the movie was just god awful and boring to me.",
      "total_reactions": 2,
      "user": "calebreviews"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "First off: if I could rate this film 11 out of 10, I would. Sure, there were some plot holes and plausability issues, but the overall premise was rock solid and though provoking. It won't resonate with everyone, nor will everyone understand or accept the underlying idea, but that doesn't deter from the fact that this will likely become a cult classic in years to come. It was on par with Dark Water in terms of overall mood, and goes way beyond the cheap scares and mindnumbing drivel finding its way to theaters these days.",
      "total_reactions": 4,
      "user": "vincentvergeer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "A new horror movie, what happen? Any new, is good, have some creepy moments, the performances are regular, have some problems in the development. The Tall Man don't have something new, but scares.",
      "total_reactions": 1,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "A horror film that could be a lesson to parents.",
      "total_reactions": 1,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "Literally the WORST movie i have ever come across!!!!!!! its so stupid and the plot is bland and very dumb! the characters are completely horrible and just UGGGHHH!!!! do bot waste your time!! i have no idea why some people rated this so high!! were they asleep the whole movie???...WTF",
      "total_reactions": 2,
      "user": "peythepenguin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2014
      },
      "score": 0,
      "text": "First plot twist movie that has an ending that's not even close to plot twist and turns out just a public service announcement. Sadly I've watched it in theatre, waste of time and money.",
      "total_reactions": 1,
      "user": "imsoysal"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "This movie was honestly just offensive to anyone with any intelligence.  It tried very hard to be mysterious but was about as subtle as a shotgun.  It was very drawn out and boring, seemingly ending several times,, but the worst part is the end.",
      "total_reactions": 0,
      "user": "strummer95"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 3,
      "text": "\"The Tall Man\" markets itself as a horror film, but that's not the case. Now that would be just fine if the film was actually able to give us something compelling, but instead we get a film with a story that feels like it was written by a teenager.",
      "total_reactions": 0,
      "user": "NFW"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2015
      },
      "score": 4,
      "text": "Nope, this is not a good one. First of all, it's not a horror movie, as it claims to be. And I don't mean it fails as gory or jump-scare movie or creepy expectation-building movie or torture movie or survival or revenge or whatever horror sub-genre movie - no, it's nothing to do with the horror genre at all. It's some potpourri from the thriller, psychological drama, action movie, social drama, detective movie and cheesy family drama. A patchwork of styles and genres implanted in a frame of dilapidated and badly lit surroundings populated by featureless folk whose sole and unique characteristic is to disappear from your memory the same moment they disappear from the screen.",
      "total_reactions": 0,
      "user": "JeanDuchamp"
    }
  ]
}