{
  "mc_avg_user_score": 3.6,
  "mc_metascore": 19,
  "mc_mixed_rating_frequency": 9,
  "mc_movie_name": "The Prince",
  "mc_negative_rating_frequency": 15,
  "mc_positive_rating_frequency": 6,
  "mc_pro_critic_reviews": [
    {
      "critic": "Matt Looker",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2015
      },
      "score": 40,
      "summary": "Patric’s bullet-scarred killer-gone-clean is a tired character in every sense, and no amount of exploding blood packs can make up for this much banality. At least there’s enough momentum to keep you from checking the timer every two minutes."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2014
      },
      "score": 40,
      "summary": "Wit is in short supply, but director Miller at least keeps things moving briskly throughout the relatively brief running time."
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2014
      },
      "score": 30,
      "summary": "The action sequences are competently directed, but exhibit virtually no flair or invention."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2014
      },
      "score": 30,
      "summary": "All would be forgiven if director Brian A. Miller were the next John Woo, but the shootouts and car chases call to mind adjectives like “requisite” and “obligatory,” and the ready-made New Orleans ambience is nonexistent, probably for budgetary reasons."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2014
      },
      "score": 20,
      "summary": "So unless you're a fan of yawn-worthy shootouts and showdowns, The Prince is a \"Taken\" retread hardly indicative of any special set of skills."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2014
      },
      "score": 20,
      "summary": "The Prince isn't just awful, it's depressing."
    },
    {
      "critic": "Chuck Wilson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "summary": "Screenwriters Andre Fabrizio and Jeremy Passmore fail to conjure a single witty line. Nor is there any finesse to be found in director Brian A. Miller’s inept staging of car chases and shoot-outs."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 1,
      "text": "This movie is the best example of phoning it in. Not one person is interested in this movie, not the writers, the actors, or the director, not a single care was taken. The \"Plot\" is the same regurgitated non sense about an ex Black-ops/CIA/Marine/Superman who gets his daughter kidnapped so now he has to go save her. This is also Bruce Willis' worst performance to date as the villain. This better not be shown at any theater or be displayed at any video store, no one should watch this.",
      "total_reactions": 1,
      "user": "NotoriousFraud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 0,
      "text": "What an absolute waste of money this film was. No redeeming features, scenes or stunts even. Low grade crap.  Staring at the wall instead of watching this 1hr 25min mistake would be far better for your brain.",
      "total_reactions": 0,
      "user": "podriscoll27"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2015
      },
      "score": 2,
      "text": "When an ex mercenary discovers his daughter has been kidnapped he has to travel to New Orleans to get her back, which brings him back in contact with an old adversary. I'm sure the makers of this were planning on creating their own version of Taken, but boy did they fall short. Hackneyed plot with poor performances, Patric sleepwalks through the lead role, and Willis and Cusack have obviously just turned up for the pay check. A complete waste of time",
      "total_reactions": 0,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2015
      },
      "score": 7,
      "text": "Paul (Jason Patric) is a mafia hit-man in New Orleans, and with a baby on the way, he wants out. Paul thinks the only way to do that is to kill his boss (Bruce Willis). With a car bomb in place, Paul waits for his boss to leave for the day, but is shocked to see the bosses wife and daughter get into the car instead. After the tragedy, Paul and his family flea and for 18 years, live in peace, but that all changes when his daughter goes down to New Orleans for a weekend getaway and disappears. The dry, emotionless, Jason Patric stars in this film and as it turns out, he's perfect for the role. As The Prince, the heir apparent, Patric has to play both a loving father and a ruthless criminal and does so admirably. While he's listed in the background, he really is the star of the movie, with the other big names making sporadic appearances. It's a shame, because Bruce Willis's boss character seemed to be a really interesting guy, who I'd have loved to see more of and learn more about. The Prince isn't very unique and you can't help but draw parallels to A History of Violence. While not as good, the film still features some intense action and a great story. The one draw back is that the Prince is so focused on this man Paul, and his goals, that they ignore some very compelling side stories. Had I been the writer, I would have utilized flashbacks through out, to show more of the prince and the bosses story, but sadly they didn't. Aside from that I really enjoyed the film, it was a chase, a mystery, and a mafia film rolled into one, with some great cameos, and an unexpected ending. This is the kind of action film I'd love to see more of. It isn't simply about the special effects and the guns, there is a purpose behind all of it, and that makes all the difference.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "How on earth did they get Bruce Willis to show his face in this one?",
      "total_reactions": 0,
      "user": "Qgal5kap"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "I reviewed Vice, which was godawful, and I talked about The Prince which was godawful. The Prince is a lazy example of low budget filmmaking, at it's ultimate worst. This movie has nothing good to talk about, fact is, it has nothing okay to talk about. The Prince is a ripoff of Taken, and boy it disappoints. The story, well, what was it? Like, Vice, Brian Miller forgets about everything and focuses on the oddly violent action sequences, with the most horrible green screen, you will see in a movie. It's not even a movie, it's a practical joke, played by Miller, on Bruce Willis, who gets framed in this bad thriller with a pay check that is not as deserving. Same goes for Joan Cusack, who makes movies for the extra dollar now, ex. The Bag Man, which had Robert De Niro, who ALSO makes low budget monstrosities like Killing Season. The chain reaction goes on and on and I fear that maybe, actors like Tommy Lee Jones or Tom Cruise might fall under the same demise to earn some bucks. I hope, you haven't watched this movie, it's trailer or even got free tickets to it. It's a shame to Hollywood. Nuff Said.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "I found it was kinda ok but slightly belove average. Main protagonist wasn't well worked out. I failed to see the point of that girl who followed him around. The story was so-so, again not much there. I already watched The Outsider shortly before this and that movie has similar premise however it was much better. I don't know, can't recommend it.",
      "total_reactions": 0,
      "user": "Tessara_Vejgan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 0,
      "text": "This movie stars big-time actors like Bruce Willis and Rain, Bruce Willis is an big-time actor in Die Hard and The Expendables and Rain is a big-time actor in South Korea and newcomer Jason Patric in it, the action is perfect but the ending is a godsmack failure flop even winning the fight, better avoid watching this movie and instead play The Sims, DOTA and other games, avoid this movie at any cost because if you do, you're just making Bruce Willis $ 1 Million To Be Paid and He Hasn't Made Enough Money In The Expendables, Poor Rain Anyway and Avoid This Because Old Bruce Just Wants Your Money!!!!!",
      "total_reactions": 0,
      "user": "JomartheGreat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2015
      },
      "score": 3,
      "text": "Director Brian Miller is not exactly a guarantee of quality. Since 2010, he mainly directed straight-to-DVD titles that struggle to reach a mere 5 out of 10 on their Imdb page: action flicks with a half-baked plot and risible acting, often featuring fallen-from-grace stars and shoddy special effects - arguably the equivalent of old style B-movies. Nothing suggests that they will ever gain the same cult-like following as the films that inspired Quentin Tarantino; most of the time, they take themselves way too seriously to be enjoyable trash culture, and end up becoming sheer nothingness, forgotten in the discounted DVD basket at the supermarket. The Prince, however, features the likes of Jason Patric (you might – or might not – remember him from Speed 2), John Cusack and Bruce Willis. It could have been a turning point in Miller’s career; instead, as expected, it’s just another unsuccessful attempt.",
      "total_reactions": 0,
      "user": "Devilmath"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2015
      },
      "score": 1,
      "text": "Awful. Willis must have needed the money. The tone is one long brooding humorless yawn, the exact opposite of \"Die Hard.\" This is die hard for any viewer. Death by trite.",
      "total_reactions": 0,
      "user": "Boodang"
    }
  ]
}