{
  "mc_avg_user_score": 4.9,
  "mc_metascore": 30,
  "mc_mixed_rating_frequency": 52,
  "mc_movie_name": "The Final Destination",
  "mc_negative_rating_frequency": 90,
  "mc_positive_rating_frequency": 72,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "It's not the best of the franchise, but it is good. Yet again, it goes overboard with blood, guts and gore but hey, what do you expect? It's Final Destination we're talking about here! The deaths are gruesome and the freak accident is okay. The storyline is a bit shaky but it's quite a good movie.",
      "total_reactions": 1,
      "user": "MediaCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "Well is a short film with violent deaths that surprises even more. not a serious movie like the previous but still contains the suspense in the deaths of the characters.",
      "total_reactions": 1,
      "user": "Enrique20"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2014
      },
      "score": 9,
      "text": "Poor 3D effects (in the DVD) but hey, it comes with 3d glasses which can be used elsewhere. The deaths are good, the story is good, but what brings it down is the poor 3D.",
      "total_reactions": 1,
      "user": "PolisKanin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 3,
      "text": "This is it. \"The Final Destination\". Its MUST BE the last of its franchise. With its inane plot and overly exaggerated (\"Saw\" was better at it) deaths of teens, the film is a good example for considering to end the franchise.",
      "total_reactions": 5,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2010
      },
      "score": 2,
      "text": "this movie is just bad just like the ones before it. Hollywood has pretty much made the same movie 4 different time and there going to do it again in 2011 with final destination . the acting was horrible and the special affects were just as horrible. If you are not watching it for free you are wasting your money",
      "total_reactions": 2,
      "user": "moviefreak12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "epic",
      "total_reactions": 2,
      "user": "mickeyboy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2010
      },
      "score": 3,
      "text": "The 3D was one of the better uses I have seen but the actual plot was so boring and so predictable. I hadn't seen any of the other Final Destination films before this and I will not be delving into Blockbuster to find the others. Pure tripe.",
      "total_reactions": 1,
      "user": "Paxster"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "It's just sense of humor! Effects are bad but the story unfolds for that special horror spice for all people! But it is still cheap, no acting no i mean none! Just kill yourself and say OMG! Can I be now an actor/actress in this movie",
      "total_reactions": 1,
      "user": "khenz016"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2010
      },
      "score": 1,
      "text": "Too much acceleration makes this movie worst. Too much visually violent without considering a harmonized story telling make this movie even worst and worst.",
      "total_reactions": 1,
      "user": "Paul_Yoon"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2010
      },
      "score": 1,
      "text": "this movie is a f***in a**!",
      "total_reactions": 2,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "This movie is amazing, the effects are great, the deaths are grisly, by far, the best final destination of them all. All my friends love it and i cant blame them. I LOVE IT!!!!! the blood and gore adds to the thrill- TWO THUMBS UP",
      "total_reactions": 2,
      "user": "RyanLopez"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "I've never watched a movie in the series before this one, but I found it easy to get into eve though I haven't, and honestly I really liked, I enjoyed the concept, interesting deaths, and the movie unique sense of humor, and honestly it reminded me a lot of the Saw series, so if you like those movies I believe you'll like this, and it's not really scary just gory, and not even that gory compared to the Saw series, and I personally didn't find it scary (and I'm probably the worlds biggest chicken) so I doubt you will either if that's what your worried about, so if your not into watching 20 somethings die in gory ways then this is not for you, but if your like me and for some unexplainable reason like stuff like this, then this may be a entry point to for a new series to get into, and after this movie a pretty awesome looking one at that.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "The good of this film is the incredible effects and the violence by characteristic of the genus.Some creative element, but a very badass movie...",
      "total_reactions": 1,
      "user": "TTT"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2011
      },
      "score": 3,
      "text": "Despite being a huge fan of Final Destination and other splatter films, I'm quite disappointed with this Final Destination 4. The death scenes aren't as inventive as the previous ones. But I like that swimming pool scene although it doesn't look very realistic. I never like this director's style in Final Destination 2, and I still don't in this one.",
      "total_reactions": 1,
      "user": "VRossi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 4,
      "text": "3D could not save this movie, despite the sometimes neat effects, this movie was poor. The film franchise was slowly turning in to \"death porn\" and every film seemed to dumb itself down. The death scenes were strained, if not a slight boring, with the car-wash scene providing the only false sense of dread in this film, if you want to watch this just to see people die in weird ways, then this is for you, if otherwise, then avoid this movie.",
      "total_reactions": 0,
      "user": "Warren"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2011
      },
      "score": 0,
      "text": "This movie sucks, I mean, I wasn't expecting it to be great in fact I kinda expected it to be pretty damn awful, and it was, but worse. The acting is horrific and it has weak script. At least some of the deaths are kinda original but were clearly made for 3-D. I understand it isn't trying to be anything great, but it should at least be fun, The first one was a creative concept, but now it's just the same damn movie with different people in different places.",
      "total_reactions": 0,
      "user": "Schmit93"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2012
      },
      "score": 4,
      "text": "Just about bordering on a bad film, but again, if you're into wonderfully thought-through death scenes, watch it by all means. Yes, disappointing acting makes this the worst film in the 'Final Destination' series, but it still achieves a unique status.",
      "total_reactions": 0,
      "user": "J42Hmusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2011
      },
      "score": 3,
      "text": "The director thinks he is orchestrating images and sequences of impact, but the film is a formulaic tedium atrocious! The characters are unconvincing and unbearable, mostly, and the script is absurd and increasingly bad! You can watch us fools when it comes to fun, but it is terribly absurd.",
      "total_reactions": 0,
      "user": "jimmytancredi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2011
      },
      "score": 2,
      "text": "horrible just like the franchise, i still dont know how a franchise can make over 3 movies when all the movies have the same plot, same bad acting, and lame scares. The SAW franchise at least had some twist in the end. Final Destination is the same over and over one person sees the future and stops fate from happening and the rest of movie is just a lot of people die. and at the end there is always one person who thinks they survived it and then as they say it  they die. these sequals are just pointless. The only bright side to this franchise is some of the deaths are pretty cool. but its not enough to save this franchise. and what makes me really sad it that 5th came out a couple of weeks ago and there are plans to do another one, hollywood please spare me, kill me now!",
      "total_reactions": 0,
      "user": "moviesRawsome"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2011
      },
      "score": 3,
      "text": "THE FINAL DESTINATION is by far the worst in the series. It provides nothing new, the acting is horrible and it's highly predictable and cliched.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2012
      },
      "score": 4,
      "text": "The worst of the franchise. The film itself is a nightmare, the acting is bad, and some of the deaths are greatly exaggerated, if you feel for something in this film is that it ends as soon as possible. Save yourself some parts that make the film reasonable.",
      "total_reactions": 0,
      "user": "vini1904"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2012
      },
      "score": 4,
      "text": "A few clever deaths, but nothing really good to say about it. It struggles to do anything different from its predecessors.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2012
      },
      "score": 1,
      "text": "Another Terrible final destination. Acting is even worse than the previous one and the writing seem to been done over night. The script was so bad that they couldn't come up with any other deaths for people so they just let them get hit by a car. How stupid.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2012
      },
      "score": 2,
      "text": "This movie just expresses YUCK. It was grossly bad. The script was not clever even in the slightest. The deaths were as though they were picked out of a hat. Nothing about it was entertaining.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "What was this crap? This silly and predictable fourth installment, \"The Final Destination\" is just utterly disappointing. You can't cheat death, but you can cheat audiences over and over again. But hey, look at the title, this might just be the last installment in the series.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 2,
      "text": "I'm actually a bit of a fan of this franchise, the first entries are a lot of fun. Due to poor acting, weak effects, and less gore, this 4th entry isn't as entertaining. At times I felt like I was watching a violent MTV movie. There's definitely some fun to be had thanks to a likable concept, but the deaths/accidents weren't that memorable/interesting. Not a horrible film, but not very good either.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "The fourth addition in the Final Destination series is quite easily the worst, but its still highly entertaining! The deaths were clearly made for 3D and they spent more time on effects rather than plot; but at the end of the day these films are for entertainment and it has no trouble doing that. Fans should still be pleased as its still a good film, and it leads into what is probably the best of the series (#5) but overall it's an average Horror flick that lacks what the others had.",
      "total_reactions": 0,
      "user": "survivorfan989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "At least It was entertaining and the final destinations of the teens were creative an original. It's just that the opening scene was so unbelievable and cheesy fake. Just like most of the deaths. Despite some of the bad acting, the main reason It was decent was that it kept my full attention the whole time and I actually cared about some of the characters. The ending was far too typical and utterly predictable though.",
      "total_reactions": 0,
      "user": "mds03"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "Um pouco inferior ao 3 porém melhor que os 2 primeiros,mortes bem criativas neste.",
      "total_reactions": 0,
      "user": "LoRevisor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "the film was ok. It had strange deaths, some of the m were hilarious and i really din't like the ending. Wow that was a bad scene",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "The original Final Destination came out in 2000, and revolved around a group of kids getting killed one by one after their friend had a premonition of a disaster, causing them to avert it, they were said to have 'cheated death'. This film is no different. This film follows the same formula as all the other films.. Disaster-Survival-Death-Warn the others-Death. However, this film seems to get the worst reviews of them all. Sure this movie is filled with inconsistencies and waiters for actors, also featuring some ludicrous deaths, but you have to remember that this film is not to be taken too seriously, as it has much like the Chucky films, taken a more comedic route than the original two. In this film, kids escape a major wreck at a race track, causing everyone to die. Then one by one, they die in stupid ways, such as getting their organs getting sucked out of their a** by a pool filter and getting cubed by a fence. In the end, this is an alright popcorn flick to watch with some friends, then forget about. 5/10.",
      "total_reactions": 0,
      "user": "Lelandskell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "A horrible movie. Pure garbage. The first movies strategically killed off the characters, whilst this movie rushes to erase the existence of them while using cgi horribly",
      "total_reactions": 0,
      "user": "MissDrae"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "This film feels a bit like a remake as there are a few death scenes which were unoriginal from the previous films. Nonetheless, it still works well as both a thriller and horror movie by making you feel disturbed. The ending is not so good as it is like Final Destination 3, which leaves no survivors.",
      "total_reactions": 0,
      "user": "supermann234"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "The way too overused and really horribly made CGI effects ruined this movie.The acting wasn't that bad and the deaths were good but, unfortunately, the CGI just made this movie worse than he actually is.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "From now on, this series are the most horrible thing that you gonna see. This is so ridiculious and the only good thing on it, is in the end... yes, in the credits! When you can see the crushing bone in XR",
      "total_reactions": 0,
      "user": "soloms"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2015
      },
      "score": 3,
      "text": "Após bons resultados com seus três antecessores, \"The Final Destination\" nos mostra que nunca se é tarde demais para estragar um franquia: Péssimo roteiro e atuações desastrosas nos levam a crer que apenas os créditos do filme valem mais a pena que qualquer cena do mesmo",
      "total_reactions": 0,
      "user": "LucasTReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2015
      },
      "score": 4,
      "text": "Okay, maybe I learned recently but the final destination movies this has been the worst , but compensated in some scenes they were super- strong , affecting their sensitivity, this film saga had fallen downhill",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2016
      },
      "score": 4,
      "text": "I'm gonna be honest,I love this franchise,the first three Final Destinations were great,fun horror movies,and although this one is slightly fun,it is pretty bad with only a few redeeming qualities.",
      "total_reactions": 0,
      "user": "JSpice50"
    }
  ]
}