{
  "mc_avg_user_score": 4.1,
  "mc_metascore": 23,
  "mc_mixed_rating_frequency": 22,
  "mc_movie_name": "The Roommate",
  "mc_negative_rating_frequency": 32,
  "mc_positive_rating_frequency": 12,
  "mc_pro_critic_reviews": [
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2011
      },
      "score": 60,
      "summary": "The film's sure-to-be-brief theatrical release is a mere stopover on the way to basic-cable eternity."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "L.A. Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "It's exactly what you thought it would be: A plagiarized, campus-set \"Single White Female\" pitched to teens."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "Managing nary a single original idea throughout its 93-minute running time, the film does benefit from a cast of sexy young TV stars who should attract the desired female teen demographic."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2011
      },
      "score": 40,
      "summary": "The Roommate proves that the one thing worse than a crazy, stalker roommate is one that's boring, predictable and no fun."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2011
      },
      "score": 40,
      "summary": "If ever a thriller were to inspire a collective \"eh,\" it's got to be The Roommate. It's not a good movie, by any means, but it's also not bad enough to have fun hating on."
    },
    {
      "critic": "Rob Nelson",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2011
      },
      "score": 40,
      "summary": "Formulaic and forgettable."
    },
    {
      "critic": "Michael Wilmington",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 30,
      "summary": "Christian E. Christiansen directed this stinker, which lacks even unintentional humor."
    },
    {
      "critic": "John P. McCarthy",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2011
      },
      "score": 30,
      "summary": "What's most memorable about this plodding thriller are the copious amounts of foundation and lip gloss."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2011
      },
      "score": 25,
      "summary": "It's the latest in the blank-from-hell genre, in which misogyny and entertainment are made to seem indistinguishable while the blank makes life hell for someone who then is cornered into striking back."
    },
    {
      "critic": "Keith Staskiewicz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2011
      },
      "score": 25,
      "summary": "A far-below-par thriller that desperately wishes it were a different movie - a longing it shares with the audience."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2011
      },
      "score": 25,
      "summary": "A deplorable unofficial reworking of \"Single White Female.\""
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2011
      },
      "score": 25,
      "summary": "A timid thriller that manages a couple of mild jolts and a couple of creepy-cringe-worthy moments in its Variations on a \"Single White Female\" theme."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2011
      },
      "score": 20,
      "summary": "Substituting sex for suspense and pop music for ideas, the director Christian E. Christiansen drags The Roommate from limp beginning to lame conclusion."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2011
      },
      "score": 12,
      "summary": "Sucks bad, real bad."
    },
    {
      "critic": "Elvis Mitchell",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "summary": "The Roommate has notched an unbelievable achievement; it makes the second rate \"One Tree Hill\" seems like it was about something."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "summary": "It's only February but I can already name the year's winner of Most Thoughtless Gay Stereotype in Film award. The dubious honor goes to The Roommate."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 3,
      "text": "\"Tho The Grimace and premise make for an interesting story and minor \"jumps & creeps\" here and there. But With the lack of good performances and a predictable final scene Roommate proves to be one thing ... dumb , idiotic and extremely unsatisfying\" ... C-",
      "total_reactions": 1,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 3,
      "text": "There are millions of movies; over 8 million horrors; and I was stuck with this one. The roommate was a stereotypical college horror movie that had no surprises whatsoever or anything that exceeded expectation. The movie was extremely predictable and you could of easily missed the entire first half of it and still pick it all up. It was a thriller that was just plain awful, but yet I couldn't look away.",
      "total_reactions": 1,
      "user": "slam_tastic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2011
      },
      "score": 6,
      "text": "I haven't watched \"Single White Female\" so as to make a comparison with this film. Except for the originality of the plot and generally poor choices of music, the film is OK. It was surprising to see how the story happens in college life that may be out of your expectation.",
      "total_reactions": 5,
      "user": "oscar52"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 3,
      "text": "\"Single White Female\" just turned eighteen, the age of an incoming college freshman. Now look what just came out of the woodworks. \"The Roommate\" has an animal slaying, a lecherous man who makes an unwanted pass at its heroine, and an unbalanced woman who tries to change herself into a doppleganger, similar to the perennial basic cable favorite. This familiar seeming story carries so many of the Barbet Schroeder film's traits, the moviegoer can only assume that the baby \"S.W.F.\" is his. In \"Single White Female\", a computer consulting maven places an ad for a warm body to help occupy her rent-controlled apartment, a replacement for a philandering husband, and ends up with the roommate from hell. The ad read \"professional preferred\", not \"murderess wanted\". But there you go. With its two leads, Bridget Fonda and Jennifer Jason Leigh, the filmmaker took full advantage of the disparity in looks between the actresses, in which Fonda(a natural beauty by anybody's standards), as Allison Jones, teaches Hedra(\"Hedy\" for short), played by Leigh(a modest-looking thespian not known for turning heads), how to dress, when the mismatched women go shopping, in what perhaps is the film's most pivotal scene. Moviegoers forget that \"Single White Female\" starts off as a femme version of \"Pygmallion\", before it turns into \"Pygmallion On Her Own\". Likewise, \"The Roommate\", starring Minka Jones, portraying the part of a hayseed fashion design student, takes it upon herself to reinvent the woman sharing proximal living space with her, but the woman she mentors, Leighton Messner, in a move that's somewhat detrimental to the film's internal logic, is as hot, or hotter than Jones, and probably doesn't need tips on sartorial matters, because her character, the self-possessed Rebecca, is a self-described \"clotheshorse\", privileged and snooty, who normally wouldn't be caught dead in the Iowa girl's vintage clothing. \"The Roommate\" takes a shortcut; it foregoes the \"She's All That\"-like process of transforming an ugly ducking into a swan, and presents Rebecca as a finished product. Being that the film is already formulaic and derivative, why be half-assed about its banality? Slap on some ungainly glasses and an array of self-defeating outfits on the blonde art major because it's easier to root for a dorky schizophrenic than a beautiful one. \"The Roommate\" fails to capture the best thing about \"Single White Female\", and that's how love, albeit a love riddled with disease, makes us want to be somebody else. Scarily, in Allison's case, that somebody Hedy wants to be, is her. Conversely, in \"The Roommate\", there may be a question as to who wants to be who, more. As Sarah eyeballs Rebecca's palatial estate, you hear the loaded girl downplaying her exorbitant wealth, which in turn, makes us hate the\"modest\" girl on a personal level, unlike Hedra, who remained sympathetic to the very end, in spite of her murderous shenanigans. Who is the alpha girl? Sarah loses her outright agency, she has a formidable opponent who is both rich and beautiful. Yes, the young woman is friendless, but that could be due in part to her entitled demeanor, a social defect that has nothing to do with her schizophrenia. For \"The Roommate\" to work, Rebecca needs to be the underdog. The poor little rich girl has no character arc. In \"Single White Female\", Hedra starts off as sane; she shows off an incorruptible side of her, the side untouched by madness, her true self, before the voices take over. The moviegoer understands why Allison takes a shine to the shy woman. On the other hand,\"The Roommate\" gives Messner one note to play, all bum ones, as the filmmaker conveys Rebecca's dark side, right off the bad, conveyed through lighting, which turns into an ongoing motif; her constant walking in shadows. Since we know that Rebecca is crazy from the outset, we wonder why Sarah doesn't see it too.",
      "total_reactions": 3,
      "user": "Shiira"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2011
      },
      "score": 3,
      "text": "No, it's not a good movie, but it's not nearly as terrible as I thought it would be.  It did clear something up for me, though. Minka Kelly can't pull off this kind of part. I love Friday Night Lights and thought she did a solid, minimalist job with her role as Lila Garrity. But that was just Minka. There apparently wasn't a ton of acting going on there. In a role like this one, in a movie like The Roommate, she needed to play it \"bigger\" than she did, and she comes off as an empty vessel as a result. A little boring.  Meester isn't incredible in her role either, but at least she has fun with it. The movie just has a sterile feeling to it. And box-cutters? Are they really the new horror movie weapon of choice?  And what's with the PG-13 rating?? That was the most depressing part as I walked into the theater.  This kind of movie NEEDs to be Rated R.",
      "total_reactions": 6,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "who had the idea to make a stupid movie like this? jeez us regular run of the mill douche bag, young punk directors, thats who, go to hell, these movies these days are all retarded, and if I wanted to watch some stupid skinny white chick get screwed over, I would just go home.",
      "total_reactions": 2,
      "user": "molsonman78"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 1,
      "text": "Huh? Negative reviews? Why? This is a rip off of Single White Female or something like that. I saw a lot of comments exclaiming that it was a rip-off and after seeing it with my uncle and his wife with my mom, god, I wish I could have seen something better than this worthless piece of film.",
      "total_reactions": 1,
      "user": "xXAnthonyXx"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "A thriller the whole family can dislike. Why can't my review be less than 150 characters? WTF! What more can I say about this movie other than that it is boring, stupid and a waste of my time and money. Be sure to try to avoid getting dragged to it like I did.",
      "total_reactions": 1,
      "user": "itm741"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "I was sorely tempted to ask for a refund of my ticket purchase after sitting through this abomination. My reason for asking would be to point out to the theater management that I had already seen Single White Female several years ago and I paid for a ticket then. Single White Female was much better done in all respects. In addition, Minka Kelly looks as much like a college freshman as I do, and I graduated college more than 30 years ago.",
      "total_reactions": 1,
      "user": "morgul"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "One word to describe this movie- Awful. One word to describe my experience in this movie - Suicidal. I wouldn't even call it a horror movie. The only thing that scared me about this movie was the realization during the movie that I can't get back the 1.5 hrs that I wasted watching this film. My advice to Christian E. Christiansen, next time make it Rated R so it could be a little enjoyable and somewhat tolerable to watch.â",
      "total_reactions": 1,
      "user": "teddyjets"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "Not terrible but a very stupid thriller. It has step by step format of what we expect and some wierd twist with it. The performances we're all right but really. It's not awful and it's not great.",
      "total_reactions": 1,
      "user": "SarahMichelle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2011
      },
      "score": 2,
      "text": "This is basically a rip-off of Single White Female. Not only is it predictible but also the actors looked bored, the script is lazy and it's not even scary at all.",
      "total_reactions": 0,
      "user": "Tetsuo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "It's simple but I liked it. The roommate character is freakin' creepy, what else did you people want to watch? Sure the story isn't the most original, but it's really kinda good.",
      "total_reactions": 0,
      "user": "Blitzcrag"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "Single white female clone with none of the originality. The acting is wooden and the plot is so far from realism that the actions of the characters beggars belief.",
      "total_reactions": 0,
      "user": "rotku"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "I'm going to be honest, The Roommate is not the best movie ever made. It's a hit and miss, definitely a rental. So, yep. That's all there is to it.",
      "total_reactions": 0,
      "user": "JosephRunzThiz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 2,
      "text": "Really? This is, indeed, one of the worst movies I have ever seen. The movie is so predictable. The ending is stupid. I wouldn't recommend this to anyone. The only reason I'm giving it a two is because Minka Kelly is  the protagonist and she's hot.",
      "total_reactions": 0,
      "user": "DevoutestDoor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "I have the oportunity to watch this film, The Roommate, and I think that can be a disaster like the critics say, but no, is really interesting, the cast is not the better, but Leighton Meester and Aly Michalka have some good moments, The Roommate is good.",
      "total_reactions": 0,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "I cannot emphasize how silly the film is even in the silly genre of slasher films which fails to even exploit due to cheap performances and the usual obseesion equals good filmmaking formula.",
      "total_reactions": 0,
      "user": "Doehl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "Oh, Come on critics!!!!!!!!!!!!!!!!!!! It wasn't terrible in the slightest. It was very entertaining and kind of creepy. The acting was very real and believable. Leighton Meester was perfect for the role of insane roommate. It's not art, but it's worth watching.",
      "total_reactions": 0,
      "user": "mds03"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "Great soundtrack which, for some insane reason, wasn't released by the studio. Weird move, because that's one of the best parts about this movie. I wouldn't say it's bad; it's just a pretty blatant reboot of Single White Female from the 90s. Main difference is that the \"crazy roommate\" is presented as crazy right from the beginning, and the \"sane roommate\" is so laid-back and chill that she's kind of blah (and makes you wonder how she could possibly overlook what's so screamingly obvious to everybody around her). So really, it's tough to sympathize with either character. Then Cam Gigandet shows up and adds some nice humor and sarcasm, but there again -- wish they would have intensified his relationship with Minka Kelly a bit more. These two share a few quickie smooches and an extremely PG-rated \"love scene\" that makes the relationship feel a lot more cool and casual than the writers may have intended. Okay, not necessarily a major problem ... until we're asked to buy into the fact that the guy would put his life on the line for this chick. Not trying to trash the movie by any means. It's worth a watch; the characters themselves just could have been written a little edgier. And the studio should have released that soundtrack.",
      "total_reactions": 0,
      "user": "slayde11"
    }
  ]
}