{
  "mc_avg_user_score": 7.1,
  "mc_metascore": 51,
  "mc_mixed_rating_frequency": 121,
  "mc_movie_name": "The Expendables 2",
  "mc_negative_rating_frequency": 39,
  "mc_positive_rating_frequency": 295,
  "mc_pro_critic_reviews": [
    {
      "critic": "Amy Nicholson",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2012
      },
      "score": 80,
      "summary": "This over-the-top sequel caters to the lowest common denominator in the best possible way, and it's so fully committed to brainless bombast that it muscles audiences to applaud by sheer force of will."
    },
    {
      "critic": "Justin Lowe",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2012
      },
      "score": 80,
      "summary": "The Expendables 2 offers the sendoff adrenaline junkies are seeking before the more sedate pace of fall releases."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2012
      },
      "score": 75,
      "summary": "What a fun-dumb relief! In the isolationist Expendables world, all foreigners are bad news. All buddy bonding is done with a wink. All pretenses of art are checked at the door. Someone even says, ''I'll be back.'' (Guess who?)"
    },
    {
      "critic": "John Semley",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2012
      },
      "score": 75,
      "summary": "It plays out like a series wet-dream scenarios, performed by a cast of vintage action figures battered and broken from overuse, bleached and slightly molted from sitting in the sun too long."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2012
      },
      "score": 70,
      "summary": "Somehow all that testosterone-infused blow-'-em-up craziness turns out to be kind of a kick."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2012
      },
      "score": 70,
      "summary": "This muscle-bound meathead extravaganza is a sometimes blissfully cretinous endeavor, delivering the maximum firepower and zero brainpower its target audience expects."
    },
    {
      "critic": "Todd Gilchrist",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2012
      },
      "score": 67,
      "summary": "As a film that even passingly acknowledges the disposability of stars in a genre whose artistic merits are considered negligible (if they're considered at all), The Expendables 2 is indispensable entertainment."
    },
    {
      "critic": "David Hiltbrand",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 63,
      "summary": "It's like a bath of stale testosterone as these Hollywood tough guys from the '80s swap references to their most famous movie lines. Their individual entrances are the primary pleasure of The Expendables 2."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2012
      },
      "score": 63,
      "summary": "On the whole, The Expendables 2 is more satisfying than \"The Expendables.\""
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2012
      },
      "score": 63,
      "summary": "More fun and somewhat more coherent than its Sylvester Stallone-directed predecessor, The Expendables 2 serves up a planeload of thickly sliced, well-aged beef and ham amid lots of stuff getting blown up."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2012
      },
      "score": 63,
      "summary": "The Expendables 2 is corny, barbaric and sometimes visually murky. But humor and self-deprecating macho charm make this male pattern badness crowd-pleasing fun."
    },
    {
      "critic": "R. Emmet Sweeney",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2012
      },
      "score": 60,
      "summary": "The highlight is a bruising pas de deux between Statham and direct-to-video star Scott Adkins, a sequence that channels yesteryear's testosteronized cinema instead of exhuming it. You can only hope the inevitable third entry will use that as a model."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2012
      },
      "score": 60,
      "summary": "\"2\" works harder to land punches, but when it does, it provides the kind of fun it's fan base hopes for. But expectations, and targets, are lower all around."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2012
      },
      "score": 50,
      "summary": "As it stands, The Expendables 2 is lazily satisfied with repeating the first movie's formula, shortcomings and grisly strengths alike."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2012
      },
      "score": 50,
      "summary": "Of course, the result is forgettable, but at least it's efficiently and breezily forgettable. What's more, there are laughs too and here's the best part – one or two of them are actually intentional."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2012
      },
      "score": 50,
      "summary": "Believe it or not, there's a strange kind of lifelessness to the movie that makes you wish it were dumber -- that it was more obnoxious and louder and crazier."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2012
      },
      "score": 50,
      "summary": "Mr. Norris arrives just as the blood baths and leaden dialogue are beginning to grow tedious, and his deadpan self-parody is pretty darn funny. More important, it gives you permission to laugh at the rest of this mindless movie, which is the only way to choke it down."
    },
    {
      "critic": "John Anderson",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2012
      },
      "score": 50,
      "summary": "Does it all have to be so tedious? To the movie's credit, many of the inside jokes are pretty funny, and Mr. Lundgren is close to hilarious as a dissipated Swede named Gunner."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2012
      },
      "score": 50,
      "summary": "Like the 2010 original, The Expendables 2 is all sound and fury signifying nothing, when at the very least it should add up to big, dumb fun."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2012
      },
      "score": 42,
      "summary": "The Expendables 2 makes a franchise out of a novelty item, and the nostalgic kick is gone: It's a reminder that most of those '80s actioners were xenophobic and dumb, that many of its stars had more muscle mass than charisma, and that the sight of these old fossils referring to themselves as old fossils is more pathetic than cheekily self-referential."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 40,
      "summary": "Why make a new mediocrity when the old ones are still so much more fun to watch?"
    },
    {
      "critic": "Matt Glasby",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2012
      },
      "score": 40,
      "summary": "\"Sometimes it's fun to run with the pack,\" counsels self-confessed lone wolf Chuck Norris. For the most part, you'd be well advised to choose the opposite direction."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2012
      },
      "score": 40,
      "summary": "There's some comedy in there, too, intentional – mostly. As a poignant study of the ageing process, it's on a rough par with \"The Best Exotic Marigold Hotel.\" For The Expendables 3, they might want to consider enlisting Bill Nighy, Tom Wilkinson and Judi Dench."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2012
      },
      "score": 40,
      "summary": "Has the parallel between the actor and the mercenary's trade ever been so overt?"
    },
    {
      "critic": "Nick de Semlyen",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2012
      },
      "score": 40,
      "summary": "A huge, bulging disappointment."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2012
      },
      "score": 35,
      "summary": "It isn't a movie - it's more like the world's most expensive, elaborate viral video, making a detour to the big screen before being broken up into more easily consumable segments to be consumed on YouTube."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2012
      },
      "score": 25,
      "summary": "Chuck Norris is also in this movie, although you should know that he gets roughly five minutes of screen time, half of those devoted to his telling of a Chuck Norris joke. That is as funny as the movie's self-aware humor gets."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "The second installment of this action series is a significant improvement over the first. The additions of Chuck Norris, Van Damme and additional screen time for Bruce Willis and Arnold help. Adding a new director gives the movie a bit more depth than the original. All in all, if you are a male who lived through the 1990's, this is clearly a must see.",
      "total_reactions": 1,
      "user": "chase03670"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "What on earth were the critics expecting from this film? Oscar standard acting? This is a fantastic classic action film that doesn't take itself seriously, and that's why it's great. The film is self-aware that it's cheesy with RIDICULOUS amounts of action that is just fun to watch. I walked into this film, wanting to see a cheesy-plot with Arnold Schwarzenegger doing one-liners that make you feel nostalgic and laugh. This film works because it self-aware of what it is and doesn't take itself seriously. For God's sake, Chuck Norris is in it!! (and he's friggin hilarious) If you want a good time, this film is great.",
      "total_reactions": 1,
      "user": "hakametal"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "I'm giving this movie an 8 because it was way more fun than any critic seemed to understand.  That said, please note this caveat - I'm a product of the 80's when all these guys were the stars of the day and I'm a big believer in action movies where you can actually tell what's happening in the action sequences, which you can in this.  I'd go as far as to say this is Simon West's best film.  But if you're under 25 and don't care about old movies at all, this flick may hold no satisfaction for you.",
      "total_reactions": 1,
      "user": "the_hetz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "Simon West's impressively mounted comeback feature after Con Air, is packed with a collage of 1980s era testosterone action awesomeness, homages, references and a very good time at the movies. The Expendables Team is far more comfortable in their roles, and the added players, especially Chuck Norris and Van Damme greatly contribute to that rare sequel that dramatically surpasses the original. The action sequences are well crafted, production values are higher than expected from the trailers - and most of it all works. Stallone and Team have created a great vehicle for expendable talent in front and behind the camera to showcase they've still got it, or for deserved stars like Terry Crews, those who should have a  feature shot. Redemption for the lame original has been earned.",
      "total_reactions": 1,
      "user": "SirEddieCook"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "Despite the actors showing signs of aging, this movie as they say in the 'Good Ole Days' is action packed from beginning to end. I seriously loved the 2nd Expendables movie than the first one. Get ready for a lot of one liners and tons of action from our old heroes. I can see people adding this one to their collection when it releases to DVD. Despite what the critics say, go see this movie if you were ever a fan of any of them in the movie. Just seeing Rambo, Terminator, John McClane and Chuck Norris with Weapons of Mass Destruction shooting the screen up at the same time is worth it!",
      "total_reactions": 1,
      "user": "Evelknievel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "This is everything you could have ever asked for in an action film: Tons of action stars, lots of explosions, bodies flying everywhere, and lots of one liners. Oh, and don't forget the cheese. Nothing makes an action film more entertaining than making it cheesy and over the top. The Expendables 2, although not art, will entertain any fan of crazy action films. As long as you don't take it TOO seriously, even though I thought the film got a little too serious for its own good in a couple of scenes, you will walk out satisfied. The acting and story are nothing worthy of an Oscar, but the actors and the writers, one of them being Stallone, get the job done. Some may gripe about how the film takes about 40 minutes to go from the 1st action scene to the next, but at least this establishes the actors and the tone that we're settling for in an hour and a half movie. When the action happens, it's great fun to watch, and that's all that should matter in a film like this.",
      "total_reactions": 1,
      "user": "Captain_Kirk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "Some films represent a director's vision for a masterpiece. Other films are nothing more than the wild fantasies of boys and men. The Expendables 2 is certainly the latter. It's an example that not all films have to be epic masterpieces or avant-grade art galleries. As a sequel to the first Expendables film, there is relativity little continuity. But with plenty of explosions, gunfire, crazy stunts and the world's greatest action stars, you have the perfect recipe for a mindless action romp. With corny one-liners, a satisfying climax and vehicle stunts that you wish you could try at home (but probably shouldn't), The Expendables 2 is great for bachelor parties and mens' night out. To sum it all up, The Expendables 2 is like a video game come to life, complete with a throwaway story, quirky jokes and more lead than a pencil factory (even though pencils don't use lead anymore, but how else could I have made that joke?\"). If you want some serious drama, then this film is not for you. If you want to see some multi-million dollar action stars doing what they were born to do, then this film is the place to see it!",
      "total_reactions": 1,
      "user": "BradleyCohen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "To anyone who give this movie a Negative review... C'mon!!! This movie was EXACTLY what it intended to be; mindless, over-the-top, cheesy fun. If you went into the theatre expecting anything else, that says more about you than the movie. No one set out to get any Oscar nominations for this film, and the acting is downright laughable at times, but it's fun! Stallone, Arnold, and Chuck Norris delivered exactly what one would expect from them. Even Jason Statham, who always seems to take his characters a tad too seriously, seemed to be having a laugh making this. Grab some popcorn, check your brain at the door, and enjoy this film. Just don't take it - or yourself - too seriously!",
      "total_reactions": 1,
      "user": "utmam"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "I don't understand the low reviews given out by the \"critics\". They obviously did not read the genre of the movie. It is an Action Adventure movie. So before you say \"oh it was terrible, I couldn't watch, the guns made my ears hurt...\" and whatever else that people are afraid to see in a movie just judge it for what it is. It's a cool action movie. It had some great lines, scenes, and a surprisingly decent story for a movie where it's main emphasis is the combat scenes and action. The special effects were some of the best I've seen and not to mention they gathered most of the best action heroes of all time to make this film. This movie deserves better then a 5/10 it's at least a 8+...",
      "total_reactions": 1,
      "user": "Enclave_X"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "This is another so-so sequel. They threw a lot of big name actors at it but then they ran into the problem of what to do with them all.  They just did not have enough big hero scenes for that many big action hero guys. The plus was some of the slap stick comedy that was tossed into the big action scene.  I loved the first one......   keep it up guys someone has to try to spice up the somewhat dull movie season.",
      "total_reactions": 1,
      "user": "pdwlsn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "If you're looking for a meaningful story and characters that evolve and all that Academy award winning stuff, look elsewhere. For adrenaline junkies and action fans alike not giving a d*** about story, The Expendables 2 delivers with high octane stunts, vicious gunfights, and explosions. Lots of explosions.",
      "total_reactions": 1,
      "user": "rastapasta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2012
      },
      "score": 6,
      "text": "What do you expect from Expendables 2? More of the same; a homage to action stars of the 80's, this time including Van Damme and Chuck Norris into the mix.  Highly entertaining and a bonafide world wide box office hit. However, actions sequences felt derivative, the only entertaining value was seeing all of your action heroes of the past, collected under one 'roof' so to speak.",
      "total_reactions": 1,
      "user": "dharma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "How about that opening scene?! Wow. The opening of Expendables 2 is like the climax of most action films now days. Stallone sure knows how to give us what we want to see. Who would have thought that the fight between Stallone and Van Damme would have been so bad ass at their age? These guys still give it better than most. Action packed is an understatement.",
      "total_reactions": 1,
      "user": "WayneThomas412"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "Just what you'd expect for a movie like this, the story isn't very involved, Bad Guys do bad things and Sylvester Stallone and the rest of the Expendables (aided by Bruce Willis, Chuck Norris and the Governator) kick their A$$es. Full of explosions and one-liners my favorite being when the Governator runs out of ammo he says to Bruce Willis \"I'm out, I'll be back!\" to which Willis replies \"you've been back enough I'll go!\" Overall just a fun movie, leave your brain at the box office and enjoy.",
      "total_reactions": 1,
      "user": "HP_Loveshaft"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "There seems to be two worlds in action movies nowadays. There are action movies with regular Hollywood actors, that were cast to bring in some cash. Then there are the action movies starring action movie stars. Those dedicated to the genre. Those who practice their own stunts and the budget is spent on props and sets rather than CGI. The latter is a dying breed.",
      "total_reactions": 10,
      "user": "MikeyMo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "I just got back from the midnight viewing of Expendables 2. For the critics, you dont understand that this is an action movie. An action movie that has more action than any movie since the 80s. Its not just explosions either. Well thought out story, didnt seem to slow down or put anyone in the crowd asleep even in the middle of the night. Even some descent jokes and one liners. Action with everyone in the cast, and not just a few lines by some from the first movie. The soundtrack didnt seem that great to me for this level of action, but music is more of a taste thing. Highly recommended, excellent film, and does not disappoint!",
      "total_reactions": 6,
      "user": "Reject_Forever"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "The Expendables 2 has everything you want in a movie of this sort: explosions, giant body count, bullets and cheesy dialogue self aware of its stupidity. But for a film that has the greatest action stars from the 70s, 80s and 90s it disappoints. Jean Claude Van Damme was awesome as the villain, but he gets too little screen time and not much action. On the other hand, Bruce Willis, Arnold Schwarzenegger and Chuck Norris have a little bit more than cameos, but they get to shine when they appear. Their presence is only there for the sake of fan service. Unfortunately, Jet Li gets thrown away of the movie out of nowhere and gets replaced with a Michelle Yeoh wannabe that tries too hard to be badass and fails miserably. Her role would have been better if it was played by Brigitte Nielsen, Sigourney Weaver, Linda Hamilton or Michelle Yeoh herself. More than an action dream team film, The Expendables 2 is a Rambo movie which happens to have JCVD, Arnie, Bruce Willis and Chuck Norris in it.",
      "total_reactions": 9,
      "user": "Mazmorrero47"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "For those who remember when action movies were over the top and ridiculously fun, this is for you. As someone who grew up in the 80s, the golden age of action films, I enjoyed the nostalgic glee this movie excites. It's ridiculous and cliched, sure, but it hearkens back to that time when action films didn't take themselves seriously. Excellent fun.",
      "total_reactions": 4,
      "user": "DrChocolate"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "This movie is for people who appreciate the old fun of movies like Commando, Rambo, Die Hard and just guns, explosions and mayhem. I loved this movie because I grew up with the classic action films of the 80s and to this day still watch them. Not to be missed if you fit into this category. It does not disappoint. Yippey ki-yay.....M&^%&^$R F%^&*%&^R!",
      "total_reactions": 13,
      "user": "bloodypuppet"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2012
      },
      "score": 3,
      "text": "The first was alright, good enough where when I heard about this sequel, it caught my attention. Then  today I finally went to see it. I'm not sure if shows like Breaking Bad, The Walking Dead, Homeland or Dexter, has ruined everything that doesn't have the high level, quality content that these shows have, or if this movie was actually very bad when it comes to content. Don't get me wrong, I wasn't expecting a MASTERPIECE, but I was expecting some excitement . It honestly seemed like a Call of Duty movie, with a stacked cast. The movie is mainly action sequence after action sequence, strung together by irrelevant conversations with poor writing with constant jokes that try WAY too hard. Honestly, don't bother, I wont stop you, I just want to inform you, It's not very good",
      "total_reactions": 9,
      "user": "AlexBugella"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "Good action flick.  I really enjoyed seeing all the old familiar faces together one more time.  I thought the story was much better than the first one and so were the one-liners and the attempt at comedy by some of the actors was damn funny.  It did seem a bit rushed at the end, seemed to finish a bit too quickly, but the finale was still good for what it was and it wasn't disappointing in any way.  There are two new additions to the team in this one, and they both do a fine job.  One of the original Expendables goes on a 'side' mission part way through and doesn't show up again, but I think this was due to a scheduling conflict he had while the movie was being filmed, although I could be wrong.  So the producers used this angle as an excuse for him to not be in the rest of the film.  Overall, this was an enjoyable way to end the summer movie season and I hope there is at least one more mission left in these guys.  I recommend it to anyone who grew up with these actors when they were starring in their own films.  Even if you're younger than that, if you like action, you'll like this.",
      "total_reactions": 3,
      "user": "SLY12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "Who needs plot or even story.  When you have most of the action hero movie royality from the 80s and 90s in one movie.....you're set.  Being over 40, seeing Chuck Norris, Stallone, Willis, Lundgren, Arnie and of course Van Damme.....it almost brought a tear to my eye.  Everyone held their own and in the end - tons of guns were fired, tons of one liners and of course the body count was high.  I turned my brain off at the door and I was not disappointed.  If you enjoyed any action movies from the above, you owe it to yourself to see this movie.  Thanks",
      "total_reactions": 3,
      "user": "Junghova"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "are people crazy who don't enjoy this awesome chessy 80's adaptation action movie? get outta here and go watch mary poppin then. this is great, i enjoyed it far better than the first! stallon, schwarzenegger, stathem, norris, van dam, crazy they all worked, it was fun action, great humor, definitely recommend this to anyone who grew up watching there movies and enjoyed their past movie productions, i had a blast and look very forward to seeing it again !!!!!!",
      "total_reactions": 3,
      "user": "Thejon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "The movie Expendables 2 was so awesome and thrilling at the same time. If no one out did not like this movie they really need their head examine from top to the very bottom. I was not boring at all and I got every dollar I paid to see this thrill ride of a movie. I think Stallone a wonderful job as usual and so did Jason.",
      "total_reactions": 3,
      "user": "Lynette"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "This movie is a love letter to hardcore action movies of years past.  And it does it well.   In fact, it's much better than the first film (which I also loved).   I think this one is just shot better.   You see the action more and see what these guys are capable of doing.  Which is kill lots of bad guys in awesome fashion.",
      "total_reactions": 2,
      "user": "bigtlikesgames"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "Decent, funny picture, which contains a load of memes and jokes about the fading action-movie stars. I laughed during all the movie. Probably that's why I overlooked dull plot and absurd production. Expendables 2, though, aren't about the plot. This movie is about fun and action. And fun and action it provides.",
      "total_reactions": 2,
      "user": "JudgeHolden"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "This movie was f***ing awesome!! Yeah this won't win any damn oscars but is that what Stallone and his badass cred are going for? Hell no! They made this film to give us exactly what we action fans wanted, all of our favorite action heroes and villains put together in one film to kick ass, and damn did they deliver. I don't even know what to say about it other than how badass and awesome this was. The Expendables 2 is a must see for anyone who loves action, and a crapload of fun put together in a matter of 110 minutes. If you're looking for an oscar nominee, or a drama, or a peaceful film, your looking in the complete opposite direction and i think you know that haha. This is pure fun and awesome. You must see this! 10/10 of course!",
      "total_reactions": 2,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "This movie is not for people that wants an amazing story with great actors. This is all about action, 80s style. With actors like Stallone, Schwarzenegger, Van Damme, Chuck Norris, Dolph Lundgren and Bruce Willis combine with new actors like Jet Li, Jason Statham and Terry Crews, you're in for a **** load of action.",
      "total_reactions": 2,
      "user": "Daddy_D"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Schwarzenegger is the F ucken man. come on people, how could you not love a movie with all these awesome actors in it? Kicks the first ones arse in a big way!!!!",
      "total_reactions": 2,
      "user": "Fordy666"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "Absolutely useless. it's got every single actor who doesn't know what acting means starring in it. Just giving in to the masses with explosions and verbal diarrhea.",
      "total_reactions": 6,
      "user": "therafe93"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "INCREDIBLY better than the first. Usually the original outruns the second one but this one blew me always when I saw it. Much more realistic action, a way better storyline, and very little slow parts. Arnold and Bruce Willis have way more screentime and the whole movie is just plain BAD@$$! This is the one you are looking for if you want to relive the good old days but with a touch of modern things!",
      "total_reactions": 3,
      "user": "mishabridun"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "Stallone: I heard another rumour, that you were bitten by a King Cobra.",
      "total_reactions": 3,
      "user": "MatchesPev"
    },
    {
      "neg_reactions": 15,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2012
      },
      "score": 0,
      "text": "No the best movie I've seen action is not very intense don' t really feel physically exhilirated. Story line was average but could be better and should also be a bit longer duration.",
      "total_reactions": 17,
      "user": "iKill4Rice"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "At last! A major improvement over the overrated original. All your favorite action heroes are back for the sequel. Good to see Arnold get some more screen time and Chuck Norris was badass too.",
      "total_reactions": 2,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "Freakin loved it.... Big explosions, awesome dialogue and the sooo many old action stars from the 90's and 80's. Now its not for everyone but if you love a good cheesy action movie then go see it. I hate when big time critics and wannabe critics get their panty's in a twist becasue it wasn't \"deep enough\". Sorry leave your purse at the door and try and enjoy it. The only complaint i had was that it may have been too short and the final fight scene was a little lacking. Also the part with Dolph Lundgren and the asian chick may have been little too creepy. Still good though, just watch and forget about you think makes a good movie and you may actaully like it.",
      "total_reactions": 1,
      "user": "Cursedderb"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "A movie so crammed with testosterone and gunpowder you can whiff it oozing from cinema screen, The Expendables 2 is everything I expected it to be. It's literally a line up of almost every action heroes for the past two decades, shooting dozens of extras with probably thousands of bullets. This movie is self-aware enough to make jokes about itself, using cliche puns for self-deprecating instead of macho bravado to entertain audience. It's efficient, predictable and quite fun actually.",
      "total_reactions": 2,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2012
      },
      "score": 3,
      "text": "Although this film should be considered to be one of the worst movies of the year for it's horrible acting pointless dialogue and possibly the dumbest and most cliche story ever, it should be noted that some of it's self aware humor does land. For example Chuck Norris telling a joke about himself. I couldnt stop laughing.",
      "total_reactions": 2,
      "user": "cabrita"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2012
      },
      "score": 2,
      "text": "Once upon a time there was a group of filmmakers that did something special at the time. They blew stuff up! Genius! Specially in the 80s. Coming out of the decade-long homage to dialogue that was the 70s (translation: they had no money for effects in the 70s, so they had to use language; who knew?!) And hence the invention of the summer blockbuster.",
      "total_reactions": 2,
      "user": "SantiagoMAKiiNA"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2012
      },
      "score": 3,
      "text": "Full Review : http://www.youtube.com/watch?v=4feQcW3a3KE",
      "total_reactions": 1,
      "user": "ChicksOnFlicks"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2012
      },
      "score": 1,
      "text": "This could have alternately been called Men Who Look Like Thugs and the addition of Maggie does little to dissipate the testosterone fog. The characters are all underdeveloped, they",
      "total_reactions": 1,
      "user": "libbycritiques"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "Disappointment. My first allegation to this movie is that it was too funny. During watching of it I felt as if I was watching Hot Shots. There is too much of a disparity between parody and darkness here. And I don`t think it`s because of Chuck Norris. He actually made a good character and played well. Some of the lines are just silly and completely out of place. Also the action scenes are average at best, vastly inferior to the first Expendables. In the first movie, every kill had its place, here it is just chaos. One would think that with such cast and setting anyone could make a great killing movie, but here they failed. The director did not manage to use the image of every gun toting hero and certainly every one of them got much less than they deserved (Schwarzenegger and Willis for example). Also, the first sighting of the main villain (named Vilain, haha) seemed just right, but he turned out to be a total wimp in the end. For sure Van Damme also deserved to be bigger here. I must say that again, it is not the fault of all the actors who played great, but fault of the whole scenario. If one had given theme adequate action scenes then it would have been simply epic. There was faaaar too much of Statham, and his knive scenes are much inferior to martial art scenes of Jet Li from the first Expendables.  I sincerely hope the director will take notes on EX2, improve on the downsides and bring back some of the magic from the first movie. Everything else in this film is great so if you don`t mind lots of parody  then go ahead and watch it.",
      "total_reactions": 1,
      "user": "MustisTheCat"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "This is a much better movie than the original. However, the confusing plot at the beginning just happens to get fizzled out till the end. Sure enough this movie has the most epic cast ever yet having more veteran actors to do their job, but it wasn't really long enough to be more epic, explosive, exciting and..... expendable.",
      "total_reactions": 2,
      "user": "jwt7000"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "Look, the film was ok, it's just that it could've been so much better with a more youthful cast instead of the geriatric squad. Seriously, what was the casting call ad like for Expendables 2 ? \"Major action film seeks has-been action stars.\" Because that's exactly what this is, a bunch of seen-their-glory-days action stars who somehow left out Hulk Hogan and Clint Eastwood, though for some odd and disrespectful reason Chuck Norris got Eastwood's GB&U; theme music for his character. Oh, and the one young character on the team  gets killed off halfway through. Give it five more years and Expendables 3 will include Tom Cruise and Daniel Craig, ha.",
      "total_reactions": 1,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2012
      },
      "score": 1,
      "text": "absolutely atrocious movie on so many levels. I love mindless action but the dialogue is so good awful that I wince with nearly every line. Cliches flying around left right and center. And how the hell are none of them getting shot? They're running around in the open like a bunch of **** making loads of noise, there's no way these guys would last five minutes in the field. Ok the special effects are good and the deaths are realistic but as the film has no substance the violence just seems gratuitous and pointless. Great, well done Sly, you can accurately depict a mans head being blown to pieces, but can you make a decent film? No. Not since Rambo 4. Van Damme bagged this film 1 star from me by just being in it though.",
      "total_reactions": 3,
      "user": "Lambo442"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "it`s a great movie with great actors(chuck norris,bruce willis,arnold SchwarzeneggerJean-Claude Van Damme and others). had a film not so long ago. I hope the third is even better",
      "total_reactions": 1,
      "user": "irmaod"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "Right from the spectacular and frenetic opening sequence, \"The Expendables 2\" makes it clear there are no punches being pulled in this tremendously entertaining sequel to the dark and explosive highlight that is the first film. Everything is just ten times more enjoyable here - the atmosphere is a bit lighter and more fun-loving, the action is just breathtakingly awesome, the sparse CGI effects are updated from the first movie, and this one actually made me laugh a whole lot. You just aren't an action movie fan if you're not squeeing through Jason Statham's bada*s knife-wielding. An instant adrenaline rush that you will be watching again and again . . . and again.",
      "total_reactions": 1,
      "user": "WriteFilmLive21"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "I absolutely loved this movie.  It became my favorite movie as soon as I saw it.  If you are a fan of action movies I cannot recommend this movie enough.  It's a blast!",
      "total_reactions": 1,
      "user": "Zman6495"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "The film begins with great action and ends the same. Fun all the way and one familiar face after another pops up and stays long enough to appreciate them being there ! Some fantastic stunts with dialogue which can be heard and understood throughout. Obviously lots of killing but shown in an action packed way without close ups and very little bad language. Expected a run of the mill action movie but came out after 100 minutes having enjoyed every moment and looking forward to the next one. Stallone must be very pleased with this work.",
      "total_reactions": 2,
      "user": "convalescenthom"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "The movie follows the most simplest of rules when it comes to entertainment: give the people what they want.  You won't find oscar-worthy performances, but you'll find exceptional beat-downs and a huge cast of \"who's who\" of the action stars with a couple more guys joining the mix the second time around.  The films captures the glory of the 80s with big celebrity-like villains while giving the more modern badass touch, and Van Damme pulls it off reasonably well.  It's great fun and every bit as good as the first film.",
      "total_reactions": 0,
      "user": "SchroederRock"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "The movie is an action packed joy ride with every major 80s and 90s hero with a few of the new good ones thrown in. You don't go more than 10 minutes without someone being killed. Don't go in expecting any sort of realistic, decent plot because you definitely won't get that. But the action and occasional comedy with movie references as well as decent acting and cool fight scenes make the movie worth the ticket price. It's not the best action movie ever but seeing all those guys together is fun.",
      "total_reactions": 0,
      "user": "theoffice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "Yo no puedo creer las criticas hacia esta pelicula, que esperaban de un film con un reparto tan grande. Esta pelicula no solo es de accion, si no tambien es un homenaje a las clasicas peliculas de accion. El filme en general es bueno, la historia tiene una historia muy simple pero lineal, y el resto... son explosiones y balaceras. Es buena para una ida al cine y para recordarla por siempre, porque muy pocas veces se presenta laoportunidad de ver a Stallone, Van Damme, Schwarzenegger, Willis y el mismisimo Norris en una sola pelicula.",
      "total_reactions": 0,
      "user": "Sgt_MorfoKiller"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "too many funny and poor of memorabilies action scenes, but very cool. Norris is a parody and i don't like this. I think there is at the same level of the first.",
      "total_reactions": 0,
      "user": "LeeChristmas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "I went and saw this with a friend of mine and we had a great time. Its full of over the top action and brutal kills but also has a very well thought out story. I loved watching all the old action heros in the same place kicking the **** out of everyone who stands in there way and I hope the Expendables 3 will be even more insane.",
      "total_reactions": 0,
      "user": "BMF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "I enjoyed it, better than the first. I thought the human from Schwarzenegger and Bruce Willis was corny, but the actions scenes were good. It's your standard over the top action shoot um up... 5,000 guys with machine guns vs 5 guys with pistols, and somehow the 5 guys win kinda deal.",
      "total_reactions": 0,
      "user": "Atticas14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "The Expendables II, the lowly anticipated sequel to the slated 2010 original which provided wooden acting and weak editing. Let's face it, no one was expecting a sequel to up the anti and kick as much ass as this no-brains all brawn all out action epic does. The Expendables, led by a Barney Ross (Sylvester Stallone, more focused on keeping his *cough* acting *cough* in check now that directing duties have been given to much... steadier hands in the form of Simon West, who was proved his action chops on several occassions over recent years, his most notables being Nic Cage Con Air and fellow Expendable Jason Statham's Mechanic) on a revenge mission against infamous European mercenery VillAin (played with gleeful OTT by a top form JCVD) after young soldier for hire and Barney's friend Liam Hemsworth (yep, that guy from the Hunger Games) is killed on what seemed a simple job.  As figured, the plots not what keeps the film going, with what seems like a story written in two lines spread like butter across a LARGE (1hr 43 mins) piece of toast. But the action... MY GOD. Every  action star, phenomen, body builder, european screen mass fill the frame every second of this picture, and no, the idea of the world's greatest action stars together in one movie DOES NOT GET OLD. If solid action is what you want (JCVD, Norris and Arnold stand out in this pic) and possibly the best performances out of Hollywood's brawn this side of the century, this film is yours to swallow up, regardless of poorly thought out plot and too many mercenaries to count let alone care for. It's worth paying to see for the Arnie jokes alone mind. 6",
      "total_reactions": 0,
      "user": "cmrcool72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "It's the essence of stupid fun.  Having some background with the big 80s action movies that it harkens back to (Cobra, Commando, Terminator, Predator, Bloodsport, Kickfigher) obviously makes the throwaway lines all the funnier.  Stallone is solid in the lead, and Statham is a terrific sidekick, but Arnold's action flick days are clearly behind him.  Simon West's directing is decent, but it feels a little undercooked.",
      "total_reactions": 0,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "Expendables 2 does exactly what it was expected to do, old fashioned action with our beloved action heroes. Aside from all that action were precious moments, being them comical moments or simply moments which add to the story, and yes there is a story, not the best story but the story everyone would expect. This sequel in my opinion is just simply better than the previous Expendables in every single way, and the references to the other films these actors were in are just priceless, also very good fighting scenes.",
      "total_reactions": 0,
      "user": "Cabbage_Cry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "The Expendables 2 is much better improvement than its predecessor. Even I can't believe I like this movie, it offers script, testosterone, gunfire and madness.",
      "total_reactions": 0,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "In 2010, experiencing The Expendables on the big screen became the ultimate wet dream for avid fans of action films due to the outstanding ensemble cast of actors, practically are the symbols of the genre, the explosive action and the manliness of it all. Although it met with a mixed critical response, it was not long after the announcement of the sequel in which the majority of the gang would reprise their roles to take another intense adventure with the new action heroes added to the pack. What you see with The Expendables 2 and its predecessor is exactly what you get! It may have quite possibly the most exhilarating, badass and physical action you will ever see, but it still is a rather corny film that could quite easily come across as a guilty pleasure.",
      "total_reactions": 0,
      "user": "SJMJ91"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "More of this please.  The Expendables 2 is everything you want in an action movie.  Compared to overlong, boring, pointless \"action\" fare like say, Transformers, etc., Expendables 2 has believable (if a tad cliche) characters with clear motivations doing awesome stuff and that is where Stallone and Company GET IT.  Is Expendables 2 a perfect movie?  No.  Is it fun?  Hell yes.  The opening gambit is tongue-in-cheek machismo to the max and everyone involved in the film seems to be having a blast.  Of course, there are some cheesy parts and I thought it was overdoing it to have Willis and Swartzanegger doing each others old catchphrases, but if those are the biggest problems, sign me up for more movies like The Expendables.",
      "total_reactions": 0,
      "user": "Zack2981"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "This movie was exactly what a expected. Lots of fun, plenty of cameo appearances and cheesy one liners with loads of action and humor. I loved it, no it doesn't have a good story line or a well written dialogue but if that is what you are after you would not be going to see this movie in the first place.",
      "total_reactions": 0,
      "user": "gromit"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "If you have seen any action movies from 80's or early 90's this is for you. Packed with every action hero out there it just can't go wrong. Yes there is bad acting, but it belongs to this genre and especially to these actors.",
      "total_reactions": 0,
      "user": "Eleci"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "This was a fun, fun movie. I loved the fact that the dialogue was witty with some tongue in cheek ribbing at the larger than life actors that are in it. If you are a child of the 80s you need to see this movie! I laughed right out loud and clapped my hands too many times to count. Well, done...well, well done!",
      "total_reactions": 0,
      "user": "gamerm0m"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "After the first Expendables, I expected not to like its sequel. I was wrong though because this film had a better plot than the first",
      "total_reactions": 0,
      "user": "Penderworth"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "This movie was all of your expectations put together and blew it out of the water with some grungy action and one liners that have some flair. This was a pretty good film, a lot of actors you saw in the 70s, 80s, 90, and present in a big movie that's biggest problem was when no one was shooting each other which was not too much time so it was overall an enjoyable film. Go and rent it on DVD.",
      "total_reactions": 0,
      "user": "a7xfan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "Expendables 2 was probably the only movie where I didn't expect good acting or a strong, instead I was expecting a lot of cheesy one liners, everyone killing everyone, non-stop action and I was excited about it. You know who these people are you've seen their movies or heard of them so you should know what you are getting yourself into. I just wanted to see these guys do what they do best and that's killing terrorists \"together\". I found myself laughing through out the entire movie especially the machine gun spree in the airport and that satisfying Chuck Norris joke. For this movie I will only rate it as how good the explosions were, how good the fight scenes were, and how good the killing spree was. It's definitely a good time!",
      "total_reactions": 0,
      "user": "Efrain"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "The lines \" I'm back \" and \" I'll be back \" by Arnold made this movie well worth the price of admission add in   cliches from action legends and you have a thoroughly enjoyable popcorn flick.",
      "total_reactions": 0,
      "user": "Jooshua"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2012
      },
      "score": 4,
      "text": "This movie is bad, just plain bad.  Entertaining?  Perhaps, in some way, for a fraction of the population.  The movie intends to be a throwback to old 80s macho action (as did the first) and yet it completely lacks their genuine charm.  The story is cliche and predictable, and the dialogue is not funny or even cute, but cringe worthy.  If it is worthy of anything, it is being able to decipher that Stallone's IQ is probably somewhere in the low 90s.  The action is admittedly impressive at times, though it gets repetitive and since our heroes will always dominate it becomes worthless towards the end.",
      "total_reactions": 0,
      "user": "CriticalState"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2012
      },
      "score": 6,
      "text": "What a Cast ! Literally ! The Expendables 2 was like a high class Action Movie with amazing sequences , Rusty Violence , Good locations , Good Direction and an freaking ensemble cast ! But its wasn't a perfect movie only because of the bad plot choice , poor dialogues  and characters screen time ! Most of the dialogues were so awful , plot had many holes which made the movie totally meaningless ! Most of the characters couldn't even showed what they are made of ! Not gonna talk about the acting , coz they did what they can do best . West's direction was very good so was the shooting locations . Overall a bit disappointing , If only they could chose a different plot and script this could be The Action movie of the decades . Sadly it wasn't but yeah ! It was very interesting to was!",
      "total_reactions": 0,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2012
      },
      "score": 5,
      "text": "Yes I know it was an action movie but even the action got or felt kind of dry after the first 20 minutes that seemed the best part of the movie. I don't know if at this point I desire something else from movies, with the likes of Transformers 3 boring the pants of me in spite of all the incredible CG. I love action video games and their CG sequences, they seem to bring the flow of mayhem and action scenes to life, maybe that's why I'm jaded to just sitting there and being fed the drool? Seriously the first battle was the best part of the movie, making the rest of it seem uninteresting. I can remember only Arnold's roles and one scene (that involved a plane and a mineshaft, I will say) that interested me after that.  The first movie had a ton of scenes a really enjoyed and still look up and watch from time to time, from little crazy dialogue to the action scenes themselves.",
      "total_reactions": 0,
      "user": "teh_angry_night"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 6,
      "text": "The big thing I would consider in this film, is that despite it was so abrupt and logic less, it had some parts where there was life to the characters. This is a big improvement in the series. Well, there might be good browny points from Simon West",
      "total_reactions": 0,
      "user": "pharmach"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2012
      },
      "score": 6,
      "text": "Oh God the lines. I know its suppose to be cheesy but God, I haven't cringed so much in a movie in recent years due to purely the retardedass corny as hell dialogue. Esp that Yu Nan actress - why the hell is she in tis movie? (\"Oh aromatic duck is so sexy\". Who the HELL calls the food 'sexy'? And God, her manner and her way of saying things...arrogant and really really try-hard at best). Did the Chinese government had some sort off part in the funding the film? She really screwed up the movie for me. She's like a light bulb - the movie would still be fine without her. Why not get Gong Li, Michelle Yeoh or Lucy Liu? =______=",
      "total_reactions": 0,
      "user": "aznassassin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "It was a fun movie to watch, very similar to the first with the action, similarly a lot of things were unexplained, such as bullet wounds suddenly disappearing, and the over-usage of jump cuts, whether those two link, I don't know, possibly. It produced a few laughs though, enjoyable movie.",
      "total_reactions": 0,
      "user": "Garian"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "It wasn't that bad. I liked how the violence was toned down from the first film, which was a little too over the top and unrealistic for me. I am disapointed that the final showdowns were so short though, They could have capitalized on it if they were longer. The worst thing about this film though was all the cheesy one liners through out, They were just awful and at times so stupid that you couldn't help but laugh. Overall, Not that bad of a movie and should be given a chance by all action film nuts.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2012
      },
      "score": 2,
      "text": "This movie has an all star cast who basically all phoned in their performances.  I thought it would be a halfway entertaining thriller but instead it turned out to be a world vacation for the actors.  Most of them smirked all the way through the film.  It was boring, trite and I would have walked out but I was already home.",
      "total_reactions": 0,
      "user": "sonnyday161"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "Uproarious, forceful, and - most notably - fun, \"The Expendables 2\" is one of the more rarer occasions when a gratuitously violent action sequel is actually better than the first.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "The Expendables 2 has a bunch of explosions, realistic hand-to-hand fight sequences, and guns and gore galore just like the first movie did. However, this sequel did some things better and some things worse. Looking at the good side first, it did actually have a little big better plot development and believe it or not, even more action heroes. Adding Chuck Norris and Jean-Claude Van Damme to an already loaded cast and then having Bruce Willis and Arnold Schwarzenegger each get more screen time were all plusses. All of the little inside jokes were absolutely hilarious, as well. The Arnie one-liners, Die Hard references and Chuck Norris jokes were fun little easter eggs for long time action fans. The problem is that this film somehow found a way to have even less character development than the first film, feeling somehow even more shallow. I actually really missed Mickey Rourke's character in this sequel. I thought he added so much to the first film in how he seemed to humanize the cast, especially Stallone's character. I suppose you could argue that Liam Hemsworth's character does that instead but I don't think there should necessarily be a limit on depth. And while those little nods to the 80's were funny, they actually took away from the seriousness of the film. Seeing Rambo, the Terminator, and John McClane all shooting bad guys side-by-side may have seemed awesome but there was simply too much of the over-the-top element in this movie. I felt the first film found the perfect balance between giving each action hero their due while staying true to making a great movie. This film, unfortunately felt like a parody of the first at times, rather than its own movie.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "A thoroughly entertaining action film with gratuitous violence and unbelievable firefights certain to thrill. On par with its predecessor, and in some regards a more rewarding experience.",
      "total_reactions": 0,
      "user": "MouthofSauron"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "The more I watched the first instalment of Sly Stallone's ensemble action flick, the more i disliked it, but this certainly changes the pace and creates an over the top action bonanza with a half-decent story and plenty of one-liners to amuse the array of fanboys witnessing this film.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Its follows the path of the first one, beeing a mindless action movie with explosions, gunfights and cheesy one liners. And it knows how to entertain the audience.",
      "total_reactions": 0,
      "user": "Caestus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "This movie is for those who want to kick back and watch some real action stars.This movie is not for the \"Girly Men,\" so if your the type of guy looking for the perfect story this is not for you. I`m looking at you, all of you critics! If you watched these guys back in the 80`s it`s fun just to watch them come together.It  was more than just action for me, I also like the jokes thrown in about their age and the fact that they all come together in this movie. I hope they make a third, I need a third with Wesley Snipes!",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "One of the best action movies I've ever seen. It ups the ante from the first movie, giving us more of the best action scenes around. But what really makes this movie shine is the cast. The greatest action movie stars are here kicking butt, taking names, and dropping hilarious one liners. Bruce Willis and Arnold Schwarzenegger are able to take part in the action this time, and seeing Chuck Norris and Jean Claude Van Damme in this movie is awesome. It's awesome and if you like action movies this is a must watch. I really couldn't have been more impressed.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "If you bought into the gory, glorious premise of The Expendables, but were disappointed by the slack plot and dull action, The Expendables 2 is here to win you back over. Boasting even more beefy action stars of various vintages and skills, plus an obscenely fun villain played by none other than Jean-Claude Van Damme, The Expendables 2 actually fulfills that original promise of an over-the-top, slightly tongue-in-cheek action movie that revives 80s macho bloodsport while poking just enough fun at it as well. How much you enjoy all the CGI blood and flying bullets and goofy one-liners will probably depend on how much nostalgia you have for these guys-- though some things, like the charming rapport between Sylvester Stallone and Jason Statham, or Van Damme's scenery-chewing baddie, translate no matter how many times you've seen First Blood. And while the plot is once again dead simple, that's a good thing here, getting away from the convoluted political dealings of The Expendables and diving into straight-up evil. Van Damme plays a notorious Belgian arms dealer who has unlocked a cache of plutonium buried in an old Russian mine. He's kidnapping local villagers and working them to death to get at it, but even worse, he's killed someone the Expendables cared about to get there. Clearly, they must stop him.  The Expendables 2 isn't nearly clever enough to operate as an actual action movie as well as a parody of one-- maybe they'll hire Edgar Wright to write the third one and seriously up their game-- but it is a good amount of fun, especially for those going in for the nostalgic thrills they've been promised. Maybe they're all geniuses for lowering the bar so much with The Expendables that we can't help but be grateful to this one for actually being a good time.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "I’ll admit I was a disappointed with the first Expendables movie but with a new director and new action stars, including the legendary Chuck Norris, on board this sequel delivers on its promise. Thanks to its simple plot the focus is kept solely on the over the top action and that’s exactly how it should be.",
      "total_reactions": 0,
      "user": "drlowdon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "Exactly what you'd expect.  Lots of shooting, high body count.  Almost a parody of the old 80's action movies, but a damn entertaining one.  First action set piece was pretty good.",
      "total_reactions": 0,
      "user": "NRGMan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "This was a movie that should have never been made. The Expendables 2 has somehow managed to be even worse than the original. This movie consists of one thing and one thing only, over-the-top action for simple minded people. Besides the movie's sad attempt at story, the only other laughable thing is the handful of nods toward popular works from these \"superstar\" actors.",
      "total_reactions": 0,
      "user": "askseventeen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "Expendables 2 is an alumni all-star game of 80's action stars. Just like any get-together, Expendables 2 is more about fun and memories than it is about present day. Criticizing it with movie standards would feel like writing review for old friends who came to jam in one's backyard.",
      "total_reactions": 0,
      "user": "Mr_Muumi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "I enjoyed The Expendables 1 a lot more than this one. One of the main let-downs for The Expendables 2 is that the CGI is horribly done. Its really bad. Now, most of the time I don't notice CGI in most films, but they just made it flat out obvious and disappointing. The worst part is the budget for this film was $100 MILLION... Yet still horrible CGI. I know they had to use it in one part because 'environmentalists complained that filming could damage the cave and endangered species' fair enough...",
      "total_reactions": 0,
      "user": "Dalek"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "This is the most stupid comedy. We laughed a lot. Director  a complete moron. Though he'd read about Russia, if the brain itself is not. All filmed about Russia  complete nonsense. Never in Russia do not have anything like that shot in the film: the city, the building, advertising, people, language, form  all  And the comparison with the Russian language Ukrainian and yet somehow with feta could only come up with a real jerk.",
      "total_reactions": 0,
      "user": "444444"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2013
      },
      "score": 5,
      "text": "The story is simply bull  Its just a matter to have a movie I the only thing thats importand is the action and the cast. There are all those great action actors in one movie. If you don't bother the script you would like it. The action is epic and amaizing. Its sad its actualy random.the movie made exclusive for action so I give it rating:",
      "total_reactions": 0,
      "user": "TailGunnner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Movie full of action, explosions and fighting. All the old-time action movie stars are reunited with some new ones, cracking jokes tied to themselves and their own movies from the past that are known and even funnier when presented by themselves personally. When you are watching it you want more of the dialogue more of the action and more of everything packed together. The movies is naive though and with that as its only flaw overall it's an excellent experience.",
      "total_reactions": 0,
      "user": "MamaTLF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "King of the pulpy, shoot-em-up action sub-genre, the series second installment has more jokes, more action, and the actors seem to be having a more of a blast than in the first one.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "Good actors bad acting,enjoyable but its not what you come to expect as the acting is pretty lame and the story line is pretty lame as well,but if you like fast paced,guns,explosions and some comedy then i suppose you wont mind this.",
      "total_reactions": 0,
      "user": "Twist_Of_Fate"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2013
      },
      "score": 4,
      "text": "This film is the Michael Jackson to my childhood's Macauley Culkin. That being said, my rating policy dictates that any film featuring Arnie automatically qualifies for an extra point so 4/10 it is.",
      "total_reactions": 0,
      "user": "SavileLovedMe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "This is really a what you see is what you get movie.  Cheesy action and simple plot, which is what makes it so good.  This movie is very self aware of its cheesiness and even takes funny jabs at each of the characters and some of their previous movies.  There is nothing amazing about this movie but I really like it, worth a rent or bargain buy.",
      "total_reactions": 0,
      "user": "mijxero"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "The Expendables 2 was full of potential. But too many crappy in-jokes conspire to ruin the movie rather than augment it. Having Chuck Norris in the movie is great, but wouldn't it be nice if his arrival made even the slightest bit of sense? A disappointment then... But be patient and you'll be rewarded with a nice Stallone versus Van Damme smackdown, which is undeniably thrilling for every child of the 80s.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "Just watched ‪this movie‬ absolutely best movie I have seen, it is hilarious and has lots of action in it at the same time. ‪The next movie is coming out this summer, and I am definitely going to see it in theaters. Hopefully the third one is just as good as the first two. It will have the same actors but, two new actors are appearing in this one Harrison Ford and Wesley Snipes. It will have to be good.",
      "total_reactions": 0,
      "user": "Movielover19"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "To remove Sylvester Stallone from the director's chair, and to replace him with Simon West might be the best thing with The Expendables 2. It's so much better than the previous installment of The Expendables.",
      "total_reactions": 0,
      "user": "TheApplegnome"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "Once again the beloved Terry Crews returns to our screens, this time in a plot not too different to the first film (the one without the 2 after it) sadly Stallone, Statham and the rest of the Expendables are still unable to match his acting capabilities. Terry Crews is simply a master of acting, he is unable to do any wrong and although Stallone being the selfish, greedy actor he is has limited the amount of dialogue and air time Crews receives on the film, he still shines throughout.",
      "total_reactions": 0,
      "user": "TerryCrewsFan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "\"one of the bad ass most fun violent movie ever \". I have not seen Stallone's The first expendables but  characters have not changed a bit Crews Still Bad ass when it comes to his favorite Machine Gun , Statham",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 9,
      "text": "Its not a thoughtful movie. Its a brain-dead movie embodiment of Call of Duty. They went ahead, hired all the actors from Cult Classics like Rambo and Terminator and Rocky, then threw in a few lesser known actors, a few new actors, and gave them all huge arse guns and said \"Have Fun\". And so they did. Its goofy, stupid, bloody, mindless, and i've watched it way to many times",
      "total_reactions": 0,
      "user": "Garfoodle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "A more animated violence department makes the 2nd installment of the Expendables franchise make it less serious than the first movie and more walks a line between parody and homage to the films that made the ensemble cast famous in the first place.",
      "total_reactions": 0,
      "user": "NotoriousFraud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "...................................................................A Masterpiece that never stay tied.............................................................",
      "total_reactions": 0,
      "user": "Zanessa250QI"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2015
      },
      "score": 10,
      "text": "..........oneofbestmoviesofalltime..................................................................super incredible..................................................",
      "total_reactions": 0,
      "user": "sicrano"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2015
      },
      "score": 6,
      "text": "Much better than the first one! The action scenes look really cool, in fact everything in this movie looks cool. The plot has also improved. They make references to the previous films of the actors and this is indeed funny. However that doesn't change the fact that The Expendables is still no more than this, a collection of references to other films, not exactly a film that has something of it's own. It's still fun, though.",
      "total_reactions": 0,
      "user": "FilmQueen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "Expendables 2. Didn't think that Expendables 1 had enough action? Will the second one has all of it. It has tons of action, gun/fighting scenes, and best of all it has the same cast again. Everything that you need in an action movie is right in this movie.",
      "total_reactions": 0,
      "user": "azgoodaz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "Alli the sequel to \" The Expendables \" , well a lot of action , with the toughest Hollywood actors Stallone, Statham , Li, Lundgren , Crews, Schwarzenegger , Willis, and Van- Damme, including Liam Hemsworth did nothing ?, because of action in \" The Hunger Games ,\" but what will be the exception of Hemsworth to participate with the toughest ?, Because we do not know but this movie had some left over action, but lacked entertainment, but it was the best movie of \" The Expendables \" I've seen in my opinion.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "Its packed with action filled scenes that is truly entertaining. I also love to see all the action stars all together in one cool film like this.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2016
      },
      "score": 7,
      "text": "Sylvester Stallone had a brilliant idea that came to fruition in 2010, with an action movie that brought together all the big names in the action movie genre, but there was a problem. You just can't fit every big name into one movie and give them all significant screen time, so you had to have a sequel. The more things change, the more they stay the same, however, as this time, the story was a bit better, at least for an action movie, and the cast was a bit younger, but the basic genre was still the same. Barney Ross's (Sylvester Stallone) team is once again brought together to do a job, this time there are some new younger faces, to complete what seems like what should be an easy job, what they weren't expecting was to stumble right into the middle of a madman's master-plan. As I said, the story wasn't as basic this time, things were a little more complex, but on a basic level this is still you're typical shoot em up action film, with bodies and explosions constantly coming at you. What I did like was how they change things up a bit and didn't just feature the same actors, even though many members of the team were the same. The one thing the first film was severely lacking was youth, and I don't know about you, but I'd much rather see Liam Hemsworth fighting with his shirt off than Sylvester Stallone. All in all, the sequel doesn't differ that much from the original, but where it does, only helps the series. The cast is younger, the story is better, and the action hits harder. If you're an action junkie, it doesn't get more exciting than the Expendables and the sequel will have you craving a trilogy.",
      "total_reactions": 0,
      "user": "Tss5078"
    }
  ]
}