{
  "mc_avg_user_score": 8.1,
  "mc_metascore": 79,
  "mc_mixed_rating_frequency": 36,
  "mc_movie_name": "The Fighter",
  "mc_negative_rating_frequency": 9,
  "mc_positive_rating_frequency": 387,
  "mc_pro_critic_reviews": [
    {
      "critic": "Adam Smith",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2011
      },
      "score": 100,
      "summary": "An exhilarating fight-flick that, like its scrappy central character, is impossible not to root for."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 100,
      "summary": "Virtually flawless performances and directorial execution render The Fighter one of the most thrilling movies of 2010."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 100,
      "summary": "That rare film in which every performer in it leaves the viewer in awe."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 100,
      "summary": "A movie so rousing, so real and so full of complicated emotions that it all feels brand-new."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 91,
      "summary": "It's a film possessed of its own force, wit and style, and it builds to a rousing climax that absolutely pays off in crowd-pleasing fashion.  It knows what it is, doesn't try to be what it's not, and hits you with drop-dead force.  In short, it's terrific."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2010
      },
      "score": 91,
      "summary": "This one, as thoughtful as it is rousing, scores a TKO."
    },
    {
      "critic": "David Ansen",
      "publication": "Newsweek",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2011
      },
      "score": 90,
      "summary": "Urgent, gritty, sometimes weirdly funny, The Fighter might be considered his first feel-good movie. But Russell's too honest and acute an observer to serve up affirmation without leaving a subversive aftertaste of ambivalence and unease."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 90,
      "summary": "David O. Russell's film makes use of some terrific performances - Christian Bale is brilliant, as is Melissa Leo, even by their lofty standards."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 90,
      "summary": "Russell has always excelled at finding new ways to use familiar actors, and every performance in The Fighter is noteworthy if not outstanding."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 90,
      "summary": "While the film handles itself well in the ring, it's brilliant in the arena of a blue-collar family that brutalizes its younger son and best hope for worldly success in the name of sustaining him."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 90,
      "summary": "The rousing The Fighter tries a number of risky maneuvers and manages to make them pay off in the end. The movie initially feels like more of a near thing than the filmmakers anticipated, but as in boxing it's only the final decision that counts."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 90,
      "summary": "With solid bodywork, clever feints and tremendous heart, it scores at least a TKO, by which I mean both that it falls just short of overpowering greatness - I can't quite exclaim, \"It's a knockout!\" - and that the most impressive thing about it is technique."
    },
    {
      "critic": "Calvin Wilson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 88,
      "summary": "Director David O. Russell (\"Three Kings\") delivers a film of staggering impact."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 88,
      "summary": "If you think \"Rocky\" and \"Raging Bull\" define the alpha and omega of boxing movies, think again. David O. Russell's The Fighter proves there's still punch in the genre, especially when a filmmaker tells a familiar story in a brand-new way."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 88,
      "summary": "The Fighter is funny, ferocious, sad, sweet, pulpy, and violent. Sometimes, all in the same minute."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 88,
      "summary": "An off-center but exceptional boxing film I prefer in every aspect, especially one: It feels like it comes from real life as well as the movies."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 88,
      "summary": "The Fighter, its heart full to bursting, is an emotional powerhouse that comes close to spilling over."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 88,
      "summary": "Visionary director David O. Russell so deftly weaves the family's story that we, too, are initially seduced by Dicky."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 88,
      "summary": "The Fighter is this close to a triumph: a movie that steeps us in the grit of its time and place - Lowell, Mass., in the 1990s - and electrifyingly dramatizes Ward's battles with the family that almost loved him to death."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 83,
      "summary": "Bale's live-wire performance typifies the many major and minor elements that elevate The Fighter from the deeply conventional sports movie it might have been into the endearingly offbeat sports movie it turns out to be."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "The movie has so much texture that once it gets you, you're good and got."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "At its best, The Fighter takes on the chasm between televised boxing and its mostly working-class, aspirational origins with grit and intelligence."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "By far the most rousing, expertly cast movie this year, David O. Russell's movie takes a roundabout way of telling its true story."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "The picture makes too many concessions to the Hollywood judges, pulls too many punches. But at least it has real punches to pull, because there's honest sweat here too, and a full complement of those archetypes that lie at the popular heart of the genre."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "A punch-drunk tale whose fitful ramble from Jerry Springer-style family seaminess to \"Rocky\"-like triumph is elevated enormously by knockout performances."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "Ultimately, The Fighter loses its courage and betrays the terms of its own story by fashioning an interpretation designed to please the people it portrays. It does a switch on us, by changing its focus from Micky's character to Micky's career and then pretending it was really about the career all along."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "A boxing movie swinging in too many directions at once, as if someone sneaked a third clubber into the ring. All the emotional punches land solidly, to occasionally devastating effect, but at the conclusion you're not sure which competing cliche wins."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "Cast against type is Amy Adams. Normally tabbed for sweet and innocent roles, Adams here dons the persona of a confrontational bitch."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "These are characters so repulsive that it's hard to care what happens to them, but it's to the credit of a superb cast that you do end up caring."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 70,
      "summary": "Bale dominates the movie as Dicky Eklund, a pathetic loudmouth who's let his own fight career slip away from him, yet what really holds this together is Wahlberg's low-key, firmly internalized performance as a man torn between his loyalty to the clan and his responsibility to himself."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 70,
      "summary": "The screenplay, credited to three writers, has that over-doctored feeling to it, and we're asked to take on a larger redemption tale that undermines the truth of Bale's wholly unsympathetic portrayal of a drug addict and a narcissist. The Fighter's desire to show us what that awful combination looks like is overwhelmed by its urge to show us a Hollywood-style triumph."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 70,
      "summary": "In its small moments, say when Walhberg sighs that his robe misspells \"Micky,\" The Fighter feels clued-in to the very small, very tough world of a man trying to make his way out of his block-and after getting to know his family, you want to help him pack his bags."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 70,
      "summary": "If The Fighter feels like kind of a mess, lurching from one scene to the next as if the film itself has taken a few hits to the head, that's not entirely a bad thing."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 67,
      "summary": "Only Amy Adams, playing Mickey's tough-tender girlfriend Char­lene, manages to be convincingly working-class without seeming either dopey or rabid or strung-out."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 63,
      "summary": "The weakness of the film is the weakness of the leading role. That's not a criticism of Mark Wahlberg, who has a quite capable range, but of how he and Russell see the character."
    },
    {
      "critic": "David Fear",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2010
      },
      "score": 60,
      "summary": "You can't necessarily blame Wahlberg, as his modest performance is the one element that feels truly authentic and heartfelt."
    },
    {
      "critic": "Read full review",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 60,
      "summary": "The Fighter, for all the dedication of its players, takes a heavy swing at us, and misses."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2010
      },
      "score": 55,
      "summary": "The tragedy of The Fighter is that Wahlberg's performance suggests a character who wants more. And yet Russell barely seems to notice how much subtlety Wahlberg brings to his role, or to the movie at large."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "Pity the boxing movie that thinks it can be both \"Raging Bull\" and \"Rocky.\""
    },
    {
      "critic": "J. Hoberman",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "It plays as a \"Rocky\"-fied fairy tale for our time: Consigned to Palookaville, a sweet, unassuming boxer with more heart than brains steps up-all the way to the top of the world."
    },
    {
      "critic": "Kirk Honeycutt",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "So like much of this film, the viewer is turned into an observer. You never feel close enough to the action, either in the ring or in the kitchens, living rooms and tough streets where the story takes place. The characters engage you up to a point but never really pull you in."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "It could have easily been yet another underdog boxing film we have seen before, but the subtle lead performance of Wahlberg, the flawless supporting appearances of Leo and Adams but most importantly the dynamite dominating portrayal of his hero/waster/catalyst brother make this a great film to watch.",
      "total_reactions": 2,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "A good movie that had two serious false notes.  1) It portrayed Micky Ward, a boxer who in reality was always willing to go toe-to-toe with his opponents, as a defenseless punching bag.  The only conceivable reason was to manipulate the audience into worrying about him.   2)  The Cambodian crack-whore character didn't look remotely strung out.  Not only was she gorgeous, she looked healthier than anybody in the theatre.",
      "total_reactions": 2,
      "user": "Insomniacker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "To the head, to the body, to the Budweiser:  The Fighter (a true story, yet a thinly-masked Budweiser commercial, to be sure) deserves accolades, yes, but why is every punch delivered with the same video-game sound effect? Never loud for some punches, fainter for others -- just punch-sound, punch-sound, punch-sound: Get real, sound editors. Of course, it's nothing new that fighting sounds have always been exaggerated in Hollywood (with the possible exception of Jeff Bridges' punch in Peter Bogdanovich's \"Last Picture Show\"), and there is indeed much integrity in the history of boxing, but why is knocking someone out still a sport? Isn't boxing just romanticized human rooster-fighting? For the same reason we hire babes in bikinis to hold up \"Round 1\" signs, we (more often than not, males) are apparently just animals out for sex, blood, and Budweiser (and if we are not, that makes no difference for what Hollywood sells). That said, I thought Wahlberg (strangely, no nomination) and Mellisa Leo (nominated for best supporting actress [and later winning that award with an historical (expletive!) acceptance speech]), were both excellent, and the mother's 7 white-trash daughters were both intentionally amusing and scary. Is it worth seeing? Sure -- it's a true story, and Wahlberg and Bale (who also later won an oscar) offer genuine portrayals. Lastly, you had to love the clip tagged on the end with the real brothers from Lowell, Mass. They did not need to tell you who was who--it was a charming tag after an unsettling story.",
      "total_reactions": 2,
      "user": "Tim-T"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "Awesome film. As per usual, both Wahlberg and Bale do an outstanding job of acting, as does Amy Adams as Micky's girlfriend. At the end of the day, it's a sports movie, but it's an extremely good one that has characteristics most typical sports movies do not have. It draws you in with the in-depth and at times depressing story of Micky Ward's life and then his turn around into a champion.",
      "total_reactions": 2,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "\"The Fighter is an Emotional , compelling , Truly inspirational film. Christan Bale and Mark Whalberg give the performances of there career in One of the finest boxing films i have ever seen. The Fighter will have you stand up and cheer .. SEE THIS MOVIE!!\" .. A+",
      "total_reactions": 1,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "A great sports drama, elevated by powerful supporting turns from Bale, Adams, and Leo. The story is uplifting, without being melodramatic, and is greatly helped by Russell's realistic direction. If Bale does not win, let alone be nominated for, an Oscar for this, I'll be shocked, as it's right up the Academy's alley.",
      "total_reactions": 1,
      "user": "Tony"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "Most realistic boxing action yet to grace itself on the big screen. Memorable and convincing roles from Adams and Bale make this one of the best movies of the year. Wahlberg takes us somewhere special in the ring, but loses his rhythm amidst the side plots and out-of-ring action. Overall, you have to give credit where credit is earned, and The Fighter does just that as it throws you with a hook that you can't seem to dodge. Highly recommended; a can't miss holiday outing.",
      "total_reactions": 1,
      "user": "FDT44"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "I was suprised. I expected it to be good, but it was awesome. The Drama was realistic, the fighting was exhilerating, and the acting was superb. Go see it",
      "total_reactions": 6,
      "user": "MetalMan95"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "The Fighter is a very complex film that catches you from the beginning to the end, and this is for the topics that treats; with this I do not refer to the boxing, but family conflicts, drug problems, free thought and a society that lost the sense of right and wrong.",
      "total_reactions": 5,
      "user": "NedRyerson1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "The story is consciously repeating what it does, which results in a frigid ending. However, its Christian Bale that you will like, not Mark Wahlberg or David Russell.",
      "total_reactions": 8,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Wahlberg not Warlberg...sorry. My impressions remain the same with regard to my earlier review of this fantastic movie !!!! Additionally, I must also compliment the other actors who all played an integral role in without this total chemistry it may have just been good rather than fantastic.",
      "total_reactions": 4,
      "user": "WayneGMedeiros"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "Though it might not be the next \"Rocky\" or \"Raging Bull\", \"The Fighter\" is built by a very strong supporting cast that should make this a strong addition to the Boxing Genre in movies.",
      "total_reactions": 3,
      "user": "brewcrewpride"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "I thought it was going to be a tiresome cliche movie with manufactured scenes, but I was dead wrong. The movie as a whole has a lot of CHARM. The cast was outstanding from top to bottom and Bale nailed every scene with perfection! Naturally,  people will compare this to Rocky base from the trailer alone and boxing element, but if you watch the Fighter entirely, you will see that its a totally different. Rocky and The Fighter deserve to be known as their own. Another thing to keep in mind is the Rocky was art imitating life (inspired from a true event), while The Fighter was life imitating art (a true story).",
      "total_reactions": 3,
      "user": "brokenglasses"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "Great performances by the four core actors (Whalberg, Bale, Leo, Adams) but also a great story that takes you on an emotional ride in the Ecklund/Ward family. A classic story of redemption.",
      "total_reactions": 3,
      "user": "elliott23"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "This is the best movie I have seen in a long time. Great acting all way around. Good script and the action was superb. I heard several people watching saying they got goosebumps from several scenes. Hard to imagine a better movie this year.",
      "total_reactions": 4,
      "user": "howard74"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2010
      },
      "score": 6,
      "text": "As a huge fight fan, and a fan of Micky Ward, I was hugely disappointed that this movie isn't better than it is. Mark W plays that same character he always plays.  I love Melissa Leo from \"Homicide\" and \"Frozen River\", but her role borders on caricature.  Similarly, Christian Bale completely overplays his part.  The 6 or 7 sisters are hilarious, but not at all realistic.  Amy Adams does a terrific job, however - she's the standout here.  And on a final note - I was very disappointed that they didn't get to any of the Gatti bouts.  Those were incredible fights and said so much about Ward's character.",
      "total_reactions": 2,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "The principal characters - Wahlberg's gounded soul, Bale's troubled druggie cloud, the mother's controling nature - are superb. Kind of a 2010 version of Rocky. However, the supporting cast of the seven trailer park trash sisters were just too stereotypical. Bale should receive a supporting actor nomination.",
      "total_reactions": 2,
      "user": "JackScribe"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "I really wanted to love this movie. After reading the reviews and seeing the trailer, I had such high hopes for The Fighter. I was so very disappointed. The acting was outstanding, however, the characters never drew me in. I felt bored throughout the whole movie. It was just so predictable, and long.",
      "total_reactions": 11,
      "user": "LauraJean"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "The Fighter is one of the best movies I have ever seen! Everything from beginning to end is amazing. The acting is beyond perfect, especially Christian Bale. He's so talented, personally, I think he's up there with Johnny Depp, Gary Oldman, Anthony Hopkins, etc. Mark Wahlberg was pretty great too, but is accent was inconsistent. It went from light to non-existent to heavy. Still, he gave a wonderful performance. If you guys are at the movies and don't know what to see, definitely check out The Fighter!",
      "total_reactions": 2,
      "user": "EliteF50"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Oscar-bait gets a near perfect score from critics and cretins alike. Who would have thought! Oh, the tears in my eyes. The performances, the script...magnifique!",
      "total_reactions": 1,
      "user": "feardrinker"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 6,
      "text": "Sports dramas can fall either into \"rousing entertainments\" or more the way of a \"character study\". \"the Fighter\" belongs to the first group, where it sits about as high in my esteem as \"the Boxer\" with Daniel Day-Lewis does on the \"character study\" side: it's fair and has redeeming qualities, but in it's group it sits behind \"Rocky\" and just a notch passed \"Cinderella Man\" as \"the Boxer\" sits behind \"Raging Bull\" and \"the Wrestler\" in it's group. Mark Wahlberg is not quite comfortable yet as a leading man, and the movie considers too much of the archetypal blue collar behavior that surrounds him and drowns out his performance. Not a bad movie. It passes the time. But after the hype fades over the next couple of weeks, people will come to their senses on this one, I think. As far as rousing entertainments go, \"Secretariat\" beats this one by a length.",
      "total_reactions": 2,
      "user": "MovieJay"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "I was very hesitant to see this film, because I hate sports movies about the underdog that wins the big game/match at the end.  There are a hundred of those movies and I'm sick of them.  This movie, happily, is not about the boxing.  It is about the family dynamic.  Christian Bale is the standout performance.  He's barely recognizable in the film, having lost a lot of weight for the part and made up to play the crack addict brother.  The movie straddles the line between humor and drama and you get attached to the characters.  Definitely one of the 10 best films of the year.",
      "total_reactions": 1,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "This is a masterful movie. Everything from the script, to the direction to the acting is superb. You wait all year for a movie this good. Don't miss it. Oscar nominations to come.",
      "total_reactions": 1,
      "user": "KellyP"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "You can't necessarily blame Wahlberg, as his modest performance is the one element that feels truly authentic and heartfelt. follow  review in http://www.cinscreen.com/?id=1107",
      "total_reactions": 1,
      "user": "movi60cent"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "If I'm going to watch a film about a bunch of classless characters  (with the exception of Wahlberg's) at least show it to me with some class...throw me an original music score, exercise style with the camera, instead of relying in only hand held close-ups. The fighting sequences were awful..they felt artificial and under-rehearsed (specially the one in which Ward knocks out the boxer from mexico). Walhberg played it soft, but maybe too soft....",
      "total_reactions": 5,
      "user": "Careojo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2010
      },
      "score": 4,
      "text": "This movie is  not a boxing classic--whoever said that.  The characters seem to be something of a caricature--do people like this really exist?   I just can't imagine there are real people so 'in your face.' Bale was barely recognizable--too much over the top as a crack addict.",
      "total_reactions": 1,
      "user": "Scrummaster"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "One of the better sports films of the last decade, The Fighter combines great acting, exciting fight sequences, and a powerful script to make an overall great film. Likely to be nominated for best picture at the Oscars.",
      "total_reactions": 1,
      "user": "Zorgly"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "This film would have been better without the constant intrusion of the mother and family ties, half their input and more about the boxing would have been a big improvement.",
      "total_reactions": 3,
      "user": "juliet1000"
    },
    {
      "neg_reactions": 15,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2011
      },
      "score": 1,
      "text": "Horrible movie. Another boring boxing movie filled with unnecessary drama? We need something new. I would much rather watch Reel Steel than this rubbish of a movie.",
      "total_reactions": 15,
      "user": "Dorrbecker"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2011
      },
      "score": 3,
      "text": "How the heck this movie got such good reviews is completely beyond me. Its a joke of a film. Bales performance is way overthetop and not believable whatsoever; it boarders on fascicle and stupid. The fighting is ruined by the camera and the added sound effects which take away from the seriousness of the film. 3 is being generous its probably worth half a point. Waste of a film",
      "total_reactions": 1,
      "user": "3lusive"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "The Fighter sorry to say is another typical boxing movie only with the screwed up  family, a brother who is a crack addict and a girlfriend who is just trying help mark wahlberg along. yet of all the strong acting the leading role fell flat in which made the movie flat as well.",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Exactly how uneducated and emotionally stunted are the fighter's seven sisters, the hairspray-addled girls who give Charlene(Amy Adams), a barmaid, such a hard time? Very uneducated. Very, very stunted. That's how much. Concerning adulthood, the \"girls\" put to mind that old adage, \"they know the words, but not the music\". Set in 1993, the Ecklund sisters, some of them clearly pushing forty(Asian women age better), are like eternal teenagers, catty and fiercely cliquish, under the watchful eye of a domineering mother, so eighties, it hurts just looking at them. That Alice(Melissa Leo), she's a real piece of work. Her kids are all messed up. The movie's use of Whitesnake's \"Here I Go Again\" suggests that Nirvana never made it to Lowell, Massachusetts. While it's the brothers who know how to take and deliver a punch, the sisters seem to be the ones who ended up punch-drunk. To them, a college...dropout, not a graduate, mind you, is cause for class warfare. Any man alive, let alone a woman, has to be brave to enter the Ecklund household; enter the fighter's girlfriend, a former URI high-jumper, categorically dismissed as that \"MTV girl\", a woman deemed by the \"white trash\" Greek chorus to be something akin to a fleshy hood ornament on David Coverdale's car, weathers the name-calling and wouldn't be faulted if she chose to fight fire with fire, by pointing out the elephant in the room that Dickie(Christian Bale) brings into the open during the film's most telling scene. Tired of living in his brother's shadow, Micky finally summons up enough intestinal fortitude to set his vampiric family straight, when the aging pugilist announces his plans to tarin year-round in Las Vegas, while Charlene sits not-so-quietly on the couch, lending moral support throughout this long-overdue ostracization process. The wisdom of the move, of course, is challenged. First, by Alice, who resorts to emotional blackmail so transparent, a panel of judges, if there was one present, would have awarded the fight to Micky, by unanimous decision, and then by a brother whose rhetoric functions like punches that never land. Swing and miss, swing and miss goes Dicky(whose claim to fame was a moral victory over middleweight boxing legend Sugar Ray Leonard...almost fourteen years ago), and his mouth, spouting out the pros of staying home to train, just like he did in his prime, without a trace of self-awareness about the ramifications that this tragic decision entailed. Because Dicky remained staunchly local, and surrounded himself with the dope fiends of this working class borough(he's known as \"The Pride of Lowell\"), he helped contribute to his own demise, succumbing like he did, to the crackheads and the prevailing milieu of social and economical decay. He had help, of course, but nobody has the heart, not even Charlene who claims to hate him, least of all, the fighter's father(henpecked to death by Alice) and the fighter himself, to lay bare the facts about this almost famous fighter's life since his brief taste of fleeting fame. \"The Fighter\" doesn't spell it out for moviegoers, but everybody can plainly see how the matriarch's sick promotion of familial tribalism(it's sick because Alice is willing to repeat the same mistakes with Micky) led to he favorite son's downward spiral, not to mention, the smaller roundabout southbound spirals of her cartoonish sisters. Speaking of cartoons, that's what the multiple incidents at the neighborhood crack house resemble, a Warner Brothers short, in which the mother and first-born son take on the personas of the Road Runner(she's fast, beep-beep, nine kids) and Wile E. Coyote. (Dicky has a friend he calls \"Boo-Boo\", which makes him Yogi Bear, I guess.) Like the feral dog, the crackhead constantly finds himself in the same fatalistic predicament; he's falling down from a high place, a \"cliff\"(an open window), that ends with a thud(instead of the canyon floor's hard surface, he lands on a bed of garbage bags), in which he miraculously walks away from with nary a scratch. The coyote nearly kills the lightning-fast bird. Likewise, it's what Dicky does to his mother each time she surprises him at his drug den, that is, until Alice's compartmentalizing skills takes on a life of its own, by which she compartmentalizes the truth away. So Micky stays east-side, and eventually breaks away from his Looney Tunes family, but it's only temporary, since the whole clan is back in the fold before Ward's title bout with Englishman Shea Neary. As a result, Micky's victory feels somewhat tempered by Dicky's all-consuming hunger for recognition, co-opting his brother's success into his own, by feeding on the championship boxer's afterglow. True to form, during the post-script, some doc footage shows Ward struggling to get a word in edgewise from his showboating older brother, trying to steal the movie, and perhaps, succeeding.",
      "total_reactions": 0,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "A strong cast--Christian Bale, Mark Wahlberg, and the dysfunctional family, sound pitch-perfect as people caught in the riptide of addiction.  The mother from hell and her harpies add punch to the major characters.  We're in Lowell; we want out.",
      "total_reactions": 0,
      "user": "wordmaster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Great story, great performances.   I see a lot of movies but seldom am as moved as I was with this one.  There was a lot of ugliness in the movie, but a lot of beauty too.  Great performances by Mark Wahlberg, Christian Bale, Amy Adams, Melissa Leo, Mickey O'Keefe (who played himself), and Jack McGee.",
      "total_reactions": 0,
      "user": "sfjcg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "Spot on brilliance,realness,beauty and the kind of movie that new movies should take notes on.The kind of movie that you can really watch over and over just for the acting performances.",
      "total_reactions": 0,
      "user": "Jobadkins"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Some of the best acting you'll see in any film this year. Adams and Leo are both great while Bale takes it to another level as Dicky Eklund. Every scene with Dicky in it is mesmerizing. The boxing scenes are very realistic, and the movie kept me entertained throughout. My only complaint would be the timeline displayed in the movie which ignores several key Micky Ward fights while completely ignoring his amazing trilogy with Arturo Gatti.",
      "total_reactions": 0,
      "user": "AJackson729"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "Painfully real at times, this movie touches on big, lofty themes while retaining a small, intimate feeling -- and even some oddly humorous moments. Christian Bale once again is astonishing, though it's painful seeing him really thin as in \"The Machinist.\" Somehow I felt Mark Wahlberg could have done more with his character; it's not as if he's terrible, but I could picture any number of other actors in the role.",
      "total_reactions": 0,
      "user": "Lyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "This is ultimately a film about relationships so don't expect a film with fight scenes ever fifteen minutes. The acting in this film is generally outstanding making ever character lovable and frustrating in their own ways (except of course Wahlberg). Christian Bale is fantastic in his role, absolutely fantastic. The only thing that limits it is its grinding pace but otherwise, a great film.",
      "total_reactions": 0,
      "user": "themoza"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "Uniquely written, floundering back and forth between drama and comedy, then depressing, yet optimistic. Christian Bale displays one of the finest acting performances I've ever seen. Although pieces of it played out as too Hollywood, especially the ending, it was beautifully shot and very entertaining.",
      "total_reactions": 0,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "O.k., so I am working my way through the films that were nominated for best picture, The Social Network...I don't understand that nomination at all, what the heck is so good about that film?  When I talk about a movie that I've seen, I try to not ruin it for people that have not yet seen it, so that usually means that I can't really say anything about the ending, because just by characterizing the ending, you can say too much, so that's why I'm not going to say anything about the endings, but I will try to tell you whether it's worth your time or not.  The Kids are Alright, was pretty good, so I can see it being on a list of ten films.  Inception, was great, and there were some aspects of it that I loved, but I thought that it ran a tad long, and got confusing in places.  Winter's Bone, I guess that you would have to characterize that as a \"sleeper\" film, because I don't think that it's getting the audience that it deserves.  Before I saw The Fighter, I would say that Winter's Bone was the best film that I saw from 2010, it is gritty, understated, and so very worthwhile, the atmosphere in that movie was so real, so palpable, a fantastic movie to me, certainly on the list, and a contender for number one.  I have my copy of The King's Speech, but I am watching it tonight, haven't seen it yet.  I can be pretty critical of moves, but after watching The Fighter last night, I bow down in awe.  Masterful is not too strong of a description, I can't say enough about how much I loved it, and it's based on a true story, which doesn't happen all that often.  The performances were amazing and riveting.  I am not one to watch movies that I've seen over again, but this one and Winter's Bone, I will, gladly.",
      "total_reactions": 0,
      "user": "JED_Houston"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "With films such as Rocky or Raging Bull, it would seem as if that boxing-based movies would be a died out and worn out genre. While I will not say director David Russell's The Fighter brings a new aspect to the table, his film extensively brings out the talent of its actors overshadowing the ensemble of other 2010 favorite Inception. The Fighter is a well-directed and captivating piece, and is as true as its performances.",
      "total_reactions": 0,
      "user": "RyanGee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "The advertising leads you to believe this film is about Mark Wahlberg's character \"Irish\" Micky Ward, who once held the world welterweight boxing title. But this film is as much about his brother (astoundingly played by Christian Bale) and his mother (an incredible performance by Melissa Leo) and the twistsed/loving relationship they all had. Director David O. Russell has created a world that feels completely real, a bit freakish and almost stylized in its comic moments (especially the sisters). Every scene is layered, dynamic and a virtuoso spectacle of directing and acting.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "It was a decent film. The story was ok but never really hit as hard as it could have. Bale is simply amazing in this and is perfect for this film. Wahlberg is ok but he doesnt really seperate himself from other roles that he has been in. Overall its a solid film that is worth watching simply for Bale.",
      "total_reactions": 0,
      "user": "asylumspadez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "the cast did a wonderful in this movie. everybody did a great job. the cast made this movie good. Very good script. One of the best boxing movie I seen. Fantastic movie. I didn't think it was going be good at all. I usually don't watch movie about sports and bade on a true story. This movie deserve all the awards it getting. This is Amy Adams best movie so far. I love Amy Adams now because of this movie she is one of my favorite actress. I think everybody should see this movie. It is definitely  worth your time.",
      "total_reactions": 0,
      "user": "iamtrent424"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "Based on a true story of professional boxer Micky Ward, The Fighter is about how Micky Ward (Mark Wahlberg) fights his way of family and friends to the championship title. Dicky (Christian Bale), Micky's half-brother and trainer, is a drug addict that always fail to show up for training. Their relationship is complicated because Micky wanted more than just a crackhead brother who doesn't know what he's doing. Supporting along that line come Alice (Mellisa Leo), the brothers' mother and manager, who also wants Micky to stay with her and Dicky instead of going to someone better. After meeting the love of his life Charlene (Amy Adams), who convinced Micky that his family's no good, he decided to go on and try something else. Success with the new manager and trainer, Micky got the shot of the title match. Mark Walhberg who plays the boxer is to many critics the lowpoint of the film. Everytime the camera focuses on him, it seems like he doesn't have anything to say. Perhaps the writing for Walhberg isn't as concentrated and too vague compare to his co-stars. Walhberg was suppose to carry the film with his role but instead it felt like his co-star Christian Bale did all the heavy lifting. Playing a drug addict who went to jail for resisting arrest and assaulting an officer, Bale (Dicky) was at his best. Emotionally understanding and physically confused by years of sitting on his ass, Dicky's only job was to train his brother into the championship. Bale gave up this amazing vibe that he knows what he's doing but at the same time too confused to do it right. The film, rather than focusing on Mark Walhberg, did a completely different character study on Christian Bale. Carrying along the heavy loads are Mellisa Leo and Amy Adams who played the mother and girlfriend of Walhberg. Leo and Adams had a chemistry in which both hated each other and both share the same goal of helping Dicky. Delivering explicit lines, Amy Adams is the best I've seen her in years. With two Oscar nominations already, she might even earn her third. Though the cast is above average, the writing in some parts were off. It seems like the writers wanted the actors themselves to carry the film without dialogue. They thought they can depend on the actors, but it is impossible for the actors to do any good without a solid script. David O. Russell finely crafted the film, but at times, it looked as if only the fighting scenes count. Focusing too much on the fights instead aiming to offer drama, he made the movie looked like an ESPN fight show. But set aside all of that, David O. Russell's got a talent in him and the fight scenes do look amazing. Perhaps his biggest contribution to the film is his directing of the cast.",
      "total_reactions": 0,
      "user": "OscarPicks2010"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "Love the genre. This film is all about Bale's ability to fit into character and steel the movie from a supporting slot. Also, it relays on the intense Mom (Melissa Leo) and great ensemble of spinster sisters. Yet, it shouldn' t be named The Fighter but My Brother's Keeper -in a perfect reference to James Joyce. Overall it is a good genre film + Bale is a must see. @cinemaquote",
      "total_reactions": 0,
      "user": "cinemaquote"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "If you stay for the credits and see the real Dicky and Micky, you realize you've just watched the truth.  This movie is the truth.  Pure and perfection.  Hiring the guys who actually do the fights for HBO added to the authenticity.  I just have to wonder who yelled the most... Bale or Russell.  But who cares.  They made a classic.  Bravo.",
      "total_reactions": 0,
      "user": "jdolan74"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "rich, complex characters.  incredibly well told story.  christian bale should win.  i can't believe i'm saying this, but it was my favorite movie of the year.  definitely a must see.",
      "total_reactions": 0,
      "user": "iwillb83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "The Fighter is an excellently acted, scripted and paced pugilistic bio-pic. It entertains and uplifts. What more could you want from a boxing movie? Amy Adams in a black lace bra? It's got that too!",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Amazing movie with very believable actors and a classic portrayal of Micky Wards life. Christian Bale absolutely deserves the Best Supporting Actor award. I only wish they would have put at least the first Gatti fight in. BTW the kid who said the KO of the Mexican was unbelievable and ill rehearsed is a moron, don't listen to him, it was IDENTICAL to the actual fight.",
      "total_reactions": 0,
      "user": "SugarFloydTyson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Passionate, powerhouse performances. Amy Adams is amazing. Mark Whalberg is a knockout. Christian  Bale is scary good and ridiculously convincing! See. This. Movie.",
      "total_reactions": 0,
      "user": "NancyB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "Who doesn't like an underdog story? We haven't had one this good in a long time. I went for Amy Adams and Christian Bale, but was pleasantly surprised at Mark Wahlberg's understated, calm performance. In a film with so many intense characters, it is not easy to hold your own without screaming and punching. Miraculously, Wahlberg - the fighter - is the least aggressive yet gives some clarity to the chaos.",
      "total_reactions": 0,
      "user": "savagesophia"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Completely disregard Bama72's entire review.  He is obviously a troll on the metacritic website.  This movie was fantastic!   The cast was perfect, and Christian Bale's performance was dead on.  I wouldn't be surprised if he wins best supporting actor.",
      "total_reactions": 0,
      "user": "PaulCharles"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "This movie brought a tear to my eye. Being former golden gloves myself, I can say 100% that they nailed the gritty life of a pro boxer with this film. The brother dynamic that the actors captured is genuine and moving. This film is on par with the likes of Ali and Cinderella Man and exceeds them in a few ways. Hope this review helps.",
      "total_reactions": 0,
      "user": "Skeptikal"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "Solid story of redemption. The climatic boxing footage is surprisingly real...like real-real. I found myself pumping my fist after Ward landed his vintage left hook to the body. Still, despite as the world has told you already, Bale's (again) masterful transformation, I wasn't knocked out (call it an 8-count though)....Like I wanted to be. Gatti-Ward 2 was better. Props to David O'Russell though for admirably adding to the VERY short list of excellent sports films that aren't really about sports. Plus that pot shot at Belle Epoque...classic.",
      "total_reactions": 0,
      "user": "DKay"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Superb. The best part for me was the comedy offered by the female characters and Bale's perf as the crack addicted half brother. The story was told without silly camera moves or other self-indulgent nonsense so often deployed by Spike Lee, Scorcese, Tarantino and Aronofsky. Simple effective and engaging entertainment.",
      "total_reactions": 0,
      "user": "kormac66"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "Very good movie. Part sports movie part family drama. Part Raging Bull part Rocky. The acting is the standout here however. Mark Wahlberg does a good job but for me Christian Bale steals the show. I'm going to bet on a Oscar nom for this performance. At times you hate Dicky and don't want to see him come back from the abyss but in the end you have to give in to him just like Micky does. Also good work from the female cast with Adams and Leo both brilliant. If you like a solid rousing sports movie you'll like this.",
      "total_reactions": 0,
      "user": "allystew"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Sooooo goood! All around great job by all actors.  Christian Bale stood out especially.  Mark Wahlberg also does a great job.  Amy Adams turns in a really good performance as well.",
      "total_reactions": 0,
      "user": "ALangdon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "The first time I saw Christian Bale was in Steven Spielbergâ",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "For a script that was ignored by both Aronofsky and Scorsese , David O.Russell has shown very well that he too can uplift an audience.",
      "total_reactions": 0,
      "user": "Mojo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "\"The Fighter\" is not really about boxing. Boxing is just the means to tell a story about family. The movie shows how, on the one hand a family can be an obstacle. But on the other hand, it is nice to know there is always someone standing behind you. One just has to find the balance between one's personal autonomy and a family commitment. It is interesting that we all try to first rid ourselves from dependence, but then strive to found a family in the first place. \"The Fighter\" has pretty good acting, as well as good filmmaking. Worth watching.",
      "total_reactions": 0,
      "user": "juliankleiss"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "As good as my  favorite movie of last year, The Wrestler. Similar great supporting roles and sympathetic hero. Christian Bale and Melissa Leo should get nominations for best supporting  roles...Amy Adams might get a nod as well. Only reason I don't give The Fighter a 10 is Mark Wahlberg's good,but not exceptional work as main character. Some critics have not liked the humor that pops up from time to time in the movie. I could not disagree more...this is exactly what makes the whole thing work.Watching  crack-high Bales dive out the window to avoid his family is priceless and sad at the same time. See it",
      "total_reactions": 0,
      "user": "farmer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Like Rocky but with backbone and edge to tell a story rather than entertain. What made me want to watch this movie was Mark Wahlberg's immaculate performance in 'The Departed' which surpassed Damon's, DiCaprio's and Nicholson's all at once in the same film. Once again the acting is near perfect and not just from Wahlberg, but from Bale, Adams, Leo, the WHOLE cast seems to ooze the reality of a Massachusetts neighbourhood. I suppose what's most important is that i feel like I've just read Micky Ward's autobiography and know all the details about his rise to brilliance. Personally, the best mainstream film and my favourite film of 2010. Personally, I would build O' Russell a house with mountains of BAFTA's and Oscar's he deserves.",
      "total_reactions": 0,
      "user": "06Morrow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Just got back from the theater and I must say that fighter is an amazing film. From the art of the directing style to the emotionally gripping pieces, It is nothing short of a master piece.",
      "total_reactions": 0,
      "user": "Kuruk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Great movie.  Bale does a great job portraying a crack head, very believable. The actors do a great job of portraying lowell and new england. Not a glamorized boxing movie, seemed very real.",
      "total_reactions": 0,
      "user": "danp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "Exceptional Cast, In the right mood on the right day this fine piece of film will draw every emotion, Perfectly set and acted with locals in Lowell, MA. (lived there). Hats off to Christian Bale, Drops weight again, (will gain again soon). Great film.",
      "total_reactions": 0,
      "user": "backlot7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "I think that this film is second only to \"Social Network\" in the Best Picture category this year!!! Great cast, Impressive performances from all the A-list actors and Melissa Leo is definitely a dark horse for Best Supporting Actresses. I think the only knock against film is that we seen Boxing bio-pics to many time before, but just because it been done doesn't make an less of a  great film. Bottom line, definitely go see this film.",
      "total_reactions": 0,
      "user": "MrC3030"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "Ah, Bale experience is always a nice one. Fine acting, nice story, not so good performance by wahlberg, but for me he is more producing genius, not so good in acting. therefore 8/10...",
      "total_reactions": 0,
      "user": "aryanrule"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Ok lets be fair, this isn't as good as Rocky... Or Cinderella Man, or Million Dollar Baby for that matter.. It is thoroughly watchable, but seems to be stuck in the middle ground of being a seriously great movie and a box office \"hollywood\" hit.",
      "total_reactions": 0,
      "user": "MrSteer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Led by captivating performances from Mark Wahlberg, Christian Bale, Melissa Leo and Amy Adams, The Fighter is a solidly entertaining, albeit predictable, entry in the boxing drama genre.",
      "total_reactions": 0,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2011
      },
      "score": 9,
      "text": "I was dragged to The Fighter and loved it.  I expected a boxing drama and got a complex story that was more about family than pugilism.  Some say the performances border on caricature; I think the Wards themselves border on caricature.  It doesn't matter whether Alice and Dicky, and the wonderful wolf pack of sister, were exaggerated.  They brought a comic element to the movie that was unexpected and uproarious.  A $200 debt invalidates one's opinions.  That was funny beyond words.  Melissa Leo, Christian Bale and Amy Adams were amazing.  And it was a good boxing drama too.",
      "total_reactions": 0,
      "user": "ChgoSteve"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "This movie wasn't as good as the reviews suggest but it was good enough to watch and enjoy. I may possibly watch it again in the future but only because of Amy Adams.",
      "total_reactions": 0,
      "user": "TheChaser1985"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "Quite simply a knockout of a film! I have to concede that initially I didn't expect to much from this film but it was an absolutely awesome movie. Unlike other boxing films that have failed The Fighter gets the right recipe in mixing together the key ingredients of the boxing, the drama, the emotion and the story in what is an extremely realistic movie its gritty and very lifelike but also provides some genuinely fun moments! The film follows the younger days of \"Irish\" Micky Ward (Walhberg) and his journey to become World Champion, trained by his drug-addicted brother (Christian Bale). However, its a powerful film and there are some sublime performances throughout the film which justifiably saw Christian Bale and Melissa Leo (Alice Ward, the mother) picking up Oscar's for Best Supporting Actor/Actress, Bale was outstanding as Dicky Eklund in what must be one of the performances of his career whilst Leo was at her best in her portrayal as control-freak Alice Ward, just amazing! And not forgetting Wahlberg, who for a change is actually pretty good as Ward and Amy Adams is on fine form as Charlene Fleming. What sets The Fighter apart from other failed bpxing movies is the fact that this is more than a boxing movie! Its got the perfect combination and in doing so provides an engaging, exhilarating and staggering feel-good film. A must have movie!",
      "total_reactions": 0,
      "user": "Rosco"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "Rented this movie out of the Redbox.  I had avoided seeing it as I figured it was just a another fight flick.  Christian Bale steals the show from the first segment and keeps blazing to the end.  No wonder this dude won the Acad award.  Should have got best actor (sorry King).  The entire cast is amazing.  I loved the mother, the sisters, the family craziness.  I was on the edge of dread the whole movie hoping the family wouldn't drag poor Marky Mark down with them.  This is a fine move.  And the best one dollar rental of the past three years.",
      "total_reactions": 0,
      "user": "chandutt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "The performance of Christian Bale and Amy Adams lift this movie from mediocrity and although there is nothing surprising or that hasn't been seen before it is worth a watch although don't set your hopes too high as it's no Rocky and is a million miles from Raging Bull.",
      "total_reactions": 0,
      "user": "rotku"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "The acting is so sublime and the story so heart-wrenching, the movie is impossible to forget. Christian Bale stands out in my mind in what is one of the most stirring and beautifully acted roles I've seen in a while. An absolute pleasure.",
      "total_reactions": 0,
      "user": "harlanpepper"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "Bale steals the show here, plain and simple. He truly has transformed into this role and it is just amazing to watch him in the perfection of his craft. All other players give outstanding performances but Bale drives the film and makes it interesting. This film had a tendency to drag, but the family drama is magnified to such an extent that it's hard not to feel for them. Leo gives an especially strong performance here as well and portrays yet another completely transformed character. However, this film just doesn't have that strong underdog punch that so many of us wanted to see.",
      "total_reactions": 0,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "lets forget about the movie and talk about CHRISTIAN BALE!!!!!!!!!!!!!!!!!!!!  he was excellent.  CHRISTIAN BALE did a great job playing dicky.  his character was touching and funny and messed up.   I liked this movie because of CHRISTIAN BALE.   Mark Wahlberg did okay.  MELISSA LEO was great as well.   Amy Adams was good.",
      "total_reactions": 0,
      "user": "lovemusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "The Fighter is a truly fine example of good old-fashioned filmmaking, but with a modern, gritty twist. Yes, Christian Bale does deserve the universal praise he has garnered as the good-for-nothing older brother, but it is as much Mark Wahlberg's film as it is Bale's (as it should be - he is the protagonist). Wahlberg gives a masterclass in the subtlety of acting, bringing across with ease what it would be like constantly living in your domineering elder brother's shadow. Unfortunately, subtlety doesn't win awards, though Wahlberg and Amy Adams should receive special recognition for sharing the screen and holding their own against the scene-stealing performances of Bale and Melissa Leo. Surprisingly enough for a boxing movie, the fights are probably the least entertaining aspect of the film, competently done though they are - it is the in-depth character development and and crackling family conflict that make The Fighter so truly memorable.",
      "total_reactions": 0,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "This movie is a work of art. The acting is better then you could ever hope for in a movie and the story movies along at the perfect pace. Amy Adams, Melissa Leo and Christian Bale really deserve all the praise they are getting for what they did in this movie. Christian Bale and Mark Wahlberg clearly took the roles seriously and worked their bodies into ridiculous physical shape, both strong and strung out. This is a must see for anybody who loves movies.",
      "total_reactions": 0,
      "user": "moviegrabbag"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "I went into this movie thinking it was just going to be another sports movie. BOY I WAS WRONG! Fantastic performances and just a great dramatic movie that leaves you pinned to your seat. It is no wonder Marky Mark tried to get this movie made.",
      "total_reactions": 0,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "The Fighter is a lot like Good Will Hunting: It's rife with thick accents, family issues, big dreaming, and more than few moments of violence. Now, that I've gotten that out of the way, I'll get to my real point. The Fighter is like Good Will Hunting because it looks like a routine genre flick, that actually ends up being an interestingly idiosyncratic drama, built on a focus on the scene behind a rather obvious, to reveal a new layer and poignant story.",
      "total_reactions": 0,
      "user": "J-Shap"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "An inspiring story and Christian Bale and Melissa Leo give their best performances to date, great acting, great writing, great directing, and great storytelling make this a great movie.",
      "total_reactions": 0,
      "user": "zizzoT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "Fighter est un vÃ©ritable upercut! bien entendu, les sÃ©quences de combat sont filmÃ©es avec brio et rÃ©alisme. Mais le plus important reste la relation entre les deux frangins (Mickey et Dicky). Et mÃªme si le film nous offre une brochette d'acteurs talentueux (Ã©tonnant Mark Wahlberg), ils sont tous dÃ©passÃ©s par Christian Bale, tout simplement exceptionnel. Voir un tel acteur dans un tel film, difficile de ce relever aprÃ¨s ce direct!",
      "total_reactions": 0,
      "user": "avatar16"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "The story of Micky Ward, the Lowell, Massachusetts boxing underdog who fought his way to the top of the game was destined to be a movie.  The Fighter features larger-than-life characters, a love story, and some truly rousing fight scenes, and yet itâ",
      "total_reactions": 0,
      "user": "TheMudDoctor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "It has the action, heart and emotion reminiscent of Rocky. Expertly directed and terrifically acted, The Fighter stands tall in the category of great inspirational films. 4/4 stars.",
      "total_reactions": 0,
      "user": "marnee96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "Although predictable and not inspiring. The Fighter has incredible performances from Adams, Wahlberg, Bale, and Leo. So it basically saves the movie. I give this movie 65%.",
      "total_reactions": 0,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "Christian Bale is amazing in this and its worth watching for him alone. It was an ok film but I just never liked it that much. Wahlberg was a disapointing lead and the script seemed to skip most of the drama that it could have capitalized on.",
      "total_reactions": 0,
      "user": "spadenx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "My friends loved this show, however, I found it to be more of a rip off of rocky, I didn't think it was as good as it could have been. However, it wasn't a bad movie. I would rate it an average movie.",
      "total_reactions": 0,
      "user": "LonelyMan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "I do like this movie, but I do not love it. The performances were great -except from those one of the sisters- and evidently, the relationship between Mickey, and the other characters is portrayed realistically yet, at times it feels shallow.  The characters are stereotypicals and often  bordering the caricaturesque... somehow forced. Finally, I would have loved to see a bit more of Micky training, and the whole inner and outer process he undergoes before he becomes the world champion, because obviously, his personality evolved. Sadly, in the film, there is almost no transition from old Mickey to New Mickey. It was a two hours movie; paradoxically, considering its length, I expected much more...",
      "total_reactions": 0,
      "user": "RegOz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "When you compare this film to other boxing films like Rocky and Raging Bull, It doesnt compete. Wahlberg was average at best in this film, Bale was simply amazing and the only reason for actually watching this. Its a slightly above average sports film, Nothing more imo.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "Fascinating story and brilliant acting especially from Christian Bale makes this movie well worth a view. Its a shame that they left out some of the matches Micky lost, I Wonder if its to glorify his career. Nonetheless it is a very good movies with some great acting.",
      "total_reactions": 0,
      "user": "Jes1310"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "THE FIGHTER: LIFE-AFFIRMING",
      "total_reactions": 0,
      "user": "tipsology_net"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "Mediocre to the core I'd say. The movie plot was a bit too plain and it didn't reach the climax spot. It just wasn't there, except for Christian Bale's awesome performance. He transformed into a complete person, I almost didn't recognize him. Expected more, but the movie gave less.",
      "total_reactions": 0,
      "user": "jzme"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "David O. Russell's brilliance certainly comes through with The Fighter. But it's the cast of performers than excel this beyond just another boxing film. Christian Bale is gritty and honest, and on that note, so are Melissa Leo and Amy Adams.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "The cast is great. There are funny well acted characters. The story is just kind if,  blah. The acting is the reason why you want and should see this movie.  The boxing just adds as a secondary attraction.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "A Really Complex Film That In My Opinion Was 100% Ignored From The Public...",
      "total_reactions": 0,
      "user": "GagaForGhibli"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "A fantastic film which has an unbelievable cast. Everyone pulls their weight and with the storyline and characters vying for your every emotion, this is a film for all, not just boxing fans. I almost felt as if Micky Ward (Mark Wahlberg) wasn't the main character but his brother, Dicky Eklund (Christian Bale), was. It felt like a Ben Affleck film (and I mean that as a complement), about the hardships of growing up around Boston. This is a film of one man's dream and all the obstacles that are placed in his way to stop him.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "A good movie about a boxer balancing between his family, his management, his girlfriend and sports. Great performance by Bale and a well-deserved Oscar.",
      "total_reactions": 0,
      "user": "StaticSpine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Every performance is excellent and Bale is perfect. The Fighter tells a story of lies, love,  and perseverance, and is quite possibly the best film of the year.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "The Fighter is a great movie, no doubt about that. The only minor problem was the performance of Walhberg, he could have made his character more eager. Mick's desire to make his own life better and to earn the championship needs to be developed more form Walhberg. However, Walhberg's act as a modest person is legitimate.",
      "total_reactions": 0,
      "user": "Canotic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "This is not just another underdog boxing story. It's more so about the dynamics of family, more specifically, a chaotic and at times detestable family. And it is incredibly real. There is no fluff here. Just all of the love, frustration and difficulty that comes with life's web of human relationships when things don't always go your way. It's entertaining and the characters are so much fun to watch. Great acting from everyone, especially Christian Bale who gave just about as convincing a portrayal of an individual as I've ever seen in film.",
      "total_reactions": 0,
      "user": "YoursTruly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Guided by some unwaveringly perfect performances, \"The Fighter\" is a dignified example of what sports dramas should be - humble, honest, and exhilarating.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "The Fighter was the one movie that I knew I had to see in 2010. My two favorite actors are Amy Adams and Christian Bale, so I knew I had to see this film to see them together. As the release date came closer, and as more and more  Oscar buzz flowed, I knew this was going to be a great one. It is. This film is easily among the 5 best films of the year, if not the best.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Set aside the gore and violence for a second... and think can you make a great 130 min sports drama without Sylvester Stallone  The Fighter.... What an amazing movie. Everything was good about this film. It was a good kick ass sport drama. The critics are right about this film guys must WATCH. Well 9/10 is my review",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "this movie has all the elements of being awesome  great story  great script  great direction and until this movie came out i didn't believe that Christian Bale can actually act at all  cause i'm used to see him in suite as MR.Wayne in Batman series and i didn't recognize him at the first sight  i think he deserved that Oscar so much  it should have coming flying to him  also great performance by Mark Wahlberg  and i loved every minute of the movie  this is one of the perfect movies that based on true-story.",
      "total_reactions": 0,
      "user": "ExKing"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "An outstanding film by David O'Russell only surpassed by 2012's Silver Linings Playbook.  The performances  by Amy Adams, Mark Wahlberg, and expecially Christian Bale.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "O diretor David O.russell  sem duvida um dos melhores da época atual, pois ele sempre segue a mesma fórmula em seus filmes, um tema complicado  com um alto teor dramático com cenas tocantes, mas com vários alívios cômicos  bem dosados que tiram um pouco do peso da trama  e que deixam o filme mais divertido e melhor de se ver, o diretor tambem expressa muito bom gosto para aparte técnica a qual esta muito bem feita ,especeialmente na parte de imagem  que reproduz muito bem as cenas de lutas oficiais transmitidas pela TV, e a parte de som especialmente a trilha sonora que conta com grandes musicas boas de rock.",
      "total_reactions": 0,
      "user": "Scorpion"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "The Fighter is the only David O. Russell film that I've enjoyed. I never cared for Silver Linings Playbook or American Hustle. This film obviously involves sports but there is just so much more conflict than that going. Boxing can be the least of problems at a lot of points in the movie. I watched this movie without any knowledge of the characters so I had no idea how it was supposed to end and it kept me guessing from the start. This film gains more depth as it goes along and it only gets better as it progresses. Mark Wahlberg is great as he consistently is and Amy Adams was impressive as well but Christian Bale just steals the show for me. This is probably the best role I've seen him play. Nice to see him get the Oscar for Best Supporting Actor for this movie. Its well deserved.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "This true story about light welterweight boxer and Micky Ward makes for less of a sports movie than a domestic drama about blue-collar brothers struggling to stay a family while the forces of drug addiction and parental ambition tear them apart.But there is something a little too cartoonish about Micky's completely impossible family and also something a little too short-sighted in a protagonist who can't see the obvious — that his family, and not other fighters, is what stands in his way as a boxer.Until he catch a girlfriend Charlene played by Amy Adam.She is the only one who pushes him to stand up to his family.And it soon is clear enough that Charlene is the only character in the film who is not delusional and with her eyes like blue steel and swarm of red hair it's very easy to like it.It's not clear in the movie why Micky never spots any of this dysfunction.He wants to live up to an image Dickie put in his mind when he was a kid, an impression so strong that he doesn't realize that it disintegrated long ago.The movie greats very good drama and very good atmosphere but i kind of didn't like so much the boxing matches and the end The boxing sequences get bunched toward the end. The Director deliberately shoots them in brightly lit video that makes it look like you're watching television. He has broadcasters and ringsiders comment on the fights, but seldom takes you close enough to hear what Dickie might be saying to Micky. You're outside the ring, not inside. So like much of this film, the viewer is turned into an observer. You never feel close enough to the action, either in the ring or in the kitchens, living rooms and tough streets where the story takes place. The characters engage you up to a point but never really pull you in.",
      "total_reactions": 0,
      "user": "SmileATT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "I don't know anything about boxing. Honestly it looks kind of disgusting. But this focused more on the relationships that got Micky to where he was (presumably he was a great because otherwise he wouldn't have a movie made about him) and his struggles as well. We have his trainer, Dicky, who really does a **** job at being there for him. He's way too busy being a crack addict. So Dicky goes to jail and we're left with Dicky on his way to actually making something out of himself.",
      "total_reactions": 0,
      "user": "hanneguacamole"
    }
  ]
}