{
  "mc_avg_user_score": 5.8,
  "mc_metascore": 57,
  "mc_mixed_rating_frequency": 16,
  "mc_movie_name": "The Lords of Salem",
  "mc_negative_rating_frequency": 13,
  "mc_positive_rating_frequency": 22,
  "mc_pro_critic_reviews": [
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2013
      },
      "score": 100,
      "summary": "Rob Zombie understands horror as an aural-visual experience that should gnaw at the nerves, seep into the subconscious, and beget unshakeable nightmares."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2013
      },
      "score": 90,
      "summary": "The Lords of Salem is like some queasy-making machine, a chamber piece of possession and madness that exerts a strange, disturbing power."
    },
    {
      "critic": "Simon Abrams",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2013
      },
      "score": 83,
      "summary": "The Lords of Salem is a product of Zombie’s better creative impulses, so it’s ok that it also features several of his worse indulgences, too."
    },
    {
      "critic": "Simon Abrams",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "A genuinely nasty and disturbing piece of work, but its cumulative nerve-shredding effect is not just the product of effective direction. Sheri Moon Zombie delivers her best serious dramatic performance yet (before marrying Zombie, she used to be a porn star)."
    },
    {
      "critic": "V.A. Musetto",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2013
      },
      "score": 75,
      "summary": "Movies by Rob Zombie, the goth rocker turned cult filmmaker, aren’t for everybody. But he couldn’t care less. He makes movies exactly the way he wants to, with no thought of pleasing mainstream audiences. They can like it or lump it. His latest effort, The Lords of Salem, is true to form."
    },
    {
      "critic": "Noel Murray",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2013
      },
      "score": 75,
      "summary": "For a rock star and old-movie buff like Rob Zombie, The Lords Of Salem offers a chance to riff on the notion of rock ’n’ roll as the devil’s music, while recreating scenes from old Hammer witch pictures. Zombie does both of these things—just not always as expected."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2013
      },
      "score": 75,
      "summary": "Zombie's witches aren't as scary as the credible psychopaths he has portrayed before, but The Lords of Salem contains enough frenzied imagery in its climactic moments to make the spell linger."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2013
      },
      "score": 70,
      "summary": "The Lords of Salem is more creepily atmospheric than truly scary and eventually lapses into silliness. But it does provide some evocatively spooky moments along the way."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2013
      },
      "score": 67,
      "summary": "I could go on and on about Zombie’s style-over-substance direction, but why bother? The Lords of Salem is so clearly a project that Zombie has had stewing in his blood-and-black-lace heart for, I assume, ever, that the fact that it’s not a masterpiece seems almost moot. It’s a head trip, to be sure, but it’s Zombie’s electric, haunted head, so my advice is just sit back and goggle."
    },
    {
      "critic": "William Goss",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2013
      },
      "score": 63,
      "summary": "The film’s final shot ranks among its least graphic and yet most puzzling, a slap-in-the-face piece of punctuation that reminds the most accommodating viewers that, even on his good days, Mr. Zombie is really only making movies for an audience of one."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2013
      },
      "score": 60,
      "summary": "Considerable care goes into establishing the premise, but the film eventually abandons psychological subtlety for hallucinatory garishness, which is too bad."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2013
      },
      "score": 60,
      "summary": "Atmosphere is three-fourths of the game in a horror film, and The Lords of Salem has it in spades. It’s not too much to say that until this culty-witchy throwback chiller turns too bloody, it shows how far a little style can go."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2013
      },
      "score": 60,
      "summary": "This may be terrifying news to Rob Zombie fans, but after years mining the 1970s for gunky shock moments, the musician-turned-filmmaker has emerged as an unusually sensitive director of actors."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2013
      },
      "score": 50,
      "summary": "There are echoes of Roman Polanski’s “Rosemary’s Baby” in all of this that are impossible to miss."
    },
    {
      "critic": "Rob Nelson",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2013
      },
      "score": 50,
      "summary": "The helmer’s narrative dead end here registers not as a lack of nerve so much as a lack of imagination."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2013
      },
      "score": 42,
      "summary": "Unfortunately, it’s just a witchy mess."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2013
      },
      "score": 40,
      "summary": "The Lords of Salem is gloomy, lacks variety, and is not without its flat patches. Heidi is an increasingly dullish heroine, and in the first 15 minutes you’ll know what’s going to happen in the next 80."
    },
    {
      "critic": "Jamie Graham",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2013
      },
      "score": 40,
      "summary": "Occasionally potent but mostly risible, this tale of the  occult sees Rob Zombie cast a weak spell. Disappointing."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2013
      },
      "score": 40,
      "summary": "Some of the imagery is memorable, in a twisted-horror kind of way. Zombie has no trouble scaring up atmosphere. But other scenes are ridiculous, unintentionally funny, particularly one he builds up to ominously, only to give us a silly payoff."
    },
    {
      "critic": "Chuck Wilson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2013
      },
      "score": 30,
      "summary": "The movie is eerily photographed (by Brandon Trost), but never suspenseful or scary, and eventually, events descend into goat-sacrificing silliness."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2013
      },
      "score": 25,
      "summary": "This one is so bad it’s hilarious. Sheri Moon Zombie is no Mia Farrow, Rob Zombie is no Roman Polanski, and The Lords of Salem seems to have been made by people on the rubber bus headed for a rubber room with bars on the windows."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "I wanted to enjoy it much more than I did. I still feel that Zombie is an excellent director but I am doubting his ability as a writer, at least with this film. I couldn't help but pick out the similarities in plot to an excellent film  the House of the Devil  only with the addition of witches and the Salem location. I still believe that Rob has his horror masterpiece still to come but this was most certainly not it.",
      "total_reactions": 1,
      "user": "DisasterpieceMK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 4,
      "text": "A DJ plays a record that casts a musical spell. It unleashes dark powers of witchcraft and Satanism. Director Rob Zombie is like an eager film student, flexing his stylistic muscle: one minute it's arty, then macabre, then trippy, then just silly. There's an intense soundtrack and a cast of non-Hollywood types, which amplifies the ominous vibe. While there are effective moments, this mashup of approaches lacks any frights or tension…just a collage of creepy.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Visually grand, disturbing and intensely creepy; The Lords of Salem provides all these along with plenty of nightmarish imagery and great sound design, but unfortunately isn't really that scary and it can feel a little campy sometimes due to silly dialogue and overacted (and underacted) performances.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2014
      },
      "score": 2,
      "text": "What the hell is wrong with Rob Zombie? I get that the guy grew up on Heavy Metal and old black & white Horror movies, but there is twisted and then their is **** insane. The things that must be going through this mans head, that encouraged him to write something like this, is the true definition of horrific. The film follows a radio DJ in Salem, Massachusetts, who has been seeing some strange things. One day a weird record shows up at the station and the DJ plays it on the air. The seemingly innocent record becomes the most requested song on the station, but not without consequences, as it posses the local female population. I am a fan of his music, so I know how strange and twisted Rob Zombie can be, but even I have my limits. Following one of the best horror films I've ever seen, The Devil's Rejects, I was really looking forward to Zombie's next project. That film was a good story, with strong characters, and an amazing ending. This film is pure garbage, meant to shock and disturb audiences, and it does a very good job of that. From nude elderly women, spitting blood on babies, and opening gateways to hell to scary psychics and beast like creatures running around in the dark, this movie is full of things you just never want to see. Rob's wife, Sheri Moon Zombie stars and the once beautiful, up and coming star of the Devil's Rejects, is now covered in tattoos and looks like she hasn't eaten in months. Her performance is flat and unbelievable, adding to the mountain of manure that this film is offering. I love Horror movies and I love weird **** but this was just above and beyond freaking weird. I should have turned the film off when nude witches were spitting blood on babies, but I didn't, I stuck with it and I'm sorry I did. I don't know if I'll ever be able to get some of the horrific images out of my head.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2013
      },
      "score": 1,
      "text": "Wow this was bad. I expected that sort of cliche/70's horror style, but this was just dumb. Rob Zombie really needs some Catholic recovery therapy. I'm not religious and I don't like Catholicism, but this movie was just beating a dead horse with the repeated religion bashing. Maybe I'm old and jaded, but devil stuff isn't scary anymore. This movie did provide a lot of laughs, which seemed to be part of the whole idea.",
      "total_reactions": 0,
      "user": "dannyhernanny"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "The Lords of Salem is the new twisted horror movie by a well known horror master Rob Zombie, this director has a unique style of directing a horror movie, he understands horror movie as a new type of adrenaline that should run fear inside your heart and brain and shock with disturbance and gruesome scenes, like his new movie about witches which is extremely disturbing and scary, and definitely not for kids, it gets more scarier throughout and terrifying, it may gives you shock, disturbing scenes, blood, and it may lead you to shouting from being scared, as I was.",
      "total_reactions": 0,
      "user": "HaithamBayazeed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "Rob Zombie is back with his horror thriller- The Lords Of Salem. Now, its a good movie period. You remember when Zombie made great horror films? Well The Lords Of Salem is just that and more, the film is Rob's gory story with a god and Christian twist and religion with the Salems is just Rob Zombie's thing. You will get scared, you will laugh  not really), and you will understand this horror movie. It's not like The Ring where you have to put a brainy nerd to understand it for you. Well in the end for a good ticket price, I had my money's worth.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "Not my favorite Rob Zombie movie, but if your a fan of his it is definitely worth a watch.  The movie has points where it drags and to be honest there are some scenes I don't know what's going on.  Visually it is his best work and know doubt about it there is some insane things going on here.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "The Lords of Salem by Rob Zombie: A really awesome movie, I was surprised, Rob Zombie puts passion for this film is seen in the care that has to make it happen, wonderful.",
      "total_reactions": 0,
      "user": "alescio92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "The Lords of Salem captivates you in its world of terror and gruesome horror, it is the true face of horror, it is extremely scary and chilling, with those witches, it plays with your mind psychologically, but as a horror movie, it gets complicated, and really disturbing, with anti-religious scenes, the whole movie is anti-religious, scary and disturbing, definitely not for kids or sensitive people.",
      "total_reactions": 0,
      "user": "AReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "I've never cared for Rob Zombie's films.  As a writer, I think he's terrible as all his movies look like he just stole plot points, themes and ideas from other films (there IS a point where paying homage becomes outright stealing) but, as a director, I think the man has an amazing eye and, as long as he didn't write it, he COULD make decent horror films.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2013
      },
      "score": 0,
      "text": "This movie was horrible. The plot was lame. He used his wife (again) as a star role, which is getting really old. The end was really bad. He had a bunch of pictures flash with cheesy Photoshop effects that a grade school kid could do and the movie just never took off. Find a new hobby Z man.",
      "total_reactions": 0,
      "user": "dcorrigan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2013
      },
      "score": 3,
      "text": "i found it to be boring and not very memorable it hurts me because rob zombie has not failed me before. it had some interesting elements and twists but not nearly enough to keep me interested at all.",
      "total_reactions": 0,
      "user": "lossa551"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2015
      },
      "score": 4,
      "text": "The worst movie from Rob Zombie is his shallow remake of Halloween 2, however this one isn't very far off either. It's definitely more enjoyable than his remakes but not as entertaining as his older more brutal films.",
      "total_reactions": 0,
      "user": "NotoriousFraud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2016
      },
      "score": 7,
      "text": "The visuals and music make for an entrancing experience, and ensure a dark, weird tone throughout. I liked that the lead was not the stereotypical damsel in distress seen in many horror films. It feels very different to most other films now released; and for that, I can only praise Mr Zombie (p.s. I have not seen any of his other films). Nonetheless, the originality ends at the plot, which is bland, and uninterestingly put together. The subtly of visual imagery early on, seems to disappear later in the film, and often these images can be amusing (very).",
      "total_reactions": 0,
      "user": "Joellemm"
    }
  ]
}