{
  "mc_avg_user_score": 7.1,
  "mc_metascore": 65,
  "mc_mixed_rating_frequency": 52,
  "mc_movie_name": "The Imaginarium of Doctor Parnassus",
  "mc_negative_rating_frequency": 16,
  "mc_positive_rating_frequency": 124,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "This is one of my all time favorite movies because of it´s atmosphere that´s seems to be borrowed from a different  universe. The film is so absurd, hilarious, astonishing, disgusting and all over chaotic it´s  just  BEST FANTASY MOVIE OF ALL TIME",
      "total_reactions": 2,
      "user": "Isaac_adhd"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2010
      },
      "score": 3,
      "text": "I had high expectations of this film, but I ultimately ended up disappointed. Why? Well, the film is definitely attention-grabbing and the entire length of the film you feel captivated and mesmerised, which is the only positive thing in the film. The story is completely confusing and has really no point to it. After watching the film you feel as if you've wasted 2 hours of your life on something that had no point to it. Therefore, it's just a film that had no reason to be made in the first place, which is sad. Visual effects were atrociously bad, which I do understand is intentional, but it's still fugly.",
      "total_reactions": 3,
      "user": "smijatov"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "The effects and the idea are brilliant but the plot is a bit of a borefest and the movie drags on and on and on. This is not a great ending to Heath Ledgers acting career but lets hope The Dark Knight is the one he is really remembered for. In a nutshell, dissapointing.",
      "total_reactions": 2,
      "user": "Paxster"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "If there is something to be said about Terry Gilliam, it's that he doesn't give a damn about trying to please his audience, and I love that about him.  Depending on who you speak with, a director can be someone who must make a film that people would want to see or tell a story that they want to make.  The former seems to be the most commonly accepted way of film making as large sums of money are at stake and it would be very risky to do so.  Terry Gilliam's approach is one that I love and feel is a breath of fresh air in that he tells some very interesting stories.  He has a way of capturing that sense of discovery and wonder that you (hopefully) got when you were a kid discovering something new.  This movie to me is one of his ultimate expressions of this.  The movie, in a nutshell, is about the immortal Doctor Parnassus (Christopher Plummer) and his duels of faith (not religious, but in the virtues of humanity) with the devil (played by an awesome Tom Waits).  It involves many flashbacks from when Parnassus was young and details how he become who he is, all the while showing the daily trials and tribulations he and his traveling carnival face as they travel about London.  The story is very complex and does require attention to be paid to what is being said, and their morality cannot be judged based on the characters actions as easily as some films.  Things are pretty much not what they may seem at all times, and things twist and warp as the story develops further, leaving you sometimes confused.  The writing is amazing, with many well written and delivered lines by the cast.  They all deliver equally good performances and though I have a hard time finding a favorite, I would have to say Verne Troyer as Anton (who is someone to be watched in the future) and Tom Waits as the Devil where some of my favorites.  Heath Ledger gives an excellent performance and as much as I liked him in the Dark Knight, I feel that his performance in Imaginarium is a bit more subtle, but still very interesting.  That being said, The Imaginarium is definitely a favorite of mine, but I may be biased as I like Terry Gilliam's style as a director, as well as his choice of actors/actresses.  He pours a lot of heart into his movies and as self indulgent as some people say his movies are, I would rather watch his movies more than any other director.",
      "total_reactions": 2,
      "user": "zombiehampster"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 2,
      "text": "It seems rediculously unfinished, with an outrageous plot and quirky visuals which do look appealing, but ultimately confuse you. This is one of Terry Gilliam's worst films, and even the usually terrific Heath Ledger (tragically in his last performance) is a disappointment.",
      "total_reactions": 1,
      "user": "Judddy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2011
      },
      "score": 4,
      "text": "This movie lacks focus and development, and all the characters in this film were all clueless of what was going on, and they couldn't think rationally most of the time. Watching this movie was like staring at a wall for 123 minutes, completely pointless and a total waste of time, nothing but a meaningless daydream that good old Terry Gilliam had.",
      "total_reactions": 1,
      "user": "SnafuFrank"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "Quite stupid and boring, not fun at all. Idea probably is nice, but realisation ... Alien-looking girl was not impressive too. Last thing to say - RIP Heath Ledger ...",
      "total_reactions": 1,
      "user": "Violett"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "The Imaginarium of Doctor Parnassus will always be remember for being Heath Ledger's last film, because of his timely death three different actor finish it for him and you can tell in the film the craft and dedication to finish it. Even only it had a better understanding of the plot.  The movie begins of an old man named Dr. Parnassus (Christopher Lee) who has a daughter and a midget as a best friend and a street performer. They have an act where they go in the streets and make people pay to go through a mirror where it shows their true self's. We quickly learn through Parnassus that he made a deal with the devil to gain immortality but any first born child to turn 16 was to be offered to him. The girl, Valentina is about to be 16 in a couple of days. Parnassus is trying his best to see if he can stop the devil played by Tom Waits. One day while driving they find a man trying to hang him self which is played by Heath Ledger. They rescue him and he happens to lose his memory. Parnassus thinks it's a trick from the Devil, maybe to do another deal to save his daughter. They use him as a performer in their act.  If I keep going with the plot, this review will last forever. The plot is so damn unfocused that I wanted to scream out loud. The movie has so many ideas packed into one. There's a love story involved with Valentina and one of the street performers named Anton. Then there's Heath Ledger's character that has his own back story and when that comes into the light it's even more confusion. The narrative left me frustrated and confuse, I couldn't get into it. The movie is very well acted and I have no complaints about that. Every single actor is being true to their character and they do it very well. I liked how Colin Farrell, Jude Law, and Johnny Depp were there to fill in the shoes of Ledger.  The special effects were very good and convincing but like I said before if only the narrative was more properly structured. The movie is worth to watch because of Ledger he was captivating.",
      "total_reactions": 0,
      "user": "thelordoffilm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "Terry Gilliam always delivers the film that he wants to make rather than something that is instantly appealing or even commercially viable. For each Time Bandits or Brazil there is a Brothers Grimm, but even his least successful productions are superior to the continuous stream of turgid super hero tie-ins and remakes that have filled cinemas in recent years. Parnassus has an excellent cast who act their socks off. It's hard to single any one of them out, although it is a pleasure to see Christopher Plummer centre stage, and the combination of the \"Tony\" actors (Ledger, Depp, Farrell, and Law) shine through. The plot is arguably a little simple, but with the way it weaves between imaginary worlds and fascinating characters this is probably for the best. And what richly painted worlds and characters they are, with the irony that the most fascinating element is the Imaginarium itself - a Victorian era anachronism touring the back streets of modern London. The special effects are truly special due to the level of art that has gone into them rather than just the capabilities of a team of programmers. Modern SFX have become such a continuous drive of \"bigger and better with more pixels\" that many directors have lost sight of the fact that they are meant to be \"special\". Look, a bigger explosion, with more colours! Or a bigger robot, a bigger spaceship, a bigger, more impossible car chase.It has reached a point where SFX have reached saturation - completely ridiculous things are now mundane. Parnassus SFX focus on the detail, the minutiae, the art. And much of it is big, but that's not what makes it clever. What makes if clever is the fact that Gilliam decided that a \"magic\" mirror just needed a piece of plastic with a hole cut in it. Sometimes it's knowing when not to.....",
      "total_reactions": 0,
      "user": "s3ver14n"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "Following the unfortunate death of Heath Ledger, the gifted actor gained prominent recognition as he received an Academy Award for his performance in The Dark Knight.  Although Ledger acquired much-deserved fame, it astonishes me that his final movie, The Imaginarium of Doctor Parnassus gained little attention derived from North American audiences.  With its lack of consideration, the American audiences missed out on a film that adequately gives Ledger a final farewell.",
      "total_reactions": 0,
      "user": "RyanGee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2010
      },
      "score": 6,
      "text": "Though this is Heath Ledger's last movie officially, It was confusing to the point of wondering if i should watch it again for it to make more sense. The movie was hard to keep up with but I do not know if thats what the point was or not. It makes you think when you look at it and thats good for a movie to do.",
      "total_reactions": 0,
      "user": "Ruler101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "What you expect from the trailer is exactly what you get: a visually appealing, old-fashioned and stylish film about a magic world that can be accessed through a mirror. While the first half of the film takes you through the discovering of this world and the nature of the different characters, the second part is full of dark/epic elements. It's up to you to decide if the devil finally got to destroy Parnassus' life.",
      "total_reactions": 0,
      "user": "Nickkk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "Wow!... I had to watch it three times to got the idea from thiz movie (substantively, It is very very rare there was movie that I could not understand straightaway). If you have not seen it and would like to watch it, my suggestion is you better read the synopsis first. Thiz is ultimate Gilliam movie! Terry Gilliam, we knew him as a visionary and also peculiar Director at the same time. His previous movies including the sensational TWELVE MONKEYS (1995) and FEAR AND LOATHING IN LAS VEGAS (1998). Even on thiz time, Gilliam arranged all scenes on awkward perspectives. He did not seem to care if the audience will understood or not, he just kept put all his scenes and told it boldly without proper explanations, moreover some of the dialogues were extremely poetic. A long time ago, Dr. Parnassus (Christopher Plummer) who was the man behind the travelling show, bargained with Mr. Nick (Tom Waits) for his immortality with youth to married the girl he liked. On the exchange, he must giveaway his daughter, Valentina (Lily Cole) on the age of sixteen. Now the time is near, how he saves back her soul from the devil. Lily Cole performance was surprisingly adorable and represented all the emotions very well. The most interesting part was thiz movie starred by the late Heath Ledger. By the time of his tragic death, thiz movie was not finished yet. So Gilliam creatively replaced Ledger character with three other actors all at once (Johnny Depp, Jude Law, and Colin Farrel). In the end actually, I like thiz movie, bcoz Gilliam is brave enough to keep his unique characteristic and makes all directions are unpredictable. But I also had a doubt about his survival on the coming years. How talented Director like him did not break the box office yet? Or maybe he is not interested to do it so. Like Ledger character said, The Imaginarium does not cost a thing, weare not here for the money?!",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "The Imaginarium of Doctor Parnassus is a visually stunning film even by Terry Gilliam's incredibly high standards, and is packed full of oddball energy and interesting ideas about dreams, imagination and reality. Christopher Plummer and Lily Cole impress, as does Tom Waits' mischievous villain, but Heath Ledger under-performs in his final screen appearance, and his \"apples and pears\" accent is nearly as bad as Dick Van Dyke's in Mary Poppins (though not quite as awful as Don Cheadle's in the Ocean's films). The film hinges on a number of fantastical trips into the titular imaginarium, and these largely work, with Ledger's character Tony played by a different actor for each sequence (a clever last-minute story change to accommodate Ledger's tragic and untimely death). The best imaginarium sequence is the one with Jude Law as Tony because of its sheer surrealism and Law's utterly batty performance. The film never even comes close to coming together as a whole however, and occasionally the convoluted plot becomes incomprehensible. Somehow Gilliam's zaniness keeps the film watchable throughout, and while you may not always know what exactly is going on, you'll feel like you've been on the ride of your life. Parnassus will certainly bemuse some viewers, frustrate others and amaze yet more (divisiveness is what Gilliam does best), and I'm really not sure which of those camps I belong in, as I feel confused, annoyed and mesmerised at various points, often changing my opinion of the film from scene to scene. It's more an oddity, a strangely captivating collage of elements rather than a complete package, but The Imaginarium of Doctor Parnassus is an undeniably unique and memorable viewing experience.",
      "total_reactions": 0,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "First thing I noticed about this movie was the wonderful cast: Colin Farrell, Johnny Depp, Heath Ledger, Jude Law... it didn't really matter what the movie itself was about, but the idea seemed interesting as well.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "This is a movie for people initiated into mystery schools like the Freemasons, it's the story of the history of the Freemasons and the struggle between God and Satan for people's souls. It is centered around the occult meaning of the \"Hanging Man\" tarot card, one of the most least understood cards in the Tarot Deck. The scene with all of the pictures of all of the famous people who have died on the boats floating down the river tell you about all the famous people the Illuminati/Freemasons have killed. That's about all I could figure out, I'm not a Freemason or initiate into a mystery school so it's mostly over my head too. See it if you want but find it for free. Don't give these elitist jerks that make movies like this to pay homage to the Illuminati your money.",
      "total_reactions": 0,
      "user": "Necromus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "this movie is amazing one of the best fantasy,etc,movies,i ever seen....",
      "total_reactions": 0,
      "user": "lpsyco"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "Absurd plot threads, beautiful costumes, crazy sets, and janky special effects - for better or worse, \"The imaginarium Of Doctor Parnassus\" is a Terry Gilliam movie, through and through.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "dont know whaz up with metacritic regardin movies. in the games and shows section its quite alright but the movies??? here gets a wolverine origins 75 points where great art movies like dr. panasus gets rated down as prentious shiat wuth 65 points. wtf. its one or maybe the only real good 3d-movie i saw till yet.",
      "total_reactions": 0,
      "user": "th4nat4t002"
    }
  ]
}