{
  "mc_avg_user_score": 6.6,
  "mc_metascore": 54,
  "mc_mixed_rating_frequency": 75,
  "mc_movie_name": "The Last Stand",
  "mc_negative_rating_frequency": 17,
  "mc_positive_rating_frequency": 116,
  "mc_pro_critic_reviews": [
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2013
      },
      "score": 91,
      "summary": "It's a crackerjack B movie worthy of comparison to such stylishly low-down, smart-meets-dumb, hyper-violent entertainments as the 1997 Kurt Russell thriller \"Breakdown,\" Clint Eastwood's infamous police bloodbath \"The Gauntlet,\" John Carpenter's original \"Assault on Precinct 13,\" and Arnold's own overlooked 1986 outing \"Raw Deal.\""
    },
    {
      "critic": "Calum Marsh",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2013
      },
      "score": 88,
      "summary": "One of its most refreshing aspects is its acceptance of both western and action-film conventions on their own terms, refusing to regard itself as operating outside of or superior to the genre."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2013
      },
      "score": 80,
      "summary": "There's savvy in Schwarzenegger's understanding of his appeal. Always foreign yet weirdly Americanized in our dreams, the big guy is a craggy monument in need of a countryside. He's back in the place that deserves him."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2013
      },
      "score": 75,
      "summary": "The Last Stand marks the American debut of the Korean director Jee-woon Kim, who delivers a half-dozen quality kills that will leave audiences squirming and then laughing at the sheer audacity of it all."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 75,
      "summary": "Dig just a shade beneath the surface, trade in the text for the subtext, and a more interesting picture emerges – a little richer, sadder, almost poignant. Arnie is back again, yet now, as a storied immigrant nearing the end of his tale, he's become an odd sight to behold."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 75,
      "summary": "It's a struggle at times, mostly because the action-movie clichés haven't been weeded out of the script, but the film is cheerfully, irresistibly destructive - an old-fashioned, \"Rio Bravo\" shoot-'em-up with the hicktown spirit of \"Tremors,\" though it isn't as good as either."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2013
      },
      "score": 70,
      "summary": "It's an enjoyably old-fashioned shoot-out, if you can shake off the current headlines and sink in to a fantasy of hyper-violence that plays like an NRA vision of America the Beautiful."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2013
      },
      "score": 70,
      "summary": "If that sounds like Schwarzenegger might actually be called on to act this time, you're right. And to his credit, this is the loosest the guy's been in ages. His amiable banter rarely feels forced, and even the obligatory jokes about his age feel genuine."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 70,
      "summary": "The movie comes up with a couple of tender moments that could pass for human, and a mano-a-mano climax in which the superhero of yore, the glint in his eye dulled but not extinguished, functions as a weirdly touching tyrannosaurus."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 70,
      "summary": "Johnny Knoxville offers comic relief as the goofball proprietor of a back-road gun museum, which conveniently allows for an odd assortment of weapons to be used in the climactic battle. It's that kind of movie."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 70,
      "summary": "Kim finally lets loose, and the imaginatively choreographed mayhem that ensues - culminating in two fast cars chasing each other across a pesky cornfield - can be a wonder to behold."
    },
    {
      "critic": "Louis Black",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2013
      },
      "score": 67,
      "summary": "Despite his acknowledged age, creaking bones, and reduced nerve, Schwarzenegger still delivers quite a performance in this fun, straight-ahead action film."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 63,
      "summary": "The film, directed by South Korean Jee-woon Kim, hits all the necessary action beats and effectively blends in the humor."
    },
    {
      "critic": "Jamie Graham",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 60,
      "summary": "Kim Jee-woon's riff on the western is an entertaining frolic back-loaded with gore and guffaws. Arnie's back!"
    },
    {
      "critic": " Nick de Semlyen",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 60,
      "summary": "Arnie's toe-dip back into the action-cinema pool is a daft bit of fluff rather than a bruising mission statement. Get through the plot and you'll be rewarded with 30 minutes of whirligig mayhem."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2013
      },
      "score": 60,
      "summary": "Is it a coincidence that classic action is making its comeback at the same time Schwarzenegger is making his own? Hey, he warned us he'd be back."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2013
      },
      "score": 60,
      "summary": "The director does pull off a pretty magnificent cornfield car chase - two sleek vehicles cut through a thick, shaggy carpet of maize like souped-up harvesters, the movie's way of saying that the simple country life needn't be devoid of thrills. But Jee-woon takes too long to wrap things up, fumbling repeatedly on his way to an ending."
    },
    {
      "critic": "William Goss",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 58,
      "summary": "The bloodshed speaks volumes enough, though, even if it takes some time getting to the mayhem proper."
    },
    {
      "critic": "Mark Zhuravsy",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 58,
      "summary": "The Last Stand delivers -- up to a point. Keep those expectations reasonable and try not to be disappointed."
    },
    {
      "critic": "Read full review",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "If only Kim had a sense of humor to match his visual wit.  Instead, we get rusted gags and rubbery acting."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "Kim doesn't sweat interweaving his story threads in any tightly controlled way. Just when the need-for-speed stuff really starts to gain traction, he'll shift for a surprisingly lengthy stretch to comic relief with the deputies and local wacko Johnny Knoxville."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "Sure, violence in movies isn't violence in real life. And when you combine it with intelligent dialogue and pointed social commentary (a la \"Django Unchained\"), it can be cathartic. But The Last Stand, absent either of these things, just seems to want to gin up a lot of high-fiving for a lot of shooting, and right now is the least palatable time I can think of for that."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "Almost certainly, The Last Stand will not be Schwarzenegger's last. For better or for worse (and this is somewhere right in the middle), he is back."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "The idea of Arnold Schwarzenegger as a small town sheriff is ludicrous, but then that's the whole point of his new movie: It's dumb fun, emphasis on the dumb."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "[The Director] is especially good at integrating his New Mexico locations into the action, from a key combat scene on a bridge to a car chase that unfolds, with limited visibility, in a cornfield...Kim's handling of his first English-speaking cast isn't quite as assured, although everyone more or less gets by"
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 40,
      "summary": "So to call this a good movie is really a stretch; it's more like 38 percent of a good movie. But it probably has just enough dumb fun and pointless violence and car chases to seem like a highly viable option for large numbers of people this weekend."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 40,
      "summary": "The script is a mess, built on lazy clichés, stilted jokes and easy payoffs. What the movie does have, though, is enthusiasm."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 40,
      "summary": "The South Korean director Kim Jee-woon fails to dazzle with the endless speeding-car sequences, but that 60-second flourish during a lengthy firefight is almost worth the tedium."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2013
      },
      "score": 40,
      "summary": "Not the worst but is very far from the best film the star has made in his career."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2013
      },
      "score": 38,
      "summary": "It's a junky, crowd-pleasing movie of sidekicks – Guzman and Knoxville – bad acting, over the top shootouts, and catch phrases."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 38,
      "summary": "While the cast includes Luis Guzman (as a buffoonish deputy) and Johnny Knoxville (as a local gun nut), there's no sense that these are real people in a real town, and Schwarzenegger's Sheriff Owens has the weakest backstory of all."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 25,
      "summary": "The movie equivalent of an idiot who, to avoid scorn, starts acting like an even bigger idiot, so as to get in on the joke, too...It takes everything and nothing seriously, depending on what the filmmakers think they can get away with at any given moment, and the result, while not painful to watch, is ridiculous."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 25,
      "summary": "That's the thing about this corpse pileup of an action movie. It persistently tries to drag the audience down to its mindless level."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "\"Well to say The Last Stand is a comeback vehicle? i hope not, but the odds have it. Arnold is back in full swing as a gun toting sheriff ready to kill. With a few exceptions. \"The Last Stand\" proved to be quite, the exciting and intense action film.\"  B",
      "total_reactions": 1,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "A romping good time.  This is the Arnold we've missed. Unlike Stallone, who's films tend to play around with the morose side of cartoon violence, Arnie's new film embraces its ridiculous over the top conflict with glee. The action set pieces are fantastic, over the top and gleefully violent. Everything an Arnie movie needs. The villian is gleefully cheesy, racecar driving pablo escobar. The most interesting thing about this film though is the score and editing. The score is outstanding, it adds to the tension and ramps up every scene to that sweet spot, just to get you pumped to see Arnold tackle a dude off a roof and blow his brains out at the same time, or when you need to ramp up the tension for when the villain decides to use a super car to take out two SUVs. The editing though is a bit iffy. It's not bad outright, but it definetley stands out, because from a technical aspect everything else works like clockwork. The movie was great, Arnie looks leathery but was still great. This is the way to bring back your career!",
      "total_reactions": 1,
      "user": "rocketpackpanda"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "Apparently the cast of The Expendables are moonlighting for different roles, respectively. Arnold Schwarzenegger took the role of an old, as he said so himself, sheriff of a small town near the border of Mexico and USA. As far as action flick goes, The Last Stand will not disappoint, despite the cheesy lines and some acting flaws. Fist-to-fist brawls, gun fights in the middle of a street, and wild chase scenes contribute in overshadowing what shortcomings it may have.",
      "total_reactions": 1,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "Critics, man.  What a bunch of bummers...same with some of the users, too.  What do you expect from an Arnold flick?  Do you think he's going to be remaking The Magnificent Ambersons or The Man Who Would Be King?  Much like both Expendables films I went for the nostalgia of the days when I couldn't wait for the next Arnie flick or Stallone, etc.  Sure, this is the last gasp, but I'm there for it.  Just for fun.  If you are going to see The Last Stand may I recommend low expectations and look forward for a fun, if cliche' d, ride.  You've been on the Matterhorn at Disneyland a hundred times as a kid, but something about that rickety old thing makes you want to go one more time.",
      "total_reactions": 3,
      "user": "TheManWhoLaffs"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "Aside from the criminal misuse of Forrest Whitaker, this is a decent, light, fun film.  The direction could have been MUCH tighter - there are far too many blank stares and dull silences, but the action sequences are creative, and it's the classic tale of small town heroes  vs. the big bad crime syndicate - tough to go wrong there.  If only there weren't a couple of 7 or 8 year old boys in my theater giggling their asses off every time someone had his head blown off...",
      "total_reactions": 5,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Fast cars, wild action, enough guns to make Joe Biden change his diaper. Like a grandma with a shotgun pointed at your face what is not to love about this movie. This is all 80's throwback from a time when rated R movies were fun and cheesy. Almost all the actors get a LOL moment with the best reserved to old Arnie who does what he has done best for the past 30 years, delivering one liner after one liner.",
      "total_reactions": 7,
      "user": "analogkid280"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "Kind of like the Expendables, \"Last Stand\" plays off of Arny's old age. It's stupid and Arnold still can't act but it's great fun and a bloody good time with guns and cars. Just don't go in expecting anything with a brain.",
      "total_reactions": 6,
      "user": "tropicAces"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "Cliche after cliche, one-liner after one-liner, but the action set pieces are solid.  Popcorn fun, nothing more.  Arnold deserves better scripts, and we deserve a few good films he has left in him.",
      "total_reactions": 6,
      "user": "crazyspaceman"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "This was a good action movie. Only slightly more than the trailer, but still entertaining. If you are in the mood for a good drama, go see Zero Dark Thirty. If you want a good action, see this.",
      "total_reactions": 4,
      "user": "JPG127"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "The first two acts are a little janky, as Arnold's role only gets into one brief action scene throughout the time frame. The plot are also feels extremely divided as the villain's and Arnold's relevance isn't explained until late in the second act. Thankfully, however, the climax kicks the movie into a much needed state of overdrive, delivering immensely satisfying firefights, standoffs, and chases while retaining Arnold's and Knoxville's trademark humor. Overall, it's nothing special at first, but the final third justifies the watch.",
      "total_reactions": 2,
      "user": "PuppetMaster9"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "Arnie has still got it.....Nothing special, but just some good time...Good comedy and Action...must watch for an Arnold fan....It is good to see Arnold back, and looks like he can still produce some of his old touches.Th e movie does not have a great story line , but just the Fact it is Arnold movie, should see it through.....",
      "total_reactions": 6,
      "user": "sunnyr"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "My official review of \"The Last Stand\" can be summed up into a single word: America!  Now I know you're asking \"Stamp, what does America have to do with The Last Stand?\", and I'm glad you asked, Jeeves.  My thesis is as follows.  \"The Last Stand\", Arnold Schwarzenegger's newest theatrical release, and The Great United States of America go hand in hand because of the ridiculously good-looking and super fast Corvette( America's sports car); Arnold, himself, is an American dream come true; and because of U.S. citizens taking up arms to make a last stand against evil. Pun intended, although I'm not sure if it counts because that's what the title is talking about.  Moving on, I left the theater entertained, motivated, and grateful to live in a great country.  Last but importantly, they mention Jesus.  Let's take a moment for a standing ovation for Jesus.  Our lives are better for it.  In conclusion, I officially award \"The Last Stand\" with my first ever Stamp Of Approval.",
      "total_reactions": 13,
      "user": "TheStampMan"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "Arnie is back, older, a little paunchier, but no matter what, he is still Arnie.  And using his Austrian broken English he delivers what you would expect.  No this is not a perfect movie but if you're looking to pass a few hours and be entertained in which you know the ending he delivers a fun flick.   Blood, guts, violence with some humor sprinkled in, in which non of it is remotely believable.  Just a fun way to enjoy Arnie one more time.",
      "total_reactions": 3,
      "user": "fantasy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "Ever hear a Swedish guy trying to do an American southern accent? The bad guys right hand man in this movie has the absolutely worst American accent you will ever, EVER, hear. How this got onto the screen says a lot about the quality of this movie.",
      "total_reactions": 2,
      "user": "Proteus"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 3,
      "text": "Movie was eh.  Don't like seeing Arnold old, just doesn't pump me up like he use to.  Movies like this makes me long for the days of Total Recall, Terminator, and Predator.",
      "total_reactions": 1,
      "user": "Thebigdeal324"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "\"The Last Stand\" 10 Scale Rating: 3.5 (Bad) ...",
      "total_reactions": 1,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "A Mexican crime lord escapes from the FBI and it's up to a small town sheriff (Arnold Schwarzenegger) and to stop him. There are some cool driving stunts, but most of the action is nothing special. The pacing keeps it moving, but the screenplay is simply painful: predictable, for sure, but lacking in so many ways. There were lots of opportunities for character comedy and smart retorts, but none of it was realized. This might have been a fun vehicle (featuring several fast Chevys), but the writing condemned it to an awful accident: avert your eyes!",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "More or less what I was expecting and wanting. It starts off a little slow, focusing on bland backstory's and lame jokes, but once the bullets start flying the movie takes off. It's meant to play off of Arnold's age and does it well. That being said the movie also has poor acting despite it's above average plot. Still I came into this movie to watch Arnold (not even going to try to spell his last name XD), my all-time favorite action star, kill some dudes, and the movie delivers on that front. So if you come into this movie expecting a straight up popcorn worthy action flick, rather than a deep movie with excellent acting, you wont be disappointed.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "It's literally just eye roll after eye roll of terrible cliches and bland shoot em up scenes. Not even Arnold can save this one. The plot is essentially a bare bones, utterly predictable excuse for the action; of which the scenes were predictable and unoriginal. There was some good acting, mainly from the big name stars like Arnold, but it falls through with the secondary characters; especially with the romance plot tumor. This movie was VERY clearly riding on the hype for Arnold to be back in acting.",
      "total_reactions": 0,
      "user": "CommandoDude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2013
      },
      "score": 4,
      "text": "Its been over a decade since Arnie's last starring role and The Last Stand signifies his return to the action persona he fostered over the years and from the looks of it he still has something to show but the film doesn't prove to be the return showcase he envisioned, not by a long shot. This time around Arnie is called upon when a dangerous cartel leader escapes federal custody and he heads to the small town of Sommerton where Sheriff Ray 'Arnie' Owens must stop him from crossing the border into mexico with the help of his deputies and a few well intentioned civilians. While not completely inept, The Last Stand does feel like a low budget actioner for actors past their prime which is why I thought it odd Forrest Whitakers character wasn't played by Cuba Godding Jr. The film prides itself on its humour and the many in jokes that go with working with Arnie but there are only so many you can take. After a while it grows tiresome and it feels like you are being fed a block of cheese with no substance, no bread. The film does try and take it seriously occasionally but does so in such a generic way that it never feels sincere and the emotion displayed is always fake. The film is viciously violent but not for any good reason and Luis Guzman and Johnny Knoxville show up for cheap laughs (you laugh at them, not with them) even though you just want the film to end. There are only so many references of Ray being past his prime you can take and catchphrases like \"I'm the Sheriff\" don't help matters. The director does have some flair for the action elements of the film but overall it feels like a first shot, it will be interesting to see if the directors next will improve upon The Last Stand, a disappointing action comedy.",
      "total_reactions": 0,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "Someone bad is speeding towards your town in a souped up sports car that only a higher power could slow down, so what do you do? Put Arnold Schwarzenegger in said town of course, and let him run riot simply because he hasn't been able to do so on his own for almost ten years.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "The Last Stand was exactly what I thought it would be. Arnold Schwarzenegger proves he's still about the same actor he's always been. You're going to get some decent fight scenes, a bunch of over-done gun battles, some solid one-liners, and a severe lack of acting. If you're an Arnie fan like myself, you don't mind the flaws and enjoy it for what it is. The rest of the cast was about what you'd expect also. Luis Guzman played his usual comedic relief stereotype Hispanic role and Johnny Knoxville was hilarious as usual. I wish he would've been featured more but his role wasn't critical. I'm a huge Jaimie Alexander fan so I loved that she was in this film. She is stunningly beautiful and a very underrated actress who has the ability to do a lot of physical stunts without the need of a double because she's also impressively athletic. Hopefully she shines enough in these smaller roles to get a chance to become more of a leading actress. As for the plot, it dragged a bit early and there were some silly parts, especially involving Burrell's initial escape, but it developed well and once the meat of the movie got going it was enjoyable. Some of the action sequences were overdone but like I said, it is an Arnie movie. Overall, enjoyable and entertaining with some flaws but not enough to ruin the experience.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2015
      },
      "score": 5,
      "text": "Good to see arnie back but action with him is very brief, the film is more about car chases, there's only really a 5 minute action scene with guns and a 3 minute fight scene. Plus the film is terribly written, both plot-wise and dialog-wise.  Tries to be funny in the most awkward ways, major plot points make little sense. (Metal handcuffs not affected by magnet?  Police helicopter doesn't have infra red? Why build a bridge, why not arrange a helicopter to transport them over the canyon, then to another car. why did the swat team not attack the corvette instead of trying to drive into it, presumably they have weaponry?)",
      "total_reactions": 0,
      "user": "nascent"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 3,
      "text": "There is nothing special about this movie  NOTHING  beyond the fact that Arnold is in this movie and his action scenes are no where what they used to be. Everything corny that you hate from C- 80s/90s action flicks are in The Last Stand from the feeble guy whom you really don't care for anyways that dies, to the ridiculous guy that won't die, the Mr. Bad Guy don't mess with me is present, some cheap attempts at humour which fall flat on their face, suspense where the outcome is painfully obvious, a storyline which is there only as an excuse to give the action some meaning and to the paltry car explosion scene that you've seen a million times in past movies. The acting is all around terrible too (Arnold) except for Johnny Knoxville who talks with his mouth as well as his facial expressions. He was a pleasure to watch in a non-homosexual way. Action was terrible outside of the chaingun scene (which lasts 10 seconds) and the whole time I was waiting for Arnold to do something amazing but no...nothing happened. Just a corny ending and me feeling bad I had to pay for this on a Tuesday night. Watch this movie if you want your crying family to read on your coroner's report: \"central nervous system necrosis and subsequent apnea due to boredom\" as the cause of death.",
      "total_reactions": 0,
      "user": "alfaalex101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "Its a good pop corn movie and Arnold is always best. Supporting actors bit lame but anyway its a quite watchable movie.Last wrestling fight was quite amazing and so real.",
      "total_reactions": 0,
      "user": "Smee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "Schwarzeneger's back! And if you think that's a good thing, you're one of the many people I don't understand. I'm sorry, but I didn't find this film entertaining at all. Not to mention it has about as much depth as a Jessica Simpson music video.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "an ok story mixed with Tarantino style gun work makes this a great action movie. Arnold does a great job and delivers. i was very impressed on the amount of gore, and the detail in using it. not a lot, if any that i could tell of cg. a great action movie.",
      "total_reactions": 0,
      "user": "DanKageakaTK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "This was pretty good, at first I was losing interest cause of a few sill characters, but it picks up! The bad guy on this movie is annoying, hes one of those you want Arnold to get a hold of witch makes the movie fun to watch.Also a few good one liners from Arnold that I liked.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "“The Last Stand” presents a decent supporting cast (yes, Johnny Knoxville is part of that group), the film’s pace moves along quickly, and features the new Corvette ZR1. Its major drawback however, is its star protagonist that simply isn’t up to playing the part, which surprisingly, demands some emotional range. Although Director Kim Jee-Woon has carved a distinguished career out of hyper-violent silliness, his first American film is a throwback to the low CGI, focusing on stunt action with the revered themes of justice and honor, prevalent in classic Hollywood westerns. A mix of established actors with a handful of unknowns, a hearty dose of violence mixed with questionable humor, lots of guns accompanied by bland dialogue and cheesy one-liners. All in All, “The Last Stand” fully embraces exactly what it is, never taking itself seriously, and it works for the most part because of it.",
      "total_reactions": 0,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "\"The Last Stand\" is just what it sounds like. If you were thinking of a western, you're absolutely correct. This is a completely mindless action movie with very mediocre acting. Arnold is being Arnold and Knoxville being Knoxville. Being a fan of the \"Jackass\" series and movies, it was fun to see him do a couple stunts but, overall, his character was simply there for comic relief (in a movie which is already an action comedy). I love the director, Kim Jee-woon, for his past Korean work on \"The Good, The Bad, The Weird\" and \"I Saw The Devil\" but I think he should stick to Korean casts. It's just no actors really shine in this one. I went with my friend and I found it comical that, for one, very few people were in the theater (on opening night) and, secondly, they were all middle-aged. You could see in the way they laughed at Arnie's one-liners that they wanted this to be Schwarzenegger's comeback. However, I'm sorry to say that it's not (plus, nothing will ever top Terminator). It's a good Netflix or On Demand rental but that's all.",
      "total_reactions": 0,
      "user": "RyanCooley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "The Last Stand delivers exactly what it promised, a heart pounding action film that proves to be an exciting return for Arnold Schwarzenegger to the big screen.  I realize he has made a few cameo appearances like in \"The Expendables 2,\" but it",
      "total_reactions": 0,
      "user": "BreakingBrad"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "Some parts of the movie were really painful to watch, but if you're looking for an action flick devoid of any plausible storytelling, go see this movie.",
      "total_reactions": 0,
      "user": "nuckchuckler"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "Good action picture.  Sure Arnold is old and isn't great looking.  This is an Arnold movie.  It has a good plot, moves along briskly and was fun to watch.  If you saw Bullet to the Head with Stallone and liked it, you will like this one too.",
      "total_reactions": 0,
      "user": "Zarchon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "Ahhnie is back with a vengeance! In the Last Stand! This Cheesy Mexican popcorn flick is really awesome. The film starts off slow but then it gets interesting. I'm pretty glad Arnie made this film. It's just bloody f**king fun with guns and hot cars. Just don't take brainy nerd to this movie.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "Arnold is still giving good performances and this film is no exception it's a fun film to watch and the action is really fun to watch and while the story was not the greatest the cast did their best to make you watch a really enjoyable film",
      "total_reactions": 0,
      "user": "WalkingJ-Dog"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "A formulaic action movie with a pointless plot.  Arnold is pretty good here with a case full of one liners and he's the best part of this film. Still this has decent action, but a mediocre story.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "Anyone remember The Hunter? It turned out to be Steve McQueen's final screen appearance, playing a bounty hunter, in a rather generic action thriller, with some pretty good action sequences inserted. I thought of that film while watching this  I think they share a cornfield car chase, I may be wrong), because, it too, is a generic thriller, with a few good action sequences. Arnold does his Arnold thing, squinting and creaking out his dialogue, with nods to his age. Knoxville plays the village idiot (typecasting?), with a thing for heavy artiliary. The major dissappointment is that I was expecting something a bit wilder from Kim Ji-woon, along the lines of John Woo's American debut, Hard Target. But hey, cranked up, with a few beers on a warm spring evening...? It'll do just fine.",
      "total_reactions": 0,
      "user": "jamess"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2013
      },
      "score": 3,
      "text": "It could have been a great action flick but  Ji-woon Kim botched it. There was enough crazinessin the trailers to suggest a success but the movie is far from what you could have expected",
      "total_reactions": 0,
      "user": "FreakyFatJo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "Yep, he's back, with a pop corn action movie! My expectations were really low, but as it turned out it 'Last Stand\" has it's charm. Overall  it's a decent action movie with some good parts, and some problems as well!",
      "total_reactions": 0,
      "user": "PStakhiv"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2013
      },
      "score": 2,
      "text": "A small time sheriff is called up to the plate when an escaped fugitive tries to drive through his town......and of course he steps up to the plate with his rag-tag bunch of deputies and puts on a great \"Last Stand\". The story line is as painfully dull as the characters and the dialogs and the acting. There are a few good action scenes and car chases, but other than that, Arnold's great comeback is nothing more than big giant muscular cliche.",
      "total_reactions": 0,
      "user": "Cyberghost"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "If you're a fan of Arnold's second-tier action movies, you will enjoy The Last Stand. If you didn't like movies like Commando, Kindergarten Cop, and so on, I expect you won't like this movie. In a weird way, it seems like the supporting actors didn't really put much effort into their acting. Perhaps it was the direction, but the villains and the townspeople seem rather disinterested in the proceedings  as if someone filmed a rehearsal that had gone on too long and just decided that was good enough.",
      "total_reactions": 0,
      "user": "Diomedes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "Heading into it, I fully expected \"The Last Stand\" to be boilerplate Schwarzenegger: Guns, one-liners, poor attempts at dramatic turns, car chases, and more guns. \"The Last Stand\" is all these things, but manages to make it all worthwhile, working a fun supporting cast around the obviously aged Schwarzenegger while pumping every ounce of adrenaline from the predictable action sequences.",
      "total_reactions": 0,
      "user": "Kevbo85"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2014
      },
      "score": 6,
      "text": "I felt a little lost in this movie.  Don't get me wrong I thought it was actually pretty good but it bounced back from humor and seriousness that made it hard to know when to take it seriously.  Other than that is just a good old fashion action movie with Arnold, how could that go wrong?",
      "total_reactions": 0,
      "user": "mijxero"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "This film did not disappoint.  So Arnie is a bit slower and bit wrinklier but that didn't stop me believing he could woop the baddies.  It felt like a Taratino movie with the graphic blood and violence but I loved it.",
      "total_reactions": 0,
      "user": "Teee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "Obviously the parallels that TheStampMan has drawn between this film and the greatness of the USA haven't gone down too well but I would also argue that The Last Stand is a a social commentary of America and its history. And please note that I say this with a completely unashamed love of Arnie...",
      "total_reactions": 0,
      "user": "SavileLovedMe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2014
      },
      "score": 5,
      "text": "It is hard to return from retirement and instantly make a good movie. Nothing special here, just another old average shoot-out action movie with predictable plot, still enjoyable at few points thanks to Schwarzenegger's presence.",
      "total_reactions": 0,
      "user": "Venomq7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "\"You make us immigrants look bad.\"",
      "total_reactions": 0,
      "user": "NotoriousFraud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "The Last stand is what i would like to call a modern day Rambo movie. Its fast, its intense ,its ridiculous at times. The story is pretty simple and goes like this: A Crime lord in Las Vegas has escaped jail and is trying to get to mexico .The only standing between him and freedom is a small town called Summerton which he has instructed his gang members to lay siege to in order to get him a straight shot out of the country. But it just so happened that Summerton has one the most badass sheriff in movie history who fights back with Gatling guns, flares and all kinds of gun. Its a violent but entertaining movie and there is even a car chase towards the end. But one thing that confuses me is the name: why is it called the last stand there was only one stand.",
      "total_reactions": 0,
      "user": "Mr_Movies"
    }
  ]
}