{
  "mc_avg_user_score": 6.2,
  "mc_metascore": 46,
  "mc_mixed_rating_frequency": 72,
  "mc_movie_name": "The Sorcerer's Apprentice",
  "mc_negative_rating_frequency": 23,
  "mc_positive_rating_frequency": 86,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "I found this an enjoyable movie and definitely worth watching the acting from the cast was good and the storyline was satisfactory. i would definitely recommend the movie to people as i can see no reason why anyone shouldn't enjoy it",
      "total_reactions": 2,
      "user": "Andy92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Great film. Best this year by far but let's be honest, it's Disney so would you really expect any less???",
      "total_reactions": 1,
      "user": "gina86"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "At the start of this film, I wasn't sure if it would be my type of movie but after the first 10 minutes, the film got a lot better and it turned out to be a fantastic film and one that I would watch over and over again. Jay Baruchel was fantastic in the lead role and impressed me.",
      "total_reactions": 1,
      "user": "JamesNWA"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 4,
      "text": "Man, is it just me or does Mr. Cage desperately need money? His performance in \"The Sorcerer's Apprentice\" is hurried and unusually weak, followed by the idiotic story and dialogue disney motion pictures threw in. In other words, the movie is a terrible blockbuster (LOL, considering the money it earned its not even considered a blockbuster).",
      "total_reactions": 5,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 6,
      "text": "There is a reason we are all put on this planet   some of  us have not found those reasons while others have discovered the reasons  earlier than most and chases after them until they can firmly hold the power they are meant to have in the palm of there hands. Some are meant to be doctors, some are meant to be lawyers, some are meant to be cops, bank mangers, soldiers,  politicians, historians, film directors, screen play writers, film critics, novelists  the list goes on and on. We shape our future by what we do in the here and now and what path we choose to walk the only exception is a lanky young man named David \"Dave\" Stutler a physics nerd who thinks he is on the right track to his future. Little does he know that fate has something far more important part for the young David to play little does he know that he is about to become \"The Sorcerer's Apprentice.â",
      "total_reactions": 1,
      "user": "Lopez17"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "uuu special effects",
      "total_reactions": 1,
      "user": "simplex"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "Did you ever watch Mickey Mouse FANTASIA in 2000? Thiz is meant to be the live action version.  Mickey Mouse character replaced by nerd character specialist, Jay Baruchel (as Dave). And the master played by Nicolas Cage (as Balthazar). The scene from FANTASIA, when the apprentice works his imperfect spell to command all brooms and mops to do some cleaning jobs is the only homage to original version, along with its original score theme. Despite of that goodness, you are about to see an hour and half of Cartoon. The jokes are still funny but the story is completely predictable and fully anticipated. Everyone seems to be drawn into giant vortex of comic character, without exception: Nic Cage, Alfred Molina, Toby Kebbell and Monica Bellucci. The only fresh appearance is made by new gorgeous face, Teresa Palmer as Dave girlfriend. The magical battle is seeming to use some iconic images in New York (which the movie took place), like Bronze Charging Bull in front of Wall Street, and the Giant Iron Eagle which is perching on one of the famous buildings. The Director Jon Turteltaub has been tangled into CGI festival, which puts aside a lot of factors in story and characters development. Thiz NATIONAL TREASURE (2004) is not a PHENOMENON (1996), the movie could still be running WHILE YOU WERE SLEEPING (1995). I shortly described it as Special Effects exhibition which is trapped inside the cage. It is NOT the coolest job ever.",
      "total_reactions": 2,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Being a huge fan of Fantasia's Sorcerer's Apprentice segment, Disney, and fantasy comedies, I was eagerly anticipating this movie. When I went into this movie, I had seen the Last Airbender two weeks before, so I was still in a bad movie-going mood. But this movie rocked!! The Jerry Bruckheimer-action fantasy kicked all kinds of butt! The action was really cool, the effects were awesome, the cast was great, and it's hilarious!! There's a couple of cliches, but I expected that!! I love this movie!!",
      "total_reactions": 0,
      "user": "Bullet97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "People need to keep in mind this is movie is made by Disney. While I did enjoy the movie for what it was, there where a few things I wish was done differently, first more back story on Nick Cage's character (Bathazar), I found his flashbacks and him explaining his past more interesting than anything. Two, NOT EVERY MOVIE NEEDS A LOVE INTEREST, I get it, nerdy boy likes cute girl. Doesn't think he's good enough and wants to impress her. It's been done before. Hey Hollywood not every attractive girl is a sweetheart. This story didn't need her.  But hey it's Disney so what do you expect.  The love triangle between Bathazar and the villain (I forgot his name) with his love interest (I forget her name too) was more interesting than the kid's. But all in all the movie was a great little distraction. By far not the greatest movie but it did what it set out to do. If your expecting some epic movie like Harry Potter you'll be disappointed. But any average movie goer (not for your cinema snobs) would have fun taking their family for night out.",
      "total_reactions": 0,
      "user": "kidcoyote"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2011
      },
      "score": 4,
      "text": "The one thing the film has going for it are the visual effects. Everything else is, in the best case scenario, mediocre. The story was not very well written and the screenplay was messy. Dialogues were ok, nothing out of the extraordinary - just a typical Disney film type of screenplay. Visually, though, there were some impressive effects, and the film was very nice to the eye. That being said, the acting was quite bad, especially disappointing from Nicholas Cage. The lead actor/kid was rather bland and annoying, and Monica Bellucci's role was a cameo, to say the least. It is NOT a good film, but it will keep you entertained for the two hours it's long, for which the visual effects are the main contributor, I'd say. Worth watching if you have no expectations.",
      "total_reactions": 0,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 6,
      "text": "It was ok-decent. The overly-used CGI and the cast can't save the cliche-fiiled plot that is throughly predictable, and lacks any character development of any kind, making it impossible to truly care for anything that's happening. A 6/10.",
      "total_reactions": 0,
      "user": "Harbinger"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "This is one film for which i have to disagree with the critics. It is one of the best movies i have watched this year. It's funny, exciting and bursting with creativity at every turn. Just plain good entertainment. It is probably one movie at which you would probably have to leave your brain outside, but that is actually a good thing. You would be surprised at how much you would enjoy the show if you just keep an open mind",
      "total_reactions": 0,
      "user": "xiuyiwang"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "It is far from being original, but is quite enjoyable. Acting is OK, Alfred Molina does always a great job, Nicolas Cage's role is average, but I don't think you really care about this in a Disney production.",
      "total_reactions": 0,
      "user": "echonn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "This movie is good, i hope you like it. The movie itself is well made,",
      "total_reactions": 0,
      "user": "FreshTomato"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "Sure, Jay Baruchel's character may be a border-line annoying character, but after watching Prince of Persia and Inception, two movies that didn't live up to their expectations, it was a relief to finally watch this great action movie. I would've loved to see a sequel, but looking at the box office numbers, that, unfortunately, isn't going to happen.",
      "total_reactions": 0,
      "user": "gm101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "\"The Sorcerer's Apprentice i hate to say , Does not bring the magic & the chemistry between Baruchel and Cage just was not there, also plot development , but Apprentice was also fun , imaginative and dare i say it at times somewhat entertaining\" .. B",
      "total_reactions": 0,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 6,
      "text": "The always enjoyable Alfred Molina keeps the film afloat  and young Jay Baruchel is geeky enough to produce a few laughs.  But casting directors should seriously consider alternatives when thinking of getting Nicolas Cage on board the project.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "an entertaining segment from the animated movie",
      "total_reactions": 0,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2010
      },
      "score": 8,
      "text": "You don't need to see my faculty identification card...",
      "total_reactions": 0,
      "user": "Vixremento"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "Funny thing is I couldn't imagine this film without Cage. He's great, as usual. The only problem is the increasingly weak script, which amounts to a plot that makes no sense, dialogue that makes you cringe and a conclusion that pays off as much as the Sopranos final episode. - Duke & The Movies",
      "total_reactions": 0,
      "user": "Duke"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2010
      },
      "score": 7,
      "text": "Very enjoyable movie despite main character was a bit funny. Good effects, spells were quite spectacular, there was even a car race ;) If you look for something light, I recommend.",
      "total_reactions": 0,
      "user": "Ghua"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2011
      },
      "score": 0,
      "text": "I left on the middle of the movie, but! If the second half was like the first one, then the movie sucks. The characters are so annoying it hurts and Nicolas should choose better movies, I mean, he's a talented actor, he won an Academy Award for god's sake! I really don't like the movie. Sorry, but it just doesn't work for me.",
      "total_reactions": 0,
      "user": "TheGorilla"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "BUY THIS! It's an epic movie. Excellent soundtrack, presentation, story and drama. The acting might have been slightly predictable at times but Cage was very good. Overall I'll give it a 10.",
      "total_reactions": 0,
      "user": "PeaceWalker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "Being somebody who hasn't read the books I wasn't sure what to make of this film. I am a Nick Cage fan though I have been disappointed with a bunch of his newer movies. Overall though I really felt like this movie kind of got a bum rape. The characters are all likable even one of the villains is an extremely fun character. The plot movies along okay even though it kind of peters off at the end into the normal Hollywood ending. If I had seen this in theaters I probably would have been disappointed to drop 10 bucks on it but renting it I really felt satisfied, overall a pretty good watch",
      "total_reactions": 0,
      "user": "moviegrabbag"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2011
      },
      "score": 7,
      "text": "A surprisingly competent performance by jay baruchel who showed remarkable ability with forcing a laugh frok the audience, coupled with a fantastic showing by cage meant this film was a joy to watch. With top class supporting roles by teresa palmer and alfred molina, i truly enjoyed this film although the script was occasionally found lacking and the plot somewhat predictable. Still much better than many of the harry potter movies!",
      "total_reactions": 0,
      "user": "wormyrug"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "I should say I liked this movie pretty much. It had really nice animations and excitement in it. The girl was very pretty and the musics were astonishing. Really what made me love this movie was the stunning girl and the perfection of music. Bad thing is that weird starring Canadien dude. i should say, he reminded me of myself with his geekness, :P",
      "total_reactions": 0,
      "user": "julian_zizzle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "THE SORCERER'S APPRENTICE is a silly film, but it's fun and entertaining and is also family friendly as well. Great fun.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "Its not terrible, its just okay. Its got impressive visual effects  but the story is particularly hard to follow towards the end. Thats where it suffers the most.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 4,
      "text": "The Sorcerer's Apprentice is a great story that is absolutely destroyed by Disney. When a movie starts out with swords and wizards in the 8th century, and then all of a sudden jumps to a kid on the school bus with Jimmy Eat World playing in the background, you know you're in for some trouble. This story is about a Sorcerer, looking for his mythological apprentice, to fight an evil that could destroy the world. The film stars action veteran Nicholas Cage. It's got a huge budget for lots of cool special effects...and Disney turns into a kids movie with a farting dog, a fantasiaesq cleaning scene, and of course a nerd who becomes a hero. It had such potential, but turned out to be such a Disney Cliché that I wanted to  vomit. Sorcerer's Apprentice is another great story completely destroyed by over the top effects and garbage from the money hungry giant known as Disney!",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "Okay, so maybe it has a lot of fantasy cliches, but the main character is so likable you can forget all that. In a time where the \"nerd\" demographic is increasing so exponentially, a character like this will be very easy for many viewers to relate to.",
      "total_reactions": 0,
      "user": "Aquophis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "This movie starts off really well; the pace is just right and the part in the beginning about Merlin and his apprentices doesn't seem too hurried (although they could have taken their time unfolding it, really, since all that information was important when it came to the rest of the movie).",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "Nicholas Cage is what saves \"The Sorcerer's Apprentice\" from being a disaster. His character, Balthazar, is well portrayed. The problem with this film is that the magic doesn't seem like \"Harry Potter\". It's more like machine-generated and doesn't have the craft and style like \"Harry Potter\".",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "This was a fun film which brings around reminiscent thoughts about childhood. A mixture of Harry Potter, Fantasia and just about any other children's film, this was enjoyable despite the fact that I am 19. Jay Baruchel is quickly becoming one of my favourite actors.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 4,
      "text": "Surprisingly decent and entertaining. Cage and Baruchel are good together, and  the effects are good too. Overall, I liked it. Very similar to Percy Jackson which I also liked.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "While I know this movie isn't everyone's cup of tea. I loved it. It has everything I could ever want from a Disney live action movie. Adventure, Drama, comedy great FX.",
      "total_reactions": 0,
      "user": "Rox22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "las cosa podrian tornarse mejor sin embargo es divertida y puede manejar grandes emociones al verla esta bien hecha pero aun es lo suficientemente convincente para mejor calificacion",
      "total_reactions": 0,
      "user": "Jmsbpp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "Very enjoyable, in my opinion. Most of the Jerry Bruckheimer/Disney Movies are really good. The gloriously villainous Horvath played by Alfred Molina made the movie for me. Keep the villain roles for Alfred Molina coming. I loved the part that paid tribute to the short in Fantasia. Great overall.",
      "total_reactions": 0,
      "user": "AVTRlover41"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "What? A Nicolas Cage movie from the 2010's that's actually decent? Well, \"The Sorcerer's Apprentice\" might just be that film. It won't win any Oscars, but it is just entertaining enough for us to slightly forgive all the holes and flaws.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2016
      },
      "score": 5,
      "text": "\"The Sorcerer's Apprentice\" isn't all that bad, and it actually has some likable elements: the cast is committed, the CGI is nice, and it knows how to have some good ol' fun. That said, it definitely isn't beautifully written, and while the acting is fine, the characters themselves are not memorable. On top of that, the film definitely plays as \"undemanding Summer blockbuster that you'll like if you can turn your brain off.\" All in all, \"The Sorcerer's Apprentice\" is nothing awful, but it's nothing spectacular, and my ultimate recommendation is that, if you can turn off your brain, you'll have plenty of fun with it. If you're looking for wonderful storytelling, though, look elsewhere.",
      "total_reactions": 0,
      "user": "FreedomFighters"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "\"The Sorcerer's Apprentice\" is a so-so picture. I mean, it's kind of a mixed bag, I have mixed feelings about it. Some parts of it were pretty boring, the slapstick is mostly uninspiring but there are some funny parts, as well as a widening cast of talented actors like Alfred Molina and Nicolas Cage (yeah, he is an entertaining actor), and the special effects are good, at least for the most part. All in all, I didn't hate it but I didn't love it either. Worth a view though.",
      "total_reactions": 0,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "Being a huge fan of Fantasia's Sorcerer's Apprentice segment, Disney, and fantasy comedies, I was eagerly anticipating this movie. When I went into this movie, I had seen the Last Airbender two weeks before, so I was still in a bad movie-going mood. But this movie rocked!! The Jerry Bruckheimer-action fantasy kicked all kinds of butt! The action was really cool, the effects were awesome, the cast was great, and it's hilarious!! There's a couple of cliches, but I expected that!! I love this movie!!",
      "total_reactions": 0,
      "user": "kyle20ellis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2016
      },
      "score": 5,
      "text": "Once again another Nicholas Cage flick, another Nicholas Cage fail. The Sorcerer's Apprentice tries so hard via special effects and visual effects and fails to excite us out.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    }
  ]
}