{
  "mc_avg_user_score": 6.9,
  "mc_metascore": 66,
  "mc_mixed_rating_frequency": 11,
  "mc_movie_name": "The One I Love",
  "mc_negative_rating_frequency": 3,
  "mc_positive_rating_frequency": 25,
  "mc_pro_critic_reviews": [
    {
      "critic": "Geoff Berkshire",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2014
      },
      "score": 90,
      "summary": "Boasting spectacular performances from Duplass and Elisabeth Moss as a husband and wife on the brink of separation, this incredibly assured directorial debut of Charlie McDowell essentially turns the idea of a two-hander upside down and inside out."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2014
      },
      "score": 88,
      "summary": "Working from Justin Lader’s smart script, Moss and Duplass expertly portray a very typical couple going through a rocky time — and they’re just as effective when the weirdness kicks in during their getaway weekend."
    },
    {
      "critic": "Kate Erbland",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2014
      },
      "score": 88,
      "summary": "The film is brisk, funny, smart, and artful, a strong pairing of high concept and relatable storylines."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2014
      },
      "score": 80,
      "summary": "Though the indie falls short of its grandest ambitions, it is inventive in constructing its conceits. As to Moss and Duplass? It's hard not to love them — for better or worse."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2014
      },
      "score": 80,
      "summary": "It’s Moss who takes the film to a higher, scarier level. After years of playing Peggy Olson on \"Mad Men\", she knows how to smile and nod and say one thing while obviously meaning the exact opposite, and when at last she unleashes the truth, it’s with demonic intensity. She turns subtext into horror-poetry."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2014
      },
      "score": 80,
      "summary": "To sing the praises of the movie but not give away the revelations is difficult. Let’s just say this: The less you know about what happens in this funny, tasty twisteroo, the better."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2014
      },
      "score": 75,
      "summary": "Duplass and Moss are so good, and their reactions to the frankly nutty circumstances of the film are so plausible, that the preposterous premise of the story hits home both conceptually and emotionally."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2014
      },
      "score": 75,
      "summary": "Like other offbeat and original efforts such as Spike Jonze’s “Her,” Jonathan Glazer’s “Under the Skin,” and Richard Ayaode’s dour “The Double,” it juggles genres, reverses expectations, and resorts to fantasy in order to explore the enigmas of gender, identity, and love."
    },
    {
      "critic": "Sheila O'Malley",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2014
      },
      "score": 75,
      "summary": "Unabashedly entertaining at an efficient 91-minutes, The One I Love is an extremely confident first feature, with some really fun things to say about identity and relationship, connection and destiny."
    },
    {
      "critic": "Jeff Baker",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2014
      },
      "score": 75,
      "summary": "I liked The One I Love but if I had to choose between it and \"Third Person,\" the Paul Haggis relationship movie that flirts with narrative in unconventional ways, I'd go back and watch \"Eternal Sunshine of the Spotless Mind.\" Now that's how it's done."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2014
      },
      "score": 75,
      "summary": "It's probably the only love story you'll see this decade that will make you half-expect the camera to swerve and pick up the sight of Rod Serling, standing there in a black suit."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2014
      },
      "score": 75,
      "summary": "Charlie McDowell's romantic brainteaser is disarmingly clever — too clever to spoil. But it's also repetitive and a bit too Spike Jonze lite."
    },
    {
      "critic": "Cory Everett",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2014
      },
      "score": 75,
      "summary": "Justin Lader’s screenplay is contained but also funny, emotionally honest and nails its pivot from the conventional to something much richer."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2014
      },
      "score": 70,
      "summary": "The One I Love is an odd, unsettling and ultimately satisfying movie."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2014
      },
      "score": 67,
      "summary": "Unfortunately, someone (screenwriter Justin Lader, perhaps?) needed to improvise some kind of satisfying denouement because the film’s third act just collapses in on itself. The One I Love is imaginative and provocative until … until it isn’t."
    },
    {
      "critic": "Mike D'Angelo",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2014
      },
      "score": 67,
      "summary": "The ending is intended to be ambiguous, but it’s not too hard to guess what happened in advance, as it’s the only dramatically satisfying option. What’s no longer at all certain is what it means."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2014
      },
      "score": 63,
      "summary": "If you survive that wrenching plot curve (some won't), you're in for an emotional workout. Knowing you've never seen anything like this, Moss and Duplass let it rip. You've been warned."
    },
    {
      "critic": "Elise Nakhnikian",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2014
      },
      "score": 63,
      "summary": "The film gets too caught up in the semi-farcical comings and goings of the two Sophies and Ethans to explore any of the issues it raises about relationships very deeply."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2014
      },
      "score": 60,
      "summary": "Mr. McDowell manages and massages the mystery, even while he forgets to do much with the camera except periodically have it chase after someone. He can be frustratingly inattentive to the visual possibilities offered by the story."
    },
    {
      "critic": "Tomris Laffly",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2014
      },
      "score": 60,
      "summary": "The film delivers on its most crucial idea by being an inventive relationship dramedy with actors who handle the dual challenge thrown at them with distinguished poise."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2014
      },
      "score": 60,
      "summary": "Some of the surprise works, but the final gotcha won't getcha."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2014
      },
      "score": 60,
      "summary": "When it comes time to get to the bottom of what’s really going on, McDowell and Lader start losing the thread."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2014
      },
      "score": 60,
      "summary": "Duplass and Moss are put to the test to carry the film entirely on their shoulders and unquestionably carry it off... On the other hand, viewers will have widely disparate reactions to spending 90 uninterrupted minutes with these characters."
    },
    {
      "critic": "Kate Taylor",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "Here’s a date movie that will neither cozily cheer you nor satisfyingly thrill you, but instead leave you scratching your head."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "Like many movies that premiere at the Sundance Film Festival, The One I Love has plenty of story — for a 30-minute TV episode, in this case of “The Twilight Zone.”"
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2014
      },
      "score": 40,
      "summary": "There’s nothing disgraceful about The One I Love, and if you’re just in the mood for a VOD time-waster, you could do worse. But despite the agreeable lead performances, it doesn’t quite repay your 90 lost minutes of life."
    },
    {
      "critic": "Matthew Kassel",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 25,
      "summary": "The One I Love, Charlie McDowell’s debut feature, can’t decide what kind of film it wants to be. Atonal and aimless, it zigzags clumsily from mood to mood, without any clear direction."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "Mark Duplass and Elisabeth Moss play a couple who rent a house for a weekend getaway in an attempt to save their marriage. Before long, their relationship takes a confounding twist. This is an entertaining kinda romance, kinda comedy, kinda Twilight Zone. When almost the entire film rests on the shoulders of the 2 stars, they'd better be compelling. Luckily, this duo is charming. They manage to keep us interested, even when the film gets a bit talky. Still, there are sufficient surprises to keep you guessing and an engaging creation to make it fun.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "Low-budget, yet simultaneously ambitious in conception, \"The One I Love\" reminds me of another **** of equally low budget, \"Coherence\". In both films, the premise is undeniably clever and engages us throughout, while also bringing up a number of big questions and themes relating to loyalty, identity, and reality. \"The One I Love\" makes much fuller use of it's premise than \"Coherence\" and is the better film of the two. There is a much bigger focus on character here; whereas \"Coherence\" sold it's heady premise as a challenging, yet entertaining brain-puzzle, \"The One I Love\" takes it further by adding a more honed focus on the central relationship of the couple. The performances of The One I Love are multi-faceted and subtle, our loyalties shifting from one version of a character to the other. Duplass and Moss deliver charming charism and obligatory depth. Their performances are what keeps the film engaging on a character level. The premise gets the better of the movie, unfortunately. That is to say that the film doesn't know how to resolve itself in a simultaneously thematically pleasing and conceptually rewarding manner. The ending is a bit too cynical to feel like a fitting send-off to these characters and it's too predictable and ordinary to have worked out the plot conflicts established early on in a realistic way. There are places I wish The One I Love had gone; other aspects of the premise I wish it had made use of or explored. However, this movie still has more ingenuity that most out there and it's an undeniably entertaining flick, one that stands as one of 2014s better works.",
      "total_reactions": 1,
      "user": "TheDRauch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "The One I Love is an interesting film. Starring Mark Duplass and Elisabeth Moss, the film is a trippy little thriller comedy that really messes with your mind. Making you wonder what is real, in a postmodern fashion, the film is a really compelling look at a broken relationship. A truly authentic look at marriage and love, The One I Love is an interesting look psychological thriller that really messes with you mind due to that authentic foundation. This allows the film to really mess with you as it examines this fractured couple and adds in an interesting twist that really shows the problem with cheating in an already broken relationship. An incredibly odd little indie film, The One I Love is both entertaining, thoughtful, and a truly unique take on a well-traveled path.",
      "total_reactions": 1,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "You won't soon forget about this film for better or worse.  I really like the way that this is far from the conventional story even going to the absurd at times.  B+",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2014
      },
      "score": 4,
      "text": "Creative plot. Well very acted and written.  However, creepy in a lot of ways... Stepford wife's esque.....   Biggest problem with the movie is that there is no redeeming value or message....",
      "total_reactions": 2,
      "user": "Chasomcc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2014
      },
      "score": 2,
      "text": "I suspect this film aims to say some clever things about marriage & relationships. However, it's hard to enjoy if you're not happily on board with tricks like time travel, unexplained \"magic,\" a young character and an older character suddenly finding themselves occupying each other's bodies, etc. In general, I dislike that stuff, so this movie was pretty annoying.",
      "total_reactions": 1,
      "user": "Lyn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Fascinating and frustrating. A movie this committed to the \"wtf genre\" would be better off with more closure, but it's well done by everyone involved. The first hour plays out better than the final 30 minutes, but it's still a good ride.",
      "total_reactions": 1,
      "user": "j1train"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "The One I Love will hit you like a brick in the face. You go into the film thinking it is one thing--by the end, you'll have experienced something entirely different. It's about relationships, and perhaps, about magic. It's up to you to decide.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2016
      },
      "score": 7,
      "text": "A unique way to let go of your marriage problems!",
      "total_reactions": 0,
      "user": "LeZee"
    }
  ]
}