{
  "mc_avg_user_score": 6.3,
  "mc_metascore": 37,
  "mc_mixed_rating_frequency": 88,
  "mc_movie_name": "The Tourist",
  "mc_negative_rating_frequency": 59,
  "mc_positive_rating_frequency": 133,
  "mc_pro_critic_reviews": [
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 90,
      "summary": "If Elise and Frank are opaque to each other, they're opaque for a reason, as, sadly, lovers sometimes are. (Come to think of it, this picture has more in common with \"The Lives of Others\" than you might expect.)"
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2010
      },
      "score": 67,
      "summary": "The Tourist is less likely to be remembered for its cat-and-mouse machinations than for the beautiful people carrying them out."
    },
    {
      "critic": "Ella Taylor",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 65,
      "summary": "An awkward jumble of half-assed thriller and lumbering romantic comedy, less competent by a wide margin than \"The Lives of Others.\" It's also a whole lot sillier, though not in a good way."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2010
      },
      "score": 63,
      "summary": "As preposterous wannabe Hitchcockian thrillers go, this one is adequate."
    },
    {
      "critic": "Pam Grady",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 60,
      "summary": "A throwback to classic movies like Charade and North by Northwest where beautiful, sophisticated people answer life-threatening danger with bon mots and ingenuity."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "The pitch is enough to make you swoon, but the movie itself is curiously limp."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "This is a pale simulacrum of those high-style travel-porn thrillers of the '60s and '70s, which only serves to remind us that those aren't as easy to pull off as they look, and also that maybe they weren't so great in the first place."
    },
    {
      "critic": "Calvin Wilson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "A would-be light thriller that's so deficient in the genre's essentials - such as witty dialogue, intriguing characters and surprising yet credible plot turns - that you're embarrassed for everyone involved."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "In the dud thriller The Tourist, Jolie basically plays an overdressed, humorless live-action version of Jessica Rabbit, running around Venice dodging hired killers."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "What should have sizzled fizzles."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "There is a moment in The Tourist when Johnny Depp turns to Angelina Jolie and asks \"Why is all this happening?\" It's a question moviegoers will be asking themselves as well."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "Jolie never ignites, and neither does the movie. Mr. Depp doesn't fare better with a role that forces him to play meek and disappointingly mild, despite a few screenwriter-supplied tics."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "An alarmingly charmless attempt to evoke the elegant romance and jaunty, jet-setting intrigue of the aforementioned titles, The Tourist is notable for the total absence of movie-star heat that movie stars are paid unseemly sums to radiate."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "A slow and silly action-comedy romantic-thriller."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "Star power can cover up a multitude of shortcomings in a film. Turns out stupidity isn't one of them."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "A facsimile of a masquerade of a gloss on \"Charade,\" and on all the lesser cinematic charades that followed in the wake of director Stanley Donen's 1963 picture."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "There's a way to make a movie like The Tourist, but Florian Henckel von Donnersmarck doesn't find that way."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "The Tourist isn't a debacle, but it's a caper that's fatally low on carbonation."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "The script piles the preposterous on top of the absurd and the film's thin charms dissipate, revealing the creaking movie star contraption underneath."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 42,
      "summary": "von Donnersmarck's meat-and-potatoes direction makes The Tourist astonishingly lifeless and awkward, reducing two of the world's biggest movie stars to something akin to shy, pimply teenagers on their first date."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 40,
      "summary": "Without sizzle or thrills, The Tourist becomes as sluggish and rank as the Venice waterways."
    },
    {
      "critic": "Michelle Orange",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2010
      },
      "score": 40,
      "summary": "A different kind of surveillance thriller - an expensive, star-gazing Hollywood one."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 40,
      "summary": "The movie dies onscreen; it might be the best advertisement for avoiding the glories of Italy ever released by a Hollywood distributor."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 40,
      "summary": "Goes about its game so bloodlessly, the result is some of the most unexciting action and seduction sequences in recent memory."
    },
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 40,
      "summary": "If you just want to look with admiration and Johnny and/or Angelina – and why wouldn't you? – this offers the full scenic tour, but it's one of those frustrating almost-good films which never really catches fire."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2010
      },
      "score": 40,
      "summary": "Like a beautifully tailored suit that starts to smell funny after a few minutes, this sumptuous but stultifying lark sets up a quasi-Hitchcockian intrigue between two strangers abroad, but smothers any thrills or sparks in a haze of self-regard."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 38,
      "summary": "Cinema-as-shoplifting is okay, as long as you still get the feeling it's for a greater good. But that's something The Tourist is sorely missing."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 38,
      "summary": "The Critic's Code of Honor forbids me from explaining in detail why the storytelling is so inept, because I'd have to spoil the silly surprises. So I'll say only this: You can interpret the climax two ways, and both will probably infuriate you."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 33,
      "summary": "To see Johnny Depp and Angelina Jolie in The Tourist is like watching a chemistry experiment gone horribly wrong."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 30,
      "summary": "Unfortunately, this is one of those movies with a twist ending that turns a character inside out, revealing earlier scenes to be essentially fraudulent and more or less invalidating one's emotional investment in the story. No one ever walked out of a Hitchcock movie feeling as cheated as this made me feel."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 25,
      "summary": "There are all kinds of bad movies in the world, but it's really only stardom that can create the exact variety of cinematic abortion we find in The Tourist."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 25,
      "summary": "It may be the only movie ever to feature a bad performance by Johnny Depp, one of the best actors working in films."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 25,
      "summary": "The film suffers from a severe lack of urgency and emotional engagement. You can't get involved in a movie in which the characters all seem to be harboring double identities."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2010
      },
      "score": 20,
      "summary": "It's not so much the nonsensical nature of the plot that rankles; it's the movie's wrongheaded approach to the material."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2010
      },
      "score": 20,
      "summary": "Staggeringly misjudged in virtually every department, from the wannabe effervescent script to Johnny Depp's dopey hairdo."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "summary": "This woefully botched mystery-adventure-thriller-caper-romance-comedy, or whatever it was meant to be, is no fun at all."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 0,
      "summary": "In a year of craptaculars, The Tourist deserves burial at the bottom of the 2010 dung heap. It offers talented people trapped in creative inertia. A microscope and a search party could not discover any trace of chemistry between Johnny Depp and Angelina Jolie."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 6,
      "text": "I expected so much more from '' The Tourist \". In my opinion, Johnny Depp made this movie. He played his average guy character really well. The dialogue was very cleaver (one of the best this year), it has a few moments of entertainment and the ending was very interesting and smart. The rest was a little bit boring. Sometimes I felt that this movie was going nowhere. It was so long before they actually got to the '' punch '' of the story.",
      "total_reactions": 1,
      "user": "scrieciu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 6,
      "text": "Recuperating \"The Tourist\", the unfairly panned thriller made by a tourist himself(a German making his first Hollywood splash), means recuperating the performance by Johnny Depp, the risk-taking actor who's receiving the worst critical notices of his career. The big gamble he takes here is to give an anti-performance, as if \"Charade\", the 1963 comedy-thriller starring Cary Grant and Audrey Hepburn, was directed by Jim Jarmusch, the director of \"Dead Man\", which featured Depp in the leading role. Dead is how the many naysayers of \"The Tourist\" would characterize Frank Tupelo, a Wisconsin schoolteacher on holiday in Italy; opaque too, as Depp's somewhat morose line-readings will frustrate moviegoers who expect the actor to be, well, fun, through the employment of banter and sheer animal magnetism with his leading lady. But instead, the vacationing American seems diminished by Elise(Angelina Jolie), and on the verge of disappearing altogether. Jolie, dressed from head to toe in glamorous duds, radiates sex from every bedecked pore of her personage, turning the heads of men and women alike wherever those legs take her. It's this potential for the setting off of fireworks that many will cite as the reason why \"The Tourist\", and ultimately, Depp, disappoints, in which the actor, who made his name initially by playing mutes and near-mutes(\"What's Eating Gilbert Grape\", \"Benny and Joon\", and \"Edward Scissorhands\"), seemingly picked the inopportune time to revert back to his boy-man persona, by talking in a soft and constrained voice. To be perfectly frank, he's sort of a drag, not at all cut out for romance with a sublime beauty like Jolie. But is it a bad performance? If you said, \"Yes,\" that means you're overlooking the third act, in which the revelation of Frank Tupelo's true identity changes the complex of Depp's subdued and fussy performance. Suddenly, the mannerisms that Depp uses to color his cheesehead tourist with, mannerisms which, at the time, seemed nothing more than an eccentric actor's whim(remember his Pepe LePew-meets Keith Richards voice in \"The Pirates of the Caribbean\" movies), turned out to be an invention of Alexander Pierce's making, not Depp's. This time, the voice isn't a novelty, but intrinsic to the character. In \"The Tourist\", the actor(who minced like Angela Lansbury in Tim Burton's \"The Legend of Sleepy Hollow) is one step removed from his latest vocal styling, since it's, in essence, his character playing a character, as Alexander tries to win Elise over by being Frank, but not honest, and in the process, seems uncomfortable in his own skin. Quite understandably, he has some mixed emotions over stealing the woman he loves from himself. And since Depp chooses to portray this conflict with utter seriousness, \"The Tourist\" can sometimes be too angst-ridden for its own good. The original Alexander, the man whom Elise fell in love with, no doubt, had he graced the screen, would have made for a more entertaining movie. As Frank, the wanted man is forced to act counterintuitively all throughout his pallid seduction of Elise, and as a result, many of the scenes where fire is needed(especially the hotel sequence leading up to the moment where the couple's sleeping arrangements are finalized), Depp brings the ice, because the schoolteacher, in Elise's own words(more or less), is not a man who does exactly as he pleases. This comment, made in reference to the fake cigarette which Frank \"smokes\", telegraphs the notion that we're looking at the ghost of a face, blowing ghost smoke from a ghost cancer stick. Elise senses Alexander. \"The Tourist\" treats plastic surgery like a metaphor for reincarnation. The fake cylinder(and fake intrigue: the paperback spy novel he totes around) suggests Alexander's essence, inspiring Elise to criticize the name that her lover bestowed on his permanent alter-ego as being \"terrible\", a word that hardly describes \"The Tourist\", and Depp's performance as a man in transition, haunted by the phantom of his own being, and the horrible realization that his girlfriend is no longer in love with him, the old him.",
      "total_reactions": 1,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "I loved it.  It reminded me of the old glamorous Hollywood movies like To Catch a Thief or North by Northwest - espionage, glamour and a tie it all up twist with a bow.  Fun, light entertainment.  Not too serious, not too dumb, a little glamour.  What else do you want?",
      "total_reactions": 1,
      "user": "JohnQPublic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2011
      },
      "score": 0,
      "text": "I have barely had the misfortune of watching such a bore of a misdirected movie. From start to end The Tourist makes one ask the question: is Johnny Depp in desperate need for cash? Who has approved this empty shell of a script to be turned into a movie?",
      "total_reactions": 1,
      "user": "Average_Joe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2011
      },
      "score": 3,
      "text": "The Tourist comes across as an incredibly limp movie. While it advertises itself as a throwback to the romantic-thrillers of Old Hollywood, it forgets that joy is required to work with a preposterously plotted type of yarn. Everything comes across as half-assed, from the bored, involved, and decidedly lacking in chemistry performances by Jolie and Depp, to the dull, drawn out action sequences, to the comedy that tries far too hard to be clever, and plot twists that are as obvious as they are preposterous. The Tourist is instead of giant vapid hole of Hollywood cynicism and self-gratification, and serves more as a travel add for Venice than anything else.",
      "total_reactions": 1,
      "user": "J-Shap"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 3,
      "text": "It is truly fascinating how the Hollywood industry can take an exciting and funny French film and turn it into a flat film that leaves you absolutely unamused.",
      "total_reactions": 1,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2011
      },
      "score": 1,
      "text": "Although it have great actors on the scene and the idea was good, and the this movie ends been a totally uncessary crap, im sorry about Johny Depp because has always he do an ecxellent job",
      "total_reactions": 1,
      "user": "RodrigoBGC"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "What did you do? When Johnny Depp and Angelina Jolie finally met in one screen? You get in line for a ticket! Mysterious story, city of Venice and promising Director as well, everything looks just fine, what could go wrong? But what you are about to experience is no other than being a tourist and get misguided. The movie based on Luc Besson and Sophie Marceau movie titled ANTHONY ZIMMER in 2004. An American tourist Frank is approached by a mysterious girl Elise in a train (who can deny beautiful girl like Angelina Jolie anyway, do you?) on journey to Venice, Italy. In the beginning, Elise has hidden intention to use Frank as a decoy from the hunt of police and Russian mafia. Now everyone thinks Franks is her long-lost fugitive lover, an intelligent thief Alexander Pearce. Actually, the basic material is very promising, with some twists and turns in development. But in the process, they could not get a precise romantic atmosphere done right. The interaction between the two is stiff and awkward. Frankly says, there is no chemistry here. In spite of Johnny Depp is my No. 1 favorite Actor nowadays (I have all of his movies, all!) but unfortunately in thiz movie he looks too childish next to Jolie. You can see there is still a little bit Capt. Jack Sparrow in Depp character. He looks charming, but most of the time he becomes so uncomfortably clumsy and lazy. On the other side, for me Jolie more looks like -a supermodel walking in her runaway catwalk. Yes, with the smile like that, and her sharp eye gaze, beautifully elegant dresses, who can resist the whole eye candy package. But I have to say, it could be the most boring appearance of Angelina Jolie of all-time. What she does here just keep smiling all the time, without doing exploration for her character. Jolie is doing what I called Robotic Performance.  Too much smile, too much pride, and too much eyelashes. A better performance comes from Paul Bettany as Inspector John. The other Supporting Casts are Timothy Dalton, Rufus Sewell and the memorable one, Reginald Shaw who is very convincing as Berkoff, Russian mobster boss. The Director of thiz movie is Florian Henckel von Donnersmarck. I found myself more enjoying his latest creation, one of respectable German movies in 2006, THE LIVES OF OTHERS. It is supposed to be ravishing, but rather than that, it is happened to be ravenous. In the end, if you came to the theater to see some good looking faces. Wellâ",
      "total_reactions": 5,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "The movie barely heaves itself up to the decent level. Either than that, \"The Tourist\"  has nothing to present but a puzzling romance between Depp & Jolie and a unbelievably messy script that literally makes no sense.",
      "total_reactions": 5,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Even though it was romantic and kind of slow some times, the action and twists keep the movie very entertaining and I thought Depp and Jolie did very well working together. But the main reason you have to see this movie is because of the amazing scenery and chases. I would definitely go see this movie.",
      "total_reactions": 4,
      "user": "lukesnook"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 4,
      "text": "A lack of chemistry between the stars and the trashy action and dialogue make this movie suck, but I found some moments enjoyable.",
      "total_reactions": 4,
      "user": "ReviewCritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Just walked out of the movie-really enjoyed it and Jolie is as hot as ever. Had seen 'Lives of Others' as Depp thought it was so good in an article.  Very talky, but great acting by several people. Wishing on a trip I'd run into someone like Jolie.  A quiet film...very artsy.",
      "total_reactions": 4,
      "user": "twainman2003200"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2011
      },
      "score": 2,
      "text": "Please save your money.  The best and only seriously cool thing to watch in this 2 hour lost-cause was the landscape of Venice. Basically a stupid film. Because of Venice I give it a 2.",
      "total_reactions": 2,
      "user": "LouZoo"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "I thought the Tourist was clever and entertaining with just enough twist to keep it interesting and Jolie was as beautiful as ever and Depp always a good performance. Critics should look at movies for the entertainment value and not the intellectual they tend to over think movies instead of just watching them for what they are entertaining. I give this movie an 8 and would recommend seeing it.",
      "total_reactions": 17,
      "user": "jb56"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 0,
      "text": "This film was void of any entertainment value.  I felt like they trying to capture the feel of those  whimsical movies where Cary Grant and Audrey Hepburn are running around some exotic European location (aka Charade).  Instead, what I got was an absolutely mind-numbing film with no plot, performances that were phoned in by J. Depp and Brangelina, and action sequences that paled in comparison to what you would get from a Merchant Ivory film.",
      "total_reactions": 5,
      "user": "FilmBuff63"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "So here is the thing.  For those expecting the lives of others,  you are going to be unhappy.",
      "total_reactions": 1,
      "user": "jacksecret"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "I liked it and my lady friend loved it.",
      "total_reactions": 1,
      "user": "gchutton"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 2,
      "text": "\"The Tourist\" offers charming leads but with a disorganized script, a very awkward connection between Depp and Jolie, and with a conclusion that is just weird; this movie is simply a waste of time.",
      "total_reactions": 1,
      "user": "brewcrewpride"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "In general, I love Angelina Jolie but in this movie she really sucks. This role was not suitable for her. I can't believe that they couldn't find a better actress for this role. There was no chemistry between her and John Depp who in fact gave a very good performance.. Anglie totally blew it off.",
      "total_reactions": 1,
      "user": "butter_cup"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "Just a regular romantic movie, but nothing more. It's ok if you want to spend 1-2hours but if the director wanted a thriller, well i don't find it here. At least we enjoy the sweet  presence of Jolie after all.",
      "total_reactions": 1,
      "user": "NickXoN"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2010
      },
      "score": 2,
      "text": "With Angelina Jolie and Johnny Depp in Venice, The Tourist could have been really good. Unfortunately, it wasn't. Both actors appear to be disinterested in their roles, but it's hard to blame them with the story they have to work with. The plot is implausible and contradictory and the story meanders aimlessly. Despite this, the ending still manages to be completely predictable. If plot holes don't bother you and you are entertained by shiny things, you'll probably enjoy The Tourist. If you have half a brain, though, best to skip it.",
      "total_reactions": 1,
      "user": "taylorcn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "I watched Salt just days before watching The Tourist. Salt was good but the Tourist can get out of my way. The fist-half of the movie is boring, imagine Angelina Jolie walking around beautiful streets with elegant fashion. Yes, the streets and clothes are good, but Angelina and the storyline aren't. When Johnny Depp reveals the twist of the movie, it's too late because I believe everyone's sleeping when he does that.",
      "total_reactions": 1,
      "user": "consumer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "Oh how we had high hopes! Jolie and Depp, in a caper set in the most romantic city in Europe. But these were wickedly shattered by a disappointing story and poor use made of the abilities of two talented actors. Failed romantic pairing, as Jolie is styled visually as a middle aged Sophia Loren to a naive and playful Depp. Little wit and style, even from Depp and the only star in this show is Venice. The Tourist is replete with shallow dialogue, and unbelievable coincidences amidst beautiful cinematography and a fun rooftop and the obligatory Venetian canal chase. Jolie is usually an attractive woman but her skeletal size, (razor collarbones and noticeably thin arms) is cause for concern. Felt like we had been there and seen this, (done much better) before. Pocket your ticket fare and catch it on DVD or Netflix only if you don't mind a some what vapid \"B\" flick or enjoy pretty scenes of Venice.",
      "total_reactions": 1,
      "user": "Moviechick"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "The so called \"twist\" of this movie was seen coming long before the final 20 minutes of this movie (mind you, i fell asleep 40 minutes into it, and woke up towards the end). The movie is basically two very attractive people spending as much time as they can together not blinking. The dialogue was neither clever nor funny. Skip this one, wait for the next Pirates of the Caribbean if you want to see Depp do something good.",
      "total_reactions": 1,
      "user": "Rienye"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 1,
      "text": "I thought this movie was a waste of time and money. Depp played a fairly decent role. Jolie wandered listlessly around the whole time in designer clothes like a runway model. Makeup was always perfect. Action was little and far between. Good twist at end. That was best part of movie. The lady next to me dozed off three times. Would not recommend even as movie rental.",
      "total_reactions": 1,
      "user": "billy195456"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2011
      },
      "score": 1,
      "text": "OMG! I actually had to research to understand how such a mistake could be filmed and released, and how -alleged- big names could be attached to this... flick. It does have a strong point, manages to juggle the viewer from comedic-drama to dramatic comedy... even if not intentionally. The plot is terrible, acting is irregular and nonlinear (in a bad way) and the direction, well... The Lives of Others was a masterpiece. This is hardly watchable. Such a pity. @cinemaquote",
      "total_reactions": 1,
      "user": "cinemaquote"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 3,
      "text": "ok. this movie was so pathetic, and the soundtrack, as well as terrible, unbearable, it was so uncomfortable and boring, neither pays much attention to the end of the worst I've seen in my damn life. terrible ..!",
      "total_reactions": 1,
      "user": "wishmaster"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "Unbelievable. One of those movies where every single scene makes you cringe.. Where at every single scene you want to scream at the director: cut, do it again. But they didn't. They edited this mess into a movie and hoped that the big names of Jolie and Depp alone would make it a success. To start out, any romance where the woman takes the lead and is basically the dominating party, is not a romance. And THIS romance does not  even have the hint of a spark, there is not the least bit of tension. The entire movie looks like the director was awestruck with having Jolie and Depp, and let them basically do whatever they wanted.",
      "total_reactions": 3,
      "user": "Nazgulero"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "I liked that The Tourist was a bit of a throwback, more concerned with good cinematography than shootout sequences. I also liked Johnny Depp's character a lot; no one does quirky like he does. As for Ms. Jolie's character, well, she's just visually stunning. This is an undemanding, often funny, stylish movie with a gorgeous setting and enviable elegance. It's always composed, which I guess is a problem in a film where lives are supposed to be in imminent danger and some of the characters are flat, as is some of the dialogue.",
      "total_reactions": 0,
      "user": "CorneliaL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2010
      },
      "score": 2,
      "text": "We are Depp and Jolie fans... however, we are not fans of either the actors or this tepid pedestrian, small switcheroo at the end, boring walk through the beautiful city of Venice, cliche of a movie. Venice may be  immortal, this film is not. It has only three weak spots... plot, screen[play, and acting. There is no suspense, you can;t tell if they're going for buffoonery or drama, and Venice, and over the top clothes for Angelia, are about all the film has to offer.  It's usually enjoyable to  see good actors ply their trade... sadly, in this film, the film didn't work, and neither did the actors... Save the money and rent \"Murder on The Orient Express\".",
      "total_reactions": 0,
      "user": "makrtik2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "I loved this film.  It's really a very romantic escapist film with a bit of humor and some thrills and suspense.  Some people perhaps don't understand the intent.  They were going for the look of such 60s films as To Catch A Thief, but this leans more on the romantic side.  Its like a modern variation of fairy tales where a rich girl/ princess falls finds herself falling in love with the poor boy/commoner against all odds.   I thought Depp and Jolie were both fine and believeable in their roles.  You spend a little less than 2 hours transported into a beautiful world with beautiful people, and a sweet and entertaining story.  If you bear in mind what it is really supposed to be, you will be thoroughly entertained.",
      "total_reactions": 0,
      "user": "BenjaminMax"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2010
      },
      "score": 3,
      "text": "\"The Tourist at first glance could have been something interesting and fun. But instead we get a boring obnoxious lame \"long\" chemistry free lackluster film with wasted talent from Jolie & Depp . The Tourist has its moments but never goes anywhere\" .. D",
      "total_reactions": 0,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "ok i gave it a ten more than it deserve maybe it should be like 8,not perfect but just cos the critics are so harsh with the movie maybe they were expecting another movie like \"life of others\" ..",
      "total_reactions": 0,
      "user": "zoy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 4,
      "text": "Angelina Jolie is distant and smirks glamorously as a mysterious woman who travels to Venice to meet her lover. Since he also happens to mysterious, she picks an innocent tourist (Johnny Depp, slightly mannered and barely charming) to act as his stand in. There are a few escape scenes, none of them particularly thrilling, but the core of the film revolves around their developing romance. Without much chemistry, it never sizzles. Jolie gets to look stunning in fabulous clothes and jewelry, while Venice provides a beautiful backdrop. Even though the film is low on energy, it's attractive and mildly entertaining.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "This movie was hard to first get into due to the slow moving begining of everyone admiring Jolie. Once it got moving the excitement or the entertainment didn't go far. I though it was an interesting storyline but didn't move much at all. If it wasn't so slow moving and had some more up beat scenes it might have been a movie more would be willing to see.",
      "total_reactions": 0,
      "user": "Ruler101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "I felt myself getting bored in many places in the film. However, Jolie's elegance and Depp's persona (though quite underplayed in this film) managed to keep me watching. In the end, I was pleasantly surprised at the direction they took the story and the last 10 minutes honestly made the movie worth watching. You should definitely watch this movie at least once.",
      "total_reactions": 0,
      "user": "theycallhimdrj"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "didn't like, its the worst movie for Depp. I thinh really this movie was a waste of time and money. Im a big fan of Deep but I didnt like him in this movie.",
      "total_reactions": 0,
      "user": "Moha"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "The best thing about this film was not the storyline, or the twists and turns in the plot, the action or even the acting by two so talented in their profession. No, the most enjoyable aspect of this film was the cinematography and the feeling that I was watching something slightly reminiscent of the golden age of Hollywood.",
      "total_reactions": 0,
      "user": "JasonG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "Every once in a while, I completely buck the trend and abandon the masses.  Actually, the masses I abandon pretty frequently.  However, with The Tourist, I seem to be bucking everyone.  I loved this movie!  No, it wasn't brilliant.  No, it wasn't flawless.  However, it was a wonderfully entertaining film reminiscent of 60's British spy thrillers with a very different Johnny Depp and an ending that made the film.  Clearly the high-tone cast saw something in it too.  And considering the crap people do like, I am going to borrow a line from Roger Ebert.  If you don't like it, it says more about you than it does about me. :)",
      "total_reactions": 0,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2011
      },
      "score": 6,
      "text": "A tasteful spies movie. Great actors, the plot was a little boring, but proves that there is no need of explosions and lots of bullets to make a nice action movie. Jolie stoles the movie with her stunning presence",
      "total_reactions": 0,
      "user": "Juggernaut"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "8 only because in the first 20 min of the film i just knew what would happen. Johhny Depp is brilliant as always, and i dont understand why they didnt mask the story up a bit so it would be difficult to decipher idea so early in the movie...:(",
      "total_reactions": 0,
      "user": "aryanrule"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "The Tourist was a good movie. It simply fell short in a few area's. But not enough for the critics to downgrade it to a 37 on metacritic..I should note that I went into the film with mindset to The Tourist being awful. Yet at no point during the course from beginning to end did it reach to that potential, rather overachieved expectations and lead to an ending that I half predicted (and hoped for).",
      "total_reactions": 0,
      "user": "shadowknight203"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2011
      },
      "score": 5,
      "text": "The Tourist had a lot going for it even before it started filming:  two of the best looking and most famous actors on the planet, an Oscar winner director, and two Oscar winning writers.  Unfortunately, it feels a bit flat.  The opening setup works with a very poised and stiff Angelina Jolie enticing a naieve and inexperienced Johnny Depp.  Once the characters arrive in Venice though, the surroundings swallow them up and mute their chemistry and performances.  The dialogue takes a backseat infavor of action.  In fact, the action scenes and chases in The Tourist are just plain silly and plodding.  A boat chase scene through the Venice canals is just ludicrous.  The plot starts to come off the tracks as much as the action chases through blatantly contrived settings.  There is a very formal scene in a ballroom with tuxedos and gowns whose only purpose is to show the audience the two leading stars in fine attire.  They have no other purpose there.  If The Tourist wanted to be snappier and land a more lasting punch, they would dial it down; less action, less weaponry, less makeup on Jolie, and the surprise ending...definitely less of that.",
      "total_reactions": 0,
      "user": "CitizenCharlie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "Clever, intriguing, and entertaining movie! Highly underrated. Combined some themes from The Lives of Others, yet with a Hollywood touch. Everything from the magnificent setting, to the plot, as well as the acting were all superb, and made sure there was never a dull moment. Angelina Jolie was absolutely stunning throughout as well as having a convincing British accent, and Johnny Depp gave one of his better performances, one which improves as the story progresses. It was way better than the average summer blockbuster, and The Tourist is a movie which makes you think, unlike most that are made these days. A must see!",
      "total_reactions": 0,
      "user": "filmcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2011
      },
      "score": 4,
      "text": "A chilly movie, not by the slowly scenes, silent but for being merely expository and not enfolding.",
      "total_reactions": 0,
      "user": "jimmytancredi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "Forget unpalatable Salt. THIS is the Angelina we all adore, in a comedy caper of delicious intrigue with Johnny Depp and a mouthwatering setting in stunning Venice. Don't think it's over till it's over. The next-to-the-last Jolie line is the best in the movie.",
      "total_reactions": 0,
      "user": "10sne1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2011
      },
      "score": 6,
      "text": "The Tourist started out as a really enjoyable movie, it was genuinely funny at times because the main character Frank doesn't know really what's going on until the end, unfortunately they through a plot twist in there which ruined Johnny Depp's character Frank for me, it's an ok movie but there are better uses of your time.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "Although the climax was sometimes predictable, the director has tried to maintain the suspense and twists in between to make it interesting. With a mix of glamor of Angelina Joli, the movie remains to be good enough and is a worth watch one.",
      "total_reactions": 0,
      "user": "josephjoshy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2011
      },
      "score": 4,
      "text": "The movie failed to keep my attention. It lagged half-way into the movie, and when it did pick up it still remained boring. The movie had no thrill or action, just drama. I was not moved by either Johnny Depp or Angelina Jolie as I was expecting to be.",
      "total_reactions": 0,
      "user": "kingshahid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 1,
      "text": "What a stupid copy of the 2005 French movie \"Anthony Zimmer\". The French version isn't that interesting either, but still better than this. At least you don't feel like you are watching a comedy when you're watching the French version!",
      "total_reactions": 0,
      "user": "Save_the_Earth"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2012
      },
      "score": 4,
      "text": "'The Tourist', drama or comedy? Perhaps dramedy or seriocomedy? Let's just say this film is how director Henckel von Donnersmarck described it - \"a travel romance with thriller elements\". It doesn't fundamentally matter because this movie is terrible. The scenery is beautiful. Paris is nice but Venice is the MAIN star. Just a shame the awesome backdrop of the city can't take away the fact the chemistry between the two leads is awkward. Not even Johnny Depp's present guyiner could save this sinking ship.",
      "total_reactions": 0,
      "user": "eTurkey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2012
      },
      "score": 4,
      "text": "The Tourist proves that combining beautiful vistas with beautiful people doesn't always equate to cinematic quality. Whilst not awful, the movie just isn't striking in any way. It's not particularly funny, the leads have little chemistry so it's not particularly romantic and it's certainly nowhere near exciting. What you're left with is an only sporadically entertaining but beautifully shot piece of travel porn.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 1,
      "text": "This was an awful film. Not clever in any way at all. It was the kind of film that expected it to be considered a sharp, witty, thrilling film with it's tension built up so well that the twist in the tale is cleverly concealed. However none of that is true. The acting was poor even though there were many great actors in the film and direction was even worse. Worst film of 2010 that I went to see.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "I wanted to like it, I really did, but this was a mess. It was all over the place, and the ending didn't help. The tone was all over the place. Not a good film!",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "What a mess of a movie! It was too silly to be taken as a serious movie, yet it wasnt enough serious to taken as a drama. The movie just doesnt connect with the viewer. The charcters have no chemistry with each other. Also, the story was just awful. Avoid!",
      "total_reactions": 0,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2013
      },
      "score": 2,
      "text": "With Jolie  Depp and Henckel von Donnersmarck  we expected a Masterpiece  but it was all about The charming and classy Jolie",
      "total_reactions": 0,
      "user": "AliBenzekri"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "The Tourist doesn't amount to much more than a rehash of \"The Lives of Others\" with different actors and different scenery. It's slightly predictable, and the story mostly falls flat and is a little bland. But, it's the acting and scenery that are its saving grace. Jolie and Depp are excellent, even if they have almost no chemistry.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "Since I had been hearing from people of the poor reviews this movie has got (not that it matters since I usually like the movies that critics hate), I didn't expect a whole lot from this movie. A good move, I guess, since it was a pleasantly surprising okay-movie.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "Best big budget film in years, but sadly for it, a frontal assault on the views of those who have had sway in Hollywood since Dennis Weaver replaced John Gavin as President at the Screen Actors Guild.  Gavin was Ronald Reagan's ambassador to Mexico.  Not to be missed.  Did great box office outside the USA.  Director is a gifted man who even studied in Russia and directed and wrote a brilliant expose of German Communist oppression - \"The Lives of Others.\"",
      "total_reactions": 0,
      "user": "LouisThorndon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "Filme fraco de ação e de suspense mesmo tendo duas celebridades maravilhosa o filme pecar em ação e suspense um final supreedente porém não salva a monótona trajetória",
      "total_reactions": 0,
      "user": "LoRevisor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "The Tourist is far from a masterpiece. However the movie has some intrigue regarding the plot and Depp and Jolie. Their interaction during the movie is interesting but fans of their work expect a fantastic movie. This movie had a high budget and great actors, yet somehow the movie turned out as a good diversion instead of a classic thriller.",
      "total_reactions": 0,
      "user": "Progeny444"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "İ like this film.This film is amazing. Angelina jolie and Johnny Depp are very beatiful. Even though it was romantic and kind of slow some times, the action and twists keep the movie very entertaining and I thought Depp and Jolie did very well working together. But the main reason you have to see this movie is because of the amazing scenery and chases. I would definitely go see this movie.",
      "total_reactions": 0,
      "user": "m_____p"
    }
  ]
}