{
  "avg_user_score": 4.9,
  "metascore": 31,
  "mixed_rating_frequency": 29,
  "movie_name": "The Lazarus Effect",
  "negative_rating_frequency": 32,
  "positive_rating_frequency": 23,
  "pro_critic_reviews": [
    {
      "critic": "James Rocchi",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 80,
      "summary": "The Lazarus Effect is a smart, unsubtle chiller that should leave even a dedicated horror fan shaken and spooked from its opening scene’s revelations to its final scene’s implications."
    },
    {
      "critic": "Gary Goldstein",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 70,
      "summary": "Director David Gelb, switching gears from his fine 2011 documentary \"Jiro Dreams of Sushi,\" keeps the mayhem moving briskly as an effective host of obstacles pile up in the script by Luke Dawson and Jeremy Slater."
    },
    {
      "critic": "Ryan Lattanzio",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 67,
      "summary": "It's a compelling, even decently acted piece of schlock that breezes by at a lean 83 minutes, with enough self-awareness to know you're going to forget it the minute the lights go up."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "With its homages to \"Frankenstein,\" \"The Exorcist\" and \"The Shining,\" director David Gelb's The Lazarus Effect is at least smarter and tenser than last year's crop of tame horror films."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "There’s no point in overselling a conventional, rarely surprising horror picture, a picture that manages one good, cheap jolt and a solid hour of dread. But Lazarus reminds us that a genre overwhelmed by junk fare doesn’t need to be that way. It’s not effects, gore or novelty that matter. It’s all in the execution, and electrocution."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 58,
      "summary": "It helps that Gelb shoots this less like a horror film and more like a drama. When the film does finally kick into overt horror, it becomes more familiar and less overall effective."
    },
    {
      "critic": "Kevin C. Johnson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "For the hour or so it’s on screen it’s a harmless, little chiller that doesn’t scare much but serves as a holdover until something truly scary comes along."
    },
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "Mildly enjoyable despite its basic mediocrity."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "The Lazarus Effect begins with an intriguing premise then proceeds to squander all the early goodwill through a slow, inexorable descent into cheap horror gimmicks."
    },
    {
      "critic": "Keith Staskiewicz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 42,
      "summary": "I would have loved to see more from the filmmakers, daring to fail while staking out some new terror incognita instead of just going through the motions of an experiment for which we already have the results."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 42,
      "summary": "Like too many horror films, this one seems targeted at a hypothetical audience using only 10 percent of its brainpower."
    },
    {
      "critic": "William Goss",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "A Frankensteinian combination of \"Flatliners,\" \"Carrie,\" and just about any possession flick that comes to mind."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "Despite an intriguing opening and an overqualified cast, The Lazarus Effect can’t shake a been-there/resurrected-that vibe left over from Flatliners, Pet Sematary, and countless other films stretching back to Frankenstein."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "Forget the minor, derivative scares in The Lazarus Effect. The real jolt here is seeing a well-known name playing a monstrous evil force."
    },
    {
      "critic": "Brad Wheeler",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 38,
      "summary": "While the monster Wilde is scary enough, the directing and writing is lazy, relying on “boo!” tactics and insinuating a religious subtext by cutting to close-ups of crucifix jewellery. The ending is slapdash."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2015
      },
      "score": 30,
      "summary": "Sort of a Flatliners for the sensitive indie-actor set, The Lazarus Effect is a grimy, dopey, confused thriller that wastes a very likable cast."
    },
    {
      "critic": "Geoff Berkshire",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 30,
      "summary": "“Lazarus” shamelessly steals from superior genre efforts and lacks any distinguishing traits beyond a wildly overqualified cast."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 30,
      "summary": "Despite eclectic casting and occasional experiments with objective camera, the director, David Gelb (“Jiro Dreams of Sushi”), can’t breathe similar life into this risible mix of pseudoscientific hokum and supernatural freakouts."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 30,
      "summary": "Aside from the waste of talent, the frustrating thing about The Lazarus Effect is how it cheats. Good horror movies work on internal logic."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 30,
      "summary": "The screenplay by Luke Dawson and Jeremy Slater begins promisingly enough with its slow-burn examination of the various moral issues involved. But once Zoe is resuscitated the proceedings descend into familiar horror film film tropes."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2015
      },
      "score": 25,
      "summary": "The Lazarus Effect is nothing but a cheap horror film cloaked in scientific mumbo-jumbo."
    },
    {
      "critic": "Peter Sobczynski",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 25,
      "summary": "This isn't a real horror movie — this is the kind of horror movie that the characters in a real horror movie watch in order to comment on the lameness of the genre before their authentic terrors begin."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 25,
      "summary": "The Lazarus Effect is not the usual mindless thriller, but it’s as flat as an open soda from last week, with dull characters and virtually every scene taking place in a single location. It looks as if it cost about 12 bucks to make — and somebody got robbed."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 25,
      "summary": "Despite classy lead performances by Mark Duplass and Olivia Wilde, the movie, from horror factory Blumhouse (known for cranking out sequels in the “Paranormal Activity” franchise, among others), relies too heavily on reanimated monster movie cliches and scientific gibberish to keep it alive."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2015
      },
      "score": 25,
      "summary": "David Gelb doesn't evince so much as a single compositional sleight of hand, merely delighting in turning lights on and off and watching Zoe appear in random places."
    },
    {
      "critic": "Simon Abrams",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2015
      },
      "score": 20,
      "summary": "Death may not be the end in The Lazarus Effect, but it should be."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 20,
      "summary": "You’ve seen this movie before with peppier actors, and not tethered to a visually uninteresting set that looks like a remainder from a 10-year-old episode of CSI."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 16,
      "summary": "Bringing someone back from the dead is one of the horror genre's oldest and most effective tropes, but with The Lazarus Effect, it just seems tired."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "summary": "There’s no doubt at all that the schlocky The Lazarus Effect should have been euthanized and shipped directly to video rather than haunting movie theaters, however briefly."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "Olivia Wilde breathes life to a predictable premise. With a title like The Lazarus Effect, audience would know what to expect and the movie doesn't disappoint in this regard. It dabbles in resurrection theme, moral ambiguity and the usual possession angle. It's not even presented in large scale or big budget, but what separates the movie with the rest are the performance of the actors, especially Olivia Wilde, and its modest yet effective presentation.",
      "total_reactions": 3,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "I found the movie entertaining, evan if it was a bit predictable. As a movie it was fine, but I felt it would have made a good 2 hour premear for a new tv series.",
      "total_reactions": 1,
      "user": "JadenFrost"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "This movie promises the audience very little, and it delivers the good mildly well. What drew me to this film was the very limited scope (the whole plot takes place in one laboratory) and the interesting cast. Olivia Wilde was definitely the strongest aspect of the movie, and she made this so much better than it could have been. Wilde gave a subtle and very unsettling performance to make her character very memorable. Sarah Bolger was another strong part of the cast, and she gave it her all when her character is being stalked by a demonic Olivia Wilde. The rest of the actors were decent yet forgettable. This movie has a lot of great ideas, but there wasn't any room for any of those ideas to fully develop themselves due to the criminally short 83 minute running time. Had the movie been about 15 minutes longer, those themes could have been developed better. There is a twist at the end of the movie that does explain a few of the more questionable plot points. I jumped a few times, I cringed a few times, and I rolled my eyes a few times, but the Lazarus Effect does its job in a decently creepy yet forgettable fashion.",
      "total_reactions": 2,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "absolutely terrible, derivative, and non-scary. The Lazarus Effect is a mess and does not hold up with the classic horror films like the Exorcist. 0/10 (Atrocity)",
      "total_reactions": 3,
      "user": "Le__Xenomorph"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Acting was really good. Scares were really scary. The idea was great. Just an all around good time at the movies. I love Olivia Wilde and Mark Duplass was very good too.",
      "total_reactions": 7,
      "user": "luckymisclicks"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2015
      },
      "score": 5,
      "text": "Some good ideas are present, but it never capitalizes on them. It touches on elements of religion vs. science and what exactly qualifies as \"crossing the line.\" These elements are unfortunately ditched in favor of generic horror that really isn't scary. The typical attempts at fear are here, but it's really just a boring film.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "Such a likable cast but such a derivative, uninspired story. It had the potential to go somewhere with its idea, but it falls flat because of the plot points and cheap scare ploys. Still a huge fan of Donald Glover and Mark Duplass though.",
      "total_reactions": 1,
      "user": "Eon2323"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "The Lazarus Effect feels like a movie that was ripped straight off of a pastor's VCR. And while it delivers laughable acting and bad scares, the religon that is injected into this movie is depressing. This is if The Last Exorcism met Spit On Your Grave, both terrible movies. Olivia Wilde was dragged into this mess, she is a good actress, but TLE proves even her wrong. This movie is not scary, there are a few jumpscares and exorcism stuff, but all are used at the WRONG time. Its like Paranormal Activity 4, where even the boyfriend gives her girlfriend an unexpected jumpscare that detracts from the movie itself. Horrible and unambitious, The Lazarus Effect is another royal turd of 2015. Bravo.",
      "total_reactions": 2,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2015
      },
      "score": 3,
      "text": "I don't understand. When people write scripts and then start directing......Do they not have a guy that says \"Uh....well that doesn't make any sense.\" This movie seems like it was based on a pretty good idea but the execution and writing were horrible.",
      "total_reactions": 1,
      "user": "Chowda"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2016
      },
      "score": 8,
      "text": "The acting was good, the premise was interesting and the movie was entertaining. Even if the CGI effects were not very good, the movie was predictable at times and the ending was silly, it was still a good, entertaining horror flick.",
      "total_reactions": 1,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "The Lazarus Effect ;; awesome movie , olivia wilde acting superb//",
      "total_reactions": 5,
      "user": "PRAJEE"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "Made me jump a few times, so that makes it not bad and definitely worth a one time watch.",
      "total_reactions": 1,
      "user": "jinannn31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 2,
      "text": "Mark Duplass and Olivia Wilde play a couple of scientists who have discovered a serum that does what the title suggests. But unlike the grateful Bible character, the revived creature has all manner of unexplained dark powers. Just like the experiment, the film starts promisingly, but after the evil erupts the movie becomes predictable and dumb (black pupils, really?). Nothing makes much sense and the evil deeds aren't scary or inventive. On the positive side, the cinematography is attractive.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2015
      },
      "score": 3,
      "text": "Pet Cemetery meets SCIENCE!!",
      "total_reactions": 0,
      "user": "Chaeote"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2015
      },
      "score": 4,
      "text": "A film with just as many unanswered questions as there are thrills.  Except for a few moments of solid imagery, The Lazarus Effect is a bunch of scientific mumbo jumbo that leads to a ridiculous ending.  C-",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "After watching the trailer for this movie, I was extremely excited to see it. I loved the idea it had going and the potential. However, it ended with me feeling slightly disappointed and relieved I didn't pay to see it in theaters. The pros are the fantastic cast, the plot idea of bringing back the dead (ending in a Pet Cemetery style regret), and the overall look/feel of the movie. The cons are failure to reach expectations (it had so much potential), confusion and lack of explanation (what really happened in that burning apartment? Why was she seeing firemen in the end?), and the sudden fast-forward in how quick everything progressed. Once one of them died, the rest just started dropping like flies. Before reaching the middle of the movie, everything just started happening at once. It felt so rushed.",
      "total_reactions": 0,
      "user": "lelefoxx00"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2015
      },
      "score": 3,
      "text": "My main issue with this movie is the majority of researchers that work in areas like this would be middle aged white guys not the uber racially and gender diverse group you have here.  Hard to watch this when you think about that.  Also like another user said it's Pet Cemetery with science. Sometimes dead is better.",
      "total_reactions": 0,
      "user": "dsj556"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2015
      },
      "score": 2,
      "text": "Meh. Cliche after cliche. Also, never really understood the motivation of the possession or what the cause. The entire movie was slow to progress. Once the action began it made no sense. Why an omnipotent being was toying with her prey is really never explained. The whole thing felt so shallow. Pity, because the general premise had great potential.",
      "total_reactions": 0,
      "user": "Costs1129"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "i am saying right now this is worst movie of the year not scary i like oliva wade but not this i fell asleep because it was not even a scare the pliot also sucks one of the worst scary flims since oujia even no was scare in place",
      "total_reactions": 0,
      "user": "REVIEWERWILL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "Perfect for watching in the background while doing something else...",
      "total_reactions": 0,
      "user": "MacheteDontText"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "There is some freaky imagery that's decently effective and the cast does an adequate job, but The Lazarus is devoid of scares and isn't very enjoyable to watch.",
      "total_reactions": 0,
      "user": "WheelzFourReelz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "This movie was alright on certain parts but all in all, it was directed very poorly! All of the scary parts were predictable.  And the story line jumped around; it was confusing at times. Ending was awful. I wouldn't recommend it...",
      "total_reactions": 0,
      "user": "apuckett22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "The Lazarus Effect tries to be original by borrowing ideas from a plethora of other horror movies. It winds up being an unoriginal and unscary waste of a great cast.",
      "total_reactions": 0,
      "user": "SolInvicta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2015
      },
      "score": 1,
      "text": "I really wanted to like this movie since it deals with the profound subject of life after death. However, instead of an imaginative or creative story, were are forced to watch a b-grade horror (yawner) flick. The plot is absolutely incoherent, and there were virtually no moments that were at all frightening. In all, this was a serious disappointment. I'd expect an actress the caliber of Olivia Wilde (and her co-stars) to choose more thoughtful roles.",
      "total_reactions": 0,
      "user": "Horror_buff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "I'm a horror fan, and usually I look for the plot of the story rather than the camera angle and stuff like that. Yes, it was a bit slow at first, but I still was engaged with what was happening. It gave me a back-up story and showed the process of what was happening. I loved the ending where things go out of hand, and I myself had my heart beating fast as I waited to see what was happening and who was going to be killed. And the twisted ending was great as well. That scared me, and that's what I really look for in a horror movie. It's good for halloween or sleepovers.",
      "total_reactions": 0,
      "user": "Alainashariff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "This movie is a guilty pleasure of mine. I'm a HUGE Blumhouse fan and this movie was really good. The acting was great, it was scary, and doesn't deserve a low rating. Worth checking out!",
      "total_reactions": 0,
      "user": "calebowensmall"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2016
      },
      "score": 3,
      "text": "It was okay... it wasn't long enough... and it didn't really go anywhere...didn't go the direction I would have expected. Kind of disappointed because I had such high hopes.",
      "total_reactions": 0,
      "user": "Stargirl04"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2016
      },
      "score": 5,
      "text": "As scary movies go, this one is pretty thrilling.  It reminded me of Flatliners, in that a group of students have discovered a way to bring the dead back to life, but instead of using a defibrillator, it is by way of DMT, a chemical produced in the brain which regenerates itself and contributes to rapid evolution of the brain's neurotransmitters.  The result is an experience of something negative that happened in the past, over and over again.  I love that Frank goes to great lengths to protect his girlfriend, and (spoiler alert) that she eventually does the same for him.",
      "total_reactions": 0,
      "user": "gemmapartlow"
    }
  ]
}