{
  "mc_avg_user_score": 7.0,
  "mc_metascore": 61,
  "mc_mixed_rating_frequency": 16,
  "mc_movie_name": "The Soloist",
  "mc_negative_rating_frequency": 12,
  "mc_positive_rating_frequency": 47,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "The story might not know where the hell its going, but \"The Soloist\" at least succeeds in showing powerful performances of Jamie Foxx and Robert Downey Jr.",
      "total_reactions": 5,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "If not for the actors selling there roles The Soloist would have been a complete flop. Other than Foxx and Downey Jr. The Soloist has nothing going for it. The extremely unfocused film leaves its viewers wondering what the point of it was (Craziness has no cure? Homelessness is a personal choice? Homelessness is a problem everyone needs to be involved in? Classical music is under appreciated in society?)? The Soloist is slow and never really packs any sort of punch or sentimental moment and spends to much time building up a storyline with no real clear cut point, which is essential in a movie or better said character study such as this.",
      "total_reactions": 3,
      "user": "jp992751"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "In what had the conceptual, talent and makings of a fantastic movie, this film loses its way about halfway through and teeters back and forth until the viewer moves from wanting the story to go the way it is leading, to the viewer just wanting it to end. Fortunately, the movie does pick up toward the last half hour. The actual ending is very sweet and probably more realistic than the Hollywood ending it could have had. At the very least, this movie is a snapshot of the plight of homeless people and the fact that each one is unique, with their own story and are worthy of respect as human beings.",
      "total_reactions": 0,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 3,
      "text": "I strongly disliked this film. It tells the story a story of a journalist (Downey Jr.) who meets a mentally ill musician (Foxx) and begins to build a relationship with him, however, I never fully understood why Downey Jr's character wanted to help him in the first place. Therefore this film was impossible for me to connect with because I didn't care for either of the main characters. Joe Wright is a great director, but this film just didn't do it for me.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "As a cello player of 5 1/2 years, I really appreciate this movie's message and theme overall. And even with that said, the movie isn't that bad. It has its ups and downs, and sometimes the story has some holes, but the way music is portrayed in this movie is so accurate, almost capturing the true meaning of music itself. And the dramatic movie you might want as well is definitely there too, dealing with themes like addiction and rage. This is a true movie that might be a little lost sometimes, but it should find its way back into your TV so that you can watch it for yourself.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "The movie, on a whole, is probably the most touching and eye-opening piece I've ever seen.",
      "total_reactions": 0,
      "user": "choomtabi31"
    }
  ]
}