{
  "mc_avg_user_score": 6.4,
  "mc_metascore": 60,
  "mc_mixed_rating_frequency": 61,
  "mc_movie_name": "The Heat",
  "mc_negative_rating_frequency": 46,
  "mc_positive_rating_frequency": 163,
  "mc_pro_critic_reviews": [
    {
      "critic": "Joel Arnold",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 90,
      "summary": "If The Heat is about more than being a well-oiled delivery system for impressive and effective comedy, it's in part about what it means to be a good cop — including the question of how gender does or doesn't factor into that."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 88,
      "summary": "This is one of the most entertaining movies of the year."
    },
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 80,
      "summary": "A good cop/bad cop action comedy with the funniest two-women-above-the-title pairing in memory."
    },
    {
      "critic": "Laremy Legel",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 79,
      "summary": "A bawdy and belligerent comedy, meant mostly for folks looking for nothing more than to enjoy a few laughs."
    },
    {
      "critic": "Sheila O'Malley",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "The Heat is violent, with some pretty gruesome moments and some questionable police work. That's part of the fun. Cagney and Lacey these two ain't. When they finally join forces, they go rogue with a gusto that is refreshing."
    },
    {
      "critic": "Gabe Toro",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "One character dares to open up a debate about sex roles in the workplace; because he does so indelicately, Feig expects you to cheer when he takes a bullet to the head. To his credit, he is correct."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "The Heat is the best female buddy-cop movie since, well, ever."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "The Heat, which provides enough opportunity for wholesale mayhem as well as laughs, is pretty much a guaranteed crowd-pleaser."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "With Bullock doing a variation on her Miss Congeniality geek-tomboy-who-has-to-bloom character, and McCarthy letting her acidly oddball observations rip, the two actresses make their interplay bubble."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "At its sharpest, The Heat actually moves and banters like a comedy, with sharply timed and edited dialogue sequences driven by a couple of pros ensuring a purposeful sense of momentum."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "After watching the trailers, I was expecting torture, but this smart, subversive movie made me laugh. So shoot me."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "If you’re going to make a dopey, bawdy, foul-mouthed, predictable lady-buddy-cop movie, you might as well make it funny. And until it overstays its welcome in the final half-hour, The Heat is shamefully funny."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2013
      },
      "score": 70,
      "summary": "As a buddy-cop movie, The Heat seems almost deliberately generic, with boilerplate plotting carried across with zero panache. It wagers that McCarthy and Bullock’s comic energy will make all the difference—a smart bet, as it happens."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 70,
      "summary": "At times The Heat gets messy, and the comedy is not always pitch perfect. But they're cops. They're enemies. They're friends. They're opposites. It's funny."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 70,
      "summary": "Breaking it down, The Heat has been engineered to deliver the laughs, and the result certainly does, despite coming alarmingly near to botching the procedural elements along the way."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 70,
      "summary": "The script's simpleminded shenanigans notwithstanding, the two stars sync up better than their characters do, especially with some rough-and-tumble physical slapstick, resulting in a crude, low-brow audience-pleaser that will hit the funny bones of both performers' fan bases."
    },
    {
      "critic": "Stephen Whitty",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 67,
      "summary": "If the film takes too long to wrap itself up --and hints, predictably, at a sequel -- the funky soundtrack is fun and McCarthy's South Boston relations are a scream."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 67,
      "summary": "When director Paul Feig — who revitalized feminine comedy with \"Bridesmaids\" — allows McCarthy's improvisational instincts to take over because, honestly, nobody else in the cast can stand up to her. McCarthy is the best thing about The Heat."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2013
      },
      "score": 67,
      "summary": "More often than not The Heat is just stupid-funny, which circles us back to McCarthy, motor-mouthing four-letter fury like an operatic aria. She sells Mullins as delightfully unhinged and fairly radiating with rage, and it’s irresistible."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 63,
      "summary": "McCarthy is a force of comic nature. And she and Bullock mix it up like pros. In this dead-battery of a movie, these live-wires miraculously ignite sparks."
    },
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 63,
      "summary": "This profanely hilarious and tonally erratic spoof of buddy movies is funny as it begins in \"Miss Congeniality 2\" territory, funnier still as it zooms into \"Lethal Weapon\" climes. But it stops dead, and I mean that literally, when it takes a U-turn into a \"Pulp Fiction\" sinkhole of slapstick violence."
    },
    {
      "critic": "Andrew Schenker",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 63,
      "summary": "With the film, Melissa McCarthy definitively cements her status as a legitimate comic talent, leaving her co-star stumbling behind in her wake."
    },
    {
      "critic": "Emma Johnston",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 60,
      "summary": "Following the buddy-cop handbook to the letter, The Heat is derivative stuff, but McCarthy gives it the kick it needs to keep rolling along."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 60,
      "summary": "Scenes go on too long. Jokes outwear their welcome. The plot, though perfunctory (it’s no more complex or intriguing than the average hourlong television crime procedural), gets muddled. Even though McCarthy keeps the laughs coming, The Heat doesn’t really pack enough."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 60,
      "summary": "The Heat is kind of a mess, but it’s a funny mess."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 60,
      "summary": "They (Bullock/McCarthy) deserve a much stronger showcase than this Laurel & Hardy Go Policin’ vehicle."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 60,
      "summary": "Every foul-mouthed joke [McCarthy] cracks, every unexpected physical gag she underplays, is so funny you forget how often we’ve seen this setup. Or, when it comes to women, how rarely."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 58,
      "summary": "It’s not really such a great achievement to have women cops in the movies acting as boorish and rowdy as their male counterparts, especially since the movie seems designed for a sequel. But then again, what movie these days – or at least this summer – isn’t?"
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2013
      },
      "score": 58,
      "summary": "Part of the point here is to stake a claim on a genre that’s traditionally been a boys’ club, and in that regard, The Heat delivers: In a bonding moment, this odd couple goes on a bender as epic as anything in \"The Hangover.\" Their enthusiasm with weapons should alarm viewers across all demographics and species."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "The movie -- too much of it -- is spent testing the boundaries of how loud and obnoxious McCarthy can be. Feig doesn't hand this able comic actress the gift of freedom; he simply gives her enough rope, which isn't nearly the same thing."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "What is the point of making a movie that’s just like the dopiest, broadest and most reductive grade of guy-oriented comedy, except with women?"
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 50,
      "summary": "If this were funny, The Heat would add up to your average buddy-cop comedy. Except that it’s not funny, at least not very and not often."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 50,
      "summary": "The volatile chemistry between Ms. McCarthy and Ms. Bullock is something to behold, and carries The Heat through its lazy conception and slapdash execution."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 38,
      "summary": "Give it up for Sandra Bullock and Melissa McCarthy. You’ll never see them work harder at a  comedy than in The Heat, a stumbling, aggressively loud and profane cop buddy picture where they struggle to wring “funny” out of a script that isn’t."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 37,
      "summary": "Bullock and McCarthy and the chemistry they generate are far more compelling than the movie they’re in. Too often the sketches go on too long, and the coarse, abrasive tone quickly begins to feel repetitive and off-putting."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 20,
      "summary": "Grotesque doesn't begin to describe Ms. McCarthy's new character. Scarily insane comes closer; repulsive occasionally applies. Mullins's insanity can be extremely funny from time to time, but her anger grows as punishing for the audience as it does for the victims of her unrestrained police work."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "Yes, it's loud and sometimes crude, but it's fast, sharp and funny.  McCarthy and Bullock are strong actresses with great natural comedic timing and terrific chemistry together.",
      "total_reactions": 2,
      "user": "hollyv"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "Even though the movie was completely predictable, Melissa McCarthy made me laugh quite a bit, so I am giving this movie a pass.  Sandra Bullock was also good as the nerdy straight man, or straight woman in this case.  I enjoyed their chemistry.  The movie also has some politically incorrect humor involving an albino, and a lot of other crude, low brow humor.  If you're at all prudish when it comes to profanity, stay away.",
      "total_reactions": 1,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "A very funny movie that will bring a lot of laughs. Melissa McCarthy and Sandra Bullock make a perfect comedic team. It's surprisingly crude and downright vulgar at times, proving that these ladies can pull off dirty humor just as well as any male actor can. It's a not stop laugh riot, but it does have some issues that ultimately bring down the experience but do not ruin it.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "The Heat was actually a really funny movie. Sandra Bullock and Melissa McCarthy are both really funny, though McCarthy's character is quite annoying early on. Also, a lot of the humor is a bit over the top so that can get old but a lot of it is still quite funny. I did love the Bill Burr cameo though. Overall, this film isn't for everyone but it provides some laughs and has decent plot and character development.",
      "total_reactions": 1,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "The Heat is Paul Feig's follow him to his smash hit comedy, Bridesmaids. The trailers for this film made it look absolutely hysterical, a completely can't miss comedy, but it's extreme raunchiness turns out to be it's worst enemy. When an ambitious FBI agent (Sandra Bullock) is sent to Boston to catch a monster, she sees it as an open and shut case. What she didn't expect was to run into a local detective who is anything but conventional. The background story and case the pair are working on is really terrific and very well written, with just the right amount of comedy, this really could have been the female version of Lethal Weapon. Instead, the Heat goes so far over the top, that by the end it just isn't that funny anymore. Sandra Bullock is terrific, despite playing her usual whiny loner character. When she finally has had enough of McCarthy and snaps, it really is the best part of the whole film. Mellisa McCarthy is the problem here, as she too is playing her usual character, but to a real extreme. I find her to be very funny, but in this film, nothing is serious and every other word out of her mouth is an F bomb. Every time the story really starts to take off and become interesting, she shows up to screw everything up. Don't get me wrong here, this film is much better than some of the other comedies to come out lately, but as it's destine for a sequel, my hope is that they will tune it down a bit. The right line at the right time can really make a film like this and some scenes are hilarious, but the truth is, when the jokes are non-stop and the action is few and far between, it really hurts the film. Lethal Weapon would be the perfect template for a team like this and with the right jokes at the right time, they could find even more success than Glover and Gibson did.",
      "total_reactions": 1,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "Don't listen to the critics, this movie was hilarious from start to finish. Melissa McCarthy has yet to disappoint me, and Sandra Bullock's return to comedy movies is very welcomed. These two ladies have surprisingly good chemistry, and this movie also has elements of drama cleverly blended in with the comedy. You really start to feel sad for the two main characters and their short comings, but the two as a duo come to compensate for each others lacking qualities. The only gripe I have about this movie is that there is alot of cursing. Much of what came from Melissa (shocking  and from other characters for no reason. The cussing should have been toned down a bit. But overall, this is the best comedy to come out this summer so far, you wont be disappointed",
      "total_reactions": 1,
      "user": "Jbrizzy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "I thought The Heat might be another unfunny buddy cop comedy. But the critics and the audience have raved about the movie so I decided to check it out, and to my surprise, I can see why.",
      "total_reactions": 1,
      "user": "JrAgujaIsAGleek"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "There are some laugh out loud moments in The Heat and the performances by Bullock and McCarthy are great. When there aren't laughs though you realize how predictable and pedestrian the story is. Therefore the movie  probably won't have much replay value. But if your looking for a raunchy comedy with some laughs then The Heat will do just fine.",
      "total_reactions": 1,
      "user": "counts0981"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "This movie is all about the two leads, Bullock and McCarthy. They are hilarious together and work so well off each other, but there's no denying McCarthy is the star as she provides the majority of the laughs. It has a lot of swearing so be warned already about that, but its a clever concept as an FBI agent and Police Officer try and take down a drug lord with hilarious results of course. As long as you aren't taking it too seriously you will certainly enjoy this very funny Comedy",
      "total_reactions": 1,
      "user": "survivorfan989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "The Heat attempts to flip the buddy cop genre on its head by making the two leads female. To some extent, it succeeds. Unfortunately, the most original thing about this movie is that it's two leads are female. The story is really bland, \"go in and stop a drug ring\" type thing. It's filled with laughs yes, but this is really just a somewhat less amusing version of The Other Guys, which managed to be wittier and have a better plot, all while sticking to a PG-13 rating.",
      "total_reactions": 1,
      "user": "SimpleMethod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "Melissa McCarthy is definitely the star of this film her comedic timing is exceptional and her and Sandra Bullock play well off each other.  There are a few scenes that fall flat, but overall this is a real solid comedy.",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "One of the funniest movies of the year. Had me laughing at something in every scene. Melissa McCarthy is the funniest actress living today. Sandra Bullock is also hilarious. A must see!",
      "total_reactions": 1,
      "user": "Lansdenrs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "The heat has to be one of the best movies I've seen, Sandra Bullock just made the movie GREAT! Mostly because of the mean things she would say or just the actions, in the major events! I would really recommend you to watch it!",
      "total_reactions": 1,
      "user": "Movieman998"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "If you didn't find these two wonderful actresses as funny and compatible as I did, I don't know what movie you saw, but it definitely wasn't The Heat!",
      "total_reactions": 1,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "I have not laughed so much in a movie since Hangover 1. My jaw was aching and I had a grin on my face for an hour after we left the movie. Such great chemistry/interaction between Bullock and McCarthy. This what a comedy is meant to be.",
      "total_reactions": 1,
      "user": "Ontario53"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "It has to be one of the most amusing raunchy comedies I have ever seen. McCarthy shows no mercy taking on the role of fearless Shannon Mullins, along with Bullock as uptight FBI agent Sarah Ashburn. This comedy will (or should) tickle the fancy of any comedy fan.",
      "total_reactions": 1,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "Melissa Mcarthy is a cursing bad ass which  i love i did not  look forward in her performance in bridemaids but i did forward in other movies like identity theif .",
      "total_reactions": 1,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "As if Melissa McCarthy isn't funny enough, add Sandra Bullock's funniest performance to the mix and you will not stop laughing from start to finish. A great time had by all... Bravo!",
      "total_reactions": 1,
      "user": "Jaxi18"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "Non stop laughs! One of the best comedies ever.  You will truly enjoy the movie. It's a must see!! If you need a quick \"escape from reality\" then take a time out and have some fun!",
      "total_reactions": 1,
      "user": "rnsy8s"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "What a disappointment. I was expecting great things from this movie. I thought McCarthy was great in Bridesmaids and likewise Bullock in Miss Congeniality. The two ladies together would be comedy gold, right? Wrong. This movie failed not because of these two talented actresses, but because the screenwriters were just flat out lazy. The story was terrible, and the jokes just lame. I believe I lost all respect for this film when they introduced an albino character where they continued to insult him on various \"white\" jokes. Just lazy. There were some funny moments in the film, and just one I would consider hilarious. Overall, this movie had a good concept, but the filmmakers blew it.",
      "total_reactions": 4,
      "user": "jlplatten"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "The Heat starring Sandra Bullock and Melissa McCarthy cop buddies! How on earth, can this go wrong?!?!?! The Heat is capricious fun with hilarious dialogue and some smart ass entertainment. Bullock and McCarthy comic energy makes it almost impossible to find flaws in this movie, which there is, but deniable. The Heat is by far the funniest movie 2013. Bravo!!",
      "total_reactions": 4,
      "user": "MovieGoer14"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "In “Bridesmaids”, “Stolen Identity” and now in “The Heat” Melissa McCarthy proves that she can out pouty mouth any man, tell more poop and crotch (men and women) jokes and be more base than any of the “Hangover” guys so I am hoping she got that out of her system. I would like to see her tackle a deeper role as her Molly in her hit TV sitcom certainly shows a lot more depth as an actress than her movie roles. As it is she becomes very irritating each time she uses the “F” words, and forms of it, and it would make for s super drinking game as it seems every other word or motion starts with F. She is a very funny lady but the crudeness does not help her or the picture.",
      "total_reactions": 9,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2013
      },
      "score": 2,
      "text": "Hard to believe this was done by the same Director as Bridesmaids. Melissa McCarthy as Mullins is just plain irritating and rude instead of funny. All of the male characters in the show are flawed and pathetic. A large proportion of the humor is based around the fact that McCarthy is obese, which constitutes cheap, childish laughs, I had to switch the film off when Sandra Bullock said the word 'Anyhooo.' Completely unacceptable",
      "total_reactions": 2,
      "user": "Lambo442"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "A series of tired sight gags, each drawn out to a cring-inducing length.  Sloppy camera work, haphazard editing,",
      "total_reactions": 2,
      "user": "Benarden"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2013
      },
      "score": 1,
      "text": "Movie was poorly written and jokes are not funny at all .Bank on foul language to make it interest but thats really annoying .Also movie is so long and hard to watch it when no action or joke in it.Dont buy Blueray because its not worth it all.",
      "total_reactions": 2,
      "user": "Smee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "I almost skipped this movie because of the horribly photoshopped poster.  The marketing people really messed up with this one  because this movie was refreshingly hilarious.  I'll admit my expectations were low, but i saw it on opening night with a packed house, and people (including me) were doubling over with laughter.  It was just fun.  Plus, it wasn't bogged down with side stories about someone's boyfriend or a romantic entanglement that derailed the mission or created an inner conflict for one of the characters.  These women are badass and they don't apologize for it.  We need more films like this:  written by women with strong female characters that everyone (including men), will relate to and be entertained by.",
      "total_reactions": 2,
      "user": "AikoDog"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "A Ladies Day Out movie! Sandra and Melissa rocked as partners. Only the villain was weak. i rate this movie 10/10.  Can't wait for Heat 2!!!!!!!!!!!!!",
      "total_reactions": 2,
      "user": "franissavio"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2013
      },
      "score": 0,
      "text": "This is the second movie this year where the majority of the story line is the F word. The lack of creativity and thoughtful script writing is evident.",
      "total_reactions": 2,
      "user": "dblake"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "I have not laughed so much in a movie since Hangover 1. My jaw was aching and I had a grin on my face for an hour after we left the movie. Such great chemistry/interaction between Bullock and McCarthy. This what a  comedy is meant to be.",
      "total_reactions": 7,
      "user": "mak1951"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "One’s got a long track record and an Oscar on her mantel, the other’s lighting up the comedy circuit on large and small screens everywhere. So both are generating A-list box-office heat. Thus their summer pairing in the odd-couple police-action thriller The Heat, in which Sandra Bullock and Melissa McCarthy play disliked loners with the social skills of skunks who are in pursuit of an elusive Russian mobster, a murderous drug lord. Yep, you’re right, we’ve been there a million times. Yet even if every plot point in The Heat were suffocatingly familiar in this male-dominated genre, the film would still feel fresh because it remains an absolute rarity:  finally, a female buddy-cop flick! Bullock is prim-and-proper, by-the-book FBI special agent Sarah Ashburn, an accomplished and respected investigator who has gained a high degree of self-respect with more than a dash of arrogance, and who is actively seeking what she perceives as a well-deserved promotion. So when she’s paired with street-wise Boston PD detective Shannon Mullins, played as a slovenly loose cannon with a mean streak by McCarthy, she’s understandably unimpressed. The key element here, as you can imagine, is the comic chemistry between the two leads.  And it’s considerable and entertaining. Bullock is her usual dependable self, calibrating her character effectively without overdoing it within the confines of the action-thriller genre. As for breakout star McCarthy, so fine in a supporting role in Bridesmaids, then so overbearing when her talent was squandered as the female lead opposite Jason Bateman in Identity Thief earlier this year, she reunites with director Paul Feig, who knows how to showcase her hilarious, motormouth, scatological line readings and her flair for physical comedy. Producer and director Feig, who directed McCarthy to her out-of-nowhere Oscar nomination in Bridesmaids in 2011, gets another strong contribution from McCarthy, who matches and complements Bullock insult by insult, embellishing the scripted narrative with extensive, skilled improvisation. The tried-and-true screenplay by Katie Dippold, definitively formulaic but gender-bending as it is, benefits tremendously from sterling execution by director Feig and his two able leads.  But it goes beyond the surface contours of an action comedy, even though it qualifies as one, by managing to remain relatively character-driven all the way through. As for the film’s missteps and excesses  overemphasized bursts of graphic violence, generically obligatory narrative clichés, characters verging on caricature, too much improvisatory indulgence  well, this unique female version gets the same leeway that all those loose-as-a-goose male buddy-cop flicks have gotten down through the years. Welcome to the boys’ club, girls.  Thanks for the yuks. And in terms of R-rated mainstream franchise possibilities and the odds of there being at least one sequel, The Heat is on.",
      "total_reactions": 6,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "i was going to go see it till a reviewer on tv said there was 190 F words. If you need swearing to provoke a laugh in my opinion your not funny, your just crude and vulgar. Probably not as bad as hall pass which we walked out on. Don't waste your money on the DVD, might be okay edited on TV.",
      "total_reactions": 3,
      "user": "dougaussie"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "This movie was so bad I wanted to leave the theater after about 45 minutes.  The jokes were not funny at all, they're just stupid.  McCarthy yells a lot and uses the f word way, way too much for my enjoyment.  It's too bad because the acting was ok but the writing was just horrible.  Avoid this movie if you are looking for a comedy, it is not funny.",
      "total_reactions": 3,
      "user": "CT718"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "One long, angry but unfunny insult  especially to viewers. Plot is a retread of \"Beverly Hills Cops,\" and the \"jokes\"  if that's what they are  are just as old.",
      "total_reactions": 3,
      "user": "briefly"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2013
      },
      "score": 0,
      "text": "Poor plot, poor acting, annoying unlikeable characters.....",
      "total_reactions": 3,
      "user": "Jimmyred"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "It's hard to do another project after having successfully pulling off a big hit. Director Paul Feig doesn't fully fit the envelope in this one, but for sure leaves us something funny to laugh at. This movie is surprisingly funny. Melissa McCarthy and Sandra Bullock somehow manage to work together. The story is typical, but original at the same time. It's a buddy cop movie, but it's a female buddy cop movie (Which is what makes it original). There are also some other funny characters, but for sure, Melissa McCarthy (Once Again) steals all her scenes. She really makes this movie work and without here, this movie probably wouldn't have it's funny appeal. Overall, it's a funny female buddy-cop movie.",
      "total_reactions": 7,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "Great \"heat\" between the two female leads as they learn to bond against type.  Two problems keep this from being a really good summer comedy:  editing and a villain.  As others have noted, scenes go on to long and we're left waiting and wanting to move on.  The biggest fault is, however, the lack of a real villain.  There's absolutely no heat when we discover oh, that's the villain, and he's about as interesting (and evil) as a college fraternity boy caught peeping in a sorority house window.  What were they thinking???",
      "total_reactions": 1,
      "user": "wvmoviefan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "All funny scenes we saw in trailer, the rest of the movie is kinda dull and stupid. An ok acting combined with badly written plot equals average comedy!",
      "total_reactions": 1,
      "user": "PStakhiv"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "It seems they can not produce a very good comedy these days, forced humor, the story is not a strong thing in it. I do not lay out in laughter. Weak medium.",
      "total_reactions": 1,
      "user": "Firebala"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2013
      },
      "score": 1,
      "text": "I found the film to be completely sexist and offensive to men without being funny at all. There are several scenes where they approach the line and then go over it taking their attempt at comedy completely into the unacceptable depths. The film also takes a pop at black people and albinos again completely uncalled for and not funny.",
      "total_reactions": 1,
      "user": "Dan221081"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2013
      },
      "score": 2,
      "text": "Sadly this film was one of the biggest disappointments of the summer lineup it features two women leads who I have liked in previous films but in this one are just annoying.",
      "total_reactions": 1,
      "user": "Gandalfthegrey"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2013
      },
      "score": 1,
      "text": "Utter garbage movie, I walked out of the movie after suffering the obvious sexism and offensive humour for about 45 minutes at that point I had had enough.",
      "total_reactions": 1,
      "user": "Neilfarson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "Melissa McCarthy got hot after \"Bridesmaids,\" which was directed by Paul Feig who also did this. She's been on a roll since, but her style is wearing thin. She plays a rough, rowdy, renegade cop, who's teamed up with a straight laced FBI agent (Sandra Bullock). This trite buddy cop pairing has potential for comic situations and there are some amusing, even funny moments. The dialogue is crammed with McCarthy's foul-mouthed litany of insults and threats, but they're simply too much. While the abuse sometimes produces laffs, the situations and writing is mostly contrived for best comic effect. Sadly, it fails more than it succeeds.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2013
      },
      "score": 4,
      "text": "Well, you can forget about expecting any kind of plot from this movie. Pretty generic stuff. As for the comedy, there is some chemistry between Sandra Bullock and Melissa McCarthy, but it doesn't make up for the few laughs in this flick. And all the \"F\" words in the world don't make up for it either.",
      "total_reactions": 0,
      "user": "adhamhany"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "Directed by Bridesmaids' Paul Feig, The Heat tries to use the red hot star rating of Melissa McCarthy to produce comedy gold yet again and for the most part it is a genuinely funny crime thriller. When FBI agent Sarah Ashburn (Sandra Bullock) is sent to Boston to track down an arms smuggler she is paired with Boston detective Shannon Mullins (McCarthy) and the two use their interesting police techniques to bring down the illusive villain. Bridesmaids had the benefit of having a huge cast of extremely talented comedians while The Heat is quieter but still stuffed full of comedy. Bullock is excellent as the buttoned up agent as she manages to use the improvisational approach to the filming to benefit her characters nervous nature. While it takes a while to get going, the film is really built around its finale and its really is a fast paced, joke filled climax that lives up to all the setups. It lacks the comic timing of Kristin Wiig but McCarthy picks up the slack aplenty but its still not quite the same. Mullins is an abrasive character which unfortunately makes McCarthy's comedy very loud and ever so slightly ear shatteringly screechy. Another problem is the volume does remove any sense of subtlety to the jokes. However Bullock and McCarthy make an impressive comedy duo towards the end thanks to some much needed character development in the 2nd act, but the opening with its growing pains is dull as dishwater and it drags on the rest of the films riveting comedy antics",
      "total_reactions": 0,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2014
      },
      "score": 6,
      "text": "Sandy B is back in the saddle as an all-powering comedienne alongside her Oscar-friendly intrepid astronaut in GRAVITY (2013, 9/10), in THE HEAT, she plays Ashburn, an F.B.I. agent, a divorced career woman and even more strait-laced than Grace Hart in MISS CONGENIALITY series, directed by Paul Feig who has brought us the sleeper-hit comedy BRIDESMAIDS (2011, 7/10), which has ricocheted the scene-stealer Melissa McCarthy onto a rarefied leading actress status in the primarily male-domineering comedy branch, who has successfully discharged a one-two punch in the domestic box-office last year with generous profits, this one and the critics-panned IDENTITY THIEF (2013).",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "Paul Feig's follow-up to Bridesmaids is certainly miles away. Much of The Heat rests upon it's too very funny and gifted actresses. There's a certain magic between Sandra and Melissa--it has us craving for more.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "The Heat is boring with a drop of funny. But the worst is Melissa McCarthy being abusive, obnoxious, vile, over the top and begins to grow irritating every minute the movie goes by. By the end the entire movie is irritating.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "\"The Heat\" is a formulaic movie. It’s about two female officers who don’t see eye to eye that have to overcome their differences in order to take down a drug lord. Along the way, they have some misadventures as they discover more about themselves as well as each other. However, the formulaic structure is not an issue as the movie really delivers on the laughs. This movie had me smiling, grinning, giggling, and laughing out loud from beginning to end. There are so many variations of humor from slapstick and situational to awkward and raunchy. The film isn’t short on heart either, but instead of being sappy and melodramatic, a lot of these moments are done brilliantly with some great humor.",
      "total_reactions": 0,
      "user": "AwesomeReviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2013
      },
      "score": 6,
      "text": "Comedy is a difficult thing to deliver, and for the most part The Heat is constantly enjoyable and quite funny. However, the story was not all that interesting.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "Some fun funnies. Some editing problems. Some plot jumps. Very predictable. Good comedy if you have superhero origin story fatigue. This is the type of movie you can see being played on cable tv over and over later this year.",
      "total_reactions": 0,
      "user": "analogkid280"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "Contrived plot and tropes aside, \"The Heat\" is still an almost continually hilarious buddy cop comedy with crackerjack performances from Bullock and McCarthy.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "Low brow popular entertainment that is totally uninspired. It's basically a series of gags in search of a narrative to contain them. There are indeed some laughs to be had but the comedy is totally uneven, as is the story, and ranges from laugh out loud funny to lame, predictable and offensive. There is also a reliance on profanity and coarseness which is tiresomely juvenile. Sandra Bullock works hard, but Melissa McCarthy is beyond the pale with her all too familiar antics again on display. Her character is awful and she is awful. Still, at least she is consistent in her characterisations being despicable and unsavoury in everything in which she appears.",
      "total_reactions": 0,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "A sporadically amusing but very uneven and occasionally grating comedy.  I'll get the good out of the way first.  The movie does eventually start to pick up comedic steam after a while and comes up with some pretty funny scenes..., eventually.  The way in which Bullock and McCarthy are complete polar opposites is the engine behind most of the laughs.  However, I'd say the funniest character in the movie is an always angry, albino policeman.  Now here comes the problems.  For a while the movie is actually kinda awful.  McCarthy's character annoyed me so badly that I just wanted her to get killed off as soon as possible.  Needless to say, the screenwriter didn't want her to for some reason.  So much time in this movie is wasted on her just dropping F-bombs like there's no tomorrow.  F this.  F that.  Triple F this F, and etc.  This is probably the most foul mouthed film I've ever seen.  At this point in the game movies should stop doing the buddy cop formula for comedies unless they're so hilarious that no one in their right mind would care.  This movie isn't quite funny or consistent enough to dodge that bullet.  Actually, that bullet probably hit a main artery.  I'd watch the far funnier and more inspired 21 Jump Street instead, which uses meta-humor to criticize its own formula, rather than acting like it's still fresh.",
      "total_reactions": 0,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "'The Heat' is interesting and at the same time is obvious, you will not die laughing in no time, unless you laugh at anything, but the main pair has a strong connection that carries the film on his back.",
      "total_reactions": 0,
      "user": "khutch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "While the jokes may drag and the predictable story may lag, \"The Heat\" manages to only impress by its buddy comedy and female leads. The story is definitely derivative and doesn't take much risks, but the film is far enough to be considered horrible; mostly because of the comedic factors of Bullock and McCarthy. If fat jokes are your thing, this movie will definitely not disappoint.",
      "total_reactions": 0,
      "user": "jeff_reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Great movie! I could not stop laughing. I love Melissa McCarthy and Sandra Bullock, they make a great comical pair. The combination of McCarthy's slapstick humor and Bullock's dry sense of humor they could not have gone wrong. If you are looking for deep, serious flick to watch by no means is this the one to watch, however if you are looking for a carefree flick with humor this is the one! This movie focuses on the two female characters and how they are looked at negatively from their peers at work. This film shows how \"two\" people that are not highly respected from their peers, that coming together as a team what  they can accomplish. I definitely  recommend this film if you are a Bullock and McCarthy fan, I am buying the DVD once it comes out!",
      "total_reactions": 0,
      "user": "dcunningham001"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "In terms of plot there's nothing surprising but it's a solid comedy with a definite low brow humor featuring two strong female leads.  The setting in Boston is only good for one or two jokes.  Michael Rappaport, as always, plays an amazing goofy foil of a younger brother.",
      "total_reactions": 0,
      "user": "gwmyers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "i find it interesting.. somehow it feels like a little bit the same with Ms Congeniality..",
      "total_reactions": 0,
      "user": "sheng"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "I'm not really a fan of Sandra Bullock so her presence kept me from seeing this one in the theater and opting to wait until its release on DVD and Blu-Ray.  However, I was surprised how well her and Melissa McCarthy did playing off each other and actually making the tired buddy cop comedy something worthy of watching again.  Bullock is great as the straight man and the duo worked so well together that it made the film hilarious the entire way through.  Yes, the story is a little generic and a \"by-the-numbers\"/\"The Odd Couple\"-like in its cliche buddy cop comedy but the humor is anything but run-of-the-mill.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "I went in the theater thinking that it might be a little stale u know full of cliches but they turned 70% of those cliches and gave them a cool hilarious twist  Damn funny more than likely be buying this",
      "total_reactions": 0,
      "user": "dyshpo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "This is a good duo cop movie. Even though McCarthy cusses to much. The story is good, the jokes are funny and it has a pretty good ending. Overall, it's good fun.",
      "total_reactions": 0,
      "user": "LTR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "The Heat was actually a pretty good buddy cop comedy based solely on the two main actors alone because they pretty much made a movie with a half-assed script enjoyable to watch. Sandra Bullock plays FBI Agent Sarah Ashburn she is rather arrogant and likes to showboat which is why she is despised by her fellow agents, she is sent to Boston to help assist in a crime she soon meets Shannon Mullins a police officer for the Boston Police Department, a violent, foul mouthed officer that will to do anything to get the job done. The actual plot of the film starts about one hour into it and see that's the thing the movie was too long well at least the first half of the movie moved too slow they should cut off 15 minutes and it would have been a good running time but two hours for a movie with a lazy plot no thanks. The dialog exchange between actors was the best part of the movie and pretty much Melissa McCarthy kicked ass at this it seemed like she ad libbed almost all her jokes because they try to hammer every joke in and for some i can see how this could be off putting but i loved it, Sandra Bullock was great as usual but i felt that her character was still a bit safe still though she was a delight to watch. The supporting cast was a hit and miss for me, i didnt care for Marlon Wayans, Taran Killam and John Ross Bowie but i liked Dan Bakkedahl, Michael Rapaport and Bill Burr.",
      "total_reactions": 0,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "Yes, it's predictable  in both story and character  but Bullock and McCarthy rocked it! Their chemistry is undeniable and both are hilarious in their own right.",
      "total_reactions": 0,
      "user": "benh4rris"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "There's no female comedy partnership like Bullock-McCarthy. I was excited to watch the movie, and the movie did not disappoint. A number of scenes even warranted water-spitting laughs. It tickled me. I love it.",
      "total_reactions": 0,
      "user": "film_bug"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "text": "McCathy's continued box office success recalls what a critic once said about the acting of Whoopee Goldberg:  an entire nation collectively decides not to hurt someone's feelings.",
      "total_reactions": 0,
      "user": "MGConroy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2015
      },
      "score": 5,
      "text": "It's the most predictable buddy cop film you can expect, but the performances, especially the duo, are hard not to get a laugh at. Melissa McCarthy's talent for comedy is always there in her films. She's just about hilarious. Again, I stress that this was just a, rather typical, crime comedy. It's no 'Fargo,' but it has its moments.",
      "total_reactions": 0,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "One of the best comedy's to come out in recent times. Yes its cheesy, yes its crude. Does that bother me  Nope. Sandra and Melissa's onscreen chemistry is sizzling. Perfect foils for one another, and to watch each of them grow through the movie is both hilarious and heart warming. Your jaw will hurt from smiling, and your stomach will be in agony from laughing. A must see.",
      "total_reactions": 0,
      "user": "MatthewBTVS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "The Heat was a much darker movie than i thought it was going to be. Sandra Bullock and Melissa McCarthy work great together. This movie turned out good but i really wasint expecting that much from it. The Heat is an average movie and a good comedy.",
      "total_reactions": 0,
      "user": "SJ-ULTI-Reiews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2016
      },
      "score": 5,
      "text": "On the surface this movie probably isn't as bad as it seems, however it seems to be a modern day spoof on 'Lethal Weapon' without the appeal and unfortunately stereotyping women as loud and annoying or demure and weak.",
      "total_reactions": 0,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "McCarthy over-acted, she was too edgy and carried on her comedy scenes too long. The story, plot, writing and acting was generally bad. The movie was too long, it was unrealistic and was generally about nothing",
      "total_reactions": 0,
      "user": "MrCheeks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2016
      },
      "score": 0,
      "text": "Unfunny for the 95% of the time. Another misanthropic film by Feig. He seems to have a problematic relationship with his penis, see also the last scene of Ghostbusters 2016.",
      "total_reactions": 0,
      "user": "axela"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "This is nothing that great. Sure, mcarthy running around taking down bad guys, spitting out the f word like an agressive spitting cobra is nothing bad, but if its mainly just that, tossed in with a bunch of throw away material, then it is going to be a throwaway film like the heat.",
      "total_reactions": 0,
      "user": "ryanneevman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "This movie was about enjoyable as pulling teeth, deep throating a cactus, showering with a toaster...you get the idea. Save yourself time and plenty of brain cells and just don't see this poor excuse for a movie.",
      "total_reactions": 0,
      "user": "JDayErrday"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "The point was to go with a friend and laugh our a**es off. This movie did the trick -- women who out-do the men. That's the kind of story I like to see and H-Wood rarely allows. Great humor, great action and a lot of funny lines. Yes, women can cuss and use foul language too. So what?",
      "total_reactions": 0,
      "user": "Libralove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "4/5★ The Heat. Odd couple buddy cop films are a genre done to death. The Heat changes that up by making the cops female and casting two of the funniest and likable actresses in showbiz. Bullock as straight woman to McCarthys wild haired antics proves to make for explosive chemistry. The plot is old and tired but boy is the journey entertaining.",
      "total_reactions": 0,
      "user": "reellm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "A remarkably funny comedy with hilarious performances from Sandra Bullock and Melissa McCarthy. Unfortunately, though, the movie is brought down a notch by its cliches and pacing issues. Overall, a great comedy. 8/10 (great)",
      "total_reactions": 0,
      "user": "Le__Xenomorph"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "This is the most hilarious movie I have ever seen. I was laughing SO hard and Melissa McCarthy's character was very funny. Sandra Bullock was okay in the film. The film was kind of predictable but hilarious through the way.",
      "total_reactions": 0,
      "user": "MadMaxFuryRoad"
    }
  ]
}