{
  "avg_user_score": 8.0,
  "metascore": 76,
  "mixed_rating_frequency": 156,
  "movie_name": "The Revenant",
  "negative_rating_frequency": 91,
  "positive_rating_frequency": 1253,
  "pro_critic_reviews": [
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2016
      },
      "score": 100,
      "summary": "The Revenant is every bit as technically proficient as Inarritu's \"Birdman,\" a film that made critics swoon with its masterful handling of the filmmaker's daring \"one-take\" conceit. It manages, however, to do it without the same gimmicky feel."
    },
    {
      "critic": "Calvin Wilson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2016
      },
      "score": 100,
      "summary": "Boldly original, The Revenant puts everything else playing at the multiplexes in the shade."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2016
      },
      "score": 100,
      "summary": "The Revenant is an action blockbuster with an art house soul, a headlong rush of motion with meaning. Pure cinema from Iñárritu and Lubezki, two undisputed masters working at their peaks."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2016
      },
      "score": 100,
      "summary": "The Revenant is a visceral sensation, filled with unforgettable visuals and memorable set pieces."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2015
      },
      "score": 100,
      "summary": "A riveting saga of pain, grit and the brute moral relativism of revenge, the first law of all, and the only one that mattered back then. The Revenant is one of the best pictures of the year."
    },
    {
      "critic": "Soren Andersen",
      "publication": "The Seattle Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2015
      },
      "score": 100,
      "summary": "DiCaprio’s performance is an astonishing testament to his commitment to a role."
    },
    {
      "critic": "Michael Roffman",
      "publication": "Consequence of Sound",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2015
      },
      "score": 100,
      "summary": "A cold, visceral, and overwhelming piece of cinema."
    },
    {
      "critic": "Nick de Semlyen",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2015
      },
      "score": 100,
      "summary": "DiCaprio's raw performance helps elevate what could have been just another man-versus-nature drama."
    },
    {
      "critic": "James Mottram",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2015
      },
      "score": 100,
      "summary": "Astounding. With a director, DoP and cast at the top of their game, The Revenant is a filmmaking triumph."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2015
      },
      "score": 100,
      "summary": "Pushing both brutal realism and extravagant visual poetry to the edges of what one customarily finds in mainstream American filmmaking, director/co-writer Alejandro G. Inarritu, cinematographer Emmanuel Lubezki and a vast team of visual effects wizards have created a sensationally vivid and visceral portrait of human endurance under very nearly intolerable conditions."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2015
      },
      "score": 100,
      "summary": "What is so distinctive about this Iñárritu picture is its unitary control and its fluency: no matter how extended, the film’s tense story is under the director’s complete control and he unspools great meandering, bravura travelling shots to tell it: not dissimilar, in some ways, to his previous picture, Birdman. The movie is as thrilling and painful as a sheet of ice held to the skin."
    },
    {
      "critic": "Robert Abele",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2015
      },
      "score": 95,
      "summary": "Is the relentlessness too much? At two and a half hours, perhaps, but inventiveness abounds."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2015
      },
      "score": 91,
      "summary": "It is as impressive as any movie released this year, but the storytelling falters in some fundamental ways that keep me from completely adoring it. Innaritu dreams big, and he has the muscle to back it up. The Revenant may not be his best film yet, but it's hard to imagine many filmmakers who are working at a higher level than he is these days."
    },
    {
      "critic": "Bob Mondello",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2016
      },
      "score": 90,
      "summary": "What elevates this standard, if relentless, plot line is that The Revenant feels like high-wire work without a net."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2015
      },
      "score": 90,
      "summary": "If you can work up interest in such meager material, the film is a chilling, stirring, experiential immersion in what life-and-death drama might actually feel like."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2016
      },
      "score": 88,
      "summary": "The Revenant is exhilarating cinema."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2016
      },
      "score": 88,
      "summary": "The fact that the last line of dialogue is spoken five minutes before the end credits roll is telling: Words matter little in a movie that favors seeing and feeling above all else. It’s a work of pure, furious sensation."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2015
      },
      "score": 88,
      "summary": "In a year when no fewer than five films have dealt with themes of man vs. nature and survival (including The Martian, Everest, In the Heart of the Sea, and A Walk in the Woods), The Revenant is by far the most brutal, challenging, and astounding of these."
    },
    {
      "critic": "Brian Truitt",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2015
      },
      "score": 88,
      "summary": "The Revenant is the most intense thing you’ll enjoy over the holidays this side of family dinners."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2015
      },
      "score": 88,
      "summary": "You could gripe about the excess of carnage and lack of philosophical substance. But surviving nature is Iñárritu's subject, and he delivers with magisterial brilliance."
    },
    {
      "critic": "Brian Tallerico",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2015
      },
      "score": 88,
      "summary": "Our favorite films often drop questions like these into our lives, allowing us to appreciate the world a little differently than before we saw them. The Revenant has this power. It lingers. It hangs in the back of your mind like the best classic parables of man vs. nature. It will stay there for quite some time."
    },
    {
      "critic": "Rodrigo Perez",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2015
      },
      "score": 83,
      "summary": "Though it may feel threadbare for some, Iñárritu’s near exhausting movie is still unforgettably visceral and there’s so much to be dazzled and experientially shaken by."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2015
      },
      "score": 80,
      "summary": "The combined exceptional work of star Leonardo DiCaprio and nonpareil cinematographer Emmanuel Lubezki create so much verisimilitude and beauty that it compels us to pay more attention to this glimpse of a dark, unsettling kill-or-be-killed world."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2015
      },
      "score": 80,
      "summary": "Mr. Iñárritu isn’t content to merely seduce you with ecstatic beauty and annihilating terror; he wants to blow your mind, to amp up your art-house experience with blockbusterlike awesomeness."
    },
    {
      "critic": "Stephen Whitty ",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2015
      },
      "score": 80,
      "summary": "That grim realism sometimes makes The Revenant about as appetizing as a three-course meal of turkey jerky — but also serious enough to remind you of classics like \"Jeremiah Johnson\" and \"Little Big Man.\" It's a gruesome adventure story that rarely lets up."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The Verge",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2015
      },
      "score": 80,
      "summary": "While the style may outpace the substance, that doesn't make the style any less magnificent. And when it comes to sheer customer satisfaction, The Revenant checks nearly every box, up to and including the man vs. wild throwdown. It just makes a jarring, memorable statement about how often the wild is likely to win that uneven fight."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2015
      },
      "score": 80,
      "summary": "I’m not sure The Revenant is quite as tough and uncompromising as it thinks it is: it's coffee-table existentialism, with psychological brush-strokes so thick they might as well have been put on with a mop. But there’s no question it’s an extraordinary, blood-summoning, sinew-stiffening ride."
    },
    {
      "critic": "Tim Grierson",
      "publication": "Screen International",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2015
      },
      "score": 80,
      "summary": "This brutal survival tale is so powerfully engrossing that, despite the clear limitations of his monochromatic, showy approach, the film’s compelling construction tends to override the legitimate criticisms."
    },
    {
      "critic": "Dave Calhoun",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2015
      },
      "score": 80,
      "summary": "What makes this more than just a punishing, fearful, expertly crafted thriller focused on one man’s endurance is heavily down to Emmanuel Lubezki’s attractive, thoughtful photography."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2016
      },
      "score": 78,
      "summary": "The most punishing movie of 2015, The Revenant, is almost as brutal an experience for the viewer to watch as it is for its title character Hugh Glass (DiCaprio) to undergo. That’s not meant as a knock, but rather as a warning that the film may leave you as near-speechless and mono-minded as its battered returnee from the dead."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2016
      },
      "score": 75,
      "summary": "Iñárritu has his eye so firmly on the myths of America that he loses sight of the men who made them. But he’s hardly the first person to do that."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2016
      },
      "score": 75,
      "summary": "I might be tempted to vote DiCaprio best actor — or at least to propose a new category be inaugurated, the acting equivalent of the Purple Heart."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2015
      },
      "score": 75,
      "summary": "A film I admired, but didn’t especially like, The Revenant is a master class in craftsmanship, marrying the ethos of 1970s Hollywood, with its beaten-dog heroes forever roughed up by a brutal system, to the technological prowess of today’s digitally obsessed blockbusters."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2015
      },
      "score": 75,
      "summary": "There’s a sense that the whole doesn’t quite equal the sum of the parts, no matter how spectacular some of them are."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2015
      },
      "score": 75,
      "summary": "Gorgeously shot by cinematographer Emmanuel Lubezki, Iñárritu’s savage endurance test of a film almost works better as a series of stunning images and surreal sequences than as an emotionally satisfying story."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2015
      },
      "score": 75,
      "summary": "No amount of ingenious camerawork and breakneck pacing can obscure a simplistic core."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2016
      },
      "score": 70,
      "summary": "Its scale and ambition at times makes it seem like more than it is: a survival story. There’s nothing wrong with that, and it’s a good one. It’s just not a whole lot more."
    },
    {
      "critic": "Anthony Lane",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2015
      },
      "score": 70,
      "summary": "The hitch with tales of endurance, onscreen, is their unfortunate habit of becoming endurance tests for the viewer, and, after a while, The Revenant turns into a slog. Make no mistake, it’s a very beautiful slog. Emmanuel Lubezki’s cinematography summons a wealth of wonders."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 70,
      "summary": "The Revenant is supposed to be relentless, though you may find it tiresome, the movie equivalent of tigers circling a tree so single-mindedly that they churn themselves into butter."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2015
      },
      "score": 67,
      "summary": "What The Revenant attempts but fails to do is create a larger vision from all this survivalist mayhem. It’s a useful how-to guide for how to stay alive after a bear attack – or a human attack, for that matter – but it doesn’t soar. It crawls."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2015
      },
      "score": 63,
      "summary": "That first hour is big, and imposing. The rest grows smaller, with the script's self-conscious deeper meanings either layered on top, like pelts, or — more successfully — left to Luzbeki's meticulous images of a sun-dappled 19th century Eden now home to one too many Wal-Mart stores."
    },
    {
      "critic": "Ben Nicholson",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2016
      },
      "score": 60,
      "summary": "Though there's an awful lot to be admired - not least an enormously impressive soundscape - The Revenant ultimately lacks the nerve-jangling thrills or the spiritual resonance that it strives for."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2015
      },
      "score": 60,
      "summary": "I think The Revenant is, on the whole, pain without gain, but it’s certainly a tour ​de force — literally, a feat of strength."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2015
      },
      "score": 60,
      "summary": "In aiming to steer his dark, fatalistic vision toward something genuinely contemplative and cathartic, Inarritu has managed to appropriate the beauty of Malick’s filmmaking but none of its sublimity — another word for which might be humility. There is plenty of amazement here, to be sure, but all too little in the way of grace."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2016
      },
      "score": 50,
      "summary": "However good DiCaprio may be, everything else feels overblown."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2016
      },
      "score": 50,
      "summary": "Despite the literal and figurative pains it takes to persuade viewers of its own importance, The Revenant can’t escape the clutches of crippling self-regard."
    },
    {
      "critic": "Matt Singer",
      "publication": "ScreenCrush",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2015
      },
      "score": 50,
      "summary": "If Iñárritu wanted to show how life on the frontier was miserable and monotonous he succeeded — by making a movie that is miserable and monotonous. Some of the greatest cinematography in history can’t change that fact."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2015
      },
      "score": 40,
      "summary": "I came out of this would-be epic feeling physically exhausted, psychically mauled and none the better for wear."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2015
      },
      "score": 40,
      "summary": "For a while, at least, this one feels like Iñárritu’s masterpiece, until that familiar too-muchness begins to take over."
    },
    {
      "critic": "Jaime N. Christley",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2015
      },
      "score": 38,
      "summary": "What pushes the film, at long last, into the icy river, is its very design, as a monument to slick, mercenary grandeur."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 16,
      "pos_reactions": 18,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "*Spoiler free review* Leonardo DiCaprio's endless hunt for the future Oscar comes to an end with a stunning performance in this realistic, dark and overall stunning cinematography-masterpiece.",
      "total_reactions": 34,
      "user": "TheApplegnome"
    },
    {
      "neg_reactions": 33,
      "pos_reactions": 32,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "In what might very well be Inarritu's best film, \"The Revenant\" delivers in every way imaginable. You get immaculate cinematography that bridges the gap between the majestic and the phantasmagorical. You're delivered brilliantly designed set pieces, featuring ornate choreography and stunning practical effects. You get household-name actors, virtually disappearing into their vivid characters. A simple, yet powerful score. And an endlessly fascinating narrative dwelling in the film's heart. \"The Revenant\" is easily one of the year's best films. In fact, simply calling \"The Revenant\" a \"film\" is a severe understatement. It truly is a breathtaking event to behold.",
      "total_reactions": 65,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "Was okay, plenty of action, and the bear scene was terrifying, but the rest was just leonardo going prone through the woods, swimming, observing the local bison population, and performing Grand Theft Equine before reaching the final boss room. A lot happened in this movie, but parts of it were drawn out and laborious, a shame when you see how brilliant the first 10 minutes were.",
      "total_reactions": 8,
      "user": "Unladenswallow0"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "While I appreciate all the effort that went into the visual aspect of the film Its hard to enjoy it. The characters are shallow, the wandering segment goes on too long, and the glorious tracking shots are absent. This film will no doubt win an Oscar for its visuals and directing but unfortunately I won’t remember it much after that. Just give Leo his Oscar already so we can stop with films like this.",
      "total_reactions": 3,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "i dont really like Iñárritu. he is a show off . same at birdman , same here.the story was short but sentimental and strong  and it could just take 1,5 hour or 2 if there were not those endless yet beautiful-breathtaking scenes when no one was talking or even doing something .Yes the cinematography was spectacular, the costumes too,the lack of music and the reliance on the natural sounds was one of a kind . Οscar for best actor , for best supporting actor (i loved tom hardy once again) , and for director (he's a show off yet genius i have to admit ) but no Οscar for best movie from me , i need a really good story for it.",
      "total_reactions": 3,
      "user": "drambuie_"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2016
      },
      "score": 5,
      "text": "Beautiful scenery, Leo is wonderful, but 2 1/2 hours was 2 hours too long for me.  Artsy film but not entertaining to me. On the bright side I leveled up on angry birds and caught a nap during the film.",
      "total_reactions": 3,
      "user": "Jgieske347"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "Beautifully filmed movie, overall great performances by the actors/actresses. That being said, the movie itself is definitely not the best movie of the year, could have been cut down significantly. In short, The Revenant is way too overhyped for the final product that we get.",
      "total_reactions": 2,
      "user": "amohammed1975"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "The Revenant has been getting oscar recognition and is also doing great at the box office even unseating Star Wars. Alejandro González Iñárritu directs this film with utter brilliance, topping Birdman. the leads Leonardo DiCaprio and Tom Hardy are fantastic in this wild west revenge story based on true events. The Revenant is my personal favorite movie of 2015.",
      "total_reactions": 2,
      "user": "NotoriousFraud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "Not bad movie but after the awards I was expecting to see more of acting motion a good long speech rather than the gore scenes and suffering makeup",
      "total_reactions": 2,
      "user": "Q8MarrongGlace"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "The Revenant was an incredible movie , was waiting for her all this time , as the work of Alejandro G. Inarritu has not been easy but it was great, besides Leonardo DiCaprio, was not very easy for him, but his work was excellent and gave many fruits , Golden Globe, the Critic Choice , SAG , and hope for an Academy Award, an amazing story and powerful.",
      "total_reactions": 2,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "I think DiCaprio deserves the upcoming Oscar, after another well chosen role and polished performance.  The acting , scenery and scope add a further dimension.",
      "total_reactions": 2,
      "user": "Pw77"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "This is all you can expect from an Iñarritu movie. If you liked Birdman, you will like this one. Bad thing is that, if you got bored with Birdman, you will feel the urge to get out of the theatre on this one. Many elements of the movie are great, but others feel very irreal, like the fight with the bear. It is not possible that a normal human being could survive that fight. Also extreme freezing and hunger conditions. Many other characters die quick, but not the main one, so, that will make the story feel kinda empty.",
      "total_reactions": 2,
      "user": "VideoJuegosCom"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "Evidentemente ci voleva  Innaritu per consacrare definitivamente Di Caprio. Esaltante la sua prova affiancata da un sempre piu ispirato tom Hardy- Decisamente un bel film",
      "total_reactions": 2,
      "user": "MCPozzi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2016
      },
      "score": 9,
      "text": "One of DiCaprio's best films, a truly epic tale of man vs, nature. Leonardo deserves an Oscar for all the hard work he went threw, and so should Tom Hardy for a great supporting role. This film has some of the best visual shot I have ever seen. For my conclusion this is a truly great film with great camera work, great acting, and a very good story. I will say the only down side to the film is the plot does kind of drag on but in the end the film was great.",
      "total_reactions": 2,
      "user": "futurespielberg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "My only problem is it's obvious the Academy knew they should've given Leo the Best Actor trophy for the Wolf of Wall Street, gave it to him with this instead. He's good but he didn't convince me as a father from which the whole movie somewhat stood upon. As far as acting award goes, Tom Hardy should've gotten one. If he continues to make good choices, we're looking at a living legend right now.",
      "total_reactions": 2,
      "user": "pureshores"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2016
      },
      "score": 7,
      "text": "A film with just as many vistas as there was to make up for lack of dialogue and true character progress. The film was indulgent in every sense of the word, however the performances across the board we brilliant. Realistic and honest. A tiring but good movie to watch",
      "total_reactions": 2,
      "user": "HolioEscoban"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2016
      },
      "score": 3,
      "text": "First the good news.  The cinematography is stunning - stark, bold, lumnescent.  It owns the screen in a way I seldom see.  Now for the rest.  Based on a true story covers a multitude of sins.  To keep it short and sweet, the plot is ludicrous and unbelievable and totally dependent on one outlandish coincidence after another.  The character development is foolish, people made out of cardboard.  All this leads to a climax out of a pulpy comic book.  My one question to tye screenwriter.  In this vast and frigid, white expanse of emptiness, how is it that all of the principals inevitably camped within a few hundred yards of each other and came across each other without fail for any of the action scenes?  Gve me a break.  If you can't see this on the wide screen it deserves, don't bother.",
      "total_reactions": 2,
      "user": "Vagabundo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "A harsh winter for beast and man.",
      "total_reactions": 1,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "Between Alejandro G. Iñárritu and Chivo Lubezki, THE REVENANT is one of the most visually striking masterpieces of the 21st century. The spectacle does not end at visual storytelling—but continually astounds audiences with its tale of survival and revenge. The filmmakers chose not to sugarcoat the wilderness of the 1820s, but rather vividly show its extreme brutality and rawness. Above all, Leonardo DiCaprio gives the finest performance of his career – to finally, hopefully, secure his well-deserved Oscar.",
      "total_reactions": 1,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2016
      },
      "score": 9,
      "text": "The new work Iñárritu is phenomenal, incredible epic in every way, visually the beauty of the scenery is breathtaking, the performance of DiCaprio is magnificent and of course not to mention the bear attack scene is eerily amazing.",
      "total_reactions": 1,
      "user": "Iky009"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "It is a directorial, cinematographic, and actor's triumph of a film. It's clear to see why they finally awarded DiCaprio the Oscar for this role, for he captivates all the pain and suffering in his main character. 'The Revenant,' while being at its core but a simple revenge story, is elevated by the rich, natural visuals, cold realism of its stars, including Hardy, who plays the villain with superb talent. Alejandro González Iñárritu pulled off a visual masterpiece here.",
      "total_reactions": 1,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "Pros: Great acting, directing, cinematography and sound mixing were used in this film to show how tough life was in 19th century North Dakota, considering the winter, the Indians, bears and people in your own party who wish you dead. That's from the perspective of the new settlers. It's not much better for the native Indians. The film tries to be very realistic and is very gruesome many times.",
      "total_reactions": 1,
      "user": "43in2014"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "Alexander Gonzales Inarritu wspaniałym reżyserem jest.",
      "total_reactions": 1,
      "user": "TributeMan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "A visual spectacle, The Revenant manages to tell a thrilling, exciting story for its lead. Leonardo DiCaprio gives his best acting and it shows, while the supporting cast is all but amazing. A movie about revenge, but mostly survival, The Revenant is, simply, a very great movie.",
      "total_reactions": 1,
      "user": "UltimateBub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "Best in this genre since \"Dances with Wolves\"!!  If you liked the scope, story, and overall picture in DWW you will love this movie too.  The Cinematography in \"The Revenant\" is over the top, absolutely beautiful.  The film itself can be a little bloody and graphic so if you can't handle that sort of thing then its probably not for you.  True depiction of the era and the hardships of the time.  I thought as with DWW it shows the Indians could be compassionate, and most of the time we as white men were the ones taking advantage of them.  We were on their land and treated them badly.  Everyone in the theater was glued to the screen, might have been a tad long, but so enjoyable and well written that it didn't seem all that bad.  Great movie and glad to see they are making some movies in this genre again.  I really enjoyed the movie and was money well spent.  The only thing I could be critical of is perhaps the super human feats that the character managed at times, but you have to figure that happens on the big screen to make it more appealing!!",
      "total_reactions": 1,
      "user": "horizonbts"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "What a beautiful movie, this film has some of the best cinematography I have ever laid my eyes on. Keeping dialog to a minimum lets you feel the environment and atmosphere quite well. God this movie is great!",
      "total_reactions": 1,
      "user": "CMovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2016
      },
      "score": 9,
      "text": "A technically stunning drama filled with extremely gruesome but awesome special effects. Aside from that, Di Caprio's performance is stellar, and plot is strong.",
      "total_reactions": 1,
      "user": "JuanLuisGG14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2016
      },
      "score": 10,
      "text": "\" The Revenant \" direct to the Academy Awards.",
      "total_reactions": 1,
      "user": "PipeC"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2016
      },
      "score": 9,
      "text": "This is hands down the best movie of 2015!!! Although The Revenant suffers from its run time, it is a beautifully shot film, with fantastic acting, and a fabulous score.",
      "total_reactions": 1,
      "user": "TrackerDevice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "Leonardo DiCaprio's endless hunt for the future Oscar comes to an end with a stunning performance in this realistic, dark and overall stunning cinematography-masterpiece.",
      "total_reactions": 1,
      "user": "aadityamudhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2016
      },
      "score": 9,
      "text": "Wow. What a ride of a movie! Certainly has one of the most gripping scenes I have ever seen in a movie (no spoils but you'll know it when you see it, makes your jaw drop. ) Amazing movie. They get right to it too. Not a lot of buildup. Highly recommended!",
      "total_reactions": 1,
      "user": "pythag0ras"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "This movie was nearly my favorite of last year. The acting was great, which it very well has to be if the movie going to be great. The movie has an easily graspable plot. Sure, there wasn't too much character development, but there was a lot of isolation, so it didn't need character development. My favorite part, however, was the villain. They did a perfect job of making us HATE the villain, with everything he did.",
      "total_reactions": 1,
      "user": "Ectsoplasm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "Check out the Formal Review episode on the Revanent and full review here:",
      "total_reactions": 1,
      "user": "TheFormalReview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "Recently saw this film, at first I was hesitant because of hearing it was very violent and gory.  At times it was hard for me to keep watching, but I enjoyed it for the most part.  It was entertaining to watch, they captured beautiful scenery and it was good acting.  Any movie with Leo is never a disappointment.  I will say the story in itself was very sad, almost depressing so it was sort of painful to watch in my opinion.  Overall the movie was very real, filmed well with good actors.  I was glad I decided to see it and recommend others to do so as well.",
      "total_reactions": 1,
      "user": "Taylorg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "The Revenant isn't a very complicated film by any stretch of the mind. It's a revenge story focused on survival and overcoming the worst possible situations imaginable. We'll start with the best thing about this film. The cinematography. WOW does this film look AMAZING. Every shot is done with natural lighting and it really shows in the film. This movie is brutally realistic, from the bear attack to the final showdown between Hugh Glass and John Fitzgerald. This film is violent and dark and it's realism and amazing cinematography make the film a true delight to watch even if some of the scenes are very brutal. Now to the story, while good, isn't complicated at all and is very easy to follow. The characters are simple, you have the strong leader, Hugh Glass who is very looked up to by most in his group, Tom Hardy who plays the antagonist that leaves Hugh Glass for dead and murders his son right in front of him. While simple, these characters are portrayed very well by Leo and Tom Hardy and both men deserve a nod for their performances in this movie and while everyone screams for an Oscar for Leo, Tom Hardy did an amazing job in this film as well. What more is there to say about the story? Long story short, Glass is mauled by a bear, left for dead by John Fitzgerald (Tom Hardy) who murders his son and now Glass must rise above the elements and survive a harsh and unforgiving environment with some aboriginal tribes thrown in as well along the way. It drags on way too long and made the film feel much longer than it really was and by the last 10-15 minutes it was feeling like it was never going to end. As a movie, The Revenant would receive maybe a 5 or 6. It's simple, drags on a little too long, but the characters are interesting enough to keep it going strong. As a film, The Revenant really shines. To the atmosphere, cinematography, and how realistic it is, it's one you have to see. It'll leave you thinking \"how did they do that? how could they get that shot?\". The bear attack in particular gave me chills and it tried to do that and it succeeded in doing so. It's one of those movies you can watch maybe once or twice a year, but it is an amazing film even with a long run time.",
      "total_reactions": 1,
      "user": "whompy17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "DiCaprio warrents himself another Oscar nomination, but I have to admit he doesn't deserve the win. Though his talent is undeniable he's simply got too little to work with here. Despite being the main attraction, his dialogue is so far apart and and between so much action that he's given little opportunity to win our hearts. Even when these opportunities do present themselves the writing is unfortunately much thinner than what you'd expect from a role played by the best actor of the year. For these unfortunate reasons we shall all prepare ourselves for yet another March full of \"Leo has no statue\" memes. Perhaps one in which the Oscar is mauling him instead of a bear. Hardy however, is outstanding, making the best of every scene and warranting himself a nomination of his own, though it's doubtful he'll get it. Even Poulter does nobly in what must have been a daunting list of co-stars. The only role I found distasteful is that of my fellow ginger's. Though Gleeson made my list of those to watch after Ex Machina, this performance makes it two in-a-row that I've felt he was miscast and for largely the same reasons (the other being Star Wars). Gleeson seems to be stepping into roles suited better for men twice his age. Though he looked the part here much better than in space, he still lacks the authority to create a conviction from within a leader.",
      "total_reactions": 1,
      "user": "JingerJake"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "Gross! but it seems like that i'm seeing a documental for a parts... it was lost sometimes the history was weak and cliché... luke did it first and thats all... but sometimes i felt like i was there sufering",
      "total_reactions": 1,
      "user": "RodrigoFernety"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "Anyone calling The Revenant boring went into this movie thinking it would be another shoot-em-up western, while the only western I can think of comparing it to would be Jeremiah Johnson. If you haven't seen that, check it out, its a less gory version of this film except the protagonist is after Crow Indians instead of Tom Hardy.",
      "total_reactions": 1,
      "user": "GreenBastard"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "Visually outstanding landscapes. Very good job from Leonardo Dicaprio and Tom Hardy. The film is two and a half hours long. However, every scene is worth watching.",
      "total_reactions": 1,
      "user": "Javi_Barranco"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "I've checked this for spoilers but it's predominantly a vague - non-spoiler - review, so if you haven't seen this and you only care to watch it with a certain half-heartedness, then this is the one for you. I digress...",
      "total_reactions": 1,
      "user": "ThatGooner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "Movie earned all rewards except for best actor. Leo should receive it earlier, but however. The Revenent is amazing. Fantastic directing, picture, Tom Hardy, every scene is done perfectly, so big respect for one of the best directors today, Inarritu. He has done a big job with this, and it was a very hard task, just like with Birdman. Great soundtrack and everything that makes you feel like you are in the forest with Leo, does that. One of the best movies in 2016., and one of the best with such a little dialog I watched.",
      "total_reactions": 1,
      "user": "c_avdo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "\"Revenge is a dish best served cold\" is the most fitting adage here, seeing as how DiCaprio spends nearly the entire film in freezing conditions, fueled only by his fiery rage and insatiable desire for vengeance. The scenery is amazing; the graphics of the bear mauling impeccable; the intermittent gnashing of teeth (DiCaprio's) punctuate scenes like the icy blast of winter's first freeze, cutting the viewer to the core. No doubt, his performance was impressive, and he committed to the role with an intensity that skewers the viewer's soul, much as the computer-generated bear did to DiCaprio's nearly frozen limbs. The story itself misses the mark historically, as the real Hugh Glass did not have a son; however, the overlying, timeless theme of righting someone's wrong rings as true in the 1820's as it does today. It is that drive to make someone accountable for his actions that keeps the viewer glued to the screen from start to finish. One can't help but wonder what he or she would do in a similar situation, and how he or she at one time has also felt like Hugh Glass, wishing to make someone pay for another person's wrongdoing. In addition to DiCaprio's performance, Tom Hardy proved a force to be reckoned with, chewing each scene as hard as he did the wad of tobacco he slid carefully between his teeth and cheek intermittently. It was his performance that was perhaps the most overlooked, and the final reckoning between Hardy and DiCaprio was a cinematic masterpiece.",
      "total_reactions": 1,
      "user": "peterbelbita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "Alejandro González Iñárritu takes you on a journey through a man`s struggles in 1823 America. Leonardo DiCaprio in what could be hist best role yet completely amazes you in every scene he is in. The Revenant is easily one of the deepest and most intriguing films of this decade. It is a film that excels at everything it does, from the breathtaking scenery to the grueling stunts. Leonardo DiCaprio and Tom Hardy`s performance are so mesmerizing that you forget your watching a film, and instead a Biopic. The clear determination from both actors to excel at their roles is made very evident in every scene they are in. The tone of the film is dark and gritty, perfectly describing the times with which those men lived in. The cinematography in this film  is on a completely different level. The choice to use natural lighting instead of artificial is a gamble that pays of massively. Overall this is a fantastic film that deserves all of the countless awards that are inevitably going to come its way.",
      "total_reactions": 1,
      "user": "thatcriticmaha"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "This movie was pretty cool but it was a little over-the-top.  All the actors were compelling and the scenery, wardrobe and music were great, too.  I loved the grizzly bear scene and the first fight scene.",
      "total_reactions": 10,
      "user": "musicforall"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "Leonardo DiCaprio suffers with grim determination in this long and brutal story of betrayal, survival and revenge. However, this very physically demanding performance does not wow as it should. The almost total lack of dialogue for the character results in viewer alienation and a lack of empathy. One watches the horrific events unfold, but with a dispassionate detachment and some distaste. Director Alejandro G Inarritu creates a wonderful atmosphere environmentally. The locations, beautiful but forbidding, are awesomely captured by cinematographer Emmanuel Lubezki whose work here is just stunning. The film is worth seeing for his achievement alone. Also many scenes have a visceral quality to them, none more so than the Indian and bear attacks which both happen within the first half an hour and are excitingly and shockingly staged. Visual effects for the bear are incredibly good. After this events meander from one bloody scene to the next leaving one somewhat anaesthetised to the grisliness of it all. Suspension of disbelief is also a requirement in accepting just how quickly DiCaprio is back on his feet after his mauling by the bear, let alone scaling mountains (one sequence shows him at the top of a mountain unable to walk; the next scene shows him drinking from the lake below!). In support, Tom Hardy also disappoints, but this is once again mainly due to a vocalisation of his character that is often unintelligible. As we all know DiCaprio will win his long overdue Oscar here, and there is no denying that he is a deserving recipient. It’s just a shame that he will be rewarded, as happens all too often by the conventional and short sighted Academy, for this performance over one of his previous more deserving roles.",
      "total_reactions": 8,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "The film was shot in Alberta Canada and the scenery is beautiful.  It is well acted and well directed.  That being said, it is 2 ½ hours of imaginable brutality and suffering to the point of boredom.  The storyline is weak and there should have been more information upfront about who, what, when, where, and why to set up what the film was about.  That would have given it a point of focus and make it easier to understand and endure.  It was a disappointing experience . .  .",
      "total_reactions": 6,
      "user": "gfny"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2016
      },
      "score": 6,
      "text": "This is the most over-rated film of the year.The cinematography is gorgeous and unrivalled by the other films released in 2015. Other than that, I can't think of anything else complimentary to say. The plot is basic and the movie plods along. DiCaprio moans and grunts his way through most of it.",
      "total_reactions": 6,
      "user": "FredinToronto"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "Entertaining and visually interesting.However, when making a movie about survival in nature it would be prudent to consult with a survivalist and/or a naturalist.I was quite distracted by the unrealistic portrayal of the events and the scenery. You have people walking in valleys,forests,on rocky mountaintops in winter,in no particular meaningful order, let alone with no realistic timeline for anyone to have covered that much ground or altitude.Foothills,plains and high rocky mountain terrain all look really nice but it makes no sense. At one point you even have people walking in a rainforest type biome that in no way corresponds to the others(environments both on east and west side of the Rocky Mountains).Most of the scenes,supposedly in the remote wilderness, have disturbed/trampled snow all around. There are many scenes of people tramping around in the water and then presumably surviving outside,with no shelter in wet clothes? Ten minutes in cold water and muscle function is lost so the scene where the protagonist floats down the river in winter and then sleeps on the bank when he crawls out is just ridiculous.The seeming ignorance around portraying the events in a somewhat realistic manner detracts from this movie greatly for me.",
      "total_reactions": 10,
      "user": "City8grl"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2016
      },
      "score": 4,
      "text": "Long, boring, went to see it on the big screen because of the cinematography (not worht it). Acting is the same from beginning to end. How long can someone trudge through this bleak setting? Very disappointed. The worst movie Innarritu has done. See it when it comes out streaming and you can fast forward.",
      "total_reactions": 5,
      "user": "katezoe"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "The technical achievements are impressive. The gorgeous cinematography and a hardcore central performance cannot be denied. But the film is dragged down by two problems.",
      "total_reactions": 5,
      "user": "ahnehnois"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2016
      },
      "score": 4,
      "text": "This movie in my honest opinion isn't very impressive.",
      "total_reactions": 5,
      "user": "Datamari"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "It started out great with a decently paced introduction to the setting but as time went on you start to notice one or two moments of stupidity and worst of all repetitive and pointless scenes of walking and sleeping. The ending was OK and helped make up for the tediously boring middle sections.",
      "total_reactions": 9,
      "user": "Marxon"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "If Christian Bale had made this movie he would've dropped 50 pounds to play the role that Leo DiCaprio took on. That's just one of the suspension of belief issues that cropped up in The Revenant. I did enjoy the movie, I love outdoor adventures, but so many technical issues cropped up, it became laughable after a while.",
      "total_reactions": 8,
      "user": "Edeltraud"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "I haven't posted many reviews on this website recently, as I was focused on my daily studies, but I took the time to see this movie, and it was surprisingly great. I knew I was going for a slowly paced movie, but it actually didn't hit me as one. It never got boring, nor too slow for me. The violence is so awesome in this movie. Either the bear scene, or Leonardo DiCaprio's character covering himself inside of a horse's dead body, it was friggin brutal. The bear attack was especially frightening. What I like about this scene is how the bear interacts with Glass. He first attacks him, smells him and goes away for a few seconds, than Glass grabs his gun and shoots the bear, although the bear attacks him again, and shakes the poor guy like dogs do to the rugs. Then the bear stops one more time, and few seconds later, the bear takes his shot one more time, but Glass stabs it, and they both fall off, with the bear on top of Glass's body. It's amazing how they edited and choreographed this particular bit.",
      "total_reactions": 4,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "Is The Revenant the best movie of the year? Surely not and in fact it's doubtful if it's a great movie at all.",
      "total_reactions": 4,
      "user": "moviescriticnet"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "This movie is so manly I grew a beard halfway through. Joking, but do not take women to see this movie. They will ruin it for you and will not enjoy it themselves. I loved the acting, story-line, fight scenes, gore... Really makes you feel like a man. I loved this movie, but it did not get a 10 for one reason. The sound score was absolutely atrocious. Painful to listen to. During an extremely dramatic fight scene we hear 4 vibrato notes through out the whole movie. Who hires a first time, contemporary composer to make a film score for such a high rated movie with such high standards for excellence? I love Leonardo DiCaprio, and hope he gets that Oscar.. and for his acting in this movie I believe he should receive it. However, this movie deserves no other recognition because of the terrible decisions made by whomever decided to hire such a terrible composer.",
      "total_reactions": 7,
      "user": "provenhumans"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "This is a great movie for masochists. Fairly early on you'll come to the realization that this is going be be a long, brutal slog. Beautifully shot and acted, The Revenant is certainly a good movie. Unfortunately, it just doesn't know when to move on. Our hero is pushed through one brutal encounter after another to the point that it begins to feel an awful lot like a torture fetish. There is an on-going side-plot that is of little relevance to the overall storyline, except for introducing just a little more brutality into what is already a violent world.",
      "total_reactions": 10,
      "user": "TheWaffle"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2016
      },
      "score": 4,
      "text": "Expectations have a lot to do with perceptions, and movies are no exception.  My expectations were high, based on Metacritic reviews and all the Golden Globe awards.  First the kudos: yes, a stunningly realistic performance by De Caprio.  He will probably win the Oscar.  But while physically challenging, his character wasn't deep nor difficult to portray.  And the bear attack: incredibly realistic.  If you watched the infamous bear attack in the German zoo, they learned well. But this 2.5 hour movie was 1 hour too long. The ending so very predictable from the outset, even though the real ending between Glass and Fitzpatrick was absolutely the opposite of what we saw: see Hugh Glass on Wikipedia. Finally, lovely scenery.  But, trust me, this movie was boring with a capital B.",
      "total_reactions": 6,
      "user": "brewster"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "The acting is very good in this film.  I will be surprised if DiCaprio does not win the Oscar this time. The supporting performances are all very good.  The cinematography is beautiful and, at times, breathtaking.  But this movie is far too long and self-indulgent and the end is terrible.  This movie is based on a true story that ended differently.  There was also an earlier version of this story that, while not as pretty as this film, was more consistent with the real story.  Iñárritu can apparently do wrong in the eyes of Hollywood.  But while I liked Amores Perros, 21 Grams and Babel, I thought Birdman had a dumb ending and the annoying artifact of the faux continuous shot was pretentious.  The Revenant, while beautiful and well acted (much like Birdman was well acted), is also pretentious and far too long.I know nobody in Hollywood is going to say it, but the emperor is wearing no clothes.",
      "total_reactions": 6,
      "user": "StevieGJD"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "A good action movie. Not a good movie for people who like big stories or something to read into. It's a 3 hour movie about crawling through snow, surviving the harsh conditions, and up close shots of bloody fights. The special effects are great, and Leonardo DiCaprio did a good job with his acting in this one. But like Avatar, go and watch this for the visuals, not the story. It's good mindless entertainment though.",
      "total_reactions": 6,
      "user": "Niceguy3210"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2016
      },
      "score": 4,
      "text": "This is one of those movies where you watch it and at the end you're like 'why does everyone like this movie?' The movie was too long and I mean the movie really didn't even need to be made. There are far better survival movies out there like the edge ect or better revenge movies like the count of monte cristo etc. The dialogue was hard to hear/understand for me from the loud background nature or just the mumbling hard accent of the soldiers. I mean over half of the movie is mute with just dicaprio trying to survive and it just was not interesting or entertaining. I gave the movie the benefit of the doubt becauese dicaprio is an amazing actor but this movie fell flat for me. If you really want to see it just wait for it to arrive on redbox because it is not worth wasting a night out on.",
      "total_reactions": 6,
      "user": "papadrew7"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "A mixed bag. Though The Revenant is an exceptionally well presented visual showpiece, it is also entirely nonsensical, ham-fistedly delivering its narrative, which like its protagonist's quest, is entirely devoid of any deep significance when it's through. This is mostly due to a disconnect in logical proceedings, which wouldn't be too big a deal if the film wasn't attempting a realistic portrayal of the world. From the moment of the bear attack all suspension of disbelief is totally gone, leaving you only to shake your head as Glass survives countless fatal situations, and crosses roads with so many people important to plots surrounding him purely by coincidence. Oh, it's because he's the best tracker that side of the country, now it all makes sense -- except for the part where he's been shredded to ribbons by a bear with only wet clothes on his back and in the forty below nights of the frontier. While the visuals and soundtrack accompanying the dream sequences were some of the highlights of the movie, I felt they became a bit heavy handed, adding different visual themes without any real substance. Some leaps in logic cast doubt over the final events of the movie, which really sticks out over whatever symbolism the filmmakers were trying to achieve with those scenes. Without spoiling anything, I will say that the climax of the film is well executed, which is good since it was the only really big payoff to look forward to. As good as it looks, it's never as immersive or as symbolic as it wants to be with its cliched and nonsensical plot, as well as few noteworthy performances. Special commendations go to Tom Hardy, who excellently portrays the only well established character in the entire film. His character is the only one I found to have inspired any curiosity, and that's a shame since he's the villain. Some great visuals aside, it's a miserable experience that strains your senses (particularly your ability to hear what characters are saying - my experience seemed to have a very poor sound mix with muffled, mumbling voices).",
      "total_reactions": 6,
      "user": "Doktor_Vehicl3"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "It was compelling but not inspiring. Made you appreciate modern conveniences of civilization but I'm not sure if t represents amazing acting by DiCaprio just because his character was torn up so much. There is rage, plenty of agony and pain, but it's not as if he actually endured it. The best performance is by Tom Hardy who I couldn't tell was playing the role until they ran the credits at the end. I was amazed that this actor could transform himself with a heavy southern accent and acting that truly made you hate him. I had seen him play a young Patrick Stewart in a Star Trek movie and couldn't believe this was the same person in this movie. Totally believable as a redneck with a southern twang, when in reality he is English with a heavy English accent. Few actors amaze me like that. Hardy deserves his Oscar nomination and deserves to win, but they'll probably give it to Stallone for sentimental reasons.",
      "total_reactions": 6,
      "user": "CandyVA"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "The Revenant is an incredible cinematic journey that really encapsulates you in the insolation and savagery of wilderness, and promotes an endearing message that does not preach itself too heavily.",
      "total_reactions": 3,
      "user": "oDjento"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "Unlikely the complexity in his previous masterpiece Birdman, Iñárritu has approached a straightforward story without much dialogues but enriched with metaphors about vengeance and redemption. It is an unresistant hypnotic drama that combines revenge, survival, violence and desperation intensely that would certainly chill audiences both physically and mentally. Each and every single detail of the film is taken care perfectly, death and evilness of the characters are well captured with beauty and horror thanks to the cinematography by Emmanuel Lubezki, the setting of the stranded nature background and the powerful orchestral scores add on the sombre effects which all contribute to the impressive technical aspects of the cinematic experience. Leonardo DiCaprio amazes again with his brutal and anchoring performance struggling to survive while the commitment between him and Tom Hardy into their respective roles have successfully turned the director's artistic visions into an immersive life of death journey. Although it seems to be a strange film with striking images of blood soaking ground, animals and humans, it is an inspiring wild expedition about humanity and inhumanity that is elegant in its own simplicity.",
      "total_reactions": 3,
      "user": "michael1208"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "The Revenant is very long movie but has an incredible scenery. The plot is a little weak and the characters are fully developed but LD does a good job acting.",
      "total_reactions": 3,
      "user": "DanielwWhite"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "Predictable and too many leaks in the Script!.",
      "total_reactions": 3,
      "user": "gerardoguerra"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "An absolute masterpiece. I admit some bias in my rating because I love wilderness survival, and this film's era greatly appeals to me.",
      "total_reactions": 3,
      "user": "mikethejust"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2016
      },
      "score": 10,
      "text": "The Revenant’s story is simple. a man is attacked by  grizzly bear  and left for dead by his greedy team of fur trappers who have been promised money if they stand vigil with his mangled body until he (supposedly) dies. They leave him to a fate that seems inevitable, so when against all odds he lives he must then avenge the death of someone he loved, murdered by those who abandoned him.. That’s the basic story but The Revenant is more than that .",
      "total_reactions": 3,
      "user": "ramreg"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2016
      },
      "score": 10,
      "text": "Genialny film. Realistyczny, naturalny i surowy. Świetne krajobrazy i klimat. Gra aktorska na wysokim poziomie. Serdecznie polecam. Koniecznie do kina.",
      "total_reactions": 3,
      "user": "meta_king"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2016
      },
      "score": 4,
      "text": "The most overrated film of the year.  Slow, overlong, lifeless--except when Tom Hardy is on the screen, and then it's electric.  About halfway through, I wondered why I was supposed to care about this guy, beside the lightly-handled (and beautifully shot) annihilation of the native village he lived (?) in with his very pretty (in white man's terms) wife at some point, and his, frankly, weird relationship with his son--I felt no love between them at all, didn't believe they were even related.  I guess because his family was murdered we're supposed to immediately feel for him.  Except that familial relationship was never established, simply hinted at in dreams and visions, and when he barked at his son to shut up.",
      "total_reactions": 11,
      "user": "hdbfly"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2016
      },
      "score": 1,
      "text": "I really didn't like this movie. And I seriously considered walking out of the theatre. A beautiful landscape cannot make up for no storyline whatsoever, undeveloped characters and an emotionally manipulative plot. The critics will go nuts for it because it's 'arty' but really this is a waste of a movie.",
      "total_reactions": 11,
      "user": "TgExpress"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "Beautifully shot film, showing the harshness of the freezing environment and the struggle for man to survive and attempt to make a living.",
      "total_reactions": 8,
      "user": "YorkMan"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "The movie filmed well! The cinematography was breathtaking, And the story message is good ( that revenge makes you stronger and whatsoever) but the plot was so bad, it was really boring and some sense there was nothing to watch! the movie it's just too long with no reason.. Feel like it was only to show off Leonardo di caprio for trying to win the Oscar! Loved Tom hardy though he was dope! Overall they just needed a good screenplay!",
      "total_reactions": 8,
      "user": "Osamamah"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "\"The Revenant\" stars Leonardo DiCaprio and Tom Hardy in this \"based in part on a true story\" of mountaineer Hugh Glass and his fight for survival in the South Dakota wilderness after an almost fatal encounter with a bear.  The film was directed by Alejandro Gonzalez Innarritu  (\"Birdman\") who, with Mark L. Smith,  co-wrote the screenplay based on the novel by Michael Punke. Although shot in Canada and Argentina, the film attempts to depict the challenges of a South Dakota winter n 1823. The word \"revenant\" is derived from the French word \"revenir\" (i.e. to return) and literally means the return of the spirit from the dead. This is the plight of Mr. DiCaprio’s character as he struggles across the barren icy wasteland for over 2 and ½ hours of viewing time. The audience also feels his pain and anguish since it too has to suffer through this ordeal as it is forced to endure a tedious and overlong excursion through the cold and unforgiving wilderness. The difference of course is that Mr. DiCaprio was paid for his suffering while the audience was not. Mr. DiCaprio’s character is enmeshed in a thin story line and basically has a non-verbal role as the script requires him to do a great amount of crawling and some groaning but, unfortunately, these do not necessarily rise to the level of great entertainment.",
      "total_reactions": 10,
      "user": "BHBarry"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2016
      },
      "score": 4,
      "text": "Tedious, well-acted, interminable, beautifully filmed, failure as a story. I came in with high expectations. Problem is, there's no real story here and no character development. No character changes from their initial depiction in the story. It is beautifully filmed, and both DiCaprio and Hardy are excellent. But I was bored by this story. I can see why this movie is getting the art-house Oscar buzz, but I think you can have artistic elements and still have a well-paced story with actual development in the story line.",
      "total_reactions": 10,
      "user": "TomHug"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "Mad Max: Oregon Trail",
      "total_reactions": 10,
      "user": "WiscoJoe"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2016
      },
      "score": 3,
      "text": "This movie has beautiful landscapes and effects. It is clear that a lot of effort was put in it. Also, I have no problems with DiCaprio's acting, but the movie's writing and execution was everything that can be wrong. Suspension of disbelief is challenged as the protagonist survives what should be impossible. Ridiculous scenes that will make you laugh are all over the place, just as purposeless  violence. This movie has zero creativity put on it. Again, DiCaprio wasn't the problem here, but he was a victim of a poorly written movie. No matter how good the actors were, the story was so bad and cliche I simply couldn't stop thinking how I don't care what happens to these people.",
      "total_reactions": 5,
      "user": "Sorriso"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2016
      },
      "score": 10,
      "text": "MASSIVE SPOILERS!!! I'm a bit shocked how people criticize this movie just because of some \"unbelievable\" scenes. Why don't you just accept the fact that some people (especially back then) where a lot stronger, immune and natural. Also, the idea of revenge kept him alive for his last mission! It's not very often when i give 10/10, but let me tell you why i'm doing it! This is one of the greatest movies about surviving and revenge! Fitzgerald killed his son, so he killed him! He killed the Grizzly mother, so nature took him (the final breath on the end)! I believe this movie is a true masterpiece and Leo should finally win his Oscar!",
      "total_reactions": 5,
      "user": "SEROJ"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "Beautiful- gripping at times, and then-nothing albeit predictable.  There was so much expert craft in the first half of the film, did the crew get tired?  The mystery and symbolism that was at first intriguing, became so repetitive, that it became almost annoying.  I really wished they would have followed through.",
      "total_reactions": 5,
      "user": "Ggodard"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2016
      },
      "score": 3,
      "text": "The Revenant's story is flat and difficult to accept as realistic or mythic. It may be magic realism but that doesn't make this particular story an effective narrative- its strengths lie in the visual trip it takes you on. However, what story it does have ruins that visual trip, unlike in the best works of Malick or Tarkovsky, where the natural imagery and the dreaminess better compliment the narrative, and vice-versa.",
      "total_reactions": 24,
      "user": "Mike_M"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2016
      },
      "score": 3,
      "text": "A pointless drawn out exercise in continual extreme violence.",
      "total_reactions": 21,
      "user": "NikolayG"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "This movie was just great! From the start to the finish. The more I see of DiCaprio and Tom Hardy the more I fall in love with them. Angelina Jolie, take a look at how a movie is REALLY made!!",
      "total_reactions": 7,
      "user": "crow4eva"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "The Revenant performed in ways I couldn't imagine,it was well paced for the most part, the story drove me to the edge of my seat,and it processed amazing scenery. I felt that the film had great character development as  well, like I felt like I was really attached to Leos character. we see him fight off bears and survive countless times in situations that would definitely kill a normal human being. That was a downpoint of the film because the bear attack would have paralyzed Leos character for sure, let alone him being able to walk,crawl,swim,or basic activities a person has to do to survive. I overlooked this mistake though since it was when the main plot was introduced into the story, that this might be one of my favorite films  of 2016 so far. Leos son gets murdered by Tom Hardy's character(Fitzgerald), and throughout the film,DiCaprio, struggles to survive but is influenced by revenge that he pushes through. The only thing about this movie is that it was really great film, but its defiantly a one time watch and a MUST SEE.",
      "total_reactions": 7,
      "user": "TheWhoDoctor"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2015
      },
      "score": 3,
      "text": "Dreary & dull, best part is the bear, i'll say no more in way of spoilers but found myself looking at the clock after the first 30 minutes, would not recommend",
      "total_reactions": 18,
      "user": "shoulderoforion"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "First and foremost, it's great to see Native Americans in a film again.  Not sure why we only see Native Americans in period pieces, but I'll take it.  The soundtrack for this film is exemplary.  Music and sounds that enhance the movie experience rather than detract from it like most movies.  The cinematography is breathtaking.  The acting is great throughout and DiCaprio might even be upstaged by Tom Hardy's excellent portrayal.  Although I've never witnessed an actual bear attack, this one looked realistic enough to make it very uncomfortable to watch.  The battles also looked realistic.  There are a few things in the film that didn't work for me, especially the posse at the end composed of only two people going after the bad guy, and whether or not someone could actually survive the freezing cold in his condition, but overall I enjoyed the film.",
      "total_reactions": 9,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "While I certainly admired it (greatly, oh so greatly) on a technical level--I just can't quite recommend it unless you're a film geek who wants to admire a director and cinematographer shooting a film using only natural light sources. That must have been a nightmare to pull off. On a screenplay level, this film just doesn't work. Sitting through this slog made me long for the fun filled times of Schindler's List. Oy vey. Leo will probably get an Oscar nod for being miserable for 2 hours. He should share it with everyone who sits through the entire exhausting thing. 5/10",
      "total_reactions": 13,
      "user": "Prosmooth"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2016
      },
      "score": 3,
      "text": "When I saw the previews a month ago I really wanted to see this movie.   I saw it pretty much opening day (Friday jan 8).   The first 30minutes were good... the next 2hours was boring as hell.  So many scenes were so fake.  The movie ending was predictable.   I went with some family members and they said that its the last time I get to pick the movie.   I heard Leo suffered a lot during the making of the movie.  I suffered more sitting through it.",
      "total_reactions": 19,
      "user": "TSTINKERS"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2016
      },
      "score": 3,
      "text": "Thirty minutes and two shock and awe moments into the Revenant I am out of it. Maybe because having the “leads” in “do or die” situations is meaningless or the abundance of cuts to icy rapids and tall timbers is surprising from the man who shot “Birdman”. Ironically, it left me cold.  Granted, production values are good - performances good - and for a re-enactment trimming sixty minutes might have been better.",
      "total_reactions": 19,
      "user": "hotfromcauldron"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2016
      },
      "score": 3,
      "text": "This is a trash movie for trash people. It's basically the Grey set in the past. I literally fell asleep for a few seconds before someone woke me up. The only Oscar this movie is worthy of is \"Only movie to have 90% of the audio be Leonardo DiCaprio breathing. Oh, and what a HORRIBLE choice of actor! \"Oh hey, we need a rough survival man who makes it against all odds and actually ignores wounds that would get infections that would kill him dead without antibiotics\" \"Emma Watson isn't answering her phone\" \"Oh get Leonardo DiCaprio then\" this movie was so boring and so shallow when it seemed like it would end but kept going I actually groaned. So predictable and so fake. Oh, look at us, look at all the blood and emotionless deaths we're so deep and realistic and Oscar worthy! (Meaningless Spoiler)Oh wow, I was NOT expecting that the good guy would catch the bad guy! What a twist! Oh, and they had a knife fight when both their guns were knocked away, what an original and exciting idea!",
      "total_reactions": 19,
      "user": "olkowaty"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2016
      },
      "score": 0,
      "text": "Boring, long and most obnoxiously pointless. I could have lived without seeing this story. I don't feel like it needed to be made.. which is the sign of a terrible movie i guess.",
      "total_reactions": 26,
      "user": "mboner1"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2016
      },
      "score": 1,
      "text": "It's really hard to enjoy a movie that is slow to pick up, but it's even harder to enjoy a movie when there's almost no dialogue. The Revenant is both loved by critics and fans alike, but to me, The Revenant was a 3 hour waste of time that I'll never get back.",
      "total_reactions": 26,
      "user": "TheKavehJ"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "A snooze fest.",
      "total_reactions": 18,
      "user": "Wolf3000"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2016
      },
      "score": 1,
      "text": "This film is very much over rated.  It is violent over and over and over.  It is painful to watch people being slaughtered, listening to gross language, very boring story,  just an ugly film.  If you are a member of ISIS or a wanna be, this film is for you!",
      "total_reactions": 16,
      "user": "boland7214"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2016
      },
      "score": 0,
      "text": "It is beautifully  shot without a doubt. However, No Character development, no story development.All character were written black and white and all the sub plots were underdeveloped.  they should should have written a proper screen play instead of wasting time with gruesome scenes.",
      "total_reactions": 10,
      "user": "obenbenol1988"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "Like watching a rehash of bear grylls survival guides on discovery. Sad and boring movie for me, and this is dragging on through the whole movie. Nature shots are amazing.",
      "total_reactions": 8,
      "user": "Zlatan"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2016
      },
      "score": 1,
      "text": "Does a spectacular view make a good film? Oh no, a film good needs great character and an interesting story.however the revenant has a thing story that is stretched to almost 3 hrs with gruesome details. Th revenant is a technical show off ,not a great film",
      "total_reactions": 8,
      "user": "Pelen23"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "Gripping, visceral, brutally violent, unforgiving realism.  As expected DiCaprio is superb as is Tom Hardy.  Leo's performance is as great and Oscar worthy as his last in the other end of the spectrum urbane \"The Wolf of Wall Street\" (I rate 10 and best of 2013), and the best scene in that movie had him crawling along the ground which I thought was good practice for all his crawling on the ground in this.  As for Hardy, I've seen him in half a dozen major movies now and I still do not know what he really looks like, what he really sounds like or who the hell he really is!  Talk about a chameleon.",
      "total_reactions": 6,
      "user": "AxeT"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2016
      },
      "score": 4,
      "text": "The Revenant - Review (no spoilers)",
      "total_reactions": 6,
      "user": "shravbhara"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "Unbelievably gripping tale of survival, betrayal and ingenuity. The violence managed to be both disturbing and completely natural at the same time. One of the few movies that can pull off more than 150 minutes without even seeming long.",
      "total_reactions": 4,
      "user": "dinojay2"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2016
      },
      "score": 3,
      "text": "I don't understand all the hype for this movie. The plot in this movie is horrible, and so does the ending. There isn't any character development to be seen. And well, DiCaprio does a fantastic acting for this movie, but the movie itself isn't worth it.",
      "total_reactions": 4,
      "user": "xacaco"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "The shots and direction are amazing, the plot is thin, DiCaprio's performance is great, many of the trials Glass goes through seem a little contrived to one-up the last thing he survived, but overall I still liked The Revenant. Worth seeing in the theater for sure.",
      "total_reactions": 2,
      "user": "podunk411"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "It's just not very clever. It's a linear story that comes to believable conclusions. DiCaprio is good in the movie. He plays a battered and soul-dead survivor who rarely speaks. It's a lot of grunts and scowls. Doesn't really have the dimension. It's not his fault. He does his best with the material, but outside of the shocking violence, what is really moving you about this film? Not much.",
      "total_reactions": 2,
      "user": "Scraper"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2016
      },
      "score": 2,
      "text": "*Minimal spoilers follow*",
      "total_reactions": 2,
      "user": "nosecohn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2016
      },
      "score": 10,
      "text": "OUTSTANDING, VISUALLY SUPERB, POWERFULLY ACTED - MASTERPIECE FILM",
      "total_reactions": 2,
      "user": "joyal"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2016
      },
      "score": 9,
      "text": "Absolutely fantastic. One of the few movies I've watched in recent times that got me fully immersed. Very realistic too, with uninterruptive and amazing acting, especially, of course, from the Wolf of Wall Street himself. Kudos!",
      "total_reactions": 2,
      "user": "chidime"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2016
      },
      "score": 3,
      "text": "While this film is well shot that's about all I can praise this extremely long winded and boring film for. While the opening was interesting, and the first half-hour gave us an incredibly visceral war scene that is frankly a piece of art in and of itself; the rest of the film was just torture-porn of the worst kind. Leonardo DiCaprio did a good job here but that's not enough to save this film. The films plot can be summarised as, \"nature beats up Leonardo DiCaprio for two hours while he's near death after he gets mauled by an unrealistic looking CGI bear\". This is pretty much the only key event in the film and the rest is just a long drawn out torture scene as we watch poor Leo grimace and strain at the camera for hours. It's almost painful to watch and not because you're sympathising with the character, but because you're not interested in watching someone languish in pain for yet another run-on scene. Honestly, I would question the emotional stability of those who enjoy this, as I feel it would take some pretty entrenched sadism to get pleasure out of watching this.",
      "total_reactions": 2,
      "user": "TornadoCreator"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2016
      },
      "score": 9,
      "text": "The Revenant is an unflinching, brutal, hard to watch at times thriller with great performances, breathtaking cinematography, all with natural lighting, and an exhilarating story on revenge. It's a phenomenal movie that finally got Leo his Oscar. Took him long enough!",
      "total_reactions": 2,
      "user": "WheelzFourReelz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "The cinematography of this film was wonderful. The performances were excellent and had me feeling like I was truly watching a life and death struggle in a different time. I was especially enthralled whenever the Indians were involved, their dress and makeup was exactly how I have always imagined them look. There was little joy in this film and it presented me with a constant feeling of uneasiness. I loved it. Leo was especially excellent and his performance is one I will not forget. I did feel at times it was hard to understand what was being said but that may have been the audio in the cinema.",
      "total_reactions": 2,
      "user": "RudigerX"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2016
      },
      "score": 10,
      "text": "I was speechless after seeing this movie, it blew me away. Alejandro González Iñárritu has proved that he is not a one hit wonder with this movie. The cinematography is the best I’ve seen all year with great single shots instead of cutting scenes. The natural lightning used in the movie was just beautiful to look at and made the movie viewing experience great. Leonardo DiCaprio‘s performance in this movie hands down the best performance of the year and his career. If he doesn’t win the Oscar then no one will. The other performances were great. I was really fascinated with the gore aspect of this movie it felt more realistic than any other R-rated movie. The score of the movie is brilliant. The only issue I have with the movie was that it’s a slow paced movie and I’d have loved to see more of Hugh Glass’ backstory.",
      "total_reactions": 2,
      "user": "FarhanFiroz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2016
      },
      "score": 9,
      "text": "The cinematography and the compelling performances by Leonardo DiCaprio and Tom Hardy, in particular, make this a must see movie. The believable and simple storyline coupled with great character acting and cinematography that gives you feel of being truly in the action, sweeping scenery and limited but to the point dialogue, makes this an uncluttered movie experience.",
      "total_reactions": 2,
      "user": "AlignmentGS"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2016
      },
      "score": 9,
      "text": "After watching this film on the big screen, my second time overall, I was still in awe of this beautiful looking film. It's SO GORGEOUS, sure the film has it's other strong suits but the direction (Inarittu) and cinematography (Lubezki), two categories it won Oscars in, is so overwhelming I couldn't understand why a certain section of the audience did not find this a good watch. It is a very old school film it has this strong 70's vibe where the story is not told and is left for you to figure out. I watched this with a friend who did not enjoy this as much and suggested that the movie would have been better if DiCaprio's character Hugh Glass narrated in the film and spelled out his ordeals to the audience. I called my friend a pleb because I am a high and mighty jerk like that but on a serious note while a narration would have helped with the casual audience, it would also promote spoon feeding hand holding which has become the norm of today's films. The performances were great and a movie like this falls apart if the performances are not good they are the only thing connecting the audience to the film. Well deserved Oscar for DiCaprio, arguably career best performance from him, Tom Hardy was great too shame no Oscar though, some scenes were so intense I could feel it taking a mental toll on me of which the bear mauling scene was on the forefront. Overall a very visceral movie which used only natural light while filming and will stand the test of time, something which this year's winner Spotlight cannot claim.",
      "total_reactions": 2,
      "user": "Prashun"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2016
      },
      "score": 9,
      "text": "Wow... this movie provided spectacular scenes. It was very well done from almost every aspect of its creation. The viewer is given a look at life during the early 1800's ...survival at its core. I personally walked out towards the end of the movie (the violence actually got to me) ...but I felt the movie was beautiful in so many other ways. The acting, the cinematography (many of the onscreen visuals were amazing) ...all in all ...this a great movie (with a great actor... Leonardo put's himself into his characters). Bravo.",
      "total_reactions": 2,
      "user": "CaliColorado"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2016
      },
      "score": 10,
      "text": "If DiCaprio doesnt win oscar from this film then he will never win. Great movie and great acting. I really liked the story it was interesting and good.",
      "total_reactions": 2,
      "user": "Lepstrung"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "I really liked the movie, the shots were amazing, it looked like a LoTR production. In my opinion, the action was too slow paced, but it surely was a really good movie. It's a pretty long movie 2h 36 minutes so yeah, with a slow paced action, at the 2 hours mark, it started to get a little bit boring and I got tired.",
      "total_reactions": 2,
      "user": "JSkellington"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2016
      },
      "score": 2,
      "text": "I feel the movie is really overrated. The story is nothing new, you have seen this story probably a million times:",
      "total_reactions": 2,
      "user": "Valdio"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "Having not watched many films, I was hesitant to see this one purely because of the length. Leo is always spot on with his roles and did not disappoint this novice movie-goer. Lasting impressions from this movie were great purely because the entire story was contained in the film and there weren't any loose ends to think about while leaving the theaters.  Would I recommend this to another? Yes. There were a few parts that lost my attention, but there were also equally as many parts of the movie that I would like to see again to make sure I didn't miss anything.",
      "total_reactions": 2,
      "user": "mcgolf12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2016
      },
      "score": 2,
      "text": "A video game played by Di Caprio with real actors and settings.  Begin game with massacre. Dodge enough arrows and buillets to reach the boat.  Set off down river.   Clever moves are rewarded (escape down freezing river but of course no hypothermia, this is a game not the real world) mistakes mean you have to acquire major wounds and injuries.  Gain points with boosters (e.g. catch a fish, eat half, gain enough power to climb a mountain with symphonic backing)",
      "total_reactions": 2,
      "user": "Bellbird"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "Great movie! Thoroughly enjoyed the plot, setting and an outstanding performance by DiCaprio...However, I was a little disappointed with the ending but besides that the movie was a well-polished gripping movie.",
      "total_reactions": 2,
      "user": "skc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2016
      },
      "score": 6,
      "text": "Note: reasonable spoiler, not much you won't know if you've seen the trailer.",
      "total_reactions": 2,
      "user": "that_bear"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2016
      },
      "score": 10,
      "text": "This is literally my most favorite movie in existence. There is an argument on weather or not this man actually went through all of these trials. I personally believe it was very possible that he did. The will of the human spirit is never understood. Either way I really don't care because the movie itself is incredible.",
      "total_reactions": 2,
      "user": "220DropTine"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2016
      },
      "score": 2,
      "text": "Completely unbelievable after the bear mauling. And I was rooting for the bear. For an experienced woodsman the idea that he doesn't VERY quickly understand that seeing unattended bear cubs is a very bad thing and that he should depart immediately also lacks credibility. Shooting the bear after the first mauling is incredibly stupid as well. Even that doesn't strain credibility as much as the repeated immersions in icy water which he somehow survives or his amazing ability to keep his head out of water while wrapped in sodden clothing and bearskin. I've done winter camping and I just don't buy it - get that wet and particularly in that state of injury and you're toast - or ice cubes really. Then it's just one cliche' and deus ex machina after another. Is there ANY survival cliche' that's not thrown in here? Miraculous buffalo and a miraculous Indian. Miraculous rescued native maiden who will ALMOST keep him for sartin' death later. A mumbling evil Texan. A wide eyed boy. And the acting ... the Oscar was most definitely a career Oscar. Let's not forget the cinematography which is in love with itself to the point of pain. How many shots up through the trees with sighing wind can you take? My limit is considerably less than I got here. The splitting open of the horse to stay warm - followed by the dressing in clothing that has to be either frozen or sodden depending on how much of a thaw we're supposed to believe that really is. This guy has to have an interior nuclear reactor to thaw himself out again. Yes, after the bear mauling I became increasingly bored and angry. One of the longest and most disappointing experiences I've had in some time.",
      "total_reactions": 2,
      "user": "fatburger"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2016
      },
      "score": 9,
      "text": "Leonardo DiCaprio stars as a man struggling to survive in the wild in Alejandro G. Inarritu's bloody, bruising frontier epic.",
      "total_reactions": 2,
      "user": "MovieMasterEddy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2016
      },
      "score": 9,
      "text": "Revenga! Leo's acting here is demanding of an Oscar, not to take any credit away from Tom Hardy either. The camera views were top notch and a storyline to keep you at the edge of your seat throughout. One of if not the best film of 2015. I'll be waiting to purchase this film the day it releases on blu-ray.",
      "total_reactions": 2,
      "user": "CaseyBartels"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2016
      },
      "score": 10,
      "text": "'The Revenant\" is an utter triumph of both filmmaking and the human spirit. Leonardo DiCaprio and Tom Hardy are electrifying. The cinematography by Chivo is stunning and chilling. This is Alejandro G. Inarritu's best film, and the best film of the decade.",
      "total_reactions": 2,
      "user": "InglouriousAndy"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "I never understood some critics, they give a positive rating to Star War Force awakens, although it was so bad, it could be a simple tv movie, only the users gave it what it deserves a negative rating, but for the Masterpiece The Revenant the users are the only people who rated it positive while the critics not... really something is wrong here. This is a Masterpiece of Cinema, so such Movie i didnt see since Interstellar...",
      "total_reactions": 17,
      "user": "TinoTrivino"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "Just watched The Revenant; good performance by Leonardo di Caprio but who the hell cast Amersmiff boy Tom Hardy as a Texan Fur Trapper? Absolutely terrible ham acting with a ludicrous incomprehensible accent, a real disappointment after \"Legend\". It's directed by the Mexican fellow who did \"Birdman\" last year, obviously the latest flavour in Hollywood but like Birdman it's not very good.",
      "total_reactions": 15,
      "user": "royphishooh"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2016
      },
      "score": 2,
      "text": "It's brutal... long and boring. Leo's worst movie since \"Man with the Iron Mask.\" The effects don't blend in with how the film is shown. I would say go see Star Wars instead. The characters are so fake in this movie it will make you vomit. 2 out of 35 people disliked my Star Wars review so do you think I care what happens with this one? All you are is another cog on my review -- you can't comment and you mean nothing. Enjoy the rating this movie receives from me.",
      "total_reactions": 15,
      "user": "vgmkyle"
    },
    {
      "neg_reactions": 17,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2015
      },
      "score": 0,
      "text": "overlong...overacting.....over direction....only cinematography is breathtaking....plot lines(that arent in novel) seems heavily oscar bait. Lead actor seems to supernatural as recovery duration is unnatural",
      "total_reactions": 31,
      "user": "sun20890"
    },
    {
      "neg_reactions": 15,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2016
      },
      "score": 1,
      "text": "Truly one of the most boring movies I've ever seen. About ten minutes of plot surrounded by two and a half hours of needless flashbacks and useless shots of scenery. Beautiful scenery, sure, but so little happens that even the non-boring parts become boring. The film doesn't get to what we are trying to accomplish until an hour and a half in. Thoroughly unwatchable, you just can't make movies this way.",
      "total_reactions": 27,
      "user": "penfifteen"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "One of the most engrossing, riveting cinematic experiences I've ever witnessed, this film is an absolute wonder to bask in for 2 and a half hours. The cinematography, acting, sets, characters, and atmosphere feel so immersive that I think this movie should really leave its mark in movie history, it really feels like there is so much it does that pushes the art of cinema forward. The story is simple and straightforward, but its all about the incredible journey you take, not the destination.",
      "total_reactions": 18,
      "user": "Cogentleman"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2016
      },
      "score": 1,
      "text": "This was nothing more then Jeremiah Johnson on steroids and l really liked Jeremiah Johnson. I found the Revenant to be way over done on cliche,s but i did enjoy seeing the french joining in on the carnage by  hanging the Indian. You American writers are taking a big chance messing with our French.  Please,please don't make a sequel.",
      "total_reactions": 9,
      "user": "C10Rules"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "The first hour of the revenant is very good with one of the best scenes in a movie this year but by the second hour it becomes a drag. Great cinematography and strong performance by Dicaprio help push the film for its nearly 3 hour length.",
      "total_reactions": 23,
      "user": "csw12"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "Beautiful. Gritty. Brutal. Gripping. I couldn't take my eyes off this movie. All the hellish conditions undergone by the cast and crew while shooting in sequential order and using only natural lighting really paid off with one of the most harrowing cinematic experiences ever (as far as I'm concerned). Though some of the wide-angle shots remind you that you're watching a film, the emphasis on realism is absolutely transporting. Some of the best action scenes are shot entirely with one take as well which adds to their immediacy. The performances by DiCaprio and Hardy are top-notch and both truly disappear into their roles. Can't recommend this enough. Lubezki's cinematography... it must have been such hell getting some of those shots. This is Inarritu's best work by far, beating out the gimmicky \"Birdman\" and the visionary but depressing \"Babel\". A true gem of cinema and easily among the top 3 films of 2015. Go see it in the best theater possible!!",
      "total_reactions": 14,
      "user": "samichsupernova"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "Good solid entertainment.  Gritty, graphic, and lots of drama and emotion.  Not a perfect movie, but very well done!  Beautiful scenery, epic action, and some serious acting!",
      "total_reactions": 7,
      "user": "smsandifer"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "This is overall a great movie, worth checking out in the theaters, but is not without it's flaws.  The biggest positives are the amazing cinematography, and acting by Leo, Hardy and others.   Leo will probably get an Oscar for his performance.  There are several very memorable and moving scenes, particularly during the first 60 minutes.  The CGI bear scene was very well done.    Also, the movie has the \"feel\" of being historically accurate.",
      "total_reactions": 7,
      "user": "crsharpe2"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2016
      },
      "score": 2,
      "text": "BOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOORIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIiNG",
      "total_reactions": 24,
      "user": "LetMeInPlease"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "A beautifully filmed, technically proficient but decidedly bloated frontier tale that's thin on plot and character development and long on graphic violence. The fine performances by Leonardo DiCaprio, Dohmnall Gleeson and (especially) Tom Hardy help to paper over some of these shortcomings, but the film definitely would have benefited from some judicious editing, a tighter script and a little less directorial ego. As many critics have said, this is an easy film to admire but not one that's easy to like; I concur wholeheartedly.",
      "total_reactions": 12,
      "user": "Brent_Marchant"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "This was one of the best movies I have seen in years. Decaprio and Hardy put on superb performances in their respective roles. The story was captivating. The cinematography was sublime. My pick for best picture.",
      "total_reactions": 12,
      "user": "bghoffler"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "The story has a lot holes and predictable, but the film is saved by the incredible cinematography. I really enjoyed the long shots that showed the entire scene in one single shot, very unique and astonishing. DiCaprio was committed to his role but the faulty story is not strong enough to make him win an Oscar.",
      "total_reactions": 12,
      "user": "silverculture"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "Coming off the success of \"Birdman\", Alejandro Gonzalez Inarritu delivers with easily the most gritty film you will see this year. First off, this movie is incredibly gorgeous. From its beyond beautiful cinematography to its gorgeous locations, it's a real cinematic movie that traps you in this environment. The cast (particularly the two leads) is fantastic. Tom Hardy gives arguably the best performance of his career in my opinion. He's an antagonist with layers and even brought unpredictability to his character. But Leonardo DiCaprio, is what you go to see. Saying that he gives a great performance is an understatement. He is Hugh Glass. Not once did I think to myself that I'm watching Leo give a performance. He felt like a real person! Maybe it's not my favorite performance of his but it's beyond damn good to say the least. I loved that it was a revenge story and one that makes you clinch your fists during the big combat sequences. You feel the brutality! And you feel Hugh Glass wanting to seek his revenge. It even has really good pace for a two and a half hour long movie. I never got bored because there was always something at stake. I will say that the very end felt a little too ambiguous for its own good. Other than that, I believe you have a strong contender for best picture at the oscars. Overall, it's a brutally beautiful movie with grit and heart pounding intensity. I'm going to give \"The Revenant\" an A!",
      "total_reactions": 17,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 16,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 0,
      "text": "(May contain minor spoiler)",
      "total_reactions": 27,
      "user": "Brimsurfer"
    },
    {
      "neg_reactions": 15,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 2,
      "text": "- Miserable; Not Only The Character's Life But The Film Too -",
      "total_reactions": 25,
      "user": "Tone01"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2016
      },
      "score": 4,
      "text": "This movie was super boring. Dude needs an editor like mad. Good fight scene at the end though. Maybe don't show so much snow and trees. We get it, it's cold.",
      "total_reactions": 5,
      "user": "moothemagiccow"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2016
      },
      "score": 0,
      "text": "This was Dicaprio's worst effort getting an Oscar. Nothing more, but extremely focusing on disguasting and poitless",
      "total_reactions": 5,
      "user": "bohem"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "This movie should win a award. It was fantastic, one of the best movie's i've seen in awhile. It leaves you spell bound through out the movie, everyone i've to loves this movie.",
      "total_reactions": 18,
      "user": "killer_101796"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "Thank You director Alejandro G Inaritu. You made my two and a half hour, i mean entire life, utterly fulfilling,",
      "total_reactions": 13,
      "user": "Movie-Freak-KK"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "First and foremost, the cinematography in this movie is masterful, and it's one of the most beautiful pieces of Cinema I have ever seen. Thats honestly not even debatable, this movie is world class in the beauty department. Its hard to not enjoy a movie presented with such overwhelming views, the directing is wonderful as well and the unique ways of capturing tense scenes and using only natural lighting was a win. DiCaprio is solid, and his commitment to the role made the journey worthwhile. The story is simple enough, its not meant to be mindblowing or even clever, its just meant to be a journey. Its unrelenting and vicious. The bear scene in particular and the wounds close up after the fact is hard to watch, but its the realness of the actions/consequences that make it such a great piece of cinema, all the ingredients put together seamlessly throw you into the wild along with all the characters.",
      "total_reactions": 13,
      "user": "BloomMN"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "This movie is what is called a true 'Masterpiece' A great Movie for all Ages. Action,Drama,Thrill,Adventure This movie has it all.Tom Hardy's Performance,Great! Leo's Performance Even Better!. This is Like",
      "total_reactions": 13,
      "user": "MUIZZK"
    },
    {
      "neg_reactions": 15,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "A strong film. Gripping, relentless, beautiful. Themes explored provide substance and food for thought, and standout performances are both refreshing and uplifting. That said - it's heavy going.",
      "total_reactions": 24,
      "user": "Canisrah"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "Leonardo DiCaprio plays a hunter/tracker whose encounter with a bear is only the beginning of his struggle for survival in the frigid American northwest of the 1800s. This brutal journey is intensified by director Alejandro González Iñárritu’s masterful vision for capturing the harshness of nature and malevolence of men. Some of the sequences are technically astounding. Add to that the incredible scenery and immensely beautiful (mostly available light) cinematography by Emmanuel Lubezki. DiCaprio suffers with extreme commitment, but it’s the almost unrecognizable Tom Hardy, whose menacing villain is the acting standout. Even with the 3-hour running time, the intensity never slacks and the skillful storytelling creates a harshly compelling cinematic tour de force.",
      "total_reactions": 8,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "It can be difficult to show off your acting chops in a movie with minimal dialogue, but Leonardo DiCaprio reminds us that physical acting is an art onto itself, and gives a solid performance.   The lack of dialogue is also a nuanced plot device used to establish an unspoken maxim:  The bad guys talk more than the good guys.  Tom Hardy makes an excellent bad guy, but the dialogue he has been given (God as a squirrel) sometimes just doesn’t work very well, and maybe it’s for the best that there isn’t more of it.",
      "total_reactions": 8,
      "user": "Axgrinder"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "The Revenant reviewed",
      "total_reactions": 8,
      "user": "misadventurer"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "I honestly didn't think it was that good! The pace switched from slow to fast too much and then there was those weird dream sequences all of the time. I get it, he killed an American officer to protect his son, but if he is fighting for his life every day and his son has been killed by Hardy, why the **** would he keep dreaming about that one incident? It's just one of the many points that makes this film unrealistic, when that is exactly what it tries so hard to be(realistic).",
      "total_reactions": 8,
      "user": "AntoGrayo"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "\"My heart bleeds. But revenge is in the creator's hands\".",
      "total_reactions": 8,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "Already racking up wins and nominations on the awards circuit this year, it’s safe to say that ‘The Revenant’ is one of the best films of the last 12 months, another cinematic triumph for Mexican director Alejandro González Iñárritu’s and his team.",
      "total_reactions": 8,
      "user": "FilmPhonic"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2015
      },
      "score": 5,
      "text": "The first hour IS good,they still haven't mastered slower movement with animals with cgi though(Bear Attack),Caprio shouldn't be nominated for acting here because there is very little oppurtunities,he moan's & groan's,pull's faces and get's turned over every now and then and crawl's, but should get an award for putting his body through it,great cinema-photography though but wy too long....zzz",
      "total_reactions": 8,
      "user": "Robbor1"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "\"The Revenant is a good movie, but i had to high expectations, so in the end it was a little disappointing and never as good like Birdman. But give Leo this Oscar!!!\"",
      "total_reactions": 8,
      "user": "Nicoteen"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "Very good film all made great director and camera work especially well oktery Leonardo DiCaprio and Tom Hardy played their characters very well and I hope Leonardo DiCaprio get your Oscar",
      "total_reactions": 22,
      "user": "robert21"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "As an award-winning director of CG animation myself, the bear-mauling scene is worth the price of admission alone. Stunning work. And, while I have not always been a fan of Leonardo DiCaprio, he does put in a fine performance here. Tom Hardy captures the ambivalence of malice. His is a Shakespearian character writ in grit. To say that the film is gorgeous to look at does a disservice to the creators. Every frame is a painting. The unalloyed brutality that runs through the film reinforces the sense of the folly of man... very relevant to the time in which we now live.",
      "total_reactions": 11,
      "user": "RichardGonci"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "Wonderful. I found Leonardo Di Caprio simply outstanding. I don't know how is possible that he doesn't win the osar this year too. Maybe this year the academy'll reward a tree or the bear. Ahah. It's ridiculous. I think thjat this is a great Di Caprio's performance and the Inarritu's film is better than Birdman, full of pathos, moving and with a perfect photography. Simply the better film from a while.",
      "total_reactions": 11,
      "user": "Mulholland2603"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "Riveting from start to finish.  Cinematography to die for.  Leo completely wrong for the lead role but still nails it.  The acting, the story, the adventure.  Going to probably win all the rewards.",
      "total_reactions": 14,
      "user": "TheDavo"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "Leonardo is one of the best actors nowadays and this is another movie that proves it. The bear scene, for example, is a jewel of modern film making. Great movie, intense, dramatic, with superb photography and unique story.",
      "total_reactions": 14,
      "user": "Plutarco"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "This may be one of the most beautifully shot films I've ever seen. The way the camera follows different characters and reveals things was done very well, and made all of the action sequences that much more exciting. The shots of nature are gorgeous and the indigenous imagery works very well. Highly entertaining film, although the plot is rather simplistic and the ending was weaker than I had hoped.",
      "total_reactions": 14,
      "user": "Nathonas"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "This film is good at whatever it is going for. Very strong depiction of man vs man and man vs nature. Revenge aspect of the movie is underdeveloped and could have been avoided to make the beginning more attention grabbing and ending more related.",
      "total_reactions": 17,
      "user": "Gurolge"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "One of the best films of 2015 and the BEST film Sir Inarritu has accomplished! The film displayed in a very conceivable way the events that happened in the tragedy of Hugh Glass. Sir Lubezki, the cinematographer, did it again with the use of natural light and very snappy camera techniques. The acting duo of DiCaprio and Hardy did a great job on portraying the real life characters.",
      "total_reactions": 15,
      "user": "mcblancaflor"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "**** Just go see this movie. Seriously. Dont miss this one on the big screen. It's almost all shot on a wide 18mm lens, you want to see this on the big screen.",
      "total_reactions": 12,
      "user": "Championaaron"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "Loosely based on the life of 19th century frontiersman Hugh Glass, The Revenant is a brutal yet visually stunning western with one of Leonardo DiCaprio's best performances yet. The film follows Glass after he is mauled by a bear and left for dead by his fellow fur traders. One of the frontiersmen, John Fitzgerald, kills his son, and Glass voyages over 200 miles to exact revenge on him. The Revenant is one of the most violent movies I've seen from 2015, although the incredible scenery and cinematography also make it one of the most astonishing movies to look at. It combines some intense, difficult-to-watch scenes with amazing scenery which makes it one of the most beautiful violent films I've seen. Leo's committed and demanding performance is certainly one of the best of his career especially because of the lack of the dialog in the film. The 156-minute running time, relentless brutality and limited dialog does take a bit of a commitment to finish, but The Revenant is a masterfully directed film that makes the most of its subject matter's intriguing story.",
      "total_reactions": 9,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "The Revenant is the second film in row from Director Alejandro González Iñárritu to be nominated for best picture after Birdman (which won) and had some outstanding cinematography, action scenes production designs and performances but it was rather lacking in it’s story and could have been slightly better plus I think it will have limited lifespan on TV screens.",
      "total_reactions": 9,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "The first 20 minutes of this film is incredibly intense, with amazing visuals, fantastic sound and brutal violence. The acting here is near perfect as is the directing. Alejandro González Iñárritu has taken the amazing performances of the actors involved which, of course, include Leonardo DiCaprio and Tom Hardy (and a whole list of supporting actors, who all turn in award calibre performances, especially Forrest Goodluck, who plays DiCaprio's half breed son), and molded the film into a near masterpiece of cinematic art. For me, what keeps this movie from having a perfect 5 stars is that it drags on a bit in the middle. Is this one of DeCaprio's greatest performances? I think so. I'll be very surprised if he doesn't finally take home an Oscar.",
      "total_reactions": 6,
      "user": "WJS"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "This isn't the best film of the year but it sure is one of the best performances given by Leonardo Dicaprio. He proves that he can play any character, no matter where. The Revenant is intensely fun, filled with lots of action. I will say this, I'm not rooting for this movie to win an Academy Award, But I do want Leo to win his first Oscar for his performance since it's unforgettable. Great film to add in my collection. It's kept in my shelf but not in my list.",
      "total_reactions": 6,
      "user": "DavidV293"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2016
      },
      "score": 4,
      "text": "Do not understand the hype.  Too long.  Cinematography was award winning.  DiCaprio is ok but Hardy is a much better actor and it shows through out this movie. Big Hollywood movie with big Hollywood actors and big Hollywood hype.  Don't waste your money",
      "total_reactions": 6,
      "user": "mjmcggolf"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "Revenant delivers but at times feels like a lengthy posturing on the part of Leo and director Inarritu. Leo is excellent in his role. Tom Hardy is unrecognizable. Certainly worth checking out.",
      "total_reactions": 6,
      "user": "therealjayemcee"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "Acting shooting and the music already deserved a oscar .Especially Tom Hardy done very well i think one of the best actings in movie history and Di Caprio was okey he had better performances but still deserves a oscar and i really like the shooting where we were feeling the movie with good shooting thats a really huge advantage but but theres still logical faults like leo broked his foot but it just healed 2 days after thats nearly imposibble and how the hell he didint get sick ? he swim in a very cold water and the weather was snowy and cold .in short movie was really good worth to watch for tom hardy",
      "total_reactions": 6,
      "user": "manwithcheese"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "The Revenant is the second movie of Inarritu’s new groove, nothing like his previous films. As in Birdman, here he experiments with shooting and cinematography; which are one of the few things that goes well in this picture. The camera is placed precisely in the moment of both psychological and physical stress, the director chooses it at ground level and with close up to tired faces, suffering eyes, dirty hands and demolishing wounds; in order to reflect the Greek tragedy that faces the protagonist. The thing is that it does not go any further than that. There is no plot whatsoever, the script is poor, the soundtrack not outstanding and the outcome is simple and very predictable, making these 156 minutes a fight for survival, not only for the protagonist, but also for the viewer. It’s important to mention that DiCaprio’s performance is OK, nothing special, if he is awarded is just because the Academy has a debt with him. On the other hand, Hardy is really the one people should be cheering, amazing performance, no critiques. So in summary, lazy movie, probably the worst work of Inarritu.",
      "total_reactions": 3,
      "user": "NedRyerson1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "I reallllllyyyy liked this film. Gosh darn it's so beautiful and the story, while being a little plain, definitely was something very memorable. I just love this guys films and can't wait to see what he does next *cant wait for the next viewing*",
      "total_reactions": 3,
      "user": "ReubenIsAGod"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "Despite finding it draggy in places, I still give it a 10. It's authenticity, acting, cinematography, direction--all superb. What resonated with me the most, besides the incredible battle scene with the rondelay of swooping camera work, was the weaving together of glass's loss with the search by the native American father. The convergence makes for an ending that is deeply beautiful. Since Idris Elba and Abraham Attah were tragically overlooked for Oscars, I'm fine with Leo getting the award. And this picture getting top honors along with best director and cinematography.",
      "total_reactions": 3,
      "user": "ariel84"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "Realistically heavy in gore, sweeping in the spectacle of its scenery, and featuring great performances by the cast, namely Leonardo Dicaprio, the Revenant delivers both as a striking story of survival, and a tale of revenge.",
      "total_reactions": 3,
      "user": "TheHonestJack"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "Complexity is not a requisite for quality, and it never has been. This film is excellent, but it's not laden with a mess of subtexts or any disorienting storytelling gimmicks. It's extremely straightforward, as are the characters, and there are some moviegoers who cannot forgive that. Personally, I see something simple executed to near perfection, and I appreciate it as such. This film is visually stunning, and incredibly immersive. The early battle scene is extremely reminiscent of the infamous beach scene of Saving Private Ryan in it's chaotic realism.",
      "total_reactions": 3,
      "user": "Windrammer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "Since his victory at Oscars last year, Innaritu has become a famous name and perhaps that is how he pushed the financiers to add 100 million more the the movie which was shot in the best location of northern america.",
      "total_reactions": 3,
      "user": "Xan_Ryil"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "DI CAPRIO, dejo la vida en esta película con el único fin de ganar ese esquivo OSCAR que no posee, y la verdad es que lo ganara con creces. La película en si es un survival horror de 2 horas y media, donde el frió los balazos y el sufrimiento no para (quizás un poco exagerado y forzado), hasta la hora y media de duración la película es lentísima, advierto que hay que tenerle paciencia. La dirección de Gonzalez Iñarritu es digna del mejor director del momento.",
      "total_reactions": 3,
      "user": "Sierpina"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "Beautiful piece of \"cinema\".",
      "total_reactions": 3,
      "user": "LevhART"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "An Incredible Film, Innarritu's Best work so far, even better than his previous masterpiece, Birdman. While it still retains the depth and symbolism of all of his previous films, Innarritu also manages to make one of the best survival movies ever made. Parallels can be drawn between The Revenant and George Miller’s Magnum Opus, Mad Max: Fury Road. Both feature incredible characterization, an extremely well realized world, beautiful cinematography, and a main character who has extremely little dialogue, yet still manages to provide emotional context and be believable with just a stare, manner of walking, or wave of a hand. Both are light on overall plot, yet still manage to create a world that seems real, that the viewer can easily immerse themselves in. Both are masterpieces, and The Revenant caps off a wonderful year for filmmaking, highlighted by returns to form from legends such as Ridley Scott and George Miller, as well as another home run incredibly close after the last by Alejandro G. Innarritu.",
      "total_reactions": 3,
      "user": "TheRetired"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "First thing I must say is, I'm not used to watch movies that are nominated for an Academy Award, but this film attracted my attention so I decided to watch it. And I thought it was fantastic, yes, I admit that is not my favorite movie of all time, but it's really good and I understand why it's nominated. One of the things that I liked the most was the way the camera was positioned in the whole movie. Leonardo Di Caprio was fantastic and the whole cast was on point. Not a movie for all audiences; if you love movies, you should watch it.",
      "total_reactions": 3,
      "user": "karlitatv"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "*Just give him his oscar already!*",
      "total_reactions": 3,
      "user": "partyking"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "In my opinion, this is by far Inarritu's best film, going far beyond Birdman. The movie was gritty. Every single performance was great. It even was historically accurate without blowing up in your face. While I do think it is by far the best movie of last year, it is not my favorite nor is it very re-watchable, as the movie is so brutal and every blow to Leo DiCaprio's character hurts. I urge you to match this movie if you have not seen it. It does so much, and has some of the best cinematography I've ever seen. I would give it a score of 9.5, but 10 is close enough.",
      "total_reactions": 3,
      "user": "NThrush"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2016
      },
      "score": 10,
      "text": "First movie I watched for a while in the theatre that I left extremely satisfied. From start to finish it keeps you on the edge of your seat and wanting more. Not to mention the quality of the picture is incomparable. I will be purchasing when it comes out in stores. I highly recommend.",
      "total_reactions": 3,
      "user": "chrisboer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2016
      },
      "score": 6,
      "text": "There is no doubt that Leonardo DiCaprio is a good actor and he knows how to play, but two things I remember most after I saw \"The Revenant\" are beautiful views and Leonardo's suffering face. Movie is pretty long and in my opinion the camera is too many times getting close to DiCaprio to see how he hurts. There is not enough action, but when it is, it's really good.",
      "total_reactions": 3,
      "user": "Pattorpy"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "The Revenant is one of the best movies as far as cinematography goes.The natural shots they were able to take are amazing and mesmerizing.The visuals are beyond perfect and that \"Bear scene\" is so great that it's hard to believe how they were able to do it.The movie is gritty and also intense while still being very interesting and gorgeously shot with top notch performances and directing.",
      "total_reactions": 16,
      "user": "GentM2015"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "Depiction of how nature can be savage to the men, and how men could be savage to others.I don't see it as a ''revenge'' film, a see it as a survival film, survival from pain, both physically and emotionally...",
      "total_reactions": 13,
      "user": "talhalafci"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "Visually breathtaking and emotionally rich, 'The Revenant' is a mesmerizing film with more Oscar-worthy work from director Alejandro González Iñárritu as well as a truly amazing performance from Leonardo DiCaprio.",
      "total_reactions": 13,
      "user": "johnem95"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "9.5/10",
      "total_reactions": 13,
      "user": "enoching"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2016
      },
      "score": 0,
      "text": "I'm disgusted. The story of Glass is a story of a completely pointless revenge, brutal and inhuman. Without having anything to fight for, all parties in the movie seem to aim at creating pain for the respective other ones. I didn't even enjoy one second of the movie, and I'm not exaggerating.",
      "total_reactions": 13,
      "user": "iMarc"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "Although it's long and drawn out, there is enough here to satisfy the appetite.  It is brutal and bloody at times, and just overall a great survival movie during the exploration period of America.",
      "total_reactions": 10,
      "user": "bpmike83"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "Holy Smokes. I just finished watching this captivating movie a little",
      "total_reactions": 10,
      "user": "GreenGoblin215"
    },
    {
      "neg_reactions": 24,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2016
      },
      "score": 0,
      "text": "Remember the cerebral palsy scene from The Wolf of Wall Street? Well imagine DiCaprio doing that for two and a half hours except this time it's in the snow, not a mansion, and because he got mauled by a bear, not because he's high on drugs. Also, it's not played for laughs.",
      "total_reactions": 34,
      "user": "IHateEveryMovie"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "Savagely beautiful.  The savage beast of man and the indifferent beast of nature are put to film in this stunning story of revenge and retribution.  It's not for the squeamish or faint of heart.  But like nature and humankind, its cold, hard and bloody canvas will reward with images of beauty, kindness, and the unbreakable love between a parent and their children.",
      "total_reactions": 14,
      "user": "Agent314"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "Who: Leonardo DiCaprio, the least attractive Maze Runner, and (In Bane Voice) I was born in the dark, as John Fitzgerald",
      "total_reactions": 7,
      "user": "RvwFromUpHere"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "A solid film but a bit overrated. This film has a decent script, strong acting, and beautiful cinematography.... But it just doesn't feel like an overall satisfying film. I think the biggest problem with this movie is that it doesn't know whether it wants to be a survival film or a revenge film. It introduces itself as a revenge film but 90% of time, it seems that its just a survival film. Only at the very end does it suddenly switch back to a revenge film. And the plot doesn't really go anywhere in terms of character development and story. Its more or less just telling us \"DiCaprio has to go through a lot, look at how much he has to go through\" so much to the point where it's like: Yeah we get it, is the plot/story going to advance anywhere?",
      "total_reactions": 7,
      "user": "Towelzz"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2016
      },
      "score": 0,
      "text": "Beautiful filming and scenery.  Awful everything else - plot, acting, dialogue (there really wasn't any).  Plenty of gore and not at all believable, just plain stupid, situations.  For a wilderness setting, there sure were a lot of people around.  And animals - big ones - bears, moose, bison (of course), wolves, elk- what no crocodiles?!",
      "total_reactions": 7,
      "user": "maineaddict"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "Best movie of the year.  Incredible performance by Dicaprio and Hardy.  At 3 hours I was worried I'd get bored, but it never happened.  The negative reviewers are paid trolls.  This movie isn't for the typical american peasant.",
      "total_reactions": 18,
      "user": "PaulCharles"
    },
    {
      "neg_reactions": 16,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2016
      },
      "score": 0,
      "text": "worst movie ever. Stupid and useless. I used to go blind to watch any Di Caprio but that will change from now on. Such an horrible movie : so long, so boring, so pointless. How can people like that movie when half of the audience left the cinema before this movie even ends. A very very very bad movie!",
      "total_reactions": 22,
      "user": "harry24"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "This movie is beautiful with that kind of creepy beauty you'll find in Coppola's \"Apocalypse Now\" or Greenaway's \"The Pillow Book\". Though it's spoiled with preachy sentiments it will still envelop you and carry away into the straight-out wilderness that long gone now. This movie is not about \"action\", but about one man's journey, about revenge and justice. In \"The Revenant\" you'll see magnificent vistas and blatant brutality, cowardliness and courage, vileness and generosity. Rare artwork in now day's cinematography which is actually art and not your typical blockbuster junk movie. It's European film in the essence with Hollywood's scale and budget.",
      "total_reactions": 11,
      "user": "Smoothrunner"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "It is very seldom that a movie impresses me and has me asking \"How did they shoot this scene?\" Sr. Iñárritu uses an outstanding scenic background to tell a compelling story of a man's perseverance, when all he has left is his thirst for revenge.",
      "total_reactions": 11,
      "user": "ih8sharts"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "Best actor for Leo and best cinematography for sure -- incredible mind-blowing cinematography. Probably one of the most beautifully-shot movies ever made. In the first half of this movie, it seems like Leo only says about eight words. But somehow it works. In the second half, he talks a little more, but not much. It's a quiet film, as far as dialog goes. But the filming is almost a virtual reality or GoPro-type experience -- very immersive.",
      "total_reactions": 11,
      "user": "JimmyJack"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "I was excited to see this movie. I had high hopes. I was blown away.",
      "total_reactions": 11,
      "user": "broodle"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "We have one of the best films of this year. The Revenant is a visual spectacle in every sense of the word, the cinematography of Lubezki is simply sensational, using the formula as seen in Birdman (long and uncut footage) combining scenes accompanied by incredible images of the landscapes or the environment courts and a completely natural lighting. Is without a doubt the best film by Alejandro G. Iñarritu, are also against the most violent film that he has directed, Dicaprio is brilliant, amazing and shocking, the Oscar is for you! Movies are no longer made as well, combine perfectly the real thing with little CGI (bear attack scene is spectacular and an of the most stunning never seen), epic, violent and absolutely amazing, a true masterpiece.",
      "total_reactions": 15,
      "user": "JohnMasterL"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "Одличен филм, одличен режисер, одлична фотографија, одлична актерска екипа, дефинитивно \"мириса\" оскарот за Лео. Можеби режисерот малку претерал со прикажувањето што се преживеал Glass, но добро, овде се работи за филм и мора малку да се уфрли таа холивудска атракција. Ликот малку е преставен како супер херој, како лик кој тешко може да го совлада природата, но како што реков ова е филм и мора да ги има тие \"состојки\".",
      "total_reactions": 12,
      "user": "Penny_DC"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "I've heard this film is good and I believe so. If people wanted me to see it, it's alright because a great movie is told right here even if I haven't seen it yet.",
      "total_reactions": 8,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "I agree with the good and bad reviews on here. Leonardo does give an over the top performance with lots of grunts and moans etc. In my opinion, it's the direction and cinematography that really shines through. Just in the first few minutes of the movie I was hooked and didn't want it to end. I liked this a lot better than birdman...while that was an movie about what's going on it someones mind...this is what's going on outside. Leonardo doesn't talk for much of the movie but you know exactly what he's saying without him speaking. I think that's talent. If more directors put the effort Alejandro puts into this movie, we'd have some pretty awesome movies  like this to watch!",
      "total_reactions": 4,
      "user": "nofilla"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "Undoubtedly, one of the most visually stunning films I have ever seen. The cinematography was beyond spectacular. This story of survival and revenge is intense, bold, and completely original. This is great filmmaking.",
      "total_reactions": 4,
      "user": "Trev29"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "Cinematography is a game of skill, and Iñárritu might aswell be a gold medalist, when it comes to film making, with amazing practical effects and Oscar worthy performances, it is the raw emotion that glues this film together to make it an absolute achievement in film making, with memorable scenes and drawn out sequences, Alejandro González Iñárritu makes the audience once again appreciate the art of film.",
      "total_reactions": 4,
      "user": "McGillotine"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2016
      },
      "score": 0,
      "text": "It's just terrible. It tries to be so deep and meaningful but instead it is a mismatch of  scenes that don't make sense and its emotionally thin violence is cringe worthy. The script is poor, the acting is average, the cinematography is delusional as opposed to arty and in short, this film left the group of us who were watching it feeling confused and kind of icky. It's a really horrible, randomly violent mess of dark filled yuck. I am actually really worried as to how this film has scored so highly. If I had gone to see this in the cinema, I would have walked out.",
      "total_reactions": 4,
      "user": "Paulystan"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "What strikes one about The Revenant is its realism. It gives the feeling that you're actually there as the characters are (literally) breathing unto the camera. It is a gorgeously looking movie that's a love letter to nature. However the cinematography is almost better than the story actually deserves.",
      "total_reactions": 4,
      "user": "AliceofX"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2016
      },
      "score": 0,
      "text": "I hate leonardo dicaprio films. I get bored of oscar nominated films. His movies are all serious id prefer him in movies like grimsby for example......",
      "total_reactions": 4,
      "user": "Antemiz"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "es una de las mejores peliculas del 2015, espero que leonardo se gane el oscar a mejor actor, ya que en esta pelicula la revento de sobremanera, aparte su director es muy bueno a la hora de dirigir.",
      "total_reactions": 13,
      "user": "pipesan"
    },
    {
      "neg_reactions": 29,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2016
      },
      "score": 0,
      "text": "Revenant may have been filmed well, but the overall movie is just an OK experience.......",
      "total_reactions": 37,
      "user": "speedoriginal"
    },
    {
      "neg_reactions": 33,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 0,
      "text": "Malopre sam odgledao film \"The Revenant\",",
      "total_reactions": 42,
      "user": "Nikola"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2016
      },
      "score": 6,
      "text": "Too violent, too gory, and at over two-and-a-half hours, much too long. Twice, my friend leaned over and asked to see my watch, saying \"How much longer?!\" The performances and the production values are all excellent, but the constant gory violence becomes too repetitive. The revenge aspect of the plotline was emotionally manipulative.",
      "total_reactions": 5,
      "user": "preciouskiki"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "From a renowned director Alejandro Iñárritu comes this story of survival and vengeance. Partially based on real events, this movie focuses on the 19th century traveler Hugh Glass (played by Leonardo DiCaprio) who was left for dead by his team mates after being mauled by a bear.",
      "total_reactions": 5,
      "user": "netflic"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "I can say with the utmost certainty that this is the best shot movie of 2015. Alejandro Inarritu shows off his amazing ability to capture environments around him and build tension between characters (just look at the opening sequence). Speaking of characters, DiCaprio's performance as Glass is amazing, along with Tom Hardy's Fitzgerald. My only con with this movie is its runtime, which I think could've been cut by about 20 minutes. However, its imagery is fantastic, its performances are great, its action is intense, and it is one of my favorite films of 2015, alongside Inside Out and Spotlight.",
      "total_reactions": 5,
      "user": "Mattyice"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "Looks like DiCaprio's journey for an Oscar is finally over! The Revenant is one of the most impressive movies of 2015.  The cinematography in the Revenant was mind blowing.  The battle sequences are harrowing and incredibly immersive.  Lubezki deserves an Oscar for the cinematography in this film no doubt.  Every moment watching this film I felt like I was in the same environment as Glass.  It is a very long film, but because of how immersive the film was I never felt drawn out or slow to me.  If you could only watch one film in 2015 then this would be the film I would recommend.",
      "total_reactions": 5,
      "user": "CapnAwesome"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "It could be argued that the Revenant is potentially stuffed to the brim with too much delicate symbology that it may contradict itself at times and ends up with a **** of messages that together make no apparent sense. Despite this, The Revenant is truly an absorbing and captivating tale. Using the Native Americans vs the white man as it's historical basis, the revenant manages to conjure up impeccable imagery and devilishly clever cinematography to soothe an otherwise harrowing journey. Don't get me wrong, it stings hard, the blood stains the screen and you can feel scars form across your skin as you watch Di Caprio clamber and spit through snow, grass and flesh. As a testament to the Native Americans who lost their homes and family, The Revenant is an undisputed masterpiece, but what it's trying to achieve for Hugh Glass is ultimately, a tad messy.",
      "total_reactions": 5,
      "user": "TrilobiteG"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "An absolutely brutal and artistic masterpiece, the Revenant is a chilling (literally) tale of a man out for revenge, and it fulfills that perfectly.  The movie doesn't pull any punches and hits you with brutal imagery and incredible performance.  This movie is fantastic.",
      "total_reactions": 5,
      "user": "JokerChaos"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "There is a real risk of The Revenant spend the next months being associated with Leonardo DiCaprio chance to finally win an Oscar after five nominations. But it is worth noting that the film is not only Leonardo DiCaprio. Its performance is overwhelming and it seems that the actor can actually lead a statuette home, but if not, there is no reason for the film being undervalued or overlooked. The quality of the film should not be related to good performance awards. Regardless of the number of trophies that will accumulate in the awards season, one thing is certain: it is a great film.",
      "total_reactions": 5,
      "user": "SpiderPlayer"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "The use of natural light for this film is OUTSTANDING! The is one of Leo's best works! Great story with surprising twists. It's not a movie that is worth watching again tho, however Leo deserves an Academy Award for this film no doubt.",
      "total_reactions": 5,
      "user": "ahoang13"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "If you're not bothered by a slow paced movie, you will absolutely love this. Emotionally gripping, controversial moments. The main villain is very nicely developed. No complaints from me, wonderful movie. 10/10",
      "total_reactions": 5,
      "user": "anichels"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "I must have not been in the mood. I was just kind of waiting for something to develop and happen. I never watch trailers so I didn't psych myself out.",
      "total_reactions": 5,
      "user": "jlhg11"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "This movie is raw and truly inspiring for film lovers. As gruesome and disturbing as it is \"The Revenant\"  has a lot of heart. Leonardo Dicaprio is better than ever and is possibly awaiting an Oscar that he rightfully  deserves. Al the supporting characters are great too. Hardy, Gleeson, and others are all top notch here.The long length may turn off some but there is no denying that this is a truly beautiful film.",
      "total_reactions": 5,
      "user": "roadwarrior234"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "\"I ain't afraid to die anymore. I've done it once already.\"",
      "total_reactions": 5,
      "user": "Jman14102"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "I read a review of this movie which called it “visual poetry.” It was definitely that. Everything about the movie was beautiful to behold. The entire movie was shot from low angles, either at waist-height or lower. Combined with the low angle, most shots were very close up. The resulting combination made you feel up close with the action and story. You may be afraid of the camera shaking a lot, but that wasn’t the case. All shots were easy to make out… just low and up close.",
      "total_reactions": 5,
      "user": "themattman2"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "I thought Leo did a great job acting, howerver, the movies resembles Castaway, Jeremiah Johnson, Death Hunt 3, and Gladiator wrapped up into one movie. Good but not great;",
      "total_reactions": 5,
      "user": "DarkSideOTForce"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "And once again Iñárritu created an intense movie for the audience. The long gaps between his cuts let everything feel more real than anything else. I can imagine that the length the movie has is part of the suffering for its main character. Despite the cgi in The Revenant it seems to be the counter-concept to the mass of  synthetic blue-screen Hollywood movies. Sadly because of DiCaprio nobody is talking about the brilliant performance by Tom Hardy.",
      "total_reactions": 5,
      "user": "Lalaland_ger"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "As a avid movie fan, who charts my top five movies in all genres, I consider The Revenant neo-genre; there is no way to categorize this film. It is extraordinary; although, it is a movie about revenge; it is also a love story between the film and the audience. It might take a decade or more, before we/I see a movie so interminable. It is filmmaking at its best, so I asked myself how will I view future movies, since, I have seen the greatest movie ever made.",
      "total_reactions": 5,
      "user": "lauraliejane"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "A masterpiece. Cinematography which I have not seen in any movie in years. Haunting soundtrack. The ending is somewhat strange and disappointing, but then, who am I to criticize ?. A movie which will be studied in film schools for years and from which many aspiring  moviemakers can learn from. It stays with you for a while and then some. Bravo !!!",
      "total_reactions": 5,
      "user": "Val-835"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "This is an absolutely brutal film, beautifully shot and masterfully acted.  If it weren't for the talent involved, this would would be considered to be torture/survival-porn.  While not technically a western, it should be grouped into the current neo-western trend of films that include Slow West, Bone Tomahawk, and The Hateful Eight among others.  Do yourself a favor and enjoy the cinematography on a large screen and have fun with the rest of the audience wincing at all the pain DiCaprio suffers through in this movie in his quest for revenge.",
      "total_reactions": 5,
      "user": "pemdasi"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "I Loved this film Alejandro González Iñárritu has created a masterpiece that shows the power of the human spirit and the beauty of nature all blended into one of the most VIOLENT movie's I have ever seen. Leonardo DiCaprio gives his all in his performance of Hugh glass. Although he has very few spoken words he gives his best non verbal performance of his career. Tom hardy gave a winning performance as the films villain. I tend to be picky when it comes to film villains because they all feel the same to me. However Tom hardy's performance prodly sits up there with some of the most memorable villains I have seen grace the silver screen. Guys go see the revanant I promise you won't regret it.",
      "total_reactions": 5,
      "user": "nahtan1244"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "Just as Hugh Glass was able to rise from the dead due to his new found purpose to breathe and survive, Inarritu thrives in the forest of Wyoming by capturing the intensity of nature and revenge.",
      "total_reactions": 5,
      "user": "leejoice10"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "Despite the great cinematography, this is simply a overdrawn survival and revenge story. It is too long on the bleakness and the repeated survival of the main character that the attempts to throw in some spirituality and moral foundation fall flat. I enjoyed his other films much more as I frankly got bored with the story and the inevitable ending.",
      "total_reactions": 6,
      "user": "JamesL"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "Crafted with expertise, this film delivers 2 hours or boredom and slow pacing. Difficult to enjoy for an everyday guy, and DiCaprio's character is never given a chance to shine. Hard to enjoy a revenge flick when you actually don't really want the revenge to happen.",
      "total_reactions": 6,
      "user": "Morphine_OD"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "Very similar in style to his last film, Birdman, The Revenant is Inarritu take on a revenge story at its finest. You won't get much complexity from this movie. Very little dialogue is actually said in the movie. Most of it is told from the actions and reactions to the world that the movie is set in, which is the real star of the show. DiCaprio does a great job at the main character Glass, and his reactions to what happens to him is basically the whole movie. The pacing is a bit slow and, for a close to 3 hour movie, it can be hard to sit through some of the more dull moments that happen. However the wonderful and gory fights scenes take the cake and deliver a very realistic way of fighting, whether it be against man or beast. I definitely enjoyed this movie more than Birdman as the focus on, basically, one character was far more precise here than in Birdman with it's many different scene stealing characters. Tom Hardy does a good job as the title villain but his thick accent can make understanding some of his lines a chore. I'd recommend this movie to alot of people, with the mindset that they can sit through alot of down moments and some definite gore that you don't see in alot of other movies of this type.",
      "total_reactions": 6,
      "user": "Kenmei"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "After last year's astounding Birdman which came to be one of my favourite movies of all time I was looking forward to A. Iñárritu's new collaboration with the cinematographer E. Lubezki. And sadly, it fell a bit short of my exaggerated expectations.",
      "total_reactions": 6,
      "user": "RealMuthaF"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "Unrelenting, incredibly brutal, and incredibly intense, The Revenant is a fantastic film that will deserve its accolades richly. Sucking every inch of beauty out of the Alberta setting, cinematographer Emmanuel Lubezki has done something incredible in this film; every shot is beautiful. Rarely has there been a film so luciously gorgeous, but Lubezki has done it. This may honestly be one of the prettiest films I have ever seen. The direction from Alejandro Inarritu is fantastic and epic vision for the film certainly came to fruition. A brilliant modern day epic, the film's makeup is also incredible and the acting from Leonardo DiCaprio under this makeup is phenomenal. He does not say too too much, but he does not have to in order to deliver one of the year's best performances. Tom Hardy and Domhnall Gleeson are also phenomenal and almost threaten to steal the show at times. Overall, a brutal epic, The Revenant is a tad long and can be slow in parts, but with brilliant thematic elements and the best cinematography in a film in a long time, the film is a wonderous cinematic achievement.",
      "total_reactions": 6,
      "user": "Spangle"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "The Revenge plot is as old as time, but this film is more about putting the cinema back into the cinema. Gloriously shot and incredibly executed scenes, bolstered by strong direction and acting may make this the one to beat come Oscar time.  Warning though........very graphic in its depiction of violence, and the seemingly single take bear attack may unnerve some viewers.",
      "total_reactions": 6,
      "user": "JohnnyC"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "A flawed but beautiful, superbly acted, and sprawling movie. Dicaprio is good but the real standout is Tom Hardy. Hardy is always great, but here he gives what may be his career best as a truly devious villain. Lubezki's cinematography is expectedly miraculous, but even more so than Gravity and perhaps even Birdman and Innuaritu also does great directional work once again. The middle section of the film is a little slow however, and the story itself, while powerful and involving, may actually be the weakest element. But with such scope, grandeur, and such a satisfying journey overall, the Revenant nabs the distinction of being one of 2015's best movies. And it is something to see on the big screen.",
      "total_reactions": 6,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "Another must see film of 2015. This is the film that Leonardo Dicaprio is finally going to win the Oscar! He was great and very different from all the douche characters he has played from Wolf of Wall Street, Great Gatsby and Django Unchained. It is his to lose. The film is very gritty and some scenes are hard to watch. Alejandro Inarritu is an amazing director and really knows his sense of focus and are prominent throughout his films from Babel, Birdman and The Revenant. They all somehow revolve in one setting like a center stage. Audience are glued and fixated to the main character who is dealing with self conflict or inner demons. In Babel one of the stories is how a young girl deals with suicide. In Birdman Riggan played by Michael Keaton is dealing with his fading career and trying to get back to the limelight.",
      "total_reactions": 6,
      "user": "francisrgo"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "The Revenant is one of the most epic yet simple films that I have ever seen. This film is long but there is never a part of the film that feels like it doesn't need to be there. Alejandro Gonzalez Inarritu already showed us with Birdman last year that he is one of the best directors out there. Its only been a year and Inarritu WILL be in the winners circle again this year. I feel that The Revenant is even better than Birdman. The film is so raw and powerful and its visually stunning regardless of the scene. Leonardo DiCaprio has become an actor that we expect nothing but excellence. Not only is this one of DiCaprio's best performances but I think that there is almost no way that he does not take home the Oscar for Best Actor. The Revenant may sweep many of the major categories at the Oscars. I think it will win Best Picture, Best Director, Best Actor and perhaps even Best Supporting as Tom Hardy is excellent in this film as well and its one of his best performances so far. The Revenant is outstanding filmmaking and it may only improve with more watches.",
      "total_reactions": 6,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "Although this film was riveting at times, I can not see it winning the Best Picture award.  I give it an honorable mention at best. Dicaprio did an outstanding acting performance but his character role delivered very few lines,  Screenplay itself relied so much on horrifying & violent scenes. BOTTOM LINE : Good entertaining movie for it's category but far from the best I've seen this year.",
      "total_reactions": 6,
      "user": "moviecritic68"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "You have to see for yourselves to understand why the greatness of this movie! I watched plenty of movies but this one just blew me away, the way the movie was filmed was astonishing and that is once again because of Iñarritu's vision and masterclass work by Lubezki. It has moments that you simply feel frightened, seriously, that bear scene is something truly special! The acting was also very good, this is probably in top 3 DiCaprio's performances and i swear, if he doesn't win the Oscar then i guess the world is completely doomed. Hardy was also a great presence for his villainous role that also earned him a well deserved nom for Supporting Actor. The only thing that is stoping me of giving a 10 is because of its story but it's something minimal, guys i definitely recommend this one to check out. MUCH BETTER THAN **** WARS!!",
      "total_reactions": 6,
      "user": "Simpsons92"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "Alejandro Iñárritu brings the brutal story of Hugh Glass to life in a magnificent film. The Revenant is intense and dramatic and keeps you entertained for most of it. For many of the important scenes the film relies more on the intensity and action of the scene rather than using music, this is good as it makes you feel more for the characters. DiCaprio and Hardy are spectacular actors and they really show off there skills in this film. As well as them Poulter and Gleeson portray there characters well. DiCaprio makes you feel many emotions throughout from sadness to hatred. This is a fabulous film to kick start 2016. The only problem with the film is the fact that it drags on a lot longer than it should and has you almost itching for it to end. However it is still a definite watch!",
      "total_reactions": 6,
      "user": "WillCole"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "Absolute Masterpiece, well done filming, well played, and bravo to Inarritu ! i heard about how lighting was for this movie and im very impressed! some shots are very creative! its a shame that there is no higher grade award than Oscar cuz this movie needs more than just an Oscar!",
      "total_reactions": 6,
      "user": "kavak"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "A film that needs no introduction, starring Leonardo DiCaprio (who's just crying out for an oscar, deservedly so) and Tom Hardy (who seems to take on the task every movie to be the most difficult person to understand). This film grips you from the start and makes you feel every ounce of physical and mental pain the characters go through. The direction's a little overly artistic and you're definitely going to feel the length of this movie but completely worth it. For those of you lucky enough not to have seen the trailer, keep it that way as the less you've seen the better. Recommended unless you have a severe fear of bears.",
      "total_reactions": 6,
      "user": "Rebecca31"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "Leonardo DiCaprio never stroke me as the actor who gets in the mind of a character so much that I can only see the character on screen. His inability to properly display accents, an overuse of body-language and yelling, and his generic grimace often made me go, \"Yep that's him alright\". Though with this role I see him much differently. It could be the awful facial hair, but I think it's rooted in the fact that he barely ever speaks. And the character is spent mostly crawling or limping, so the wild gestures are kept in check. Then when the movie gets tense and he really needs to struggle it looks more convincing, raw, and even natural. And speaking of things that look natural let us briefly summarize this cinematography and camera work. it is widely known that film used a lot of natural lighting, the Barry Lyndon technique that just isn't usually seen today. It payed off. I understand that it was incredibly difficult to film and required a lot of extra work, but it works. I sat in the theater (not in IMAX) thinking, \"if i visited this place this is exactly what it would look like.  I would say that the film has a grey aesthetic, but the backdrops showing a crisp clear image of a foggy forest help it all blend naturally. It is really contributes to 2015's amazing run of beautiful films. Out of all the films this year, Mad Max: Fury Road and this were the best looking. The camera work is also very repetitive, but interesting nonetheless. The film uses juxtaposition all throughout. We may start on a wide helicopter shot of a mountain, only to do a one take zoom to DiCaprio trudging through the snow. Maybe we will have the sun reflect off the camera showing nature in all of it's glory, only to have 'man' use it as a playground for gritty, blood soaked battles. The film likes to go from the larger picture to the little details. I find it to work because we can see how personal and up close the tense situations are. Also the camera feels married to the idea panning. Every sequence involving a dilemma is likely to show the dilemma through a pan to the left or right. It got on my nerves, but really didn't kill anything. Some of the things that are going to turn people are the sequences where DiCaprio is alone and must survive. There is two good character interactions, and one self inflicted medical treatment that felt fresh, but not much else. Giving the film props, it kept with its identity of slow one take shots, DiCaprio not speaking, and beautiful cinematography. Unfortunately they were focused on things that we would have implied anyway.    Nothing note worthy or interesting happens with any other character after DiCaprio is on his own. But the characters are still believable and developed well enough. Tom Hardy, especially, pulls of the paranoid, racist, rebel with charm even though it has been done a million times. Sometimes the movie will have a bit of a mixed bag with how much Hugh Glass (Leonardo DiCaprio) hallucinates, and the hallucinations aren't exactly rocking my mind. The film does a much better job making battles have real weight. The first battle and sequence with the bear is done remarkably well; every hit feels like a crushing blow. Overall the film suffers when it has to have survival, which can be a real problem  for people. Though if you excuse that then you are left with a beautifully looking, drama that does a lot to impress the eyes.",
      "total_reactions": 6,
      "user": "PrimeProjectors"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "The Revenant is a very visual film. Innaritu's camera goes into the beauty  of the wilderness where few have gone. At it's core, it's a classic revenge film. I laud it highly but it's not great but certainly shows glimpses of greatness. Tom Hardy is so good, that my respect for his acting has gone up tenfold. Leo is at his usual best as always. This is oscar material alright , specially the cinematography. A very good and satisfying film.",
      "total_reactions": 6,
      "user": "Primevortex1234"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "A film that plays with the senses of the exclusive viewer. A masterpiece that only every few years can be seen. Only big movies are who manage to unite the mind of the viewer with what you see and hear on the screen, but most of the movies who succeed are feelings easier to translate, it's like doing a painting and capture on canvas the most beautiful colors, it is more difficult to make something beautiful with more openings or plain colors. Redemption, revenge is something that the viewer recognizes it in the movies as a blockbuster and nothing else. Inarritu put together an incredible photography, some majestic scenery, magnificent Leonardo Di Caprio and a good soundtrack (which to my taste is weak). Who else enjoy this film are the most exclusive observers who have a thin and sharp eye for the film.",
      "total_reactions": 6,
      "user": "alexmelgarl"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "The Revenant was technically brilliant and visually stunning. Not everyone will enjoy this film as it could be perceived as slow by some, however, you still have to respect it.  The landscape is beautiful and the acting is excellent. I thoroughly enjoyed the film.",
      "total_reactions": 6,
      "user": "JfilmL"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "I’m not really sure what to say about the film that hasn’t already been said. I’ve heard those who love it and those who kind of thought it to be kind of boring. I for one really enjoyed the film. All it took was that first teaser trailer with the breathing. Maybe one of the best trailers I have ever seen for a film.",
      "total_reactions": 6,
      "user": "WriteToReel"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "Beautiful.",
      "total_reactions": 6,
      "user": "TCR"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "What a visually spectacular film - it's worth seeing simply for the visuals. The story is a little blunt, but it has such an authentic feel to it - from the Native Americans, to the French traders, to the hunters - it all felt very real.  I have no idea how certain scenes were filmed (animal attacks, falling over a cliff on a horse, etc.), but the direction is incredible.  It's a long movie, but you'll never be bored.",
      "total_reactions": 7,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "This movie decent, not epic or excellent. DiCaprio is great, but the film is more about surving nature than any real story or plot. It's about 2hrs and 30 mins long -- probably could have been better at 2hrs.  Nontheless, it was beautifully shot and had some great moments. Not enough for me to give it higher than a 7.",
      "total_reactions": 7,
      "user": "marco34la"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "i liked the film from start to finish, and dont let the long runtime fool you, i wasnt bored or checked my watch once. its not a perfect film though, but its better than hateful eight. so if you want a good action film with a simple story check this one out. awesome music and cinematography.",
      "total_reactions": 7,
      "user": "jrodfilms"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "The Revenant isn’t like most westerns that have very straightforward moral dilemmas and are fun tones, it is dark, and it is complicated. The Revenant is a movie with a lot of backstories that makes, it even more impressive than it already is, and it is impressive. The Revenant is brilliantly acted, features beautiful cinematography all the while showing deep narrative heft. The film is poised to receive major awards attention, and rightfully so.",
      "total_reactions": 7,
      "user": "tjman09"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "Visually and technically, this movie is just amazing, goosebumps inducing. The cinematography, the set pieces, the landscapes, everything is absolutely gorgeous. There is some beautiful overly-long and wide takes, every shot is more impressive than the other and executed to perfection. The story is quite simple, a man versus nature guided by revenge, but like in mad max 4, a story doesn't need to be complicated to be good when it is well executed. That's what this movie does, the concept is simple, but is so well-made, cohesive and entertaining that it doesn't matter.",
      "total_reactions": 7,
      "user": "Urbanlistener"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "The Revenant is dark, gritty and powerful. Shot in all natural light, Alejandro Innaritu provides audiences with one of the most beautiful looking films of the year. The camera work helps to convey the harshly realistic conditions the characters must face, harsh to one scenes spectacularly terrifying extent. Leonardo DiCaprio inevitably provides an amazing performance, although matched equally by brilliant character portrayals from both Tom Hardy and Domhnall Gleeson. The theme of revenge drives what is a superb story, a story that matches the amazing camera work and character development to create a great film.",
      "total_reactions": 7,
      "user": "PeterAlexander"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "The story was a little bit predictable. What made it great was Leonardo di Caprio and Tom Hardy as the 2 main characters. People who expect a film fully loaded with action scenes will surely be disappointed. Instead they will see a film where di Caprio tries to survive the hazards of the wilderness after he has been left for dead. Some of the scenes are so great and realistic that you might think that they sacrificed some of the stunt men to film it.",
      "total_reactions": 7,
      "user": "pessimist93"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "I'd like to give this movie a 10, but that would seem trite. The \"hook\" for me was set within the first 1-2 minutes and my interest never waned.  Set during the fur-trading era of the early 19th century, it's an inspiring tale of survival set in the cold Dakota region. The imagery is breathtaking at times, and the details the filmmakers portray are amazing. I highly recommend this movie. It's a masterpiece.",
      "total_reactions": 7,
      "user": "sbecht"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2016
      },
      "score": 0,
      "text": "As a DiCaprio fan I cannot understand all the hype about this movie.  The plot is ridiculous and not even close to being believable.  A guy is mauled by a grizzly who just decides not to hibernate one winter.  His broken foot/leg heals miraculously with no treatment or sustenance.  Then he floats through killer rapids (class IV) in winter fully clothed and with boots and fur coat and does not even shiver.  The real incident took place in August, but the director insults us by pretty much making up impossible situations and the gullible buy into it.",
      "total_reactions": 16,
      "user": "tdelcavo"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "There aren't many movies that have made me squirm in my seat and this one did several times.  This movie is not for everyone.  There are some very graphic and intense scenes of violence it it.  This is basically a story of survival in the 1820s.  Leonardo plays as a scout (Glass) with his son helping trappers harvest pelts.  They are attacked by Indians and forced to retreat into the wilderness in search of a fort many miles away.  On route, Glass is attacked within an inch of his life by a bear, but manages to survive.  Ultimately, the company is forced to leave him with his son and 2 other men while they forge ahead in search of the fort.  This is not a special effects movie, but a plodding story of one man's will to survive and seek vengeance.  Much of this movie has no dialog as Glass is on his own and doing what he can to live in the wild.  The cinematography is stunning at times.  I deducted 2 stars since I did look at my watch twice (2 hr 36 min).  The theater was packed and I was glad I went to this movie.  You could tell at the end of the movie that it had an impact on the audience since everyone seemed quietly stunned as they filtered out of the theater.",
      "total_reactions": 8,
      "user": "Peabarter"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "Overall, a decent movie. some pretty good photography, competent direction. nothing spectacular but quite a few engrossing scenes.  Tom hardy did not totally destroy it with his mushmouth mumbling muzzled **** about the best we can hope for these days.",
      "total_reactions": 8,
      "user": "CarribeanDean"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "The Revenant is a visually stunning revenge film that is one of the year's best.  Alejandro G. Inarritu is proving to be one of the best directors working today and if Leo doesn't win best actor this year he may never.  This is a must see film on the big screen.  A",
      "total_reactions": 8,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "I had the chance to read Michael Punke's novel that this was based on before seeing this. So when watching the film, I noticed that it was straying awfully far away from what was happening in the book and at first I was disappointed. However, by the time the film ended, I understood more why this was the case. First off, the credits read \"based in part on the novel by Michael Punke\", so that was a dead giveaway right there. Also, Punke couldn't promote, do any publicity, or even be on set or aid in the making of the film due to the fact that he's currently an ambassador to the World Trade Organization, which prevented him from helping the filmmakers include many of the events from the novel. I also realized that since so little is known about what happened with the real-life Hugh Glass that multiple stories and plot points can be made up about him. Even Punke admitted to having to make up several events that were in the novel. So basically Punke was telling his own version of what Glass might've been through or experienced, while the filmmakers were telling their own as well. For these reasons, I'm able to forgive the fact that the film drastically strayed from the novel. In fact, the more I thought about it after the film ended, the more I realized that I actually liked the film better, because the third act in the novel kind of strayed from the revenge plot that it so specifically advertised and went more towards the justice route, whereas the film stuck firmly with the revenge plot, which made for a much more exciting and satisfying third act that truly made the film a great story of revenge! In addition to this, everything about this film was absolutely perfect and phenomenal! The gorgeous cinematography and landscape shots throughout, the hauntingly effective and powerful score, the brutal and unflinching violence and action, etc. And of course, the acting from everyone involved was outstanding! Leonardo DiCaprio will win his long overdue Oscar for this film, mark my words!!! Tom Hardy also delivers a very aggressive performance. Even Domhnall Gleeson and Will Poulter make the most of their characters and screentime. So overall, director Alejandro G. Inarritu does it again with a film that's just as intriguing and engaging as his last film Birdman was! It's undoubtedly one of the most impressive, powerful and memorable films of 2015!",
      "total_reactions": 8,
      "user": "moviemitch96"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "This movie had some of the best cinematography I've seen. You could see that each scene was visually crafted. At the beginning, Tom Hardy's accent was a bit tough to understand but I got use to it halfway through. Some of the scenes are very intense and you can feel the emotion in them. Overall a very good movie. Only thing I didn't like was that it was almost 3hrs long but I guess...so are most major movies these days. I would recommend seeing this one in theatres.",
      "total_reactions": 8,
      "user": "jbrown8989"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "Leonardo DiCaprio for what it's given he does a fantastic job. Unfortunately the story and pace did not complement that performance as at times it feels too long and slow. others times its great having that unbalance back and forth throughout the film. Overall, The Revenant is a film that is enhance by L. DiCaprio performance to make it a solid good film.",
      "total_reactions": 8,
      "user": "geo333"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "Impossible to take it all in with just one watch, but I can't wait to watch it many more times. Inarritu has with The Revenant, and Birdman before it, firmly placed himself among the ranks of the greatest auteurs working today. And yes, DiCaprio is going to get that Oscar finally, as well as Lubezki thirds in a row.",
      "total_reactions": 8,
      "user": "atclubsilencio1"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "One of the best films of the year.  While DiCaprio is spectacular, Hardy has a juicier role and almost steals the show.  Scenery and cinematography on par with Jeremiah Johnson, the previous gold standard in the \"mountain man\" genre.  An epic survival/revenge story made even stronger by its basis in fact.  The bear scene absolutely lives up to the hype.",
      "total_reactions": 8,
      "user": "herndonrules"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2016
      },
      "score": 0,
      "text": "Here are the various mistakes of this movie. 1.The movie itself. 2.The plot is not believable, the dude gets mauled by a bear, falls of a cliff while riding a horse and falls on a pine tree, and somehow still manages to survive. 3.The antagonist is saying a bunch of nonsense about God, right when he's about to fight to death with the protagonist. 3.At least 47 minutes of the movie is DiCaprio crawling in the snow screaming in pain. 4.There are so many useless scenes, like the one where DiCaprio is catching snow flakes with his tongue along with the first nations guy. 5.The movie doesn't really go anywhere until the last 20 minutes where he gets to the village and Hugh explicitly states that he's going to hunt the antagonist down and kill him. 6.The ending is too predictable.",
      "total_reactions": 9,
      "user": "XeroFilms"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "I've never really been a DiCaprio fan really.  Never thought he was that great of an actor, however...this film really proved to me he really has the acting chops to be an A list actor now.  I was REALLY impressed with his role here and can understand if he lands an Oscar this time.  Good story, great directing.  Must have been a real pain to get filmed in those type of elements.",
      "total_reactions": 4,
      "user": "CountryPetInn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "The one who came back from the dead to avenge.",
      "total_reactions": 1,
      "user": "LeZee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2016
      },
      "score": 5,
      "text": "The scenery was great and beautiful. It makes you go \"wow\" a lot during the movie. The camera angles were good too, being a lot different than the angles we see in nowadays movies.",
      "total_reactions": 1,
      "user": "smasherwolf"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2016
      },
      "score": 5,
      "text": "The only merit of this movie is its artistic side, the photography, the direction, but a movie needs A SCRIPT. It needs a freaking SOUL. We live in 2016. This is as simplistic a revenge story as it goes. Leonardo DiCaprio's character, in his rightful rage, spends over 90% of his screen time grunting and moaning in pain. All those things that could have made this movie wonderful, like e.g. a TRUE focus on his family's past, are introduced just to be introduced and then thrown down the drain.",
      "total_reactions": 1,
      "user": "menthys"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2016
      },
      "score": 6,
      "text": "I wouldn't say this movie is bad. About half the time it is actually quite good. Great acting all around and beautiful scenery. But there's a general lack of character to it. I never felt invested in the story or the main character. It just seemed that what he was going through was so blown out of proportion that it made no sense. I didn't feel his pain, I mainly just observed and wondered.",
      "total_reactions": 1,
      "user": "muldjord"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2016
      },
      "score": 4,
      "text": "Okay, you riddle me this...How does one man go through all of this \"based on true events\", and still live? Unless he was born on a planet far, far away? Spoiler Alert! Do not read this, unless you have actually seen the movie. First off, I felt bad about the cubs, the Pawnee girl, really bad about the son, really, bad about the Pawnee friend who helped Glass, and really, really bad about the horse )okay, really bad for the mama bear too). Now then, the real question is how? How can a human being attacked by a bear, suffer what appears to be a broken leg/ankle/foot/ uh, punctured lung, ripped off skin, nearly ripped out throat, and then live after going down rapids, wade ashore in this broken state, and then walk/limp away? Even after all of that water rapid ride (that would normally destroy a canoe, kill the average person, Glass still has the ability to have the stone and flint to make a fire AND no additional physical added problems. The flint and stone weren't lost while he was tossed around like clothes in a washing machine? And even though he was total submerged in water (hypothermia didn't play any part in this movie, it was ignored), the animal skins he was wearing, miraculously dried perfectly. The topper (one of far too many in this movie) is when he is riding a horse away from his attackers and they soar off a cliff. The horse goes off one way (lucky? for Glass) and drops to his bloody death nearby Glass. The horse is a total bloodied mess after the fall from the cliff. But \"Super Glassman\" drops anywhere from 150 to 300 feet, falls on his face in the snow pack, and walks away without any additional damage to his already damaged body (not one additional scratch or broken...anything). Amazing! Then, he strips down, makes a bed in the gutted out horse, when he wakes, he is amazingly \"cleaned up\", puts his clothes back on to go on his way. What planet was Glass from originally? Does he know Kal-el? Do they \"do lunch\"? It was almost too much to repeatedly see L.C. ala Glass with those baby blue eyes and the crystal clear whites of his eyes looking like he just got out of bed at a four star hotel. There's more, but it's not worth mentioning. This based on true facts script/story must have been about a number of men and put into one man's life. That's the only way it could possibly have happened. There was far too much (\"you have to be kidding\" under the audiences breath throughout the movie) to make this movie real. The last shot was the final slap in the face. Picture this, one more shot of L.C. looking into the lens with nice clear, rested blue eyes, and then fade to black. Always a good way to end a movie by having the main character starring into the lens. That makes us all feel so warm and fuzzy. If the movie gets any awards, it should only be for sound and photography. Set dressing looses here because of the well patterned snow pack, the trails that were far to tread on where nearly driven snow should have existed at that time, the non-existing branches in the tree and on the ground from that fall both the horse and \"body\" did in the one mentioned scene above. Do we see a sequel in the near future? The Revenant II, Return of The Revenant, The Revenge of the Revenant, The Revenant Prequel... (at least we have to hope it will not be picked up as a series) ugh!",
      "total_reactions": 1,
      "user": "Bringitback"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2016
      },
      "score": 6,
      "text": "There's an interesting contrast to see a film that strives for rawness, but such perfectly glossy, polished, digitally shot landscapes. The sense of despair, conversely, is mostly rendered by close-ups and lots of graphic details. It keeps this level of schizophrenia very high, with beautifully choreographed action scenes that result in massive amounts of graphic detail, as well as postcards of the astonishing locations viciously, obsessively enriched with blood and various degrees of happily detailed internal organs. It's likely of one of those works who dare its viewers to watch. Hardy sounds like a clearer Bane, here.",
      "total_reactions": 1,
      "user": "walkabout_88"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2016
      },
      "score": 3,
      "text": "It has good production value, but I didn't find the plot nor characters to be very engaging. It's a long movie, all of which I found boring. None of it seemed believable and I had no investment in the characters. Just not my preference.",
      "total_reactions": 1,
      "user": "YoloSwag4Doge"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "Fine acting, fine landscapes, nice costumes and sets, but a very thin and an extremely slow moving story.  The movie length could have easily been cut by half and it would still move at a slow pace.  If you are not a connoisseur of cinematography and vistas or of triage of wounds, you will be bored, and that is a guarantee.  The ending fight scene is full of cliches seen hundreds of times in other movies.  Solid, but not spectacular, work by DiCaprio.  He will get his Oscar this year, mainly because of amazing work in his previous movies.",
      "total_reactions": 2,
      "user": "nj06"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "After a promising 1st act the \"The Revenant slows to crawl. There are too many scenes of survival that have nothing to do with the story. The film could have easily been cut by 30 minutes. Actually, the most interesting part of the movie was the Pawnee chief's search for his kidnapped daughter. Leonardo DiCaprio does grunting and grimacing well. He will win the Oscar, but any decent actor would have done well with such a meaty role. Alejandro Inarritu's direction of the battle scenes is exceptional. There is a realism in the opening scene, especially, that is unique. If only the story could have justified the movie's length.",
      "total_reactions": 2,
      "user": "RatedRex"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2016
      },
      "score": 5,
      "text": "Color me unimpressed.  The production value behind this film was its strong suit, with some beautiful cinematics, lighting, and a very apt soundtrack.  That said, I frequently wondered how individual scenes, and subsequently the film as a whole, would have benefitted from a different director.   The acting between the leads, particularly DiCaprio, was distractingly bad at points, bordering on comical, and the plot was poorly executed.",
      "total_reactions": 1,
      "user": "Judge_Redd"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "Nobody seems to even notice that the weather is lethally cold. They splash about in the freezing water and sleep under the stars with only a few blankets for cover...... acting as though they were in a movie!",
      "total_reactions": 4,
      "user": "gouldman"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "Смотрел нахаляву на одном сайте с нормальным графоном и озвучкой. Не очень понравился. Скучно было смотреть, но история привлекательная. Лео сыграл тоже хорошо. 5/10",
      "total_reactions": 2,
      "user": "Ki-Rich51"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2016
      },
      "score": 2,
      "text": "As an avid outdoorsman, The Revenant looked interesting but was a major disappointment.  The consistent illogical, unbelievable inaccuracies throughout the movie made it too distracting to enjoy the movie.  I don't know if directors are clueless about reality or just don't care.  Ok, it is a movie and artistic license is understood, but when dramatic effects trumps reality too often, it loses my interest.",
      "total_reactions": 1,
      "user": "FBHIII"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2016
      },
      "score": 4,
      "text": "Bearly entertaining. Good special effects in one scene. Good cinematography. Especially bad script especially in overall plot. Needed something to hold it all together. Movie proves that how a story is told makes a huge difference. Acting was not so good.",
      "total_reactions": 1,
      "user": "misterp"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2016
      },
      "score": 5,
      "text": "Saw the movie yesterday, I had mixed feelings about it, overall I find this movie empty.",
      "total_reactions": 1,
      "user": "TonyBurrito"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2016
      },
      "score": 6,
      "text": "Í´m disappointed, with all the hype and nominations that this movie had I felt the need to go see it, even on release date and with terrible seats for not planning it very well. And even if the acting, direction, shots and production value are there the characters are not interesting or fleshed out (except for Tom´s Hardy character), its not the actors fault that the script was boring and the pacing average at best.",
      "total_reactions": 4,
      "user": "Antonishere"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2016
      },
      "score": 4,
      "text": "Excuse...but I don`t understand why everybody kills everybody...yes the landscape an the film technique is great and the physically action of Leo...but...I surly don`t take a look at this film a second time!",
      "total_reactions": 1,
      "user": "Finix"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2016
      },
      "score": 5,
      "text": "First Act. Awesome, Last Act. Good. Directing and Cinematography is simply gorgeous and beautiful. Where this movie falls apart for me is the lack of interest continuing to increase during the second act of the movie. This particular act becomes unbearably boring and motionless. This movie would've been much better if the length was shorter. This movie lingers on way too long knowing that the story is simple and straight to the point.",
      "total_reactions": 1,
      "user": "will2econd"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2016
      },
      "score": 1,
      "text": "Extremely boring. Even with good actor play I just couldn't wait for it to stop. Beautiful nature shots are nice but not when they constantly cut the movie in pieces. 40 minutes after the beginning I was seriously thinking to leave.",
      "total_reactions": 1,
      "user": "Tigerium"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2016
      },
      "score": 5,
      "text": "In this anti-bear propaganda film, Leonardo DiCaprio brings acting of a caliber that would make zipping a fly look excruciatingly difficult.  The role of native american ventriloquist was expertly edited.  Tom Hardy brings to the screen an accent like has never been heard before.  The plot is very deep and requires effort to understand, with character development layered in so thinly you might think it isn't there.",
      "total_reactions": 2,
      "user": "brometheus"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2016
      },
      "score": 1,
      "text": "Wow. What movie have you all been watching??   Boring.  DiCaprio is dead, but no.  Surprise!  He lives!   And every time he is almost in over his head (!) he miraculously heals just that little bit more to keep going.   Oh-Oh - he is in a life-threatening situation!  How can he survive?  Being buried can't stop him.  Being beared can't stop him.  Being bared can't stop him.  Whatta guy!!",
      "total_reactions": 3,
      "user": "Zonker68"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2016
      },
      "score": 6,
      "text": "The Revenant isn't a bad film, but in my opinion it isn't really a rather good one. Despite very good cinematography the film is at most points in time simply boring, with the lack of any real speech leaving nothing to keep you entertained. At its most basic level it feels like action-documentary that forgot to put in a voice over. Sweeping landscape shots and quick moving action scenes don't make a movie by themselves.",
      "total_reactions": 1,
      "user": "tomlumborg"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2016
      },
      "score": 10,
      "text": "Hauntingly beautiful and absolutely incredible, The Revenant is a marvelous story of survival and how far one man will go to achieve it...along with a stellar performance by Tom Hardy as the antagonist this film, while intense and a bit stomach-churning and hard to watch...paired Sakamoto's score The Revenant will stay with you even after the final shot!",
      "total_reactions": 1,
      "user": "jblum1998"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2016
      },
      "score": 9,
      "text": "The revenant was my favourite movie last year, it has many good actors and a really good setting. Tbe Story is pretty good, the light effects are all real and the protagonist is Leonardo.",
      "total_reactions": 1,
      "user": "Tbag115"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "What a thrilling film.  The Revenant is a lot to take in, whether it's regarding the incredible scenery captured on film, the expertly-executed camera work, or the solid casting.  The Revenant works so well that it doesn't need a lot of dialogue to keep your attention over its lengthy 2 1/2 hours of runtime.  At times, there's heavy brutality, whether it be through a knife fight or a bear attack, that really made me turn a bit in my seat.  That kind of portrayal is definitely not for younger folks or weaker stomach.  I wasn't completely blown away by the movie, but I see why it had lots of Oscar consideration/victory this past year.  If you love survival against all odds in the name of settling a score, The Revenant is your movie.",
      "total_reactions": 0,
      "user": "SchroederRock"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "An exciting look at survival on the unforgiving American frontier. It's a visually stunning movie. One with exciting camera angles, beautiful scenery, and gorgeously depicted brutality. While the story ends up boiling down to a simple revenge tale the cast behind it is phenomenal. Bringing to life every emotion necessary to make things succeed.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2016
      },
      "score": 8,
      "text": "The Revenant is a very simple film about man versus nature and revenge. It's impressive and features amazing cinematography. Kudos for Leo for taking a lot of obvious real punishment while making it too. That can't have been pleasant!",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2016
      },
      "score": 2,
      "text": "I'll admit DiCaprio was very intense in this movie but not sure why it got such high ratings. it's not what I'd call \"entertaining\", the whole thing is rather dreary and depressing. in the end you also get the feeling DiCaprio's motivation was partly due to his political left leaning. it subtly regurgitates the old myth that the white man came to America and purposely wiped out all the native american indians. This is sad since even many history books don't tell the real story that the majority of native indians died of disease.",
      "total_reactions": 0,
      "user": "David_H"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "Honestly,  this was a bit overrated. It was still wroth watching, mainly for the action, the visual effects, and for Leonardo DiCaprio's legendary acting, but as a whole, it was kind of boring.",
      "total_reactions": 0,
      "user": "mrmonster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "The Revenant provides a captivating experience thanks to the natural look of the film combined with the committed physical performances from Leonardo Dicaprio and Tom Hardy and the brutal nature of the story.",
      "total_reactions": 0,
      "user": "Jack97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2016
      },
      "score": 9,
      "text": "It's very easy to tell from the moment you start this film that every little aspect of it is planned out perfectly. Everything from Cinematography,Directing,Acting etc. Almost the whole movie uses natural lighting and it's little things like that witch make this film so special. If you want to be blown away just do a little research on the film and you'll see the lengths they went to. All the main actors do a great job, especially Tom Hardy and Leo. Not many complaints can be made with this film,At times some acting felt odd and out of place but that's about it.",
      "total_reactions": 0,
      "user": "ToFewViews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2016
      },
      "score": 3,
      "text": "Well, most has been said already about this movie. Most importantly it just takes forever. It begins quite nicely, it grabs you but as soon as \"the painful part\" starts the whole thing goes down the litter. You will then have to watch a mix of DiCaprio grunting in pain and some nice scenery with a not much more exciting vision here and an indeed much more exciting scene containing Tom Hardy there. Really, Tom Hardy made the movie. If it wasn't for him I probably wouldn't have watched it till the end which I still somewhat regret because it was so damn long.",
      "total_reactions": 0,
      "user": "Hide"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "7.5 for this one leonardo and tom are both just great actors and it shows in almost every movie they have been in. The revenant is a story of survival and revenge, some of the scenes in it are fantastic and other feel a little drawn out. On the whole definitely worth seeing just could have been shorter.",
      "total_reactions": 0,
      "user": "notlaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2017
      },
      "score": 7,
      "text": "\"The Revenant\" is \"The Grey\" done right. It's about a guy by the name Hugh Glass a member of a hunting party with his son. Util one day Glass get's attack by bear which leads to him being left for dead by a member of his hunting party. The journey that glass goes on is intense and full of great character development. Yet the movie does make the journey a little to long. If you are looking for your typical action movie when you watch this film, you will be disappointed, but if you are looking for movie that is intense on every way and form then you will enjoy this film.",
      "total_reactions": 0,
      "user": "darkbloodshed13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2016
      },
      "score": 7,
      "text": "Leo Di Caprio's performance - amazing and Oscar worthy. The movie itself - good but not that great and certainly not Oscar worthy - only great thing about movie itself was the shots of the nature and the cinematography.",
      "total_reactions": 0,
      "user": "Ralfbergs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2017
      },
      "score": 9,
      "text": "It had a very beautiful setting, nice camerawork, and brilliant execution.  It is a bit slow, but this is one of those cases where the journey, not the destination, is the point.  Also, it is quite gory at times.",
      "total_reactions": 0,
      "user": "tethysdust"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2016
      },
      "score": 9,
      "text": "Wow, what a movie!  Takes place back when the US was wilderness.  Hunters and trappers were the leading edge of civilization.  Their lives are rugged, tough, dangerous, no wonder the life span was 30 years old.  Our hero is attacked by momma bear, YIKES, I still don't know how they filmed that!  The villain is a little psycho.  Makes for a great contest of wills.  There's other subplots that converge at the end.",
      "total_reactions": 0,
      "user": "smiyamot"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2017
      },
      "score": 4,
      "text": "Appart from the terrific performance by Leonardo DiCaprio, 2016's Oscar Winner, the movie is just about violence, violence and more violence. In almost two hours you'll see animal guts, tribes and commercians conflicts and explicit blood. If you're that big on these sort of movies, then you'll probably like it, but I'm talking about all-ages experiences. By the way, it has a great costume design and a great developed environment. But that's not a win-win, I think it has its own deficits and exagerations... (42%)",
      "total_reactions": 0,
      "user": "DavidTejada"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2016
      },
      "score": 6,
      "text": "Leo is my favorite actor. See all of his films. Don't think he should have won the AA. Too little dialogue. Very realistic film. I'm sure the old pioneers were as violent as portrayed. Survival of the strongest in a wilderness that took no prisoners. I know about dramatic license but I don't think the human body could take the damage that Leo's character and survive in the brutal cold.At the end of the day, do you want to be entertained by a movie. If you do, don't see this one. Its a good film that is not enjoyable to watch.",
      "total_reactions": 0,
      "user": "yosemite"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2016
      },
      "score": 9,
      "text": "Wide shots of the rugged wilderness and intense acting without much dialogue. Dreamlike flashback sequences remind me of Terence Malicks beautifully shot The Three of Life and Thin Red Line movies. First the camera moves within the action and in close proximity of the actors and then pans out to show the majestic landscapes still untouched with civilization. Great soundtrack and audio design too, emotions are translated to the audience with music, facial expressions and weather more than mere words. Improves greatly when seen in the big screen rather than smaller home television.",
      "total_reactions": 0,
      "user": "Turms_of_Alps"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2017
      },
      "score": 9,
      "text": "It's a long film and a long journey for the main character, and at the end you feel privileged to have been there with him.  So breathtaking and enthralling and entertaining,  brilliant storytelling,  and the director draws you in like all great films do.  The scene with the bear is nothing like you've seen before, and from the very first minute,  this film gets your attention,  you know you are watching a cut above the average  brilliant film.",
      "total_reactions": 0,
      "user": "Thejudge21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2016
      },
      "score": 7,
      "text": "The Revenant is one of the most realistic movies ever produced. It is incredibly gripping, full of beautiful shots, and very dark with outstanding performances by Leo, Tom Hardy, and the rest of the crew. It must be understood however that those looking for a 1800s action thriller will be disappointed as it is simply not that kind of movie, nor was it meant to be. This is simply a story of redemption and revenge, and survival against all odds, and while it has action the majority of the movie consists of Leo walking around just breathing between the action scenes. It is a very slow paced movie, which adds to the realism in many ways and allows for awe inspiring shots of the landscape. The fight scenes are incredibly realistic and refreshing as it is no longer simply a bunch of choreographed punches and well timed hits like all Hollywood films, but rather all out brawls that look unorganized and lifelike. The only faults I give it are that the movie doesn't have a consistent pace, as in the beginning we couldn't miss a character blink and the final 10-15 minutes cover like a 1-2 day period. Also at times there are scenes that are too long and unimportant. You'll spend 3 minutes watching Leo slowly ascend a hill just to see bison run around on a plain. Despite these flaws the Revenant is a movie definitely worth the watch, and rightfully delivered Leo is first Oscar award for best lead actor",
      "total_reactions": 0,
      "user": "LoveeLand"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2016
      },
      "score": 5,
      "text": "Well done production-wise, and good acting I guess (even though there's rarely someone for Leo to interact with). But there was too much just watching horrible **** happen to the main guy. Also some unbelievable plot points. Riding a horse off a cliff, but saved by a pine tree? Come on, the guy shoulda been dead halfway through. Lost points for halfhearted mystical bull**** as well.",
      "total_reactions": 0,
      "user": "GoTV32"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "\"The Revenant” is a gorgeous, brooding take on Hugh Glass’s tale of survival in the American hinterlands. The film envelopes us in the story, making us feel like we are there with the characters. Though, it does drift too much during the second half. Nevertheless, it's still an intense, brutal, and, at times, moving film experience. And Leonardo DiCaprio is in top-form, giving the most committed, physically demanding performance of his career.",
      "total_reactions": 0,
      "user": "JonathonB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2016
      },
      "score": 7,
      "text": "Esta bien, pero no es pa tanto. En otras palabras, un pedo al viento.",
      "total_reactions": 0,
      "user": "AngusBarbudez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2016
      },
      "score": 9,
      "text": "Featuring DiCaprio's Oscar-winning performance, The Revenant is a powerful survival story fitted with stellar direction, solidly crafted action sequences, one-of-a-kind performances, and, above all, absolutely gorgeous cinematography.",
      "total_reactions": 0,
      "user": "Muskrat147"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2016
      },
      "score": 10,
      "text": "''The Revenant'' is everything i love about great cinema. Most definitely the best movie of the year.",
      "total_reactions": 0,
      "user": "CalibMcBolts"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2016
      },
      "score": 10,
      "text": "In Comparison to Innaritu's previous movie, Birdman, and to its most severe rival in Oscar, Mad Max, The Revenant was so pleasing from directing to cinematography to DiCaprio's brilliant performance. I liked it fine.",
      "total_reactions": 0,
      "user": "Farsheed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2016
      },
      "score": 10,
      "text": "A chilling story  with some of the best acting i have ever seen in my life the Revenant is a real work of art. The fights are realistic so if you do not like blood in movies this is not the film for you but if you like realistic action this would by a great film to watch. The pacing of the film only makes it more thrilling with berth taking cinematography this is a most see!",
      "total_reactions": 0,
      "user": "Bob198"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2016
      },
      "score": 9,
      "text": "‘The Revenant’ is the survival story of the legendary trapper of the 1800′s, Hugh Glass (Leonardo DiCaprio). The film sets off following Hugh and his group of trappers collecting pelts for trade. This group is led by Captain Andrew Henry (Domhnall Gleeson) and also consists of fellow trappers, Bridger (Will Poulter), John Fitzgerald (Tom Hardy), and also Hugh’s son, Hawk (Forrest Goodluck) among many others. While the group is in the process of collecting pelts, they are suddenly attacked by a local Native American group, causing them to collect what they can and escape the attack all the while losing many men part of their group. During their retreat, the group devises a plan that keeps them as safe as possible from further attacks while also creates a long and dangerous trek for them to take on the way to civilization. While on their journey to safety, Hugh is mortally wounded by an attack which puts him near death. The group is then faced with life threatening decisions in regards to what to do about Hugh, where to go, to split up or not, and many others but regardless of the decision, the story now focuses on Hugh and his survival as the audience witnesses him go to great lengths rarely ever seen before to live and ultimately get revenge for certain decisions made by members of the group.",
      "total_reactions": 0,
      "user": "Oberrated"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2016
      },
      "score": 8,
      "text": "A complete example of a movie of thriller. Done well from his beginning and end, The been reborn one is of these movies that you cannot stop seeing...",
      "total_reactions": 0,
      "user": "2016"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2016
      },
      "score": 10,
      "text": "This is one of my new favourite movies. Its got a great script, great cast, great performances, great set design, great action, great music, and AMAZING cinematography. I absolutely love the cinematography of this film. The fact they kept the camera so grounded and relied on long shots really made me feel connected and immersed to what was happening on screen. It gives the film an extra layer of grittiness that really helps it to shine. A must see film for any film buff.",
      "total_reactions": 0,
      "user": "MasterRiley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2016
      },
      "score": 4,
      "text": "The most interesting (and probably only significant female) character) in this leaden macho melodrama is the mama bear.  The rest is Werner Herzog rip offs (trying to recreate the grueling filming of Fitzcarraldo and showing us the thing that Herzog doesn't show you in Grizzly Man), overindulgent camera work and a plodding, flat script.  Oscar-bait written all over it, there is little story or character development. deCaprio fails to make you forget that he is deCaprio ACTING his most Oscar worthy and doing this film to pretend like he is in a situation that in reality he would not have the first idea what to do in, with a crew waiting with a blanket and a hot drink nearby. Voyeuristic, grim and pointless.",
      "total_reactions": 0,
      "user": "moviedoc24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2017
      },
      "score": 9,
      "text": "This is probably one of the most beautiful movies of all time. The cinematography is gorgeous and puts the viewer deep into the characters' perspectives.",
      "total_reactions": 0,
      "user": "SomePersona"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2017
      },
      "score": 2,
      "text": "Beautifully filmed, boring as hell.  Thank God I tivoed the movie.  It cost me nothing other than 2+ hours of my life. Fortunately, the movie required little attention be paid and I enjoyed a book.  Don't tell me I don't understand movies.  This was a complete waste of time.",
      "total_reactions": 0,
      "user": "Kmg6163"
    }
  ]
}