{
  "mc_avg_user_score": 6.2,
  "mc_metascore": 33,
  "mc_mixed_rating_frequency": 46,
  "mc_movie_name": "The Mortal Instruments: City of Bones",
  "mc_negative_rating_frequency": 91,
  "mc_positive_rating_frequency": 167,
  "mc_pro_critic_reviews": [
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 67,
      "summary": "Make no mistake, there will be a sequel. Clary may not wind up having the same pop-culture impact as Bella and Katniss, but like it or not, this won't be the last time you hear from her."
    },
    {
      "critic": "Bruce Ingram",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 63,
      "summary": "Everything chugs along briskly and reasonably entertainingly until running off the rails a bit with a wildly overcomplicated finale."
    },
    {
      "critic": "Mark Jenkins",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Aside from the giggles induced by the romance-novel bits, the movie's principal hazard is exhaustion. There are too many characters, and too many of them spend too much time morphing into something else. Five more like this? That would be demonic."
    },
    {
      "critic": "David Hiltbrand",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Though imaginatively directed by Harald Zwart, Mortal Instruments, which is adapted from Cassandra Clare's YA novels, is marred by significant flaws."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "The movie﻿ blasts by for a while as an odd and busy slice of highly watchable garbage."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "The storyline is at times muddled and incoherent. This won't bother readers much since they have the \"inside track\" on what's happening. Then again, the narrative is so predictable that maybe it doesn't matter."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Borrowing every single component of its complicated plot from other sources, The Mortal Instruments is hodgepodge claptrap, but there’s a faint flicker of fun in its introducing-the-world passages."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Start with a heaping helping of \"Buffy the Vampire Slayer.\" Throw in some \"Percy Jackson,\" a dash of \"Twilight,\" a spoonful of \"The Vampire Diaries\" and a sprinkling of \"Harry Potter,\" and you end up with The Mortal Instruments: City of Bones."
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "There are elements worth celebrating. The movie is thankfully less self-serious than the mopey “Twilight” films. The Mortal Instruments revels in its own camp.  But there is plenty of room for improvement. The action flick is overly long, complicated and, even by teen romance standards, cringe-worthy in its cheesiness."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "If you love exposition and shapely if bland young actors in leather, skinny jeans, knee boots, Goth cocktail dresses and heavy eye makeup, this may be the movie for you."
    },
    {
      "critic": "Curtis Woloschuk",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "As for some of the big reveals, viewers will see them coming from a galaxy far, far away."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "This initial “Mortal Instruments” picture has the vibe of a straight-to-video release from the mid-‘90s, except with a $60 million budget and considerable special-effects expertise."
    },
    {
      "critic": "Helen O'Hara",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "Apparently unable to decide whether to take its own mythology seriously or not, this is a mess of sculpted cheekbones and incoherent romance."
    },
    {
      "critic": "Anna Smith",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "It’s a potent mix for young fans that gets off to an entertaining, action-packed start with bursts of knowing humour. But it’s soon bogged down by an increasingly convoluted plot, an overindulgent running time and absurd dialogue."
    },
    {
      "critic": "Michael Rechtshaffen",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "Despite the overstuffed assortment of vampires, werewolves, warlocks and demons of all shapes and sizes, The Mortal Instruments seldom feels like anything more than a shameless, soulless knockoff."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "A ludicrous, borderline-nonsensical supernatural concoction with a slightly redeeming sense of its own silliness."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "Too much of the film feels like shorthand, a trail of teasing crumbs to lead us to the inevitable sequels."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "There’s so much bouncing around in tone and story that this film never really finds its footing. It flounders around trying to figure out what it should be, and never really settles on anything."
    },
    {
      "critic": "Genevieve Koski",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "There’s a germ of something interesting and different within the film’s narrative tangle, but it’s unfortunately been subsumed by Hollywood’s dedication to replicating previous successes."
    },
    {
      "critic": "Sarah Bryan Miller",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 38,
      "summary": "That can’t disguise the script’s complete lack of wit or originality, though, or the generally wooden acting."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 38,
      "summary": "Though it has flashes of promise, Bones traces the footsteps of its fantasy film predecessors too closely to blaze anything close to an original narrative."
    },
    {
      "critic": "Louis Black",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2013
      },
      "score": 30,
      "summary": "Not only have we seen this all before, but we were probably hoping to not see it again."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2013
      },
      "score": 30,
      "summary": "City of Bones isn’t the worst of its kind, but crap served with flair is still basically crap."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 30,
      "summary": "The Mortal Instruments: City of Bones is just a sloppy rag bag of ideas cobbled from other stories."
    },
    {
      "critic": "John Oursler",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 30,
      "summary": "The nomenclature varies slightly, but there's little new or exciting in City of Bones. For strong female role models and unique fantasy settings, stick with The Hunger Games."
    },
    {
      "critic": "Simon Abrams",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 25,
      "summary": "These kids have to contrive magical pretexts just to lay hands on each other, and boy, are their excuses rotten."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 25,
      "summary": "No matter how good The Mortal Instruments: City of Bones looks, it's hard to really care about anything that's going on, and not just because we could barely understand it."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 25,
      "summary": "Every moviegoer will have his own breaking point, when The Mortal Instruments: City of Bones surpasses the mundane and enters the ridiculous."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 25,
      "summary": "Within this bloated fantasy hodgepodge, there are few grace notes: In the role of the creepy fortune teller, Madame Dorothea, CCH Pounder is evil fun. And a few special effects, including a Rottweiller who turns into a skinned hellhound, leave an impression. Otherwise, Mortal Instruments manages to occupy 130 minutes of frantic, numbing, activity."
    },
    {
      "critic": "Laremy Legel",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 25,
      "summary": "This is a story that has everything you’re looking for, provided that you’re looking for absolutely nothing."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 25,
      "summary": "The Mortal Instruments: City of Bones hopes to be the start of a new franchise for tweens and Twihards, but the twuth is this twash is anything but a twiumph."
    },
    {
      "critic": "Francesca Steele",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2013
      },
      "score": 20,
      "summary": "This is film-making at its most cynical. But none of it actually makes much sense."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 20,
      "summary": "This one is by far the worst of the “Twilight” copies. And when that bunch includes “The Host” and “I Am Number Four,” that’s saying something."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 20,
      "summary": "The plot is an incomprehensible tangle of dead ends and recaps."
    },
    {
      "critic": "Matt Patches",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 20,
      "summary": "If only the fantasy surrounding her made a lick of sense. Here, the Muggle types are known as the “Mundane.” An apt label for a wanna-be franchise with plenty of sheen and nothing to say."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "wow, take Constantine, mix it with twilight and add some Buffy the vampire slayer, what you get is a poor excuse for a movie, with action scenes that are all over the place and 2 main characters that you just don't give a damn.",
      "total_reactions": 2,
      "user": "lordslayer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "This film doesn't catch you. I read the book and it's so good, I love it, but the film doesn't translate the great history of the book to it. I don't recommend this movie, it's so bad, it changes ALL of the book. Almost all actors don't catch the feelings and personality of the real characters. The end is the worst part, the beginning is normal. I hope they cannot do the sequel of it",
      "total_reactions": 1,
      "user": "Galletonn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2013
      },
      "score": 1,
      "text": "I read the first book and unfortunately that is as far as I will go with the series. This movie was a big disappointment for me. The story line was jumbled and sections of the book were moved around and important parts were completely omitted. The end was nothing like it was supposed to be and I was overall let down by the movie",
      "total_reactions": 1,
      "user": "Rachelb1992"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2013
      },
      "score": 2,
      "text": "Really disappointed. The books were much better. They took a lot of small important details that made the books great out of the movie and crammed it all together. A person who hadnt read the books couldnt even get into this garbage.. I waited forever for this (horrible) movie. If i were the author id be ashamed, they  ruined her books.",
      "total_reactions": 1,
      "user": "Aknb47"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "The books are always way better than the movies hands down, but I have to say that I really enjoyed the movie. It has been a while since I read the book, so I am not sure if they left out any important details. I was a bit worried when I saw the preview, but I have to say this is way better than Twilight and if I didn't have a child I would be seeing this a lot more then one time in the theatre. I am very annoyed by the critic's reviews because they have clearly never read the book. This is one of those movies that if you haven't read the book you will not understand the story.",
      "total_reactions": 10,
      "user": "JTSTmommy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "The critics are nuts. This is nothing like Twilight! Though if you want to compare it t others it is a cross between Harry Potter, Star Wars, Buffy the Vampire Slayer with a little bit if Dungeons and Dragons. And yet it is NOT those  and is an enjoyable movie all around. It is an excellent action-fantasy and is very funny without being a comedy. I highly recommended it!",
      "total_reactions": 5,
      "user": "Marceline"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "it's amazing, I love the books and the movie was perfect, everybody should watch more soon possible and please ignore the most critical and comparisons, really worth watch",
      "total_reactions": 12,
      "user": "Raissa_Silva"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "You critics don't know what you are talking about. Lets get one thing straight, Twilight does not rule any other supernatural movie franchise. So stop comparing it to The Mortal Instruments etc. Twilight was a love story. TMI is much more than that. As far as I can see if you don't love sci-fi, action, romance, comedy, fantasy in one novel and movie. It's not for you. But don't bash it because it didn't meet your needs. TMI will always have it's book fans and they will grow from fans of the movie and be supported. Shadow Hunters are not going anywhere. Oh and to the person who said that Cassie stole ideas from other novels/movies. Why are you not bashing every vampire, werewolf, witch etc. film/tv show or book made? Those ideas were ledgends already here before you were born. So no one stole any 'idea'. I love the books and the movie. x",
      "total_reactions": 8,
      "user": "Lunabelle"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "If you have read the book, you will love this movie. Harald Zwart has managed to create basically the book on the screen. With including all the important scenes (they switched the order but still included it all), it made it a very enjoyable movie to watch as a fan of the book! However, if you are not a fan of the book, it may be a bit confusing. Some of the exposition given by Magnus was boring and it dragged the movie a bit but overall, I believe they did a good job! So if you can ignore some script awkwardness and a bit of story dragging, I think you should go out and watch the movie because I am personally looking forward to the next one!",
      "total_reactions": 20,
      "user": "Stephmiko"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "I'm rating  this based purely on how much I liked the movie.  If I focused on plot gaps or script awkwardness, my rating would be much lower.  However, I watched this (yes, I actually watched it it, unlike, I suspect, the writers of earlier user reviews) purely for kicks.  The kick of a hot young cast, with hot older supporting actors, battling it up fantasy-style in New York.  The CGI was impeccable, the action fun, and the script mostly not cringe-inducing.  That is more than can be said for your typical YA movie.  All in all I got what I came for-- fun.",
      "total_reactions": 12,
      "user": "jikky"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Surprinsingly a great movie. I went to watch it expecting another twilight wannabe, but in the middle of the way I was completely sold for this. I can't wait for the next movie.",
      "total_reactions": 6,
      "user": "WalissonOliver"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "I know people don't want to hear this, but lets the facts, it's a combination of \"Twilight\", \"Harry Potter\" and possibly other books series that you might have loved. There's nothing new here, it's just the next big teen movie. If your a girl and love \"Twilight\" then you'll absolutely adore this movie. If you're like me and were disappointed with its lack of originality, then you'll probably hate this movie. Overall, it's from book series that you've read before. Be sure to check out my YouTube channel \"TheMovieManLife\".",
      "total_reactions": 6,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "This below par book adaptation is not only poorly acted, miss-cast and badly adapted it barely resembles the story. The humour is gone, the chemistry is lacking and the best aspect of the book (ie the reveal of this unseen world) is glossed over. Only truly delusional fans of the series will praise this mess.",
      "total_reactions": 6,
      "user": "RougePanda"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "I'm glad I don't listen to the movie critics and give this movie a chance. I haven't read the book yet, but I enjoy the movie, love the story, even though it's not perfect. There is a part that I don't enjoy so much, i think they should change the script writer. And a song by Demi levato, kinda ruined the mood of the movie, which is more goth and moody. But overall I like city of bones, and I'll loved to watch city of ashes if they make the sequel. There's a lot of potential, they only need to work it better.",
      "total_reactions": 3,
      "user": "hotelier777"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2013
      },
      "score": 0,
      "text": "I loved the book I was so happy there was movie coming out. So I went to see it when it first came out and I was devastated the movie was awful and nothing like the book everything was changed I hated it. Way to ruin a book and it's characters.",
      "total_reactions": 3,
      "user": "mybabymichael"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "The movie it's entertaining, it got holes in the storyline, and its a little bit different to the book. However, its not something that we haven't seen before, but its enjoyable and you will have a good time watching it. And besides, it's a movie for the youngest people, for the fans of the books, not for an Academy Award.",
      "total_reactions": 14,
      "user": "Danniquima"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "A great book-to-movie adaptation of an already much-loved book series. The cast is amazing and so is the plot which has no more than a few changes to it compared to the book.",
      "total_reactions": 21,
      "user": "Pattz25"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "The book will be a massive hit with book fan base, although it has a fast past plot and  skips out some details and relieves  some details too early. It is not just a film for teen girls. It has many leading male characters and has plenty of action.",
      "total_reactions": 13,
      "user": "natasha_rice"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2013
      },
      "score": 0,
      "text": "I went in to City of Bones thinking it was going to be a terrible movie, but it turns out I was wrong, it was worse. Before we get too far into the review, I will say that I have not read any of the books so there will be no comparison at all in this review. The film straight out rips off Twilight, Harry Potter, and Buffy the Vampire Slayer, all at the same time. You would think that with all these good ideas already existing they could put together a pretty good movie, but I found myself already tired ten minutes, in with another 90 minutes to go.",
      "total_reactions": 13,
      "user": "AlexProductions"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "As a fan of the book, I found it really great. The scenes and the cast was perfectly catch from essence of the books (of course the book is way better than the movie, but as a fan, I can say that they tried so hard to be loyal to the source). Somethings are really missing, but I hope the director put it on the second. I had a good time watching it. And as a have read here, it's a movie to the fans and the young people, or everyone who likes this kind of story.",
      "total_reactions": 20,
      "user": "IagoM"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "Very good book adaptation, all the actors protrayed the characters very well. The special effects linked to what was described in the book.  Overall a very good movie and would gladly see it again",
      "total_reactions": 5,
      "user": "Laurenwilcox97"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2013
      },
      "score": 1,
      "text": "The movie is a complete mess. And this is coming from a major teen fan of the book series. I never got into the twilight series or hunger games series much but once I started reading these books, I couldn't stop. The books were fascinating and followed a clear story line. But the movies, they just flipped from one book to the next and added things that NEVER happened in the books! The rune? That was made up. She made a binding rune and destroying rune, not a freezing time rune. Summoning the demons? That happened in the plains of Idris. Not the Institute. The fake cup? Um no. He got the real thing and summoned the angel. One minute, they were kissing (First book, chapter 11 or 12)and the next, Valentine had the cup. (Book 2 or 3). If they make a sequel, I sure hope it's a clearer story line.  I do give this movie a one for it's humorous parts. Just remember, this is coming from a teenage girl.",
      "total_reactions": 5,
      "user": "jaimerice"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "I liked the book a lot, after having just seen the movie, i have a red hand print on my face from the constant face palms i gave myself. I knew going in that not everything would be like the book, but this was bad, like \"Eragon\" bad. (Eragon was such a bad movie adaption they couldn't make the sequels)",
      "total_reactions": 9,
      "user": "MustangMatt07"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "This is where I start stressing the importance of opening week/end. It’s very important that you see The Mortal Instruments: City of Bones opening week/end  Wednesday through Sunday. We need this film to do well in the box office the first week to ensure future movies. You want to see more Mortal Instruments movies, as well as Infernal Devices movies, right? Then go see The Mortal Instruments: City of Bones multiple times this week and bring your friends and family with you and keep spreading the word. It’s time to show the mundane world that the Shadowhunters are indeed a force to be reckoned with. As Jace says, “Have a little faith!”",
      "total_reactions": 11,
      "user": "francis007"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "In the end, The Mortal Instruments: City of Bones is yet another would-be franchise trying (and quite likely failing) to fill the post-Twilight void. Even with a richer, darker, more action-packed premise; a more intriguing world; and a cast featuring some quality UK thespians with actual acting chops in the leads, there is just no denying that the story and the movie are both sub-par, forgettable  and worst of all, crushingly boring by the end. Bury this one under a city of bones, and tell the cast to seek more lively pastures.",
      "total_reactions": 14,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "I loved it, and I read the book.  I thought everything was great, the set, the props, the acting, and the cast.  The plot might of be iffy with Valentine, but I think if everyone tries hard in the next movie to make it as close to the book as they can, it will turn out great.  This is not another Twilight romance!  Twilight was a romance story, this is a full on story, and like any other good book, has some romance in it.  A lot of the big critics are just sick of seeing fantasy movies, well get over it because fantasy and sci-fi will never stop with teens and tweens.",
      "total_reactions": 8,
      "user": "awesomeness274"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "Great book to movie adaptation. My husband never read the books, found the movie \"better than expected\" and \"will definitely see the squeal.\" It could be hard to catch up with the new terminology and a little jumpy- always room for improvement. The cast was picked perfectly and caught their personalities very well. Altered a piece of story so i'm not sure what to expect next. Won't be as big as Hunger Games, but better than Twilight. Try to see it at least once!",
      "total_reactions": 6,
      "user": "aaflowers12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "I am a huge fan of the books so the movie is a no brainer. Its the bestbook to movie adaptation I have ever seen. So much better than twlight and  Jamie as Jace is perfect cannot wait for the second one.",
      "total_reactions": 4,
      "user": "soulsurvivor911"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "The movie is audacious, comparing to other teen adaptations. The acting is really something that highlights this franchise. All audiences will like it.",
      "total_reactions": 4,
      "user": "kbrinu"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "I was satisfied with the adaptation, as a fan of the books I had my hopes a little up. I liked it very much and I am looking forward for a sequel, though I am hoping they improve one thing or more. I was a little disappointed by some of the cast performances, specially Magnus Bane.",
      "total_reactions": 4,
      "user": "Paula97"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "I absolutely loved this movie. The books have a great story line and I think the director did a wonderful job at displaying that in the film. I don't think that there were too many twists in the movie. I found that the entire time I was watching it I wanted to know what happened next. Where as usually I don't get that interested. I don't know exactly what about the movie,critics didn't like but the only things that I have heard bad about it is that it had too much crammed into it. I feel just the opposite. I have read the books and if anything they could have added more to the movie. I like to watch movies that keep me entertained not bore me to sleep. The whole point of having a young adult book or film is to have a really great story line so you keep your readers into it. And I don't care what anybody else thinks this movie had a great story line!",
      "total_reactions": 4,
      "user": "crystalgenovese"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2013
      },
      "score": 1,
      "text": "The book is the good, but the movie is... awful. Bad performances, regular cast, terrible script, the only good are the effect, but the rest is terrible. The Mortal Instruments: City of Bones is bad, bad, bad...",
      "total_reactions": 4,
      "user": "MarkDetrel"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "I was expecting this movie to be a lot worse then it was. I enjoyed watching it the same if not more then reading the book. Yeh they changed a few things but nothing dramatic enough to change the plot. There was only one part that I felt could have been done better, but even then it was entertaining to watch. Other then that I loved this movie! I really hope they make a sequel.",
      "total_reactions": 2,
      "user": "nicp2112"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2013
      },
      "score": 1,
      "text": "Probably one of the worst movies I've seen in a long time, how there are some people who have given it a 10 is beyond my comprehension.",
      "total_reactions": 2,
      "user": "Abnuggler"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2013
      },
      "score": 0,
      "text": "This movie was the worst book to screen adaptation I have ever seen like, it was worse than Eragon they could have could have continued with the inheritance series movies but they chose not to, it is aso like the Percy Jackson movie they pull things from other books I mean sure its little things but still its enough to ruin the movie for you if you have actually read the books. So I don't think that Cassandra had any say in the writings for the movie what so ever and I'm pretty sure that they are supposed to consult the author of the book for her ideas on how she wants it. The only part about it that I liked was the midnight flower scene, I think that that is the only thing that they got right. Also I would have went with a different actor for Jace and Alec. So in conclusion I don't think that they should make the second book into a movie, and I'm sure that after seeing the first one Cassandra won't sell the rights to the second book. That was the only reason that they didn't continue with the Eragon movies.",
      "total_reactions": 2,
      "user": "Fairchild2300"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "The writer of this series of novels (and this subsequent movie) is cashing in on all the fantasy tropes: demons, witches, vampires, werewolves. A young woman (Lily Collins) becomes intertwined with Shadowhunters, who are out to save the world…but wait, she's also torn between two handsome men…starting to sound familiar? The maze of characters just gets ridiculous. There are some cool fantasy concepts and special efx, but the plot is cluttered and the action is unfocused. There must be an audience with the book fans, but for everyone else, it's just a flashy mess crammed with complications.",
      "total_reactions": 7,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "this movie is more than amazing and its a really goooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooood adaptation better that Harry Potter and Hunger Games, i will not mention twilight because f*ck twilight, The Mortal Instruments:City of Bones is really gooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooood, very recomended",
      "total_reactions": 7,
      "user": "lalo2000"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "So I'm going to try and write a review that doesn't contain a plethora of grammar mistakes that make me look like I'm from a third world country and actually discuss why this movie garnered a whopping 2 out of 10.",
      "total_reactions": 7,
      "user": "Steamcausedthis"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "Awful scenario  stupid dialog  disaster in a fiction! Yeah, action is good, but it's nowhere near enough!  City of Bones  is too long (too boring), mediocre movie at best.",
      "total_reactions": 5,
      "user": "PStakhiv"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Don't pay attention to the critics. The Mortal Instruments: City of Bones was a really good adaptation of a fun and well-written YA Fantasy book.",
      "total_reactions": 11,
      "user": "knm"
    },
    {
      "neg_reactions": 16,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "The book is not so good... The movie is even worse!",
      "total_reactions": 25,
      "user": "Mores"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2013
      },
      "score": 0,
      "text": "Biggest flaw of the film  Terrible script. It explained nothing, You seriously did not learn the characters until a good 20 minutes into it. It was so difficult to follow because you had no idea what was going on. Completely ruined the film. Even then, The acting is so-so and it was supported by poor actions scenes. How do people like this trash?",
      "total_reactions": 6,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "I loved the book and I loved the movie! I don't know what all of these critics were watching but I would see this movie 10 times over!! It was AMAZING!!! So worth it!",
      "total_reactions": 6,
      "user": "amiami"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "Completely derivative movie where nothing pays off or even makes much sense. A series of things happen in this movie though it is all flat, shoehorned, and copy/pasted from other, better, films. Attempting to hide poor writing and utter nonsense behind the \"this is a book for kids\" defense is insulting to actual good movies and children everywhere. One point for offering some of the most unintentionally hilarious bad movie moments in recent memory.",
      "total_reactions": 3,
      "user": "Folstar"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2013
      },
      "score": 1,
      "text": "Well... once again a piece of derivative garbage is vomited across screens around the world. It's sad that this will be occupy theatres instead of films far more worthy. Please don't waste your time.",
      "total_reactions": 3,
      "user": "PaperThing"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "I don't know about the critics but this is a franchise based movie, with the majority of it's audience already being avid fans of the books. While it doesn't make much sense to the mundanes, let me assure you it makes total and perfect sense if you cared enough to know the back stories.",
      "total_reactions": 7,
      "user": "FandomFanatic"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "It's fun, full of action and the effects look awesome. The young actors are as amazing as the older one, and we have the always amazing Jonathan Rhys Meyers, Jared Harris, Lena Headey and CCH Pounder in it!",
      "total_reactions": 8,
      "user": "laismalek"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 3,
      "text": "So I do not often agree with the critics... I usually agree with the users, but I must say this movie is not one that I would recommend unless you are a teenaged girl in need of some dark Gothic type of  romance, then I might possibly  see some merit to this movie. The acting so so, story line so so, and special effects just o k. If you are a young man I would recommend that you do NOT attend this with your teen girlfriend you may wish you had not spent the money or the time....",
      "total_reactions": 4,
      "user": "ricksroses"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Surprisingly interesting, in a world where 'Percy Jackson's' are released every year, and say by the way are nothing exciting, 'The City Bones' is at least worthy of respect and attention.",
      "total_reactions": 2,
      "user": "khutch"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "I haven't read the series, but I just finished watching 'The Mortal Instruments': 'City of Bones' and Loved it.  I wish there were more supernatural movies.  Its unfortunate that book lovers slam some movies that are based on the Novels they have read.  When it comes to novels being produce into movies it's hard to make readers happy.  Maybe that's why I'm not so much into reading as much as I am into watching a great movie or two, or three, (Trilogies Rock) I like to believe I have a pretty great taste in movies and this one should definitely be on everyone's  watch list.  Looking forward to watching this trilogy and will pray and hope it does not get cancelled! GO TEAM GO! I have faith you will get more followers!",
      "total_reactions": 2,
      "user": "SlyckNickChick"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "I loved this Movie, there were Great Effects Good Action Scenes, Comedy and Romance. It makes no sense why there are so many Bad Reviews. This Film is so differant then any other Films out there and People need to Stop comparing it to Harry Potter and twilight cause there is nothing to compare. Me and my Sister loved this and can't wait for the Sequel. This Movie was very enjoyable.",
      "total_reactions": 1,
      "user": "MusicGurl8192"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "I couldn't believe when I saw what score this movie got with the critics. I thought it was excellent and well put together. Special effects were great, acting was great. story line was great, etc. I don't know what all the hate is about but personally I can not wait for the second one. I get this genre isn't everyone's \"cup of tea\" so to speak but come one people, give it some credit!",
      "total_reactions": 1,
      "user": "lelefoxx00"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "I saw the movie twice in the cinema and loved it both times and I've read all the books, all the cast in the mortal instruments city of bones are extremely talented I just can't understand why people don't like it  it was full of action, romance, comedy and bits of horror it was an all genres film that everyone likes. I loved the cast in the film, especially Jamie campbell Bower he is extremely talented and very successful",
      "total_reactions": 1,
      "user": "Jade_C"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "this movie is great, i really do hope they make the series! would love to see the other movies in future! i would imagine them doing really well, if you think that this movie was a bad one, then you wait till the whole sequels come out, i'm sure you will be changing your minds.",
      "total_reactions": 1,
      "user": "sivvie"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "Loved it.. I was straight to the book store for the rest of the books so I could find out what happened next. Jamie and Lily were amazing, but I knew Jamie would be great just like in Twilight, really impressed with Lily. Totally fell in love with it.",
      "total_reactions": 1,
      "user": "twilightnutter"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "First off I have to say, I absolutely adore the books (beautifully written by the way) so I held the movie up to certain standards. While naturally the movie would be different, it was pretty close to the book, so close in fact that I was impressed. My favorite part about the whole thing, was that they kept some of the best lines in the book, in the movie. The ending kind of upset me a little but overall, very well done.",
      "total_reactions": 1,
      "user": "Sissybear"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "Also the script was amazing and kind of the same as the book, and usually i like more the books than the movies but in this case its different. The movie was BETTERR i loved how they put things and what they said and i think the cast did a great job filling for the characters, i absolutely fell in love with the movie and the characters... It was simply awsome!",
      "total_reactions": 1,
      "user": "Olguiss99"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "I thought the movie was fantastic!!!!! I can't wait for the next one no matter what the critics say about it",
      "total_reactions": 1,
      "user": "elena-mccolm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "I've never read the book, but this movie has encouraged me to do so. A good story and a good visual style, although some of the casting didn't quite fit their roles. But nonetheless, you must watch it. If you don't watch it, then you suck.",
      "total_reactions": 1,
      "user": "JohnnySanchez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2016
      },
      "score": 4,
      "text": "This is actually why I'm so happy why The Mortal Instruments just couldn't keep on track against both Twilight and The Hunger Games and just like Divergent, it's one failed YA franchise potential after another. City of Bones (which I watched it on Freeform the other day) were kinda familiar because though the casting of Lily Collins and Lena Hedey are decent, but I haven't even read the entire books so yeah I don't even know what the movie is about. It wasn't exactly as bad, but I felt that the filmmakers tried so much pressure that they can't go on with a sequel now that's officially kicked to the curb and just made a TV show called Shadowhunters (which is also a 'Meh').",
      "total_reactions": 0,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 0,
      "text": "Shehaan ruined the movie ,Movie is quite good otherway.Probably they changed the scenario cause of him , he is one of the producers.It is a bit longer than needed",
      "total_reactions": 0,
      "user": "beqerel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2014
      },
      "score": 2,
      "text": "Not original,  nonsense and boring movie. Nice CGI effects (demons are good)... but what else? Nothing! the movie is confusing and is too long (124 minutes?!?)  why!?). thanks god i didn't read the books.",
      "total_reactions": 0,
      "user": "Allions"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "For those of you who didn't read the book, City of Bones, this movie may seem a bit confusing to you. This film is kind of like a cliff notes version of the book. Certainly they had to cut things out of the nearly 500 page novel, but some key moments are simply touched upon with a line or two, making the movie a bit confusing at times. Clary Fray (Lily Collins) is a seemingly normal girl, who for some reason can't stop drawing a symbol. When she starts asking about the symbol, she is pulled into a world she never knew existed. As it turns out, Clary is keeping secrets, secrets she doesn't even know she has. It's those secrets that will eventually put her life, and the lives of everyone she knows, in danger. At first, the two main characters seem like they are completely different and won't have any chemistry at all, but as time goes on, they learn they're more alike than they think. Once their on the same page, the story really takes off. Lily Collins (Abduction, The Blind Side) really takes hold of her character and gives the film a strong female lead, that rivals Katniss Everdeen. Collins is paired with British heart-throb, Jamie Campbell Bower, who is a lot more than eye candy. I'd never seen Bower in anything, except bit parts in Twilight and Harry Potter, but the guy has some serious fighting skills. Bower is another one who at first doesn't seem to fit, but in the end really helps to make this film something special. To answer the big question about City of Bones, no, it is not as good as the book and you really shouldn't have expected it to be. The novel is massive and has entire parts that simply couldn't be transferred to the big screen. Some things were left out that shouldn't have been, while some of the more fast paced scenes were extended for the screen. All in all, I thought this movie was a pretty good representation of an excellent novel and a great film to include in your next movie night.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 1,
      "text": "What. The. Actual. ****",
      "total_reactions": 0,
      "user": "ePxOscuraNiebla"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "One of those fun and underrated  movies that never got much hype. This was actually a good movie. Takes you into an underground would adventure full of odd characters nobody else can see. I never read the book, but that did not stop me from enjoying it. This is much more interesting than the first Hunger Games.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2013
      },
      "score": 2,
      "text": "Well, I did not not enjoy this movie. I have read the book and did enjoy that a bit but this movie just doesn't cut it. The adaptation mostly followed the book but they squished everything into such a sort span of time that we were jumping from one scene to the next. There was no character development and you are just left to guess. I even read the book and got lost in parts of the movie. I probably could have been done well with a different adaptation but this just fell flat. On the bright side, Jonathan Rhys-Myers is still dreamy.",
      "total_reactions": 0,
      "user": "sammietee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2015
      },
      "score": 2,
      "text": "A lot of \"borrowing\" from other authors (*cough*JK Rowling/Joss Whedon*cough*) makes for an unoriginal, predictable product. Not surprising, really, considering a known plagiarist wrote it.",
      "total_reactions": 0,
      "user": "heromoder"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "I never had any problem with such movies, for example \"Twilight\" or \"The Host\" movies that I like to call \"Triangular Teen Love Stories\" always the same content. As for \"The Mortal Instruments: City of Bones\", which is the first motion picture of the upcoming book-based trilogy. This movie holds an interesting enough premise to grab your attention (although obvious that Screen Gems wants the next Twilight). It is not overall original but it is better than the above titles. It is not anything that you will keep in memory, it is just \"it's there\" type of movie, no more.",
      "total_reactions": 0,
      "user": "MovieGoer14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2013
      },
      "score": 1,
      "text": "Yep, this movie was not meant for me.  I guess if you think Bella and Edward are dynamic characters with rich backgrounds and their romance is a whirlwind event, you might enjoy this latest dash to cash in on “Twilight” with another tween book franchise.  The film is a complete mess of bad acting, uninteresting characters, weak action, a weaker plot and a story that feels the need to stuff itself with every single fantasy film cliché you can think of.  Unless you’re a part of the target audience (tweens), this movie is just a forgettable piece of unimaginative nothingness.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "Don't always believe the critics. Only seeing The Mortal Instruments last night, I was intrigued with the story line and although it seemed a little familiar  it was very fun to watch. I haven't read the books and I am not the one to watch many movies, but I have to say that TMI kept me on the edge of my seat, especially at the end. What I don't agree with is the Twilight comparison. I would rather watch TMI over Twilight any day.  I'm excited to see what the producers will be doing with the squeal. Hopefully, it will be just as great or even better than the first film.",
      "total_reactions": 0,
      "user": "HerdelicateSoul"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "I haven't read the series, but I watched 'The Mortal Instruments': 'City of Bones' with my girlfriend and we both Loved it! This movie should definitely be on everyone's watch list. Looking forward to the trilogy!",
      "total_reactions": 0,
      "user": "undafed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2014
      },
      "score": 6,
      "text": "I enjoyed this movie more then I thought I would, with no big actors in it this movie is good.",
      "total_reactions": 0,
      "user": "masterjohnson1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "I have read all the books; and I am an older woman - not a teenager.  I waited with such anticipation to see the movie (especially after the Hunger Games movies).  What a disappointment and waste of my money.  The two main characters lacked in chemistry and what's with putting vampire bites on Simon's neck?  Valentine, who is the reason for all this drama taking place is barely covered.  Maybe if I had not read the books (which are amazing) I would not feel this way.",
      "total_reactions": 0,
      "user": "MagicWanda"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2014
      },
      "score": 2,
      "text": "The Mortal Instruments: City of Bones was a huge disappointment, at least until the third act where it became halfway decent. The first two acts were a constant parade of exposition and action scenes with almost no time for character development. On top of that, the pacing, acting (save for the main actress), and script are fairly poor. Plot threads are set up and left dangling, possibly for the sequel or possibly because of the cut source material. Some reviews label it as the next Twilight, but to me it feels like the next Eragon. Twilight at least set time aside for characterization, though admittedly the romantic chemistry is just as bad. There are some redeeming moments, but those can't be discussed for spoiler reasons and they raise even more questions. The least that can be said about it is that it's entertaining, but the truth is that you've seen this movie before and better under many different titles. No need to waste your money on this one.",
      "total_reactions": 0,
      "user": "CECtheRonin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2016
      },
      "score": 3,
      "text": "This film adaptation feels like \"Percy Jackson: The Lightning Thief\" the Twilight Saga also \"The Hunger Games\" \"The Host\" \"Beautiful Creatures\" so it's just a crappy rip off of other successful YA film adaptations, which makes this film successful which this will start a teen franchise. I wanted to have fun time watching this film, I was expecting a fun guilty pleasure movie, but this film sucks the fun out like a vampire sucks out the blood out of a human. So it misses it the opportunities, instead it feels like a familiarity of things we have seen before in successful and well-made films. In New York City, we meet an ordinary teenage girl Clary Fray (Lilly Collins) learns she is descended from a line of Shadow Hunters half angel warriors who protect humanity from evil forces. After her mother (Lena Headey) disappears, Clary joins forces with a group of Shadow Hunters and enters the Downworld, an alternate realm filled with demons, vampires and a host of other creatures. Clary and her companions must find and protect an ancient cup that holds the key to her mother's future. Collins's performance was annoying, whiny and just not good at all so is her love interest in the film Jamie Campbell Bower. At least the film didn't bore me to death it actually was interesting. I did not read the book series by Cassandra Clare, but I'm judging this as a film there's a TV show based on Clare's novels just hope it's not bad like this film. 1. 5 out of 5 stars.",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2014
      },
      "score": 1,
      "text": "This is one of the worst book to movie adaptations I have ever seen.  I can't believe that if you loved the books you would ever love this movie.  The casting was awful, and anything that was taken from the book was completely changed.  The end was changed beyond recognition and absolutely terrible.  I should have turned this movie off after the first 20 minutes.  If they really wanted to turn this into a franchise then maybe they should have followed the book a little more closely like, oh, I don't know, Harry Potter, The Hunger Games, Lord of the Rings, even The Help, which anyone who read these books can see they tried to stay as close to the book as possible.  I would be shocked if the author had any say in this movie because why would you want to throw away everything you worked so hard to achieve by turning your book into a bad movie.  The book had the makings of a good movie with plenty of drama that it didn't need it all added in.",
      "total_reactions": 0,
      "user": "laughingbunnies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "I love this movie, even though I know it got bad critic reviews. It followed the plot pretty well and was just poorly directed.  The cast was pretty good, just wished that Jace was mildly more attractive as he was described.",
      "total_reactions": 0,
      "user": "gailygrind"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2014
      },
      "score": 2,
      "text": "The book was good. The only thing I liked about the movie was the characters that were picked. I understand some compacting of scenes for time. What I don't understand is completely changing it around. I say try to stick to the book as much as you can and I don't think they did that at all for this movie.I will not be watching the next one because it does nothing but aggravate me when I see that.",
      "total_reactions": 0,
      "user": "gregory109"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2014
      },
      "score": 0,
      "text": "this movie completely ruined the book. if i were the author i would sue the producers. they didn't stick to the book hardly at all. 1.) practically none of the scenes happened where or how they were supposed to happen. 2.) hodge never suggests to valentine that he should tell Clary and Jace that they are brother and sister. valentine raised Jace and wanted to crush all happiness in Jace's life. 3.) Clary's mother was not in the basement of the institute she was on Blackwell's island and basically chained to a bed. 4.) they left out the entire battle at Blackwell's island. there are so many more things wrong with this movie but i could go on forever. lets just say they didn't stick to the book like at all. ok sure if you've not read the book i guess its an ok move. but if you've read the book, you'd understand. the only thing they did even remotely right were the actors who played Jace, Isabel, Alec and Magnus Bane. but again that is the only thing they even remotely did right",
      "total_reactions": 0,
      "user": "MinaChapin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "I can't believe that City of Bones did so poorly in the theaters. I have read 3 of the four books. At first, when I have read a book before watching the movie, I pick it apart because of changes they have made and parts they left out. Then I take a step back. Why would anyone want to watch a movie in which they already know the ending? All of the \"series\" movies and shows have done the same thing. I now try very hard to view the book and the movie as separate entities. Double the entertainment!! I truly love this movie. I even DVRed it and watch it every day!!!",
      "total_reactions": 0,
      "user": "EmmyPaden"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "I loved this movie. I read the books and they were amazing, and I believe the movie was beautifully adapted. I only wish more people had falling in love with it the same way I did. There were changes here and there, but that has to be expected when you are making a movie from a book with that much history and back-story and also that level of action going on. There was so much to tell and explain and in the span of time they had, I think they did really well at explaining thing. I love the casting and I think everyone was as perfect as you could get to the characters in the book. I'm keeping my fingers crossed for a second film.",
      "total_reactions": 0,
      "user": "Aqua__Cat1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "\"The Mortal Instruments: City of Bones\" 10 Scale Rating: 3.0 (Bad) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "So much better than Twilight, but not lucky as it. With no success at all, they had no other option but cancel the sequels. Only now we have to live knowing we'll never know what would happen with Claire's mother, Jocelyn, and all other characters.",
      "total_reactions": 0,
      "user": "TheEmpire"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2016
      },
      "score": 10,
      "text": "You critics don't know what you are talking about. Lets get one thing straight, Twilight does not rule any other supernatural movie franchise. So stop comparing it to The Mortal Instruments etc. Twilight was a love story. TMI is much more than that. As far as I can see if you don't love sci-fi, action, romance, comedy, fantasy in one novel and movie. It's not for you. But don't bash it because it didn't meet your needs. TMI will always have it's book fans and they will grow from fans of the movie and be supported. Shadow Hunters are not going anywhere. Oh and to the person who said that Cassie stole ideas from other novels/movies. Why are you not bashing every vampire, werewolf, witch etc. film/tv show or book made? Those ideas were ledgends already here before you were born. So no one stole any 'idea'. I love the books and the movie. x",
      "total_reactions": 0,
      "user": "kyle20ellis"
    }
  ]
}