{
  "mc_avg_user_score": 5.3,
  "mc_metascore": 46,
  "mc_mixed_rating_frequency": 47,
  "mc_movie_name": "The Dilemma",
  "mc_negative_rating_frequency": 39,
  "mc_positive_rating_frequency": 40,
  "mc_pro_critic_reviews": [
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2011
      },
      "score": 75,
      "summary": "The movie is much like a really long beer commercial - but a really dark one."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 70,
      "summary": "What The Dilemma ultimately does best is create a platform for Vaughn to drag that iconic character of his into full-blown adulthood."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 70,
      "summary": "The ugly emotional mess is so respectfully handled that the story resonates far beyond its comic designs."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2011
      },
      "score": 67,
      "summary": "Howard surprises with this decidedly honest comedy-melodrama."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 67,
      "summary": "It never coheres as well as it should, but the film makes a fine mess."
    },
    {
      "critic": "Genevieve Harrison",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2011
      },
      "score": 60,
      "summary": "Hit-and-miss for Howard. The tone flits, sometimes uncomfortably, from Vaughn-fuelled laugh-fest to relationship drama, but it's a winner compared to many of the clunkly comedies out there."
    },
    {
      "critic": "Randy Cordova",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 60,
      "summary": "There are a few big laughs, but there are also long stretches in which nothing funny happens."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 58,
      "summary": "The dilemma of The Dilemma is that the conundrum at the center of the story isn't particularly hilarious."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "I'm not sure whether Howard and screenwriter Allan Loeb are to be commended for aspiring to something odd and original, or condemned for a result that's so messy and miscellaneous."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "As a rollicking comedy, it isn't."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "An uneven story that tries too hard to be meaningful and not hard enough to be funny."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "It's classic sitcom shtick, and The Dilemma is a painful reminder that director Ron Howard was trained in television."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "Despite bursts of hilarity and an A-list cast, this is a dark, difficult, weirdly existential film - like some seriocomic spin on \"I and Thou.\""
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "Vaughn is the film equivalent of a well-known novelist that no longer gets a good edit. He has the charismatic salesguy shtick down, but he needs a director who can rein him in."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "Miles below the Woodman's class. It's possible that a more astringent script could have provided fuel for the actors and A-list director Ron Howard."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "Ms. Ryder, playing the least sympathetic character with unflinching dignity and candor, is in many ways the reason The Dilemma works as well as it does."
    },
    {
      "critic": "Michelle Orange",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "The Dilemma is bad in a way that seems to parody all the ways in which a film like, say, \"The 40-Year-Old Virgin\" was good."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "Unexpectedly sour, The Dilemma barely qualifies as a comedy."
    },
    {
      "critic": "Mark Keizer",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "The hijinx get deflating, yet the tension and genuine sense of investigation keep you involved."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "The Dilemma downshifts from slapstick to melodrama and back so abruptly that it is at times jarring."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "Not a particularly funny movie. Indeed, the true dilemma of this misguided seriocomedy lies in the filmmakers' confusion as to whether they're making a side-splitting bromance (nope) or an unsparing, warts-and-all look at screwed-up relationships (sort of)."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "An unsatisfying if often surprising experience, a less warm and fuzzy \"Parenthood.\""
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2011
      },
      "score": 40,
      "summary": "Perhaps the late Blake Edwards could have found a balance between slapstick and psychodrama, but Ron Howard can't get the pacing right, and Allan Loeb's script is even wordier than the one he wrote for \"Wall Street: Money Never Sleeps.\""
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2011
      },
      "score": 40,
      "summary": "How does one remain an unapologetic fan of Vaughn, abrasive though he is, even as his material fails him?"
    },
    {
      "critic": "Kirk Honeycutt",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 40,
      "summary": "The Dilemma is so tone deaf to its themes that it thinks it's a light and slightly rude Vince Vaughn movie. It's not."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 38,
      "summary": "Vaughn and James are likable enough, and they would have real chemistry in, say, an all-out comedy."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 38,
      "summary": "What distinguishes The Dilemma in this genre is its resounding unfunnyness, its emotional dishonesty, and the general unlikability of its cast of characters."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2011
      },
      "score": 33,
      "summary": "The script by Allan Loeb careens all over the place without ever coming to rest on anything interesting."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2011
      },
      "score": 25,
      "summary": "Where the hell is the movie?"
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 25,
      "summary": "Howard never decides on tones that complement each other, and the dissonance is jarring."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 20,
      "summary": "This tonal mishmash cripples The Dilemma almost immediately, though there are many other speed bumps, including Vaughn's irritating, fast-talking prattle."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "Vince Vaughn discovers that his best friend's wife is cheating with another man. Does he tell him? The whole thing revolves around Vaughn's comic patter, so if you enjoy him, you might enjoy it. The script isn't that funny and most of the supporting cast isn't either. While it's mildly entertaining and occasionally amusing, it's not special or memorable.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "I have mixed feelings about this movie.  It could have easily taken the cheap way out as with so many other comedies these days with crass sophomoric humor to illicit approval from the audience.  Instead it went for a more mature approach with comedy as an afterthought.  Unfortunately it came up short in terms of resonating with me.  Vince Vaughan did an admirable job as an individual tortured by being unsure as to what is the right thing to do.  I disagree that this was his typical role.  Not far removed but more of a stretch than I have seen in the past.  Jennifer Connelly was fine as was Winona Ryder.  Interesting to see Winona in a few movies lately. Kevin James does not yet allow me to think of him as a character other than Kevin James.  Who knows if that will ever change.  Bottom line is a B+ for effort but a C+ for execution.",
      "total_reactions": 2,
      "user": "Vernon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "Throughout the second phase of his career, the one which started with 1977's \"Grand Theft Auto\", this former child star, hardly what you would call a critics' darling, has consistently assuaged the mainstream audience's fear of adventure with sturdy, but ultimately, disposable films that never go, you know, there; the proverbial there, the dark place where many provincial-minded moviegoers are afraid to go.This filmmaker, for better or worse, is Middle America's Orson Welles. His most successful outing, the Academy Award-winning \"A Beautiful Mind\", well-received for its adeptness at showing the inner-workings of John Nash's compromised world, disappointingly settles for cheap sentiment during the final reel(for starters, the pen scene), and ends up making the schizophrenic game theorist entirely too sympathetic, by half. Love him or loathe him, that's the filmmaker's modus operandi: placate the audience, placate 'em good, which is why his latest effort, \"The Dilemma\", in many ways, represents a radical departure for this pathological crowd-pleaser, who as a result of his gallivanting into uncharted territory, may shock his core audience by showing off a previously incognito dark side. Nobody's going to confuse this former child star with a misanthrope like Lars Von Trier, but his foray into pessimism as a filmic tool is a new development in the ol' repertoire that deserves our encouragement, not scorn. Case and point: the off-kilter toast that Ronnie(Vince Vaughn) gives at his girlfriend's parent's anniversary party, albeit not possessing the same caliber of black humor as the damning speech given by a sexually-abused son to his depraved stepfather in Thomas Vinterberg's \"Festen\", does take you aback, does make you hold your breath a little, as the crazed entrepreneur, vexed over the infidelity perpetuated by Geneva(Winona Ryder), his best friend's wife, expounds upon the concept of honesty, and keeps both audiences(us and the partygoers) on pins and needles, as he speculates over other people's sex lives with his vitriol-fueled stand-up patter. When you consider that our answer to the Dogme movement(which includes the 1998 Vinterberg film, also known as \"The Celebration\") was Alan Cummings' \"The Anniversary Party\", maybe \"The Dilemma\", through its seeming allusion to more cineaste-approved fare, is the squarest of all square filmmaker's concession that his proficient movies are indeed maddeningly middle-of-the-road. \"The Dilemma\" is virgin territory for this talented hack; it's, at times, genuinely edgy. In its own oblique way, this Dogme-light comedy is a very political film; it's anti-bromance. Unlike the Judd Apatow-inspired \"I Love You, Man\", the close bond between Ronnie and Nick(Kevin James), inventors of a new technology that masculinizes the electric car, has none of the coyness surrounding their friendship that runs through \"Superbad\" and \"Pineapple Express\". When we learn that Ronnie had sex with Geneva(at Ball State, wink wink, nudge nudge), their sexual history, as a result, has a transformative effect on previous scenes, especially the one at the botanical garden, because now it's a former lover, and not just the best friend of the husband whom Geneva is cuckolding, who watches a whole lot of sinning going on between the secret lovers, in the thick of the rare fauna and flora. The contact that Ronnie makes with the poisonous greenery, in retrospect, no longer plays like an arbitrary occurrence; his falling down, not just a harmless bit of slapstick comedy resulting in a bad rash and urinary problems, but instead takes on the significance of a punishment, the transgression being: he covets his best friend's wife. This game-changing revelation at the coffeehouse, which codifies Ronnie's sexual orientation, culminates with Geneva feigning a good cry and corroborating story about Ronnie's ongoing lechery, which she threatens to deploy as a preventive measure against being found out. Her public display of female hysteria uncannily recalls the scene in Rob Reiner's \"When Harry Met Sally\" where Meg Ryan fakes an orgasm. This time, it's crocodile tears. The premise that women and men can't truly be friends because of each sex's biological disposition toward f*cking, is retold in \"The Dilemma\" under the guise of a man's fidelity toward a committed homosocial relationship with an old college buddy. Forty-years-old and never married, Ronnie dated and dumped all of Geneva's friends because none of them were Geneva herself. For a change of pace, \"The Dilemma\" has a straight subtext. In \"Vanilla Sky\", Julie Gianni(Cameron Diaz) says, \"Don't you know that when you sleep with someone, your body makes a promise whether you do or not.\" When Ronnie sees Geneva kissing that guy, his body remembers, and more importantly, he remembers.",
      "total_reactions": 1,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2011
      },
      "score": 4,
      "text": "What Howard has here is a film that follows the genre...so far, beats about the bush a bit further, digresses toward a flash of intrigue, then falls straight on its face---leaving a hefty rash of deep-rooted 'botanical' dissatisfaction. \"The Dilemma\" is nothing more than a rom-com filled with the usual paranoia, speculation, sex, lies, and melodrama---the only difference---the PG-13 rating decided to lose its diapers. What transpires is a miss-matched, unconvincing, uninteresting concoction of a recurringly flat and soporific Vince Vaughn-meets-Mall Cop-meets Deeds-soap opera that takes an earnestly darker and contemplative approach to heartbreak. The bottom line: the combination doesn't make for many laughs.",
      "total_reactions": 1,
      "user": "FDT44"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "About as good as I expected.  Somewhat entertaining but the best  scenes were in the preview. There were just far too many parts that seemed to drag.",
      "total_reactions": 1,
      "user": "MrsBear"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2011
      },
      "score": 0,
      "text": "Pathetically unfunny, dire story, Vaughan lacks any vigor and James pulls another Mall Cop, the female leads give rise to a whole new meaning of bland, left before it was over. Channing Tatum actually comes out looking well. Utterly disastrous. Avoid.",
      "total_reactions": 1,
      "user": "Paddy87"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2011
      },
      "score": 0,
      "text": "score speaks for itself ........ terrible movie boring and painfully unfunny, well what do you expect from two actors that are too prdictable in every movie (by this i mean trying to hard to be funny) and being overall less than average actors but dont let this put you off its just my opion (oh and the crtics)",
      "total_reactions": 1,
      "user": "1111"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2011
      },
      "score": 0,
      "text": "This is a real shocker. Boring, unfunny, amateurish, no chemistry between the actors. Ron Howard must have been asleep while he directed this truly awful movie",
      "total_reactions": 1,
      "user": "Opheelyah"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2011
      },
      "score": 3,
      "text": "Watching these two very funny men make a pass at drama was not amusing. The movie was darker than I expected, and it disappointed me. The characters werent well developed and the plot was choppy.",
      "total_reactions": 1,
      "user": "RileyRoo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "i thought this movie was lame. there were about 3 funny scenes, namely the one where vince vaughn sprays hairspray in front of a lighter and goes after channing taton. Although, this movie had great actors, it was rather boring and every scene took place in the same setting too much.",
      "total_reactions": 1,
      "user": "xflygirlx87"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 4,
      "text": "The Dilemma was OK. I have never really liked Vince Vaughn, but he was actually very good in it. The movie wasn't particularly funny, but it had a good storyline. I found it very basic and much longer than it had to be. It is what it is, just your typical ordinary romantic comedy. Not really my thing...",
      "total_reactions": 1,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "The Dilemma is a different kind of comedy. It is more serious which makes its more interesting. The problem is the seriousness is better than the comedy and that is not good when you call your movie a comedy.",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "I was surprised at how good this movie was.  I was expecting the usual goofy crap that these two (Vaughn & James) are usually in, but it was much better.  Also, luckily, Connelly and Ryder are there to class up the movie (and are both way too good (and beautiful) for their men).  The only downside was Tatum's character (little too much).  I say, trust in Howard and go see it.",
      "total_reactions": 3,
      "user": "tdkDallas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "It's a fun movie. Not nearly as bad as I thought it could be, and it all rests on Vince Vaughn's shoulders. He's been playing the same role since Swingers, but he's entertaining to watch. Both leading ladies are excellent in dramatic sequences that don't totally drain the comedy of its pace or momentum.",
      "total_reactions": 0,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "\"Vince Vaughn and Kevin James are great together and Dilemma proves to be a funny and corky , but at times feels more like a drama as opposed to a comedy. Some Laughs fall flat , and the screenplay is awful but still lived up to my expectations\" .. B",
      "total_reactions": 0,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 4,
      "text": "It wasn't a very good movie, it was a long and drawn out affair but it did have some very funny parts in it. What killed this movie is the fact the storyline was terrible, it has no basis. If you're bestfriends wife was cheating on him, you would just tell him. You wouldn't spend ages debating it and asking different people, sneaking around and getting up to God knows what. It was a dumb movie, dumb but slightly funny,",
      "total_reactions": 0,
      "user": "GarethCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2011
      },
      "score": 6,
      "text": "this movie is not what it seems to be. this is not a brat pack summer hit, slapstick comedy or a second rate romcom. yet the problem, or the dilemma I should say (ouch! sorry!) is that it looks and feels too much like the things that it is not!",
      "total_reactions": 0,
      "user": "istanbul"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2011
      },
      "score": 4,
      "text": "It was a decent, somewhat entertaining but no many laugh out loud parts. Worth a watch but another very easily forgettable movie as others have done it better. The cast is the only thing that even held this somewhat together, otherwise it would have tanked worse.",
      "total_reactions": 0,
      "user": "MrRiggs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "I had mixed reviews with this movie also. There were a few funny parts. But the conflict was overpowered and made the movie not as funny and good as expected.",
      "total_reactions": 0,
      "user": "tmt97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "What happened to this film is that people saw Vince Vaughn and Kevin James and made an assumption that it was going to be typical of the work they've done previously which is routine small screen sitcom.  This is the first time I've watched Vince Vaughn and actually appreciated his talent.  He was truly suited for this role and Kevin James matched him.  Ryder and Connelly were truly regulated to back seats in this piece but they rode quite well.  This isn't or wasn't intended to be some slap stick roll on the floor grab your sides slap stick crap.  Ron Howard had a story and a dilemna he wanted to explore and he did it well.  It not a great film but it's not a bad either and it's perfect for a cold winter night when you just want to sit back and watch something entertaining while you relax.",
      "total_reactions": 0,
      "user": "NJWolfgang"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 5,
      "text": "Well it wasn't horrible. But is it just me or is Vince Vaughn wearing on everyone?  I love the guy, but he needs a new bit. The story, well it's just ok.  The cast was just ok too. Jennifer Connoly was miscast, and Kevin James, well it just seems like he's in movies where they can't get Seth Rogen or something.",
      "total_reactions": 0,
      "user": "thesteelcurtain"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2011
      },
      "score": 2,
      "text": "The Dilemma is a bad film with good parts. The only good thing about this film is Vince Vaughan and Kevin James acting because i like them from other comedy films. The problems with this film is the story isnt balance, some scenes feel like there going onto difeerent episodes and that wasent good, the film was barelly funny at all and the actors could have done a better job on the characters but they didnt. I would not watch this film again.",
      "total_reactions": 0,
      "user": "Edward9630"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2011
      },
      "score": 0,
      "text": "For a movie with two popular comedians, it wasn't very funny. The parts that were intended to be humorous were so randomly distributed, it was impossible to laugh. Queen Latifa's character was a complete mess. What on earth was she doing in this movie? Her presence in a film is so strong, her character needs to have more relevance to the plot or it just becomes bizarre. Not to mention everything out of the woman's mouth was pornographic. This movie is (I'm guessing, because the plot was almost absent) about people cheating on each other while one guy nearly gets himself killed trying to \"fix\" everything. Of course the female adulterer gets all the heat while the slime ball who attends weekly sex sessions at a massage parlor is victimized.  Vaughn becomes a human punching bag for trying to rescue his friends failed marriage while nearly destroying his relationship with a dumb, unrealistically patient girlfriend.. Ryder's character was incredibly dark. In one scene, she starts foaming at the mouth in a way you'd expect from some kind of psychopathic bunny killer in a Life Time movie. I found myself thinking \"Does she think shes in Black Swan again?\" Then of course there's the Queen talking about her female erections in a car lot two minutes later. It was hard to like any of the people in this movie. The only \"innocent\" character was a complete bore and all of the side characters were forgettable.  I did enjoy a fight scene involving a broken fish tank and flaming hair spray. Only because it was the most exciting thing I'd seen since i saw the disk tray pop out of my computer prior to the movie starting.  The Dilemma ended in the same nonsensical pattern, a mixture of predictability and disorganization. Including the most annoying words ever spoken by a human being (Vaughn) just before a very stereotypical bro-mantic frolic on an ice rink. I actually felt embarrassed for the stars of this film. I'm surprised that any one likes it. I want my dollar back from red box.",
      "total_reactions": 0,
      "user": "BurtosBaby"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2011
      },
      "score": 5,
      "text": "A few chuckles here and their, it's sad how stale the plot is considering the entire movie revolves heavily around it, Vince Vaughn is okay in the movie and he makes the \"dilemma\" a bit believable, but Kevin James bombs in this, overacting in almost all his lines and his jokes are incredibly boring.",
      "total_reactions": 0,
      "user": "Belvadeer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "Vince Vaughn is talented when it comes to fast talking improve and Kevin James can bring the funny most of the time, so it seems like a great idea to bring them together to make a film. Unfortunately it was this film. They both seem to have some chemistry on screen together, so hopefully it will happen again someday. There is a decent movie lying in there somewhere, it just never gets to it.    The idea for this movie is interesting enough; I just think in the end, The Dilemma does not live up to the possibility of good the idea shoots for. When you have gathered two great comedians and two actresses who can be great (Connelly) to not too shabby (Ryder) and then give them a script that doesnâ",
      "total_reactions": 0,
      "user": "heybuddymovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2011
      },
      "score": 0,
      "text": "OMG this film was RUBBISH! I went to see it with my bestfriend and we left early so I STRONGLY suggest that you dont buy this film or you'll be bored out of your mind! I didnt understand half of it either but if your an adult then maybe you do but if its rated 12 then why put in stuff i dont get? And the only bits of the film I got was one guy was caught snogging someone that wasnt his wife and then we left cos we died of boredom !",
      "total_reactions": 0,
      "user": "hollyvictoria19"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2011
      },
      "score": 3,
      "text": "With one of the amazing cast in Hollywood like Vince  , Kev , Winona , Jen Con and a director like Ron Howard who could ever thought  \"The Dilemma\" would be this much unfunny and boring ! Its Ron's the worst film of all . The story was simple but they just kick it like its a Football but on their own post ! Kev and Vince's acting was also their worst , Winona did OK but not good , only Jen was charming as she always is .......",
      "total_reactions": 0,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 0,
      "text": "This is the most disappointing movie I have ever seen.  The strong cast is wasted.  The writing is literally rock-bottom.  Seriously, who green lit this project with a script that so clearly sucked out loud?",
      "total_reactions": 0,
      "user": "kdg88"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "I believe that there was too much criticism towards a very good comedy,certainly better than other comedies sold as great(take The holiday for example).The dilemma features a great cast,an interesting story and a really good direction.How could this comedy have gained so much haters is beyond my comprehension.Ronny(Vince Vaughn)and Nick(Kevin James)are best friends working on a ambitious project as auto designers that would launch their company.But Ronny discovers Geneva(Winona Ryder),wife of Nick,cheating on him with another man.So he has to find how to tell his best friend about the unexpected truth. Ron Howard is not new to comedy territory(Splash for example)and in my opinion he manages to entertain the audience.The movie boasts really hilarious moments and good reflections on friendship and marriage with a light tone that is natural for comedy.Even if there are few predictable aspects I enjoyed the movie for what it is.I think that critics and audience missed the point because I've seen not so much good comedies about that. Vince Vaughn is the heart and the soul of the movie.I found him really good and I believe that he is an underrated actor.They should give him more opportunities to show his abilities. Kevin James is adequate to his role that is not too demanding. Jennifer Connelly has a pointless role as the Ronnie's girlfriend.Don't get me wrong.I think she is a really amazing actress and she plays well here.But her role is a bit useless except her mission to make Ronnie a more honest man about what's happening . Winona Ryder has the juiciest and the more complex role as the cheating wife.She was exceptional and mesmerizing.She proved why she deserves to be still today a leading actress and not to be pushed only in supporting roles and little parts. She embodies not a stereotyped character but a selfish,occasionally nasty but with a soul within the surface woman.I hope this will be a comeback for her. So good story, good direction, good script and a perfect cast.My vote is 7/10",
      "total_reactions": 0,
      "user": "francesco"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2011
      },
      "score": 2,
      "text": "A promising premise that fails to capture its potential at all whatsoever. Even its talented cast can't do much with what was in front of them I give this movie 19%.",
      "total_reactions": 0,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "This movie is nonsense because the story( or lack there of) is unfathomable. Vaughn plays an obsessive wacko meddling in other people's business. That character could have been funny if it was supposed to be, but he was serious for the majority of this abysmal film. The cast kept it together for the most part, but everybody was mainly just awkward.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 4,
      "text": "Sometimes it feels as if members of the Frat Pack just spew out films when they want money rather than for artistic measure (not that I blame them). It isn't very good and I really do not think that Kevin James can be a truly successful film actor. I enjoyed the role played by Channing Tatum as well as the chemistry between Vince Vaughn and Jennifer Connolly.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 2,
      "text": "so this movie is really bad. The script and the plot and in general what happens in the movie is bad. The cast though it's good. I hated this movie. When i saw it i knew that this wont be good. Such a same for the actors",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "The Dilemma is not the average Ron Howard movie; it sucked. Terrible acting, and terrible story. It should not have been a movie, because it's a PG-13 style Disney channel movie.",
      "total_reactions": 0,
      "user": "chw"
    }
  ]
}