{
  "mc_avg_user_score": 6.1,
  "mc_metascore": 24,
  "mc_mixed_rating_frequency": 14,
  "mc_movie_name": "The Boondock Saints II: All Saints Day",
  "mc_negative_rating_frequency": 32,
  "mc_positive_rating_frequency": 57,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 1,
      "text": "1, for a good trailer. As far as the movie, a disappointment. After the first  25 minutes of it I cut it off. Bad acting, terrible jokes, typical story for a sequel. Its like if they were trying too hard to make it like the original, but couldn't hit the right notes. Definitly had the potential to be a very good movie, if it had good movie makers, but this is just another corny sequel.",
      "total_reactions": 0,
      "user": "SlickReview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "Quentin Tarantino has taken some more worthy **** than this movie. Even fans of the first one will find little to cling on to, and bad dialogue makes the already bad acting just plain horrendous.",
      "total_reactions": 0,
      "user": "ryancarroll88"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "So bad. It's just so damn bad. Not only is it full of the brainless, boring, somehow action-less actions scenes that The Boondock Saints are known for, but everything around those moments is just as terrible. Duffy's attempts at drama and intrigue are laughable. There is not a semblance of development or patience in his story telling. It's like he just said \"I want this to happen now\" and then just told all of the actors to do it instead of actually spending time and first ensuring that we are invested in the characters and their lives. And the jokes...my word...how unfunny. The only thing that is funny here is the acting which I can't even take seriously. This sh*t is just sloppy and amateurish. There is absolutely nothing good about it. It is painfully stupid. And the worst part about that is that it doesn't know it's stupid. It thinks it's good. It thinks that people are watching it and saying \"Wow what he just said was cool\" or \"Isn't that plot twist awesome\" but what most of them are really saying is \"...please.\" As a non film-maker I would never say this about virtually any other movie because I understand that it's probably more difficult than I could imagine...but I could make a better movie than this. In fact, there is no way that I would not if given the chance. Anybody with a brain or even one original thought could make something better than this. It is worthless. Of no value. Without a single redeeming quality or thing to appreciate. Garbage. Whoever contributed to this should be embarrassed.",
      "total_reactions": 0,
      "user": "YoursTruly"
    }
  ]
}