{
  "mc_avg_user_score": 7.2,
  "mc_metascore": 86,
  "mc_mixed_rating_frequency": 44,
  "mc_movie_name": "The Kids Are All Right",
  "mc_negative_rating_frequency": 32,
  "mc_positive_rating_frequency": 219,
  "mc_pro_critic_reviews": [
    {
      "critic": "Anna Smith",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2010
      },
      "score": 80,
      "summary": "A witty, warm exploration of family life that's conventional and unconventional in equal measure."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "Above all the things \"The Kids are all right\" depicts, its optimistic till the end; a movie that understands and respects happiness and the value of family.",
      "total_reactions": 5,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "One of the ever-growing \"real life\" type of films, that features interesting cinematography. The screenplay is rather clever and the situations and dialogues, especially, are at times so hilarious, while at other times are heart wrenching. Bening and Moore give astonishing performances, closely followed by Ruffalo, who was rather surprising, I might add. I had not expected such a good performance from him.",
      "total_reactions": 1,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "Annette Bening's performance alone made this movie for me, though there were many things to find delightful about it. She can say so much with her face -- thankfully she has left it alone to have such depth of expression. I left the theater feeling good after this one.",
      "total_reactions": 1,
      "user": "Mangogrove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "It creates awkward situations for the audience. I like that because it strangely makes you feel like you're more involved in the film. It's funny, sad, and exasperating at times. The message it gives is nice too. I do believe that marriage is a lifelong commitment, and in a world where divorce is so prevalent it's definitely refreshing to see a film where the family stays together regardless of what lust can do.",
      "total_reactions": 1,
      "user": "Phantasmal"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "The Kids Are All Right is very well acted, funny, and entertaining independent production, and beyond all else it just fells real. The problems this family has are real problems families have all across this country and planet, and the fact that this happens to be a gay couple in question doesn't change that. There is nothing trumped up here, but that doesn't mean what happens isn't very interesting to say the least. Benning gets the most attention for her acting in this film, and deserves the praise, but unfortunately Moore does not get near the same recognition for a role I think is nearly as impressive. Ruffalo, as a sperm donor creating relationships and havok in the lesbian household, is also terrific. Very well done, easily one of the 10 best films of 2010 and deserving of its BP nomination.",
      "total_reactions": 1,
      "user": "Christopher_G2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "The Kids Are All Right\" is an exceptional film judged by any angle. Superb acting, original plot line, realistically imperfect characters, and a foray into meaningful topics. The movie delves into the complexity of long term relationships, the inexorable rise of youthful independence, and the uncertain glue that holds families together. Highly recommend it.",
      "total_reactions": 1,
      "user": "SierraMtz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "This has to be one of the most fun films in a long time. The movies plot is ever so simple; where two kids meet their sperm donor. Things seem to be okay at first, but it just seems that donating sperm probably wasn't the right choice. He develops a deep relationship amongst the family and tension soon runs high. The way that the movie is told is so plain, where dialogue and the variety of characters takes over and turns the movie into a lighthearted and touching story that is a rarity in hollywood. The movie is sexy, funny, and just pure entertainment with a good story. You'll be able to sit down and really know the characters one by one without becoming so tense on what happens next. Just sit down, relax, and enjoy the show.",
      "total_reactions": 7,
      "user": "Film_Fanatic_15"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "This film is a perfect portrait of the modern American family and a true acting showcase for Bening, Moore, and Ruffalo. Each of them brings complexity to the characters and are perfect for their respective roles. Cholodenko's script is very much Oscar-worthy, and the film deserves all of the praise being heaped upon it.",
      "total_reactions": 5,
      "user": "Tony"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2010
      },
      "score": 1,
      "text": "I have to say I was very disappointed at this film.  It makes a mockery out of lesbian sex and relationships and only glimpses at moments of what an alternative family is.  I really had high hopes for this film to be a positive affirmation of alternative family lifestyles, instead it was an insult.  I even felt that the women were really trying to fit into a stereotype, hello we wear makeup!!  We are not afraid to act like women even though we are with a woman~ and the penis envy, Please!!  watching gay male porn during sex wtf??  seriously, this film has some serious problems and it's really a shame because it had the potential to be something positive for the lesbian community, instead it is just a slap in the face.  What were you thinking Lisa Cholodenko???",
      "total_reactions": 7,
      "user": "cineprof"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "This was a boring moving.  It had two great kids caught in a movie where humor is defined as anger and predictable punch lines.  I feel like I have seen this before and so before it was too late I turned it off.  Much better!",
      "total_reactions": 6,
      "user": "The_orud"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2010
      },
      "score": 0,
      "text": "I found this movie unwatchable, and left after twenty minutes. The director doesn't know if she respects these people or want to make fun of them, and so she does neither. Sitting even through 20 minutes was like eavesdropping on neighbors who have nothing together and have bought every pop-psychology book in the store. And the sex scenes were horrible, toe-curling.",
      "total_reactions": 4,
      "user": "Ashesndiamonds"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2010
      },
      "score": 0,
      "text": "This movie is unwatchable, over-acted, misguided, and insensitive. Needed 20-30 minutes of editing as well. Siblings relationship is portrayed typical whereas it is atypical. What a Hollywood waste - again.",
      "total_reactions": 4,
      "user": "JoyRide"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2010
      },
      "score": 1,
      "text": "Dreadful! The script, whose sole revelation is that some lesbians enjoy watching gay porn (because aroused males are protuberant!) isn't remotely worthy of Bening and Moore, the art direction and photography are uniformly ugly, and Mark Ruffalo's performance is a black hole; there isn't a less interesting actor working in American film today. Avoid!",
      "total_reactions": 5,
      "user": "thecuddlebear"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2011
      },
      "score": 0,
      "text": "I am so sick of rated R movies actually  being Rated X.  I was so disgusted by the amount of filth in this movie that I turned it off after 15 minutes! From lesbian BJ's, to gay porn and then a full on nudity sex scene, and this was all within the first 15 minutes.  And I'm not even that much of a conservative, but this was full on porn, and  I don't need that kind of crap in my life.  I honestly don't think I can even watch rated R movies, because of the amount of nudity.  Good think I only paid a buck at Redbox, but still a wasted dollar.  I would not recommend this movie to anyone, unless you want your mind to be consumed with porn thoughts which could then lead you to porn addiction which could eventually destroy your life.  It's baby steps folks!",
      "total_reactions": 5,
      "user": "holls"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2011
      },
      "score": 2,
      "text": "Calling this movie a film is a disgrace to all films out there. This movie was unrealistic, predictable and extremely lacking in editing. The cinematography in this movie was absolutely offel and the dialogue was pathetic and unrealistic. Through the movie the characters were acting  unrealistically and unaturally and some of the most important scenes of this movie were said with no enthusiasm by them. This movie was not only an unrealistic portrayal of a lesbian family but simply an unrealistic portrayal of any family. The movie gave you the total inability to relate with any of the characters except with some odd scenes. Most of the soundtrack was pretty terrible as well. The preview is very misleading and makes the movie appear to actually be good. Since choosing this movie my dad  will no longer let me pick what movie we go see together for at least three weeks. This movie is a total waste of money and time.",
      "total_reactions": 5,
      "user": "Anti-hollywood5"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "I hated this movie so much, it was terrible. It is an extremely overrated movie that doesn't deserve jack **** A lot of people think its good because it is so called, \"controversial,\" when reality its not, its just a bad movie. Another thing is, it doesn't deserve to be called a comedy, it was at no way, shape, or form funny at the least bit. It should should just be a drama because it dramatically sucks.",
      "total_reactions": 6,
      "user": "MatthewXploder"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "This has to be the most offensive movie I have ever seen. It has shown audiences men and women that lesbianism is curable and a man can interfere with a solid same sex marriage. I watched this with my partner and became infuriated at how the director had the nerve to be from the GLBT community and produce this mess of a movie. I originally wanted to watch it because I thought it would show people that the kids are alright being in a same sex house hold, I wanted our daughter to watch it to see that she is no different. My feelings quickly changed. This was a disaster movie, if at all possible I would like the creator to give me my $4.99 back",
      "total_reactions": 6,
      "user": "deniseaguilar"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "I couldn't stand this movie. I'd rather rent Made In America starring Ted Danson and Whoopi Goldberg once again instead. I highly recommend that you don't see this movie.",
      "total_reactions": 2,
      "user": "LeoTs3181983"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "I really liked this film, but a couple of things that happen seem unrealistic to me which keeps me from elevating the film to a 9 or 10.  First is the relationship between Julianne Moore and Mark Ruffalo - I don't think that would happen in real life.  Second, and most importantly, is the way the family treats the Mark Ruffalo character at the end.  The acting, however, is great all around, especially by Annette Bening.  She should lock up an Oscar nomination for sure.",
      "total_reactions": 1,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "An atypically arranged American household amidst delicate and often awkward moments, \"The Kids Are All Right\" captures the melodramatic tension that accompanies kids living in a far from normal reality. Here, they must juggle mixed emotions towards a male figure they never had the chance of experiencing; until now. With their long lost patriarch returned, this greatly open family must deal with  the potentially damaging effects of letting in a familiar stranger.",
      "total_reactions": 1,
      "user": "FDT44"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2011
      },
      "score": 4,
      "text": "The Kids Are All Right should be a good film, and has some tender, honest moments. Unfortunately, the film is undone by its own premise. We have a typical, dysfunctional family with problems the general public can relate to... except the family has two moms! How progressive! Except it isn't, and that's sort of the point. What really screws the film up is Mark Ruffalo's character Paul. He isn't a bad or uninteresting character, but the effects he has on the plot is baffling, aggravating and it completely undoes the main purpose of the film. I will say spoiler alert, but since it is in the trailer it really isn't, but Julianne Moore's character (Jules) has an affair with Paul. Again, this isn't inherently a bad plot point, but it is handled very poorly. When a gay person has sex with someone of the opposite sex, it is confusing and brings up all these questions of sexuality... but the movie doesn't address them, it barely even scratches the surfaces. It was annoying to see this strong lesbian woman have an affair with a man for no apparent reason. Paul serves absolutely no purpose in this movie. He just detracts from the central family. The film would have been better off focusing more on the \"dysfunctional family\" than introducing this character. This combination of Paul and the affair he has with Jules causes the film to fall flat on its intriguing performances. All the actors do give solid performances, including the kids. Too bad the actors are wasted here.",
      "total_reactions": 1,
      "user": "Iswearimsmart"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "This movie was phenomenal don't get me wrong, until it reached it's climax. At it's core the story directs most of its animosity towards the most innocent of characters. What angered me the most is that Paul (played by Mark Ruffalo) was shown as the antagonist when all he was was innocent. The plot directs most of its animosity towards the vulnerable characters while leaving the other dumbfounded at Julianne Moore. She of all people is portrayed as the protagonist of the picture and by the end is forgiven for her actions; the audience must accept this. I on the other hand did not want to accept this simply because her selfishness allowed her to screw up to her degree. It was her elusiveness that allowed her to get out of her  horrid situation by simply blaming a man who wanted nothing more but to be involved; also he was incredibly innocent and had never experienced purpose. However, the first 1 and 20 minutes of this film are a pure joy filmed with drama and comedy, as for the ending you will feel unsatisfied and will not have a sense of closure which every audience member deserves. 7/10.",
      "total_reactions": 0,
      "user": "nachocano"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "You know, I wanted to LOVE this film, because of political reasons mainly, but more because I completely respect the actors involved (Moore, Benning and Ruffalo). I walked away really liking the subtleties of the plot development and characterizations, but in the end I wanted more resolution to be carved out of the third act. Not that the film doesn't come to a nice rest after the convincing drama ensued by the conflict at hand (won't disclose hence I spoil anything). My main concern was whether I'd been given enough time to understand Benning's character, or had been given enough scenes with her to truly appreciate her. This critique might fall beyond a review, and for that I apologize. I'd recommend it, if for no other reason then it is built to cause discussion about family, marriage and the complexities of these institutions.",
      "total_reactions": 0,
      "user": "serflood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "THis film really explores some trials of life previously explored in other films such as cheating and a family falling apart, this movie does it with lesbians. The family primarily is normal so as not to be shown biased to the gay community which i thought was great, the ending was the only door left for improvement, as although it ended lightly and probably made most people smile, it left no resolution to Ruffalo's character, somewhat leaving him in the dust. But essentially, that is the most plausible outcome to this light and fun story.",
      "total_reactions": 0,
      "user": "Chonquist"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "The seating arrangement at dinner time gives the moviegoer a pretty good indication as to why Laser(Josh Hutchinson) feels the urgent need to make contact with his sperm donor. The fifteen-year-old boy doesn't have the same status that he'd enjoy in a patriarchal family environment. Outnumbered by women, three-to-one, the fifteen-year-old boy is seated at the farthest point from Nic(Annette Bening), the dad dressed in mom's clothing who occupies the chair, traditionally reserved for the \"man of the house\", at the head of the table. Because he was sired by Jules(Julianne Moore), the weaker mom, Laser, hierarchically speaking, independent of chronological age, can't begin to compete with his sister Joni(Mia Wasnikowska), who, in this alternative family, is the stronger sex and originated from the stronger womb, the breadwinner's womb. Judging by their names, it would seem that the moms favor girls, since the college-bound Joni was named after singer-songwriter Joni Mitchell, while the boy got affixed with a gimmicky appellation which suggests that the moms were hard-pressed to name one man they revered enough to bestow their child with his reflected glory. The matter of Laser being all right without a father, to me, lies at the heart of this film. Before dinner is served at Paul's house, Nic comes across a crate filled with the sperm donor's albums, which includes Mitchell's seminal album \"Blue\". It's a telling moment, because the moviegoer can glean how the women, and perhaps, the filmmaker, perceive men. Vinyl, a format thought to be warmer than the compact disc, becomes the embodiment of women, while the CD, by default, comes to represent men, since it requires a LASER. Women are analogue, and men are digital, but Laser, after years of being raised by two women, is vinyl, too. By the end of the film, sitting in the backseat as Jules drives, Laser realizes that he likes being analogue, being analogue is all right.",
      "total_reactions": 0,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 6,
      "text": "The first thing I have to point out about this film is how incredible the acting is. Bening in particular stands out, and should be a lock for an Oscar nomination. While the acting in this film is great, and most of the film is enjoyable, I was seriously bothered by the film's ending. The film's ending does not seem believable with the rest of the film, and makes everything that we have seen seem irrelevant. I wasn't expecting a Hollywood ending, but I feel that Mark Ruffalo's character should have been dealt with in a much different manner. Regardless, the acting alone is reason enough to view this film.",
      "total_reactions": 0,
      "user": "AJackson729"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Why is everyone trashing the ending of this film and how it treats Paul?  I find the end wonderfully subtle: after talking to Paul, Joni changes her mind and takes the gardening hat he gave her to college with her.  That tells us--those of us who are paying attention, anyway--that the door is open to what he asked for: to see her again someday.  SO much better than the hugs-all-round-and-redemption-for-everyone sledgehammer that usually ends films about family conflict.  I mean, think about it: when an affair rocks a marriage but doesn't break it up, how often is the outside lover forgiven and re-embraced by the family?  Is \"never\" a safe estimation?  All in all, TKAAR is a wonderfully subtle film about people struggling to understand one another and themselves.  It's also that rare film that shows people with genuinely good intentions, though often confused about what goodness is and how to achieve it.  The acting is staggeringly good, especially from the two Oscar nominees.  Julianne Moore is, as usual, first rate, but hers is an easier role (and we've seen versions of this character from her before) than the other two.  Bening plays a less likable character, and she plays her fearlessly, not softening her edges yet offering glimpses of her underlying vulnerability.  And Ruffalo, as Paul, was equally complicated: a careless, overgrown boy bedazzled by instant fatherhood--and rather good at it, until he mistakes Jules's sexual acting out for a short cut to the family he suddenly wants.  Good stuff, fresh, believable and deeply affecting.",
      "total_reactions": 0,
      "user": "JennetP"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "Here's a film that is brilliant in examining the trees but misses the boat completely when it comes to the forest. The entire cast is excellent with Annette Benning giving a brilliant performance. There's lots to love in the little moments but the ending is completely ridiculous and unfair to one of the major characters. That ending lost the movie most of its points.",
      "total_reactions": 0,
      "user": "kabloom"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Fantastic storytelling, acting and characterization.  Loved the ending as each of the characters ended up in a place they needed to be, but in a completely realistic way.  This is one of the best movies of the last ten years.",
      "total_reactions": 0,
      "user": "DaveBommie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "Rich, natural performances by three amazing leading actors, Annette Benning, Julianne Moore and Mark Ruffalo. I had not seen any of them in a similar role before, which enhanced their ability to pull off these roles even more. The very human traits of these characters are flawlessly translated to screen, supported by an extremely strong story and perfect direction.",
      "total_reactions": 0,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "The Kids Are All Right has an very interesting premise, some well written humor, and some great acting going for it. Perhaps most notably is the portrayal of the dynamics involved in a family featuring two moms. The two moms are the highlight of the movie as they act like a real believable couple. Unfortunately the film does have some issues that hold it back from being a great movie. Most notably would be that much of the sexual content feel unnecessary and/or is too drawn out.  The only other real issue I found with was the move was, without giving anything away, that the ending was rather abrupt and many things were left feeling unresolved. Despite these faults it's a good movie, just not the great movie it could have been.",
      "total_reactions": 0,
      "user": "thedarkorb"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "A different approach in the institution of marriage and parenthood, on a story based on two married women whose children decide to meet the \"sperm-donor\" father and how this uncovers shades of their relationships they had  never actually confronted before.  The whole cast is magnificent whilst the script intelligently uses humour which saves the film of being over-dramatised.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2010
      },
      "score": 8,
      "text": "Benning, Moore, and Ruffalo lead an all star cast about a disfunctional family that deal with issues such as sexual orientation, sperm donners, childhood curiousity and becoming an adult. \"The kids are Alright\" knows how to tackle those issues, and does it superbly in a well-paced manner.",
      "total_reactions": 0,
      "user": "Stephchan1901"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "The extremely original, \"The Kids Are All Right\" certainly can make its own standing in cinema and that mainly is because it thrives off the performances by a top notch cast that is sure to score Oscar nominations.",
      "total_reactions": 0,
      "user": "brewcrewpride"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "The beauty of this film is that it speaks to everybody irrespective of their family set up. It's about love, jealousy and ultimately forgiveness.  Bening and Moore are superb in it and very believable as a lesbian couple I thought.   I think this is one of those films you will either love or hate.",
      "total_reactions": 0,
      "user": "olympians"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "â",
      "total_reactions": 0,
      "user": "Duke"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "haha this movie is a mixture of emotions makes you sad and makes you laugh, the script is amazing with phrases where to go, but the perfect fusion of Annette Bening and Julian Moore 2 amazing performances that deserve their awards.",
      "total_reactions": 0,
      "user": "wishmaster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "This was a surprisingly great film about family--- though lighthearted in a lot of ways, I'm was surprised by how touching it really was. All the performances were spot on, including the kids and I especially loved Annette Benning's performance. The film isn't swinging for the fences, yet sits with you afterward and I have to say it is one of the better movies of 2010. Definitely give it a shot on DVD.",
      "total_reactions": 0,
      "user": "podunk411"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "A poignant ,bittersweet, and remarkably funny take on paternity, family, and infidelity that features a stellar cast that fully realizes the complex emotions that accompany real families with real troubles.",
      "total_reactions": 0,
      "user": "DCLeahy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Fantastic, original and funny movie. Moore and Bening is a couple where connection between them is extraordinary. Ruffalo plays a father that I have never seen in another movie. All them and the children are a lovely family to forget problems. Lisa Cholodenko wrote a wonderful script and the direction is a comedy that describes current and modern family",
      "total_reactions": 0,
      "user": "0102"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "Simply put: a genuine movie that is a perfect portrayal of modern society.",
      "total_reactions": 0,
      "user": "darrrn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "It is nice to finally see an older lesbian couple with two teenage children making it into the mainstream movies. There is great acting in a real life story, claiming that keeping a family together can be at times very hard, but it is worth working on it. A very recommended social study in the form of entertainment cinema.",
      "total_reactions": 0,
      "user": "juliankleiss"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "There is a saying in sports: \"that's why they play the game.\" The same could be said for film because every viewer's opinion is going to be different. That is what makes discussion about movies so engaging. Occasionally, I find myself going against the grain of the majority, and this film is one such example. Thought it has received rave reviews from critics and done well at the awards ceremonies, I was left feeling strangely unsatisfied.",
      "total_reactions": 0,
      "user": "sailoraide"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2011
      },
      "score": 6,
      "text": "Overall this was a good film. I know that some people are uncomfortable watching a film dominated by a homosexual theme, but for the sake of the Oscars I tried to be as noon biased as I could. Bottom line this wasn't a great movie but it wasn't a bad one either.",
      "total_reactions": 0,
      "user": "MrC3030"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "One of the spectacular gifts that an actor gives is that of genuine, heartfelt emotion.  Annette Bening gives the best performance of the year and convinces me on so many levels that she is not acting, but instead acting out.  Julianne Moore does what she does best - always the bridesmaid, never the bride, with a preformance that enhances those great performances around her.  I began watching this movie with a \"minority\" appeal expectation and, by the end, realized that it had mass appeal, with anybody who had a heart being capable of that heart beating loudly.",
      "total_reactions": 0,
      "user": "moviemonger"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "The movie has a great soundtrack and good performances. There is a movie that doesn't appeal for the social conscience and which treats lesbians and gays as humans and no as people that are looked with other eyes. It's a original and truthful movie. And it doesn't want to treat of the theme of \"Homosexualism\" and yes of familiar relationship and the ripeness of people there. It doesn't has extraordinary performances. All are only okay! Forming one of the best cast of the year. A great movie, with that appeal that I hoped listen, blah blah blah of \"we must accept gays\" but I didn't see like that.",
      "total_reactions": 0,
      "user": "jimmytancredi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2011
      },
      "score": 6,
      "text": "The Kids Are All Right tries hard to be a genuine, quality, art-house type film and almost makes it. It ticks boxes in all categories but the storyline, which makes a point to seem as oddly normal as possible. For the majority, it just seems like one long ride that doesn't really lead anywhere. Character development is great but when there is only four or five characters to develop, it can't really be called an achievement. Ruffalo, as ever, mumbles. The children impress but don't dazzle. The highlight is Bening singing Joni Mitchell at the dinner table, the emotion spilling out from all that is happening around her. Her acting alone lifts the film from good to impressive",
      "total_reactions": 0,
      "user": "JasonG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "This movie definitely deserves to be in the oscar conversation.  With Ruffalo's nomination I was expecting a bit more, but Annette Bening surely lived up to her expectations.  I thought the movie really captured some of the modern problems conventional families face by showing us a ridiculously unconventional one. It felt as though you could really relate to the family at the movie while not being able to relate to them at all. I'd recommend watching this film.",
      "total_reactions": 0,
      "user": "BShea423"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "Very enjoyable movie. The only downside is one of the characters , whilst funny and a joy to watch, ends up ruining the respect of the audience which in turn drags the film to a more sober level. It turns the movie into a more serious event devoid of the humorous aspects of the first half.",
      "total_reactions": 0,
      "user": "MorriBey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "I found this movie good, but a bit overrated for all the hype it's recieved. I am a fan of everyone in it, it was well acted, it flowed great and was easy to watch.  I guess I just didn't think it was soooo good, the kind of good that you want other people to see it and you want to own it to watch again and again.  Some of it wasn't believable and I felt some things that were introduced never had follow up by the end.  Maybe these things were not supposed to be left all cleaned up, but regardless, I will say it's still worth watching but maybe not something one needs to buy for repeated viewings.",
      "total_reactions": 0,
      "user": "Ladyj333"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "This movie had so much potential, yet they chose to make it look like happiness is all about sex. The poor man is treated like a piece of meat and made responsible for it. It could have been so much better...",
      "total_reactions": 0,
      "user": "foxie1976"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2011
      },
      "score": 6,
      "text": "The Kids Are All Right has a fairly simple plot. A lesbian couple have 2 children. The two children meet there sperm donor. Easy, right? Yup, it is. The Kids Are All Right is one of the finest dramedies that I have ever seen. The acting form the cast is spectacular, riveting, and memorable. The way the film makes one character seem like the bad guy or good guy in the film, suddenly changing them to good guys or bad guys, is fascinating. The supporing actors in this films were the very best. Nothing can beat the laughs they brought ot the film or the drama they did as well. The sublte humor was amazing, for it is what I liked the most in the film. The obvious humor was also hillarious, but not as good as the subtle. They also made very crude sexual jokes most of the time, which I personally enjoyed the least.  But on the comedy side of the film, it deserves excellent marks. Next, on the drama side, this film is just full of it.  Tense, exciting, relationships, all that a drama needs. At one point, a lesbian couple is cheating on her wife, and when you notice its kinda strange that a lesbian is cheating on her wife with a MAN, you might think its comedy. But not at all. It's very true drama if it happened in real life, because it doesnt happen very often. The fast paced drama, although there wasn't much, was good. When the characters are in arguments, you notice the tension in the room, and you cant help but root for one character oover another. Lisa Cholodenko knows how to add drama factor, to the lauch factor. I aslo have to give alot of credit to the amazing acting. Annete Benning, Julianne Moore, Mia Wasikowski, Josh Hutcherson, and Mark Ruffalo all starred in this film. And they made the film a star. The ensemble cast are all perfect with each other. The casting director, who ever he/she might be, should be given an Oscar. They all seemed to love each other like family in real life, just the same way they did in the film.  You could literally feel passion coming out of the screen from each individual, as if you were part of the family, too. The acting nominations for Annete Benning and Mark Ruffalo were truly deserved. In the beggining, you thought Benning's character was going to be the villian in the story, and you also thoguth that Mark's character would be the good guy. But as the story continued on, you realized everything was not as it seemed. I personally thought Mark Ruffalo was the best actor out of all of them. He brougth so much joy and despair to every one of the characters, and you think about how he did it, but you really cant figure it out. I had mixed feelings about his character in the end, unlike any of the other characters. As you watch the film, you really have sympathy toward his character more than anyone else, and that's what made him stand out the most. So, the acting was great. But then comes the negatives. Lets narrow it down to four. (1) The crude sexual jokes. I shouldnt have expected less from a rated R film, but if you make a dramedy and most of the laughs come from sex jokes, then I would call it more of a perv dilm than anything else (but gladly most of the laughs weren't perverted).(2) The score. It was so boring and dull and was repeated so many times. Only a few times did the score fit a scene. I hope to never listen to it again. (3) Not a film to see again. Maybe one day if their were 50 films at Blockbuster, and this one was the best, then I would watch it again, otherwise the film was memorable, but I wouln't really watch it again any time soon. (4) Last but not least, the slow moving pace. At times (as I've said previouslly), the fim was fast, but sometimes it REALLY lagged. You'd see there expressions and be so bored that you might turn off the film, but then a sudden burst of comedy or dram saves you, and your back in. And that's really all the negatives in the film. Other than that, the film was excellent. The film also had a recurring message. No matter how hard you try, you can never lose family, and they will never lose you. Check back at my page for a new review every week. Thanks and enjoy the film.",
      "total_reactions": 0,
      "user": "Shahmeer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "great movie.  i loved it.  it was funny and had great acting sequences.  Bening and Moore give great performances of the movie.  Mark Ruffalo was good too.  the movie was great.  it was a good drama.   one of my favorites of last year.",
      "total_reactions": 0,
      "user": "lovemusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "Some may see the lead actors Annette Bening and Julianne Moore playing a lesbian couple as the main draw of this film. But the Kids Are Alright isn't really about sexuality, not really. It's about family. It has something to say about every family, any family, even if the film's family is far from typical. Bening and Moore are predictably solid in their performances, but the true highlights are Mia Wasikowska and Mark Ruffalo. Wasikowska once again proves herself to be a formidable young actor - she is effortlessly natural, but also able to handle the more emotional scenes with ease. Ruffalo has the unenviable task of not only sharing the screen with such talent, but of playing the character who threatens to tear this unusual, but reasonably stable family apart. While he is the cause of most of the disequilibrium in the film, he is so likeable as an actor that it is hard to not be on his character's side. The Kids Are All Right is well written, extremely funny and thoughtful. The story involves you from the start, and you are instantly invested in the characters. It's something really quite special.",
      "total_reactions": 0,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "a well made comedy about kids who decide to reunite with their biological self-centered father who is terribly seeking for something that will make himself happy (in this case - a family) and is portrayed by Mark Ruffalo. a relationship that in the end causes a lot of troubles to the whole family.",
      "total_reactions": 0,
      "user": "Bones"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "Probably the best cast ensemble of 2010. A funny and emotionally driven movie that wouldn't be possible without this cast of great actors and actresses.",
      "total_reactions": 0,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "If the central purpose was to discuss the implications and difficulties of same-sex marriage, the film falls short of its premise. If its central purpose was to entertain with some clever jokes and great acting, then 'The Kids Are All Right' does a good damn job.",
      "total_reactions": 0,
      "user": "Potter17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "this is a beautiful and amazing... is a simple history of the modern's familys that this days... benning is just stunning his acting is painful and beautiful... one of the best movies that i even see these days",
      "total_reactions": 0,
      "user": "jaimed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "This film is a emotional and heartfelt rendition of your \"average\" American family. Filled with real, believable performances and an excellently written script. 4/4 stars.",
      "total_reactions": 0,
      "user": "marnee96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "Honestly, this is one of the best movies ever. It combines perfectly witty dialogue with pitch perfect acting and a hint of drama on top. \"The Kids Are All Right\" tells the story of a lesbian couple who have grown far apart. Nick, Annette Bening, is a constantly working mom who has to juggle a torn marriage, work, and two kids, each semi-rebelious. Jules, Juliane Moore, is struggling with her business and trying to figure out if she still loves Nick. When their two kids, Laser (Josh Hutcherson) and Joni (Mia Wasikowska) contact their biological father, it stresses  Nick and Joni's marriage and tests their loyalty. The movie overall has very strong performances, especially by Juliane Moore and Annette Bening, and a",
      "total_reactions": 0,
      "user": "elreader46"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 9,
      "text": "Full of originality. There is plenty of wit, cleverness and comedy to go around. All while dissecting a contemporary issue amidst a modern love story.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2012
      },
      "score": 4,
      "text": "The Kid's are alright wasn't really alright. Another predictable film with parts here and there that were good and sort of funny. Why was it up for best picture? That question boggles my mind.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "Even with its unique storyline, it is still rather bland. However, the movie manages to pull off great performances by Annette and Julianne. The script for the most part is humorous and sentimental.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "The Kids Are All Right is manna from heaven for viewers seeking comedy-with-substance resting on great writing handed to gifted actors. The film offers a world of complicated personalities, personal relationships, and life changes of universal resonance. These elements are adroitly made rich through scenes that make no fuss about getting straight to the heart of the matter, painting deep, convincing back stories that fill out the core characters. These core characters are a couple, Jules (Julianne Moore) and Nic (Annette Bening), and the biological father of their children Paul (Mark Ruffalo), who enters the picture when their daughter Joni (Mia Wasikowska) contacts him at the behest of her younger brother Laser (Josh Hutcherson). Nic appears businesslike and levelheaded, and Jules free-spirited and needy. Paul is an emotionally immature bachelor who runs an organic restaurant. Joni is soon heading to college. Laser is an aimless, well-meaning, young teen. All rest at the edge of difficult life changes -- reaching out for amorphous, unknown \"nexts\" -- accelerated and amplified when Paul enters the picture, and the family. With Paul's arrival, change happens quickly and significantly -- the characters confront and deal with great upheaval both within themselves and in the context of the family unit. Although it sounds serious, this is also a spot-on funny film that brilliantly elides between, and marries, comedy and tragedy. All of the lead actors are stellar, particularly Moore and Bening. As the film has set in my mind, I find it's Bening's performance that stands out most. Both Moore and Bening play the tiniest of moments with extreme intelligence and wit. The audience receives less overt insight into Bening's character, but those glimpses, coming in quick succession and plainly constituting the fulcrum of the story, are rendered flawlessly. Still, it's both actresses' range, timing, and subtlety make this a great rather than good film.",
      "total_reactions": 0,
      "user": "JMH"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "This is a wonderful, little film. Entertaining, charming, realistic, relatable...all of the above. The acting, and script came together to really illuminate the dynamics of the modern family. It would appear that some people didn't receive the ending well, but I think the ending is very fitting for the story. Not all gifts come with a bow and that's what the ending is to me. In fact, I don't think it needs a bow. The contents alone is what makes this movie stand out. I highly recommend it.",
      "total_reactions": 0,
      "user": "rachiebabie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "The Kids Are All Right is my favorite type of movie; it's human. A film about the human condition, love, passion, sexuality, and family, The Kids Are All Right is a remarkably human film that can be both funny and moving seamlessly. The writing and direction from Lisa Cholodenko is authentic and subtle, respectively. This all-star cast is fantastic, led by Julianne Moore, Mark Ruffalo, and Mia Wasikowska. All of the characters here feel authentic and the actors all really capture the essence of the characters and what they represent on the larger scale. On the whole, this is what makes the film so great; it feels like a slice of life type film. It is just a segment of the characters' lives and how things turn out, we do not know but it does not truly matter. What does matter is how they handled this major situation in their lives. For this portrayal of life, this film is a winner.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Instead of taking the route that leads to a 'happy family' type of ending, The Kids are All Right instead serves as an example of how families can be torn apart when trust dissipates.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2016
      },
      "score": 7,
      "text": "Director and co-writer Lisa Cholodenko delivers a take on the traditional family drama that is not only refreshingly quirky and heartfelt, but unflinchingly brave in its willingness to place its characters into morally oblique situations that ultimately help form more interesting thematic statements on some of the complex matters at hand. Marriage, growing up, what it means to be a parent - all of these issues are discussed to an impressive degree. But, where this movie really excels is in its performance work. It's hard for a movie to sink when you have such heavy-hitters as Annette Bening, Julianne Moore, and Mark Ruffalo giving it their proverbial all in nearly every scene. Indeed, \"The Kids Are All Right\" is not just an effective piece that discusses salient issues relative to contemporary society, but its also just a very well-acted and well-put-together film in general.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "I liked the film. The performances are great (Annette Bening especially) and the pacing was good, but I think this film is very overrated. This was not the cutting-edge family drama I was expecting. Bening completely deserved her Oscar nomination, but that should have been the film's only nomination.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "The kids are not all right. This film is so pretentious it comes off as smug and arrogant. It reveals nothing new about so-called 'lesbian' relationships, something that doesn't strike me as important, while creating unlikable characters who aren't worth ten minutes of any screen time whatsoever. The most sympathetic character was the straight middle aged hipster, and I felt he was annoying. It's a film without any style or freshness, so to speak. I could barely finish it.",
      "total_reactions": 0,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "The Kids Are All Right isn't just a film that blended family comedy and LGBT movies, it's hysterically funny, witty, and emotional. The screenplay and story are bolstered by amazing, believable performances, and the messages and themes about family values really seem to mean something.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "The Kids are All Right. They really are. I think I connected with Joni a lot on a few topics because I'm practically the same age as she is right now. It takes place in her last summer at home, which I'm fast approaching. With only 6 more days of school until graduation I totally relate to the whole moving away aspect. The whole tone of the movie was set in the opening scenes, with Laser asking Joni to call their sperm donor. I thought this conversation was very awkward and out of place but I also think that was a feeling that was meant to be there as really the whole feeling of the movie was intentionally awkward and uncomfortable.",
      "total_reactions": 0,
      "user": "hanneguacamole"
    }
  ]
}