{
  "mc_avg_user_score": 7.8,
  "mc_metascore": 42,
  "mc_mixed_rating_frequency": 1,
  "mc_movie_name": "The Perfect Game",
  "mc_negative_rating_frequency": 0,
  "mc_positive_rating_frequency": 3,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "A great story.  The rough edges match the themes of the inspirational story. Child actors sometimes talk in a way adults think is forced or inauthentic.  Any teacher or coach of the young is not surprised by any of the dialog.  What took them so long to produce this film?",
      "total_reactions": 0,
      "user": "SoccerFan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "Based on a true story and set in the small of town of Monterrey, Mexico, during the 1950, a group of kids obsessed with baseball, dream to form a team and play in the Little League World Series. The problem is, that not only don't the kids know how to play, but they don't have a coach or even a field. Until one day, the kids encounter a former St. Louis Cardinals prospect, Carlos Faz (Clifton Collins), who takes on the  nearly impossible task of preparing the kids to play in the tournament. The Perfect Game is very inspirational and the kids are adorable, but the film is severely lacking the usual characteristics of a sports film. It's the kids that make the movie, earning your admiration, while making you laugh and cry at the same time, but as a baseball fan, I expect some kind of sports action to be associated with a film like this. All the on field scenes are turned into montages of kids hitting, catching, and throwing, but there are no specifics or real-time game intensity. It's this seemingly small element, that prevents a good film from becoming a great one. Clifton Collins stars as coach Faz and gives a great performance. Collins is an actor I generally don't like, I find that he doesn't fit into many of his roles, but he really surprises me by being everything these kids needed and more. The lead child star is Jake T. Austin, who is now a nineteen year old heart-throb on the ABC family show, The Fosters. I've never seen him in anything before, but it was amazing to think he was only twelve years old when this film was made, because he was the strongest member of the cast. Austin was emotionally charged and was the kid that I wanted to see succeed the most. The film is presented as a sports movie, about the first international team to play in the Little League World Series Tournament. However, it is less of a sports movie and more of a drama about what the kids had to do just to get there and the hardships they faced once they were there. I was disappointed by the lack of real-time sports action, but impressed by the performance of the young cast and what they had to face during such a racial charged time in American history.",
      "total_reactions": 0,
      "user": "Tss5078"
    }
  ]
}