{
  "avg_user_score": 7.1,
  "metascore": 58,
  "mixed_rating_frequency": 29,
  "movie_name": "The Voices",
  "negative_rating_frequency": 4,
  "positive_rating_frequency": 54,
  "pro_critic_reviews": [
    {
      "critic": "Eric D. Snider",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2014
      },
      "score": 90,
      "summary": "Here is a pitch-black psycho-horror-comedy to restore one’s faith in the “What the eff did I just watch?” genre."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 88,
      "summary": "The Voices is a deeply warped, darkly funny and thoroughly depraved horror comedy... and whether you find this sort of thing walk-out-of-the-theater distasteful or wickedly subversive, I’m fairly confident we won’t see another movie like it for quite some time."
    },
    {
      "critic": "Daniel Fienberg",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2015
      },
      "score": 83,
      "summary": "Perhaps a little more successful when winking at genre expectations than when playing things straight, The Voices is funny, disturbing and whimsical."
    },
    {
      "critic": "Ben Nicholson",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 80,
      "summary": "Not only is The Voices uproariously funny throughout, but it's actually far cleverer than one might expect."
    },
    {
      "critic": "Brad Wheeler",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "Think of this stylish, quirky and quite grisly feature from Marjane Satrapi as a meeting of \"Psycho,\" \"Dexter\" and \"Dr. Doolittle.\""
    },
    {
      "critic": "Brian Tallerico",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "I’ve always liked Reynolds for the most part, but he does his best work yet here in Satrapi’s odd, pitch-black comedy about a man who talks to his dog and cat. And they talk back."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "The quirky film is simultaneously bizarre, humorous, disturbing and suspenseful."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "Ryan Reynolds is chillingly perfect as a nice-guy factory worker struggling with schizophrenia and murderous impulses in this tonally wild indie, which is nearly too horrifying to be funny — but not quite."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "It’s a tormented Tony Perkins at the Bates Motel, re-imagined by \"Saturday Night Live,\" with all the risks implied."
    },
    {
      "critic": "James Rocchi",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2015
      },
      "score": 75,
      "summary": "It’s a bit of an irony that The Voices doesn’t have much to say, but the fact of the matter is that it’s the tone and the tenor of the film that make it most watchable; a truly hilarious film about truly horrible things, the real artistry in Satrapi’s direction of The Voices speaks for itself."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 70,
      "summary": "It’s a ready-made cult movie, complicated and weird and grotesque and distinctly silly, and best when not taken remotely seriously."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2015
      },
      "score": 70,
      "summary": "The Voices is a perfect film that's hard to watch."
    },
    {
      "critic": "Boyd van Hoeij",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2015
      },
      "score": 70,
      "summary": "The film’s combination of psychological drama -- cue the childhood trauma -- with blood-splattered limb-cutting, talking heads in the fridge and talking pets on the couch is a risky one that finally works because Perry and Satrapi find the right tonal mixture for the material."
    },
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "For all its flashes of ingenuity, The Voices is secretly more scared than scary, lacking the truly disturbing ambition to get real."
    },
    {
      "critic": "David Ehrlich",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "Directed by cartoonist-turned-filmmaker Marjane Satrapi (‘Persepolis’), ‘The Voices’ steamrolls over boundaries between genres and giddily ignores the limits of good taste."
    },
    {
      "critic": "Nick de Semlyen",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "Full-force performance form Ryan Reynolds but not as funny as it hopes it is."
    },
    {
      "critic": "Kevin Harley",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "Reynolds moves on from Green Lantern in Satrapi’s psycho-romp, pitched awkwardly between funny-haha and funny-peculiar, but blessed with enough style and smarts to merit a look."
    },
    {
      "critic": "Xan Brooks",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2015
      },
      "score": 60,
      "summary": "Satrapi's disreputable little creepshow finally doesn't amount to a hill of beans. Maybe that's fine. The Voices provides an enjoyably trashy antidote to the traditional Sundance fare of soulful drama and crusading documentary."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2015
      },
      "score": 60,
      "summary": "In tapping Satrapi to interpret this project, the producers have done about as well as one could expect with such material. Still, a bit more consistency in style would have gone a long way."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 58,
      "summary": "Satrapi makes some bad calls in her attempts to balance bleak humor with bleaker thrills, including ending the film on a glibly cheerful note. Her best decision, bar none, was entrusting such heavy material to the guy who played Van Wilder. Behind that perpetual smirk lurks a talent for quiet depravity. Bonkers looks good on him."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "This film really doesn’t know what to do with itself, except to show us the difference between Jerry’s happy world and his dark world as if it’s some kind of revelation; it’s the one move the film has, and it does it over and over again."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "The big question here is why any of The Voices, as crisply made and stylish as it is, should matter or entertain. The cold truth is that it doesn't."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 30,
      "summary": "Grisly but not especially suspenseful, tongue-in-cheek without any real wit, The Voices aims to hit the intersection of horror and comedy but tumbles into an uncanny valley of tedious creepiness."
    },
    {
      "critic": "Chuck Bowen",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2015
      },
      "score": 12,
      "summary": "For most of the film's running time, one mistakes the main character's callousness for the filmmakers'."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "Ryan Reynolds is a terrific actor, and Jerry in \"The Voices\" might be his best performance yet. Wonderfully weird and psychologically twisted, \"The Voices\" is a mix between \"Filth\" and \"Donnie Darko\" with its own personality. A must-watch.",
      "total_reactions": 2,
      "user": "Duskspark"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "Ok....Reynolds brings back his Just Friends Character and now hes got a awesome cat....and he kills a girl and I hope the movie tries to make it seem like the pillz made him do all of it....antidepressants are just like methadone and suboxone and its completely insane...oh man....this is the feel good movie of the world....i love seeing pretty women get killed....its just like god taking away the gift of prettiness when they didn't deserve it...women=shallow overpopulaters",
      "total_reactions": 2,
      "user": "CameraBounceGod"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "Ryan Reynolds gives a bravura performance as unhinged Jerry, anchoring an film that's fun and funny (but desperately slight and forgettable) in equal measures.",
      "total_reactions": 2,
      "user": "EdgarReviews"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "no se como explicarlo, pense al ver el trailer  seria una comedia o algo asi, despues  dio un giro completamente recortico pero muy interesante y me mantuvo a mi y a mi esposa al filo de la trama, esta muy divertida y ala vez escalofriante, es una mezcla tan rara pero fue una gratisima experiencia, las actuaciones impecables, realmente viven cada uno de los actores sus personajes, es algo oue no se suele ver en estos dias. la recomiendo muchisimo",
      "total_reactions": 3,
      "user": "dedobuho"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Who every thought that a movie starring Ryan Reynolds where he talks to his pets like Doctor Dolittle that tell him to kill people would actually make a pretty damn enjoyable film.",
      "total_reactions": 1,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "It's hard review this movie as mediocre since at its core everything seems to be in order: you have a great highlight reel from Reynolds, a terrific cast all around -- some funny concepts I don't think I have seen before and some truly dark writing. I think the main problem here is the movie is not very enjoyable to watch. You have to wonder how believable the characters actually are with the tendencies expressed. Think of this as movie prep for Deadpool.",
      "total_reactions": 3,
      "user": "vgmkyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2016
      },
      "score": 6,
      "text": "It's an off-beat film, with a strangely compelling performance from Ryan Reynolds. It's funny and weird and maybe about something. But it's also missing something.",
      "total_reactions": 0,
      "user": "DirigiblePulp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "If WTF kind of black comedies it is you are after you will not go wrong with 'The Voices' which if it weren't for the slightly deflated ending it would have been a brilliant film.  Reynolds and the cat are both absolutely amazing.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "Making a film that deals with murder and mental illness was always going to be a fine balancing act and The Voices is a valiant effort, but in the end it struggles to find (ironically) its voice. Ryan Reynolds is excellent as the loner looking for love in a small town who has a nasty habit of killing people, aided by the voices in his head, which he hears coming from his pets, while Kendrick and Arterton seem to be having a blast. The film really comes into its own in the final stretch as we see the life Reynolds has really been living instead of through his drug tinted spectacles, and its in these claustrophobic, disturbing scenes that we see the tone the film maybe should have taken throughout.",
      "total_reactions": 0,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "Amidst overwhelming dark circumstances, The Voices proves to be an extremely thought provoking look at mental illness and life. There are hints of humor - but you may find it difficult to label this one as any kind of comedy. As Jerry, Ryan Reynolds gives one of the finest performances of his career.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "This isn't a bad movie, wasn't what I was expecting at all and was thrilled with the results. The concept of shifting realities based on perspective was pretty good and made for some interesting designs.",
      "total_reactions": 0,
      "user": "kuehnau"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "The Voices serves as a great platform to Ryan Reynolds to show off his skill and he really takes that opportunity and runs with it. He is phenomenal in a truly unhinged and chilling performance. He plays the mentally ill psycho very well and almost convinces you it's not an act. The film is kind of funny, but operates better when it focuses on the psychological aspect and really offers some interesting viewpoints on mental illness and the thoughts of the everybody in the world as well. It is actually an interesting film in that regard, but the final scene is where it truly goes off-the-rails. That final sequence that stretches into the credits is one of the worst things I have ever seen and really took the air out of the rest of the film. It was so bad, in fact, it made the film as a whole suffer. Fortunately, it is a really fun and horrifying time made all the much better by the fact that Reynolds is truly engrossing as the lead.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2015
      },
      "score": 9,
      "text": "The most hilarious, somewhat suspensful and somewhat good-feeling (I dunno...) mind **** of a film I have ever experienced. Never before in my life have I been able to laugh so hard and also feel that chill down my spine. Outstanding performances in and out. Sensational movie.",
      "total_reactions": 0,
      "user": "TrilobiteG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "One of the best movies I have seen this year.  Ryan Reynolds and his pets do a great job of illustrating serious mental illness, both on and off of mind-numbing medications.  Pay attention to to Jerry's room when he goes back on his medication and his psychotic view of the world smooths out.  Extremely clever.",
      "total_reactions": 0,
      "user": "BogKid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "i love this movie, ryan Reynolds in a outstanding movie finally where he can show his talents buy or check this one out for sure you wont regret it trust me.",
      "total_reactions": 0,
      "user": "MrThehammer171"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "This film is quite disturbing, nevertheless it's so much fun to watch. Some interesting characters, and a dash of lunacy.",
      "total_reactions": 0,
      "user": "lordcsx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2016
      },
      "score": 6,
      "text": "The Voices is actually a rather interesting movie. The film provides a look into a mentally damaged psychopaths head in a funny and kind of touching way whilst not condoning his actions but helping you understand how they may think.",
      "total_reactions": 0,
      "user": "oDjento"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "With an original idea,great acting,great special effects and an emotive ending, The Voices brings new and refreshing ideas for a movie that is surprisingly funny and entertaining.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2015
      },
      "score": 7,
      "text": "This movie would have been way better, if it wasn't for the cheesy sing-along ending. I think it offered a great insight into an ill mind, and did a great job of exploring a depth of such a strange character.",
      "total_reactions": 0,
      "user": "Darth_Kane"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "A minute after the trailer for The Voices started I wanted to see the film. So I was waiting for it to premiere in Paris. I hoped that more of the cast would come but I was glad to see Marjane Satrapi. I know Reynolds is shooting Deadpool so he gets a pass, as for Aterton I know she has her musical but London is a mere two hour train ride away she could have made an effort. Anyway, Satrapi quickly spoke about how the movie came about. Persepolis and her Oscar nomination for it changed her life. Her American agent offered a lot of projects that she wasn't feeling but to me it sounds like they sort of put her in a box. But The Voices was different and refreshing from what she had dine so far, so she went for it and in my opinion it was a good decision.",
      "total_reactions": 0,
      "user": "wornoutspines"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "Surreal, gory, absurd but nonetheless light-heartedly comedic.  Ryan Reynolds and his 2 pets deliver a stellar performance!    Reynolds is a lovable serial killer, which is a difficult dichotomy to achieve.  Anna Kendrick is also quite adorable in this movie.  It's definitely worth a rental if you're up for a good laugh, and you're not too squeamish.",
      "total_reactions": 0,
      "user": "ericjover"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "Really enjoyed this movie. It was quirky and hilarious. I really love dark comedies such as this. Great cast. Totally wasn't what I was expecting but great.",
      "total_reactions": 0,
      "user": "Stargirl04"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2017
      },
      "score": 9,
      "text": "Voici un gars qui entend des voix dans sa tête et qui parle à son chien et son chat... oui, un brin perturbé le brave et d'ailleurs il suit un traitement. Ou plutôt, il a arrêté de prendre ses cachets !",
      "total_reactions": 0,
      "user": "Broyax"
    }
  ]
}