{
  "mc_avg_user_score": 7.3,
  "mc_metascore": 53,
  "mc_mixed_rating_frequency": 64,
  "mc_movie_name": "The Blind Side",
  "mc_negative_rating_frequency": 38,
  "mc_positive_rating_frequency": 250,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "It's funny when a true story of kindness is made into a film, some people see it as racist. I get the horrible feeling that those people are racists themselves. It's almost like they can't stand seeing a blackman do well and being accepted for who he is.",
      "total_reactions": 2,
      "user": "Snuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "Rich family takes in homeless teen, help him get grades, starts playing football, gets good at it, tough childhood keeps haunting him.",
      "total_reactions": 1,
      "user": "ERG1008"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "Good movieee . it was sadd and amazingg .. not as greatt as country strongg ! but Tim Mcgraww is awsomee ! and yess this was a good moviee !!! If you haventt seen it yett you need to soon ! its gonna be one of your to favoritess !!!",
      "total_reactions": 1,
      "user": "AddieLaurenn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "A great movie for you and the family its truly touching and amazing how a southern rich girl would take in a poor young african american boy it is truly touching i certainly reccomend it 10/10",
      "total_reactions": 1,
      "user": "kaj510superdude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "This movie is held on a level that I don't understand. Sandra was not brilliant and the movie lacks any creativity or originality in it. Contrived and predictable. This is just an ok cliche movie that is kind of boring.",
      "total_reactions": 1,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2014
      },
      "score": 9,
      "text": "If you fail to see that they're just human beings helping each other, you are the racist ones. The movie is worth watching, very inspirational and sad at times. And yeah, Sandra Bullock is outstanding.",
      "total_reactions": 1,
      "user": "FoeXVII"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "This is definitely Sandra Bullock's film. She was extraordinary, and more so considering how she usually is. No one expected this from her, including herself. It is a very nice story, which could be seen as the \"white saviour story\".. but since it's a true story, that kind of falls in the background of it. Overall, definitely a touching and moving story about a woman who has a lot of love (and money) to share and who actually does it, regardless of what other think or say. Good film!",
      "total_reactions": 6,
      "user": "smijatov"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "\"The Blind Side\" isn't a movie where you cry at amazing performances and heart throbbing dialogue. It's a movie that will roughly intercept your mind for a painful tear.",
      "total_reactions": 7,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "The film belongs to Sandra Bullock who delivers a brilliant performance (possibly the best one of her career), but the focus of the overall effect is sloppy. The story is boring at times and I think the film was too long. I didn't live up to expectations. Newcomer Quinton Aaron wasn't a good fit, he wasn't the best of actors. He definitely looked the part (being tall and all) but his performance was very wooden. Another newcomer Jae Head is the heart of the film. It's probably one of the highlights of the film. Overall, the film is warming but tiring that is full of unnecessary scenes, forgettable characters and elements of the story that just don't work. I have it's cute and worth the watch but only for Bullock, Head and again, the football aspect of the story.",
      "total_reactions": 3,
      "user": "shlugalug"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "The performance by Sandra Bullock TOTALLY deserves the Academy Award.",
      "total_reactions": 5,
      "user": "danielkstanedam"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2010
      },
      "score": 6,
      "text": "The film doesnâ",
      "total_reactions": 2,
      "user": "Mornington"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "This movie is inspirational, it tells people not to judge people by their skin color or their appearance. It is a heart warmer, it has one of the best plots of 2009, If I was a dog- 4 THUMBS UP!!!!!!!!!",
      "total_reactions": 7,
      "user": "RyanLopez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "“The Blind Side” is a good movie. The story is the same heartwarming tale that’s been said and done many times. I can’t help but feel that I’ve seen this kind of movie before. Then again I don’ really care. The movie begged to original and to some extent I guess it was it just didn’t make me cry, simile, or anything of the sort. If you like a good old football movie about a guy who goes from nobody to somebody than this is the movie for you.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2011
      },
      "score": 3,
      "text": "I still don't understand the hype over this movie. Extremely disappointing. An over achieving conservative takes in a poor misdirected African American. Republicans were eating this crap up. While the story is good and heartfelt, the movie was going through the motions. It new it was a good story and was just cashing in on people's emotions. Boring and eye-rolling bad. Sorry, Sandra Bullock's performance was not the best of the year.",
      "total_reactions": 0,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2012
      },
      "score": 3,
      "text": "Upon seeing the trailer for The Blind Side, I had a good idea how I would react. Upon viewing the final product, my suspicions were validated. Its heart is entirely in the wrong place. The movie ought to be about Michael Oher and how he achieved success, but this is not the case. The Blind Side centers around the kind Southern white woman who takes in an underprivileged black youth. Her kindness, not his struggle, is what the movie is about. To the actors' credit, everyone does a good job. The leads are mostly great, especially Quinton Aaron, but the direction and writing undercuts the performances. The Blind Side is all uplift and no substance. When the movie isn't trying to win your heart with its blatant emotional pandering, it's trying to warm it with sentiment-heavy and sitcom-lite humor, a rather nauseating combination. Also problematic is the unflattering portrait of African Americans. In the movie's eyes, if black people aren't waiting for kind white folk to lend a helping hand, they are either unable to support their families or are manipulative bullies. I suppose there is one business-professional African American woman, but it's telling that she is introduced as a villain. There are moments in The Blind Side where a better movie shines through, one with both the appropriate seriousness and sweetness for the situation, but this better movie is largely overshadowed by the mediocre one in the foreground. It is sadly telling about the state of film when movies like this are nominated for Best Picture.",
      "total_reactions": 0,
      "user": "Myffubs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "The Blind Side is your average feel good movie but its one that unlike almost every other one, actually has teeth.  Be it Sandra Bullockâ",
      "total_reactions": 0,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "This great, hilarious and moving film is based on the true story of Leigh Anne and Sean Tuohy who take in a homeless teenage African-American, Michael \"Big Mike\" Oher. Michael has no idea who his father is and his mother is a drug addict. Michael has had little formal education and few skills to help him learn. Leigh Anne soon takes charge however, as is her nature, ensuring that the young man has every opportunity to succeed. When he expresses an interest in football, she goes all out to help him, including giving the coach a few ideas on how best to use Michael's skills. They not only provide him with a loving home, but hire a tutor to help him improve his grades to the point where he would qualify for an NCAA Division I athletic scholarship. This is a must see film and if i could i would watch another million or even two million times! so go and get the dvd from your local dvd store or online store NOW!!!",
      "total_reactions": 0,
      "user": "ImogenDulieu987"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "There is no doubt that The Blind Side is a good movie, which includes with a strong performance by Sandra Bullock. But it's goodness is tainted by tonal confusion, an irritating child character and plenty of corny and cheesy moments.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "It falls for too many sport cliche's to actually be Oscar Nominee worthy and it is too sentimental, but Sandra Bullock gives a crowd pleasing performance. I give this movie 59% of a good movie.",
      "total_reactions": 0,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "Underrated by critics and overrated by audiences. This film was a nice feel good true story but it just wasn't as good as everyone said it was. The people that will like this are athletes of course. But by experience the people that like to play sports don't know what a good movie is. What's with the talk of Sandra Bullock's strong performance. I didn't see any acting that was special. The writing wasn't as good as I thought it would be. Overall it is a good movie just not the best from the 2009 Academy Awards.",
      "total_reactions": 0,
      "user": "MetallicCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "The Blind Side could easily be classified as another film about sports, in this case football, but it is really about social consciousness, breaking prejudices and self-improvement against all odds. This beautiful and touching story shows the life of Michael Oher, a poor street boy who with the help of Leigh Anne, a wealthy housewife, will be successful in life. As the situation develops the protagonist starts asking questions to himself; this part is very interesting because it represents the typical questioning of adolescence. Some examples are: should you always do what others tell you to do? Or sometimes you do not even know why you are doing something; and honor is the real reason either you do something or you don’t, is who you are or maybe who you want to be. Apart from that is captivating the title of the picture; it is called the blind side because every time something bad happened during his difficult childhood the protagonist closed his eyes. The problems of the movie are that recurs excessively to the sports, when it should be used just as a way to transmit the message; and the final investigation is totally out of placed, seems that this part is just filling space. Last thing to say, the film was made for Sandra Bullock.",
      "total_reactions": 0,
      "user": "NedRyerson1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "The Blind Side's may not be enjoyable. It may not be likable. Some may eve hate it. But it has two things going for it. 1. A powerful performance from Academy-Award Winner Sandra Bullock. 2. It's a true story. Like it or not, the facts are what they are. The film is touching, compelling, and brilliant in its storytelling, And it damn sure knows it football.",
      "total_reactions": 0,
      "user": "Critic2012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "First off, I would give this a 9.25 out of 10. Acting is good. Sandra gives a great performance, but time to time she just annoying, and the rest is all right. Score is descent. Not the best. Story is really good. Telling the story of micheal oher is just great. The football scenes are all right. It like each time they blow each team out, it's just not beleiveable. Overall, blindside is a great sports film.  With all the heart, this is for everyone to go and see.",
      "total_reactions": 0,
      "user": "Juanolo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "This was a wonderful film which really showed the problems face in modern day America. Even a good intentioned act can be made to look like a dishonourable one. I'm not sure how great Bullock's performance was but I do think that it was the best of a poor year's showing from actresses across Hollywood. Sports movies do not normally go this deep, but The Blind Side shines through all the hardships faced by Michael Oher on his road to becoming an NFL player.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "Sandra Bullock was the only good thing about the film. It adhered to a certain formula and it's basically a feel-good movie that falls short of being uplifting.",
      "total_reactions": 0,
      "user": "Seriosity"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "Such a cool movie with a touching messag to not let the past define who you are. I liked Michael as I felt for the character even though I did not have similiar experireinces like that. Sandra Bullock does a terrific job. This is a movie that is even inspirational to me.",
      "total_reactions": 0,
      "user": "dante_finn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2016
      },
      "score": 9,
      "text": "It's amazing that even so simple can snag her melodrama and thrill with a beautiful story    .",
      "total_reactions": 0,
      "user": "Iky009"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2016
      },
      "score": 7,
      "text": "Regardless of how you feel about the film's unintentional insinuations on race, there's no denying the inspiring nature of the unbelievably true story depicted in John Lee Hancock's \"The Blind Side.\" It's a film that overcomes its occasional slow-pacing and made-for-TV-esque presentation with honest pathos and a powerhouse adhesive of a performance from Sandra Bullock. Like the film's soft-spoken left tackle protagonist, \"The Blind Side\" is a film that comes in like a lamb and goes out like a lamb - but it sure is a lamb with a big heart.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "Very good story and great performances. Sandra Bullock was great especially. The whole movie was entertaining and kind of funny. I can't believe this really happened.",
      "total_reactions": 0,
      "user": "mds03"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "this is a great movie based on a true-story i think Quinton Aaron did a great performance  however i think Sandra Bullock did not get the part right (yes i know she got an Oscar for this part) but i think she's too uptight to be in a movie like this also Tim McGraw get's very nervous in-front of a camera which is the exact opposite of acting  somehow i think some people weren't right for their parts  but i loved the story.",
      "total_reactions": 0,
      "user": "ExKing"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "Sandra Bullock proves her acting ability once again in this fabulous film that depicts how a homeless boy becomes part of an upper-class family and develops skills for football.",
      "total_reactions": 0,
      "user": "sil3nt_nick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "Good drama,acting,direction. Everything",
      "total_reactions": 0,
      "user": "RaymondMendez19"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 3,
      "text": "When I heard all the buzz about Sandra Bullock's performance in The Blind Side, I decided that I just had to rent the DVD. When I heard all the buzz about papaya, I decided that I just had to try some. Both decisions left a bad taste in my mouth.",
      "total_reactions": 0,
      "user": "G_Thomas_Boston"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "There is no tear jerking performance, but it's pretty darn close. Sandra Bullock is outstanding in this film, and this is one of the best football films.",
      "total_reactions": 0,
      "user": "Jamison12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "It's ridiculous that this movie was a best picture nominee  why  a typical american story",
      "total_reactions": 0,
      "user": "AliBenzekri"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "The Blind Side sees some good.",
      "total_reactions": 0,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "One Word: Great!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "total_reactions": 0,
      "user": "seahawks2015"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2014
      },
      "score": 9,
      "text": "The Blind Side was an amazing biopic of Michael Oher. It is way better than the critics of Metacritic actually say it is, because they always look on the bad side of a film.",
      "total_reactions": 0,
      "user": "chw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "The Blind Side is a great movie, for anyone. I just would not be able to understand why someone couldn't like this movie. All the characters are all so loveable. Quinton Aaron plays one of the most loveable role I have ever seen and a movie and he does it by speaking very few words considering he is in a lead role. That is something to be proud off. Sandra Bullock also plays one of the best performances if not the best performance of her career. I need to watch more of her stuff. Plus the supporting characters are just so good and the family is just so cute like Tim McGraw is like the perfect father figure. Jae Head and Aaron had unlikely chemistry and their scenes are some of the highlights of the film. This film just shows that there are people willing to go beyond the call of duty for basically no personal gain and all it took was a little structure to make Michael Oher well established young man.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "The Blind Side is a fantastic movie and great for the whole family. Very inspirational and nothing wrong with it. Sandra bullock plays a great role as the mother and Tim McGraw as the father. Quinton Aaron really captures the role as Michael Oher and does a fantastic job throughout the whole movie. I really suggest this movie for anyone who loves a great story!",
      "total_reactions": 0,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "I don't like football. I don't really like the south. I didn't like the theme. And honestly I didn't like The Blind Side. I'm not gonna go super in-depth here in this review because I don't feel that plot had any surprises and could as easily be found on the Wikipedia page, so I'll just give you my comments.",
      "total_reactions": 0,
      "user": "hanneguacamole"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2015
      },
      "score": 10,
      "text": "A wonderful and uplifting story! It really spotlights the inherent goodness, generosity, and charity of mankind.  Sandra Bullock is perfect in her role, she brings to life MLK's words: judge people not by the color of their skin but on the content of thier character.  And by doing this, she is able to help the talented teen Michael Oher.  Also I loved supporting actress Lily Collins' character. A very well-done movie in all aspects!",
      "total_reactions": 0,
      "user": "kat267"
    }
  ]
}