{
  "mc_avg_user_score": 8.1,
  "mc_metascore": 72,
  "mc_mixed_rating_frequency": 112,
  "mc_movie_name": "The Cabin in the Woods",
  "mc_negative_rating_frequency": 82,
  "mc_positive_rating_frequency": 801,
  "mc_pro_critic_reviews": [
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 100,
      "summary": "By the time the ride is over, director Drew Goddard and co-writers Goddard and Joss Whedon will change course three or four times, nodding and winking but never losing momentum."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2012
      },
      "score": 100,
      "summary": "The Cabin in the Woods isn't merely another \"Scream\" exercise in self-awareness, or a \"Scary Movie\" spoof of the same. It's a wickedly smart hybrid mutation, biting the severed hand feeding the genre."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2012
      },
      "score": 91,
      "summary": "It's an exercise in metafiction that, while providing grisly fun, never distances viewers. And it's entertaining, while asking the same question of viewers and characters alike: Why come to a place you knew all along was going to be so dark and dangerous?"
    },
    {
      "critic": "Ian Buckwalter",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2012
      },
      "score": 90,
      "summary": "A horror-movie attic sale is, in essence, exactly what Cabin in the Woods is, an attempt to exorcise the genre of its formulaic possession by stuffing the movie full of its most overused and predictable elements - and then dumping them through clever skewering."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 90,
      "summary": "Cabin in the Woods does what \"Scream\" only halfway managed, which was to find something new by looking back at the familiar - and at least in Whedon's world, the geeky ones are never first on the chopping block."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2012
      },
      "score": 90,
      "summary": "The Cabin in the Woods is a fantastic poke in the eye of our horror-movie expectations."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 90,
      "summary": "Not since \"Scream\" has a horror movie subverted the expectations that accompany the genre to such wicked effect as The Cabin in the Woods, a sly, self-conscious twist on one of slasher films' ugliest stepchildren: the coed campsite massacre."
    },
    {
      "critic": "David Ehrlich",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 90,
      "summary": "Drew Goddard's giddily brilliant The Cabin in the Woods has a lot on its twisted mind."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2012
      },
      "score": 89,
      "summary": "The horror-movie clichés form the backbone from which the film's humor and creativity emerge. This Cabin may not be the Parthenon, but it's definitely a place to worship the gods of horror."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 88,
      "summary": "Cabin is a deliciously devious scare dance that keeps changing the steps until you lose your shit and fall helplessly into its demonic traps."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 88,
      "summary": "The film's main virtue, a large virtue indeed, is that it does not give anything away before its shockingly apt time."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 88,
      "summary": "It showcases one of Whedon's greatest strengths: his ability to take previously disrespected genres - in this case the slasher film - and turn them inside-out and upside-down and every which way but loose."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 83,
      "summary": "It's a film full of clever moments that may at first seem cheeky but come to feel inspired, with a third act (which only a churl would describe) that rises to a dizzyingly heightened level of metaphysics and mayhem."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "Because the first narrative is so crushingly generic (which turns out to be the point), most of the amusement derives from trying to figure out what the second one is all about. I'm not sure I ever did, but the climactic one-two punch of special-effects chaos and meta-movie chin stroking should have the fanboys trembling with delight."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "I'm recommending that you rush out and see it, but not altogether because I think it's so totally great and completely works. Quite a bit of it is great, and most of it works, and the stuff that clicks is outrageously entertaining and funny, sometimes with surprising depth. But I also want you to see it so we can argue about what works and what doesn't."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "At the very least, it's awfully entertaining and for \"Buffy\" fans, reason to put down the boxed sets and run off to the cinema."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "Not all of the twists work, but most are self-knowing enough to keep you guessing until its (literally) groundbreaking conclusion."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "Charmingly, like a throwback to the pre-Twitter age, here's a horror film that's been made with no reasonable way to discuss it beforehand."
    },
    {
      "critic": "Jamie Graham",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "A super-entertaining, super-slick love/hate letter to horror with a final 20 minutes that's stunningly bonkers."
    },
    {
      "critic": "Staff (Not credited)",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "Cabin is a meta-horror-comedy mash-up that, at least for two-thirds of its running time, holds together smartly."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "A pulpy, deceivingly insightful send-up of horror movies that elicits just as many knowing chuckles as horrified gasps."
    },
    {
      "critic": "Kevin C. Johnson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "Moviegoers looking for a thrill should go into The Cabin in the Woods knowing as little as possible about the film."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "Richard Jenkins and Bradley Whitford are particularly funny in their middle-management roles."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "The movie balances nicely on the edge of meta-horror, with characters breaking free of their assigned roles (in more ways than one) and monkey-wrenching the very urban legend they're dying to get out of."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "This is not a perfect movie; it's so ragged, it's practically constructed of loose ends. But it's exciting because it ventures so far off the map."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "The devilishly clever script tries a lot of things. Not all of them work, but it's hard not to admire Whedon and Goddard for the attempts. This is definitely not your standard kids-get-slaughtered-by-zombies motion picture."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "It's often funny and smart, but seldom deeply involving, and practically never scary."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "The initial brilliance of the premise is eventually dulled by illogic, the whole thing proves unmanageable and the filmmakers unmanage their climactic revelation with far more zest than finesse. Still, zest counts for a lot, and resonance carries the day."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "Is it scary? Not especially. But there are enough gory surprises around every bend to keep you laughing/screaming/cringing."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2012
      },
      "score": 67,
      "summary": "The movie's biggest surprise may be that the story we think we know from modern scary cinema - that horror is a fun, cosmic game, not much else - here turns out to be pretty much the whole enchilada."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 63,
      "summary": "The Cabin in the Woods is pure mechanics, as if the shadowy Dharma Initiative of \"Lost\" switched agents and found itself at the center of a brain-bending ensemble drama."
    },
    {
      "critic": "Jaime N. Christley",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2012
      },
      "score": 63,
      "summary": "The Cabin in the Woods, regardless of its many genealogical links to prior Whedon creations, is an ideal Hollywood film in the Age of Pixar: spectacle for spectacle's sake, but infiltrated by intelligent commentary and an atmosphere of generosity and inclusion."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "However smart and sophisticated this film is, it may disappoint those who, in their hearts, would still like to be genuinely scared."
    },
    {
      "critic": "Dan Jolin",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "Part \"Evil Dead,\" part \"The Truman Show,\" part \"Arthur Christmas\"... For horror hounds who love a larf, and those of us who always wondered exactly what that dry-ice stuff that rises out of the forest-floor moss is. A fun ride - but not quite a \"Scream.\""
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "The laughs come easily, the screams not so much. It's as if the filmmakers got so wrapped up in the satire they forgot to include the intense sensation of rising dread that creates all the thrills and chills that are part of the attraction."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "Novelty and genre traditionalism often fight to a draw. Too much overt cleverness has a way of spoiling dumb, reliable thrills. And despite the evident ingenuity and strenuous labor that went into it, The Cabin in the Woods does not quite work."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "A horror comedy with a structural twist intended to emit an air of being something more, Cabin has an off-putting vibe of cocky self-confidence, a \"don't you get it\" conviction that it's something special. As with people, it's not a charming quality in a movie."
    },
    {
      "critic": "David Rooney",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "Effects work is slick, and Goddard keeps his foot on the accelerator with help from David Julyan's suspense-building score. It's just too bad the movie is never much more than a hollow exercise in self-reflexive cleverness that's not nearly as ingenious as it seems to think."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 38,
      "summary": "I've seen a lot of rip-offs of \"The Truman Show\" and a lot of rip-offs of \"Scream.\" I guess I have to give credit to The Cabin in the Woods for ripping off both at once."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2012
      },
      "score": 25,
      "summary": "A creepfest so stupid it makes trashy slash-and-burn epics like \"Humans Versus Zombies\" and \"I Spit on Your Grave\" seem like Molière and Proust."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 5,
      "pos_reactions": 19,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "This movie was the definition of mind-blowing. It was absolutely fantastic. It's impossible to describe the film without giving anything away, thats why the synopsis is so short. I work at a movie theater and just the other day, a group of three guys went to go see this movie and left 10 minutes into it and said it was the dumbest movie ever made and it was a waste of money and time. Im sorry but if you are like these 3 men then you are a hypocrite and you are just plain stupid. Everybody and i mean everybody complains or at least acknowledges the fact that all horror movies are made the same nowadays. The Cabin in the Woods has listened to everybody and has turned the tides. This film is pure genius. It changes it up and shows you behind the scenes of every cheesy cliche horror film ever made, and it does it very well. It explains everything we've ever seen in a horror film, including the fact as to why you always have the athlete, the whore, the scholar, the fool, and the \"virgin\" as they say, but otherwise known as the good girl. It will have you on the edge of your seat, it will make you laugh your head off, and most of all, it will make your jaw drop. I loved this film and i believe everybody else will and has too, unless you are a hypocrite like those 3 guys. 10/10...perfection",
      "total_reactions": 24,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "This movie is a breath of fresh air for the horror genre. And holy **** I want that transformable coffee mug / bong that the stoner character used... too bad that prototype cost $5000 to make 0_o",
      "total_reactions": 2,
      "user": "410MaXiMuS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "This movie has been the best I have seen in years! You got all emotions in one film! You got fear, thrill, suspense, gory, comedy, romance, sexual, nudity all in one film. And that weird feeling that you get once in a while \"what the hell am am I watching\" However, what makes the movie really nice that in never thorough out the movie looses its seriousness. It keeps a real theme all the way. Even tho its meant as a comedy. I wont lie, this movie is not for every one.  When I first saw it, I wasn't it sure if I was suppose to laugh or get scared. Anyway, defiantly a must watch movie. Best part you got the pot head, the extremely hot Blondie`s with her boobs character, with the monsters, zombies and lost of blood. pop some popcorn and go to red box! And the best part, I mean, you got all these different seance from monstrosity to ghosts, to technology, to special effects, this is not a cheap underground movie, The producers really deserve some credit on the graphics and audio! great movie, cant say any more!",
      "total_reactions": 2,
      "user": "03ddeleon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "Considering how groundbreaking this film was reputedly supposed to be, \"The Cabin in the Woods\" was . . . decent. It had some fun humorous moments, some good characters and the plot twists are admittedly imaginative and somewhat original. However, as a whole, the film's attempt at upending the genre results in a somewhat clumsy presentation. The plot does grow and progress with a fair amount of grace, but when you start off with your typical slasher setup and end with literally armageddon, it's hard for the movie to feel consistent and connected overall. You gradually move through two or perhaps three different types of movies and a multitude of genres. This would work really well, of course, if executed with the right precision, but here it leaves you only partially satisfied. I rented the movie expecting a somewhat clever slasher film - now, I'm expecting the sequel to be the third \"Clash of the Titans\". If you enjoy original or imaginative stories, you'll probably really get into this one. It just didn't quite do as much for me as I thought it would.",
      "total_reactions": 2,
      "user": "WriteFilmLive21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "It was an original idea! Joss Whedon is one of the best, he always surprises us.",
      "total_reactions": 2,
      "user": "Zula"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2014
      },
      "score": 7,
      "text": "Cabin in the woods is a unique take on slasher/horror movies.  While the gimmick is clever I found it to be lacking in any kind of realistic scares.  The whole premise is cool when everything is revealed but do not expect any real crazy scares.",
      "total_reactions": 1,
      "user": "JamesCannon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Whedon and Goddard switch it up three or four times before the shocking climax but never lose their exhilarating pace. It's funny, sexy, and scary as hell. It's also one of the best horror films of the past twenty years.",
      "total_reactions": 1,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Somewhat original, funny, and at time gruesome, the cabin in the woods is miles beyond the average horror movie, but I still felt like it could have been better.  The thing the film does best is wittily send up genre conventions in a way that's funny but without resorting to a ridiculous Scary Movie level.  It does this mostly through smart dialogue and its meta premise.  The two lead characters are effective and you root for them to live, which is the opposite of most horror movies, and the visual effects aren't bad either.  However, it's not truly that scary, and the very ending was pretty disappointing to me.  Still, I recommend it due to its skewering of clichés and its humor.  I liked it, just didn't love it.",
      "total_reactions": 1,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "This is a very good movie for understanding how and why horror movie cliches are why they are. The premise is intriguing and gripping and makes you want to see what tricks the organisation runners had up their sleeve. I really wanted to see more monster action. Perhaps an additional 10 minutes would be exempt, seeing them roam around the streets causing havoc would be a good idea (maybe an idea for a sequel....oh wait...). In the end, this is again a very good horror comedy which needs to focus less on the main characters (lets face it, they are cliches and the interest of this whole movie is to the idea behind it) and more on the variety of monsters that were created for this film. Do not be put off by that though, this is a fantastic movie.",
      "total_reactions": 1,
      "user": "TrilobiteG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "Although this movie wasn't meant to be much of a horror movie, it still had a great way of putting a movie together. The real twist is at the beginning. You have no idea what's going on until the end. The more you think about it, the more it makes sense.",
      "total_reactions": 1,
      "user": "cag11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "One of my favorite movies & directors!! I get so frustrated when people say they bailed at the start of the movie then write a review (you have to see the movie to understand it!! Common sense!) If you are not familiar with Joss Whedon or his humor you may be surprised by his ability to be witty, sarcastic & smart all at once. By the way Whedon is the creator of tv's Buffy the Vampire Slayer, Angel & Firefly as well as movies like The Avengers & Thor. He also wrote 24 issues of Astonishing X Men in 2008. When I saw the movie on opening day I had a very vague idea of what the film was about & I'll admit the intro threw me for a serious loop. I was worried at first (I will never question Whedon again) but as always Joss delivered a horror movie full of witty humor, great characters & plot twists that were unique & not at all generic or obvious & an ending that you wont see coming (unless your a Whedon fan....) its a great movie that has earned a spot on my top 10. Its not your typical horror film & not all that scary but its got the makings of a cult classic, assuming people actually give it a chance & watch the whole film!",
      "total_reactions": 1,
      "user": "scareahmonster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "The film starts an d you see all these drawings, some kid's got too creative? I mean what! This old guy compplains that its hard to open his draws. OH MY GOD! He then says you can't trust Swedes. Oi. Then a super sexy scene comes one where you see the main girl in panties. Ooh. Put some clothes on. The swag-mobile then comes. Oh, and he looks like Shaggy from Scooby Doo. I like food.Missy then says that she hopes THE ONLY ROAD is the right road, even though theres no other roads to go down. Old man cliche.. Theres then a long scene about how that old man is on speakerphone. The old men think its the funniest **** Shaggy then thinks a wolf is a moose. He never did learn any skills in Scooby Doo apart from being scared. Theres then another sexy sexy sexy scene, this time with beastiality. Shaggy then thinks puppeteers are pop tarts. *clap clap clap*. More s3xy scenes, this time with a tit cliche *Adjusts knob* **** puppet dance. The girl's head is then thrown into the main girl's hands. And that is why you should always stay clothed. INDIANA JONES MOMENT... and he's dead. A zombie arm then makes Shaggy dance. MASS MASSACRE! Then along comes the... MERMAN! Some woman having a midlife crisis then calls PBG/Shaggy a fool. Giant gods cliche then happens, but is presented very well, and makes you wonder... would you lose your life for the world? Ok. That film was amazing. Anyone might think there are cliches, but it's mainly to be self-aware, and makes fun of itself. The ending is a bit... well, it's ok., but the rest of the fiml is near perfect If you are a horror film fan, buy it.",
      "total_reactions": 1,
      "user": "PolisKanin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "Comienza como la clásica película de horror con unos adolescentes estereotipados que están listos para morir en una cabaña del bosque... Propuesta dinámica e interesante. Buena mezcla final !",
      "total_reactions": 1,
      "user": "realnostok"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "Absolutely brilliant movie.  I think some people are going in expecting a slasher movie.  Don't do that.  It's more a black comedy wrapped around a great central concept.  Whedon's humor is all over this flick, and he's never been funnier.  Everybody praised Scream for the way it disassembled the horror genre, but Cabin does it SO much better.",
      "total_reactions": 12,
      "user": "goodterling"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "Man this year has been full of great stuff. This is well worth seeing. I give it a 10 just because its actually creative for a change and such a fun movie.! Highly recommend this seeing this.",
      "total_reactions": 6,
      "user": "Heaviermetal"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "This is the most fun I've had at the movies in a long time. It pokes fun at itself and horror movies that proceeded it in an original and entertaining way. Twists and turns keep you guessing about what will happen at the end until you finally see for yourself. I wasn't expecting humor in it, but the humor is what made it what it is. Genius.",
      "total_reactions": 6,
      "user": "svcrunner27"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "Absolutely LOVED this movie. Do not read reviews, avoid spoilers at all costs and just go see it. If you like horrors movies at all you'll probably love this movie. Had some great scares, awesome CG, the story unfolded brilliantly and evolved perfectly in my mind. The first act is good, second act gets even better and the third act is just absolutely mind-bogglingly insane.",
      "total_reactions": 11,
      "user": "redrabbit33"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "This movie is a love letter to horror movie fans as well as being one of the darkest comedies I have ever seen. The title of this movie makes it sound like the most generic horror movie, but I can guarantee this movie goes places you never thought a horror movie could go. If you like horror movies and can stomach the gore, this movie is a must. Don't watch the trailers, don't read about that plot, just go see this movie.",
      "total_reactions": 15,
      "user": "Human"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "I can't go into specifics as this movie is pretty much a plot twist, but in essence this is two different stories. An intentionally standard slasher flick with the very expected archetypes, and a sub-story about making a movie for a very discerning audience... *cough* the discerning audience being the 11 negative reviews who are going \"BWAAAAAAAAAAAAA the slasher flick is totally average!\" as I type this.",
      "total_reactions": 10,
      "user": "Gene"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "The Cabin in the Woods is at once a well-executed love letter to horror films and a complaint about the current status of horror. The horror genre in general seems to currently be at a creative pit-stop.  Too many horror films today re-use ideas from other movies. The Cabin in the Woods recognizes this idea and plays with it as it goes along. I haven't been this entertained or had this much fun at a horror movie in a long time. Much of the fun of this movie comes the twists and turns that are dished out as it unfolds, so DO NOT read any plot summaries that may seem detailed.  Go see this one in theatres.",
      "total_reactions": 5,
      "user": "vern"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "How do you create a movie that is a very good comedy, and a pretty creepy horror? I honestly can't do it, but the people who made this are great at it. Similar to Inception and Pulp Fiction (okay, maybe not so much the latter), this movie is horribly misunderstood by the common person, but to anyone who has a sense of meta-humour, good cinematography, writing, and great plot line this movie shines like lamp in a dark basement (See what I did there, I was implying that horror movies in general aren't that great... I was also referencing the movie). I did think that the end could have been \"better\" only because I didn't want it to end that way. Anyway, I'm just going to conclude with \"That was awesome.\"",
      "total_reactions": 5,
      "user": "Badsniper"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "This movie is the cherry on the top of cake of this genre. I loved it!  I laughed, I jumped a few times and at the end, I was just entertained to the max!  What a hoot.",
      "total_reactions": 5,
      "user": "mountaingirl"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "Well, not much can be said about this film without actually giving the goodies away, so it is best to keep it minimalistic. This film is awesome. It is insane. It plays on clichÃ© and it plays on it well. There is plenty of blood and gore to go along with all the conversational interludes. There are also some unexpected laughs. This movie flows in a direction that I did not expect at all. Plainly, the previews really only do scratch the surface of whatâ",
      "total_reactions": 14,
      "user": "gemini0577"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "One of the most original horror movies that I have seen in a VERY LONG time!!  Such a fun time.  Had some good scare moments but overall this movie never took itself too seriously.  This should definitely should be experienced in a movie theater.",
      "total_reactions": 8,
      "user": "Filmaholic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "Know nothing about this film when you go to see it. Hollywood today with there plethora of remakes and book to big screen adaptations, lacks creativity. This movie is just that, boatloads of creativity. Legitimately the most fun I have had watching a movie in a long time. The girl that I took to see it had her head covered by her coat for half of the movie, I was laughing, jumping, and for the last thirty minutes of the movie just in absolute awe about how awesome what I was watching was. Def a must see.",
      "total_reactions": 8,
      "user": "duffster8711"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "The first 20minutes of this movie made me think.... How stupid are the people that reviewed this well? After that I saw the pure genius  behind the cabin. Going back to the ancient times of human sacrifices this makes me go back to when movies were witty and original and this takes that for the gold.",
      "total_reactions": 4,
      "user": "conboydude"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "This film is refreshingly original. A brilliant hybrid of both horror and comedy; 'The Cabin In The Woods' is simply good fun. Without spoiling anything it'll be like nothing you've ever seen before.",
      "total_reactions": 4,
      "user": "BradleyFilm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "I was waiting for this film for over a year. And I was not let down. I enjoyed every part of it. A big fan of Joss and Drew I knew I wouldn't be bored. Those who say they didn't like it, took it too seriously and obviously don't understand the film!! So if you are actually smart you'll enjoy it",
      "total_reactions": 4,
      "user": "ETV"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2013
      },
      "score": 2,
      "text": "This movie has one of the worst plot lines I've ever seen, it's gimmicky trying to pull in the audience with gruesome deaths that could have been thought up by a 12 year old...OH AND boobs! you like boobs right?,right? well if you want boobs look elsewhere, all the babes in this movie make the walls jealous with their flat chests...Moving on... They break the Immersion that a good horror movie should have too, with mediocre character development, and terribly predictable outcomes when they encounter the hillbilly zombie family...No I  you not that is the literal name of the monsters in this film. Now before I get asked, no the acting isn't terrible, but it's not amazing either sometimes even ruining the immersion even further with unbelievably dull reactions and lackluster expression, how am I supposed to be scared or laugh when your characters aren't even petrified. Oh what? you thought that was it?- no. The ending is  really unexpected but only because of the stupidity it took the characters to get to such a conclusion. Overall, maybe it might make your girl cuddle up into your wimpy arms once or twice, but other than that, I wouldn't watch this movie if you truly want to have the need to check under your bed and lock your doors before sleeping, like any good horror movie should, It's unbelievable that people are giving it an 8, 9, and EVEN 10 out of 10 for this. I couldn't even tell what genre it was, I thought it was horror; which is why I bought it, but I was never scared. About 20 minutes in I started to think \"Oh this must be a comedy!\" but I never laughed. Overall a let down, I would severely hesitate and think about it before watching this stain of a movie.",
      "total_reactions": 4,
      "user": "Migratedwolf"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "Without a doubt one of the best horror movies ive seen, great actors, smart plot, good funny moments. All around amazing movie. I reccomend this movie to anyone.",
      "total_reactions": 7,
      "user": "Beevman"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "This movie is seriously awesome. I've seen a lot of horror movies in the last 10 years, and this one by far takes the cake. It's original, different, funny, entertaining, and purely delightful. If you haven't seen this yet, do so! Also try your absolute best not to hear any spoilers, it's best to see it without knowing anything about the plot. PAY THE $12 and SEE THIS NOW!",
      "total_reactions": 6,
      "user": "Zordock"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "This is one of the best horror movies I've ever seen. Once I saw it in theaters I knew that I was going to buy it once it came out on blu-ray! The last 30 minutes is literally epic! If you haven't seen it, do yourselves a favor and watch it.",
      "total_reactions": 3,
      "user": "rancor"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "The correct attitude to enter this movie with is the idea that it is a horror movie.",
      "total_reactions": 3,
      "user": "TitaniumDragon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "Possibly the best horror movie in years, THE CABIN IN THE WOODS is frequently funny, highly original and ridiculously awesome! In my opinion, there is nothing wrong with this film. In fact, it is a horror fan's dream.",
      "total_reactions": 3,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "I had zero expectations when I walked into this film, I thought, \"Generic five friends go out to cabin in in the middle of nowhere, brutally killed by monsters, seen it before.\" I knew there was some government control going on, but nothing more. The trailer for this movie doesn't capture its true greatness. Joss Wheadon and Drew Goddard did a perfect job of blending humor and horror. The funny parts were absolutely hilarious, and the horror scenes were done brilliantly. I wish there were more movies like this. I will gladly see this again... I want the DVD now.",
      "total_reactions": 3,
      "user": "LopsterPopster"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "By far one of the films that i am thankful for going to on a whim.  The Cabin in the Woods was a dominant force to what a solid film can contain.  This movie was filled with it all humor, thrill, scare, action, romance, and even gore.  The way to movie flowed and and grabbed viewers attention was phenomenal, ill think twice before walking into the next cabin i enter in the woods who knows what could be in the cellar waiting for me.",
      "total_reactions": 3,
      "user": "plainbrains"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "Never has a recent horror film been so purely exhilarating, funny and ultimately entertaining as this. Clever, twisty, and brilliant right from the start to the end. Possibly the best film of 2012 so far, and that's saying something.",
      "total_reactions": 3,
      "user": "lunchboxxx666"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "I really enjoyed this movie. I'm a big fan of horror movies but i went into this movie not expecting much and was pleasantly surprised by the extent to which they had thought outside the box.",
      "total_reactions": 3,
      "user": "Dodger"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "This movie was not funny enough to be a comedy... and was not scary enough to be a horror movie!",
      "total_reactions": 3,
      "user": "oliver1h"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "The cabin in the woods, a horror classic. This movie is good, entertaining, and a story that leaves you with your mouth open. It is a film in which you take confidence with the characters and enjoy seeing it a lot. It will happen very fast.",
      "total_reactions": 3,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "The cabin in the woods has great thrills and action. The movie doesn't have a famous cast but the movie",
      "total_reactions": 3,
      "user": "TylerDurden900"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "The best film since Apocalypto! Masterpiece of 2012. Shocking+Innovative+Scary+Funny. I don't want to add anything else.",
      "total_reactions": 5,
      "user": "PeruzziCut"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2012
      },
      "score": 2,
      "text": "I have to give the movie credit for having some unexpected twist but overall it is probably one of the most ridiculous movies I have ever seen.  Starts off interesting, then gets ridiculous, and continues to get more ridiculous as the film continues.  Luckily I saw it at the $1.99 theater and still paid about $1.95 too much!!",
      "total_reactions": 8,
      "user": "theviewer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "Cabin in the Woods is an enjoyable film for horror aficionados and horror virgins alike.  Although it fails to be particularly scary it is a great romp through the horror genre.  Some aspects of it are lacking.  Whilst the stereotyping of the characters is necessary, the dialogue often fails to hit home.  What could be laugh out loud quips only raise at most a chuckle and often the dialogue feels like a rush job, tacked onto the end of what is an accomplished story arc.  In addition (and I hate to bring up realism in what is so clearly a fictional film) the main characters appear to be superhuman.  Everyone knows that some leeway can be given in horror films on this point, but characters appear to receive near mortal wounds and yet three scenes later are completely restored to full health.  Perhaps I'm nit picking but it bothered me more than once.  I would have given this a higher score but the two points above detracted enough to stop Cabin in the Woods being a tour de force, instead leaving it more a tour de genre.",
      "total_reactions": 4,
      "user": "Ojaybee"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "I watched this movie yesterday and I want to say that this movie is really cool. This movie is really unpredictable and insane. And the jokes, they are awesome.",
      "total_reactions": 4,
      "user": "VladimirCancer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "Cabin in the woods was the best movie ever made. End of story. End of story. End of story. End of story. End of story. End of story. End of story. End of story. End of story. End of story. End of story. End of story. End of story. End of story. End of story. End of story. End of story. End of story.  I guess the very very very end coulda been better but End of story. End of story. End of story. End of story. End of story. End of story. End of story. End of story. End of story.",
      "total_reactions": 4,
      "user": "OneShot77Kills"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Cabin in the woods is a gory horror flick. The special effects are fantastic. More importantly Cabin in the woods is one of the most unique and interesting horror movie concepts I've seen in the last five years. Don't pass this movie up!",
      "total_reactions": 4,
      "user": "kuehnau"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2012
      },
      "score": 1,
      "text": "Seriously critics? THIS movie is intelligent, brilliant and shocking? Absolutely no! This is just crap. It mixes every stupid idea other horror film makers had in the past years into one. Horrible actors, horrible dialogues and a plot which is extremely unrealistic. They begin with the usual bad horror movie and end up in an unfamiliar scenario which makes you laugh your ass off because it's just too silly. One of the worst movies I've seen by far - I can't believe my eyes when I'm reading the critics...",
      "total_reactions": 4,
      "user": "axelkoch"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "From the title, description, and most of the footage you've probably seen, The Cabin in the Woods looks like the same awful, recycled horror film you've seen over and over.  A bunch of vapid college kids are going to spend a weekend in a cabin, where they'll probably get hacked up... big freaking deal, right?  But all of that is a smokescreen, much like the titular cabin itself.  In reality, this movie is meta-horror: it's a horror film about why horror films suck.  It's also a fantastic dark comedy.  You don't want to miss this film.",
      "total_reactions": 2,
      "user": "emcoffey3"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "Joss Whedon and Drew Goddard do their best to breathe new life into the horror genre, and The Cabin in the Woods is certainly clever and entertaining.  Yet I think that the film will strike more of a chord with the genre's die hard fans and I couldn't help but feel a little disappointed by the ending which turns out to be little more than a giant wink at the tired conventions that have always defined horror films.",
      "total_reactions": 2,
      "user": "BKM"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "Theres only one word to describe this movie: badass.  Its definitely on my top ten list for best movies i've seen, and i'd recommend it to anybody looking for a great movie to see in theaters.  I wouldn't call it a horror flick though.  It really belongs in the suspense genre.",
      "total_reactions": 2,
      "user": "OverDos"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2013
      },
      "score": 3,
      "text": "It's basically a weed film. The main male protagonist  is a weed head, he survives because he's high, and at the survivors smoke weed. Other than that, it wasn't really all that interesting  it reminded me a lot of 13 Ghosts.",
      "total_reactions": 2,
      "user": "miniii"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "9 or a 10.  hmmm.  10",
      "total_reactions": 2,
      "user": "ZenRobot"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "One of the coolest, freshest, best movies I've seen at the theater in a long, long time.  You owe it to yourself to see this film.  It's just when you think the movie's going to zig...it zags.  Keeps you on your toes all the way until the credits roll.",
      "total_reactions": 2,
      "user": "thetiderises"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "Absolutely loved this movie!  I went for Joss Whedon and I was not disappointed.  The story was great and kept me guessing, even though I had read some reviews.  Acting was good, especially Fran Kranz.  It was funny, but this did not cheapen the thrills.  I was still jumping occasionally.  Richard Jenkins and Bradley Whitford had great chemistry and helped to bring the balance between comedy and serious undertones that Joss is known for.  I was also impressed by the supporting cast members.  All in all, a must see for anyone, even those that hate horror.",
      "total_reactions": 2,
      "user": "ThetaSigma"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "Loved the movie. It was funny, tense, and intriguing at the same time. Probably the best horror movie I've seen since the remake of The Texas Chainsaw Massacre.",
      "total_reactions": 2,
      "user": "Atticas14"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "I saw The Cabin in the Woods last night and it was freakin' awesome. I cannot believe Sigourney Weaver was almost at the end of the movie where she was the director behind this fake Survivor-like reality show where they put five friends in a cabin house and all of a sudden, they didn't know that they've been setup by a security camera and everyone is watching for the five who wants to die. Everyone went crazy and I was stunned. I think this is the best horror movie of 2012 this far because it's not a reboot or a remake, but with lots of horrid zombies and gruesome creatures. I think it's paying homage to the Evil Dead and the video game \"Resident Evil 2\" with the deadly snakes and all the animals that a little lot like zombies. But the movie is awesome, can't wait for \"Resident Evil: Retribution\" and \"Piranha 3DD.\"",
      "total_reactions": 2,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "Great year for Joss Whedon. While this film was shelved for a number of years, The Cabin in the Woods were released in 2012, just before The Avengers was released. It's typical Whedon, with a wise cracking, self referential script, something we have seen him doing for the past decade or so, unleashed to the public.  As a horror film it works, but it is a 'self referential' commentary on the genre itself. A cult classic.",
      "total_reactions": 2,
      "user": "dharma"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "A great horror movie, has a few laughs interjected but make no mistake, this is not a parody, it IS a graphic horror movie that has real scares.  Very original and beware of spoilers, because the suspense would be ruined, most original horror movie I've seen in years, well acted too.",
      "total_reactions": 2,
      "user": "turtledean"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "This movie is just f*cking awesome! It plays with the classic horror conventions and does it with and absolute wicked sense of humor. Some scenes in this film that can be considered iconic and this film wil certainly get a deserved high ranking among the cult classics. This is one you HAVE to see!",
      "total_reactions": 2,
      "user": "Apemonkey666"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "\"Cabin in the Woods\" is like a Halley's Comet. You're only gonna see it once, and you're never gonna see anything like it again your whole life.",
      "total_reactions": 2,
      "user": "snazzyjuice"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "this movie was horrible i didn't like it at all and it was the worst thing ive ever seen it was just a complete waste of time the biggest waste of 1 hour and 34 minutes i wish i could have that time back",
      "total_reactions": 2,
      "user": "balla_phil23"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2013
      },
      "score": 0,
      "text": "Dumbest movie ever.EPIC FAIL would be just perfect to describe the nature of the movie.Pathetic mixture of horror and sci-fi genre.Location was excellent for a horror movie but all they could do is take out zombies and weird faced aliens and blood.That is not a definition of a horror movie nor is it suitable for a massacre genre movie.It does not fit in the boots of something like Identity nor for The Women in Black neither for Saw.It is an unexpected punch in the face for all of those who thought this would be good for spending 2 hours of your life.Well folks,those who did not watch this one,I demand you to stay away from it ,those of you who did,I share you sorrow",
      "total_reactions": 2,
      "user": "ManasWWM"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2012
      },
      "score": 2,
      "text": "A combination of the truman show and a horror/fantasy movie with unconvincing acting and somewhat lame plot (the cliche breaking was unfitting, just confusing).",
      "total_reactions": 10,
      "user": "Torbjorn"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 0,
      "text": "Lets see what redeeming factors we can pull from this movie.  Is it funny?  No.  I may have gotten a laugh or two in the whole thing.  Scary?  Not even close.  Suspenseful?  If you actually care about the characters, maybe.  I watched this with my mom and at the end we both just looked at each other and couldn't believe how bad this movie was.  I only watch movies that have favorable reviews and usually they are right.   Someone compared this to Evil Dead in another review I read.  Yea right.  That movie was actually funny.",
      "total_reactions": 5,
      "user": "Rowsol"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2012
      },
      "score": 5,
      "text": "The movie starts out great.  Fun elements of hidden story unfold slowly.  Gets a little crazy half way through and ends in a blanket of cat ladies full crazy.   Watch the first half, then skip to 5 minutes to ending.  You don't see this ending too often.",
      "total_reactions": 5,
      "user": "scott7ree"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2012
      },
      "score": 4,
      "text": "I truly wanted to like this film. I really did. I got a drink and a blanket ready and everything, but it really was such a disappointment.",
      "total_reactions": 5,
      "user": "Nixy"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2012
      },
      "score": 0,
      "text": "I didnt watch the whole film. Put it this way, it was that bad, i turned it off a half an hour into it. I do not understand the good ratings for this film. Oh my god is it so annoying. Such bad acting, cheesy kills. stay away from this film",
      "total_reactions": 5,
      "user": "ReaIistiC"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2012
      },
      "score": 0,
      "text": "This movie, was terrible!! I only rented it, becasue it recieved such good reviews from the critics. The movie is not smart and not fun! Avoid at all costs!",
      "total_reactions": 11,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 17,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2012
      },
      "score": 3,
      "text": "The hype for this film does not match the execution.  It was all over the place and should not be called a horror movie.  It did provide a couple of jumps but more than anything it made me want to leap for the exit.  I did go in with high expectations due to the reviews - I'm sure this did not help my reaction.  The actors for the most part did a good job with what they were tasked. I don't even think I would recommend this for video.",
      "total_reactions": 26,
      "user": "frankiep86"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2012
      },
      "score": 2,
      "text": "Ridiculous film with nonsense plot lines and silly, cheesy script.  Stereotypical Yank rubbish!  They never learn. To be fair I did laugh quite a few times at the stupidness I was watching.",
      "total_reactions": 6,
      "user": "Vorlargen"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2012
      },
      "score": 4,
      "text": "If you want to be scared, don't go see this movie. If you want to laugh and you liked something like Zombieland? Go see this. Sure I applaud the writer and director's intellect and use of metaphor, but you don't care about anyone and it's just a bunch of ideas and metaphors thrown into one **** movie. I was sincerely disappointed. I want my money back",
      "total_reactions": 3,
      "user": "Matteo"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "Avoid spoilers and go see it! A movie for horror fans that delivers on EVERY promise it makes. Brilliant. Also, it features the most enjoyable scene I've ever seen!",
      "total_reactions": 3,
      "user": "Acropolis"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2012
      },
      "score": 5,
      "text": "I fail to see why this film is so well received by critics; sure it's plot is pretty unconventional and it's original, but I couldn't help but feel it was a bit too ridiculous, obviously I won't spoil anything but it's nothing what I expected it to be. This isn't to say it's a bad movie, it's certainly decent by horror standards, but the plot just irritated me. Has a few jumpy moments too, but don't go in expecting a non-stop horror barrage like I did!",
      "total_reactions": 3,
      "user": "smk123"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "The horror genre desperately needed a movie like this. Recent offerings have relied far too heavily on gore, **** and jump scares to get a rise out audiences, and while The Cabin in the Woods has all three of these, they are not a means to an end but merely a meta reference to the problems plaguing the modern \"scary\" movie. The reason this film works and entertains is that it has actual substance, and without revealing what exactly I mean by that, I will say that it is unlike anything you have ever seen before. Its twists and turns are so outrageous, so ingenious, so hilarious, even, that you will wholly forgive the bland characters and the occasional cringe worthy line of dialogue. TCITW is a breath of fresh air, and absolutely worth the price of admission for anyone willing to submit their minds to a little 90 minute bender.",
      "total_reactions": 3,
      "user": "gimmedatsammich"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "this movie was just wow! it was on a whole different level! the story in this movie is something seriously original! imagine \"vacancy\" meets \"saw\" its something pretty awesome. the movie was thrilling and scary, yet it pulled of a lot of laughs. fantastic movie!",
      "total_reactions": 3,
      "user": "destroya1art"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "The Cabin in The Woods is a twisted story, that kind of twists out of control. Sure, I did enjoy my time at the movie theater, but it's as much of a horror film as it is a unsuspecting satire of modern horror. Set in the most cliched setting, five friends find themselves haunted by puppeteers and sets off in motion a surprisingly funny spooky event. But in reality, if I wanted to see a fantasy movie I would like to be told beforehand. The movie twists and turns itself that it spirals itself out of control and also out of sensibility by the end. Watch it at your own peril, but I feel that this movie will either have you loving it, or hating it. It's never been done before, but the horror comedy is still very entertaining when at it's best.",
      "total_reactions": 3,
      "user": "racketracer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "This film was pure amazement. This movie will be a classic later on because it is probably the best well-put horror film I have ever seen. The cast, the plot, the twists ahead all come into place with \"The Cabin in the Woods\" and works out perfectly. Go see this film you will not regret it.",
      "total_reactions": 3,
      "user": "a7xfan"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 5,
      "text": "I know its trying to be a metaphor for modern horror films. I know its also a black humour horror with a brilliant twist. Yes, there is a twist and no its impact isn't exactly profound as they tell us that IN THE TRAILER ALREADY. When you watch a horror film, you come for the scares and the thrills. Cabin in the Woods gives you none of the former and dishes out the latter in a ridiculous, dark-humourly manner. Its not a bad thing but its call a horror movie, not a black humour monster fantasy slasher. The final half an hour is plain ridiculous and feels more like a Resident Evil movie who's overdosed on heroin and overused gory props in distasteful scenes. Indeed, its paying homage to horror films and esp the ambience created by H.P Lovecraft but seriously, for most viewers (i.e. 80% of us who dont usually indulge in hardcore horror flicks). its just...weird. If you're a true horror fan, you may love this movie. For me, however, someone who just wants to thrilled and be enthralled in a scare-fest, this became a bore of a film which would've been a lot more interesting had more of the movie made any sense. Add in the Lovecraft factor that you may love or hate, and you have what feels like a B-grade gore flick that caters only for the true horror fans and leaves the rest of us in the cold. Decide for yourself whether you enjoy the taste of this flick but I am sitting on the fence for this one, my stomach impaled by a unicorn.",
      "total_reactions": 3,
      "user": "aznassassin"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "Fantastic. The film delivers exactly as promised: it begins as a traditional slasher film, but eventually becomes a mind-boggling twist of a film. You get hints earlier on than I had expected, but the whole thing doesn't really come together until the end. Joss Whedon's sense of humor is very prevalent, and the counterbalance of Goddard's writing makes it that much better. Perfectly paced and entertaining from start to finish.",
      "total_reactions": 3,
      "user": "vyper17"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2012
      },
      "score": 1,
      "text": "One of the worst horror movies I've ever seen. It's supposed to be all 'cool' because this film is taking the piss out of your standard predictable horror film. The irony is that this is a standard predictable horror film too. 2/10",
      "total_reactions": 3,
      "user": "ConnKon"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2012
      },
      "score": 2,
      "text": "This movie had alot going for it, great commercials, and positive reviews, hemsworth.   The movie turned about to be a huge disappointment.  You can figure out in the first five minutes whats actually going on.  It also reminded me alot of Thirteen Ghosts (meets Cube meets Evil Dead).  There were some funny parts, mostly stoner humour, but still made me chuckle.  But the rest of the movie, the parts that were supposed to be \"serious\" were cheesy at best. Even the supposed big reveal at the end was really a no brainer.  A few jump out of your seat moments, but mostly due to loud music blasting through the speakers.  This movie would have been straight to DVD if chris hemsworth wasnt in it.   And thats how it should be treated.",
      "total_reactions": 17,
      "user": "duffman902"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "I really wanted to like this movie, but from the jump, it was just awful. The entire movie does not any sense. The should of written a traditional slasher in the woods movie. Would of been a better movie.",
      "total_reactions": 7,
      "user": "phillyjeff"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2012
      },
      "score": 3,
      "text": "probably the one of the most boring movies i have seen at the cinema apart from paul blart mall cop. i could not wait for it to be over, i gain more enjoyment from watching the trailers of other movies before the showing of this film.",
      "total_reactions": 11,
      "user": "crazyzebady"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "While a huge fan of the writing style of Joss Whedon, I've always felt his attempts at horror were a little lacking. His previous horror based shows, \"Buffy\" and \"Angel\" were cult favorites because of the action and comedy elements. Where \"Cabin\" truly suffers is the Whedon-esque comedy implented to deflate any tension in the scenes that would traditionally belong to the horror genre. In addition, elements of the movie prevent the audience from developing any attachments to the characters and therefore are unable to feel strongly about their survival or possible deaths. Finally, the pacing of the movie suffers greatly which reduces the enjoyable scenes down to a broken \"genre-bending\" film the likes of which have not been seen since the film \"Banraku\".",
      "total_reactions": 19,
      "user": "Cleric22"
    },
    {
      "neg_reactions": 18,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2012
      },
      "score": 3,
      "text": "Maybe it's because I went in with high expectations.  But I was let down big time.  I love Joss.  And I went in after reading a lot of positive hype on the net.  And a couple of critics that I usually agree with that loved it also.  And the only way to describe my feeling was let down.",
      "total_reactions": 24,
      "user": "LeahAndNic"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2012
      },
      "score": 0,
      "text": "The only recognition this movie will make is the top\"worst movies of all time\"",
      "total_reactions": 8,
      "user": "Anortale"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "Although I don't believe we wasted our money or time, or that the movie was a total \"piece of crap\", I'd suggest as others have that you save your money. The movie had a respectable amount of laughs, originality, worthy acting, and likeable characters, but it just wasn't enough. Maybe it was the sorely missing really scary moments. Anyway, when the film was over my wife asked me if I'd recommend this movie to anyone. Despite the rave reviews this film has garnered, and despite the good points I've pointed out, I did not hesitate to answer, \"No\".",
      "total_reactions": 4,
      "user": "KnowNothing"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2012
      },
      "score": 3,
      "text": "Yes the final reveal/twist was cute, is it enough to make a bad movie work? No, you can ask Shyamalan he'd know. This movie spends so much time trying to be \"meta\" and clever that it completely forgets it's supposed to entertain its audience. There's just nothing going on for the entire first half hour! And then it takes another half hour to really get going, already wasting 1 hour for nothing. By the time the big reveal happens I didn't care, and why would I as the movie makes no effort at all to make the characters or the story interesting. No work no payoff, sorry.",
      "total_reactions": 4,
      "user": "Demorase"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "A new horror queen, I love it! The Cabin in the Woods take all the meet cliches, and play with they, the cast OMG great performances, is an amazing movie, with a fantastic cast, the reborn of the horror movies.",
      "total_reactions": 4,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "text": "High ratings? What is everybody smoking while watching this? Can I have some? Pass some of that good stuff people, I`m back here!!!! I had to fast forward through crap. I`m glad I did not pay to watch this trash!! I`m not a horror movie fan, but man I wish it was, then it might have a point. People said unexpected turns but I found it all predictable! It fails at being a horror movie, They failed to make me laugh with the lame jokes. It`s not the worst movie, probably cause it was hoping to fail even at being the worst.I think the people who liked this movie, are females into the guy actors, and men into the female actors. The people who liked this movie also liked a particular character that got high, high, high lol",
      "total_reactions": 4,
      "user": "oblique15"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2012
      },
      "score": 0,
      "text": "WHAT?!?  This movie is an utter disaster and left me vowing to never see another Hollywood movie.  I don't even know how to begin to explain why it is so bad.  Stuck it out to the end just to say I did.  Honestly felt this movie had NO redeeming qualities.  Felt sad for Sigourney Weaver sucking into such a pile of ****.  I am honestly stunned and speechless at the positive reviews.  I am open minded and understand irony and cliche, but this thing was unbelievably bad and actually left me depressed at the thought of this movie qualifying as legitimate entertainment.  OMG we're screwed as a society.  Just an orgy of images, half-baked thoughts and attempts at clever bathed in cute monsters and blood.  I give up.",
      "total_reactions": 13,
      "user": "mikemike"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2012
      },
      "score": 3,
      "text": "I heard so much buzz about this movie and was utterly disappointed. Yes, the plot was original but so convoluted.   I cannot believe this film scored a 72!!  If you haven't seen the British comedy/horror film \"Severance\", watch it instead.  Not as original but certainly a much better film.",
      "total_reactions": 9,
      "user": "jarc"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2012
      },
      "score": 0,
      "text": "I thought this movie was horrible. If it was meant to be funny, it wasn't. The humor was juvenile and stupid. If it was meant to be scary, it wasn't. I found myself napping halfway through. And don't think it's because I don't appreciate this \"sub-genre\" or don't \"get it.\". I thought Zombieland was great.",
      "total_reactions": 14,
      "user": "Sedna"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2012
      },
      "score": 0,
      "text": "What is marketed as a horror film turns out to be more like a B-movie rip off of the Truman Show. Avoid it at all costs, unless you get a kick out of films with horribly jumpy storylines and poor acting.",
      "total_reactions": 11,
      "user": "Notorious"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2012
      },
      "score": 0,
      "text": "I don't understand how this movie received so many good reviews on the internet,coz it's an absolute crap.Whoever was writing the scenario for that film must have been on acid or something.haven't seen such a stupid film for a long time.total waste of money.you can't call it's a horror film coz it's not scary at all.all i could think about while watching this film was 'what a f...is that crap\".seriously i feel sorry for all you people who gave this film good reviews.Unless you where on acid as well.",
      "total_reactions": 11,
      "user": "klaudia28"
    },
    {
      "neg_reactions": 16,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 1,
      "text": "The score goes just for the laughs. Horror genre? U kiddin me? The worst movie I have ever seen. Maybe the ratings are just for the special effects that are in this piece of junk! However, those aren't something you haven't seen before!!! Wasted my money and time!",
      "total_reactions": 19,
      "user": "The_NERD"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2012
      },
      "score": 2,
      "text": "I'm not one to bother leaving a review but after watching this film due to the good opinions I felt compelled to leave my review. Firstly this is essentially the Truman show except without a joker and in the woods. The characters irritated me, they were all predictably college. None of them could act either which is a shame. Though it's no surprise with the writers of this film. The story is just ridiculous, not clever at all. Also to the people that claim this isn't funny, I agree. I can't remember laughing once.",
      "total_reactions": 7,
      "user": "Koreless"
    },
    {
      "neg_reactions": 32,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 0,
      "text": "I do not understand how this movie has that rating that it does. I thought this was the worst movie I have ever seen, and I have seen a lot of movies. I am 50 years old, so I've seen my share of bad and good flicks. Do not waste your time or money on this one. I can rate this movie in three words \"piece of crap\". I asked for my money back! Enough said.",
      "total_reactions": 37,
      "user": "BrandieGirl"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "I enjoyed the film as a horror/comedy, but I can't give it one of my TOP ratings simply because I was in the mood to get scared tonight - and there's nothing particularly scary about this film.  They pull you out of the moment far too often to switch to the control room sequences - which is what makes this film entirely unique and interesting - and funny!  But what makes horror movies set in the woods, or the desert, or the south pole, or space so scary is that palpable sense of isolation - nobody is there to hear you scream.  But in this case, there's room full of guys waiting to see if the hot girl will take her top off. It's the opposite of isolation - they're all right there with you.  Yes, it's gory, and it's fun, and it's smart, but simply not scary.  By contrast, the Evil Dead movies had big scares in them, though they were also funny as hell.  As far as the cast goes, the Dollhouse grads (Frank Franz and Amy Acker) are my faves - and they should be in MANY more films - not just the Joss Whedon projects.  It's awesome that Whitford, Jenkins, and Weaver did this film - all are terrific in it.  Again, it's a very good movie, and highly unique and entertaining - it just fell short of what I was expecting.  I still recommend it.",
      "total_reactions": 1,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "The Cabin in the Woods simply oozes brilliance. It deconstructs almost every aspect of modern day horror tropes with such energetic wit. Despite being a little less frightening than I was hoping for, Goddard and Whedon have crafted such an outrageously fun film. Try not to smile. I dare you.",
      "total_reactions": 1,
      "user": "FrozenStar90"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "If you like horror movies, If you like Joss Whedon shows (Buffy, Angel, Firefly, Dollhouse, etc) If you like Evil Dead, if you enjoy a bit of humor with your horror, if you just like an original fun story.  If you like any or all of these things, then this movie is for you.  It IS NOT a regular old fashion slasher film. It is something sooooo much greater but to tell you anything will spoil the surprises.  IT IS AWESOME. This is a must see film that deserves a much wider audience.  This will be a cult hit that will live forever",
      "total_reactions": 1,
      "user": "kheas"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "The final girl, archetypally speaking, needs to be a virgin, somebody cut from the same cloth as Laurie Strode, the last babysitter standing in John Carpenter's Halloween. Since the 1979 thriller served as the blueprint for the modern horror film, Laurie is long-held by aficionados to be the gold standard, as final girls go. Not for nothing, in The Cabin in the Woods, is one of the characters named Sitterson, a moviemaking hack who works in a federal studio which mass-produces, in essence, snuff films, disguised as escapist fun for the general public. It's a franchise that, on the surface, resembles The Evil Dead movies. Sam Raimi, however, was a maverick, working with a different paradigm; he didn't codify women into virgins and whores, so in a sense, The Cabin in the Woods, set-ups aside, is not really paying homage to the trilogy, because the blood from the ritual killings wouldn't know where to flow, since the functionality of the machine that supplies the hieroglyphs with its gory outline, is predicated on filmic stereotypes(the jock, the brain, etc...). Raimi's characters would be too nondescript for the beast, who needs satiation from stock teenage plasma, a byproduct of reductionist storytelling. The beast has no use for a final man. Bruce Campbell always survives. In the film production-within-the-film, the recycled story, during most of its running time, goes according to plan: the virgin's friends die, leaving Dana alone to kill the redneck zombies. Similar to Laurie's fate at the hands of Michael Myers, a fate interrupted by some last-second heroics performed by Dr. Loomis, who repeatedly shoots the unofficial zombie(Michael won't die), Dana's survival is also dependent on man's preeminence as the sex best-equipped for a violent confrontation, out on the dock by the lake, when the final girl meets her match. Such a chivalrous act runs contrary to the notion that the final girl is, more or less, a man in drag, or in other words, a woman made masculine by default; her femininity imposed upon by a body count, therefore making Dana, supposedly, an equal match for the homicidal maniac. While the final girl, as it is written in her backstory, never experienced penetration, in a sexual sense, ironically, she has no problem doing the penetrating, with an arsenal of weapons, which is the case with Laurie, who uses a knitting needle, a wire hanger, and finally, a knife against her attacker. Dana, on the verge of being choked to death, is left with nothing but her bare hands to fend off the zombie. It's a fight whose one-sidedness serves as a tell-tale sign about her authenticity as final girl material. Arguably, Dana is a bigger whore than Jules, since prior to the road trip, back at the dormitory, the narrative's exposition clearly states that the designated good girl experienced a number of sexual encounters with her college professor. On the other hand, the relationship between Jules and Curt is never clearly delineated as being a consummated one. In the audio commentary for Halloween, Jamie Lee Curtis, an ex-cheerleader, admits that she was more like Lynda and Annie than the virginal Laurie. Knowingly, in The Cabin in the Woods, The Director says, \"You work with what you have,\" so like Carpenter's leading lady, Dana is forced to play against type, and gets her hymen back, for the time being, while the cameras roll. But when Marty comes to her rescue, the jig is up, as it pertains to Dana's put-upon innocence, because, as aforementioned, the final girl adopts the masculine role, yet here comes \"the fool\", doing a woman's work. What the film does is reimagine other horror films as meta-narratives, except in those cases, the characters never discover the truth about the artifice of their world, as Marty does, just like another fool, Truman Burbank in Peter Weir's The Truman Show, a horror film in its own right. As for Halloween, Curtis(like the actress playing Dana), it now seems, was mistakenly chosen to play Laurie. The presumed virgin, in a sequence where she and her girlfriends walk home from school, Laurie reveals her true self, in which both the final girl and Lynda transgress, arriving at the front door of their homes by cutting across their lawns, whereas Annie(trying to be a bad girl like Lynda) stays off the grass, and uses the walkway. Whereas Lynda has sex, Annie is seen only talking about it. When she takes off her blouse, it's because the babysitter spilled butter on it. Michael gets the wrong idea about her. Laurie was impure, because Curtis had sex, just like the real Dana. Curtis should have been the whore(Lynda), the dumb blonde. A smart girl wouldn't throw away her knife away, twice. In Rear Window, Lisa says, \"...you'd think we could be a little bit happy the poor woman is alive and well.\" When Dana escapes the diegesis, unlike Raymond Burr in the Hitchc*ck film, she gets her revenge not on the voyeur, but the film itself.",
      "total_reactions": 2,
      "user": "Shiira"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2013
      },
      "score": 5,
      "text": "I am not sure it is because I watch films with an analytic eye, but this film felt like a mishmash of films which although not necessarily masterpieces themselves, however made a huge impact back in their day: The Cube, Truman Show, Scream.  And if it had not been for the all hell breaks loose scene I would have been really wondering what the big fuss about this film was all about.",
      "total_reactions": 1,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "It appears to be a familiar horror trope: a group of college students plans to spend a wild weekend in the titular location. The new angle is there from the beginning. As they're dispatched (without much originality or brutality), the bigger picture emerges. The high concept is cool, but the execution is medium and the payoff is low. It's more of a sci-fi teaser than a suspenseful or shocking film. Overall, the creators are impressed with their own cleverness, but donâ",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "A horror-comedy that doesn't exactly do horror or comedy all that well. It's definitely a better comedy than it is a horror movie. There are some laugh-out-loud moments here, just not enough of them. It's not quite a spoof, but it definitely pokes fun at the horror movie genre. As far as horror goes this movie isn't scary at all. It's cool to see all of the different monsters and the bloody, gore-filled moments, but there's never a sense of fear. The movie is made decent by a great plot though.",
      "total_reactions": 2,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "While it took a great deal to finally get it on the big screen, \"The Cabin in the Woods\" is well-worth the enduring wait. Although, it's probably better if I don't say too much; it's deliciously practial joke, with a lasting punch of twist and turns, and a capricious finale that is as shocking as it is unexpected. It's a booby trap that has its claws ready for prey, you make think you may know where it lies, having made a few passes by its grasps in the tall, unknown grass, but before you know it, you have already been brought to the ground, on your knees without knowing how. It's to-the-brim with horror, not just scary in a conventional sense, but frightening from knowing how little you actually do \"know.\" Director/writers Drew Goddard and Joss Whedon take the self-awareness/inside-joke concept that has been tried--and has failed time and time again--and reinvigorate it into a meta-feat of filmmaking that is ghastly, hilarious, and even mysterious--at moments all-at-once--maintaining a solidly slick script throughout. The film is also host to a question mark that remains indelible on the bearings of the plot until the very end; it's stress-inducing. As for such a \"resolution\"; let's just say it isn't your typical \"The End\" finale. And, If you're thinking it's the creative-but-unfulfilling \"I gotcha' ending, you're equally wrong. No, the filmmakers do get the last laugh, but in a way that involves a fledgling character and an overarching story-revealing; audiences are, indeed, eventually guided outside the unascertained 'Woods.' Notwithstanding its subtle satirical tone, feeling a little hinge of \"Scream,\" which breifly reverts to genre cliches and one-liners, 'Cabin' is a genre-recalibrator, whose most impressive quality is perhaps, its transmuting of the very expectations audiences are taught to have from...watching fright flicks. The more one watches it marvel onscreen, the more one learns about the filmmakers--Goodard and Whedon--they are more annoyed by horror movies than they love them; for every flesh-flopping sinew and blood-spraying limb, another token is slotted in the laugh meter. The amalgamative dimension between opposing dichotomies makes for fun-frights.",
      "total_reactions": 3,
      "user": "FDT44"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "The Cabin In The Woods is strange, funny and brilliant. I've never watched movie like this before. Special thanks to hilarious duo Jenkins - Whitford, notes for Jenkins's performance, it's the most hilarious performance I've ever seen this year.",
      "total_reactions": 2,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "what a wonderfully gory, hyper-meta, funny and surprising film this is! there is so much here to enjoy, and i'm really not one for scary movies. great performances and very clever writing and what an ending!",
      "total_reactions": 1,
      "user": "wiggipop"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "A film that's a hybrid of The Evil Dead and The Truman Show is novel to say the least. For the most part, the film is engaging, funny and scary, and is incredibly playful in its deconstruction of horror conventions, particularly those that were dominant in the 1970s and 80s. Richard Jenkins and Bradley Whitford make a great comedy double act as a pair of senior technicians working for a company that simulates horror movie scenarios as part of a sinister grand plan. The group of young adults who take an ill-advised trip to an isolated cabin in the woods are all of a certain character archetype, a fact that becomes particularly relevant in the finale, but are all given a bit of a twist by writer/producer Joss Whedon ( the jock and his hot girlfriend played by Chris Hemsworth and Anna Hutchinson, for instance, actually have brains). Kristen Connolly's Dana is a decent and empathetic primary protagonist, but the real casting highlight is Fran Kranz, who completely steals the show as one of the great all-time movie stoners Marty, whose unique drug-addled world logic not only aids in its survival, but provides some of the film's best jokes. Drew Goddard has his name on the credits as the sole director, and in that role he appears skilled, but Joss Whedon's fingerprints are all over the film, and you have to wonder just how much Whedon allowed Goddard to do on set. Whedon's writing is funny and layered as usual, and the film as a whole has at least as much vigour and sense of fun as his earlier projects. Some astute genre revisionism and deconstruction and the sheer watchability of most of the film is nearly ruined in its final act. The last half hour is incredibly over-the-top and dumb, bordering on moronic, and threatens to de-value all the good that has come before. Here Whedon and Goddard look like they're abandoning their convictions for what their film should be, and pandering to modern blockbuster viewers and their incessant craving for elaborate action sequences and expensive special effects. The visuals in this portion of the film are terrific, but everything below the surface of the film becomes a little hard to make out at this point. The final revelation of the film is also incredibly disappointing, and a rare example of lazy writing by Whedon. If Whedon and Goddard had just stuck to their guns and produced a finale worthy of the intelligence, creativity and perfect pacing of the rest of the film, then The Cabin in the Woods might have been a classic of postmodern cinema. It's still good, don't get me wrong, and the vast majority of viewers, particularly avid horror nuts and Whedon fans will get a lot out of it, but Joss \"The Boss\" did stumble at the last hurdle trying to prove himself talented at all styles of filmmaking (like he needed to!)",
      "total_reactions": 1,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "Such a horrible mish-mash styles that just drags on and on. None of the elements ever come together. There are bits of so many different movies tossed into the blender that you end of with a pile of goop at the end. The movie starts out promising. The banter is hip and paced quickly to move the story. The characters range from flat to likable. But then the weirdness starts. Once in the woods, the story takes a dive. Actually, it suffers a psychotic break. The smart talk ends and plot self-destruction begins.",
      "total_reactions": 5,
      "user": "mindoculus"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "I definitely did not expect to enjoy this film but it did what it set out to do. It was highly enjoyable and I can't give a detailed review because I feel like you have to go in to it with no expectations in order to like it. Be open-minded.",
      "total_reactions": 1,
      "user": "Princess_Peach"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "Seeing the 9 out of 10 on this status should be enough to get you in the theater and watch this great film. It's more comedy then horror without making it a comedy. This changes the horror genre for the fourth time. First it was Nosferatu then it was Halloween then Scream. Now we have Cabin in the Woods who's take on horror will be bigger then the film itself. It's not important if the film was the greatest because it does have flaws. What's important is the fact that it defines a new genre, a better and more evolved look at horror!",
      "total_reactions": 1,
      "user": "filmtrashreview"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "I've been anticipating this movie for a long time, not because I thought it would be good, but because i'm a huge horror movie fan. I was fully expecting Cabin In The Woods to be another sad attempt at rebuffing Friday The 13th style scares, and what I got was a completely unique interpretation of what a horror movie should be. 'Cabin' successfully redefines the horror genre... something I haven't seen since 'Scream'.",
      "total_reactions": 1,
      "user": "stormD23"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "The Cabin in the Woods will undoubtedly find its way into the hearts of horror fans everywhere. The plot follows five friends who decide to venture to the titular cabin. These characters fall into stereotypical categories: the bimbo (Hutchinson), the stoner (Kranz), the jock (Hemsworth), the smart guy (Williams) and the virgin (Connolly). Of course, these are not the only cliches exploited. Upon arriving at a seemingly abandoned gas station, the group manages to insult the creepy, Confederate flag-waving owner. Meanwhile the cabin itself is as foreboding as any, but nobody (save the pothead) really minds or even notices. When the basement trap door suddenly swings open, the group decides to see what might be down there. Etc, etc. Meanwhile, a team of scientists in an underground laboratory closely watches every move the characters make. To go on further might ruin some of the surprises that await. The Cabin in the Woods takes several twists and turns over the course of its ninety-plus minutes. The film provides a few scares, but excels mainly in delivering laughs while skewering conventions. Writers Goddard (who also directed) and Whedon know their way around the genre and exactly how to send it up. Credit must also go to their superb cast, who fit their characters perfectly and find plenty of grounds from which to mine humor. The cherry on top comes in the form of an intelligent and well-observed metaphor. All in all most horror fans should be pleased more than pleased with The Cabin in the Woods. Some may be thrown by the approach, particularly those who enjoy more straightforward fare. Audiences who stick through to the end will likely find themselves having a good time.",
      "total_reactions": 1,
      "user": "Myffubs"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "The way I see it: You're going to have one of two reactions to \"The Cabin in the Woods\", either you'll like it (maybe even love it) or you won't (most seem to be loving it.) One thing is for sure though, you're not going to see this one coming a mile away, don't even bother guessing the plot while you're watching it. When the credits roll, don't think and wonder what the point of the movie was or why you sat down for nearly two hours watching what you just watched- Just enjoy and accept it for what it is, which I'll leave to you to find out what that is exactly. . . . have fun.",
      "total_reactions": 2,
      "user": "xXRenTyrellXx"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "cabin in the woods is insane. insane in the way that it understands what i want to see. the third act especially was one of the most satisfying things i have ever seen on screen. if you love fun, you love cabin in the woods.",
      "total_reactions": 1,
      "user": "bram29"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "I don't think that this is a great movie, by any means.  Nor do I love [or hate] Whedon.  But I do think that the users giving this movie scores in the red are why we can't have nice things.  Specifically, I think that they're the kind of movie fans who prevent American filmmakers [as a whole] from trying crazy stuff.  Sure, some crazy stuff is going to fall flat on its face.  So what?  This movie isn't a normal horror movie.  So what?  That means it deserves a zero?",
      "total_reactions": 1,
      "user": "Mike_M"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "Not amazing ... but definitely not bad.",
      "total_reactions": 1,
      "user": "YossGold"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "VERY refreshing film. The characters have been done before, but so what? This film has every horror film creature known to man. I only wish this was a TV show instead of a film.",
      "total_reactions": 2,
      "user": "Dufflad"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "Not as great as I thought it would be, but still a cool movie. I love the direction it has, with all the cliches and unexpected laughs, but I just feel like they could expanded it a bit more and really dug further into the last 30 minutes.",
      "total_reactions": 1,
      "user": "KerimBlue"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "What a great movie. Seriously, from star to finish i had a blast. The 3rd act of this movie is the best i've ever seen from this genre. Don't expect to be scared though, cause you wont be, but you'll enjoy the hell out of it, ill give you that. A parody of everything that is wrong with horror movies.",
      "total_reactions": 1,
      "user": "LuksRokz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "This film was awesome! I wasn't completely sure about seeing it at first, but my brother said it would be good and damn was he right!! It was a little confusing at first but everything becomes clear as the film progresses, and there's a few twist and turns that make the story really interesting. I was also in stitches laughing at points, but that may just be my sense of humour. If horror is your thing, make sure you watch this film!",
      "total_reactions": 1,
      "user": "mugslangley"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "I feel this was a really great film.  As many reviewers have stated, go in blind to this one.  To any of the reviewers trying to over generalize the idea that this movie rips off others movies I wanna say this.  The human race, we're like Taco Bell.  No matter how many items you see on that menu, it's still just different combinations of the same ingredients.  The saying \"there is nothing new under the sun\" applies to everything we see.  This film dares to shatter cliches, laugh at existing ones, and offers twists and turns that only a real d-bag would spoil for a would-be viewer.  Is it the best film of all time?  Of course not.  But it is one hell of a thrill ride, and that was the point.  For this reviewer, I feel they made a resounding attempt to be fresh and original with this Horror/ Dark Comedy / Sci-Fi.  If, like me, you feel like that kind of approach should be praised  in this land of remakes and sequels, you won't be disappointed.",
      "total_reactions": 1,
      "user": "Mal81"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "I will never look at a horror movie the same way again. This film blew my mind.  It was funny, it had a great story, and it put an amazing twist on a genre that has for too long followed the same ridiculous formula.  I cannot recommend this movie enough.  My only complaint is the acting by the teenagers was kinda bad (especially Fran Kranz), but Richard Jenkins and Bradley Whitford were fantastic.",
      "total_reactions": 1,
      "user": "MagnificentM"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "A well made slasher & Splatter movie, which pays homage to the horror genre with some nice twists and turns. The Cabin in the Woods retains the same high quality expected of a Joss Whedon production.",
      "total_reactions": 1,
      "user": "Dusty_Hayes"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "This movie is not in the same realm of movies as Scream, Behind The Mask: The Rise of Leslie Vernon, or Tucker & Dale vs. Evil. Those three movies pull off their horror/comedy near perfectly, The Cabin in the Woods, on the other hand, seemed a little too corny when they were fishing for laughs. There were definitely some funny parts do not get me wrong but it was just a very peculiar way of stabbing at the horror genre. During these corny parts there is also a sense of arrogance pouring out as if the makers thought that this was the most clever thing ever to be put on film, sorry, but it is not. The story definitely goes places I never thought it would but at that point the movie shifts to complete gore/cgi/sci-fi mode, which was certainly entertaining but what the f*ck happened to the horror? The horror elements of the movie are actually pretty great but it's literally less than 1/3 of the movie which disappointed me. This will never go down as a great horror movie, mainly because it's not a horror movie. I think the hype it generated beforehand ruined it a little for me because it was being compared to Scream and was getting all this praise. But seriously Scream is one million times better than The Cabin in the Woods. Overall I enjoyed watching it but it came off as an arrogant comedy/sci-fi flick masquerading as a horror movie. I say if you want a relatively recent example of a good horror comedy thennn Tucker & Dale Vs. Evil > The Cabin in the Woods. Yep, that's right, I said it, whatcha ganna do about it",
      "total_reactions": 7,
      "user": "TTW107"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "An excellent blend of comedy and thriller The Cabin in the Woods has redefined the horror film genre. I have heard many say that this is one of the best horror films in the last 10 years and I believe that they would be mostly right about that. My only critique of that is that the movie is not so much scary as it is clever and well written. As someone who does not really like horror films I was pleasantly surprised by this film. One can definitely see the influence of Joss Whedon in the writing.  This will likely be in my Top 10 of the year and is worthy of much praise. \"Am I on speaker phone?\" Odin's Score: 90/100",
      "total_reactions": 1,
      "user": "Odin777"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "This is the most fun I have had watching a thriller/horror film in as long as I can remember. I don't like the genre of horror much. I think it's generally predicable, and forced. This film, however, took me for a trip. Watching stupid characters get killed is fun and all, but when the underlying plot of this film is exposed in its latter half it really grabbed a hold of my attention. I haven't seen anything like this before. It twists and turns all over the place, and left me in a gleeful state. Is it scary? No. Is it enjoyable? Decidedly yes! I want to watch it again in the near future with lots of popcorn and a girl to cuddle with.",
      "total_reactions": 1,
      "user": "Greatbeallo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "Good but not great.  A lot of kids are highly overrating it.  There isn't many surprises, twists, or turns as most other reviews suggest, it's not that terribly smart either.  The gore wasn't that good and the special effects were very meh too.  Tucker and Dale vs Evil did the dark comedy horror genre better.  See this movie but do not expect greatness, I was quite a bit let down...",
      "total_reactions": 1,
      "user": "k3Ck"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "I had been looking forward to this movie for a while and though I could see some of what was coming I definitely didn't foresee the grand scope of things. The only things I can say negative(if they are actually negative) is that I wish we could have seen more of the things used and also I wish we could have a sequel....though i dont think thats possible. I know I am being vague but to ruin it for everyone would be a crime. Go see this immediately, its awesome fun :)",
      "total_reactions": 1,
      "user": "Oblivion"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "I did enjoy the film  to a point I would hardly call it ground breaking though its two or three other films put together but it is done well.The problem I have with the film is the end story it just seems rushed and not much thought put in to just left me feeling a bit let down.",
      "total_reactions": 2,
      "user": "scoley"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "I've never been a fan, as a rule of horror movies, however, the trailer drew me to this one and i'm glad it did, the awful acting we usually get in horror movies wasn't there this time round, in fact, the whole cast were excellent, the special effects were really very good and the humorous, intelligent dialogue (another thing you don't usually get in horrors) was brilliant, loved the film, Chris Hemsworth, although with less to do in this than he does in Thor, was great in it too.",
      "total_reactions": 1,
      "user": "mrjeffsir"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "Horror and humour can go well together, because they share an essential element: surprise--which is what this film is somewhat lacking in. It's a potentially good film, but ultimately ends up being not sexy, funny, or scary enough. If the point of this film was to make a statement, it's not one that ends with an exclamation mark. Also, to those for whom this matters: plot holes abound.",
      "total_reactions": 2,
      "user": "Darian"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "This could be described as a funny horror movie, but I'm going with a very dark comedy. But it works well either way. Funny, scary, fast and above all - smart! The unexpected turns, sparkling dialog and note-perfect acting make this a joy all the way through. I haven't had this much out-and-out fun at a movie in years. Very highly recommended, and worth seeing on the big screen before DVD, too, just to get all the details.",
      "total_reactions": 1,
      "user": "p-mac"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "This  movie has lots of twists and turns which make it interesting and entertaining to watch. I must admit i was not able to predict the ending, including how crazy it was, which in itself was entertaining. Would have liked a little more explanation as to all the whys and hows i was left with though.",
      "total_reactions": 1,
      "user": "mooshu"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "People kept telling me Cabin in the Woods teaches an old dog new tricks. In some parts, yes, this movie did have a different approach in the telling of a thriller/horror. And for the most part it was minor details that set this film apart from its competitors. I really liked the way Cabin in the Woods stared out, and some of the opening dialouge was funny. But, how the story got to where the kids are introduced was a little bizarre. The set up, I feel, still felt like a rather common horror movie. It was mostly the lines that connected the big plot points in this movie that felt new. The kids still venture on down to the strange house's spooky basement, but why they go down there is a different sort of push to the plot. The characters were nothing out of the ordinary either, none of them overly alluring. The end gets a little bit messy and kinda sci-fi. And the very last scene felt way too familiar, and I think they were aware of it (which in a way is a pro). But all in all Cabin in the Woods keeps you interested for the majority of the movie, just the last 1/3 of it was a bit average. I know it sounds like I'm being a little harsh on it for still giving it a positive review, but that mostly to counter all the overly positive feedback its getting from it's other critics. I mean, a 90 something percent on Rotten Tomatoes? Come on.",
      "total_reactions": 2,
      "user": "Fujiforker"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "The most interesting horror movie I've seen in a while - a clever premise that is fed to you in parallel with a seemingly traditional teen slasher flick. Saw it twice in theatres; will be buying the DVD.",
      "total_reactions": 1,
      "user": "klausfuture"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "This film was an interesting mash up. Joss Whedon, the creator of Firefly and Buffy gives his input into the story as well as the director of Cloverfield and countless Lost episodes, Drew Goddard, both make this film worth watching. At first, you are turned on your ear. Is this really a horror movie? I think not. The name of the game is simple: four teens, the woods, killers. Throughout the film you learn a little bit more, and by the end you are like HOLY S***! Needless to say, not the typical horror film. Watch this movie if you want something originally interesting. Also, this movie is not for the faint of heart. The ending sequence is very gory. Almost campy in the gore with blood spraying this way and that. Otherwise, a great film.",
      "total_reactions": 1,
      "user": "Fullmetal"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "The Cabin in the Woods works solely on the merit of its humor.  It is well written and very funny.  People looking for genuine horror will most likely be disappointed, although there are some intense scenes and because the characters are fleshed out and enjoyable you can root for them.  Admittedly the ending disappointed me on the first viewing, although on the second I accepted the movie as a comedy and was able to enjoy it fully.  All that being said, the movie is not as original as some of its highest praise is suggesting.  Feast, a movie from 2006, comes to mind as a horror comedy that identified the cliches in the genre, but succeeded where Cabin in the Woods failed in being funny and qualifying as extreme horror.  Still, The Cabin in the Woods is above average and still may be the funniest movie I have seen all year (the banter in the control room between two of the main characters is always gold).  You need a sense of humor, and some sense in general when it comes to being genre savvy to enjoy this movie.  A must-see for horror fans and horror-comedy fans alike.",
      "total_reactions": 1,
      "user": "CriticalState"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "Truly one of the greatest horror films of the past few years. The originality gave new meaning to the future of horror. The humor struck perfectly with a mix that made you feel sick for laughing, yet pleased to be a part. Must see horror of 2012!",
      "total_reactions": 1,
      "user": "rcknjrod5763"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "Funny And Scary.. This Is In The Writing Style Of Zombieland..",
      "total_reactions": 1,
      "user": "GagaForGhibli"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "Cabin was quite enjoyable - not particularly frightening...more like jump-in-your-face startling.  It was a well done lampoon of cheesy horror flicks, but with a twist.  Worth the $8.",
      "total_reactions": 1,
      "user": "hugethorn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "The Cabin in the Woods WOW it was a great film the actors and actresses are great the writers the directors,producers and everyone who was involved , The film has a understanding story im not going to give it away for anyone who has not seen it. This gore filled film is amazing definitely recommend it to anyone it also made me laugh a few times it does have a comedy side to it too but this movie is amazing",
      "total_reactions": 1,
      "user": "cooley123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2012
      },
      "score": 7,
      "text": "The Cabin in the Woods is directed by Drew Goddard and this is his directorial debut. There",
      "total_reactions": 1,
      "user": "BryceHoogland"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "ust saw Cabin in the Woods. Wow. What a movie. What can I say about Cabin in the Woods? Well not much really. This movie is so packed to the brim with things that can so easily be spoiled that I suggest you go see this movie RIGHT NOW! Avoid all the amazing reviews its been getting, avoid the trailers, avoid the TV spots and most of all AVOID ALL DISCUSSIONS WITH PEOPLE WHO HAVE SEEN IT!!!!! I wont get into all the details on why this movie is brilliant but I will say that it is one of the most original and just bat **** crazy movies I have ever seen. Just go into this movie expecting an extremely fun horror/comedy and you will have an amazing time. CABIN IN THE WOODS FTW!!!!!!!!!!",
      "total_reactions": 1,
      "user": "CBeckman25"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "Be forewarned, there's a lot of blood and severed bod parts in this one... \"The Cabin in the Woods\" mixes humor and gore well to put a fresh, if not twisted, take on the prototypical slasher movie.",
      "total_reactions": 1,
      "user": "JTKelley"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "I went and saw this at the cinema within a week of release read no reviews just watched all the trailers and I was incredibly hyped for the film as I thought it was going to be bloody and hilarious. I was not disappointed. Marty and Dana were the best characters in the film. The Idea behind the film is simple. The creationary mind of Whedon and Goddard truly strikes again. I can't say much more without using Spoilers but It is a film definitely worth seeing.",
      "total_reactions": 1,
      "user": "PepticNightmare"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Oh how advertising can absolutely ruin your excitement to see a film. Being marketed as a generic, run-of-the-mill horror film is the worst thing that can happen to you from a critical standpoint, but from a commercial point of view, there",
      "total_reactions": 1,
      "user": "Paganostaghetti"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "The Cabin in the Woods is absolutely absurd! It twists and turns multiple times throughout its short running time, borrowing heavily from a variety of films in the horror genre (and other genres as well), but under the sure direction and brilliant screenplay of Joss Whedon and Drew Goddard, this film is a complete breathe of fresh air in a world of doomed horror movies.",
      "total_reactions": 1,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Sin duda el homenaje perfecto a las películas de terror, podemos ver una evolución del género que termina por hacerla una alta recomendación obligada.",
      "total_reactions": 1,
      "user": "chepod8"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 3,
      "text": "It is amazing on how so many people like this movie.",
      "total_reactions": 1,
      "user": "Vyrotix"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "It starts off incredibly weak but somehow manages to get better. The plot twist is good and it features a large amount of humor and enjoyable moments. It truly is a satirical horror film, it's just too bad that it didn't work out with Valve.",
      "total_reactions": 1,
      "user": "sloppyjoes"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2013
      },
      "score": 2,
      "text": "Everyone seems to actually like this flick. I don't get how. The story is dull, cliché; and even when you realize there's a twist, it's boring and unentertaining.",
      "total_reactions": 2,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 5,
      "text": "\"The Cabin in the Woods\" is a pretty underwhelming movie. It's certainly a fresh take on movies like \"Cabin Fever\" and \"The Evil Dead\", but it's neither funny enough to be a comedy nor scary enough to be a horror movie. The most disappointing aspect was the ending which seemed too contrived. It is a pretty enjoyable film to watch with some friends, though, so I would recommend it.",
      "total_reactions": 1,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2016
      },
      "score": 0,
      "text": "This is the worst movie I've seen last year. Really. All the \"tribute\" thing it's worthless. There is no plot. There is no 3-D characters. There is no **** sense in the script.",
      "total_reactions": 5,
      "user": "RJMS1984"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "Well, finally a good horror! Good horrors come so infrequently, I always wonder if they're actually good, or they seem disproportionately better because the rest are crap. Well, that is no question with \"Cabin\" -- simply put, it is a very good horror film. It has a great screenplay and it actually works with tons of horror film stereotypes which make it even better. It is actually quite funny at times and it practically satirises the whole genre somewhat. There are quite a few thrills and scares, but ultimately, I did not get frightened too often. That was my biggest criticism of the film, also. On the other hand, it kept me constantly engaged because of the unexpected twists and turns that it would take. So, by no means as scary as \"Drag me to hell\" can be, but it for sure is as engaging, interesting and funny. Very good stuff!",
      "total_reactions": 0,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "If you’re a fan of Josh Whedon chances are you’ll enjoy this film. It’s far from perfect but it’s unique spin on the horror genre certainly kept me entertained from start to finish.",
      "total_reactions": 0,
      "user": "drlowdon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "This is far from the cliche horror movie. There is actually a sense of brilliance in this film. With a typical horror film start, the original finds its way to the top as it is filled with surprises and plot twists. I'd recommend it for it's cleverness and production.",
      "total_reactions": 0,
      "user": "EastonReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "part horror part comedy is what The Cabin in the wood tries to be.the horror was an emotion of fearing the unknown that lies beyond human knowledge while the comedy is a satire on the young generation that was depicted with the killing of typical american teenager.  either horror or comedy,director Drew Goddard alongside Joss Whedon have crafted one of the most weird,twisted,and mind altering horror movie in recent years. it is a horror movie that surely will become a cult in years to come.",
      "total_reactions": 0,
      "user": "Moviegeeks23"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "I thought this waa  Very cool horror film. It was entertaining and thrilling and scary and gross. The movie had everything I'd expect from a horror movie. As a bonus it was well acted and executed, You won't waste your time with this, but it is kind of cerebral as well, andI guesss many people aren't prepred to make the investment.",
      "total_reactions": 0,
      "user": "Xon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "If you've seen the trailers, chances are this movie came across as formulaic, cliche, and painfully predictable.  After having seen the it, I can only think that they did this intentionally so that you'd be that much more surprised when you actually saw it.  If you go to this to see a run of the mill slasher with cut and paste characters, your world is going to be thoroughly rocked.  But since you know that a twist is coming (even though I've done my best not to spoil it) maybe you should take your friends to see it and don't give them any heads up.  Trust me, they'll thank you afterwards.",
      "total_reactions": 0,
      "user": "MelonPan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "This was a good movie. I think one of the writers was Joss Whedon, of Buffy and Serenity fame, and this film has that same sort of polish and quality as those classics. As so many other commentators have said, you can't really say much without giving away the plot, so I won't.  Its a clever, scary, funny movie. Lots of side references to other movies for those who like that sort of thing. What I will say though is don't be surprised if you can make a good guess at the overall plot quite early on into the movie. To me that doesn't matter, its a great movie, and one I'll watch several times.",
      "total_reactions": 0,
      "user": "diehard-gamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "The Cabin in the Woods was unique. Constant fourth wall breaks and satire made this movie that much more enjoyable. References and inspirations from other staple horror films are evident throughout the movie as they compliment the unique narrative. It pays homage to the classic films of the genre while also playfully poking fun at them. The story itself uses the parody of horror cliches to its advantage to create a plot that is classic suspense/thriller inspired alongside comedic elements that don't interrupt the plot but rather compliment it. This combination of classic horror action and satire make The Cabin in the Woods unique and a film that is sure not to disappoint fans of campy gore and violence. The Cabin in the Woods is a must see for horror fans, or anyone in the need of a movie is truly capable of standing on its own within the horror genre.",
      "total_reactions": 0,
      "user": "owmynose9000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "An enjoyable, clever and pretty original movie, with good humour. A little too heavy handed at times.",
      "total_reactions": 0,
      "user": "nascent"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "The only things I didn't like about this movie were the title and the guy who played the stoner. Other then that, It was a pretty good film that mixed horror and comedy rather well. Definently worth checking out.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "Having re watched the trailer after the film, the it does pretty much give away what the film is really about and make the twists a lot less surprising. However it is a very good, if surprisingly simple story. It sets up a very weird situation and actually explains WTF is going on by the end, which most films wouldn't. Just don't watch the trailers if you haven't already.",
      "total_reactions": 0,
      "user": "SwarleyStinson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "Had benefit of watching this without any knowledge of what it actually was. Brilliant take on the genre with quite a few laugh out loud moments. Well worth the time and money.",
      "total_reactions": 0,
      "user": "bosnian"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "Cabin in the Woods is a uniquely crafted dark horror comedy that is writer Josh Whedon's homage to classic slasher flicks.  With an astoundingly funny vein of dark comedy running through the entire film, this film sets itself apart as a treatise of the horror genre, something that Scream accomplished a decade previously but Cabin in the Woods elevates to another level.",
      "total_reactions": 0,
      "user": "OnAnarchy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 5,
      "text": "I commend the effort in attempting to make an original film today; however, Cabin in the Woods clearly gets lost in its own complex, mind puzzle. So close!",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "After being told to not watch this, I decided to watch it. More proof that the general movie going public and critics have no idea what constitutes a good movie. Joss Whedon uses this film as a vehicle to commentate on the popularity of \"torture porn\" that seems to dominate the horror box offices. The acting is superb. There were scenes that could have been lighted better but all in all this a fun horror movie with \"hidden message\" that made all the great horror movies, well, great. A must watch for any horror fan.",
      "total_reactions": 0,
      "user": "WestHamYank"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "This is what we call a original and entirely different attempt.Its a great horror movie.",
      "total_reactions": 0,
      "user": "moviebuff_420"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "One of the better horror movies I've seen in a long time. I loved the whole plot of the movie, with sacrifices and whatnot. The characters were good, but they did save the two most likeable characters til the end, which was good. The comedy in the horror movie was great, I actually kinda liked the \"villains\" in the show haha. Ultimately it was a horror movie, and the death scenes overall were alright nothing spectacular. The ending was pretty epic and mindblowing, and I must say pretty satisfying. Overall a excellent hybrid between a horror and a comedy, with a great story and a awesome setting/atmosphere.",
      "total_reactions": 0,
      "user": "sityoazzdown"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "Not exactly a horror movie, but more of a tribute to the horror classics, the Cabin in the Woods presents an original plot with literally TONS of references to cult horror classics and even some of the video games (Will you spot the Boomer, Hunter, Tank and the Witch from Left 4 Dead?) Can't describe the plot without spoiling it, you just have to see it for yourself, but I guarantee the twists (and boy there are many of them) will be unexpected. The only thing is that the movie isn't exactly scary, which doesn't make it any less entertaining. A must-watch for anyone, especially the horror fans.",
      "total_reactions": 0,
      "user": "RealMuthaF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "This is a very good comedy movie, even more so because I walked in expecting a horror flick. The two greatest accomplishments of this movie would have to be their transitions, which are absolutely amazing, and their spin on the idea of our cookie cutter horror movies. I have recommended it to multiple people as a comedy and they loved it, so I am going to recommend it to y'all.",
      "total_reactions": 0,
      "user": "TheMaskOfSanity"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "If you think that the Cabin in the Woods is just like any other typical slasher/horror film, then you are completely wrong. I thought the same before watching it and it totally proved me wrong and I'm really glad that it did. First of all, I appreciate the great work done by Joss Whedon and Drew Goddard, they have made something so unique and fresh that you start wondering that why did nobody ever think of it before. The writing is great, performances are good (just the right amount of what you need in a horror film). The storyline is brilliantly incorporated in the genre, the rituals and the sacrifices to keep the Gods happy. The dark humor element is fantastic, really made me laugh at times. The monsters are horrific. I read some reviews by people who are complaining that the film is stupid and terrible. When a typical horror film is made, they complain and when a fresh and original idea is penned into a film, they still complain. Those people can never learn to appreciate the good work. Most of the people who liked the movie also think that the ending sucked, it should have been something else, but that's where the writing of Goddard and Whedon comes in. They knew we would be expecting and predicting the typical ending but they made a daring move by making a fine climax. Not only the climax, the entire film is fine, I have never watched anything like this before and for that, I thank Whedon and Goddard's imagination. If you are a real fan of horror/slasher films and are fed up of watching all those same and predictable ones over and over again, then this film is an absolute treat for you. The Cabin in the Woods is definitely one of the best horror films of 2012 and a rebirth of horror genre.",
      "total_reactions": 0,
      "user": "theahsanhaseeb"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "The Cabin in the Woods is some genre-busting, fan boy-pleasing, energetic stuff, that resonates in the horror fan in all of us to deliver some of the funniest criticisms, and celebrations, of the genre to date. The overall tone of the film is inconsistent, but that's also a compliment - the movie is so ambitious that it spins way out of control, far beyond the limitations of any standard horror movie to become this meta-beast. Any horror movie fan can see that this film has been made with a gleeful love of the genre, flaws and all, and the final half-hour delivers one of the greatest visually spectacular finales I have seen all year (even compared to that of another Joss Whedon project, The Avengers). The movie is so funny, weird, and just plain awesome that I can't really recommend it any higher to the average horror movie fan, but dissenting voices should probably stay away. This whole thing will come off as ridiculous to them.",
      "total_reactions": 0,
      "user": "TheDRauch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "Although at times it suffers from cheesy dialogue, The Cabin in the Woods is easily on the best horror films of our time, poking fun at the cliches of horror, while being pretty scary ,as at least one of your greatest fears appears, in one of the best films of 2012.",
      "total_reactions": 0,
      "user": "charlieW24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2015
      },
      "score": 5,
      "text": "\"Don't fix what isn't broken\" is an old saying that The Cabin in the Woods completely disregards. It tries to offer an explanation as to the happenings of all your favorite horror movies and, in doing so, winds up undoing itself and being plain stupid. Yes, it is a ton of fun and can be scary at times, but the scares are undone with the explanation. Horror rides on mystery and this one completely destroys it and turns it into a game. Though it is well thought out, I honestly wish they came up with something better to do with, well, all of this. It blends horror and comedy really well, extracting and playing with the expectations of both throughout, but man, it is stupid. The acting is undeniably poor and despite its subversion of expectations, it manages to remain predictable. Ultimately, if this one ends after an hour and removes some of the extra garbage to leave no unanswered questions, it would be way better.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "This movie is AMAZING, it recreates the whole idea of slasher film, will horror basically, ITS SO GODDAMN AWESOME, its like EvilDead meets Serinity, the film is great and worth a good sit down, 10/10",
      "total_reactions": 0,
      "user": "ReubenIsAGod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "This movie was a great satire on modern horror. If you legitimately enjoy slashers and are looking for more of the same, this isn't the movie for you. It's a spoof, and judging it based on jump-scares and nail-biting suspense is like rating a romantic comedy on gore.",
      "total_reactions": 0,
      "user": "stefrank"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "The title kind of discourage me to watch it, i would have thought this movie would just be a murder / killing type, but i was wrong after i found out that Joss Whedon was directing the movie and i gave it a go. I enjoyed it from the beginning to the end of the movie. The storyline was really surprising and the ending was unexpected.",
      "total_reactions": 0,
      "user": "ivan_terrible"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "The end of this movie makes it all worthwhile. It is smart and the way it plays out actually rewrites every other horror movie you've seen before! Quite fresh!",
      "total_reactions": 0,
      "user": "hellojello"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "The only reason this movie was unpopular was because they couldn't really give anything away in the trailers. It is such a great, interesting, new twist on horror movies. This is the first of 2 hits written by Joss Whedon, the second being The Avengers, and I'm eager to see what's next. I don't want to give anything away, so I won't say anything. If you see it without knowing much, then you'll have a much better film experience. This movie is just all around fantastic, and you HAVE to see this movie. Even if you don't like horror movies, you'll still find this movie interesting.",
      "total_reactions": 0,
      "user": "peterbmacd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Maybe not the best horror film ever, but certainly the most and ingenious one. The perfect blend of pitch black comedy and horror executed to perfection.",
      "total_reactions": 0,
      "user": "Seriosity"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2012
      },
      "score": 1,
      "text": "This movie was awful.  I'm a teenaged girl and I watched this movie while home alone, all the lights turned off, at two in the morning- and it didn't scare me for a second.  The idea was stupid, the monsters and villains were right out of a parody, and the writing was closer to comedy than horror- or thriller- hell or Drama.  The acting was good ( especially given what they had to work with), and Hemsworth & Williams were sexy as ever but the movie was boring and not even worth the dollar I paid for redbox.  Also \"the whore\" and \" the virgin\" are the only female roles they can come up with?  Unsurprising but disgusting nonetheless.",
      "total_reactions": 0,
      "user": "HalfUnderwater"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "Great movie",
      "total_reactions": 0,
      "user": "Trayus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "The \"Cabin in the Wood\" never loses any momentum throughout the whole movie. There are many main points that connect very well. The only thing I don't really like is the killing scenes, it looks kind of unrealistic. But the plot is fantastic.",
      "total_reactions": 0,
      "user": "Canotic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "A fiendishly clever \"The Cabin in the Woods,\" a deceivingly insightful horror film that elicits just as many knowing chuckles as horrified gasps. Five teenagers head off for a weekend at a secluded cabin in the woods and they find an odd assortment of relics, but when one of the women, Dana (Kristen Connolly), reads from a book she awakens a family of deadly zombie killers. There's far more going on however than meets the eye as the five campers are all under observation. This is no ordinary cabin in the woods, but actually a set for a diabolical scientific experiment. Beneath the cabin is a basement, and beneath that is a vast modern laboratory headed by technology geeks (Richard Jenkins and Bradley Whitford) who turn dials, adjust levers and monitor every second on a bank of TV monitors. Goddard also takes on directing responsibilities, and his feature film debut demonstrates a keen eye for various genres, all incorporated seamlessly into this film. Laughter and satire are always close by, and I can't recall another film that's remotely close to its offering of thrills, spills and laughter. There are plenty of moments where you're kept on the edge of your seat, with surprising twists and turns popping up every now and then. Screenwriters Joss Whedon and Drew Goddard take the quintessential horror film ensemble of characters, and ridiculous scenarios and then inject a dose logical rationale, keeping it thoroughly entertaining. The idea of free will and our decision making process as people is explored. Do horror characters make choices because of the requirements of the genre, or because of their own decisions? This is not a perfect film by any means, but its's exciting because it ventures so far off the map for your typical horror film. The movie becomes kind of a greatest hits collection of horror movie techniques and clichés; twisting them around, while poking fun at them simultaneously. In a day and age where everything is a remake or a reboot, how refreshing to enjoy something completely innovative, and executed with great skill. Highly recommended and requires multiple viewings.",
      "total_reactions": 0,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "Quite possibly one of my favorite horror films of all-time and not for the sheer scares or thrills, but for the dialogue and smart plot twists on the genre. Any film that ends with an angry god rising up from the Earth and Nine Inch Nails' \"Last\" blasting at your eardrums is a very big win in my book.",
      "total_reactions": 0,
      "user": "DisasterpieceMK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "I wouldn't have watched this if it were not for my best friend's recommendation  and boy was I surprised at how much fun and how fantastic this film is. So many horror cliches that it plays up well and that is the point of this project. Dark humor that both makes fun of the cliches in horror flicks while sticking to the actual horror and gore parts. Definitely recommended that you watch this!",
      "total_reactions": 0,
      "user": "Toffenuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "Going into this movie, I had no clue what to expect. I had not seen any trailers or reviews. I knew absolutely nothing about it. Once I saw Joss Whedon's name on it, I got really curious. The first hour or so the movie more or less plays out like EVERY slasher movie that came before it. But as the second half of the movie takes over the real story leaps forward and HOLY S*** is it great. This movie just surprised the hell out of me. Great writing, intentionally generic (but likable) characters, fantastic FX. While it isn't a Horror-Horror but more accurately a parody of a Horror that knows what it is and plays with that as much as it can. It's been a really long time since I've seen a movie like this and I say thank you Mr. Whedon for giving me such a wonderfully entertaining movie.",
      "total_reactions": 0,
      "user": "Rox22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "This film is nothing short of amazing and easily my favourite film of all-time! With twists & turns at every corner it was one hell of a ride to watch the first time and I'm still enjoying it now (3 times I've seen it). Lead by a great cast and with one heck of a storyline I would find it hard to find a Horror fan that didn't enjoy this film. The best thing about it is its such an original idea that hasn't been done and yes it had one hell of an ending! The best film there is, enough said!",
      "total_reactions": 0,
      "user": "survivorfan989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "One of the many good things in this movie was the fact that not only the writers of horror movies do bad things to their victims but also and many times much worse to their evil monsters. thumbs up...",
      "total_reactions": 0,
      "user": "vorester"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "One of the greatest and funniest horror films ever made, it has a great story and a powerful scenes with great visuals and exquisite acting, I am a big horror fan, this one is good, it is really good, although I was barging for something smaller and simpler, but it turned out to be way too different than expected!",
      "total_reactions": 0,
      "user": "HaithamBayazeed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "Considering that the plot in this movie didn't make any sense, and was just plain stupid  Cabin in the Woods does bring some funny, sexy, and cool moments to the table. The acting was really average, the special effects were awesome, but by the end of the movie you begin to realise that the director could have done so much more with it. It starts off good then the ridiculous plot twists ruin the movie to a certain degree. I was a bit disappointed, considering I was ecpecting more, but a decent flick nonetheless. In 3  4 days after watching it you will forget most of it. Average.",
      "total_reactions": 0,
      "user": "ag10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "With a giant god like hand, Whedon destroys viewer expectation by carefully crafting the perfect satire film with a wit, intelligence and depth that is often lacking in the films it makes fun of.",
      "total_reactions": 0,
      "user": "LaGuerta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "A film with a generic horror movie name is everything but.  When I first saw the trailer for this movie I thought it was good to be another awful horror film, but the twist led by the characters played by Bradley Whitford and Richard Jenkins makes this one of the most inventive horror films I've seen in a while.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2013
      },
      "score": 2,
      "text": "A totally overproduced 08/15 horror movie.",
      "total_reactions": 0,
      "user": "Jacobparker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "At first you think that this movie is some imitation of \"The Evil Dead\" with a bit of clichés, but no. It's not, not at all. It is way better. Overall, this is the best horror movie of the decade, possibly of all time.  This film is the most entertaining horror movie of all time, and the craziest, most fun, most exciting, most puzzling, most jaw-dropping horror movie ever. Pure awesomeness",
      "total_reactions": 0,
      "user": "kewlgeek555"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "Surprisingly smart entertainment. I don't watch or like horror movies, and prompted by a friend was told I had to see it. Finally went on the ride, and by the end was blown away.",
      "total_reactions": 0,
      "user": "greygoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "I have really mixed feelings after watching this movie. It's sarcastic horror movie with a lot of humour things but containing some aspects of mainstream movie.",
      "total_reactions": 0,
      "user": "Rayiner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Rotten Tomatoes ranked this as the 34th greatest horror film ever. I don't blame them. Cabin in the woods will gain more cult following as the years go on, but after years of horrible horror flicks, The Cabin In The Woods will give you one of the greatest horror movies of all time. Just when you think it's your typical slasher flick, it takes a complete left turn down \"What the hell?\" lane, and I won't give away too much, but I will say this. There's a unicorn that stabs a guy. It's awesome.",
      "total_reactions": 0,
      "user": "Jamison12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "Why people liked this film????? It is not something more than a joke. Seriously? people under the earth send some monsters to kill people who live in the cabin for the gods??? Yeah, it is original. ORIGINAL STUPIDITY. At some points it made even laugh because i didn't want to cry of what i was watching. Thumbs to the ground.",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "I went in this movie expecting a cheap slasher horror film, but I was having high expectations, because it has been announced in development since 2009, what I got was way too more in depth than I was barging for, this movie can't be reviewed without spoiling it, what I have to say is...SEE THE CABIN IN THE WOODS, it is different dark comedy with mystery and great visuals (hint) SEE THIS MOVIE.",
      "total_reactions": 0,
      "user": "AReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "\"Statistical fact: Cops will never pull over a man with a huge bong in his car. Why? They fear this man. They know he sees further than they and he will bind them with ancient logics.\"",
      "total_reactions": 0,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2013
      },
      "score": 5,
      "text": "I went to watch this with a group of friends, and I wasn't taken with it as much as they were. The storyline wasn't fantastic, neither was the acting, but it was an alright film overall as I could just about follow what was happening. Ending was awfully american (two main characters survive to the end, one doesn't shoot the other despite if they did they would have saved the world, but of course they couldn't because of feelings and  though.",
      "total_reactions": 0,
      "user": "Dr_Fetus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "This movie was dreadful. Following on from watching \"woman in black\" and \"Abraham Lincoln vampire hunter\" the last two nights I was looking forward to this given all the positive reviews. I see it was meant to have funny parts but I obviously missed the clever tongue in cheek parody of the genre. I just found it very weak.",
      "total_reactions": 0,
      "user": "Jackboswell72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "Genius movie! It's funny and scary when it needs to be. My immediate thought when they arrived at the cabin was it reminded me of the Evil Dead, but not in a rip-off sort of way, more like a tip of that which is what I feel this entire movie is. I think anyone who loves a good horror movie should see this and not because of mind blowing special effects or that it's super scary but because it is an excellent homage. I loved jabs at horror cliches and how it didn't feel like a parody. I had a heard a few times it was horrible which really lowered my expectations which were far exceeded.",
      "total_reactions": 0,
      "user": "Longo12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "Look, I get it. The idea behind Cabin in the Woods is immensely clever, and had plenty of potential, but even with its gripping comedy and action moments, this film really falls flat. They try so hard to make the allegory and parody work, but in the end, it really just doesn't make sense. I think this movie is good for some cheap thrills, but don't expect anything too grand or amazing.",
      "total_reactions": 0,
      "user": "Potarto72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2016
      },
      "score": 10,
      "text": "This movie just makes sense! Not single one of the characters in this movie makes stupid decision. Like the overused \"lets spilt up\", motherf***er got killed because you spilt up. This movie is not that clever, its just genuine and honest. Honest about this genre we call horror, which all of their formulas make zero sense. I'd say even the \"whore\" character is not that dumb, not to mention Chris Hemsworth character has an opinion on books, in the mean time he portrays a stereotypical jock. Also, that stoner guy is the best and lovable-est character from a \"horror\" film.",
      "total_reactions": 0,
      "user": "HalRepublic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2016
      },
      "score": 8,
      "text": "The movie was entertaining, violent, well acted, well executed and funny at times, The Cabin in the Woods might not be the most original horror movie , but it certainly is one of the most entertaining of 2012.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "I really had thought the movie will be like another horror five young movie (tipic stuped american movies), but, this really one is so amazing. Original! Not as other. That was I waiting for",
      "total_reactions": 0,
      "user": "Scrlowtch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "The Cabin in the Woods is a great example of how complacent the horror genre is becoming. In comparison to other movies in it's category The Cabin in the Woods is fresh and brings something new to the table. On it's own, this movie really is not great. While the idea and underlining message of the film is definitely new and enough to raise appreciation, the only thing that keeps you from boredom is wanting to know what's really going on. That may sound like a positive, but it caused me to not care about the main characters or their impending doom. While interesting, nothing in this movie is scary. If you are looking for an interesting movie that may make you think (although not very much) I don't think you will be very disappointing here. If your looking for a scary movie this will leave you wanting much more.",
      "total_reactions": 0,
      "user": "hopefulcynic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "If you really enjoyed the Scream franchise, you're gonna love this one, and that is why. The Cabin in the Woods mocks the horror genre, but not the \"Scary Movie\" type of way, but in a smart, intelligent and frequently hilarious way. If you did not like the movie in general, you must have at least found the twist ending to be the most original in the past ten years!",
      "total_reactions": 0,
      "user": "HaithamB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "A Cabin in the Woods is a fresh take on a story that has been around for years. All it took was a bit more thought and they made with film into something special. This film could easily be another rip off of the Evil Dead or Friday the 13th but adding the decisive 3 party into the story that calls all the shots is original. This movie is a must watch for any modern horror movie fan.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2015
      },
      "score": 9,
      "text": "Summary: The Cabin in the Woods is refreshing, complex, wicked, and its final act is the dream of every horror fan. 94/100 [A-]",
      "total_reactions": 0,
      "user": "GuillermoBM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "Cuando creía que el Exorcista era el unico film de terror que valía la pena, estaba completamente equivocado, THE CABIN IN THE WOODS es divertida, violenta y novedosa, combina todas las bestias, todos los escenarios, todos los personajes y todas las situaciones de las mejores películas de terror de todos los tiempos, creando una maravilla en el cine de horror, es un homenaje al buen cine del terror.",
      "total_reactions": 0,
      "user": "JohnMasterL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "This movie was amazing. At first i was not sure if i was going to like it, but I fell in love with it. This movie is insane. I really hope that they create a continuation of it. At the end it looked like they might.",
      "total_reactions": 0,
      "user": "athorne"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2016
      },
      "score": 5,
      "text": "The cake is a lie.",
      "total_reactions": 0,
      "user": "Cinemaphile"
    }
  ]
}