{
  "mc_avg_user_score": 6.3,
  "mc_metascore": 37,
  "mc_mixed_rating_frequency": 26,
  "mc_movie_name": "The Frozen Ground",
  "mc_negative_rating_frequency": 6,
  "mc_positive_rating_frequency": 25,
  "mc_pro_critic_reviews": [
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 63,
      "summary": "Cusack and Cage — who don’t have any scenes together until halfway through — do their best work in years, while erstwhile “High School Musical’’ star Hudgens shows off acting chops missing in “Spring Breakers.’’"
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2013
      },
      "score": 63,
      "summary": "Cage, without having to play a ghostly motorcyclist or hot rod driver from Hell or sorcerer or sci-fi hero or kinky cop, reminds us that he used to know subtlety. So even if Frozen Ground breaks little new ground in the serial killer thriller genre, there’s hope Cage will leave the ham behind before Alaska freezes over."
    },
    {
      "critic": "Josh Winning",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "It’s handsomely lensed, and when Cage and Cusack finally go nose-to-nose, the fur does fly."
    },
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "With Cage as a harried cop, Cusack as a serial killer and 50 Cent as a pimp, we're assuming the casting department kicked off early on this one. Still, there's plenty in this taut thriller for you to stick around for, not least the reuniting of the Con Air duo."
    },
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "This is an unambitious, old-school thriller, nothing more and nothing less."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "Nicolas Cage, Vanessa Hudgens and John Cusack give solid performances in this Prime Suspect-like thriller."
    },
    {
      "critic": "Gabe Toro",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Ultimately, the cumulative effect is deadening, just another chapter in an endless battle between overtasked and underpaid good guys, and cowardly baddies; the only real humanity in the film comes from Hudgens’ Cindy, who seems like a wild card of sorts, her character’s dimensions suggesting a world outside of the lurid details of this case. Refreshingly, she’s the only one in the film who refuses to be defined by the death and tragedy surrounding her."
    },
    {
      "critic": "Dennis Harvey",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "[A] solid if unmemorable true-crime drama."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "Unfortunately, writer-director Scott Walker's film is a muddled and strangely inert one, generating little of the suspense or anguish its subject requires; despite its high-profile cast."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 30,
      "summary": "The movie’s only fresh element is the wintry setting, which shrouds everything in a mood of weary fatalism. Otherwise, it’s the same old, same old, efficiently discharged and utterly disposable."
    },
    {
      "critic": "Gary Goldstein",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 30,
      "summary": "Although writer-director Scott Walker seems committed to not overly exploiting his lurid subject matter, the movie is just too dreary, disjointed and generically creepy to be persuasive."
    },
    {
      "critic": "Rob Staeger",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 30,
      "summary": "The climactic interrogation wraps up neatly and just in time, much more like a story \"based on actual events\" than the events themselves."
    },
    {
      "critic": "Matthew Kassel",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 25,
      "summary": "A vague and forgettable crime thriller that would have benefited from more character development or at least a grounding of the narrative in one central protagonist."
    },
    {
      "critic": "Chuck Bowen",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 25,
      "summary": "Taste and good intentions are only going to get one so far with a script this tone deaf and direction this ugly and monotonous."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 20,
      "summary": "What’s more depressing: that John Cusack chose the junky, un-exciting serial killer drama The Frozen Ground as his latest step away from John Cusack-y roles, or that Nicolas Cage chose to, at long last, be as un-Cage-like as possible?"
    },
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 20,
      "summary": "Fans of Cage and Cusack, previously paired as unlikely allies in Con Air (1997), may be looking forward to a bit of deranged actorly combat once Hansen is cornered in the interrogation room, but it’s here that this hopeless flick comes up especially short."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "Excellent movie, very well directed.  I myself could not have picked a better cast of actors or actress to do the parts in this movie.  Would love to see Nicolas Cage and John Cusack do future movies.",
      "total_reactions": 2,
      "user": "Roxie1971"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "I find that the best thrillers come from films that are based on real life events. Some of these stories are just so twisted and crazy, that even the best writer wouldn't be able to imagine them on their own. The story told in the film The Frozen Ground, is one such story, telling the world about serial killer, Robert Hansen. From the 1970s until 1983, Hansen was one of the nations most prolific serial killers. What makes Hansen's story unique is that he was able to do all this, without the police even connecting the cases, because of where he lived. Hansen's story begins in Anchorage Alaska, where he began preying on prostitutes. After torturing and killing them, he would dump the bodies in remote, unpopulated areas of Alaska, where they were ravaged by the weather and wild animals. This made finding the cause of death or even identifying the victims nearly impossible. Hansen would probably still be active today, if it wasn't for Cindy Paulson, the only victim in 12 years, to escape the madman, and that's where our film begins. Nicholas Cage stars as Jack Halcombe, a state police detective who comes up with a wild theory that all these missing people and strange deaths, could be connected. Halcombe has a tough time convincing anyone of this, especially since his only witness is a drug abusing prostitute. Nicolas Cage excels in movies like this and is again terrific. Cage was born to play a cop and in my opinion does it better than anyone else out there. In this film, he's paired with Zac Efron's ex, Vanessa Hudgens, who wasn't great, but was much better than I expected. It's difficult to make the transition from Disney cover girl to a legitimate movie star, but I'd say that Hudgens is well on her way. Finally, John Cusack rounds out this all-star cast, playing Robert Hansen. After all the films I've seen Cusack in, I really couldn't imagine him as the bad guy, but his performance is what really helps this movie stand out, and hopefully will lead him to other similar roles. The Frozen Ground is a little slow, but it is supposedly very accurate, and tells an interesting story that most people know nothing about. It's the kind of film that I really go for and hopefully you will too.",
      "total_reactions": 1,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "I thoroughly enjoyed this movie i found the story captivating and the acting refreshing i would definatley recommend viewing.",
      "total_reactions": 1,
      "user": "CommGhost"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "I am not fan of both Cage and Cusack but in this movie they had great performances, not to say that the whole cast were great. I was surprised by other's low ratings, because I really enjoyed it.",
      "total_reactions": 1,
      "user": "sd-tennis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "this is one of the better \"true story\" movies I have seen. Very believable and very well acted. All parts were picked well for the characters. Mr. Cage in his finest role in my opinion. I don't remember these abductions/murders, but Im from CA. Excellent movie. Makes me want to contact the sgt and thank him.",
      "total_reactions": 1,
      "user": "calmandoes2"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "It's been so long since Nicolas Cage has starred in a straightforward thriller playing a realistic character that \"The Frozen Ground\" feels like a shock to the system  his, and ours. And Cage, without having to play a ghostly motorcyclist or hot rod driver from Hell or sorcerer or sci-fi hero or kinky cop, reminds us that he used to know subtlety. So even if \"Frozen Ground\" breaks little new ground in the serial-killer thriller genre, there's hope Cage will leave the ham behind before Alaska freezes over.",
      "total_reactions": 4,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "I have been waiting for this movie for 2 yrs.  Actually saw N Cage and others at hospital I was working while it was being filmed. All of Alaska knows of this terrible true story.",
      "total_reactions": 4,
      "user": "Alaskan121"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2013
      },
      "score": 2,
      "text": "There's really no excuse for this film being as bad as it is. Despite tons of on screen talent it's destroyed by poor story telling and paper thin characters. With this subject matter and being based in reality it should be a story that grabs and never lets go. Unfortunately someone feels that shaking the camera is all it takes to hold an audience. The script is wordy to the point of dull and the concept of pacing is non existent. All in all, just a truly poorly executed film. My biggest movie let down so far this year.",
      "total_reactions": 2,
      "user": "ScottMcKone"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2017
      },
      "score": 5,
      "text": "In the 21st century, John Cusack and Nicolas Cage do not purposefully make a good film. Instead, they accidentally stumble onto a set where people are making a good film. The Frozen Ground is not necessarily a good film, but it is an okay one. Telling the real story about the hunt for brutal serial killer Robert Hansen (Cusack), the film fits him against John Halcombe (Cage), the cop who tracked him down. A pretty straight forward police procedural movie, The Frozen Ground is a largely entertaining and compelling film that is just too cliche and lacking in mystery to be a truly good film.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "I can't understand why this film would get such bad reviews, some even put a zero rating meaning it was terrible. In my opinion it was a great movie based on a true story and between meta critic and rotten tomatoes I'll never base reviews on wether I watch a movie or not. Even the critics are so off and inconsistent.",
      "total_reactions": 0,
      "user": "Shane8537901"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "People who hate it, need to remember It`s a \"true story,\" so they can only work with what happened.The bad guy is on this one is twisted, and you can`t help, but to want him to be caught.This movie is pretty dark in every way. I think it`s worth watching, but nothing special.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "Nicolas Cage has been more risk than reward over recent years but I'd give him props in this movie. I think he gave a pretty solid performance. Serial killer movies have always been films I've enjoyed. Robert Hansen is one of the most deadly American killers and I really didn't know that much about him. John Cusack was a character that wouldn't expect to see playing Hansen. He improved more and more as the film went on. I was not a fan of Vanessa Hudgen's role, she was sort of in the wrong company and they could've gone with someone else. She had two much camera time for the first hour and that is one of the major reasons I gave this movie a seven. The last half of the movie when Nick Cage took was what saved it.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "The Frozen Ground isn't innovative, but it is a well-paced and engaging thriller that has the added appeal of a truth-based narrative.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2017
      },
      "score": 8,
      "text": "This is a great film based on real events surrounding a Serial Killer in Alaska.  Nicholas Cage and John Cusack do an admirable job portraying their characters, Alaska State Trooper Jack Halcolmbe and Serial Killer Robert Hanson, respectively.  However, it's Vanessa Hudgens portrayal of runaway and prostitute Cindy Poulson, the only survivor of Robert Hanson's killing spree, that steals the show.  Well worth a viewing.",
      "total_reactions": 0,
      "user": "S1r-R34l"
    }
  ]
}