{
  "mc_avg_user_score": 2.8,
  "mc_metascore": 27,
  "mc_mixed_rating_frequency": 15,
  "mc_movie_name": "The Spy Next Door",
  "mc_negative_rating_frequency": 52,
  "mc_positive_rating_frequency": 15,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2015
      },
      "score": 0,
      "text": "Easily his worst film he made in Hollywood.  I wonder if he just made this for a paycheck or to appeal to children but I'm pretty sure it's the former.  After all he did say he needed money to make Armour of God 3 and he's even admitted to hating most of his Hollywood movies.  So go figure.  No wonder this was so terrible.  Miley Cyrus' dad was in this, what more needs to be said?",
      "total_reactions": 12,
      "user": "DelatedBesire"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2012
      },
      "score": 5,
      "text": "I should be giving this film a 3/10 based purely on the fact that it's pants. But I find that adding Jackie Chan to a film (no matter of it's quality) makes it better. He seems to bring a certain amount of fun to what would otherwise be a very bad (rather boring) film. It's the worst film I've seen with Jackie Chan in it though. I should hate it but I can't!",
      "total_reactions": 11,
      "user": "Happymonk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2011
      },
      "score": 4,
      "text": "This is a horribly written movie with horrible acting and a horrible plot. The bad guy is hard to understand his motive confusing and so are the good guy. The plot *cough*almost*cough* twist are poorly set up and amount to very little. The whole movie is illogical and unreasonable and throwing in a few *cough*almost*cough* stars didn't help.",
      "total_reactions": 7,
      "user": "Creviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2012
      },
      "score": 4,
      "text": "WHY JACKIE DID YOU HAVE TO TAKE THIS **** ROLE AND RUIN YOUR REPUTATION. this movie was garbage, so many forced comedy lines and stupid useless characters",
      "total_reactions": 7,
      "user": "LordOFlibertY"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "\"Can your mommy do that?\" - Bob Ho",
      "total_reactions": 7,
      "user": "Marica"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2014
      },
      "score": 4,
      "text": "Jackie Chan, in truth, has no real acting talents. And this shows his constant repetition in action comedy movies with enough emotion to make you reel over the edge of your seat and gag, but make sure to do this only if you are on the last seat of the aisle. Otherwise, try to hold it down.",
      "total_reactions": 7,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 0,
      "text": "wow..i never know that a movie can be so torturing.watching this was like getting my tooth pulled out..the storyline is so predictable.even my 10 year old sister can predict what happens next.",
      "total_reactions": 6,
      "user": "k-C"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2012
      },
      "score": 0,
      "text": "A cheap rip off  version of The Pacificier( Vin Diesel) not worth the time. I believe this was a way to say goodbye to the career of a figure like Jackie Chan",
      "total_reactions": 6,
      "user": "Wolfland09"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2013
      },
      "score": 1,
      "text": "Sucked!!! No better way to put it. It's so sad that they would even make this movie. I feel bad for anyone that was a apart of this movie. Should have never been made.",
      "total_reactions": 5,
      "user": "Lansdenrs"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2011
      },
      "score": 3,
      "text": "This is it. Jackie Chan ain't no star anymore. \"The Spy Next Door\" says it all.",
      "total_reactions": 9,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2014
      },
      "score": 3,
      "text": "The Spy Next Door is nothing more than a forgettable, poorly-written movie that wastes its talent. Jackie Chan might as well be Danny Glover in \"Lethal Weapon\", because he's \"too old for this s**t\".",
      "total_reactions": 9,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2010
      },
      "score": 0,
      "text": "What were they thinking putting Jackie Chan in a horrible movie,to be as a spy and protecting those annoying children like this? It's like raping the master of kung-fu for putting as a spy and making fun of him with lousing slapsticks. The scenes are too cheap for the visual effects and a waste of the script,the characters are annoying,too many plot points,the jokes are not that funny,and very insulting for putting Jackie Chan in it. Come on people,it's Jackie Chan,the greatest martial arts master who fights and leaps on the poles,and making him downsize for his acting and hurting him so purpose. Even why George Lopez plays as a villain for taking over the world? He really needs to fire his agent! And why they put a teenager girl who finds this older boy so attractive and the older boy fights Jackie Chan? I don't why they make this movie so bad and please the fans will probably like it,but come one what bad movie for putting Jackie Chan on it and it's not entertaining family film for the kids!",
      "total_reactions": 8,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "It wasn't his greatest film of all time. But its comedy, its not meant to be taken seriously. I thought it was pretty funny. Had some goofy plot points and there was enough action to keep me captivated. Reminds me of Dragons Forever and Wheels on meals kind of comedy.",
      "total_reactions": 5,
      "user": "LordKnightmare"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2017
      },
      "score": 6,
      "text": "Уж лучше большинства комедий по шаблону.",
      "total_reactions": 0,
      "user": "russiangamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2016
      },
      "score": 0,
      "text": "The fact that the positive reviews here spend more time shaming the critics than saying what's good about the movie shows what a great fan-base this movie has. But why don't they spend that time praising the movie's good points? BECAUSE THERE AREN'T ANY!!! So what's wrong with this movie? Well Billy Ray Cyrus is in it.......I could end the review just with that. There are way more problems than that though. Bland and obvious story, jokes that could be seen from miles away and appealing to it's key demographic so desperately it makes the Oogieloves look subtle. If you value your brain cells, make like a spy and stealthily, quickly get the hell away from this movie!",
      "total_reactions": 0,
      "user": "TheLonelyCritic"
    }
  ]
}