{
  "mc_avg_user_score": 4.8,
  "mc_metascore": 26,
  "mc_mixed_rating_frequency": 1,
  "mc_movie_name": "The Reunion",
  "mc_negative_rating_frequency": 2,
  "mc_positive_rating_frequency": 3,
  "mc_pro_critic_reviews": [
    {
      "critic": "David DeWitt",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 70,
      "summary": "The Reunion has no pretensions of originality, and maybe that's just fine. It's relaxing to watch formula roll in front of you if that formula is engaged with affection, and that's the case here, much to the credit of the writer and director, Mike Pavone."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Cena handles rough stuff like a pro, and his poker-faced wisecracking isn't bad. But he probably shouldn't quit his day job."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2011
      },
      "score": 40,
      "summary": "A lame action-comedy that seems ready made for undiscerning late-night cable viewing."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2011
      },
      "score": 40,
      "summary": "The \"Midnight Run\" meets \"Bonanza\" idea isn't exactly a terrible one, but writer-director Mike Pavone has only one point-and-shoot gear, whether the scene is light comedy, dysfunctional family drama or western-tinged gunplay. (Even television shows these days exhibit more directorial flair and editing variety.)"
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2011
      },
      "score": 30,
      "summary": "The resultant smorgasbord is a misshapen mess, short on humor, tension, or chemistry among its bickering protagonists."
    },
    {
      "critic": "Kalvin Henely",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2011
      },
      "score": 25,
      "summary": "Importing WWE's brand of hokey fighting--the most memorable scene, during which Cena jumps from a ledge onto a helicoper, recalls in-the-ring rope-jumping than anything else--into a place where there is an alarming amount of real bloodshed seems unnecessary and somewhat imperious."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2011
      },
      "score": 25,
      "summary": "Mainly for those who are already infatuated with Cena's stoic, Mount Rushmore-esque countenance and who do not find the idea of the big lug leaping off the edge of a cliff onto an airborne helicopter's landing gear remotely absurd."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 25,
      "summary": "The action is wan, the laughs hard to come by."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2011
      },
      "score": 20,
      "summary": "The only real reason to see this movie is to show unwavering loyalty to Cena. And even so, he'll never know if you wait to watch it on cable for free."
    },
    {
      "critic": "Sam Adams",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2011
      },
      "score": 20,
      "summary": "Wrestler turned actor (so to speak) Cena is built like a cinder block and has range to match; Embry compensates by capering like a blaxploitation pimp."
    },
    {
      "critic": "Ronnie Scheib",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "summary": "A flabby, unfunny action-comedy produced, directed and written by former WWE exec VP Mike Pavone, The Reunion boasts one of the most poorly assembled scripts to emerge from the wrestling franchise."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "I think it was a pretty good movie. John Cena is a much better actor that some of the other wrestlers that have tried! Compared to others I have seen lately, it has a little of everything in it, action, humor, and a story line.",
      "total_reactions": 1,
      "user": "Tina"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2012
      },
      "score": 7,
      "text": "A decent movie with good acting. Defently aims at alot of groups. Humor, action etc. My only problem with the movie was the lady firing the shotgun from a long distance, twice in the movie, and killing someone. We all know, or atleast most of us, that shotguns are meant up close and only work that way. Unless it was pure luck shots, which it must have been, that was the only really bad thing in the movie. It had a nice ending, with moral in it. Some movies end without moral and sad, twisted endings. This isn't one of them, so well done on that one. Cena was surprisingly good as an actor, I wouldn't mind seeing him act in more films in the future.",
      "total_reactions": 0,
      "user": "Petrovita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2017
      },
      "score": 7,
      "text": "It was just your average WWE movie. Cliché, predictable, filled with plot holes and uneven acting performances. But, it was pretty entertaining, Ethan Embry was excellent and it was fun to watch. If you like WWE movies, you should appreciate this one.",
      "total_reactions": 0,
      "user": "Meth-dude"
    }
  ]
}