{
  "mc_avg_user_score": 6.4,
  "mc_metascore": 43,
  "mc_mixed_rating_frequency": 44,
  "mc_movie_name": "The Vow",
  "mc_negative_rating_frequency": 20,
  "mc_positive_rating_frequency": 64,
  "mc_pro_critic_reviews": [
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2012
      },
      "score": 75,
      "summary": "The Vow is not exactly a woman's picture. It's more about how a man falls in love, loses his love and gives up everything in life to focus on regaining his love. Maybe it's a woman's picture from a male point of view. However you slice it, it's a welcome loaf-far from perfect, but as filling as a home-cooked meal."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 75,
      "summary": "These two stars bring believable chemistry and emotion to a film that might otherwise wilt under the weight of so much melodrama."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 65,
      "summary": "Doesn't turn out to be as gauzily sentimental as its beginning (or its marketing materials) suggests."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 63,
      "summary": "It's pleasant enough as a date movie, but that's all."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 63,
      "summary": "It's quite watchable date-night cheese - the kind of movie you can simultaneously snort at and enjoy."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 63,
      "summary": "Ready-made for Valentine's Day, The Vow is, like the offerings at Cafe Mnemonic, a total sugar overload."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 63,
      "summary": "The Vow is agreeable enough. It may be puddin'-headed but it's not soul-crushing."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2012
      },
      "score": 60,
      "summary": "The Vow represents that most welcome kind of Valentine's Day offering, focusing on the feelings that bring couples closer."
    },
    {
      "critic": "Helen O'Hara",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2012
      },
      "score": 60,
      "summary": "The few weaknesses in the plot can be overlooked as The Vow makes for a wonderful - if a bit teary - romance that is brilliantly acted."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "The good news is, The Vow is not excruciating."
    },
    {
      "critic": "Jennie Punter",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "While The Vow will give heart palpitations to fans of its charming co-stars Rachel McAdams and Channing Tatum, this amnesia-themed romance is the kind of featherweight fare that is enjoyed in the moment and forgotten soon after the end credits roll."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "It's unashamedly escapist, but a turn for the serious as The Vow nears the finish line only underscores its essential silliness and what a poor job the film has done making it seem like its characters need each other for reasons beyond looking good together."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "It may appeal to the most rabid fans of tearjerk romances like \"The Notebook,\" but it's a hard-to-swallow, maudlin tale."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "The romantic drama The Vow looks like the kind of annual Valentine's Day staple that arrives just as calls start flooding flower shops and chocolate bonbon displays invade your local CVS."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "Very fortunately, there's an alternate universe swirling in the eye of The Vow's synthetic storm, a place occupied only by Tatum and McAdams, where the link between them cuts down the filmmakers' bad instincts."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "Such heart-tuggers have their appeal to some people in any era, but earnest hokum of this nature has become increasingly rare. And for a reason."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2012
      },
      "score": 40,
      "summary": "Perhaps Sucsy was overwhelmed by his immersion in such colorful and outré material; he's chosen for his followup, the I Can't Believe It's Not Nicholas Sparks weepie The Vow, the cinematic equivalent of a lie-down."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2012
      },
      "score": 40,
      "summary": "This sugary sweet chick flick is so rich in its ripeness and full in its foolishness that I look forward to groaning in happy horror when I inevitably see it again, whether while drinking or when laid low by the kind of flu whose symptoms include a desire to watch Meg Ryan rom coms on cable."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2012
      },
      "score": 40,
      "summary": "Credit the appealingly paired McAdams and Tatum for making this Valentine's-month hokum watchable."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 40,
      "summary": "This is a movie that leaves you wanting more. To care more, to cry more, to love more."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 40,
      "summary": "When they are on the screen together here, there is enough physical charm and emotional warmth to distract from the threadbare setting and the paper-thin plot. But those defects ultimately get in the way of the stars and leave you wondering: Is this a romance about neurological impairment or a neurologically impaired romance?"
    },
    {
      "critic": "James Rocchi",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 40,
      "summary": "The Vow proves that love can't conquer bad writing."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 40,
      "summary": "As the world's most chipper recovering coma patient, McAdams is a beautiful blank. There's not a single moment when her character feels real, or as if she genuinely has anything at stake. So it's a good thing Tatum steps up to add a little depth to this unabashedly lightweight venture."
    },
    {
      "critic": "Ben Sachs",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 40,
      "summary": "Most of the time it plays like the movie adaptation of a Land's End catalogue, making monogamy seem essential by associating it with high-end interior design."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 38,
      "summary": "The Vow is a sopping hankie of a romance for women who love to suffer and the men who love them."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 38,
      "summary": "The only reason any male could have for seeing The Vow is the hope of getting laid afterwards. The only reason any female could have for seeing The Vow is if she views the plots of Harlequin romance novels as the height of modern storytelling."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 25,
      "summary": "It's a tragedy, really: According to the hapless team who made the movie, Our Paige is a relatively interesting young liberal who knows her own mind before the accident and a rather tedious, girlish conservative who fusses about keeping her hair smooth afterwards."
    },
    {
      "critic": "Louis B. Parks",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 25,
      "summary": "Even viewers who are an easy touch for romance movies will find this heavy-handed."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2012
      },
      "score": 1,
      "text": "I realize that this was based on a true story, but that still does not excuse what can only be described as some of the worst romantic writing this century. There is some merit to staying true to the actual story and I understand the desire to respect events and pay homage to the strength of character that the true people on which this film is based upon possess, but at the end of the day this is still a motion picture created for the purpose of entertainment and on that basis it fails miserably. The only date I would bring to this film would be one that I wanted to end things with, it's just that bad. There are more gaps in the story then in the female character's memory and it's more of a dual biography than an emotional tale that inspires some semblance of feeling.",
      "total_reactions": 3,
      "user": "zendoa"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 3,
      "text": "Saccharine dross with an unbelievable fantasy plotline.  The wooden acting of Tatum Channing with his relentless monotone and his inability to convey any convincing emotion makes one anxious for the end credits.  The pain is certainly dulled and brought into sharp contrast by the competent performance by Rachel Mcadams - who seemed to be ill at ease with the occasionally awkward dialogue.",
      "total_reactions": 2,
      "user": "cinemafan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "This isn't really a chick flick at all because it's mostly from the guys perspective. When you watch this movie just put yourself in Channing Tatum's shoes and think of how frustrating that situation must have been. I know that the \"true\" story was exaggerated a ton but hey, that's hollywood. Not at all what I expected, a very pleasant surprise, and I'm a guy.",
      "total_reactions": 1,
      "user": "TTW107"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2012
      },
      "score": 3,
      "text": "This movie has a good story line, but the way it was told and portrayed in the movie was really bad. It didn't attract me even one bit and I literally had to force myself to finish the movie & get touched by it. The acting & script was a little bad too. I admire Channing Tatum & Rachel Mcadams(especially) but their performances here were weak! It was not believable enough. This movie could have been a combination of happy, sad, tragic, & funny but unfortunately, the movie didn't quite sum up to all that. I must say, a very boring movie. But I like how it is based on a true story, which is why it should be told classically.",
      "total_reactions": 3,
      "user": "jzme"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 1,
      "text": "Really?? There was no need to undress Channing Tatum every scene. It is impossible for this fact-based, with a movie so unreal. There was no chemistry between the lead actors.",
      "total_reactions": 3,
      "user": "migueldiazg"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "It's a fun date movie, that's all. Sometimes it captures your emotions, sometimes it fails. Overall, it's a good sappy romantic movie for a cold night",
      "total_reactions": 4,
      "user": "ReviewCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "Tatum and McAdams are charming and fun to watch, but there's so little substance here, despite so much opportunity.  There were probably 5 instances - potential plot twists - throughout the film in which I thought, \"Yes, this is going to get good\" - but the writers just smoothed them over.  It needs more spice and excitement. Even for a Valentine's Day Rom-Com, its milquetoast.",
      "total_reactions": 2,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2012
      },
      "score": 3,
      "text": "Unfortunately Tatum, albeit attractive to many, is no talented actor and does not have the depth required to make this film memorable.  Even worse, McAdams is not a particularly convincing actress either and unfortunately turns an interesting real life story into a wish-I-had-watched-\"Notebook\"-again-instead.",
      "total_reactions": 2,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 2,
      "text": "Obviously, as a normal guy, this movie really sucked. The whole concept was corny from the get go and I pretty much knew going in that, but still, it didn't turn out so good. Went to this movie on a date and she liked it so I guess that's all that matters. I wouldn't recommend this movie unless your girlfriend really wants to see it with you.",
      "total_reactions": 2,
      "user": "BigFatFatty"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2012
      },
      "score": 2,
      "text": "A movie made for people who don't really understand relationships. It's essentially a fantasy for those women who never got past the \"ME\" stage.",
      "total_reactions": 2,
      "user": "Krantos"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "Love it, a beautiful story an great acting, Channing tatum has become a good actor. Rachael Mcadams is perfect for this movie. One of the best Valentine Day Movie. This movie made people the the movie theater laugh and cry. Guys take your women to see this movie. Channing Tatum's character (Leo) is trying too woo back the of his life after a car accident take took the memory of his new wife Rachel Mcadams (Paige). She lost the last five year of memory, before she met Leo and when she was egaged too another men, so she now don't know Leo. The movie is told from the perspection of Leo, who now have to deal with her estange family and ex boyfriend.",
      "total_reactions": 8,
      "user": "luprki"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "Rachel McAdams and Channing Tatum have great chemistry and give gripping performances. Yet the humor is hit and miss, it takes itself too seriously at times. But I really enjoyed it even though I shouldn't have. I give this movie 60%.",
      "total_reactions": 3,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2012
      },
      "score": 2,
      "text": "I really thought this movie was just a same old romance movie. It really did not make since whatsoever, and it makes me really confused with \"Dear John\", which was just as bad.",
      "total_reactions": 3,
      "user": "lilmonster33"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "totally loved it!",
      "total_reactions": 3,
      "user": "mannuke"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "I love this film! I cried the whole way through it. The acting is beautiful and I think the actors used were phenomenal. The film does a great job of making you fall in love with the main character (Leo), so that you can almost feel his love for Paige. I love everything about this movie and I can't wait to buy it on DVD.",
      "total_reactions": 1,
      "user": "hollyvictoria19"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "Angels:  I did not see the Notebook, but I have seen lots of romantic comedies ('cos of my sweetheart) and this is a good one. It has the feel of a documentary: no silly plot devices, no wild plot twists, no unbelievably strange or hateful characters.  Even Paige's (Rachel McAdams) father turns out not to be the skunk that I kind of expected him to be. This was a well-made, simply told movie.  Channing Tatum impressed me.  I have seen him as a dancer, as a roman legionnaire, and now as a romantic lead, and Angels, that boy does it all! And I'm telling you, if I could wear a hat like he does - in the movie- and smile mischievously-like he does in the movie-my sweetheart would never leave me. He is a boy, and I like girls, but he is tasty! And Rachel is very sweet.  Angels, they both act beautifully. Honestly, their body language and facial expressions were spot on. They were not acting; this is what was actually happening to them. My honey and I had a good time!  So why only an 8?  Well, the main weakness I think is that the plot did not match the title.  My honey made this point, I disagreed with her, but,  on reflection, she is right. The film is called 'The VOW'. A VOW is a declaration of super commitment-'To make this happen, I will move heaven and earth, and I will never give up.'  But Angels he didn't move heaven and earth. He gave up.  Look, he acted perfectly reasonably.  He was up against a lot of difficulties. Realistically, things looked hopeless. But he had made a VOW, and he did not keep it....",
      "total_reactions": 1,
      "user": "sesostris"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "I honestly expected more out of this movie. It was good, but not great as I expected it to be. Channing Tatum and Rachel McAdams both played their parts beautifully, but I kept feeling as though something else would happen along the storyline, but not much did. It was a story of a newly married couple that get into a car crash, and Paige (McAdams) loses her memory of the last 5 years of her life, which was the whole amount of time she'd known her husband. Her husband being a stranger to her, the premise was that he had to make her fall in love with him all over again. Throughout the movie though, not much else happened. I also expected it to be sadder than it was.",
      "total_reactions": 1,
      "user": "ashley_"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "This was a wonderful and inspiring movie of man's perseverance in fighting for what makes life worth living. Slightly predictable, just like most love stories, but overall a great performance by two wonderful actors. This is what it's all about.",
      "total_reactions": 2,
      "user": "longbowtech"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "The Vow is a enjoyable half hearted story that take full advantage of the cast, while providing us with a standard Romance movie. Channing Tatum is the driving force in this movie, the surprising good plot twist will leave you intrigued enough to conquer the movie. All in all i would recommended a try.",
      "total_reactions": 1,
      "user": "busbfran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2012
      },
      "score": 6,
      "text": "The whole movie was great all the way up to the end... It was so close to being a great film, then is just fell short. Was disappointing. Similar ending feeling to The Break Up.",
      "total_reactions": 0,
      "user": "fryzee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "I was obviously dragged into this movie because of my girlfriends choice, and i didn't care to see this film at all. I knew and everybody else knows what your getting into when you see this movie. The thing is, i actually enjoyed it. It was cheesy, it was sappy, but it was enjoyable. I know im sounding cheesy myself when i say this but it really made my heart hurt when i saw each other their strrugles through the tragedy and the pain of the loss of her memory, and of course, the ending is predictable yet not exactly the way you think it would end. You might love this movie, or you might hate it. Its hard to tell, but i know that i enjoyed myself and im a 19 year old guy. 6.5/10",
      "total_reactions": 0,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2013
      },
      "score": 3,
      "text": "The film has a good photography, but for the rest a bad acting and an inconsistent plot. The Vow is a based on a true story, of course, but a boring and corny movie.",
      "total_reactions": 0,
      "user": "rydermusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "This movie was essentially like a mediocre version of a Nicholas Sparks movie. The acting was great but the execution just wasn't there. Rachel McAdams' character seemed pretty stupid and, given that it's a true story, it just makes it seem even more dumb. There have got to be 1000 such stories with \"smarter\" people involved or better endings. The fact that this movie was based on one with a moronic character and a mediocre ending shows just how masochist viewers are. The movie is slow, not emotional enough given the subject matter, and just in general not all that good. The only emotional part of the movie was the scene with Paige interacting with her mom near the end of the movie. The movie wasn't terrible but it definitely doesn't reach the elite chick-flick level.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2012
      },
      "score": 4,
      "text": "Disappointing.  Definitely not of the Notebook caliber. The chemistry between Channing and Rachel just wasn't there.  A step above a Lifetime movie at best.",
      "total_reactions": 0,
      "user": "Coco83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "The Vow is a sweet film that reminds us of how one falls in love and how one actually can pursue and hold onto love when it appears lost forever.  It was an inspirational film, touching and cute.  However, it was lacking a strong core, a center to define pure love which is ever present in the real life couple's story that this movie was based on.  We do catch a glimpse of this in another couple's relationship in the movie, which only has survived against all odds.  However, the biggest upset of this film is that it doesn't even hold true to it's title.  If it had, it would have been a breath of fresh air in comparison to all the typical Hollywood adaptations of juvenile fantasy that is sold under the name \"romance\"; those culminations of high school daydreams that are ever predictable and unrealistic.  Don't get me wrong.  The Vow was okay, but it could have been ten times better if Hollywood hadn't dumbed it down to make it 'Hollywood' correct.  Sometimes the center of a story, however controversial it may be, just can't be replaced, especially by adequate actors and good cinematography.",
      "total_reactions": 0,
      "user": "Sa5ha"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2012
      },
      "score": 6,
      "text": "I enjoyed this movie, however I am partial to both Channing Tatum and Rachael Mcadams, I adore both of them as actors. Not as great as all of the hype and expectations that I was holding it too, but I still think its a great rental. Unfortunately, I think a lot of people automatically link The Notebook to Rachael Mcadams, and in my opinion, no love story will ever come close to that movie, so that could be held accountable for some of the disappoint for me personally. I still recommend, its definitely an easy, fun watch.",
      "total_reactions": 0,
      "user": "KaylaW"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2012
      },
      "score": 6,
      "text": "Ok, I went with a group of mostly women and the movie was good, not great, predictable, heart wrenching and worked your emotions, but lacking some punch.  I liked that it didn't rely on bad language, drugs, drinking or sex to get you to see it.  The acting was just good enough to make it convincing, but it wasn't a even a \"two tissue\" movie.  The ending left you wanting more.  Overall, wait for the DVD and watch it with your girlfriend.",
      "total_reactions": 0,
      "user": "NotPC"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "The Vow had a good plot going, but the middle was horrible. The ending sucked. They just left you hanging. I wish it was directed differently. The previews looked better than the actual movie. I would only pay to see this movie if there is absolutely nothing else that interests you to see.",
      "total_reactions": 0,
      "user": "Katie466"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "With worldwide box office takings of $196M (IMDB), it's safe to say that plenty of people chose to see The Vow. Romance films sell, and let's face it, women love Channing Tattum. I can't say that I have seen many true 'roms', most romantic films I watch have the obligatory 'com' attached. The Vow's script has some light-hearted moments, however it definitely can't be classed as a 'rom-com'.",
      "total_reactions": 0,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "With so many romantic movies being produced, itâ",
      "total_reactions": 0,
      "user": "BabuMoshaaye"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2012
      },
      "score": 4,
      "text": "The Vow is basically hokey date-night romance incarnate. It's fluff. It isn't really good for you, you know it, but you have no regret having ingested it. Like cotton candy. It's odd that in a genre that requires depth and honesty to earn its audience, these kind of romances almost always come off as manufactured. Interestingly enough, it is Tatum here who gives the better performance. In fact, he's really improved in recent. It's McAdams who comes off as too cheery and slight for having her whole world tripped up. And happily, there are some laughably bad moments to enjoy for all the fuzz. It's all fairly harmless escapism, but don't get sucked up in the film's idea of romance. In other words, don't just eat cotton candy. In fact, stay away from it. It isn't good for you.",
      "total_reactions": 0,
      "user": "TheDRauch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "I thought it was a good movie, and think it`s pretty crazy that this actually happened. I don`t think it`s like every other movie like some people have said, but I have not watched much Romance movies lately. I thought the chemistry between the two was really good.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Most underrated romance movie. Great story, great acting, great realism. At the end, it leaves you feeling satisfied. Radiohead reference also made it gain some points. Great movie.",
      "total_reactions": 0,
      "user": "nirishan9"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2015
      },
      "score": 1,
      "text": "The movie feels like a Nicholas Sparks'  romantic cheesy grand opera full of cliche's. It's weird that this is based off of true events, and i am pissed off that the  ending didn't go so well. The movie is about Paige (Rachel Mcadams) and Leo (Channing Tatum) get into a car accident, then Paige has a coma, then when she wakes up  she doesn't  remember anything and Leo has to fix it. The narration is cheesy the romance is not enough to please the audience. Grade C-",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2015
      },
      "score": 10,
      "text": "The Vow really does merit its title. Throughout the film, Channing Tatum's character stayed true to his vows, and that made the story very unique and touching.  Rachel McAdams' character was also true to her vows, even overcoming tons of obstacles to do so.  Together, they make a cute couple and this was really fun to see. One of the few romantic dramas which did not induce tears, as the ending is happy and satisfying!",
      "total_reactions": 0,
      "user": "kat267"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "Like a less successful version of The Notebook, this works as an undemanding date movie; just don't expect much more from it.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "Sweet movie..The mind may forget but the heart always remember one true love.",
      "total_reactions": 0,
      "user": "jelenabiebs31"
    }
  ]
}