{
  "mc_avg_user_score": 8.6,
  "mc_metascore": 60,
  "mc_mixed_rating_frequency": 22,
  "mc_movie_name": "The Iceman",
  "mc_negative_rating_frequency": 1,
  "mc_positive_rating_frequency": 121,
  "mc_pro_critic_reviews": [
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2013
      },
      "score": 90,
      "summary": "If the narrow biographical focus of “The Iceman” prevents it from being a great crime movie, on its own more modest terms it is an indelible film that clinches Mr. Shannon’s status as a major screen actor."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2013
      },
      "score": 88,
      "summary": "The dialogue is hard-bitten and Mamet-sharp."
    },
    {
      "critic": "James Mottram",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2013
      },
      "score": 80,
      "summary": "Kneel before shannon. His primal, powerhouse turn drives this criminal biopic. the film won’t win any prizes for originality, but its star proves he’s a real man of steel."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 80,
      "summary": "The film is anchored by a searing, incredibly intense performance by Michael Shannon, whose remorselessness as a hit man is as relentless as Shannon’s portrayal of him."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2013
      },
      "score": 80,
      "summary": "As Richard Kuklinski, the Garden State guy who sleepwalks into an infamously deadly life he was born for, Shannon hits a whole other level."
    },
    {
      "critic": "David Rooney",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2013
      },
      "score": 80,
      "summary": "The Iceman is a vivid evocation of a remorseless sociopath sustaining a double life as a contract killer and devoted family man. Gritty, gripping and unrelentingly intense, Ariel Vromen’s film boasts richly detailed character work from an ideal cast."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2013
      },
      "score": 75,
      "summary": "Because the sociopath at the center of this family portrait never asks for forgiveness, The Iceman is truly chilling."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 75,
      "summary": "So it's a bit squishy at the center. But the film is sleek, purposeful and extremely well acted."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2013
      },
      "score": 75,
      "summary": "It's an unsettling piece that reminds us how even monsters aspire to living the American dream."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2013
      },
      "score": 75,
      "summary": "Shannon's restrained and mesmerizing portrayal, bolstered by an excellent offbeat supporting cast, makes for an edgy and compelling Mob yarn."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2013
      },
      "score": 75,
      "summary": "The point of The Iceman is “Even monsters are human,” but it takes a great actor to make a dubious theme convincing."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2013
      },
      "score": 70,
      "summary": "This Mafia tale doesn’t aspire to the heights of a \"Godfather\" or the epic sprawl of \"The Sopranos.\" Vromen and cowriter Morgan Land are content to bring subtle shadings to the tale of a strange man in a dirty business."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2013
      },
      "score": 67,
      "summary": "Ultimately, this is a grim (both visually and thematically) character study of an unsympathetic character, leaving Shannon, who manages to deliver another impressive performance, twisting in the ice-cold wind."
    },
    {
      "critic": "Guy Lodge",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2013
      },
      "score": 60,
      "summary": "This solemn, blood-soaked thriller lacks the dynamism of its star, but is an impressive showcase for him nonetheless: it’s as hard to look away from Shannon’s performance as it is to look directly at it."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2013
      },
      "score": 60,
      "summary": "The problem might actually be (gasp) Michael Shannon himself — shocking, because he’s one of our greatest actors — who is only half-right for this film’s portrait of Kuklinski."
    },
    {
      "critic": "Rebecca Moss",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2013
      },
      "score": 60,
      "summary": "Ultimately The Iceman is a blend of Mafia-film cliché and the jarring reality of lives undone by crime."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2013
      },
      "score": 60,
      "summary": "As a demonstration of the banality of evil, The Iceman is certainly effective and Shannon's performance gives the film its power."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2013
      },
      "score": 58,
      "summary": "Alternating scenes of the psycho-as-family-man with an increasingly grisly and desperate series of hits, it makes for a surprisingly monotonous sit for a movie that also features a killer named Mr. Freezy."
    },
    {
      "critic": "Adam Nayman",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "Michael Shannon is an overpowering actor, and in The Iceman, the best that he can do is wrestle the movie around him to a stalemate."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "Director/co-writer Ariel Vromen has made a grimly passable crime drama in the sub-“GoodFellas”/“Sopranos” vein, and if you’re looking for something to order up on a slow Saturday night, it’ll do."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "The overall effect tends to be as chilly and monotonous as Shannon’s demeanor as Kuklinski — a real disappointment."
    },
    {
      "critic": "Oliver Lyttelton",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2013
      },
      "score": 50,
      "summary": "It’s never a painful watch, more of a faintly dull, seen-it-all-before one. If nothing else, it’s evidence that these days, being based on a true story isn’t enough to elevate a film in a well-worn genre ahead of the pack."
    },
    {
      "critic": "Laremy Legel",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2013
      },
      "score": 45,
      "summary": "Discordance, meet The Iceman, a film so wrong-footed it should take Eugene Levy out for a coffee."
    },
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 40,
      "summary": "There are cameos from James Franco, Stephen Dorff, a comically moustachioed David Schwimmer and an unrecognisably hirsute Chris Evans as various lowlifes. A pity, then, that nothing else in Ariel Vromen’s movie is remotely on Shannon’s level, from the plodding, Scorsese-clone script to the needlessly lifeless editing and cinematography."
    },
    {
      "critic": "Louis Black",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "There is an enormous amount of effort put into this film which at its end just seems like noise, wind, and dust."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "The great failing of The Iceman is not in giving us a monster, but in not making us care."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2013
      },
      "score": 40,
      "summary": "There’s a ruthlessly effective movie to be made from this material, and you couldn’t hope for a better performer than Shannon, who can turn on a dime between quiet malevolence and volcanic rage, to inhabit the sociopathic central figure. Unfortunately, this overproduced biopic constantly counteracts the actor’s committed efforts with its pale-imitation slickness."
    },
    {
      "critic": "Tomas Hachard",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2013
      },
      "score": 38,
      "summary": "Michael Shannon has no interior to play with, since the film seems intent on ridding Richie of any emotion other than love for his family, and also no catharsis to build toward."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "There was a subtle development of a character I couldn't imagine possible with a figure like Richard Kuklinski.  the performances were uniformally excellent.  The writing and directing were especially strong.  Kudos to Michael Shannon...if he's not nominated for an oscar, there's no justice.",
      "total_reactions": 1,
      "user": "cammyland"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "Its essentially The Iceman Tapes - The Movie. But its well done and this michael shannon bloke is well cast. Be sure to search kuklinksy on youtube after you've watched",
      "total_reactions": 1,
      "user": "theeDarkhorse"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "WOW!  I really liked this film (that's why I gave it a 10 out of 10!).  The gritty story is interesting as can be thanks to the outrageous true story of Richard Kuklinski, the famed contract killer, but the real heart of the film is the amazing performances from the entire cast.  While it's awesome to see David Schwimmer do a role he's never done before (and do it well), Ray Liotta play the same character he always plays (but do it well) and see Chris Evans--Captain America himself--play a killer in an ice cream truck, the best part is watching Michael Shannon once again prove that he is one of the best actors of this generation.  He's no stranger to intensity but the level he brought to this film is enough to warrant my score!",
      "total_reactions": 5,
      "user": "RevRon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 4,
      "text": "Beyond a disappointment.  Shannon is a major talent, but he had a very flawed script to work with. There is zero empathy for the lead character. You could care less if he cares about his family, he's such a ridiculous psychopath and not clever enough to be interesting.. And the script, it sets up Ray Liotta's character as the antagonist and the narrative makes you want a climax between him and shannon, but you never get it, instead you get melodrama asking us to try and feel sorry for a psychopath who killed over a hundred people.... Skip it.",
      "total_reactions": 1,
      "user": "Matteo"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2013
      },
      "score": 2,
      "text": "So UPSET!! I have been dying for this movie to finally come out after I read the book some years ago. this movie was such a let down. left so much out and the stuff that was in was not even true or close to it. terribly disappointed. nothing like the book at all! will never understand why directors change from the book so much! decarlo should be turning in his grave for this disservice to him! I really wish that I did not see this movie at all! they even tried to make you feel sorry for the \"Pollock!\" I mean he was never sorry for anything he did, hence the name ICEMAN! grant it, maybe not everything that was in the book was true, but damn if they only followed half of the book it would have been a great movie! this movie seemed rushed, they skipped over so much and left out even more! if you read the book and you enjoyed the book, DO NOT go and see this movie then!!! you will be so disappointed as I am! what a crying shame!",
      "total_reactions": 3,
      "user": "tsmith2744"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "Between 1964 and 1986, Richard Kuklinski killed as many as 250 people for the mafia. His cold, callous style and willingness to do anything, earned him the nickname, The Iceman. In 1992, The Iceman granted HBO an exclusive interview, where he talked about his life and described his crimes, the way someone would describe their job. This film is the dramatization of Kuklinski's story, based entirely on what he said during his interview. Boardwalk Empire's Michael Shannon stars as Kuklinski and was absolutely the perfect choice to play him. Some actors, even ones like Shannon,  seem to be destine to play certain characters, it's how they make a name for themselves. Shannon is often knocked for being too cold and emotionless in his other roles, so he was essentially the perfect choice to play the Iceman. Shannon is paired with Winona Ryder and all these years later, she still manages to annoy the hell out of me. I really don't get what people see in her. The cast of this film is rounded out by some terrific cameos, by the likes of Ray Liotta, James Franco, and David Schwimmer, all of whom are terrific and add to the mystique of this film. I really did enjoy this film, but it is confusing and somewhat slow at times, slower than you wouldn't expect a film about a mafia hit-man to be. This films throws so many names at you and jumps from scene to scene and time to time so quickly, that it is a little difficult to keep track of who's who. Other than that, the performances are terrific and it's amazing how they were able to piece together a film from a simple interview, definitely worth checking out.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "I agree that it's rather disappointing. The acting is fine  Shannon was great as the lead and his supporting cast is good as well. But the story is just god awful, It's a near 2 hour film and yet there is no sense of fulfillment what so ever. It doesn't go anywhere and that is the real killer of this movie. I mean it's watchable but that's about it.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 5,
      "text": "Going in, I was completely unfamiliar with the story of Richard Kuklinski. The Iceman outlines a predictable mafioso who hides his wrongdoing from his family. Aside from an awkward performance from David Schwimmer, The Iceman features a somewhat memorable portrayal of Kuklinski from Michael Shannon.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "It's lovely to go see a film where I know nothing about it. Such was the case with the Ice Man  a wonderful, brooding film which never panders to the audience. You get to judge whether Kuklinski really loved his family and did all the killings so he could support them or if he was simple always going to be a killer.",
      "total_reactions": 0,
      "user": "reddave2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "Overall, it is hard to not characterize this one as a minor disappointment. I wanted to love this one so much, but just cannot. I mean, Michael Shannon absolutely kills (heh) it in the lead role and the rest of the cast is full of big names and great performances from Winona Ryder, Ray Liotta, Chris Evans, and David Schwimmer. It had all of the elements that should make this one great, but beyond the acting, it was very underwhelming. The film felt very ambitious, but in the ambition, it very much fell short. The script is eh at best and the film, as a whole feels very, very brief. The story is very interesting and, as I just said, the performances were great, but the film feels better suited for a television series than a movie. There is a lot of depth here, but the film just sort of covers the surface and fails to properly develop all of Kuklinski's relationships. As a film, it is nothing more than ok with great performances. If this were a television series (with a better script), it could have made for some fantastic television.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "Good entertaining movie.  Ray Liotta's performance as a gangster was spot on as usual.  Also like Winona  Ryder's performance was great as well.  Not the depth of a Goodfellows but still well worth watching.",
      "total_reactions": 0,
      "user": "Mr2times"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "The low score yet again leaves me little faith in professional reviewers.  Excellent performances all the way around.  Wynona Ryder can still act and the ice cream killer may be Chris Evans best work.  Not perfect but close to depicting the dual life that the iceman somehow pulled off for so long.  I actually saw the documentary years ago and it is almost as entertaining as the actual interview with Kuklinski.  Highly recommended.",
      "total_reactions": 0,
      "user": "Bigbry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "\"The Iceman\" is an unremarkable, yet competent biopic of its title character, Richard Kuklinski, providing only a limited insight into what made him one of the most prolific hit men in history. Claiming to have pulled off over one hundred hits to his name, Richard Kuklinski was a legendary mafia contract killer known for his intimidating stature, and his cold-hearted, nonchalant approach to his craft. \"The Iceman,\" based on a true story, is a fairly standard biopic that is only exalted beyond mediocrity by an imposing performance from Michael Shannon. Shannon's commanding performance is clearly the centerpiece of the movie, as he effortlessly exudes a cold-hearted confidence as a genuine, psychopathic hitman.",
      "total_reactions": 0,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "Despite a good performance from Michael Shannon in the title role, and some entertaining scenes here and there, THE ICEMAN isn't really worth a recommendation. It's completely underdeveloped, a 2h 30min film screaming to get out of its 1h 45min run time, all topped off with uninspired, cliche crime dialogue.",
      "total_reactions": 0,
      "user": "NFW"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "A pretty good movie. Acting was really good but everyone which kept me into the movie. It did get a bit slow at times. It was cool that this is a true story and after watching it I wanted to research more about it as I found it really interesting.",
      "total_reactions": 0,
      "user": "Viper8787"
    }
  ]
}