{
  "mc_avg_user_score": 7.6,
  "mc_metascore": 64,
  "mc_mixed_rating_frequency": 48,
  "mc_movie_name": "The Road",
  "mc_negative_rating_frequency": 20,
  "mc_positive_rating_frequency": 225,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "The road is not just an ordinary movie, it not about action or anything it's about something deeper, the ambiance created is insane from time to time. The music provided also suited the movie well and served it's purpose well. The story was sometimes really dark but in a really strong way. It is a movie which will not win prizes for the special effects or anything but it really comes close to you, makes you think. This may movie isn't just a movie sometimes is just an artwork.",
      "total_reactions": 2,
      "user": "mvh888"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "Finally a movie that presents a post-apocalyptic story in a dark, realistic manner. The actors play very well, while the story is very well described and interesting. Good movie.",
      "total_reactions": 1,
      "user": "Razv"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2011
      },
      "score": 2,
      "text": "This movie made me suffer, a lot!  If this is what the post-apocalyptic world looks like then release me out of my misery a.s.a.p. I couldn't even survive the few hours this movie lasted, let alone a lifetime. This was pure torture, it gave you glimpses and teases of something was going to happen but it never did. The worst part is everything looks and sounds so promising, you actually want to give this movie a chance. You want it to be good and give you that satisfaction. But it doesn't. This movie is the ultimate teaser!",
      "total_reactions": 1,
      "user": "lnformer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "\"The Road\" is a astonishingly masterful film that greatly succeeds re-imaging the original book. The movie is filled with unexpected tension and profound quietness most films fail to create. It also presents a well made, re-designed future apocalypse that looks realistic. Possibly in this case one of the most thought-provoking films of the year.",
      "total_reactions": 5,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2013
      },
      "score": 4,
      "text": "Dumb movie, the kid is gay and i wanted all along to choke him with my bare hands, he wouldn't survive 5 min without hes father and yet he wants to spread love in a cannibalistic post apocalyptic world, of course at the end of the movie the producers conveniently avoid putting him in harms way situation by making him meet a good guy, but we all know that such gay and useless prick will end up raped and eaten in a true post apocalyptic world",
      "total_reactions": 2,
      "user": "vence"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "I never read the book (even though I knew it was adapted before hand.) I actually was excited to see this one, boy was I disappointed. No wonder it only stayed in my local theatre for one week. It's a whole lot of boring. Don't get me wrong I like a psychological movie but this movie didn't really have a point. In any good story you need to create enough tension for you to at least care about what happens to the main characters. This is the first movie (other than the Twilight movies) I literally just turned off and say I'll finish this later. I don't know how this movie ends but from what I watch I got bored just waiting for something to happen. I only got as far as when Viggo's character meets Duvall's. And the grainy cinematography (while I understand why it was chosen, it does fit the film's subject matter) just made the film unwatchable on my wide-screen HDTV.",
      "total_reactions": 7,
      "user": "kidcoyote"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "The Road: A tale of a father and a son making their way across a trechorous wasteland, heading south, hoping to find others whilst being cautious of those around them. First things first: This is a grim film. You can see that just by looking at the surroundings. Corpses swinging from nooses, trees void of life, crashing to the ground one by one, snow stained with blood, water dirty as hell. It is quite the spectacle, yet for something so horrific looking, it is quite beautiful. Striking, how the director has perfectly captured the film's tone. It isn't just the surroundings that are bleak, the characters successfully empthasise this as well. Groups, in order to survive, slautering innocent people. Theres a scene in the film of a woman and her child being chased by a large group of these savages, where the surroundings are skulls displayed on pikes and the aformentioned blood stained snow. Food is scarce in this post-apocalyptic world, so one group keep people chained in a basement, to bring them out and kill them one by one, for sustenence. The father knows that the world is a bleak place, and his one driving point is his son. He teaches his son how to shoot himself in the head, if the time ever comes. He keeps two bullets in a gun specifically for them two, if the time ever comes. He very nearly shoots his son, so that a savage group do not take him to be chained and later eaten. The characters have become paranoid in this world, with the father not trusting any one in case they could be a cannibal, not trusting Ely, refusing to let him come with them for their food wouldn't last long, and he would slow them down. At one point, a woman shoots the man with an arrow and he kills her husband with a flare gun, because they both believe the other was following them. This shows how paranoia has set into these characters lives, how they cannot trust anyone, because it could spell for their end. Kudos to the actors of this piece. They all perform their roles perfectly, from Charlize Therons suicidal mother, not wanting to live in such a terrible world, to The Thief, whom instantly regrets robbing the main characters. Viggo Mortenson and Kodi Smith-Mcfee perfectly play their roles as father and son. You truly believe their roles, and their character relationship. The man's death, whilst his son is curled upto him, is a scene which, i'm not ashamed to say, brought a tear to my eyes. The ending of this film really shows the boys trusting ways paying off, as he now travels with a family, across the trechorous landscape. Conclusion: Quite a bleak film, with many grim moments, but wonderful character interaction makes it all worth while",
      "total_reactions": 1,
      "user": "roddersj04"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2014
      },
      "score": 5,
      "text": "Bare pass for this movie. Very depressing fare without even the smallest glimmer of hope basically. Good strong acting from the lead didm't raise it much due to the overwhelming weight of the script. Absolutely leaden in places. I don't think there is another film out there that is darker in terms of theme. I don't recommend this movie much. Probably has big fans in people who think that half decent SF like Aeon Flux were awful. Even if AF was based on a cmic it was still better than this black napkin of a movie.",
      "total_reactions": 1,
      "user": "dagirls"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "I had no idea what this movie was really about (i knew post-apocalypse) and had not read the book.  I was surprised by how intensely dark and frightening it was. It did, as one reviewer put it, rattle around in my head for several days.   I thought it was not boring, but I like science fiction.  I thought Viggo Mortensen was good and the kid, was pretty good.  The tension created in the encounters with the 'bad guys' was incredibly intense.  I went out and read the book immediately and thought that the screenplay actually improved the plot of the book in some ways.  The post-apocalyptic imagery was good, but in these days of anything is possible CG, I thought they could have attempted some larger imagery - like when Cormac McCarthy in the book describes building \"melted and then refrozen\".  But overall,  intelligent, consistent, scary and thought provoking.  No false notes.",
      "total_reactions": 0,
      "user": "koblesky"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "Brutal. A bit slow-paced, but compelling nonetheless. Excellent direction gave the viewer a real feeling of isolation and desperation. Shame that it was let down by a very weak ending.",
      "total_reactions": 0,
      "user": "bobbsyw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "'The Road' is a magnificient film that gives it's audience an insight into the affect on people in the planet after a mass destruction of vegetation and animal life. People resort to cannabilism and keeping others like cattle. The movie gets us thinking and creates a great visualisation of what the world would be like without police, businesses and the law. I enjoyed this film but I am taking two points off due to it's disapointing ending.",
      "total_reactions": 0,
      "user": "Jems"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2016
      },
      "score": 8,
      "text": "Slow and gray, this post-apocalyptic film isn't likely to be everyone's cup of tea. The emphasis isn't so much on the survival aspects these characters must go through, but more on the emotional bond between father and son. Don't come into this expecting a lot of action. The movie barely has any at all.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "What an amazing movie, I really felt for the characters, A good movie like this doesn't come around often enough. I would go as far to say this is in MY top 5 movies of all time.",
      "total_reactions": 0,
      "user": "vankwisha"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "Great movie, heartbraking and thought provoking, the love between father and son was truly heart-rending throughout. I thought the cast were fantastic.",
      "total_reactions": 0,
      "user": "connie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2011
      },
      "score": 9,
      "text": "No movie with such less effort has convinced me to dwell in self-examination of the world we're living in than The Road. Pain and hopelessness may be all over the movie from minute 1 towards the end but the single scene where the lead actor's son walks away with strangers gives enough pleasure of living and hope. The movie'shaunting cinematography and art direction blend well with the convincing production design and costume. Vigo Mortensen's sharp acting should have been nominated for the Oscars.",
      "total_reactions": 0,
      "user": "Tracyportner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2015
      },
      "score": 4,
      "text": "stupid annoying boy ruins the movie. movie does not make any sense at many points: all vegetation has been destroyed for like 10 years or so, but there are leaves on the floor everywhere and bushes and stuff",
      "total_reactions": 0,
      "user": "helohe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "This is easily the most realistic looking post-apocalyptic world I've seen. This movie does an excellent job of creating an atmosphere of despair as the remaining survivors are starting to lose their humanity in the empty world. Only negative part was that the story seemed a little dull, as if you are expecting some big climax to happen, but it never does.",
      "total_reactions": 0,
      "user": "Hiei987"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "John Hillcoat's adaption of the classic novel of the same name is a solid, loving and engrossing effort. Viggo Mortensen is absolutely brilliant as an unnamed survivor, trekking slowly towards the east coast with his son, played by Kodi Smit McPhee. The young and inexperienced McPhee holds Mortensen back in some scenes, especially the more emotionally intense dialogues that occur toward the end of the film. He does a satisfactory job, and shows a lot of potential, but nevertheless a more experienced child actor might have better captured the character. The script is pretty well thought-out, - there's very few of the cliches one might expect from such a film. However, some of the scenes drag out too long, and at times I was left wondering why certain scenes were necessary. The cinematography in The Road is immaculate. The way post-apocalyptic America is presented, with bleak, washed out landscapes and decaying buildings, is truly one of the most effective visions of a dying world I've ever seen.",
      "total_reactions": 0,
      "user": "wololooo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "Cormac McCarthy's adapted novel \"The Road\" is powerful story telling in some sort of Biblical way. Viggo Mortensen gives a performance of a lifetime. I'm surprised that this film didn't get more recognition from the Academy as CM's other novel No Country For Old Men did. Like NCFOM The Road is filled with underlying meaning and themes that can be discussed long after the credits are done.",
      "total_reactions": 0,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "I have not read the book but I found this to be a great movie with great acting and amazing cinematography. This is a very depressing movie, and you'll want to go outside and see the sun after. My mom (I'm 12 years old) thought this was a boring movie and the ending \"didn't go anywhere\". That just shows you how the average moviegoer is these days. Haters gonna hate. Go Aragorn! And Col. Kilgore!",
      "total_reactions": 0,
      "user": "Poopman157"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Based on the phenomenal novel of the same name, this movie offers us a glimpse of a world where everything has gone wrong, there is no light at the end of the tunnel and all that is left is the weak preying on the weaker. The book made me depressed and sick, the movie less so but it raised the hairs on the back of my neck several times. This is not  for the faint of heart.",
      "total_reactions": 0,
      "user": "Xon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2014
      },
      "score": 5,
      "text": "This would be a great movie if it wasn't for the whiniest brat, worst written child in the history of movies.",
      "total_reactions": 0,
      "user": "Littlebomb"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 3,
      "text": "From the writer of No Country For Old Men, comes yet another tale about the end of the world. From the previews, I thought this movie had promise, that it would be different from other post-apocalyptic stories, but it wasn't. It's the tale of a father and son wondering aimlessly just trying to survive. Nothing is at all explained, there are weird flashbacks, and there are way too many interactions with people. Most of the world is gone, not a single animal survived, yet everywhere you go, you run into people, crazy people, most of whom are cannibals. Viggo Mortensen does give a pretty solid performance, however Kodi Smit-McPhee does not. I've never seen him in anything before, but the whole movie, he's hiding, whining, and screaming papa, it got really  annoying! It was awful, I felt like they kept acting out the same scene over and over again in a different location. Nothing happens, there's no plot, and the dialogue is just stupid. This movie is a huge waste of time.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "Frankly, I was disappointed after seeing this movie. It seemed to drag on forever, and the trailer didn't really give the right idea about the film itself.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "Beautiful but sad. After I watched the movie, I went to buy the book- I was retiscent for I am a very good reader, and know a lot about good literature, so I don't like much 'comercial' reading. Yet, I did enjoy both. I think it deserves at 8, absolutely! But yeah, it is beautiful but depressing...and I like that mix, for somehow, it works....the art direction was great too!...so were the performances!",
      "total_reactions": 0,
      "user": "RegOz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2012
      },
      "score": 4,
      "text": "The movie was gripping, but it was just too depressing to watch because it was really boring and dull and dark at times. There is no possible way I can actually say I enjoyed the movie or even thought provoking.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "This is a FANTASTIC film and it is realistic in the way that they have to worry about things like food, shoes and bandits. As it progresses through the film you grow attached to the characters and feel their struggles and triumphs and it is just great.",
      "total_reactions": 0,
      "user": "Valkyrieee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Strong Points:",
      "total_reactions": 0,
      "user": "dayman75"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "This one is very impressive. I am not a huge fan of John Hillcoat's, but his direction here is good as usual and he really manages to tell quite the beautiful and tragic story here. Viggo Mortensen and Kodi Smit-McPhee are phenomenal. Robert Duvall, Charlize Theron, Michael K. Williams, Guy Pearce, and Molly Parker, all have very small roles here, but all are good in their roles and really make the film all the more tragic. Unrelentingly bleak, the worst (best?) part of this one is how it will give you a glimmer of hope from time to time and then it just rips your heart out again and steps on it. This makes the somewhat hopeful ending, almost depressing, since you know the positive will not last forever. This one is gorgeously filmed and it really shows how much beauty there is, even when things are going bad. Each shot, with its largely gray and bleak colorization, is breathtaking and, for me, is the true star of this film. While the acting is great, the cinematography is the true powerhouse here. The story is also solid, even if bleak. As a whole, the end result for this film is pretty good. It is not an amazing film, but it is most certainly powerful, beautiful, tragic, and filled with despair, all of which make it one that is tough to watch, but make for a good watch all the same.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "A truly unpleasant movie, because it realistically portrays a world without authority and law. Most likely, a lot of people you know would become that bad guys in a situation like that. Good people are very rare unfortunately... Recommended if you are interested in Post-apocalyptic fiction.",
      "total_reactions": 0,
      "user": "oliver1h"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2016
      },
      "score": 7,
      "text": "Not necessarily apocalypse needs zombie, quite the opposite. The Road shows a father a son trying at all costs to survive a hostile, violent world where one can not trust...",
      "total_reactions": 0,
      "user": "Iky009"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "It is considerably dispiriting and unnerving, however that's what makes John Hillcoat's adaptation of Cormac McCarthy's novel so unfading. It's rich with haunting questions of morality, remarkably human characters, and some unshakably frightening imagery.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2015
      },
      "score": 4,
      "text": "Mundane post-apocalyptic tear-jerk that has nothing to offer other than a couple of alright scenes which get solved with asspulls",
      "total_reactions": 0,
      "user": "evilgamer3560"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "As someone who has not read the novel, I was extremely impressed by John Hillcoat's work. It effectively portrays the unending love between father and son in a world where there is no room for emotion, and even provoked thoughts of my relationship with my own father. Visually and audibly the film thrives. Muted colours and the use of silence create a depressing atmosphere whilst retaining a tangible tension. Mortensen's portrayal as the paternal figure who refuses to give up really carries the piece! However, I found 'The Road' a touch too slow at times and a repetitive formula seemed to occur-stop, scavenge, sleep... If you are only looking for a graphic, action packed film where everyone is armed and no one thinks twice about killing, 'The Road' is not for you. If you are looking for something moving and more subtle, with greater underlying issues about mortality, give this film a go!",
      "total_reactions": 0,
      "user": "averygoodcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "It is, for me, a beautifully made film, scary, gripping and quite frankly the bleakest bloody thing I've ever watched, but it will, no doubt, leave you drained and empty for days afterwards, and in addition, it's not a film I'd be so excited to watch again, with the knowledge of how I'd feel afterwards. But in the time I watched it, I was able to acknowledge the brilliance of it, and I should say most definitely it's a film plenty of people may love to watch again.",
      "total_reactions": 0,
      "user": "Muddsjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "Wow this was a fascinating movie to say the least unlike other apocalyptic movies this doesn't have any zombies or something like that this is what I would call a realistic post apocalyptic movie there's a reason this movie is rated r it shows what would probably be a real life post apocalyptic world when watching this movie you feel unsure of what's going to happen and nervous this movie shows what dark and terrible things mankind would do to stay alive and let me just say some of the things in this movie are absolutely despicable the only thing I found unrealistic was the ending I would have rather seen something along the lines of the kid ending up a survivor and getting his act together instead of just staying like a boy I think something like that would have been more believable and realistic than him finding a \"good guy\" to take Carr of him as dark as it sounds I rather would have seen him turn out like Ellie from the last of us than stay an inefficient boy.",
      "total_reactions": 0,
      "user": "Arendelleawesom"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "Incredibly powerful, emotional, and it gives a very realistic feeling",
      "total_reactions": 0,
      "user": "dinosaurrerun"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2017
      },
      "score": 1,
      "text": "One of the worst movies I've ever seen.  Both boring and depressing.  Not much of a plot line.  If you have a problem with depression don't watch this movie or you'll probably kill yourself.  How did Robert Duvall and Viggo Mortensen end up in this stinker?  It's just awful.",
      "total_reactions": 0,
      "user": "rockon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "Excellent movie with good pacing. Characters depict what it would really be like for a father & son  struggling to survive the apocalypse. No mutants, cyborgs, or sci-fi creatures like in I am Legend, or the Fallout game series, this is pure survival. Acting is superb and will have you feeling for the characters from beginning to end. A lot of suspense leaves you hanging on the edge of your seat. This movie will leave you wondering if the decisions the main character chooses are right or wrong, or if right or wrong has a place in the wasteland that unveils itself over the course of the movie.. overall this is the only movie I have seen that depicts how hard and realistic it would be to live through an apocalypse.",
      "total_reactions": 0,
      "user": "CHEESEDBEEF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "The Road is a dark post-apocalytpitc film about a man and his son trying to survive. There are no zombies or anything like that, just desperate survivors (and some crazy people). The story is grim and it works well; you learn more about the mother as the two (the father and son) go through hell together. Too bad some parts felt boring and not as impactful. Otherwise, I'd give it an 8/10. I'd say it's a 7.5/10, and since I had to choose between7 (good) and 8 (great), I rounded down for the fault I described. Still, watch the movie if you're not \"faint of heart.\"",
      "total_reactions": 0,
      "user": "Epik_Ninnja"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "The Road is a pretty solid film, with great performances by the two lead actors. Its probably not a film for everyone, due to how saturated the visuals and the overall dark depressing environment the two characters travel through. The film will also make you hungry, so be certain to have snacks over the duration of this film. 8/10",
      "total_reactions": 0,
      "user": "kababs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2016
      },
      "score": 9,
      "text": "Spectacular movie, touching, brilliantly directed, makes you really think about what you would do if this was to happen to us.",
      "total_reactions": 0,
      "user": "choomtabi31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2016
      },
      "score": 9,
      "text": "Post-nuclear apocalypse survivor movie, and one of the best of its kind, evoking desperation and intensity against bleak landscapes, whilst maintaining a gentle, caring undercurrent that keeps the best of our humanity alive. A deeply serious movie that has left me moved and thoughtful every time I've seen it, currently five times.",
      "total_reactions": 0,
      "user": "shiftworker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2016
      },
      "score": 6,
      "text": "I'll take the movie over the book (which I found totally overrated).  The film stays pretty close to the novel, and effectively brings it to the screen.",
      "total_reactions": 0,
      "user": "Trailesque"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2016
      },
      "score": 9,
      "text": "A masterpiece. In nowadays movie industry, this type of of cinema is fairly too rare. Both visually and by the pase the stroy is driven, director's John Hillcoat probably built up on the most powerfull and realistic envision of a post appocalyptic story (thanksfully to the original book, which defined this tone - and which I didn't read). Viggo Mortensen is, as often, endorsing the role briantly. To be franck, I haven been touched so deeply for ages.",
      "total_reactions": 0,
      "user": "migou80"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2017
      },
      "score": 10,
      "text": "Emotionally devastating and utterly, crushingly, eye-wateringly bleak. Do not watch this on a Sunday night before going to work. I can't say I enjoyed The Road but I admired the craft of enormously.",
      "total_reactions": 0,
      "user": "Happyislands"
    }
  ]
}