{
  "mc_avg_user_score": 6.0,
  "mc_metascore": 42,
  "mc_mixed_rating_frequency": 25,
  "mc_movie_name": "The Last House on the Left",
  "mc_negative_rating_frequency": 24,
  "mc_positive_rating_frequency": 50,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "It was a very interesting movie with awesome acting and a great plot. Though lacking a little atmosphere and suspense, i'd say it's a good movie overall.",
      "total_reactions": 1,
      "user": "Razv"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2010
      },
      "score": 1,
      "text": "This was one of those movies that just plain didn't deliver. You know, the type where the characters are just plain irritating. Build up build up and then nothing. The stupidity of the girls that got them into trouble in the first place and the seemingly helplessness of the parents when dealing with the rapists crew. The whole damn movie was a waste of time. Right up there with Ishtar in my book. Best part of the movie was the revenge dished out at the end, pardon the pun.",
      "total_reactions": 0,
      "user": "budworth"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "This movie was kind of out of left field to me. As somebody who never saw the original I was excepting this to be like \"The Strangers\" with Liv Tyler. This movie was nothing like that though. This movie is very in your face with a lot of horrible imagery. Everything from a girl being stabbed in the stomach to an outright rape. The movie does a great job of building the characters and the acting is solid with the exception of Paige (Martha McIsaac) and Sadie (Riki Lindhome). The thing that actually bothered me the most was the very last scene. The move had a very solid ending and it fades to black only to come back on a microwave and the villain. I'm not here to spoil it to you but it was one of the only useless moments that was only in the movie to pad running time and add gore. Overall this movie is pretty solid and well worth a watch.",
      "total_reactions": 0,
      "user": "moviegrabbag"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "I really liked this movie. I know that the original is a cult classic, but I could never sit through the first half hour. For those that cannot stomach the original, this is a good alternate. Casting, plot, and set are well done.",
      "total_reactions": 0,
      "user": "Anotherday1787"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "This film surprised me in the fact that I wasn't bored by it. Still it wasn't the best thriller/horror remake I have ever seen but it is no where near the bottom either. The tension built through the film really well.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2014
      },
      "score": 0,
      "text": "An unworthy piece of garbage, what happened to the 1970s' and 1980s' type of horror films. Sure today's technology is better, that's great, but we don't need to go overboard with it. I hope everyone can see where I'm coming from here. This film is very bad and terrible in everyway possible. It's crap compared to Wes Craven's original horror film made back in (1972). If I was on the MPAA ratings board I would've  rated them opposite of each other. The 1972 film gets an R rating and the 2009 remake gets an NC-17. I see no reason why the 1972 film should be given an X rating. I think it definitely deserves an R, but not an X rating, I think the ratings board had bad judgment there. I think now that the film's on DVD and Blu-ray they should re-submit it to the MPAA so they can have another look at it. They should re-release it either in theaters one more time or straight to DVD, so the public and movie-goers can see why they got the rating for this film wrong in the first place. This film has terrible acting, bad scripted dialogue and the special effects are way overboard. I think this film plus the Saw films and the Hostel films should all be given an NC-17 rating. I'm on the fence with Halloween (2007) though. I think that one should stay rated: R. But I do think that the (2009) sequel should be slapped with an NC-17. The violence is more brutal and bloody than the remake. All in all The remake of The Last House On The Left is just pure torture and predictable, everyone should avoid buying this movie at all costs, and someone should contact the MPAA and get this movie re-rated.",
      "total_reactions": 0,
      "user": "Kylenine1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "I haven't seen the original one but The last house on the left was not such a bad film. It had a good plot and the actors were good. It had suspense and violence. It was not like a good classic thriller but it was much better than other horror films these days.",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2013
      },
      "score": 0,
      "text": "This movie scarred me for life after the first 30 minutes. After the rape scene I knew for sure that this movie was a huge F U C K. I would advise everyone to buy this movie and then pour gas on it and burn it until it is nothing. Anyone who likes this movie should be castrated and shot in the dome. Oh and go die mikej",
      "total_reactions": 0,
      "user": "Ihatethemovie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "An effective home invasion film which in my opinion is better than the first. However the content is brutal, sadistic, and at times difficult to watch. Iliadis really does create a heart pounding thriller worthy of being watched.",
      "total_reactions": 0,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "The movie was actually pretty good.The acting was okay,the movie was entertaining and there was some blood.The movie was probably censored because the rape scene was not really believable and the deaths were kind of lame except for the first bad guy.The atmosphere was not good enough to really affect the movie.And the way the movie is made, you won't like any characters so you won't really care who dies at the end. Overall a pretty good movie but it could've been so much better.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "Last House on the Left: 5 out of 10: Close but no cigar. Honestly anyone who remembers 1972’s shocking version of the Virgin Spring had to know this remake would pull back the reigns. It would be like a remake of “I Spit on your Grave”... just not likely in these conservative and commercial times. Well at least they did not make it PG-13.",
      "total_reactions": 0,
      "user": "juliankennedy23"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "I watched this film without watching the original film. Just another remake based on a 1970's classic. I'd watch the first one before watching this adaptation.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "I haven't seen this in a couple years, so my memory of it was a little fuzzy. Now I know that it was far better than I expected. A huge improvement to the original was a consistently dark atmosphere. In Wes Craven's version, it felt silly at times, namely the scenes with the cops and the whole \"Willow\" stuff. This remake was also a lot more intense and suspenseful, and the danger felt a lot more real. The ending may somewhat blunt the movie's overall effect, but, hey, how often do you get that sort of ending in a horror movie? The rape scene was very difficult to sit through because it was so long and realistic, which is my only real complaint. If you had to choose to watch the original or the remake, I would go with the remake because it's a lot more thrilling, and it's far superior to Wes Craven's version overall.",
      "total_reactions": 0,
      "user": "horcrux2007"
    }
  ]
}