{
  "mc_avg_user_score": 7.3,
  "mc_metascore": 53,
  "mc_mixed_rating_frequency": 84,
  "mc_movie_name": "The Book of Eli",
  "mc_negative_rating_frequency": 43,
  "mc_positive_rating_frequency": 275,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "The Hughes Brothers' \"The Book of Eli\" is a entertaining movie with a solid grim tone and quick, fast paced action. However, it could have done so much more than consistently managing it's apocalyptic mood...",
      "total_reactions": 4,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "Decent post-apocalyptic movie. Washington's acting is good, Gary Oldman is so-so as villain (I consider him a real chameleon actor, who can play brilliant villains, but here the character He portrays is somewhat weak). The twist of the movie is totally unrealistic (Yeah I get it, but anyway it is very unrealistic). Overall it worth a look, but that all. Ps: I do not like how American centric the movie was. I am sure there are a lot more Bibles in Europe, that survived, so Eli hardly saved the last remaining one (It might be the last one there, but the world is a lot bigger place than that.),",
      "total_reactions": 1,
      "user": "oliver1h"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2012
      },
      "score": 0,
      "text": "This movie is like Mad Max, without cars or irony or any meaning, everything is replaced by christian propaganda. In a world starved and lacking fuel people wouldn't bother very much about chasing a fanatical blind fencer but they would try to find a way to recover their technological knowledge. Everything else is better: The road, Mad Max, Escape from New York, even Red Dawn...",
      "total_reactions": 2,
      "user": "nico249"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2011
      },
      "score": 0,
      "text": "Why does everyone in this movie speak in an ADD?ADHD manner ? And walks like in one of those early Charly Chaplin movies ? The story has been done a hundred times before, what is the added value here ? Nauseating to watch...please speak SLOOOWERRR. Horrible waste of a good cast...",
      "total_reactions": 3,
      "user": "Nazgulero"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2010
      },
      "score": 1,
      "text": "Dumb.  I can't believe I payed to see a movie about a post-apocalyptic black ninja sword fighter who kills everyone left on earth.  The final scene of the movie is the worst I've ever seen, please leave before it happens!",
      "total_reactions": 3,
      "user": "DarthCritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "The real title should have been \"Fallout 4: When Zatoichi Found God and what happened after\". Not much. I am a big fan of post-apocalyptic movies but this actively annoyed me most of the time.",
      "total_reactions": 4,
      "user": "KundK"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "Denzel still has it, and the twist in this movie is actually a good one. A lot of movies have twists that are just plain ridiculous, and I refuse to swallow, but this one makes you want to watch the movie again after realizing something that you maybe should have known the whole time.",
      "total_reactions": 1,
      "user": "dijavantewow"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "Oh no another of one those doomsday movies, barren wastelands and cannibals all over the place. However the movie I can recommend itâ",
      "total_reactions": 1,
      "user": "thelordoffilm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "I went into this film expecting very little.  I love end-of-the-world scenarios (One of my favorites: The Quiet Earth. Least Favorite? I Am Legend or The Postman... Take your pick.) and had recently been slightly bored by \"The Road\"... This movie surprised me. I expected heavy religious overtones, and while there are some(duh), they don't ruin the film by getting too preachy.  The action sequences are well done and often quite brutal.  Worth checking out.",
      "total_reactions": 1,
      "user": "wegottadorkhere"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2010
      },
      "score": 8,
      "text": "Post-apocalyptic times, man wanders along his \"path\", encounters raiders, cannibals & unsavouries, comes across a town, head of town wants him to find a book, man doesn't want to, head tries to persuade him unsuccessfully, carnage.",
      "total_reactions": 1,
      "user": "ERG1008"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2011
      },
      "score": 6,
      "text": "Not as strong as some other Denzel films such as \"Man on Fire\" and \"Training Day,\" thanks to some plot holes that are inexplicable even by post-apocalyptic-film standards. Still, I liked the intensity of his performance and thought the supporting acting was good as well. Appreciated the couple of laughs, the \"wow\" moments and the basic theme. Hard not to compare this with \"The Road,\" a different and better movie but so much more grim.",
      "total_reactions": 1,
      "user": "Lyn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "Although this movie is about ideally saving Christianity, the characters do a phenomenal job. You buy in right off the bat to a rag-tag Denzel Washington and accompany him on a epic, intense, and emotional journey, I highly recommend seeing it.",
      "total_reactions": 1,
      "user": "killer500226"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Why? Why are there so many negative reviews for this the film is epic, Denzel Washingtons performance is nothing short of spectacular! I mean the whole film is so immersive I can't see how anyone could dislike it. If you are a big fallout 3 fan then you will love this hands down.",
      "total_reactions": 2,
      "user": "cremeegg88"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "A great movie, i really didnt know what to exspect going to see it maybe thats why it was so good. acting was grea. the actors explained the plot well and the fight scenes pretty good to. most of the movie kepps you on the edge you really dont know what will happen next. In the end this movie is worth your time and you wont waste your money.",
      "total_reactions": 1,
      "user": "moviefreak12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "To all the people giving this movie a negative review, stop it.  I bet all of you were hopped up on Mountain Dew and Redbull ready to see violence before you got to the theater.  Also to all of the people that say that there wasn't enough violence in the movie probably didn't stop to think that the movie wasn't really an action movie, it was about Eli's journey and what he went through on that journey, not about all the people he killed.  The movie was great and doesnt deserve to be rated poorly just because it wasn't what you thought it was going to be when you went to see it.  Sure the movie was predictable but if we rated movies on predictability then over 90% of movies would fail.  All that being said the movie is worth every penny and deserves to be seen.  The overall plot is fresh and something that will intrigue you and keep you watching. Just dont go into it thinking Denzel Washington is a cold blooded assassin on a violent warpath for revenge.  And one more thing, just because the movie plot centers around the bible, doesnt mean that the writers were trying to convert the entire audience to Christianity.  It appears that the only reason people say that is because they themselves are unsure of their own religious beliefs.",
      "total_reactions": 1,
      "user": "Engage"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "The Last Bible on earth! Thiz topic expected to be controversial. But rather than that, people do not take it too seriously. In post-apocalyptic  future, Eli (Denzel Washington) protected a book by walking to the west, somewhere he believed the book will preserve forever. The book that held up destiny for all human remained. Actually the story was smoothly told by Allen and Albert Hughes who directed FROM HELL (2001). The story starts slowly in the beginning. And later successfully make us stay on our sit by holding up the curiosity about what happens next. The book which is the core of thiz movie, in my opinion did not suppose to reveal too obviously pointed to The Holy Bible. I think we already know by itself with all the conversations and dialogues all over the movie. If the book does not mention about what book is that, it will creates a great mysterious elements. The twist-ending sparks a little by revealing why the book could not read by anybody except eli. Washington performed another side of his characters. Thiz modern Sidney Poitier always amazed us. Gary Oldman once again did what his best to do by playing a convincing fierce-villain. Mila Kunis performance could replace by anyone. The movie reminds me of other gloomy post-apocalyptic flicks like MAD MAX trilogy (1979-1985) or WATERWORLD (1995). But the settings were too simple. There were no big scenes we could remember, even looked like classic-cowboy movies. There were only some refreshing scenes involved an elderly couple who one of them played by Michael Dumbledore Gambon. There were so many post-apocalyptic movies had been made. Thiz time is about the last shampoo remained on earth. It is not an expected movie but just ring my bell a little bit.",
      "total_reactions": 1,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "Movie was great.... there was great action with great acting.. the movie really lets you feel the horrors of society today and what it could be in the future. You will like this if you love a good story, love action, and don't mind religion... considering the whole story is based on the Bible.",
      "total_reactions": 1,
      "user": "MTM"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "A good movie to watch on the satellite on a weekend day. Has good acting, good characters and even a good story. It even showed lots about how the environment would be like in a post apocalyptic time. I liked the movie.",
      "total_reactions": 1,
      "user": "Mr7Goat"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "This movie is a Christian movie... I watched the trailers and everything and I thought it wouldn't be like that.  This movie is great it combines a good message along with action, miniguns, and cannibals.  If you are another religion then you might get mad at it because in a way it is false advertisement, however if you are Christian you will love this movie.",
      "total_reactions": 3,
      "user": "SilentNight"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2011
      },
      "score": 6,
      "text": "We have seen many Post Apocalyptic movies and video games now and this movie doesnt do much new that hasnt been done before. If the characters were compelling the movie could still work but its all just standard, the overall quest of the movie was nothing to get excited about. Many of the out comes of its scenes were predictable as soon as they started and the overall 'twist' of the movie was a let down. The movie is watchable of course, and its not too bad but not too good or original either.",
      "total_reactions": 1,
      "user": "davenbettridge"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "Amazing movie, with good action and history. The ironic end is the better part of the hole film, it's difficult see an good movie like this today. Denzel makes for a incredible performance as usual.",
      "total_reactions": 1,
      "user": "Towhook"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "Post-apocalyptic is overused, but that's really the only fault I found with this movie.  The acting was superb and the world was amazingly detailed to the point of perfection.  Washington and Kunis show some real chemistry, and Gary Oldman is perfect for his role.  The story was purely enjoyable, though maybe not as impactful as its director meant it to be, and the irony at the end give it an almost perfect touch.",
      "total_reactions": 1,
      "user": "CRL"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "This Was A Great Film. The Only Reason I Gave It A 9 Is Because Some Of The Scenes Were A Little Disturbing. Good Storyline. Seems Just Like Fallout 3. But No Mutants. Or Other Assorted Enemies. So Thats Another Reason I Didn't Give It A 10. It Lacked Exciting Enemies Because Carnegie Wasnt That Exciting Of An Enemy And When I Watched His Story In The Blu-Ray Speicial Features It Turns Out He Burned His Own House Down Just Because His Dad Caught Him Reading An Inappropriate Magazine. Nice. Still, I Would Have Prefered Some Sort Of Creature In It Other Then Gory Raiders, torturers And Slackers. But Overall, great Movie.",
      "total_reactions": 1,
      "user": "Skulltheworld"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "Christian propagandizing piffle pretending to be an action-adventure movie.  Apparently, after most people die and the rest are left to suffer in a living nightmare, we're supposed to feel good that a man (the messiah?) comes along and recites the bible.  Exactly what has been solved or even improved in the slightest way?  The Road does it a million times better and without the sermonizing.",
      "total_reactions": 1,
      "user": "CooterPatooter"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "This movie is a scam. OK - the book is a Bible. That's it, I just saved you time and money. Not only that but Eli is blind and the Bible is written in braille. Oh, maybe everyone in post-apocalyptic world can read braille nice and easy. These people are screwed.",
      "total_reactions": 1,
      "user": "Palenoire"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2013
      },
      "score": 2,
      "text": "You can watch The Book Of Eli, if you like Post- acpolyspe films  you will certainly hate this film. The Book Of Eli is brutal and long. 2/10 for Denzel Washington and Mila Kunis, otherwise 0",
      "total_reactions": 1,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "An awesome film. Denzel kills it as always. The story line is great and so is the cast. For anyone who hasn't seen it yet, this is a must watch. Enjoy.",
      "total_reactions": 0,
      "user": "LondonTruelove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "A stylish film with a underlying current of fetishist violence. The tone of the film has impact and mimics the nature of apocalypse well. I feel compelled to reminisce about human existence, the artistic visuals are a treat and well worth the heavy-handed contrast. There is a heavy anti-human feeling which is counter balanced by the redemptive righteousness of Denzel Washington. Pretty much your Hollywoood norm but done with finesse.   8/10   81/100",
      "total_reactions": 0,
      "user": "NicoDaFlagburna"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Denzel Washington stars in perhaps not one of his best performances, but certainly memorable in this post-apocalyptic tale in perhaps a not too far away reality.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "This movie had the right idea, but left far to many unanswered questions. I was expecting a lot more based on the previews and descriptions, but I was left with a film that was not unique. Denzel Washington was amazing as usual, but sadly, overall, The Book of Eli wasn't anything special. Just another tale about the world will end one day and reveal what savage beasts we truly are.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "The most that I can say about 'Book of Eli' is that Denzel Washington gives a solid performance and the apocalyptic setting is very convincing. Everything else is meh. My biggest problem with the film had to do with it's pacing. It takes way too long to establish the main conflict of the film, which basically centers on Denzel being hunted by Gary Oldman because he carries the last known Bible in existence. It takes nearly an hour just to get to the conflict and the film runs just under 2 hours. If the pacing was sped up a little bit, my feelings toward the film could have been a bit stronger than they already are. Not bad by any means, but the slowness of everything keeps it from being great.",
      "total_reactions": 0,
      "user": "Captain_Kirk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "I love this movie, and the Main character.The Shades he wears fit him, cause hes mysterious, and makes everybody wonder what hes about, and capable of. It`s a dark world and to get by you better be prepared to defend you`re self. The movie gets deep with the Main Character Faith.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Visually/audibly impressive and featuring a stoic, yet engraining performance from the always-impressive Academy Award Winner Denzel Washington.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "I originally had no intention of seeing this movie, but I had a free rental so I gave it a shot. It is a really good movie. The action is great. It is a really enjoyable film. It even throws a little religion into the mix.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "Great movie but terrible dialogue. The religious views of Christianity and the bible are both realistic and non-realistic. Denzel did great, he would have been fantastic if they decided to hire a better writer and maybe a better directer.",
      "total_reactions": 0,
      "user": "RedShadowHat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "I'm not sure why this got such mixed critical reception, I loved it. The reveal at the ending was quite unique, and the cinematography and set design were impeccable, along with a solid performance from Denzel. What's not to like?",
      "total_reactions": 0,
      "user": "SimpleMethod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "''this was a great movie i love movies about apocolypses denzel gives a powerful performance as eli mila kunis was sexy and the cast was good its a must see u will like it",
      "total_reactions": 0,
      "user": "Lovejoy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "The end of \"The Book of Eli\" surprised the hell out of me. Twist endings, like this one, is cool, because it makes the movie that much more interesting and not just a waste of time. Although I do believe this film overuses the Christianity theme, but it is a fun, action packed movie to watch. Denzel did an excellent job and i recommend everyone see this film at least once.",
      "total_reactions": 0,
      "user": "FordFanatic19"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2014
      },
      "score": 6,
      "text": "Good pacing and good acting from the man himself Denzel Washington and a good supporting cast including Gary Oldman couldn't turn what was essentially a clever rip off of science fiction classic Farenheit 451 into a stand alone work with its own merits. SciFi has become the realm of the 'calculated steal' in recent years which is a bad thing for SF fans. In 451 people have memorized books that have been destroyed-keepig them for humanity to presumably remake later-its the same thing in this film-but only regarding one book. You can probably imagine which one without seeing it which in a way makes it kind of a soft sell of religion.  Eli is Saturday matinee stuff-nothing more.",
      "total_reactions": 0,
      "user": "dagirls"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "The Book of Eli is an excellent and creative film. Rather than have another post apocalyptic film filled with Zombies the Hughes brothers constructed a film with some great content. The cast in this film is great. Its hard to doubt Denzel Washington in any role he's and I think he was most appropriate choice for the role of Eli and Gary Oldman who is one of the most versatile actors of this time was great as the villain. I liked the way the film looked and Eli may have seemed unkillable at points in this film but that's because he was driven with a higher purpose and he was determined to achieve his dream.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "This is one of the best christian-fiction movies i had. If you are into action movies, and into Jesus, this one is for you. The OST is very amazing and shows a powerful story.",
      "total_reactions": 0,
      "user": "G1GN_pH"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "What the Book of Eli is lacking is the interest. Where exactly is it throughout the entire movie? Oh, expect only a few good scenes and that's just it.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2016
      },
      "score": 1,
      "text": "very bad movie. a half hour in and it still hasn't really started. tries to be gritty and bad ass but really just fake boring and annoying. denzel is the same person in every movie. I don't know why people think hes a good actor",
      "total_reactions": 0,
      "user": "iplayandwatch"
    }
  ]
}