{
  "mc_avg_user_score": 4.4,
  "mc_metascore": 30,
  "mc_mixed_rating_frequency": 56,
  "mc_movie_name": "The Smurfs",
  "mc_negative_rating_frequency": 93,
  "mc_positive_rating_frequency": 58,
  "mc_pro_critic_reviews": [
    {
      "critic": "S.T. Vanairsdale",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 70,
      "summary": "This is a film that transcends \"good\" or \"bad,\" \"like\" or \"don't like.\""
    },
    {
      "critic": "Jennie Punter",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 50,
      "summary": "Sitcom star Harris puts his smart-aleck chops to good use as Patrick Winslow."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 50,
      "summary": "Sure, Smurfs are blue, but who knew that they actually work blue?"
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 50,
      "summary": "Once you're done trying to conjugate the smurfs, there's a better movie than anyone could have possibly expected, thanks in large part to an honest effort by Harris in a thankless role."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 50,
      "summary": "Smurfs is utterly kid-friendly."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 50,
      "summary": "The bottom line: Any movie that gives Jonathan Winters work is doing something right."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 50,
      "summary": "The slapstick is very small-kid friendly and even the most adult-friendly jokes are pretty mild stuff."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 50,
      "summary": "Adorable and annoying, patently unnecessary yet kinda sweet, it's a calculated commercial enterprise with little soul but an appreciable amount of heart."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2011
      },
      "score": 50,
      "summary": "I deferred to the wisdom of Grouchy Smurf (George Lopez): \"I didn't hate it as much as I expected to. But I still hated it.\""
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2011
      },
      "score": 40,
      "summary": "Azaria channels his inner Charles Nelson Reilly, which helps, as does an evil emoting cat. Kids under 7 will likely giggle at some too-harsh pratfalls, not care about a grown man's fear of procreation, not get all the tiny innuendos and possibly miss how the movie is a fairly successful tourism ad for New York."
    },
    {
      "critic": "Michael Rechtshaffen",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 40,
      "summary": "For all the digitally enhanced Smurfness, the results are remarkably mirthless."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2011
      },
      "score": 38,
      "summary": "Clever story? Pass. Originality? Nah. A smidgen of real humor to keep parents entertained along with the kiddies? Smurf you."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 38,
      "summary": "Like the show, this boring, lazy, clumsily staged, overly lit, unnecessarily 3D-ed contraption even culminates with some half-hearted moral hectoring-in this case, the togetherness of the Smurfs works to validate heteronormative values."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 33,
      "summary": "Actual kids may find this fun, but for adults, watching The Smurfs may feel a little too much like trying to wrangle an overcrowded kiddie birthday party."
    },
    {
      "critic": "Keith Staskiewicz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2011
      },
      "score": 33,
      "summary": "The Smurfs may be blue, but their movie is decidedly green, recycling discarded bits from other celluloid Happy Meals like \"Alvin and the Chipmunks,\" \"Garfield,\" and \"Hop\" into something half animated, half live action, and all careful studio calculation."
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2011
      },
      "score": 30,
      "summary": "Gosnell directs as if every scene must be either a nauseating roller-coaster ride or a syrupy melodrama, resulting in a seesawing tone that's not stabilized by the presence of Neil Patrick Harris."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 30,
      "summary": "This animated-live action hybrid is really more 3-D disaster than family comedy. Even Neil Patrick Harris, who has proved he can save just about any sinking ship, cannot make this boat float."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 25,
      "summary": "The Smurfs is exactly like Amy Adams's princess-in-Manhattan comedy \"Enchanted,\" only far less clever, kindhearted, original, exciting or entertaining."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2011
      },
      "score": 20,
      "summary": "Looking at the obnoxious TV ads for The Smurfs, it's easy to dismiss the film as a shrill, joyless exercise in special effects without substance. It's even easier after actually seeing it."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2011
      },
      "score": 20,
      "summary": "Smurftastic! Now where's that noose?"
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 11,
      "summary": "What the kids at my screening seemed to like best was the wizard's cat, whose mouth is computer-manipulated to utter pithy asides."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2011
      },
      "score": 0,
      "summary": "Ineptly directed by Raja Gosnell -- the genius behind the \"Scooby-Doo\" features, \"Big Momma's House,\" and \"Beverly Hills Chihuahua\" -- this cheesy-looking flick has lousy animation, worse special effects and the most headache-inducing, blurry 3-D since \"Clash of the Titans.\""
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "I'm not sure making a smurf movie would be such a good idea, especially in 2011. If it was released back when the smurfs were popular, it would of worked out. I'm not saying that I hate them, on the contrary, I used to like the smurfs when I was a kid. I don't understand why they brought them back. It just ruins the reputation of the smurfs. The people who would be interested to see this are little kids, which surprisingly makes a good family movie. It wasn't that bad. This got to be the movie that surprised me the most this year. Of course, there are some flaws. It has '' cheesy '' humor, the villain Gargamel (played by Hank Azaria) was stupid and has other '' cliche '' stuff that you would expect. This kind of entertainment is useless and annoying these days. Hollywood producers, directors or whatever, should stop making these type of movies. Also, has you probably already know, Katy Perry does the voice of Smurfette. She actually did a good job. But it starting to get on my nerves to see singers appearing in movies (it's okay if they can actually act), leave that to the actors. Anyway, I saw this movie with my little brother, and he liked it. So this movie may be enjoyable for kids, even I surprisingly thought it was better then I expected. At some points, I even managed to get entertained a bit.",
      "total_reactions": 4,
      "user": "scrieciu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2011
      },
      "score": 2,
      "text": "I can't believe I sat through this. This movie was so bad it had me crying. It was as bad as my writing. The plot was horrible. The voice overs where wrongly cast. There was so much stuff that was really unnecessary. Why is Neil Patrick Harris'  name in all his movies Patrick? If I where a producer I would not allow the actors to pick there own name. If the actor says otherwise then he's gone. I can see that the people that would like this are parents that grew up watching the cartoon. I'm glad I wasn't born back then. The story starts out right away when the smurfs are running from Gargamel. This is exactly what I don't like in movies. The whole movie had sloppy writing for the kids. I can't wait to see the kids that liked this grow up and realize how bad of a movie it is.",
      "total_reactions": 2,
      "user": "MetallicCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2011
      },
      "score": 1,
      "text": "As an European who grew up reading the Smurfs and loving it, it is the huggest disappointment Hollywood brought me this year. They made it in 3D ? Why i am not surprised ?",
      "total_reactions": 1,
      "user": "TheCoolFrench"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 3,
      "text": "A real disappointment of a story.  I used to watch the Smurfs and they were fun to watch.  It is scary that they have announced a further two sequels.",
      "total_reactions": 1,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2011
      },
      "score": 1,
      "text": "This film is just...God. Its so BAD!",
      "total_reactions": 1,
      "user": "Gtafan421"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2011
      },
      "score": 1,
      "text": "Skip-it - The Smurfs visiting New York is nothing more than a handful of recognizable voices buried beneath a heaping pile of boring blue baby junk.",
      "total_reactions": 1,
      "user": "RyanPratt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2011
      },
      "score": 2,
      "text": "movies like this make kids stupid, just because is for children it doesnÂ´t mean that it have to be stupid, there are too many good children movies like Fantastic Mr Fox or Toy Story, please do not make your children watch this",
      "total_reactions": 1,
      "user": "RodrigoBGC"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2011
      },
      "score": 3,
      "text": "Wow. Movie was bad but not horrible. The humor was childish. \"Smurf\" replaced every word (What the smurf?) And forever after that movie I have the urge to sing that horribly catchy Smurf song. Overall, this movie met my expectations - very low quality flick produced solely to entertain little kids and give stressed parents a break from their little demons. Nicely put GregTehBunny. Bad budget, worse movie.",
      "total_reactions": 1,
      "user": "ianriker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "The blue Smurfs do a better acting than the actors, lame.",
      "total_reactions": 1,
      "user": "ARGO"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2013
      },
      "score": 1,
      "text": "As a fan of the smurfs cartoon when I was a kid, it makes me weep for the youth today.  This is not the smurfs I remember and unfortunately they have brought NPH into this mess.",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2013
      },
      "score": 3,
      "text": "I was so disappointed when i first saw \"The Smurfs\" on the theaters. It's just silly and primitive, nothing special. The acting in the movie is terrible and the story is average. But still i recommend it to kids and some teens. My final PERSONAL score is 3/10",
      "total_reactions": 1,
      "user": "SEROJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "Worst Animation/live action film in recent time!! Raja Gosnell is back again to destroy another kids beloved animated cartoon! Last time Scooby-Doo was the victim but this time its Smurfs! i don't know how this was rated PG this should have been PG-13. The dialogues are only suitable for adults, its all about communism",
      "total_reactions": 1,
      "user": "117dilushamc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "La tipica historia de los pitufos con tiernas voces, personajes, y buenas animaciones pero pasa a lo ridiculo cuando esto se vuelve el mismo estres que alvin y las ardillas metiendole que estan en Nueva York",
      "total_reactions": 1,
      "user": "Jmsbpp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "\"The Smurfs\" is an example of how adding cheap child humor with top celebrities does not work in an animated/live action film's favor. Similar to \"Alvin and the Chimpmunks\", the film suffers tremendously with the fact of the several gags and pop culture references that they try to attract children to, that end up failing to draw up anything more that gags. Constant jokes of the usage of the word 'smurf' gets old fast, and leaves you wanting to leave the theater. The plot is horribly put, and suffers with any way of emotion or depth. Despite this, \"The Smurfs\" will probably entertain your kids, but will definitely leave you severely annoyed and wanting a refund. Not looking forward to \"The Smurfs 2\" at all.",
      "total_reactions": 1,
      "user": "jeff_reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2013
      },
      "score": 0,
      "text": "When the movie came along to The Smurfs franchise I expected allot out of it, but sadly I was disappointed and expect we were all disappointed with the results. What we got in the end was an insulting child racist poorly done, lazy Smurfs movie, and its not worth your money even if you were to see it free. Let me explain why it failed so badly. It starts off in the Smurfs village until they are teleported into the city of New York for some lazy unexplained reason this completely breaks the nostalgia of the Smurf village making the viewers feel out of their comfort zone. Even worse The smurfs tv show was set in the middle ages and for some reason this movie is taking place in the 20 century, it goes against the tv episodes. A few of the Smurf, not all, sadly try to find a place to stay amongst the humans in New York, but because the story is so so poorly told  it feels like its going another direction for no reason at all. Its basically a weak story when the Smurfs are trying to get home in between that time waiting for the portal to reappear the events that occur are so dull and mind numbingly out of place. I didn't feel any connection with the Smurfs and what they were trying to accomplish, and so therefore didn't care what was going to happen to the Smurfs in the end. It makes it even worse that the movie does try to make us care about the Smurf, with only some dull emotional scenes, shoe horned in. By the way the voice acting was awful, especially with the Smurfs. The tv show had likeable characters with quirky and unique personalities, and lots of humor. But in the movie we find ourselves with boring characters and terrible writing and there was humor which was terrible and didn't make me laugh once, not even once, in fact the humor was annoying. The acting is horrible, probably one of the worse acting movies ever, and not just with the actors but with the animation. So what you have here is a boring, shallow and uninspiring disgrace to the Smurfs tv show. Don't watch this movie, and don't support it in anyway possible, and tell everyone to stay away from it. If you have children and thinking of sharing the movie with them, don't take them to see this movie. Especially for your children, we don't need horror like this to torment their innocent minds. If you want to experience the Smurfs franchise then watch the tv episodes of the Smurfs, you wont regret it.",
      "total_reactions": 1,
      "user": "Arjuna"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "Formulaic, dull, painful and slow, \"Smurfs\" is a shockingly insult to the America society and a headache for every age. If you think this is overall a decent film, you are either stupid or mentally defective.",
      "total_reactions": 1,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 3,
      "text": "A boring and un interesting movie. I know this is a kids movie so the jokes are supposed to be clean and stupid but it didn't even do that well. There are so many more better kids movie than this. Acting is awful and just all around terrible. The only kind of good thing I could say is the animation was good bringing animation to the human world.",
      "total_reactions": 1,
      "user": "Viper8787"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2015
      },
      "score": 3,
      "text": "If you want to lower your kids' IQ, then look no further... this is the perfect film for you. Bad singing, bad characters, bad jokes, bad script... this is just like Alvin and the Chipmunks (and that isn't saying much!)",
      "total_reactions": 1,
      "user": "YellowKirby"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2015
      },
      "score": 2,
      "text": "Another Alvin and the Chipmunks type of movie only with more annoying smurfs that'll cause a wreck on your ears. Grab your equipment and enjoy the movie.",
      "total_reactions": 1,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2011
      },
      "score": 1,
      "text": "This movie is a monument to everything that's wrong about our society. It uses celebrity clout (Katy Perry, I'm looking at you) to sell tickets instead of actually putting work into the things that matter in a film like clever jokes and character development. Instead, a joke that featured heavily in the film was the - take a word and replace it with 'smurf' - gag which made me want to gouge my eyes out with a rusty spoon. Sure, it was a big part of the TV show as well, but we as a culture have moved on from that kind of entertainment. Overall, this movie met my expectations - very low quality flick produced solely to entertain little kids and give stressed parents a break from their little demons.",
      "total_reactions": 10,
      "user": "GregTehBunny"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2011
      },
      "score": 2,
      "text": "I know the film was going to be dumb but I didn't know it was going to be stupider then Garfield and the Chipmunks combined. Its lame its horrible and the amount of references to the word smurf is just annoying. It's smurftarded!!!",
      "total_reactions": 8,
      "user": "filmtrashreview"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 1,
      "text": "this movie was sooooooooooooooooooo bad, i was annoyed throughout the whole thing. Their was just nothing to like, the smurfs were annoying most of the time, the actors are horrible and Gargamel looks like a serious pedophile. I like the song for some reason, i have no idea why, but this movie was BAD. Annoying, stupid, and pointless. 1/10",
      "total_reactions": 4,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2011
      },
      "score": 0,
      "text": "This was the worst movie I've seen since... ever. I've seen better movies on disney channel. I mean, even for kids it's mediocre at best. The plot line was so stupid. The only thing that kept the movie from falling apart was the decent actors, and the cute little blue people. There isn't even any comedy at all. Nothing in this movie would appeal to the parents being forced to watch it. If you desire to see a movie that will help you have a wonderful nap, the smurfs is the right choice for you! Plus, the villain lokked like a creeper and gave me a severe migraine.",
      "total_reactions": 4,
      "user": "insidiousis"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2011
      },
      "score": 1,
      "text": "Why. Just why is all I really have to say. The last time these guys were good was back in the 70s and 80s. There is no point in resurrecting these characters and then just completely ruin what made the old cartoon great.",
      "total_reactions": 7,
      "user": "GeneralBlob"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2012
      },
      "score": 3,
      "text": "Keeping in mind that this film is mainly catering to a younger audience, I gave the film a 3. In reality, it deserves a zero. And that statement isn't even true - it's geared at the actually older audiences who actually watched The Smurfs as kids, since that's a very very old cartoon and today's generations probably don't even know them. Anyway, the film is just awful. There is nothing positive about it. It uses pathetic acting (mainly Gargamel and Sofia Vergara who is playing Gloria from \"Modern Family\" basically - or is she just playing Sofia Vergara?), horrible screenplay - the dialogue is pathetic - and it is just not very funny. There is something to be said about a film in which a character makes fun of \"how annoying\" the theme song is. The sad thing is - the song is very annoying (at least in the rendition in the film), as is the whole picture. As I said, I'd give it a zero, but realising that kids films are usually stupid as it is, I gave it a 3. Avoid it if you can, for your own good.",
      "total_reactions": 3,
      "user": "smijatov"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 2,
      "text": "Hot on the trail of the Smurfs, the wizard has no time for introspection, especially in such a faraway land as New York City. He almost had them, but once again, the little blue creatures were able to outsmart their age-old enemy, escaping this time in \"a mechanical wagon\"(taxi), by the seat of their white pants. For the moment, while Gargamel figures out the logistics of corralling his most hated nemeses, the wizened old necromancer can bide some time, thanks to the fortuitous hairball that Azarel coughs up. Entangled in the cat's mucus, to the wizard's chagrin, are strands of Smurfette's hair, the color of which is not what Gargamel had selected for the girl's coif the day that he created her. In \"The Smurfette\", an origin story of the patriarchal village's only female member(an episode from the NBC animate series \"The Smurfs\"), we learn that Smurfette started out as a brunette, a Jew, just like her father, who resembles a caricature born out of German propaganda, the bogeyman that Goethke makes the Judaic people out to be, for the benefit of a roomful of terrified Hitler youths, in \"Europa, Europa\", by describing the Hebrew people as having a \"high forehead\", \"shifty eyes\", and an \"apelike walk\", characteristics that aptly describe Gargamel's somewhat grotesque figure. In \"The Smurfette\", the wizard makes \"exaggerated gestures\", going so far as \"waving his hands around in excitement\" over the \"Blue Bride of Gargamel,\" giving credence to Goethke's lies about the persecuted people whom Salomon Perel, known to his Nazi teacher and peers as \"Jupp Peters\", actually descends from, in the 1990 film about the arbitrary nature of identity, and survival during the Holocaust. \"Garbage Smell\"(referred as such in the movie) is the imaginary Jew who \"leaps at your throat\", which Goethke, on bended knee, demonstrates by squeezing a student's neck, seated at his desk, the resulting consequence of what happens \"the minute your back is turned\". Goethke, the master of spurious impersonations, in that moment, is a forerunner to Gargamel, a live-action cartoon figure made real through agitprop rhetoric and hateful hate. In \"The Smurfs\", Gargamel finds himself in a city where he wouldn't be touched by self-loathing, since back home, there's not another Jew to be found in the forest, whereas in the \"Big Apple\"(while creating Smurfette, he describes her as being \"three apples high\"), the lonely wizard, for the first time in his life, would be among his own kind, because down deep inside, he wants to be a Smurf(read: Aryan), too. \"The Smurfette\" is telling. From a blue lump of clay, the Smurf alchemy that Gargamel performs is indicative of the wizard's deep inferiority complex at the hands of Papa Smurf, who has the cult of personality to rule 99, whereas his autocratic influence holds sway over a single mangy cat. Broken down at the elemental level, Smurfette is made out of \"sugar and spice(but nothing nice)\", \"a dram of crocodile tears\", \"half a packet of lies\", and \"the hardest stone for a heart\", an ingredient list that seems to have been written out by an Aryan. To Gargamel, the Smurfette is a sort of wish-fulfillment; he gets to live vicariously through her, because being blue is what he most wishes for. In \"Europa, Europa\", Goethke considers the Nordic race as the gems of the earth, championing light hair and blue eyes as being \"the most glowing example of creation\". Likewise, Papa Smurf, as a result of sharing the same Nazi ideology, transforms the slightly dowdy, black-haired Smurfette into a terrifying vision of Aryan perfection, introducing the finished produced as being \"new and improved\", meaning that she is blonde and Nordic-looking. Salomon, in his effort to be more Aryan-like, reattaches the foreskin to his circumcised penis. Presumed to be East Baltic, \"Jupp\" is barely Aryan as is, therefore, barely human, similar to how Smurfette's new family of blue Aryan youth considers her to be barely a Smurf, due to the girl's naturally dark hair. But for survival's sake, she seduces her blue enemy by acting the part of the coquette, just like Charlotte Rampling in \"The Night Porter, where the concentration camper sings a song made famous by Marlene Dietrich(star of \"The Blue Angel\"), while dancing topless with Nazi accouterments. Since blue is white in the Enchanted Forest, the blue moon ad that Patrick Winslow creates and Odilie approves for her cosmetics company, becomes an accidental endorsement for Aryan superiority, or rather, blue superiority, without their knowledge. Papa Smurf needs Gargamel; the totalitarian needs the wizard in order to keep himself in power. In all likelihood, he created the Jewish bogeyman, similar to how the elders in \"The Village\" invented the myth of the monster in the woods as a scare tactic against their people leaving. Papa needs his minions. Those smurfberries aren't going to pick themselves.",
      "total_reactions": 2,
      "user": "Shiira"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2011
      },
      "score": 2,
      "text": "One of the worst movies I've seen, and not a good children's movie. Please, for the love of god America, stop going to see **** movies so that they'll stop being made.",
      "total_reactions": 2,
      "user": "wordy_actions"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "The smurfs had an incredible talented cast and voice cast, who give fantastic performances, but the childish humor is so childish it ruins it. Even if it does have some clever jokes here and there.  I give this film a 58% of a good movie.",
      "total_reactions": 6,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2011
      },
      "score": 7,
      "text": "This movie was so cute! The little blue Smurfs are hilarious and adorable. I love Smurfette. I recomend this movie as a movie to see if you have kids that enjoy cute characters and a good villain. This is a great family movie!",
      "total_reactions": 7,
      "user": "bobjoe914"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Don't let my profile name fool you even though i'm a big smurfs fan but this movie are pretty good.",
      "total_reactions": 4,
      "user": "Good-Smurf"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "What the Smurf!  The critics have really failed to appreciate all the subtle humor in this great film.  There is the Smurf family tale and the human family thread spinning through it that gives it depth.  I thoroughly enjoyed the setting in NYC as it takes the absurdity of \"little blue men,\"  puts it in your everyday life, and validates it.  Who wouldn't feel good after leaving the theatre.",
      "total_reactions": 6,
      "user": "Disconcerted"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "This movie was really really good, it was like Alvin and the chipmunks but in this movie it is Smurf in it :). but i reccomend this movie to everyone because it was funny and many action in it.. It is good that they did this movie with Smurfs i want a Second :D",
      "total_reactions": 9,
      "user": "MrDennis94"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "When I first heard about The Smurfs I wasn't looking forward to it, I've never watched the show and most movies like this turn out crappy, but I was surprised to find that this is a funny and enjoyable family movie that will rolling on the floor, the characters are really likable and the whole movie just has some sort of unique charm to it, it can be predictable at times, but that never really hindered the experience, so in closing if your looking for a good family movie, or have fond memories of The Smurfs in the past, then I do recommend watching, it's surprisingly great.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "Ok, i just want to get one thing clear before you judge me: i have only seen a couple episodes of the Smurfs. Acknowledging that, i just want to say that it wasn't the best movie, and it wasn't a great movie. BUT! It beat my expectations by a good deal. It isn't a kids movie!!!! Don't say that this is a little kids movie and just not see it at all! Now, if you don't like the smurfs, that's fine. But don't judge a book by it's cover!",
      "total_reactions": 5,
      "user": "Ironmonger"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "It's hard to screw up voice acting but the smurfs did it. This film's dialogue is garbage and so is the acting. However I did find the movie to be slightly entertaining because some of the humor was quite witty and smart. All in all the director failed but the screenwriter saved him.",
      "total_reactions": 1,
      "user": "cabrita"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "...The new story goes something like this.  The Smurfâ",
      "total_reactions": 2,
      "user": "Skipnappan"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2011
      },
      "score": 6,
      "text": "this movie will do a decent home entertainment business.  good theatrical opening assures that there will be a number of people who rent the dvd and watch it on television.  also likely to have a decent international debut.",
      "total_reactions": 5,
      "user": "Felix77"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "hhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh",
      "total_reactions": 4,
      "user": "beatles1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "The Smurfs is a simple that offers you a nice good entertainment with pure cuteness .Compering with films like Alvin and the Chipmunks films , Hop and other films The Smurfs is one of the best entry in this genre(Live action+CGI Family)  . Its not a comedy film that all expected but its an amazing family film . The animation was so cute and amazing . The \"Cat\" was so funny, Neil & Jayma was awesome together . The story is the one who made this film down . If only the would work on the story it would be super . & this is what i am hoping for the sequel . & yeah , i am really excited for the sequel . Hoping that they will work on the story .",
      "total_reactions": 1,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "this is a great movie which shows how animation has change throughout the years compared when the smurfs first started i rember watching the smurfs when i was a child brainy was defindaly my favorite becuase he was the smarty pants",
      "total_reactions": 2,
      "user": "movielover318"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "I liked the movie! he's nice to relive the days of the smurfs, I did not watch the drawing I only have 13 years had already heard and liked and I was pretty excited to watch the movie it is fun for children but more a short film to''family ''",
      "total_reactions": 1,
      "user": "pedrohtd"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2011
      },
      "score": 4,
      "text": "I feel Hollywood stole my childhood ripped in open and filled it with promises of fame and glory, they have turned the Smurfs into little cam whores and mutilated a once great t.v show for kids beside they can never beat the best Smurf film ever........AVATAR (points for camera work, and effects)",
      "total_reactions": 1,
      "user": "Alphajames"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "I really really like this movie!!! Obviously, it is one of the best mixed films (3D animation plus actors)! Story, graphics, idea of subject - everything is so harmony and interesting, both for kids and grown-ups! So, thank You, creators, for making such good movies for us!!!",
      "total_reactions": 3,
      "user": "Estatta"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "This is my favorite movie of the year, only because it surprised me in the way that it kept my attention all the way through. And it wasn't blue people racist.",
      "total_reactions": 3,
      "user": "nader03isdaman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "The Smurfs first movie is enjoyable for the younger audiences, though most adults will think this is a complete waste of time. I got to give the film some credit that they at least tried to make this movie heartwarming and fun. The Smurfs universe looks awesome, though you only see it for less than 15 minutes, while everything else is in New York City. There were many useless scenes, really corny humour and the ending was all cut and paste that ended too quickly. The only thing I liked about The Smurfs was Gargamel (played by Hank Azaria) and Azrael (voiced by Frank Welker). Those two practically got me entertained than the rest of the cast, even though some dumb and repetitive jokes felt pretty forced from those villains. The Smurfs is a film I will definitely skip. It's bad, but not extremely terrible.",
      "total_reactions": 1,
      "user": "TipsyMcBee"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "I Really Enjoyed This Movie! Its Great For Adults And The Whole Family!",
      "total_reactions": 2,
      "user": "GagaForGhibli"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "I was born 10 years after the TV show finished and I watched this movie knowing about Papa Smurf and Smurfette, but nothing else. There were a few parts that were strictly for people half my age, but I really enjoyed this, mostly for the fun of watching the animation. The Smurfs are all adorable, even Grouchy. They look pretty real, and really have spot-on voices, especially Katy Perry as Smurfette. The story is familiar but I'd prefer it over an adventure with Gargamel as the only human. I also liked the 2 Scooby-Doo live action films dircted by Raja Gosmell, and I really think he really knows what the target audience wants in a cartoon adaptation.",
      "total_reactions": 1,
      "user": "InverseCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 4,
      "text": "its been a while since i saw smurfs . here's what  i half to see smurfs comedy is way bad but is kinda cute . how could children like this ?",
      "total_reactions": 1,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2015
      },
      "score": 4,
      "text": "Horrible dumb movie with lame jokes that are so awful that children were not laughing at them!! kids laugh at everything! also the film took fun source material that is set in a magical land but instead chuck them in new york -_-",
      "total_reactions": 1,
      "user": "TheDude-"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2015
      },
      "score": 4,
      "text": "What remains of \" The Smurfs \" was only contempt critical of experts and audience , which is the reason for half the fun movie , but the other half lost rhythm , but excels in CGI Smurfs blue left but hatred.",
      "total_reactions": 1,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2015
      },
      "score": 5,
      "text": "It was all right. Really, the saving graces are Jonathan Winters and Hank Azaria's performances. The worst part is that song... It's played over and over and it gets REALLY annoying. Watch it if you like this sort of thing but if you can't tolerate tiny voices constantly singing \"lalalalalala\" then stay the smurfing smurf away from this.",
      "total_reactions": 1,
      "user": "DanBurrito"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2016
      },
      "score": 0,
      "text": "Some movies are not meant to be meant. Simply too too bad, will leave a bad taste in mouth. Creating a nightmare with your favorite childhood cartoon.",
      "total_reactions": 0,
      "user": "nafees"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2012
      },
      "score": 3,
      "text": "That movie is awful, it's humor isn't funny and the characters are really annoying. Smurfs were cool once, but their time is over, to be clear there were only two reasons, why I've watched it: Neil Patrick Harris and Neil Patrick Harris, only because of him, I'm giving this film 3 of 10, cause if there would be no Neil, I would give it 1 of 10",
      "total_reactions": 0,
      "user": "SuitUp1975"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "Aunque no sea una gran pelicula visualmente es perfecta. Es divertido ver a los pitufos de toda la vida tan reales interaccionando con nuestra realidad. Bello el pueblo Pitufo. No desmerecen los personajes humanos. Y bien definidos los Pitufos elegidos.",
      "total_reactions": 0,
      "user": "jordi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "The movie wasn't all that bad. but i think the story should have taken place in their own world. instead of new york. but what the h- smurf",
      "total_reactions": 0,
      "user": "EricHarmon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "The characters are very well done by computer, but what could have been a great movie, is a copy of 'Enchanted'.",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "Cool, fast and family, this is a summary of Smurfs.",
      "total_reactions": 0,
      "user": "BrunoAD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2016
      },
      "score": 5,
      "text": "\"The Smurfs\" is everything you would expect it to be: a CGI/live-action hybrid with a huge all-star cast that is admitted well-acted and has a few funny moments that help it ultimately equate to harmless filmmaking that is clearly intended for young children. Whether or not all of this is a good thing depends on if that is what you want: if you're a longtime \"Smurfs\" fan hoping for some super-brilliant film based on the iconic characters, you'll be pretty disappointed. However, if you're looking for some harmless, family-friendly fun, \"The Smurfs\" should be decent enough to leave you walking away satisfied. Regardless of your expectations, just don't expect it to be the most brilliant piece of cinema you'll ever see. You can do worse, but you can also do better.",
      "total_reactions": 0,
      "user": "FreedomFighters"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2016
      },
      "score": 1,
      "text": "Was this movie really necessary? I mean this is just clearly another excuse to sell product placement. The story is terrible with it just trying to be a stupid mindless kids film. The characters are undeveloped and interactions with them are all bland. And it's humor is just flat. I never liked the original cartoon, but this is by far worse.",
      "total_reactions": 0,
      "user": "gameguardian21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2016
      },
      "score": 2,
      "text": "This movie is not quite bad as i thought it was going to be however it's not a good family movie by any means. You can't help but feel bad for these actors because they tried so hard for this movie to be good. In fact it's like your given a lousy script but your acting is fairly well done they almost wanted to hide the horribleness of the script. Garagamel was way more evil than bumbling in this movie which i appreciate and neil patrick harris put on a fine performance and the actor voicing papa smurf was better than the rest of the voice cast for the smurfs. Kids will be delighted but adults will be less than thrilled. This movie is borderline mediocre. It's not horrible it's just not very good either.",
      "total_reactions": 0,
      "user": "nahtan1244"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2016
      },
      "score": 5,
      "text": "The smurfs is some kind of predictable, color and suspense-free and uses unremarkable characters with a boring sotry-telling for try to remake the classic infant series that used to entertain children in a great form, that now is vanished, apparently. But, at the end, it could offer a familiar message that some kinds of viewers would enjoy.",
      "total_reactions": 0,
      "user": "Futuredirector"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2016
      },
      "score": 2,
      "text": "Ugh, this movie was lame. Cheesy special effects, bad voice acting, bad plot, misrepresentation of the characters, It makes the TV show look better. I should stop wasting my money on this film.",
      "total_reactions": 0,
      "user": "superbat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2016
      },
      "score": 7,
      "text": "Don't let my profile name fool you even though i'm a big smurfs fan but this movie are pretty good.",
      "total_reactions": 0,
      "user": "SimpsonFans"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2016
      },
      "score": 10,
      "text": "really this movie is based on a famous and successful series, which embodied in this movie is just a reflection of what the series was. Good overall, good actuació and good production.",
      "total_reactions": 0,
      "user": "camiloalegue"
    }
  ]
}