{
  "mc_avg_user_score": 8.8,
  "mc_metascore": 55,
  "mc_mixed_rating_frequency": 19,
  "mc_movie_name": "The Brothers Bloom",
  "mc_negative_rating_frequency": 8,
  "mc_positive_rating_frequency": 144,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2013
      },
      "score": 4,
      "text": "So your watching a movie and it is very character and dialogue driven. Then you suddenly realize that your favorite character in the film hasn't said a word. I would say chances are your not enjoying the film all that much. I sought out The Brothers Bloom after loving Johnson's Looper last year, and liking Brick quite well after that. Hopefully The Brothers Bloom will be a little remembered blip on the directors resume as his career continues. It is the story of two orphaned brothers who at an early age develop a knack for the con.",
      "total_reactions": 1,
      "user": "seancriswell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "Loved the story line, the directing, writing, photography and the editing.  Gave it a 9 score because it genuinely held my interest.  Adrian Brody and Rachel Weisz  had real charisma and Mark Ruffalo was a fantastic foil.  Great Locations too.  What's not to like?",
      "total_reactions": 0,
      "user": "justnother1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "The average critic review of 55 is an absolute joke for what is a fantastic film, with a delicate plot line which is serious but huge amounts of fun, the film is directed beautifully and has fabulous performances from a very talented cast. Definitely worth watching, several times.",
      "total_reactions": 0,
      "user": "MrSteer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "AMAZING i love this movie i dont know why this movie got any reviews below a 9, great story great actors and it has an amazing plot. my favorite movie by far. a must see",
      "total_reactions": 0,
      "user": "tweet"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "It has action, cheerful comedy, touching romance, tricky capers which are never what they appear to be, and a style of its own that makes the film a fantastic original that certainly deserves more acclaim than it has received.",
      "total_reactions": 0,
      "user": "Critic2012"
    }
  ]
}