{
  "mc_avg_user_score": 5.3,
  "mc_metascore": 41,
  "mc_mixed_rating_frequency": 166,
  "mc_movie_name": "The Purge",
  "mc_negative_rating_frequency": 117,
  "mc_positive_rating_frequency": 151,
  "mc_pro_critic_reviews": [
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 83,
      "summary": "The Purge manages to be smart, scary, and subversive."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 70,
      "summary": "As in so many Hollywood spectacles, the message and medium are at hopeless odds... Still, the set-up is arresting, the domestic scenes well observed and acted, and the payoffs involving that Roomba toy excellent. Also, a late-film twist isn't a surprise, exactly, but it is delicious."
    },
    {
      "critic": "Matt Patches",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2013
      },
      "score": 68,
      "summary": "There’s gold in the premise of “The Purge” and its dismissal of subtlety. But like the residents of its world, when given the opportunity, it drops restraint and goes for blood."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2013
      },
      "score": 67,
      "summary": "The Purge clearly has a lot on its mind, but it never really manages to express it."
    },
    {
      "critic": "Kevin C. Johnson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 63,
      "summary": "Good but not-good-enough schlocker."
    },
    {
      "critic": "Ian Buckwalter",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 60,
      "summary": "The Purge is mostly a genre picture trying to layer on some prestige by way of social commentary. The latter falls flat; the film is actually stronger when it just goes for our baser instincts."
    },
    {
      "critic": "Neil Smith",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 60,
      "summary": "James DeMonaco’s blood-splattered thriller begins well before expiring slowly from multiple improbabilities."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 50,
      "summary": "So, fans, gear up for rock-em-sock-em action, yet don’t be disappointed if much of the goonery seems a bit tepid and, dare I say, staged."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 50,
      "summary": "The people of 2022 may “release the beast” by slaughtering their fellow Americans. In 2013, that’s still what we go to the movies for."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 50,
      "summary": "Makes its point ham-fistedly and then devolves into a blood-spattered slasher movie. It also unashamedly cribs from more disturbing films like \"Straw Dogs,\" \"Funny Games\" and \"A Clockwork Orange.\""
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 50,
      "summary": "DeMonaco shows a sure hand at building tension. Too bad the film devolves into a series of home-invasion clichés. The Purge was almost on to something."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 50,
      "summary": "After a wickedly promising start, this pointed political satire quickly deteriorates into a fairly routine, if sporadically quite effective, home-invasion thriller."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2013
      },
      "score": 50,
      "summary": "After establishing this interesting premise, writer/director James DeMonaco only scratches the surface of its implications before devolving into a creepy roundelay of murders and deaths averted."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2013
      },
      "score": 50,
      "summary": "The result is inchoate: not involving enough to work as a thriller, and too self-defeating to mean anything."
    },
    {
      "critic": "Leslie Felperin",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 50,
      "summary": "The film’s thudding shocks and predictability dull its edge."
    },
    {
      "critic": "Neil Young",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2013
      },
      "score": 50,
      "summary": "What should be a clammy exercise in claustrophobic, queasy tension becomes, in the hands of writer/director James DeMonaco, an underpowered compendium of over-familiar scare tactics and sledgehammer-subtle social satire."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 42,
      "summary": "So here I am, trying to like The Purge because I’m drawn to its simple and horrific premise, and it’s treating me (and you) as if we have the IQs of lawn ornaments."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 40,
      "summary": "The message just gets louder and louder, cruder and cruder, which is too bad because Mr. DeMonaco knows how to set a stage."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 40,
      "summary": "The filmmakers are too much in love with their made-up holiday to observe it to the fullest."
    },
    {
      "critic": "Mike McCahill",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "The film doesn't develop its one good idea so much as stumble around in the dark with it for 85 minutes, crashing noisily into the furniture."
    },
    {
      "critic": "Nigel Floyd",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "The film's would-be subversive ideas about the kneejerk appeal of social violence get lost in the mix."
    },
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "This movie starts from a premise so sociologically batty it’s hard to take any of its subsequent terrors seriously, which means tension doesn’t so much fly out the window as fail to even get up the driveway."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 38,
      "summary": "The problem with high concepts like this is cooking up a story and characters to go along with it."
    },
    {
      "critic": "Simon Abrams",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 38,
      "summary": "Instead of being a creepy B-movie about the necessity of suppressing one's animalistic urges, The Purge is just an uninspired film."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2013
      },
      "score": 38,
      "summary": "Mostly, it’s just a clumsy lecture about who we’re becoming, haves vs have-nots, with the haves armed to the teeth."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2013
      },
      "score": 38,
      "summary": "A rote home-invasion thriller afraid to be seen as just another rote home-invasion thriller, the film turgidly grasps for profundity by framing bloodlust as patriotic duty."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 30,
      "summary": "A routine home invasion movie more interested in B-horror tropes and bloodletting than a thought-provoking look at \"Hunger Games\"-ish class warfare."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 25,
      "summary": "As a nauseating variation on the home-invasion theme, The Purge is as sickening as it is dreary."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 25,
      "summary": "This is quite possibly the most moronic motion picture I have seen thus far in 2013 and that's saying a lot."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 25,
      "summary": "The Purge isn’t just stupid; it’s also pretentious and often makes no sense."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 20,
      "summary": "The movie even makes night-vision-goggle scares more irksome, a rare feat."
    },
    {
      "critic": "Kerry Lengel",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 20,
      "summary": "The Purge is one of those unimaginative horror flicks that depend on skreeky music and sudden appearances to startle, but never actually frighten, the audience. The characters are undeveloped, the twists clumsily telegraphed and unsurprising."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "Let me preface this by saying my lord did this movie actually have an original, interesting story. When I saw the first preview for this I thought it had potential. Okay, got that out of the way, now, on to the point.",
      "total_reactions": 4,
      "user": "ClayMerritt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "That this movie isn't universally ridiculed is a sign of how bad things have gotten in America.",
      "total_reactions": 3,
      "user": "MelancholicAlc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 0,
      "text": "The Purge is simply awful. Awful concept, unbelievable  awful writing. The son in this movie is an imbecile. He essentially got his father killed by letting a homeless man in their house. The said homeless man lives at the end. How he lives I don't know. He walked away at the end after bleeding out for about 12 straight hours. Yeah ok.....The father creates top of the line security systems, yet says \"The security systems are not made for events like this\"....Dude, you live in a society where every year people are allowed to go on killing sprees, so why would you say something so preposterous.....The neighbors at the end wanted the family dead, until the massive blood losing homeless man saves them, then the mother lets the neighbors go?.....Why  so she can tell stories in the produce aisle? Wait for the neighbors to try and kill them next year?...Possibly the worse written plot ever...For such a great concept, so much more could have been done. A waste of a great plot.",
      "total_reactions": 2,
      "user": "titus619"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "The idea of the movie is good,12 hours a year crime is legal, I think it had its inspiration from the Episode 21 Season 1 Start Trek series \"The Return of the Archons\" where people  of Beta III \"let loose\" at the striking of \"The Red Hour\" (at 6:00pm), starting \"Festival\": a period of violence, destruction and sexual aggressiveness.",
      "total_reactions": 2,
      "user": "OctavianGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "I watched the Purge this weekend and I gotta say I wasn't even in the least bit impressed. Before I continue, I have to say that this is the dumbest concept for a movie ever! So let me get this straight, in this movie, people are contempt with being able to commit a crime only on one day an that just basically stops crime? What about serial killers? Beyond that apparently, everyone just kinda excepted this Idea as there were no talks of people standing against the purging. To make matters worse this is in 2022 and according to the movie it started in 2017 just five years later and everyone celebrates a purging like it's the Super Bowl. Hell, they literally have a Purge TV. In other words I already Hate these people right off the bat. .By the way another huge problem with the concept is that it isn't explained how it works. During the broadcast you are allowed to use weapons except for class 5 and above. So, no rocket launchers? You also can't hurt Class 10 Government officials I think. So Don't kill the president and his cabinet? Also medical aid/police stations/fire stations are suspended. So what happens if you have a heart attack? What stops you from killing all cops? That is the main problem with the concept it doesn't go into details with the rules. But I digress. The next problem is the movie starts a pointless plot point that goes nowhere. We spend about 20 minutes on the boyfriend explaining that he would talk to the girl's father, only to be axed early and almost completely forgotten. We could use this time to explain the rules and reason for the purge, but nope, completely wasted.Something else annoying is this movie isn't scary in the least, but tries with a couple hundred jump scares. JUMP SCARES ARE NOT SCARY! There are alot of annoying things that appear in the movie so as to say  this is a plot point, you stupid monkey\". Like when you see a burnt up baby toy with wheels and a camera. Geez, I wonder if this is important. The reason for this is that one of the main producers is Platinum Dunes. If you don't know what that is, does Micheal Bay ring a bell? Nuff Said. In the story the family locks themselves in there house for protection against the aforementioned Purge. BTW is it me or is the only reason the purge exist in this movie, an excuse for the plot to happen. It is just there so the home invasion movie can happen for a contrived reason. When the son lets a wounded homeless man in his house cause he's a dumb ass. The man is followed by a gang of youths who are trying to kill him. To bring the movies message deeper they make the youths from an affluent neighborhood and mostly white while making the man Black, homeless and a veteran. This is a cheap way to gain sympathy for the character, that really isn't needed. The youths tell them that they need to find the man, so they kill him just for being poor. If they don't, they will be killed with him. At this point the movie becomes a hunting movie with nothing happening until he is found and we are shown why we shouldn't like the characters in the movie. however the family for no reason completely out of nowhere decide to save the man and fight. At this point it becomes a home invasion movie as the youths move in to kill them. Yes it is like you walked into a different movie. A bunch of people die and there is a trifecta of Deus Ex Machinas. I won't spoil the ending except to say that the movie ends without being climactic and just comes off strange yet hilarious. And what was the point there was no change nothing was improve, making this movie COMPLETELY POINTLESS! It is sad cause this movie had great actors in it(except for the main villain), but they had nothing to work with. This movie is a 4/10 to me, it's just meh. You'll forget this movie after watching it. Hell I had to look up some thing to write this review. A stupid plot, pointless filler, uneven pace, and generally crap atmosphere. I might be being nice but I am going to leave it at that.",
      "total_reactions": 2,
      "user": "LogicBomb"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "Bad movie, the story is just  The ending is just crap. rtgdrgpdrkgdtgfoijtohoixfhjokviidryhiduhophukthiothufbjhutibtuyhtgkjhtimounstjunsoujynstiouyjtosuynioioioioioioiotujsouysroiynsotiyu",
      "total_reactions": 2,
      "user": "HighQualityDirt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "I was excited to see this movie.  I thought the previews for the movie were great.  I was not disappointed by this movie.  I was worried by some of the reviews that I had seen before going to the movie--I almost decided not to go because of the reviews--but the movie was very good.  I enjoyed The Purge.",
      "total_reactions": 1,
      "user": "Nachtkonig"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "Dumb, dumb, dumb that defines The Purge.  Terrible script and yes a terrible premise.  I know some think the premise is interesting, but the more you think about it the more it's just stupid.  I mean who would want to live in a country where people can legally murder and as for unemployment being at 1%, how.  Why would anyone want to go to work and potentially anger the wrong person who would then just kill you on The Purge.  Ethan Hawke is fine, but the kids are stupid and the invaders are stupid.  Not scary, not thrilling, not a piece about society.  Just plain DUMB!!!",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "magine a world where crime is basically non-existent and almost everyone has a job and is doing well.  Imagine this utopia is in the US in the year 2022.  Thanks to a night held once a year called The Purge, this is all somehow possible.  Any crime is legal for a night every year until morning comes.  That is the basic setting for the movie.",
      "total_reactions": 1,
      "user": "DiskMagazine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 1,
      "text": "I have just a few things to say.  First off, if this ever happens to Any of you,  THIS IS NOT the way to go about saving your family. Second of all, poor script. Lastly I would rather watch 5 monkeys throw sh°t on each other.",
      "total_reactions": 1,
      "user": "limpnoodle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "I had read consistent bad reviews and seen low ratings for this movie which led my wife and I to stray away from spending good money on seeing this in theaters. However, after renting this I can easily say it was worth the $5.00 spent. The action scenes were executed well and for the most part, I did like the characters enough to actually care what happened to them.",
      "total_reactions": 1,
      "user": "danielscotth"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2013
      },
      "score": 0,
      "text": "I signed up just to let people know how terrible this movie is, the idea of there being a single day in the year (which turns out to be only 12 hours starting from 7pm...  in which people are legally allowed to commit heinous crimes, but higher level govt. employees are for some reason exempt, is so stupid, if you are drawn to a plot as ridiculous as this then maybe you need to be purged.",
      "total_reactions": 1,
      "user": "LordFigTree"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2014
      },
      "score": 3,
      "text": "3 points for the concept, which was great and left me anticipating the release. Sooooo disappointed, wanted to leave before it ended. Everybody was so very stupid in the story, that it was all so predictable. This could have been a great movie.",
      "total_reactions": 1,
      "user": "Jaxi18"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "text": "Watch this movie. Watch this movie if you like the feeling of anger pulsing through your bloodstream because you gave Ethan Hawke another chance. Because you thought the plot sounded cool, because you wanted to see rich people die.",
      "total_reactions": 1,
      "user": "Wantsmoneyback"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "This movie had an interesting and original story, but it doesn't have all the elements to work together. The movie doesn't really have the scary feel its suppose to have. Plus, the people in the mask only express their  how psychotic they really are. They don't deliver any purpose. If it was more like the Joker in \"The Dark Knight\", then they would actually make this movie work. But honestly, these actors weren't made for their roles. I wish I had more to say, but that's all I have to say about this extremely short \"psychological\" movie. Overall, it doesn't completely work together.",
      "total_reactions": 6,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "The problem is that The Purge has a powerful plot and ideas that are never used before, what happens here is that it is turned into a tired, cliché ridden, low budget slasher horror film, that could have been great and thought provoking. Lost opportunity.",
      "total_reactions": 6,
      "user": "MovieGoer14"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "There’s something powerful in the way horror movies and thrillers are able to tap into the cultural fears of a given moment. Whether it’s the sexual politics of the 1980s slasher movie, or the torture porn explosion in the wake of the US wars in Iraq and Afghanistan, no other genre is so adept at saying, “Here’s what's on our minds right now, and it’s scaring the hell out of us.”",
      "total_reactions": 12,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "A decent number of thrill scenes still can't make up for a dull beggining and end. Too much on explaining why people purge and not enough purging. We were sold on a horror movie and what we got was a force feed on why American society has gone to crap and to make up for it we get 15 minutes of good thrills. Also I dont think I have ever been so annoyed by so many characters between the stupid children, the villians and the number of rediculous actions the family takes. Really there are killers coming intot he house but im going to decide to run away from my family because im upset at dad. SO STUPID!",
      "total_reactions": 4,
      "user": "WhySoSerious54"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "When Ethan Hawke showed up in last years legitimately scary Sinister I was happy to see the actor branch out slightly and give the genre picture a go. I was also glad he paired with the director of one of my other favorite scary movies of the last ten years, The Exorcism of Emily Rose. Upon seeing the first trailers and promotional materials for The Purge though I thought he might have jumped in head first too quickly and began splurging on the kinds of roles in the kinds of movies that might eventually end up in the five dollar bin. While this second trip into scary movie-land is not as intriguing or mysterious as the aforementioned Sinister it has an interesting enough premise to draw people towards it (and the creepy, over exaggerated face masks are always a plus in home invasion thrillers). Director James DeMonaco, who has only directed one previous feature before this, has also composed a script that contains a fair amount of potential in the points it is trying to make and the message it is trying to get across, but unfortunately we never really see any of the gritty realities of this new found way of life. No, instead of diving into that real potential the film could have brought to the experience it instead quickly dissolves into that standard home invasion film where we see every plot twist coming and every supposed scare is as obvious as how this whole thing is going to end up. There were times the movie almost had me fooled, had me thinking it was going to go a different way, but heaven forbid it do such a thing as to dare to make the audience unhappy. This timid nature ultimately results in the most typical conclusion led up to by the least surprising and least effective set of circumstances. Worse than all of this is the fact there are no likable characters here. We don't like our supposed protagonists from the beginning because they've succumbed to this annual event that makes little sense and we don't like their kids or their new enemies because they all make dumb decisions. In the end, there is only one word that comes to mind when I reflect on what this turned out to be: pointless.",
      "total_reactions": 4,
      "user": "VandyPrice"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "What is wrong with people? Purge is exactly what the audience wants. Action,horror,suspense and blood. How people didn't like it? The plot may sound silly and some people may not like it  I accept that) but it is original something that most horror movies nowadays aren't. I also don't understand how critics like The Cabin in the woods which is a  movie and they didn't like the Purge which was a scary intense film. Lena Headey was a big surprise to me as I've only seen here in Game of thrones where she is excellent as \"the bad guy\" and she was even good playing \"the good guy\" and the mother who protects her daughter and son. In overall there is suspense and The Purge it has a good original plot that many people will like and others will not. I like the Purge and I consider it as one of the best horror-thriller movie that I have seen  Thumbs up!",
      "total_reactions": 3,
      "user": "Kiva"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "I really liked the concept up until I saw the movie. So stupid and just as cash grab. What happened to all the great horror movies. So bad. I could barely sit through it in the theater.",
      "total_reactions": 3,
      "user": "MovieMan12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "This movie was extremely mediocre at best. The story was very shallow and dull. The characters were boring and had no development whatsoever and the sound effects were alright. Also, the movie is short, very very short. I would not recommend anyone seeing this. Save your money for something better.",
      "total_reactions": 4,
      "user": "sirxchrish"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "The trailer makes it look like a Funny Games for the 99 percent. (Ugh. That sounded terrible.... forgive me.)  But it's nowhere near as interesting or as diabolical as Funny Games.  And being predictable isn't the worst thing in the world so long as the movie is executed with skill, but this one is very much the former but nowhere near the latter.  Still, Hawke and Heady make it interesting.  The kid from Parenthood is serviceable, but it would have been more interesting if he were actually playing his character from Parenthood.",
      "total_reactions": 2,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "The movie keeps your heart beating from the start to the end. Its takes a ludicrous plot and provides a fairly reasonable and logical explanation that gives an almost surreal feel to the event. There are many… many cliches to in the film and character development is non existent… still a good watch. pretty entertaining.",
      "total_reactions": 2,
      "user": "phatmamasboy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "I can't say that my expectations for this movie were very high at all, but nonetheless I was disappointed. You'll hear everyone, even critics, praise The Purge for the original premise, but it's really a silly concept at its core. The concept of the annual \"purge\" serves best as a symbolic meaning, but in reality, making all crime legal for one day would hardly do anything to improve the overall situation. It is a logistical nightmare and it is never once explained HOW the annual purge improves day-to-day life. I thought the underlying tones of religious oligopoly and the clear discrimination present in society would have been much more interesting to explore. You can't just introduce such a new concept as an annual purge and only dedicate a few scenes to its exposition. A small scale home-intruder thriller does not fit this sort of concept, in my opinion. This also has to do in part with the fact that The Purge is a bad movie front and back, in almost all senses. The acting is unremarkable, although I'm pleased with the limited amount of overacting by the leads. The lead delinquent character was well thought-out and acted, but the writing was awful. Everything has extremely heavy-handed and there was no concept of subtlety with the plot. Events were foreshadowed a scene or two ahead of time, and the pacing was awful. I found myself getting more enjoyment out of the reactions from fellow moviegoers, rather than the film itself. I found that the movie was awkward and each twist seemed more forced than the last. And honestly, I have never been more frustrated at characters' choices than I have during this movie. The best part of the movie was the very beginning, when the stock footage of people killing and being killed during the annual purge is shown. It's truly chilling and helped hash out the world that the average American at the time would be living in. Of course, the rest of the film worked as hard as it could to undo all of this.The Purge is bad enough to be universally recognized as a poorly-made horror flick. Unfortunately, it really isn't bad enough to be worth screening at a Halloween party for good humor. It's too mediocre to be taken seriously, but not bad enough to be remarkable. It was a horrible limbo to be caught in, and I wish that the admittedly interesting concept was taken on at a larger level and scope than the cruddy thriller we got.",
      "total_reactions": 2,
      "user": "JesseH"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "Although The Purge has an interesting and original story/concept, the slow start to the film and the eventual climax leaves you feeling rather underwhelmed.",
      "total_reactions": 2,
      "user": "OnAnarchy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "This movie wasn't spectacular but it sure was intense. Not a real deep plot but good scares and tension. The moral choice that plagued the protagonist and his family was a tough one. The ending and length of the movie were the only things I found wrong with it. Still a good movie I liked it better than the strangers which reminds me of this.",
      "total_reactions": 2,
      "user": "C3realkillah"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Review From www.thereiopinion.com",
      "total_reactions": 2,
      "user": "thereiopinion"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "This movie very predictable, for me anyways. The plot was okay, but the way they executed it could have been much better. This movie actually reminded me of the movie \"The Strangers.\" It had many strong points, but the ending sucked. It was more comical than horrific. I wanted so bad for someone to commit a crime after the 12th hour...",
      "total_reactions": 2,
      "user": "ellrivera"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "This movie, concerns my self with great duplicity. A confusing story line, horrible scenarios, and blood thirsty laws. It was a quick sell, but left a horrible taste in my mouth nearly only 10 minutes of being introduced or as I felt involuntarily robbed of my precious time.",
      "total_reactions": 2,
      "user": "DrSaintG"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "The premise of the movie is a bit far-fetched, and the way it played out was lacking and tacky.",
      "total_reactions": 2,
      "user": "rockstar3225"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "The Purge's premise is wasted here, it doesn't even need to exist. The Purge is just a cheap slasher horror movie and even bad at that. At no point in this film did I get scared, really I was just bored throughout  the  whole movie. Everyone in the movie does a good job but it just wasn't enough. This movie is extremely predictable. Overall I wouldn't recommend watching this movie.",
      "total_reactions": 2,
      "user": "Adudewhoreviews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "I find the movie very entertaining  very suspenseful i loved it  i really just didn't like the ending that much i don't think the dad shoulda died i think he shoulda made it to the end",
      "total_reactions": 2,
      "user": "Jada"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "The only reason I would ever give this more than a 0 is the fact that the actors were decent and the idea was too. Super unrealistic and extremely predictable with ridiculously bloodthirsty characters.. In fact there are only about 5 people in the movie who are not trying to get this \"cleanse\" by killing other random people.",
      "total_reactions": 2,
      "user": "dylanparisi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "this flim is pure  bull ****  tries to take on serious issues but ****s itself and ends focusess on some douche bag getting inthe house .family  get thearten by bad guy they spend 20 minutes **** all .the movie is **** horrible  it was the worst movie ever .  the acting was so awful.  ethen hawke  was the worst actor in the film. the ending  was most awful  i have  ever seen  . this  film is'nt enjoible awful like event horison . it's   the one were you enjoy smashing it awful.",
      "total_reactions": 2,
      "user": "killerkin64"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "In my opinion, The Purge was an.... entertaining movie. I can't deny that it did keep me on edge. To my relief, it wasn't very scary either. It was more interesting and intense. The plot is very original, and it will definitely keep you entertained. Although it was a good movie, it was not great. I cannot stress how idiotic and stupid the family was enough. I found myself constantly realizing how fake the movie was. The actors didn't seem scared enough. Also, they kept making mistakes throughout the movie even though they knew that their lives were on the line!  It was also really annoying how the killers tried to have a sense of humor. The killers seemed psychotic and creepy. The ending was really crazy too. The ending was awkward, funny, idiotic, surprising, and just interesting. On the other hand though, I liked the movie, but I wouldn't spend a lot to see it. Wait for it to come out and get it from the red box. It is very interesting, and even though it might not be your favorite movie, you will have something to enjoy from it.",
      "total_reactions": 5,
      "user": "Sparklytopeka12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2013
      },
      "score": 0,
      "text": "\"There’s something powerful in the way horror movies and thrillers are able to tap into the cultural fears of a given moment. Whether it’s the sexual politics of the 1980s slasher movie, or the torture porn explosion in the wake of the US wars in Iraq and Afghanistan, no other genre is so adept at saying, “Here’s what's on our minds right now, and it’s scaring the hell out of us.” Agree!",
      "total_reactions": 3,
      "user": "GPReS"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "Never, in my all my years of film, have I been more frustrated and physically irritated by characters and their dumb decisions. They struggle to make not only the right choice, but a comprehensible one. When guns start to go off the film is good. Only problem is that's the final 15 minutes of an 85 minute movie. It's not bad, but it wasted its potential.",
      "total_reactions": 3,
      "user": "tropicAces"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "The movie was great. I loved it. I really keeps you on your feet the movie but the movie is very short. But I would recommend seeing it. It's a whole new paradigm. The movie has a bit of that horror feeling and jumps but it won't leave you with nightmares but only the illusion that keeps you wondering...could this ever happen.??",
      "total_reactions": 3,
      "user": "Candy_Lillys"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "This movie is terrible. The story, the background, the whole script is a mess. I believe that this flick is racist to an utter extent, the mere title says it all. The plot has no foundation, it lacks everything that is expected from a thriller, you barely get in touch with each character that englobes the directors message to the expectator. Lacks details that may had placed them on a score of 1. And my review ends with one question to the director, Why do you believe that the poor and the minority in 2022 are the Afro-americans?.",
      "total_reactions": 3,
      "user": "nativeabraham"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "I don't feel that the low user score is warranted. The movie deserves an 8/10 for originality alone. A great concept with some really quality acting, I thoroughly enjoyed this movie which leans more towards the more extreme portions of the human condition but is nonetheless a thoroughly entertaining flick (unless you're a pacifist or bleeding heart liberal) which is certainly worth a watch",
      "total_reactions": 7,
      "user": "Kronos362"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "In my opinion, The Purge is the best home invasion movie ever made. It has such an original and thrilling plot compared to most horror movies these days. I really don't understand why most critics don't like this film. If you want to see this movie, see it and don't listen to the negative reviews because in my opinion they are all wrong. If you want thrills or if you want to be creeped out this is the movie for you. Warning: Spoilers!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! I can't wait until The Purge 2!!!!!!!!!!!!!",
      "total_reactions": 4,
      "user": "mds03"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "The movie is a breathe of fresh air with a new idea which is out of the ordinary for Hollywood now a days and welcomed by the audience. The story moves at a relativity adequate pace without to much being tied down in a romance story that holds a lot of movies in this class. The movie only slows down and even gets lackluster in the end. The stories conclusion is very simple and easily seen coming even minutes into the open. The simple write can draw in those who are new to cinema but those who have seen a few thrillers will not be impressed or shocked by the ending and even disappointed that they chose such a pedestrian reason for such a great stories conclusion.",
      "total_reactions": 4,
      "user": "themonkey16"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Yes, the film was rather predictable but I thought the premise was so clever that it lifted it out of the traditional. A clever societal commentary with some scary moments. Worked for me.",
      "total_reactions": 5,
      "user": "bkattelm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "The future America's in great shape, primarily because one nite a year anything (including murder) is legal. This leads to a \"Straw Dogs\" style home invasion scenario, with Ethan Hawke's family having to defend itself. When this film is working, it's violently gripping, but there are several lags in pacing that also lack suspense. Even with the clever dystopian plot, three of the tight spots rely on the same last-minute rescue. Still, paranoia, brutality and subversive concepts combine for a decent thriller.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "The Purge seemed to have an interesting and original story in the making however as the film gathers pace what unfolds is unfortunately less than impressive as the film loses its way. It's 2022 and America is prospering as a nation reborn. Crime and unemployment is at all time low. This is due to a government initiated programme known as the annual purge. Where in a 12 hour period all crime is legal and emergency services are suspended. The idea is genius and intriguing. The film focuses on the Purge through the Sandin family headed by Ethan Hawke and Lena Headey. They have become wealthy through the introduction of the purge. It had the potential to offer a very unique and fresh take on the horror genre but ultimately unfolds into numbing violence and tired clichés. Very much a missed opportunity and a sad disappointment!",
      "total_reactions": 1,
      "user": "Rosco"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "These reviews are all a little off. I don't think the writers were going for any awards with this one, they just wanted to entertain. You shouldn't expect thoughtful characters or realistic scenarios in a movie about a nation that knowingly disregards crime once yearly. What I expected was suspense, and plenty of situations that would scare me if imagining myself in that scenario. If characters were realistic or made good decisions in any horror movie, the horror would quickly end.",
      "total_reactions": 1,
      "user": "Tstai"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "It's a shame that such an intriguing concept (The idea of the titular 'Purge') is wasted on such a dull plot which follows a dull, unrelatable family defend their home from a group of random strangers, its biggest mistake is giving us no background to the bad guys, it's hard to be intimidated by an antagonist who appears from seemingly nowhere. It also fails in being a thriller, the film just isn't tense. However as previously stated I love the idea of 'The Purge' and a future sequel could potentially be a much better watch. TL:DR; wait for it to come to TV, as mediocre as they come",
      "total_reactions": 1,
      "user": "smk123"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 3,
      "text": "Le film montre ce qu'est l’Amérique avec leur désire de nettoyer la vermine... Le film est vraiment null en particulier les enfants. Je donne 3 mais j'ai voulu donné 0...",
      "total_reactions": 2,
      "user": "W4ZYX"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "The film's run time was a huge blow to the film itself. It was too short. There no room for back story or to even tell the actual story being told during the film. It was simply too fast paced, It ruined the film. As for the plot itself, It was an interesting premise but was poorly executed. The film's length really hurt the plot, I feel they couldn't really develop it enough to make it into a good enough plot because of the short run time. As for the dialogue, It wasn't that good. It was average at best really, Which is sort of disappointing.",
      "total_reactions": 1,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2013
      },
      "score": 1,
      "text": "Making the guy who looks like a rapist play the villain does not make a good movie. His face was a rip off of the joker. The movie sucked. It made me not only want to purge, but slit my own wrists.",
      "total_reactions": 1,
      "user": "longbowtech"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "My favorite part of the movie is when someone says \"Let us due our duties as Americans.\" Once you accept that the entire concept is ludicrous and completely thoughtless, it is entertaining enough to keep your attention.",
      "total_reactions": 1,
      "user": "Trev29"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "This movie, was great. However, don't get me wrong it's rated R for a reason. This movie does have some flaws, as every other does. However, this movie  I believe is really worth your money",
      "total_reactions": 1,
      "user": "Daxtely"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "this movie has an original story and it's well done, but the thing is  that the movie doesn't have anything to do with te trailer, the movie was too short an the end just doesn't have sense, and it doesn't go with the movie, and this movie didn't scared me at all. I just dont recommend it.",
      "total_reactions": 2,
      "user": "santigol"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 3,
      "text": "Lets start with the flaws of the imagined social/economic consequences of the Purge system... Crime rates would drop to 1%? Economy would rise? Why the hell would it? Prostitution, drug dealers, corruption is done on a daily basis. Perverts, abusers would not wait until the government allows them to commit crimes. The purge system would only decrease a minimal amount of crime. Other then that imagine You try to kill your fellow worker, because he/she was not nice with on you workplace...Now imagine you fail, now you can spend the rest of the year feeling hatred toward that person. It is not really productive in a workplace. As I have wrote before criminals who live from crime, would not stop after a purge. Also why would they allow using fire-based weapons during a Purge? (There are some restriction but nothing for arson?) It would cost a lot to build up a city from the ashes right?  The whole thing could use some more thinking to it.... Other than these, the characters were boring and the kid was the dumbest movie character I have seen in a long time. The kid actually wanted to save a stranger more than his own family... The bad guys looked more stupid then threatening in my opinion. Well a generic action thriller.",
      "total_reactions": 1,
      "user": "oliver1h"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "I liked it. The movies premise is ridiculous. For one night a year all laws don't exist so that people don't commit crimes the rest of the year. If you think this is stupid then don't watch this movie. The whole idea is very tongue in cheek but the movie is done with a completely straight face. It is very violent and fast paced so for that reason I found it very entertaining.",
      "total_reactions": 2,
      "user": "McCorpse"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "Extremely disappointing. Cool concept, good acting, poor execution, and terrible story. It seems an impossible task to be frightened by mainstream Hollywood \"thrillers\" unless you completely shut off your brain. It felt like the film was going half-speed in the beginning, doing a fairly decent job of building tension but once the break-in occurred, it all felt horribly rushed. The group of young wanna-be Clockwork Orangesque punks turned into simple shotgun fodder and lost any of the scary edge they built up while waiting outdoors. And by the end, I wished that I got to see what was going on outside of this rich white family's home during the \"Annual Purge\". A far better tale would have been someone trapped alone while anarchy reigned  this felt like a poor rip-off of Panic Room in many ways. Great concept but they could have used a proper story to back it up, which just makes me sad to think about the missed opportunity. I am actually hoping for a sequel that focuses on another aspect of the night.",
      "total_reactions": 1,
      "user": "DisasterpieceMK"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "A good movie that would make a great book series.  The movie did waste a lot of potential and started off rather slow.  It was great watching it in the theater though just to here everyone scream and applause when the action started to get really good at the end.",
      "total_reactions": 2,
      "user": "comiekilla"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "Except for cast & acting this movie is huge disappointment! Having such an interesting setting, \"The Purge\" than transformed to be incredibly ridiculous, story is just nonsensical, some characters behave in absurd way! Conclusion  \"The Purge\" is preposterous piece of filth!!!",
      "total_reactions": 1,
      "user": "PStakhiv"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 2,
      "text": "One of the most predictable, uninspiring films I've seen in a long time.",
      "total_reactions": 1,
      "user": "electricspit"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "From the producers of Paranormal Activity (as is all horror films these days) The Purge tells the story of a near future were crime is at an all time low and unemployment stands at under 1% of the US population, to compensate for one night a year all crime (including murder) is legal for 12 hours allowing society some kind of release.",
      "total_reactions": 2,
      "user": "Danny555to666"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "It's always the black guy...",
      "total_reactions": 1,
      "user": "BlackfuryRises"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "ini merupakan film yang sangat amat buruk, sudah sejak lama saya menantikan pembuatan film ini, tetapi yang terjadi malah jauh dari perkiraan saya ketika melihat film ini, jujur saya sangat sangat kecewa berat sampai sampai tak mau lagi melihat film ini, dan apabila ada yang mempertontonkan di segala media baik itu cetak maupun elektronik, saya tidak akan segan segan untuk memusnahkannya dan menghabisi siapapun yang menyebarkannya dan menyiarkannya, sekian!",
      "total_reactions": 2,
      "user": "Anonymouz"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "This movie was amazing. I thought that is was something new & fresh in the horror/thriller industry. Something different instead of paranormal and E.T films. Although it could've been longer and a different ending. Now don't get me wrong, this movie was still leaving me on the edge of my seat, but it should've been laid out better. I feel like a lot of things were happening at once but that's what made the movie really intense and it kept you interested. So if you haven't seen this movie yet, you should definitely go see it. Its very good all in all.",
      "total_reactions": 3,
      "user": "annie5"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "\"The Purge\" is smart, scary and original, it is thrilling edge of the seat horror movie, it has some boring moments during the climax, and some of the acting is bad, but the story is original and intense, scary and great, the kids make stupid decisions all the way through the movie, but still The Purge is a great, scary time!",
      "total_reactions": 2,
      "user": "AReviews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2013
      },
      "score": 2,
      "text": "Let me start by saying the first half hour of this had me really interested. It began well. I mean, the premise was fantastic. However, it just slowly devolves into another home invasion film to which the premise is no longer needed or used. It was almost like they wrote the first half hour of the film and then got stuck. I wouldn't have disliked this film  so much had it, from the outset, just tried to be another home invasion film. It's pure rubbish.",
      "total_reactions": 1,
      "user": "Sarz91"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "primero tengo un primo que es gay y esta enamorado del director de esta película y segundo no me parece una película que algún día vaya a ganar un premio de ninguna categoría.",
      "total_reactions": 1,
      "user": "JUANPANB"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "\"The Purge\" starring Ethan Hawke was easily one of my most anticipated movies of the summer. It is a bold statement but the concept of the purge itself was enough for me to be immediately intrigued by the movies interesting premise. Unfortunately however it failed to exceed my already high expectations.",
      "total_reactions": 1,
      "user": "IAmVeryMoist"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "When I first heard of this film, I was excited to see what was in the minds of the producers. The concept was enthralling as I pictured an America actually following those footsteps in order to maintain population control. When the film became a house survival/horror film, it greatly disappointed me. The film though, had great acting by a joker-like villain. It kept me entertained as I wandered for how it would end. The film was just as long as it needed to be, but because of my disappointment with the concept is the reason for my lower score.",
      "total_reactions": 1,
      "user": "Apoe7"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "The most frustrating thing about this movie is that it is almost good. Different pacing, more development, a bit more intrigue and a little less slasher would have taken the film to another level.",
      "total_reactions": 1,
      "user": "arrdemille"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "A day in which crimes are all forgiven, for America has found new refuge under the tradition of the annual purge, a concept which toys with our inner primate selves. The Purge begins very slowly setting the scene in an eerily fashion, viewers are introduced to the normality of the purge quite quickly and it is this normality which then makes the later developments in the plot so shocking to an unsuspecting viewer.",
      "total_reactions": 2,
      "user": "Brad_Rowe"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "This movie was entertaining. The story line of what it means to \"Purge\" in this movie, is creepy, but that is what is entertaining about it. I just think that the ending was kind of stale and that it could have shown more footage about what was \"happening around the world as people were partisipating in \"The Purge\".",
      "total_reactions": 1,
      "user": "kepfordk"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "Horror movie are a very hard genre of movie to create. There are not many horror movies that put me on the edge of my seat with horror.  This movie was very interesting, the idea of the Purge is such a creative idea for a movie.  I thought that they did a very good job and I look forward to The Purge 2.  I highly recommend this movie for people that like horror and thriller movies.",
      "total_reactions": 2,
      "user": "Supergirl17"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "The Purge falla en muchos aspectos, pero en el que más falla es en el más importante: como contar una historia. El argumento de The Purge demuestra que, aunque Hollywood tiene el cine más conocido y taquillero, me atrevo a decir sin ningún miedo que también tiene el menos original y barato en lo que es storytelling. Si esto puede pasar como \"una película de terror y suspenso\" puede que yo sea Santa Claus; porque lo absurdo de la película pega duro como una patada baja, y créeme te va a doler por mucho tiempo.",
      "total_reactions": 1,
      "user": "Fedelca"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "Nice and new idea,it reflects how the nature of human is bad and hideous ,and if the chance come to anyone he will kill and revenge  I wish there is other part from this movie with more exciting story.",
      "total_reactions": 2,
      "user": "midothemyth"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2014
      },
      "score": 0,
      "text": "HORRIBLE HORRIBLE HORRIBLE HORRIBLE. The movie plot and story is not well thought and very bad. COMPLETELY predictable it leaves nothing to surprise there is just no point. I feel like taking a lesson from southpark and going to the directors and getting paid for watching this movie.",
      "total_reactions": 1,
      "user": "Barhota"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2013
      },
      "score": 2,
      "text": "Considering everything that I can imagine this film could of been. I would have preferred if i had not seen it and stuck with the much better imagination of what this could have been.",
      "total_reactions": 0,
      "user": "Ozsmeg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "When we were looking for horror movie to see, I proposed this film, and they thanked me for it. When violence becomes normal after a year, stress is you shoot a heart attack every hour, and there are 12; literally. With a history that shows the brutality of the human being and a family that catches you in its most real's wishes live.",
      "total_reactions": 0,
      "user": "wishmaster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "There's an interesting idea at the core of this movie. The idea of the government allowing all crime to be legal for one night a year has the potential to make a great movie, but despite this interesting concept the movie falls short. Characters act moronic and the movie lacks any sense of fear. There is some pretty interesting political and social commentary here, but most of it gets drowned out by the overwhelming stupidity of the characters and their decisions. I get the overall theme of the movie, but the writers and director failed to capitalize on it. It's almost like they decided to make a movie with profound political commentary but just gave up and turned it into a generic home-invasion flick.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2014
      },
      "score": 1,
      "text": "The entire plot progression revolves around a small child being in the correct place at the correct time... Outside that highly unpredictable requirement the film wouldn't be able to progress very far...",
      "total_reactions": 0,
      "user": "Golder"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2016
      },
      "score": 4,
      "text": "Its concept and premise may be compelling, however it is ruined by bad writing and a lack of suspense and terror. The Purge mainly succeeds in building atmosphere, but fails to deliver match else.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "In 2022, just 8 years from now, the U.S. government has instituted a new holiday. One that has led to peace and prosperity, but at an extreme cost to the less fortunate. For 12 hours, once a year, all crime is legal and people are given the opportunity to release their hatred and rage on anyone they can find. The cast isn't important to a film like this, it's all about the writers cynical message, that behind every smile is jealousy, behind every hand shake is anger, and trust has become a luxury that no one can afford. This Purge is all about the message that is being portrayed, but it has some major holes in the story. If all crime is legal for 12 hours, how come the only thing on peoples mind is murder? There weren't any rapes or bank robberies, nor where there any acts of terrorism or lashing out at authority. It was all about the killing. Most of the Purge is fairly predictable and it is what you would expect it to be. The big surprise comes at the end, which was extremely powerful, and really gives people the opportunity to question the message the writers have portrayed throughout the film. The only notable performance is that of the stars, Ethan Hawke, who was terrific, in a role I really didn't see him fitting into. The Purge is definitely all about the authors agenda and it is somewhat predictable, but what made the film for me, was the terrific ending, which really does give the audience the chance to challenge the cynical nature of the film.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2014
      },
      "score": 1,
      "text": "The Purge is probably the worst film I have ever seen in my whole life. I think into the future and it will be very difficult that a film can even reach the half of disgusting and annoying of The Purge. It is amazing how a really original and breathtaking idea, like a day when people can do whatever they want without facing any consequences so they release tensions, can be wasted in such an unimaginable way. Starting by the thing that unleash the conflict of the story, the stupidity of a boy. Although no everything is his fault, the father is inconsistent with the things he does and a lame hero, the ideas of the mother are incoherent and the daughter is naïve to death. The twists of the story are desperate for achieving the attention of the viewer. There are some sequences that have potential but they dissipate in the immensity of rubbish. With an idea like this I would make the movie about the first day when the purge was establish or maybe evaluating that practice from different point of view from a group of people in the country. But there is nothing more to do with this director. I still ask myself how he manages to get the money to make this film and I hope that he never even think of making a new picture. This movie is an insult to human intelligence.",
      "total_reactions": 0,
      "user": "NedRyerson1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "Besides having a concept that makes no sense and insults who we are as people, The Purge offers enough tension and fear to make up for its lack of depth and limited purging.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "What is wrong with people? Purge is exactly what the audience wants. Action,horror,suspense and blood. How people didn't like it? The plot may sound silly and some people may not like it I accept that) but it is original something that most horror movies nowadays aren't. I also don't understand how critics like The Cabin in the woods which is a movie and they didn't like the Purge which was a scary intense film. Lena Headey was a big surprise to me as I've only seen here in Game of thrones where she is excellent as \"the bad guy\" and she was even good playing \"the good guy\" and the mother who protects her daughter and son. In overall there is suspense and The Purge it has a good original plot that many people will like and others will not. I like the Purge and I consider it as one of the best horror-thriller movie that I have seen Thumbs up!",
      "total_reactions": 0,
      "user": "DJohnson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "Esta pelicula contiene escenas aburridas como interesantes, las aburridas no borran un buen trama de la pelicula, como se hace un a pelicula mejor al transcurrir el tiempo con un mensaje interno demasiado profundo q te pone a pensar un momento",
      "total_reactions": 0,
      "user": "CuriousStranger"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "There is a good tension that explodes at the end. Well conducted by the director and actors film.",
      "total_reactions": 0,
      "user": "Expectoner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 1,
      "text": "The concept and plotline of this film can be summed up in one word:",
      "total_reactions": 0,
      "user": "smarteck"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "The movie keeps your heart beating from the start to the end. Its takes a ludicrous plot and provides a fairly reasonable and logical explanation that gives an almost surreal feel to the event. There are many… many cliches to in the film and character development is non existent… still a good watch. pretty entertaining.",
      "total_reactions": 0,
      "user": "oswaldferrera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "The movie is a breathe of fresh air with a new idea which is out of the ordinary for Hollywood now a days and welcomed by the audience. The story moves at a relativity adequate pace without to much being tied down in a romance story that holds a lot of movies in this class. The movie only slows down and even gets lackluster in the end. The stories conclusion is very simple and easily seen coming even minutes into the open. The simple write can draw in those who are new to cinema but those who have seen a few thrillers will not be impressed or shocked by the ending and even disappointed that they chose such a pedestrian reason for such a great stories conclusion.",
      "total_reactions": 0,
      "user": "billylenz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 2,
      "text": "This was quite possibly one of the worst movies I've ever seen. It wasn't even so bad it was funny. It was just flat out aggravatingly terrible. The premise was interesting, but that's all I can really say good about this movie. The entire reason the events of the movie took place was because of the fact the father left access to the security system out in the open where anyone in the house could access it, and everyone in the family knew the code. It only gets worse from there, as the family had multiple chances to prevent things from escalating further, but made the dumbest decisions every time. One of the most unforgivable parts was when they were finally ready to solve the issue, and then the female characters who were otherwise fine with solving it suddenly broke down and said they shouldn't go through with it because it would make them terrible people. This is in spite of the fact they were being threatened with their lives by the very man who they were suddenly not so sure about handing over. And just then, they decided not to hand the guy over after all and instead face all the purgers outside instead. Not to mention finally in the end not all of the purgers were killed after the purge period ended, and considering all the damage the family did to them, those purgers will just be back again the next time but infinitely less merciful. And all because the family decided to show them mercy. They are quite possibly the dumbest family in existence and the plot was one of the most legitimately aggravating things I've ever experienced. Please, if you were considering watching this, reconsider.",
      "total_reactions": 0,
      "user": "Thatuserguy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2014
      },
      "score": 2,
      "text": "This movie states that unemployment is below 1% and the economy is booming, this thanks to the Purge, were theres no law for 12 hours. It contradicts itself, people wont just kill, there main target would be money, businesses, banks etc would be looted and destroyed which would be disastrous for any economy..crap film that wasnt well thought out.",
      "total_reactions": 0,
      "user": "OzZyBoi86"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 2,
      "text": "I was drawn in by the intriguing premise, however the actual movie itself turned out to be horrendous. The writing and plot is absolutely stupid, with main characters who I actually did not mind seeing die and the film ending in complete tragedy since that is what this movie is, a tragedy. Several people walked out of the theater where I saw this, and the only reason I stayed was because I thought perhaps there would be something redeeming about it; unfortunately, there was no redeeming factor. I have wasted approximately 90 minutes of my life, time that I will never get back, and I implore you not to see this movie and, if you really must, simply wait for the DVD/Blu-Ray/Netflix.",
      "total_reactions": 0,
      "user": "Toffenuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2013
      },
      "score": 2,
      "text": "The Purge sucks. It is so terrible in so many ways, honestly. The base idea behind the plot is really cool, but it's wasted on a stupid family with characters you don't care about, and a big waste of villians. I'm sure it was there on the page, but the Purge stumbles in every way possible in terms of execution.",
      "total_reactions": 0,
      "user": "SimpleMethod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "'The Purge' presents a good premise developed the wrong way, unfortunately, is a shallow  dead and dull movie, when you end of watch, you just find yourself thinking about something else.",
      "total_reactions": 0,
      "user": "khutch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "The movie had a good premise, but the characters were all 2-dimensional. They didn't really learn anything. We already knew the the \"purge\" day would be bad, and you are left with the exact same conclusion at the end. The characters act completely irrational the entire movie, which is what you might expect from a horror movie, I guess.",
      "total_reactions": 0,
      "user": "Ardais"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2013
      },
      "score": 1,
      "text": "I want to purge this movie out of my head.  Making crime legal for any amount of time is stupid to begin with.  Dumb characters, a storyline that confuses its message, and very goofy antagonists you can't take seriously.  I wanted to give this movie a chance, because I was intrigued by what possibilities it could have taken with such an unrealistic event, but it ended up being killing itself with stupidity.",
      "total_reactions": 0,
      "user": "Spikedragon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2014
      },
      "score": 1,
      "text": "This movie could've been better if it was from the view of person caught on the streets as the \"purge\" happened. Having the focus be on a family barricaded in a house makes for dull experience for something that sounded so unique to see. Instead we get a family we couldn't care less about. When you're hoping the \"heros\" are quickly killed by their tormentors that's a bad sign. As for the tormentors they come across as laughable at best. They seem like rich psychos in real life now they get an excuse to kill poor people without penalties. A better story would've followed people who ended up outside while trying to get home before curfew. This movie gets a 1 only because of it's idea, too bad it wasn't fleshed out better.",
      "total_reactions": 0,
      "user": "GundamMars"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "Esta pelicula contiene escenas aburridas como interesantes, las aburridas no borran un buen trama de la pelicula, como se hace un a pelicula mejor al transcurrir el tiempo con un mensaje interno demasiado profundo q te pone a pensar un momento",
      "total_reactions": 0,
      "user": "Jmsbpp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "A beautifully original concept created terrifying potential here. However it's potential that's misused using age old jumpy scares. The scenario sets the stage brightly, but by the end, the stage is left overshadowed with disappointment. The hype surrounding The Purge obviously got out of hand, as it is a mildly entertaining thriller and little more. A sequel was inevitable given it's financial performance. It should have been better though.",
      "total_reactions": 0,
      "user": "callumjsouth"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2013
      },
      "score": 3,
      "text": "The premise is interesting at the cost of being completely implausible and so, pointless. In fact, it doesn't even play a major factor in the subsequent home invasion film that relies on startling pop-ups to even come close to a scare...",
      "total_reactions": 0,
      "user": "Elucidate"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "I think I enjoy the concept of this film more than the movie.  The idea that, in order to control the country and the populace, our government allows a 12-hour period where all crime is legal.  Add Ethan Hawke to the mix and a family that is forced to decide on whether they should allow a man who is guilty of nothing more than just existing or losing everything and you have a recipe for success.  However, the movie proved to be a little messy for my tastes.  The story is a little chaotic and a lot of the characters go underdeveloped.  The film offers up a great twist ending that is perfectly foreshadowed in the beginning but the ending feels slightly tacked on due to a poorly handled plot.  However, with all the potential deal breakers going on in this movie, most of the acting is great, the Polite Leader antagonist that is harassing the trapped family is fantastic and, most of all, the concept is just brilliant.  While it didn't live up to its potential, it was still very entertaining.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "The film was just a cliche-filled bottle with many stupid choices by the protagonists. The story was interesting, but it was developed very badly. It could have been a lot better",
      "total_reactions": 0,
      "user": "KyoumaZack"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2014
      },
      "score": 4,
      "text": "I really liked this original idea that surrounded the whole movie.  I was excited for the Purge to happen in the movie and once it started I was underwhelmed and just angered by stupid decisions one after another.  I know movies need characters to make \"mistakes\" to progress the plot but there were so many that after halfway I was just left aggravated.  I think this movie was okay, it is worth a rent and the idea was awesome so I hope a sequel can fix the mistakes.  Just felt it could have been much better.",
      "total_reactions": 0,
      "user": "mijxero"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "Not the best horror movie of 2013, but I didn't think that \"The Purge\" was that bad. It has an original concept, but it isn't taken to the full amount it could have gone.",
      "total_reactions": 0,
      "user": "BWETMatangi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "This is a good horror movie. The characters are good and the atmosphere is good. My main problem with the film is the whole idea that crime is legal in one day. Even though it is original, I just think it's stupid.",
      "total_reactions": 0,
      "user": "LTR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "The purge is singlehandedly the most pointless movie i have ever seen...",
      "total_reactions": 0,
      "user": "MattyJM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 4,
      "text": "It was not exciting, it was really a two scary scenes in it all, I do not know what was in it for horror. A rather weak story seems to have been a low-budget movie.",
      "total_reactions": 0,
      "user": "Firebala"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "I feel almost cheated with this movie, honestly. It's hard to feel concerned for a character when you know absolutely nothing about them. The only characters I can remember by name (after finishing the movie just seconds ago) was Zoey Sandin. Apart from that I have no idea who anyone was or what their stories were.",
      "total_reactions": 0,
      "user": "AeonAmadi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 5,
      "text": "This was better than I thought it would be. With all the negative comments, I'm glad I ignored them and watched and I enjoyed it pretty much. This is more focused on what if we are in the situation and what would we do? I give this a focus on story and not on the graphics and comical story. I give this one a high rate of @@@@.5 for the story. Give this movie a go and please look on the story and not the graphics. Movie is supposed to be judge by its content not the cover anyway.",
      "total_reactions": 0,
      "user": "A_cheese"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "The Purge is a very underrated movie, this movie has original and fresh ideas, and it capitlizes with flying colors. The Actors are great at dilivering unique and interesting performences. The only downfall to this movie is that its too short. This movie has one of the most memorable villains. This is a sleeper hit for 2013 but i just wish it would have been longer.",
      "total_reactions": 0,
      "user": "SJ-ULTI-Reiews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2014
      },
      "score": 1,
      "text": "One of the worst movie i've seen. Bad acting and character does not know the difference between right and wrong, putting stranger's life before all of their member.Only Ethan Hawk makes the right decision.",
      "total_reactions": 0,
      "user": "Tsubasx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "Un film muy recomendable, una de las mejores películas de la última década, muy bien llevada a cabo con un argumento interesante y muy atrapante. Ya desde el comienzo empieza a atrapar al espectador y en ningún momento se hace densa. Muy buena, recomendable.",
      "total_reactions": 0,
      "user": "JullTheAmazing"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 1,
      "text": "Gets one point for having a plot. The Purge is full of contradictions and horrendous moments that involve much stupidity that cannot be taken seriously. The film isn't scary, neither is it enjoyable...do not purchase this film, find some other way to watch it, such as cable or streaming. How a sequel was planned and eventually released boggles my mind.",
      "total_reactions": 0,
      "user": "JudgeMathew"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2013
      },
      "score": 4,
      "text": "The Purge offers imaginative plot but offer less scares and thrilling scenes which is not likely more of a sufficient thrilling movie and another thing that made this movie less mediocre is that it has a short running time.",
      "total_reactions": 0,
      "user": "TheCoolGuy99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2013
      },
      "score": 2,
      "text": "A pathetic attempt to scare its audience. The following film is original and the video quality is superb. However, the writers' are amateurs at best. The structure of events are not smartly planned. IN moments of action, the villains take decades to attempt to kill the main characters (family). The concept of the purge itself is quite idiotic. Although it is an imagination, its backing is completely unrealistic. This would've been fine, had the writers not attempted to make the story realistic.",
      "total_reactions": 0,
      "user": "Yolobot"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2013
      },
      "score": 3,
      "text": "I quickly found myself very intrigued by the premise of 'The Purge'- a near future America under the new 'Founding Fathers' political regime. However, my intrigue and excitement soon turned to despair and annoyance as it became clear the film was to focus on a single, white, rich household. I wanted to see the wider stories within 'The Purge', something we only get a taste of on CCTV footage and radio broadcasts at the beginning of the film.The Writer, James DeMonaco, could have done so much more with such an innovative world, yet he took the easy way out by regurgitating the same old modern horror tactics with feeble jump scares and predictable 'plot twists'. The acting too left a lot to be desired. Ethan Hawke who plays James Sandin, the father and lead, does a good job of conveying himself as a morally confused figure; unsure whether to do what is 'right' or what is best for his family. However, you will find yourself frustrated with the acting from Max Burkholder, Adelaide Kane and Lena Heady, the respective son, daughter and wife of James Sandin. The son is meant to be the moral touchstone of the film, yet bland and uninteresting acting from Burkholder failed for this to be conveyed. There is not really a gel between the three, making moments between son and mother or mother and daughter somewhat awkward. Ultimately, we don't really care about their fate when they are thrown into potentially horrible situations. If you are looking for an in depth view into a futuristic world that examines the wider implications of a new and potentially possible regime, you won't find it here. If you are looking for something a bit simpler with occasional moments of excitement, by all means give this film a go.",
      "total_reactions": 0,
      "user": "averygoodcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2013
      },
      "score": 4,
      "text": "Draws viewers in with an interesting idea, and the first half looks promising, but succumbs to cliches. The second half is boring rather than suspenseful.",
      "total_reactions": 0,
      "user": "KaptainHutchino"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2015
      },
      "score": 5,
      "text": "The Purge starts of with a very very interesting premise, and is incredibly unique in the fact with the way the lead \"protagonists\" see this purge and talk about it like it is water cooler chat. However, the film descenda into cliche horror moments and a very unsatisfying ending in which you can see every \"twist\" coming. Performances are good from Headey and Hawke but the boy is actually pretty frustrating and I lacked and enpathu towards him even though i knew I should have some. So the film started off round about a 7.5/10 but just slowly dropped. So i must credit it for it's unique premise but sloppy writing pulled it down into a mediocre, cliche ridden watch.",
      "total_reactions": 0,
      "user": "oDjento"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2014
      },
      "score": 6,
      "text": "This was a decent thriller. My heart was pounding in several scenes but I can understand why It's rating is what it is. The film had it's flaws but also had it's good points. Maybe It's just me but I wouldn't trust reviews on this to much. You might you have to watch it yourself",
      "total_reactions": 0,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "the purge is one of the best scary movie i seen all year  .  but the child who like the hobo in the house is a idiot because he took his families life in danger and almost got killed but i think its kinda cool killing the purge  crew . but why would all medical services be closed ?",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "It s a Good film, very good story line, tho it could do with some work, maybe not stuck in one house for the whole movie, the only mistake that annoyed me was it was suppose to be a 12 hour purge but if you pay attention to the times it was Midnight to only 7am, thats 7 hours not 12.......",
      "total_reactions": 0,
      "user": "Peterisgb"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "The Purge es sin duda una película que es interesante y que llama la atención por su intrigante sipnosis, y en mi opinión, debió tener mejores críticas de las que tiene por parte del público y crítica.",
      "total_reactions": 0,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 4,
      "text": "The Purge was pretty good, considering horror movies these days are just boring because most of them just follow the style of Paranormal Activity after it came out, but this wasn't like Paranormal Activity at all. The Purge is original, and you'll actually jump at points.",
      "total_reactions": 0,
      "user": "chw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 1,
      "text": "An absolutely fantastic idea totally underutilized. This film follows a family around their house for its duration, a stereotypical game of cat and mouse that the Purge doesn't really bring anything new to. Even worse, it's packed full of forced suspense and cheap 'thrills'. I was hoping the theme of morality would be explored from different angles, but instead it's made very black and white. I found this unbelievable and it distanced me from being immersed in the film as a result.",
      "total_reactions": 0,
      "user": "Leatherbottom"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2016
      },
      "score": 2,
      "text": "You know that feeling of frustation you get when a villian whoops the protagonist's ass",
      "total_reactions": 0,
      "user": "xXGaming101Xx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2015
      },
      "score": 4,
      "text": "I expected a lot of that movie and guess what…This is a lames ass movie with very few action sequences.The twists were predictable and the acting was not so good.Even Ethan Hawke couldn't save the movie.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2014
      },
      "score": 3,
      "text": "I remember I first heard about this film in an ad before a YouTube video. It started with a voice-over said \"Don't skip this ad. You are about to see the trailer for the most disturbing movie of the year.\" That was a bold statement, considering Evil Dead had already come out and The Conjuring was right around the corner. So naturally, I was curious and didn't skip the ad. One of the first things I noticed was that Ethan Hawke was in the film. I am a fan of Ethan Hawke, and since he was in Sinister a few months prior (one of the scariest films I've ever seen), I was even more curious. Then I noticed the interesting premise about all crime being legal for 24 hours, and as I sat and watched the trailer, I thought \"You know, this movie has a lot of potential if they do it right...\"",
      "total_reactions": 0,
      "user": "rocketrider231"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2014
      },
      "score": 4,
      "text": "A very cool concept that was not executed well at all. This movie could have been really good but was not set up well and was not interesting at all. I was looking forward to seeing this one even though I have heard a lot of bad things about it, and I was very disappointed with it. Very boring with not very good acting makes this a very poor movie.",
      "total_reactions": 0,
      "user": "Viper8787"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "Brilliant, twisted with a purpose, and incredibly thought-provoking.  For starters, those who didn't like the fact that the movie doesn't spoon-fed the viewer answers to life's great mysteries or explain in detail the nature of the human condition, perhaps begin by examining the distinction between \"freedom\" and \"liberty.\"  I've news for folks who say the characters were \"two-dimensional,\" that may be your own reflection, your assertion does not reflect on the film in the least.  I've news for folks who say the story was \"shallow\" or \"lacked depth,\" that is likely a reflection on you, not the writing, the dialogue, the acting, the direction, or the story-line.   The manner in which it focuses the subject matter and the existential struggle the film's premise produces, by confining the story to one neighborhood, practically one family's home, leaving the viewer to contemplate the big picture, was nothing short of visionary.  I'm not a fan of \"slasher flicks\" in the least, but this is science fiction and not your average \"slasher flick,\" to suggest otherwise is simply ignorant.  Now, as someone with a background in psychology, I could go on for days regarding the probable departures from \"reality\" statistically.  However, the movie is squarely science fiction and in my humble opinion, the film accomplished what good science fiction should accomplish: It invites the viewer to examine themselves and their relationship with the rest of the world, if not the universe.  It should make all of us a little uncomfortable, but not simply because of the violence and gore.  Kudos to all those involved in making this film.",
      "total_reactions": 0,
      "user": "PsychicTimo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "I really dont understand the bad score to this movie. this movie shows the anger hidden from humans and negative feelings they feel each other.",
      "total_reactions": 0,
      "user": "BernanHandeiro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "'The Purge' is definitely one of those movies I went in with way to much anticipation and excitement. Even though the idea was one of my favorite plot ideas in a while, I can’t get over the fact that it was set up to be this crazy and malicious crime spree night, but turned out to be like any other murder movie where the bad guy(s) come, the killing starts, and then the movie is over. In the movie world today, when I here a movie is coming up that has to do with a 12 hour period where all crime (including murder) is legal with no cops or hospitals, I expect it to be freaking awesome, wouldn’t you?",
      "total_reactions": 0,
      "user": "thejakeberlin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "This movie is far better than what it has scored from user reviews. Then again all reviews are just opinions even from critics so don't take my word for it. Purge 2 is coming out soon so get spun up on the series!",
      "total_reactions": 0,
      "user": "V1c1ous_We4seL_"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "Imagine a world where crime is basically non-existent and almost everyone has a job and is doing well. Imagine this utopia is in the US in the year 2022. Thanks to a night held once a year called The Purge, this is all somehow possible. Any crime is legal for a night every year until morning comes. That is the basic setting for the movie.",
      "total_reactions": 0,
      "user": "Disk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2014
      },
      "score": 8,
      "text": "this movie is very gory and original it is an amazing movie with a interesting  concept it is a great thriller and has you hanging on the edge of your seat its not scary but its a thrill ride to remember",
      "total_reactions": 0,
      "user": "BLAZETHEMCKIDD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "I cannot believe how disappointing this movie was, I was hoping for a tense horror flick with an interesting premise. It wasn't, it was just one jump scare after another and they were all extremely predictable and cheap. By the 4th jump scare I knew it was coming so I took off my headphones and waited 3 seconds and it came. All the horror movie cliches are there and  the victims are incredibly stupid. Stay away from this one and hope that the sequel is better. Although the idea of The Purge is cool the movie itself falls flat on its face.",
      "total_reactions": 0,
      "user": "TheScaryEmu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2014
      },
      "score": 3,
      "text": "The background isn't credible for adult viewers. Anarchy and fear, even contemporary, can't boost economic growth, nor would criminals choose mostly poor targets under these circumstances. Indeed, the director seems to only try to present the wealthier people as violent and unsympathetic villains and poor and young people as more competent individuals. This kind of plot is all but original.",
      "total_reactions": 0,
      "user": "beeblebrox"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "I give this movie a 4 only because of the originality and so it's sort of worth watching, other than that it's terrible anyone saying otherwise was clearly high while watching. The film has SO many cliche and stupid moments that leave you face palming so hard. I predicted almost every single moment in this film because of how unoriginal it was. To leave spoilers to a minimum let's just say that the characters have a decision where it's either this happens or this and this happens and even though this occurs in both scenarios the characters still have a hard time deciding what to do. And 1 character who keeps screwing everything up and just being an annoyance. When the credits rolled I felt that this amazing idea had just been ruined entirely because they either couldn't think of anything better or because they were plain lazy. Also you could mistake this movie for ANY other movie as it has NOTHING to do with the purge, the only resemblance it has is the beginning and end. I hope anarchy proves better than this...",
      "total_reactions": 0,
      "user": "0Bennyman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 4,
      "text": "While it has an intriguing premise, and it's an overall suspenseful and enjoyable movie, \"The Purge\" is loaded with plot holes, inconsistencies, bad acting, shaky cam, and stupid characters. If you can look past all its flaws, I would recommend it.",
      "total_reactions": 0,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "This is not that good of a movie. Yet, it is not that bad. I would recommend it, but you will be disappointed. It's not what everybody expected, but I still think it's good.",
      "total_reactions": 0,
      "user": "ChoBroooo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "\"The Purge\" 10 Scale Rating: 4.0 (Mediocre) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "The Purge was pretty stupid. The acting was terrible, the story was good but it had added satisfactory. There were quite the few plot holes, and the lines...Jesus Christ, man!",
      "total_reactions": 0,
      "user": "REDWOU"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2015
      },
      "score": 2,
      "text": "the purge is a boring home invasion film. the kids are painful the story is dumb the charters are useless dumb or both. but there are two good charters and even though the story id dumb it not a bad idea. but it's just a boring boring film.",
      "total_reactions": 0,
      "user": "teddyluke"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "This isn't as bad as people say it is. If you just want to enjoy a solid thriller, go see The Call instead. This is a sometimes stupid, and slow movie with dumb character, yet watchable. Watch this if you want to see a violent stupid movie. All the characters in this movie were just stupid. If they just let the homeless man go, everything would be fine. The ending when the neighbors helped them kill the intruders was just stupid. Then the twist was also horrible.",
      "total_reactions": 0,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2016
      },
      "score": 6,
      "text": "Really interesting premise which turns to stale and quite boring plot if you look at it in the end. WHile watching the movie it feels exciting and you want to see what happens next which is always good as it was not boring, but what actually happens at some points are quite dumb and has many places where you just can't understand why things happened like they happened. I think they could have made it a really good movie but instead it became average, as I liked the idea but as a whole the movie is average.",
      "total_reactions": 0,
      "user": "Ralfbergs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2016
      },
      "score": 4,
      "text": "Oh yeah, so totally (not) scary and horrifying. This is like the vase at your home filled with so many clichés in it. I'm like reviewing this because that unfunny parody to this movie that just got released today isn't pretty much necessary to make.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2016
      },
      "score": 3,
      "text": "A stupid movie that thinks it's saying something smart but it just a really stupid movie. The kids in the movie are idiots. This movie is cliché boring movie.",
      "total_reactions": 0,
      "user": "reviewfrom19842"
    }
  ]
}