{
  "mc_avg_user_score": 4.4,
  "mc_metascore": 28,
  "mc_mixed_rating_frequency": 16,
  "mc_movie_name": "The Big Wedding",
  "mc_negative_rating_frequency": 29,
  "mc_positive_rating_frequency": 17,
  "mc_pro_critic_reviews": [
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2013
      },
      "score": 75,
      "summary": "The movie, in its basic concept, is corny and contrived, but as written and directed by Justin Zackham, it's executed in a pleasantly wry and understated fashion."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 63,
      "summary": "Coarse, crude but often cute, The Big Wedding serves up the spectacle of its title, and the bigger spectacle of four AARP-eligible Oscar winners cursing like sailors."
    },
    {
      "critic": "Laremy Legel",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 55,
      "summary": "The rare example of a film that had to have been a tonal mystery to everyone involved for the entire process of scripting, shooting, and editing. The lingering issue? They never managed to crack the case."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2013
      },
      "score": 50,
      "summary": "Forced, formulaic and never believable. It's a particularly unholy combination."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 50,
      "summary": "It’s just such a shining example of a dull studio comedy."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 50,
      "summary": "The fact that the three actors who do most of the fooling around — Robert De Niro, Diane Keaton and Susan Sarandon — have a combined age of 202 pegs this as a sex romp for the Viagra crowd."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 50,
      "summary": "No one is bad in The Big Wedding, but no one is remotely believable, either."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 50,
      "summary": "The movie's own brand of charm has its subset of smarm."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2013
      },
      "score": 50,
      "summary": "There’s not a bad performance in this movie. De Niro, Keaton and Sarandon are particularly good, what a surprise.  But it feels as if all the guests at “The Big Wedding” are wearing ID tags telling us their one Plot Point."
    },
    {
      "critic": "Helen O'Hara",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "Ben Barnes as a Colombian? Really?"
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2013
      },
      "score": 40,
      "summary": "The Big Wedding isn’t terrible. De Niro is actually pretty good here — the script gives him plenty of raunchy one-liners, and, while they’re mostly lame, he delivers with conviction, which counts for something nowadays."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 40,
      "summary": "The film isn’t so much funny as it is merely amusing — a laundry list of inappropriate and potentially embarrassing moments that strive mightily, but never quite manage to land the laugh."
    },
    {
      "critic": "Keith Phipps",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 40,
      "summary": "Zackham's film feels as plastic as a cake topper — and just as hard to digest."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 38,
      "summary": "The movie is bland hackwork; its crime isn't incompetence, but indifference."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2013
      },
      "score": 38,
      "summary": "It's tired and dated with too few laughs to justify the stultifying attempts at drama and the impossible-to-swallow plot contortions."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 38,
      "summary": "It’s nearly tragic to see America’s Greatest Living Actor on the guest list for The Big Wedding, the latest limp comedy about seniors behaving badly."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 37,
      "summary": "Even the susceptible softies, who always cry at weddings, will probably leave the theater dry-eyed, not to mention feeling a little empty inside."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2013
      },
      "score": 30,
      "summary": "I’m not saying there isn’t comic gold to be mined in the topic of cunnilingus and the senior set, but The Big Wedding couldn’t hit pay dirt even if it face-palmed the film first."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 30,
      "summary": "To be fair, there are moments that earn their laughs and nostalgic memories for the marriage that was and the relationship that is that are sweet. But like many big weddings — a lot of things go wrong and not much goes right."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 30,
      "summary": "There is nothing about the movie that isn’t utterly predictable. You meet a character, and it’s immediately obvious what’s going to happen to him (or her). And then it happens. Maybe it’s meant to make you feel good about your deductive reasoning skills or something. But mostly it just makes you want to see something else."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 25,
      "summary": "Quaint and crass get together — or would that be “bump uglies”? — with awkward, thoroughly flat results in The Big Wedding, an ensemble comedy with a tonal cluelessness as surprising as the name cast that signed on for it anyway."
    },
    {
      "critic": "Trevor Johnston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 20,
      "summary": "Putting the ‘retch’ into ‘wretched’, this wedding comedy makes the fatal assumption that the sight of acting icons of a certain age – Robert De Niro, Susan Sarandon and Diane Keaton – behaving badly will have us rolling in the aisles."
    },
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2013
      },
      "score": 20,
      "summary": "This would-be-frothy date flick is a sub-\"Meet the Fockers\" dog’s dinner."
    },
    {
      "critic": "Neil Smith",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2013
      },
      "score": 20,
      "summary": "The Big Wedding isn’t telling a story so much as selling a lifestyle – one that, rather like Heigl’s morning sickness, makes you want to vomit."
    },
    {
      "critic": "Eric Hynes",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2013
      },
      "score": 20,
      "summary": "Cloyingly crude and dispiritingly typical ensemble Hollywood farce."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 20,
      "summary": "The Big Wedding lets them all down with bottom-rung sitcom shtick and an undercurrent of squareness masquerading as absurdity."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 16,
      "summary": "It’s almost impressive how the moronic new ensemble comedy The Big Wedding manages to cram three hours’ worth of nonsensical subplots, extraneous characters, and implausible plot points into 90 minutes of streamlined idiocy."
    },
    {
      "critic": "Rob Humanick",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2013
      },
      "score": 12,
      "summary": "For a movie ultimately about what freaks we all are behind the fronts we build for the sake of normalcy, the apathetically performed The Big Wedding couldn't possibly be more square."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "summary": "To say that Justin Zackham’s farce The Big Wedding takes the low road doesn’t begin to do justice to the sheer awfulness of this star-stuffed, potty-mouthed fiasco."
    },
    {
      "critic": "Calum Marsh",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "summary": "Many Hollywood films are founded on privilege, but few are as open and nasty about their racism, misogyny, and homophobia."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "summary": "“I’d rather gouge my eyes out with hot spoons!’’ De Niro exclaims at one point. I’m not sure exactly what he was talking about, but I’d like to think it referred to the prospect of being forced to watch The Big Wedding."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2013
      },
      "score": 4,
      "text": "The movie is not terrible, but it's one of those movies that no one's going to remember. The storyline and characters are just stale and don't really interest you. It does have its funny moments, but sadly, that's only 20% of the movie. I honestly wish I had more to say, but I'm almost positive that this is probably the most underrated movie of the year so far. Overall, it's just boring. Plain and Simple!",
      "total_reactions": 2,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "The movie is not delivering anything new, it is incredibly tiresome and ordinary, it has lots of cliches some giggles but nothing really overall new. Despite being not that funny with third rate predictable story, it is one of the sweetest movies I have ever watch, including the big and great cast ensemble, it is entertaining and an enjoyable movie just to pass time, it is not a bad movie but absolutely it is not a good movie either, it is just static and funny for what it is, but no one is gonna remember it, you'll have some entertaining time and some laughs, but you will go out of the theater saying \"whatever\". It is corny, cheesy and unoriginal in so many ways, but it is not a bad experience, just watch it, and you will be enjoying it till the finish, but it is not near great and it is not bad, it is a mediocre rom-com.",
      "total_reactions": 2,
      "user": "MovieGoer14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2013
      },
      "score": 4,
      "text": "When the biological mother of an adopted son comes for the wedding, the divorced parents (Robert De Niro & Diane Keaton) have to pretend to be married again. This causes problems with the current gf (Susan Sarandon), while the other siblings (Katherine Heigl, Topher Grace) bring their own issues. As you can see, the cast if full of gifted comic actors and they bring their talents to bear. The writing doesn't match up: The plot is stale and hardly ever funny. It's full of comic energy, but lite on laffs.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "You'd think a film that starts with Robert DeNiro getting ready to perform cunnilingus on Susan Sarandon would have nowhere to go but up.  You'd be wrong.  Never has so much talent been so wasted as in this movie. Avoid it at all cost!",
      "total_reactions": 1,
      "user": "cdbdbsabzb"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "The Big Wedding is a corny romantic flick. It takes up some space and with a long super cast it does entertain. Not to mention that Justin Zackham who got to work with Robert De Niro has made a quite disappointing movie. The Big Wedding is just a film about Robert De Niro and his Oldey girlfriend get together for a wedding and \"things\" happen. It's weird that people didn't like it. I mean its a okay movie. I wanted to give it a 4 or 0 or 3 but still i enjoyed it. It's one of these movies that you won't remember. One time watch will be great at a matinee price only. Only.",
      "total_reactions": 1,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "It's nothing particularly special or original but it is funny and pretty sweet. A great cast of characters comes together to play a large family that comes together for a wedding. As you would expect from a group of people who all have different personalities, issues, and secrets eventually all heck breaks loose. This leads to some funny moments that ultimately make this film worth a watch, but it's not hard to notice the unoriginality of it all. A lot, or rather most, of what is being done here has been done elsewhere. Still it's funny and I enjoyed watching it, so as far as I'm concerned it gets a passing score. All in all it's pretty good and funny.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2014
      },
      "score": 3,
      "text": "Perhaps the writer and director was unaware of all of the versions of film in the last twenty years. I beg to differ. If and only if a film choses a similar path to other premises, the film must excel in some way. The Big Wedding does not.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2013
      },
      "score": 5,
      "text": "It has a terrific cast for a great movie, greatness is not here, it is all seen-before scenes silliness and not ever laugh out scenes, but on the bright side, despite the fall, it is still delivers sweet story and kinda good time with great cast and near good scenes",
      "total_reactions": 0,
      "user": "HaithamBayazeed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "Soo Wack!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "total_reactions": 0,
      "user": "irepcocoabutta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2013
      },
      "score": 1,
      "text": "I thought this movie was awful, from it's beginning to the end. The characters not interesting at all & I was left wondering what these talented actors were thinking when they took on these roles. Not funny at all, the plot ridiculous & contrived.",
      "total_reactions": 0,
      "user": "kejarusitwy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "It isn't bad but it is cheesy, and it is a movie that no one is going to remember, the actors are amazing but they are all wasted talents in this movie, it is rushed and silly with some funny moments but over all. No",
      "total_reactions": 0,
      "user": "AReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "With such big names, one can safely assume that the movie has little to say in terms of a good storyline. This movie was awkward and even childish at times. The cast still managed a good performance  as good as their characters would allow them. It definitely wasn't as memorable or re-watchable as I had imagined it would be.",
      "total_reactions": 0,
      "user": "film_bug"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2013
      },
      "score": 0,
      "text": "Terrible, implausible storyline; no chemistry or believable relationship between the actors; I didn't even care enough about the plot or characters to finish watching it; very disappointing",
      "total_reactions": 0,
      "user": "hatterasmom3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2013
      },
      "score": 0,
      "text": "Have you ever watched a movie and you had the strangest feeling someone was sniffing your underwear? Yeah, me neither, but watching this movie even on my computer was an experience just as bad. The Big Wedding manages to live down to it's name, as being a long wait for anything romantic. It manages to be realistic and derivative, yet uninteresting.",
      "total_reactions": 0,
      "user": "InverseCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2015
      },
      "score": 8,
      "text": "Cliche'd, corny and contrived at times, but writer-director Justin Zackham makes it work, the A-list cast here is wasted, but they make the material given to them considerable. Sarandon and Keaton and  De Niro have beautiful adorable chemistry, and even know this isn't Heigl's best film, she does do a great job portraying  as this mean spirited character, but it's the best character I've seen her play. Don (played by Robert De Niro) and Ellie Griffin (Diane Keaton) are divorced, but  their adopted Alejandro's (Ben Barnes) biological mother unexpectedly decides to come to wedding, she believes that divorce is a big fat sin, so Don and Ellie are forced to be a married couple. They also have to confront their past, present and future. And avoid killing each other through the process. The chemistry between Barnes and Seyfried is cute; this could of have been terribly made but Zackham makes it charming and witty, also makes it stunning. Grade B+",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "In short, a little unpretentious and relaxing movie.",
      "total_reactions": 0,
      "user": "Harmonic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 2,
      "text": "\"The Big Wedding\" 10 Scale Rating: 2.0 (Awful) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "An all-star cast very nearly goes down with the ship as filmmaker Justin Zackham (The Bucket List) indulges in relentlessly farcical silliness.",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ]
}