{
  "mc_avg_user_score": 8.0,
  "mc_metascore": 80,
  "mc_mixed_rating_frequency": 5,
  "mc_movie_name": "The Queen of Versailles",
  "mc_negative_rating_frequency": 0,
  "mc_positive_rating_frequency": 23,
  "mc_pro_critic_reviews": [
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2012
      },
      "score": 100,
      "summary": "An indelible portrait of an American family at its most blithely macabre."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2012
      },
      "score": 100,
      "summary": "The Queen of Versailles turns out to be a portrait -- appalling, absorbing and improbably affecting -- of how, even within a system seemingly designed to ensure that the rich get richer, sometimes the rich get poorer."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2012
      },
      "score": 100,
      "summary": "A succulently entertaining movie that invites you to splash around in the dreams and follies of folks so rich they're the 1 percent of the 1 percent. It's like a champagne bath laced with arsenic."
    },
    {
      "critic": "Noel Murray",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2012
      },
      "score": 91,
      "summary": "To an extent, Greenfield tries to have it both ways with her film: she allows us to enjoy the fantasy of being rich, while also letting us see the bastards suffer a little."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2012
      },
      "score": 90,
      "summary": "Schadenfreude and disgust may be unavoidable, but to withhold all sympathy from the Siegels is to deny their humanity and shortchange your own. Marvel at the ornate frame, mock the vulgarity of the images if you want, but let's not kid ourselves. If this film is a portrait, it is also a mirror."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2012
      },
      "score": 88,
      "summary": "Although it's a guilty pleasure, The Queen of Versailles is artful enough that both the prosecution and the defense could invoke it when the peasants cry \"Off with their heads!\""
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2012
      },
      "score": 88,
      "summary": "Everything about The Queen of Versailles, a documentary both sharply observant and deliciously funny, is jumbo-sized – the riches, the rags, his ego, her breasts, their steroidal pursuit of happiness."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2012
      },
      "score": 88,
      "summary": "By the end, the movie has pulled off a small miracle: You become absorbed in the lives of these people for who they are and not what they own."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2012
      },
      "score": 88,
      "summary": "Some of Jackie's dialogue is so good it would distinguish a sitcom."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2012
      },
      "score": 88,
      "summary": "The Queen of Versailles combines the voyeuristic thrills of reality TV with the soul-revealing artistry of great portraiture and the head-shaking revelations of solid investigative reporting."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2012
      },
      "score": 88,
      "summary": "Queen of Versailles is still worthwhile, not because it questions all-American entitlement but because it prompts us to think hard about what, exactly, we believe we're entitled to."
    },
    {
      "critic": "Scott Tobias",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2012
      },
      "score": 85,
      "summary": "Greenfield's refusal to pass judgment on the Siegels lends her subjects and their marriage unexpected complexity and depth - especially Jackie, a true force of nature."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2012
      },
      "score": 85,
      "summary": "There's a certain type of painful honesty that shines through in both their interviews toward the end and, particularly, in those with the staff."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2012
      },
      "score": 83,
      "summary": "Slickly made if not particularly stylish, the movie maintains its entertainment value for picking ideal models of American excess."
    },
    {
      "critic": "Steve Rose",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "Never has grotesque wealth looked so unenviable, or its removal been so entertaining, as in this garishly watchable riches-to-rags documentary."
    },
    {
      "critic": "Philip Wilding",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "A bizarre and mesmerising journey to the heart of Cloud Cuckoo Land."
    },
    {
      "critic": "Neil Smith",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2012
      },
      "score": 80,
      "summary": "It's perfectly possible to like the title character of Lauren Greenfield's documentary – Jackie Siegel – while detesting everything she represents: grotesque financial inequality, jaw-dropping ignorance and appalling bad taste."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2012
      },
      "score": 80,
      "summary": "The Queen of Versailles is funny, sad, infuriating, instructive. It's the American Dream inflated to ridiculous extremes, until it bursts."
    },
    {
      "critic": "Sheri Linden",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2012
      },
      "score": 80,
      "summary": "In Greenfield's canny and compassionate view, their post-collapse reality check is an emblem of consumerism as affliction, and surprisingly relatable."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2012
      },
      "score": 80,
      "summary": "This is certainly an apt time to make a crowd-pleasing movie about rich villains, but Greenfield is not an exploiter - she's an artist."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2012
      },
      "score": 80,
      "summary": "For Greenfield, the Siegels are a brilliant metaphor for everything farkakte about the U.S. economy and the culture that shaped it."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2012
      },
      "score": 80,
      "summary": "This timely and involving documentary elicits both sympathy and schadenfreude, as Greenfield regards her all-too-vilifiable subjects with a complexity that should impress viewers of all economic and political persuasions."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2012
      },
      "score": 75,
      "summary": "The Queen of Versailles leaves viewers with one feeling about the Siegels: Let them eat stale cake."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2012
      },
      "score": 75,
      "summary": "Watching The Queen of Versailles you don't know whether to laugh or cry."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2012
      },
      "score": 75,
      "summary": "The Siegels make the Kardashians and Donald Trump look like tasteful pikers when it comes to egregiously conspicuous consumption, sheer hubris and utter refusal to take responsibility for their actions."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2012
      },
      "score": 75,
      "summary": "The point of the film is not to scorn or mock the Siegels, despite their excesses. They embody the quintessentially American urge to live beyond one's means. Their saga is simply the story of a nation's materialism writ large."
    },
    {
      "critic": "Budd Wilkins",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2012
      },
      "score": 75,
      "summary": "Lauren Greenfield's film evolves from an ode to entitled obliviousness to a more evenhanded character study, tracing the fault lines that develop within the Siegel family."
    },
    {
      "critic": "Ray Greene",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2012
      },
      "score": 70,
      "summary": "Greenfield's fly on the wall view of obscene wealth punctured like a toy balloon is as current as a blog or a headline."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2012
      },
      "score": 70,
      "summary": "Like a Theodore Dreiser novel for our time, infused with the vivid, vulgar spirit of reality TV. It often had the sold-out Eccles Center howling, but also has elements of profound tragedy and allegory."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2012
      },
      "score": 67,
      "summary": "The Queen of Versailles encourages the very worst tendencies in the audience: to sneer at the Siegels, to marvel at their tackiness, to root for their fall from grace."
    },
    {
      "critic": "Karina Longworth",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2012
      },
      "score": 60,
      "summary": "I've seen The Queen of Versailles twice, and both times the audience laughed frequently at the Siegel family's sheer tackiness."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2012
      },
      "score": 60,
      "summary": "Director Lauren Greenfield has a catty eye, but she's not after simple schadenfreude as the Siegels' time-share hotels are foreclosed, the kids have to fly coach [gasp], and poops go unscooped by a phalanx of laid-off servants."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2012
      },
      "score": 50,
      "summary": "The Queen of Versailles will prompt loathing not only among the so-called 99 Percent, but among those in the top 1 percent who would like someone more sane to represent them on camera."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2012
      },
      "score": 40,
      "summary": "The steady wink wink of Queen of Versailles is wearing. I'd say Greenfield is exploiting a narcissist's willingness to talk endlessly about herself, but I think it just as likely that Jackie is exploiting Greenfield's willingness to listen. And to keep that wonderful mechanical eye focused on her."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "What a refreshing film after all the movies filled with gunfire  and other forms of violence substituting for a plot. If this wasn't true, you would have thought they had made it up. I kept wondering why they felt the need to build this monstrosity. But we all learned all much our society lived on debt and image when the economy crashed. I wanted to feel sorry for this family but you couldn't as they created their own situation. She is a tacky mess(I'm being polite). He is a money hungry type who I wonder if he even cared about the people whose money he took in through his time share business.I read an article in the NY Times about the film and how they are now suing the director. The house was going to be 90,000 square feet. Need I say more.",
      "total_reactions": 2,
      "user": "JamesL"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "This movie could so easily have been a big, broadside send-up of the the foolishness of tasteless, nouveau-riche materialism--and there IS a good degree of foolishness and tastelessness about the building of the Siegal's version of Versailles--but instead the couple/family, particularly the wife Jackie come off as somewhat sympathetic characters, caught up in pursuing a somewhat perverted, but nevertheless understandable and common version of the American Dream (one that you can identify in countless families across the US and elsewhere) , only doing so to a laughable, outrageous degree..Jackie has voluntarily taken on the role of (college-educated) Barbie-doll trophy wife and baby-maker (if not real mother) who wants terribly much to please her workaholic, inattentive husband who in turn sees himself as the \"pulled-myself-up-by-the bootstraps\" bread-winner who happens to have fallen on hard times.((His apparent sexism isn't overplayed in the movie, and the reported lawsuit against him by a former employee for sexual harassment isn't even mentioned,) The irony, of course, is that the couple doesn't seem to have a clue that when the recession hits and the banks try to take away their property, this is pretty close to what they themselves have been doing to their clueless time-share clients for years, and hence they are just as subject to the vagaries of capitalism as are the unsuspecting clients (and servants) on whom they've made their fortunes.They seem to believe (or rationalize) that they have \"done good,\" but in the end they are the butt of the same joke as the rest of us--the illusion of the (materialistic, consumption-obsessed)) American dream. And this is what makes The Queen of Versailles an exceptional movie.",
      "total_reactions": 4,
      "user": "metamotivcritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "This is one of the most honest and compelling accounts of the conspicuous consumption that's come to define the cliches of America's nouveau riche. There seems to be no end to the uncomfortable self-awareness of a crumbling empire. Absolutely fascinating.",
      "total_reactions": 2,
      "user": "huntergatherr"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "Schadenfreude - pleasure derived from the misfortunes of others.  The entire audience at the screening of The Queen of Versailles experienced this feeling about the Siegel family; they are truly atrocious people.  Two years ago, David and Jackie Siegel were billionaires.  They had planes, Rolls Royces, multiple nannies for their seven kids, hosted parties for the Miss America pageant while David flirted with the contestants, and sat on a golden throne in their Orlando house during interviews for this documentary.  They also began construction on a mansion called Versailles, a project which would become the largest house in the entire United States.  It appears the filmmakers wanted to document the rise of this monstrosity of a house and display the lifestyle of the obscenely rich.  Even better, these rich people liked to flaunt in front of the camera, not enjoy their splendor in private ala Bill Gates.  David Siegel proudly claims he is individually responsible for George W. Bush winning the state of Florida and therefore the presidency; however, he chuckles that what he did was not exactly legal.  Oh yes, schadenfreude.  David called himself the 'King of Time Shares'.  He built 28 resorts and an enormous building on the Vegas strip, parceled them up, and sold them 52 different times to vacationers.  Then, in what must have exceeded all of the filmmakers' expectations, the recession hit and everybody in the country stopped buying time shares.",
      "total_reactions": 3,
      "user": "CitizenCharlie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "I thought, ultimately, this was a nasty, tedious piece of work.  The early part of the movie is \"fun,\" in a guilty-pleasure, voyeuristic sort of way.  But then the repetitive depictions of these people's miseries and yuchiness just feels petty and spiteful.  Especially over-the-line was getting and showing on screen the couple's teenage daughter saying that she didn't think her father loved her mother.   Viewer's could easily draw the conclusion themselves-- exploiting a rebilious teenager to say it on camera reflects a level of spite that's just really unappealing.",
      "total_reactions": 0,
      "user": "jon44"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "A documentary that proves some of the statements made by F. Scott Fitzgerald in his short \"The Rich Boy\" (1926):  \"Let me tell you about the very rich. They are different from you and me. They possess and enjoy early, and it does something to them, makes them soft, where we are hard, cynical where we are trustful, in a way that, unless you were born rich, it is very difficult to understand.\"",
      "total_reactions": 0,
      "user": "DTDunn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "The Queen of Versailles is an important historical document because it’s a microcosm of the financial collapse of 2008 and its aftermath.  Director Lauren Greenfield began her feature-length documentary with the goal of chronicling the audacious construction of a new residence, the largest in the United States, based on and named after Louis the 14th’s old digs, Versailles.  What began as being potentially focused on this dream of the “King of Timeshares,” David Siegel,  it was his queen that won over the director and subsequently the viewer.",
      "total_reactions": 0,
      "user": "JohnWhisler"
    }
  ]
}