{
  "mc_avg_user_score": 5.8,
  "mc_metascore": 45,
  "mc_mixed_rating_frequency": 17,
  "mc_movie_name": "The Paperboy",
  "mc_negative_rating_frequency": 9,
  "mc_positive_rating_frequency": 22,
  "mc_pro_critic_reviews": [
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "Nicole Kidman gives her best performance since \"To Die For.\""
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "In the spirit of the venture, the entire cast gets down and comes off all the better for it. Both Efron and McConaughey get very messed up physically, and both actors seem stimulated to be playing such flawed characters."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "I've never seen a movie like this. Not on purpose. Daniels isn't saying he's tasteful. He's just saying that his tasteless trash is as deserving of our attention as the tasteful trash we feel like we have to see. The whole thing's a crazy fantasy, like watching a porno dream it can win the Oscar."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "The Paperboy is over-the-top every which way you look."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "Gator-filled swamps, an ultra-grungy murderer, racial undertones and a sexually charged atmosphere make up the tense and lurid world of The Paperboy."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "The Paperboy is great trash, and as Pauline Kael told us, the movies are so seldom great art that if we can't appreciate great trash, we might as well not go at all."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 70,
      "summary": "There is such unflinching passion in the piece that The Paperboy deserves to be seen even though it can feel almost as flawed as its characters."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2012
      },
      "score": 70,
      "summary": "This is a curio that demands to be seen."
    },
    {
      "critic": "Jonathan Kiefer",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2012
      },
      "score": 70,
      "summary": "When not contriving to get Efron out of his clothes, The Paperboy gropes for familiar movie language of its period setting: Soul music swells up excitedly over a jumble of jerky zooms, befuddling cuts, and spatial vagueness. But sometimes hot messiness has its charms."
    },
    {
      "critic": "Mary Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 70,
      "summary": "All the actors rise or bend to the challenge, giving juicy performances and seemingly having a fine old time."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2012
      },
      "score": 67,
      "summary": "Much of what happens in The Paperboy is so luridly bizarre you can't quite believe what you're seeing."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 63,
      "summary": "This hot mess got booed by the snobs at Cannes, but there's no denying its profane energy."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2012
      },
      "score": 63,
      "summary": "There are some splendidly over-the-top performances - chiefly those of Nicole Kidman and John Cusack, both cast against type - but the biggest narrative hole lies at the center. The lead character, played by Zac Efron, is dull, uninteresting, and poorly conceived."
    },
    {
      "critic": "Angie Errigo",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2013
      },
      "score": 60,
      "summary": "A superb Kidman takes off the handbrake, and most everything else, in Daniels' southern-fried follow-up to \"Precious.\" Watch it with \"Killer Joe\" for the ultimate sweaty, twisted double-bill."
    },
    {
      "critic": "Jamie Graham",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "A grindhouse mix of \"Wild Things,\" \"Killer Joe\" and \"Streetcar Named Desire,\" The Paperboy won’t be for all. But it boasts a soupy atmosphere and Kidman’s best turn for years."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "While the portrayal of Southern race relations in the '60s is less central here than in \"The Help,\" it's also less labored and earnest, and one could argue that it's subtler, more intimate and more honest."
    },
    {
      "critic": "Stan Hall",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 58,
      "summary": "While Daniels' work disappoints, his film is saved from disaster by uniformly terrific performances."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "Most of the performances are good in a flailing sort of way, and McConaughey, especially, is a standout in this year of his reinvention. Despite all its garish accoutrements and salacious underpinnings, The Paperboy can be a hoot to watch."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "The Paperboy is southern Gothic wallowing in the swamp of low camp. And if the wallowing were deliberate, this might have been hugely funny."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "The movie itself is a tad overheated. In the lurid, swampy, yet almost perversely engrossing follow-up to director Lee Daniels's \"Precious,\" the temperature is set to \"sizzle.\" Ironically, it could have used a little more time in the oven."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "It is by turns lurid, humid, florid, languid and stupid, but it is pretty much all id all the time."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "To say The Paperboy doesn't work is one thing; to say it's dull is a lie. This movie is berserk, which is more interesting than \"eh.\""
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "The Paperboy deserves to be seen for its pulpy, well-executed excess, but as a filmmaker, Lee Daniels seems ignorant of how the shocks distract from the story."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "The Paperboy is a nutty movie in terms of content, but it's also assembled in a demented fashion - there's a sense that literally anything could happen, and that its raunchy, heat-dazed story could wander down any path without regard to sense or an overall narrative."
    },
    {
      "critic": "Eric Hynes",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "The problem is that the filmmaker brings D-grade craft to these B-movie exertions, making his florid maximalism more entertaining to talk about than endure - despite the best efforts of his ardently slumming A-list cast."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 33,
      "summary": "Lee Daniels' The Paperboy is a rare case of serious commitment to outright silliness."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 30,
      "summary": "A risibly overheated, not unenjoyable slab of late-'60s Southern pulp trash, marked by a sticky, sweaty atmosphere of delirium and sexual frustration that only partly excuses the woozy ineptitude of the filmmaking."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 25,
      "summary": "Despite all the freaky business on display - and there are moments here when you cannot believe your eyes - The Paperboy suffocates you with boredom like a hot, wet blanket. You want to push it away and escape. It makes sleaze boring."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2012
      },
      "score": 25,
      "summary": "The Paperboy can't decide whether to be an unfunny sex comedy, a half-hearted detective story or a woeful race drama - so it decides to be all three, then becomes yet another movie (a swampy \"Heart of Darkness\") in the final act."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2012
      },
      "score": 25,
      "summary": "So why is The Paperboy so bizarrely dull? It's as if the filmmakers combined 18 different kinds of scalding-hot peppers, yet inexplicably emerged with oatmeal."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2012
      },
      "score": 20,
      "summary": "This is the kind of film that feels like a dream - but not in the good way. Rather, it resembles a dream in that it is made up of disjointed, loosely connected bits of surrealist craziness - ideas that might have seemed interesting in the twilight hours but that don't come close to standing up to the light of day."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2012
      },
      "score": 20,
      "summary": "It offers a deranged hodgepodge of tones and acting styles and strange mannerisms and affectations and narrative dead ends that feels like it was assembled by a committee of bipolar extraterrestrials."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 20,
      "summary": "It is likely to become an unintended camp classic, something we haven't had since \"Showgirls.\""
    },
    {
      "critic": "Scott Tobias",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "summary": "The words \"florid\" and \"inert\" are not quite antonyms, but it would nonetheless seem impossible for those two adjectives to apply to the same thing. And yet here comes The Paperboy, a swamp noir so spectacularly incompetent that even the ripest pulp attractions are left to rot in the sun, flies buzzing lazily around them."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2012
      },
      "score": 0,
      "summary": "This raunchy dreck, cut from the same disposable toilet tissue as the recent trailer-trash creepfest \"Killer Joe,\" is a leap downhill from \"Precious.\""
    },
    {
      "critic": "James Rocchi",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 0,
      "summary": "A lurid, florid, humid, flaccid and insipid waste of time and money for the audience and for everyone who made it."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2012
      },
      "score": 4,
      "text": "What a mess of a film. After \"Precious\" this just does not seem quite right coming from Daniels. Visually, the film is not bad. The cinematography is great, with a definite 60s glare to it, which works to truly transform your vision and make it seem as if it were shot in the 60s itself. The original score is pretty decent too, with some good tunes, especially \"That  man is dangerous.\" The storyline, however, is rather weak and the dialogue at times makes no sense. A lot is also left unexplained -- like McConaughey's love life and events surround that. It is rather gory and out there, which might repeal some viewers, but overall it is definitely an interesting film visually. What stood out to me (in a positive light) were the performances. Efron, though contained, was decent in his performance, as was McConaughey.  John Cusack was excellent as the vicious murderer Hillary. His manic look and twitches really brought Hillary to life, as a credible character. The absolute best thing about the film, however, was Nicole Kidman. She shines as the sultry, sexy, yet a bit dim-witted Charlotte Bless, who has a thing for prison convicts (i.e. Cusack in the film). She steals every scene she is in, and that is quite an achievement considering the cast. With  her platinum wig, short/tight outfits, and fake tan, she embodies her character perfectly. Another exceptional performance comes from Macy Gray, who unfortunately doesn't get too much screen time, but she does amazingly well with the little she's been given. It is the Viola Davis in 'Doubt' moment for 'The Paperboy'. Overall, a rather underwhelming film that, despite excellent performances, leaves you wondering what the point of the whole film was. Daniel's does seem to be at the top of his game directorially in many ways, but he has definitely missed the mark here.",
      "total_reactions": 2,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "It's not a crowd-pleasing movie; it's just and excellent movie. So dark, \"black as the pit from pole to pole\", so unforgiving about human flaws. McConaughey, Kidman, Cusack and Gray teach an acting lesson. Don't pay attention to the average score but to the huge spread among both critics and public. It tells you it isn't a movie for everyone. Zac Efron is here to show he has also an acting range, not to provide entertainment, good looks and a happy ending.",
      "total_reactions": 1,
      "user": "AlecCowan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "Three years after his Oscar-nominated dark horse Precious (2009, 8/10), Lee Daniels doesn",
      "total_reactions": 1,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "The Paperboy was an interesting film that falls flat due to misdirection. This murky crime drama was going in with a possibly decent story, but it was ultimately told in the messiest way possible, from the moment Macy Gray started narrating. Disastrous and divulging; the plot dissolves in the sea (or swamp, rather) of visual style the director tries to accentuate. Shot and edited with a lot of panache, there",
      "total_reactions": 1,
      "user": "lahaine2012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "One hot mess. A few moments of enlightenment provided by Ms. Kidman in this murky, meandering noir film.  Not a lot to love here.  I needed a shower after watching it.",
      "total_reactions": 0,
      "user": "LISTEN2ME"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "It's dark and steamy, but all too profound to ignore. Nicole Kidman gives one of the best performances of the year. The Paperboy is not an easy film to watch--which makes it all the more intriguing.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "Watching the Paperboy is a bit like being an observer watching a car wreck. One is inappropriately fascinated by the whole thing. Lee Daniels direction is very uneven (although not without its moments of style), and he seems to subscribe to the notion that nothing succeeds like excess. It doesn't! The film is handicapped from the start by voiceover narration that alienates the viewer quickly rather than getting them involved. The grainy and amateurish photography is also at first a distraction, even though as the film progresses it does seem to fit perfectly with the increasingly steamy and violent setting. Where Daniels has succeeded most is with the performances of his cast. John Cusack is suitably nasty as the killer on death row; Zac Efron perfect as the pretty boy maturing by events surrounding him, and the currently ever improving Matthew McConaughey is just great as the newspaper reporter with a secret. Shining above all these, however, is Nicole Kidman in the role of the trashy Charlotte. She steals the film. Even by her own high standards this versatile and accomplished actress is truly amazing. If the Paperboy was judged soley on the performance Daniels has drawn from Miss Kidman it would certainly be no mean achievement.",
      "total_reactions": 0,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "Interesting film with lots of great acting: Nicole Kidman, John Cusack, Matthew, everybody, including Zac Efron, I discovered that he is a real actor with this film. Can´t wait to see more roles from him. The biggest problem is the same that all Lee Daniels films have: too many things going on without completely going for it. He should focus on one particular issue in each of his films, the results would be better. But still, I really liked this one, the cinematography is great and many of the topics they handled were very interesting. Yes it´s a bit disturbing but it´s this director´s style. It´s like an American Almodovar. people should get over it. Just learn to embrace human nature.",
      "total_reactions": 0,
      "user": "sanyrub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "This film is messy just like everyone is saying. It's also a little thin in some places but this thinness works because it keeps the story light and fun despite its periodic lurid/grisly bubbling over  it is nearly perfect in what it wants to do; nothing appears forced or rings false (a credit to daniels) and of course the acting (even efron, whose blankness is necessary) is amazing.",
      "total_reactions": 0,
      "user": "GF_GF_GF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2013
      },
      "score": 2,
      "text": "One of those movies you watch until the credits roll, and are only left with a bad feeling in your stomach.",
      "total_reactions": 0,
      "user": "greygoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "This is an interesting film but only some people will like it. It has many things to say and show but the director doesn't achieve to show them in a good way. i like the movie though i expected more. Nicole Kidman impressed me with her sexual appearance-scene and the ending it's a little bit of dull and not what you would expect. However, i liked the movie and as I said in the begining some people may not like for different reasons. I liked it anyway",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2013
      },
      "score": 2,
      "text": "Very big fail  Kidman is the only one good thing in it  i love how she's risky when it comes to choosing her projects  but she better choose interesting roles in a better movies",
      "total_reactions": 0,
      "user": "AliBenzekri"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "Just a gross, creepy movie all around.  Not enjoyable in the least.  I can't believe Matt McConaghey accepted this role because he comes across pretty disgusting in this role and I will never look at that dude the same again.  Nicole Kidman looks like a typical plastic-surgery-face nasty hoe and Efron is completely head over heels for her. Its pretty unrealistic.",
      "total_reactions": 0,
      "user": "pl4tinum"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "\"The Paperboy\" 10 Scale Rating: 4.0 (Bad) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2015
      },
      "score": 7,
      "text": "Reading the reviews of this film I can see the point of view of why it might be trashy and \"camp\", though I would say this is a great exaggeration. There are one or two scenes that may be labeled as such but overall this movie contains beautiful shots, amazing acting from all 4 title names and a compelling story.",
      "total_reactions": 0,
      "user": "semirachan"
    }
  ]
}