{
  "avg_user_score": 5.1,
  "metascore": 23,
  "mixed_rating_frequency": 24,
  "movie_name": "The Cobbler",
  "negative_rating_frequency": 21,
  "positive_rating_frequency": 23,
  "pro_critic_reviews": [
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 67,
      "summary": "Flawed as it is, The Cobbler retains interest throughout, chiefly because Sandler isn't bad in a rare semi-dramatic performance."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 63,
      "summary": "Written and directed with precision and sensitivity by Thomas McCarthy (The Station Agent), it revives the pleasant art of storytelling most of today’s young filmmakers have all but abandoned, and cures (temporarily, anyway) my allergy to Adam Sandler."
    },
    {
      "critic": "Molly Eichel",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "A film that continues to grow more perplexing as it walks, not runs, toward an unsatisfying end."
    },
    {
      "critic": "Kerry Lengel",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "The Cobbler definitely won't please the audience for Sandler's mainstream blockbusters, and it's unlikely to win him new fans among the indie intelligentsia, either."
    },
    {
      "critic": "Esther Zuckerman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "What starts off as a potentially charming fantasy never finds its footing."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2014
      },
      "score": 50,
      "summary": "In a movie built on the idea of walking in someone else's shoes, shouldn't learning to see others as more than stereotypes be fairly central to the plot's development?"
    },
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2015
      },
      "score": 40,
      "summary": "With its unusual central conceit and awkward, somnambulant pacing, The Cobbler feels like a quirky foreign comedy that’s been mis-translated into English, losing all the subtlety and humour in the process."
    },
    {
      "critic": "Gary Goldstein",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "The gimmick is marginally amusing as Max tests it out in ways both naughty and nice. But so many holes, questions and contradictions arise that it's hard to square the rules of the game."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 38,
      "summary": "Whatever McCarthy hoped to do with this thin story and star casting, all he ended up with was another average Sandler movie — not as bad as some, no better than most."
    },
    {
      "critic": "Andy Webster",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2015
      },
      "score": 30,
      "summary": "The sophomoric humor may be absent, but in its place is only a soufflé of whimsy, seasoned with soot, that fails to rise."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2015
      },
      "score": 25,
      "summary": "The Cobbler goes from bad to you-have-to-be-kidding in that final act, when we’re given a big reveal that makes no sense, even in the context of a bat-bleep crazy fable."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2015
      },
      "score": 25,
      "summary": "Bad things can happen to talented people. Take Tom McCarthy, who wrote and directed \"The Station Agent,\" \"The Visitor\" and \"Win Win.\" All gems. His fourth film, The Cobbler, is a failure on every level."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 25,
      "summary": "Maudlin when it’s not being offensive, The Cobbler belongs to that special class of comedy that seems to get worse with every new (mis)step it takes."
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2014
      },
      "score": 25,
      "summary": "While the idea is original, it's also ridiculous, and the story is not close to clever enough to put it into any kind of context that is compelling, interesting or believable."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 24,
      "summary": "When it seems like the movie can’t get worse, it does, with a finale that’s just cringe-inducing and far too neat and tidy. It’s the kind of climax that undoes all of McCarthy and Sandler’s efforts to make us invest in Max and his story."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2015
      },
      "score": 20,
      "summary": "Throughout The Cobbler, Sandler himself seems more invested than he’s been for a long time. But the rest of this ghastly movie lets him down."
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2014
      },
      "score": 20,
      "summary": "The result is a slow-motion zeppelin crash that starts as a dull-edged fable, and then spirals further and further out of control without ever growing more exciting or interesting."
    },
    {
      "critic": "Brian Tallerico",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 12,
      "summary": "The Cobbler is almost fascinatingly awful enough to recommend. If one subscribes to the theory that you can learn as much from a bad movie as from a good one, this one’s a master class in what not to do."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 12,
      "summary": "A painfully earnest and totally unfunny magic-realist fable set on the Lower East Side that works in no way whatsoever."
    },
    {
      "critic": "Chuck Bowen",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2015
      },
      "score": 12,
      "summary": "Thomas McCarthy evinces no interest in the people who come into Max's store and wind up as fodder for his increasingly violent and self-absorbed escapades. Not a shred."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "summary": "The Cobbler has invented a new category of terrible: cruel schmaltz."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "summary": "The Cobbler is such a weirdly somber comedy that it would almost be in poor taste to laugh during it, though there’s not much danger of that happening."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "It's quite an odd film. Those tired of seeing Sandler doing the same old stuff over and over again should give this one a shot. With all it's weird charm and interesting concept there's something new for Sandler to do here. This semi dramatic comedy might not hit all of the right notes, but what's here is plenty entertaining.",
      "total_reactions": 2,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2015
      },
      "score": 7,
      "text": "In my opinion it was an okay movie - maybe because I don't slack off Sandler as much as others do, but don't worry, it wasn't like all of the acting was done by him here - if you know movie's premise, then you know that he basically gets to be other people while wearing their shoes etc. So actually some other actors were involved heavily too. What I disliked was that the plot was a bit loose and did not come together completely - I mean there were so many flaws and the ending, maybe not predictable early in the movie, became more and more obvious and it actually kinda didn't make that much sense (not that most of it did). While it has some funny parts, don't expect much comedy here (not that it is drama either). Movie itself was interesting to watch in the sense that you wanted to know what will happen, even though some parts were a bit disappointing and actually repetitive. Plus I did not get how walking in other people shoes and being them will give you that much really - I mean you still have to do bad things to gain money or women or whatever, but they kinda made it that it is meant for doing good things - I just did not get what things actually.Anyway, if you want something more serious and without over the top acting etc, then this is for you and it is a watchable movie, even though you might forget what happened there after a while.",
      "total_reactions": 1,
      "user": "Ralfbergs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "It's a deep movie if you can understand it's meaning, it shows that family means something beyond just flesh and blood, thank you for this movie, I enjoyed it alot.",
      "total_reactions": 1,
      "user": "beluganoc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2015
      },
      "score": 0,
      "text": "Há filmes com roteiros falhos, atuações ruins, piadas fracas, cenas sem nexo e horas de tentativas desesperadas de prolongação de um filme que tem tudo para dar errado...e The Cobbler não passa de uma junção de tudo isso.",
      "total_reactions": 1,
      "user": "LucasTReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2015
      },
      "score": 9,
      "text": "Honestly, not sure why so many people dislike it. People talk about terrible characters, etc. when describing comedies, especially this film. Although, in all honesty, comedies are supposed to make you laugh, and nothing else.",
      "total_reactions": 1,
      "user": "therockunleashe"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "Adam Sandler has made an array of dubious movies for several years now, filled with cheap jokes and crude slapstick moments. The Cobbler has significantly different direction than all of those, it brings an odd near magical concept that unexpectedly works. While it also has a couple of flaws like some corny jokes and predictable plot devices, it remains entertaining without forced juvenile moments and delivers genuine laughs.",
      "total_reactions": 3,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "The Cobbler is not one of Adam Sandler's over the top, poorly acted and incredibly bad comedies, it's more of a fantasy drama with a comedic tone. I am a big fan of Reign Over Me, I only have great things to say about that film, and every time that I see a drama with Adam Sandler's name stamped on it, I still rush to see it.",
      "total_reactions": 3,
      "user": "wornoutspines"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "Thoroughly enjoyable fantasy that intermingles humor with pathos and charm. Don't miss it. Reminiscent of a Twilight Zone episode, but far better. Al star cast with Sandler, Hoffman, Buscemi. The reviewers who pan it should find another line of work.",
      "total_reactions": 5,
      "user": "cedatty"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "Yes! Sandler's back! I caught The Cobbler on VOD, and was surprised that it was a Adam Sandler movie. To my surprise, I had fun with it. The movie is a fresh turn from Sandler's poorly acted, gross comedies, I mean this guy made classics! The Longest Yard, The Waterboy and now, The Cobbler. The movie is funny, I know Sandler has lost his charm over the years, with That's My Boy or Jack and Jill, but the whole thing clicks, well. The Cobbler is a fantasy mixed with comedy, and boy was it intriguing, this may be the most interesting work that Sandler has done! Max Simkin, a shoe repairer, gets a special power, that he can be whoever wore those shoes, it sounds silly, but it works well with what Director Thomas McCarthy wants to introduce. The critics can pan anything, but their biggest target is Adam Sandler movies, this one, doesn't need panning, it's a GOOD movie. Overall, The Cobbler is a fun, wild ride that may be Sandler's best work yet. The man IS back.",
      "total_reactions": 8,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "Ignore the pompous \"big\" critics. They exist only to tear things down. The Cobbler was a pleasant surprise for me. This movie is neither a comedy, nor a drama. It's more of an urban fantasy or fairy tale...so you don't have to be too shocked by the idea that a man who can cobble shoes can also transform into the owner of the shoes. Yes, it's outrageous...it is meant to be! Enjoy the story. The Cobbler is fun, surprisingly sentimental, and a wild little ride. It's not perfect, but it's not bad either. If you enjoy a fun and outrageous story similar to that of The Brass Teapot, you should love this, too!",
      "total_reactions": 2,
      "user": "Bongela"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2015
      },
      "score": 0,
      "text": "I could only watch 50 minutes of this film.  During that time the main character transforms himself into three different African-American characters.  The first time Sandler's character becomes an African American he \"skips out\" on a check at a restaurant.  The second time Sandler's character becomes an African-American he forces a man to take off his shoes, then steals them.  The forth time he becomes an African-American, the person he doppelgangs is an actual criminal, with African-American friends who are also criminals.  The only African-American who is not represented as a criminal is an obese teenage boy.  I was thoroughly disgusted with this movie.  How small minded and uncreative to seek humor at the expense of African-Americans.  These kinds of stereotypical representations of African-Americans fuel racist ideologies, and birth new ignorance daily.",
      "total_reactions": 5,
      "user": "TheRealMcCoy"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2015
      },
      "score": 2,
      "text": "The Cobbler is very close to being unwatchable and it hurts me to say this because I generally like Adam Sandler movies. First off the plot of the movie is just not something that people would find interesting in 2015. No one gets their shoes repaired anymore. Then there were several parts of the story that I found underdeveloped and then the film become a crime movie unnecessarily while continuing to be so unfunny throughout the movie. I hate to say it be Sandler's performance is lazy and could be the worst I have seen from him. Weirdly enough though I don't think the film could be made any better. It just really did not need to be made. Its that simple.",
      "total_reactions": 4,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2015
      },
      "score": 2,
      "text": "The Cobbler is a stupid film. Its an underdeveloped with characters that are forgettable as a nightmare. Lazy, boring and by the end, incomprehensible.  Another garbage film that stars Adam Sandler.",
      "total_reactions": 2,
      "user": "csw12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "I don't know what's really going on with Adam Sandler in the recent years, he was actually out of the league for a while from entertaining his fans. All he did was overdose comedies which were below par compared to his earlier movies. I said in 'Blended' review that I'm tired of his movie, but watched it only because of the director. All his films were very impressive and I believed him on this one, more than the Sandler. Otherwise, it would have been undoubtedly a skippable flick.",
      "total_reactions": 1,
      "user": "LeZee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "Let's be glad that us audiences and critics did not get another mean spirited Adam Sandler comedy. The humor is mildly impressive, especially for an \"Adam Sandler movie,\" when the movie started it was boring. And I never saw a boring Adam Sandler comedy, in addition we should be glad that the people that were not involved in Grown Ups. Grade B-",
      "total_reactions": 1,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "A cobbler in New York finds out that when he uses his dads old machine to mend shoes and then puts them on he becomes that person. After utiising it for fun, things become slightly more serious when he gets involved with a girl trying to save the local neighbourhood, local criminals and helping his mother come to terms with his fathers death. For an Adam Sandler film this is certainly a step up from his usual fare, and for the most part this is a charming Capra-esque comedy, which only falls apart towards the end as it tries to hard to please.",
      "total_reactions": 0,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2015
      },
      "score": 5,
      "text": "The movie is not nearly as bad as many have claimed. Yes, it is stupid and nonsensical, but it has redeeming qualities. It does try to make a story out of an interesting premise.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2015
      },
      "score": 2,
      "text": "Trying to write a review for an Adam Sandler movie is like trying to write an epitaph for a person you really don't like very much. This movie is also a great way to help your insomnia.",
      "total_reactions": 0,
      "user": "WJS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2016
      },
      "score": 4,
      "text": "I have no idea how Thomas McCarthy did it, but it's quite unbelievable. One minute he's an Oscar front runner, and then all of a sudden, a favorite at the Golden Raspberry Awards in one year. I'm not sure if I should be giving McCarthy round of applause for doing the impossible or ask McCarthy what he was thinking.",
      "total_reactions": 0,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "I think that because Adam Sandler is in this movie its in to bash it.  I dont think that he is at all bad in this film.  He portrays a kind of simple soul is all.    I mean the guy fixes shoes and lives with his mother.   Not Mr Excitement.   I do believe as others have commented that its slow but overall its a good film thats original.  Theres no zombie teenage vampire robot from space in this movie and thank god for that.",
      "total_reactions": 0,
      "user": "gshum888"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "The Cobbler to start off was funny i say that because there are parts that are funny, but was it the funniest Adam sandler movie ever no not even close but is it an Adam sandler movie i could watch a least one more time Yes and i gave it a four because to me it was a rushed movie and the cast was off . to make this movie better they should have casted some famliar faces, like the ones in his upcoming movie Pixels.",
      "total_reactions": 0,
      "user": "MovieMadHawk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2016
      },
      "score": 2,
      "text": "Adam Sandler proves that he's no longer trying anymore when it comes to the Cobbler, a piece of a pie that should've been thrown in front of his face when this movie was released to theaters.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2016
      },
      "score": 4,
      "text": "Tom McCarthy, director of Best Picture winning film Spotlight directs this stupid Adam Sandler flick.",
      "total_reactions": 0,
      "user": "Graham433"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2016
      },
      "score": 5,
      "text": "At least it saved his movies with a movie that was not a total drag. But, equal it was a bad movie.Destroyed by the critique and ticket office, a sorrow is not worth seeing her",
      "total_reactions": 0,
      "user": "2016"
    }
  ]
}