{
  "mc_avg_user_score": 6.2,
  "mc_metascore": 42,
  "mc_mixed_rating_frequency": 75,
  "mc_movie_name": "The Lovely Bones",
  "mc_negative_rating_frequency": 40,
  "mc_positive_rating_frequency": 128,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2011
      },
      "score": 1,
      "text": "Entirely too long.  Entirely too stupid.  Entirely too boring.  There was less drama in the OJ Simpson trial.  I'll never get this time back.  I would have gladly chopped off one of my own lovely bones to forget I ever saw this movie.",
      "total_reactions": 2,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2010
      },
      "score": 0,
      "text": "A really bad film! the characters had no depth, the scene seemed to go from bad to worse and dragged on and on. Coupled with a lack of realism and what looks like and LSD job, the movie fails to deliver completely.",
      "total_reactions": 2,
      "user": "ingo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 2,
      "text": "Whether or not it may be positive or negative, Peter Jackson will be remembered as one most prominent directors of the 21st century - I am not of course discounting his work in 1990's Heavenly Creatures. After directing perhaps an unsurpassed trilogy of Tolkien's Lord Of The Rings, Jackson once again attempts to recreate literature, but now approaches a work that is more contemporary with The Lovely Bones.  But unlike the success in which he recreated the Lord of the Rings to near perfection, Jackson completely misses the mark on this one.",
      "total_reactions": 2,
      "user": "RyanGee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "Its TOTALLY underrated! Its visually stunning, well acted, well directed, it had an interesting premise and some very intense scenes! It had it's share of suspenseful moments and it's touching moments and that's hard to do that as well as this movie does it. I loved the movie and I believe that it should have gotten the ratings it deserved. And no, I'm not going to say I would recommend it to everyone, because it's not for everyone, my mother refuses to watch it due to its premise of a innocent teen being brutally murdered. It does seem quite upsetting at points and if young kids would watch it, it may cause them nightmares. But it's a good movie",
      "total_reactions": 1,
      "user": "UtopianStuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2016
      },
      "score": 0,
      "text": "One of the most stupid movies that I've seen. How could such an idea come to someone in the head? The maniac kills a girl and ... then what? Nothing. This film virtually ends. Great!",
      "total_reactions": 1,
      "user": "qamaster"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "Despite it's fragile face-paced story that emotionally repeats what it's trying to say, Peter Jackson's \"The Lovely Bones\" is a well made fantasy movie...at least from a technical viewpoint here.",
      "total_reactions": 6,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2010
      },
      "score": 3,
      "text": "I have waited over a year to watch this move, the reason you ask: well after reading and loving the book, I couldnt wait for the movie and with baited breath caught the first trailer for it on tv, it started well enough with Susie salmon declaring she was dead and then the next scene was of a massive ship breaking out of a even bigger glass bottle and trees turning into birgs...WTF...So I gave it a miss!! So after a year of walking past it countless times at the video shop I finally gave it a go...and I wasnt wrong to wait for DVD!! Peter jackson in all his incredibleness (yes that is sarcastic) has fallen into the biggest directors trap (ahem...Steven Spielberg and A.I.) and that is, \"just cause you can do something...DOESNT MEAN YOU SHOULD!!! The whole heaven concept is ridiculous and a simple voiceover would have sufficed and focused more on the real story, that of her family and longings!!This movie could have been magical and fantastical had it trusted our imaginations, as the book did. Mr Jackson has taken out all its magic and force fed us with fantasy scenes that belong more in Disneys fantasia than in a tragic story such as this!!! What kills me is that this movie could have just been so good...oh well, lets wait for the swedish to remake it!!!",
      "total_reactions": 4,
      "user": "Sausage"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "Peter Jackson should hang it up big time along with his buddy Speilberg. What was this?? It was stupid trash, that is what it was.Don't waste your time with this trash.",
      "total_reactions": 4,
      "user": "MovieMan12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "People expect this movie to be dark and gloomy, but it is not, is it a happy and moving film. Yes, this movie is sad, but it is a very inspirational film, Saoirse Ronan is an amazing actress, one to watch! :D",
      "total_reactions": 2,
      "user": "MovieMadness"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "It really is quite a beautiful movie. It is rather unique. Acting is great along with the pace. The ending is sad but a spectacle at the same time. I didn't know what to expect from this movie but it certainly pulled through.",
      "total_reactions": 2,
      "user": "Trev29"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2012
      },
      "score": 7,
      "text": "Peter Jackson  is not as good as he was in the lord of the rings,but this movie has good performances,amazing visuals  and a script that touches the heart.",
      "total_reactions": 2,
      "user": "rodrique"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "vzdfdffrrgrge",
      "total_reactions": 6,
      "user": "oscarr"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "Coming to this long after the critics had mauled it, I was surprised and impressed with how good it is. I haven't read the book, so I can't comment on its fidelity to source material, but Jackson creates hyper-real worlds where saturated seventies garish and the usual unforgiving close-ups he adores somehow endow genre stereotypes with a peculiarly hallucinogenic depth. Oddly, the spacious landscapes of the afterlife somehow feel more real than the suffocating scenes of suburbia and the household, but perhaps that's wishful thinking!",
      "total_reactions": 3,
      "user": "GeorgeBailey"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "42... emm.... what the heck!? Maybe it is not a masterpiece, but it is a very good film and not a movie of 42 score... OMG and films like Breaking Down has more score...",
      "total_reactions": 3,
      "user": "tomymg"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "Saoirse Rohnan leads The Lovely Bones to victory with a mind blowing performance, and Peter Jackson doesn't do a good job by differing visual beauty which it has and utter horror where the whole story is, but it is actually a well made film. I give this movie a 72% of a good one.",
      "total_reactions": 7,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "A beautifully crafted film that resonates with evil, love, vengeance, and the devastating effects of the death of a child at the hands of a serial killer. The critics who pan this movie must be bereft of sensation. I thought it was mesmerising!",
      "total_reactions": 4,
      "user": "Sankalpa"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "i think that this film was very emotional it adds a lot of drama especially for the kind of story that it is. the cast performed very well and convincing especially Saoirse Ronan. for those who have read the book it adds suspension knowing what is going to happen and knowing the events that are building up in the movie",
      "total_reactions": 2,
      "user": "Andy92"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "I saw the Lovely Bones sometime last year and went in expecting actually a boring chick flick, what I got was actually a intellectual and visual appealing and exciting thriller about a child serial killer and how it affected a family. This film was very well done. Kept all likes of people interested I feel. You had the guys being taken care of from the aspect of the thriller, girls by the character's short lived romance as well as the family dynamics, some comedy was thrown in as well, and the visuals for the people who care about such things. I definitely suggest watching this if you want somewhat of a thriller but...a different kind. Not gory or anything just suspenseful and shocking. 3.5 out of 5.",
      "total_reactions": 1,
      "user": "Kingmush"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "My opinion is that the film started very good, it kept me tensed and interested but then got in the idea of heaven and how it was described was very bad. First you think that her fathers investigation will lead to the truth, but then somehow she sends him signal from heaven and he starts to suspect him, although it was emotional which i was i gave it 5, the movie needed more scenes like the one when her sister finds the book in the neighbors house",
      "total_reactions": 1,
      "user": "ndricim"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "Just when you start to feel sad- BOOM THERES A DOUBLE RAINBOW!!! Sorry I couldnt be helped. But yeah, the contrast between grief and giant rainbows and butterflies is pretty nicely done. I actually enjoyed this movie. I love Mark W's constantly confused-looking face, it warms my heart. There was too much time spent in rainbowland, I agree with most people here, but one thing i disagree with is: Character development. This was decent enough, for the time spent in the real world. The father goes from obsessive ship builder to crazed obsessive maniac daddy from hell, the sister goes from being an extra to an active character (did she have any lines at all??), and the son, went from almost suffocating to a half mentally challenged cild, hooray. I did not like the mothers character. Waah, im portraying the familys grief, and im gonna go abandon my kids... Its not deep, but when you cut out all the rainbows the movie is rather short, and there wasnt much time for them to develop more than this. Definately worth a watch (or a stream) at leat once. Its great for someone like me, who lacks emotional capacity and is easily distracted by bright shiny rainbows ^^.",
      "total_reactions": 1,
      "user": "kammi666"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "THE LOVELY BONES based on a best-selling novel written by Alice Sebold. The story about a girl named Susie who has been murdered and her vacillation between earth and heaven. If you watched the trailer, the movie offers tremendous images of heaven. But, after I watched it, substantively I did not find surprising element on that description. The heaven images have similarity on what we seen in WHAT DREAMS MAY COME (1998). But in the other hand, I think the movie was successfully delivered the drama in a romantic and beautifully way. The essence of the story is simple, but we can feel clearly sorrow and confusion around the characters. The narration and glimpse of the Susie past in the beginning of film brings us sufficient mood to build sympathy. The Scene was involving Suzie and her boyfriend, Brian (Jack Kebel) is a scene-stealer on thiz movie. Thiz is a recent movie directed by Peter Jackson, one of the greatest Directors in our era (LORD OF THE RINGS Trilogy (2001-2003) and KING KONG (2005)). Susie Salmon played by Saoirse Ronan. Ronan made her promising debut on great drama ATONEMENT in 2007. Mark Wahlberg and Rachel Weisz played as her parents and Susan Sarandon as her grandmother. The villains played convincingly by Stanley Tucci. I think Saoirse Ronan has a potential skill to become a great Actress in the future, even greater than Dakota Fanning.",
      "total_reactions": 1,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "I wouldn't say I enjoyed The Lovely Bones because saying I enjoyed this film would sound rather disturbing. I would say I found it interesting. The best part in this film for me is the acting. The acting was great. The special effects were good too. The story was okay, a little touching, a little creepy and a little happy. The thing I didn't like about the story was the ending. The film was good and interesting.",
      "total_reactions": 1,
      "user": "Commen0136"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "With Peter Jackson at the helm, and an star cast (including Rachel Weisz and Mark Whalberg) this  was looking promising. The story line stems around the death of a teenage girl, and the journey through the various human experiences of existentialism, love, grief and karma - with the story following various character paths. All good so far; unfortunately all the promise that could be seen 'on paper,' falls short to live up to the all-star cast, with even the talisman that is Jackson at it's helm, it cannot be rescued from a mediocre status; a movie full of an inflated sense of self importance, semi-broken plot lines, which are just barely rescued by the talent at hand.",
      "total_reactions": 1,
      "user": "Rhetoricalmuse"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "I'm not sure why people haven't learned that most movies aren't going to be like the book. A book is meant to be cut in you own imagination and interpretation. That's the beauty of a book.  A director and writer are going to have their own view along with what will score at the box office. Accusing a movie for not being like the book is like accusing a garage band for selling out. Eventually they gotta feed the family. No I wasn't a big fan of the fantasy land but I liked the stark reality of her death. I think it speaks to the harsh realities of our time that you can't let your 14 year-old daughter travel by herself anymore. Yeah Walberg had his usual hushed voice and confused looks but again that's the movie. Picture him more intelligent when you read the book if you like. I haven't read the book but when I do like with The Time Travelers wife I'm going to seperate somewhat.",
      "total_reactions": 1,
      "user": "tvbuff"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "Peter Jackson was from a far than ideal position when making The Lovely Bones. Receiving both audience and critical acclaim for his Lord of the Rings Trilogy, then braving an ambitiously epic remake of his own favourite film King Kong, audiences were expecting something spectacular. In making The Lovely Bones, Jackson has the unenviable task of depicting the afterlife on film. No matter which direction he went in, he was bound to be chastised by somebody. In my humble opinion, not having read the book the film is based on, I feel Jackson has made a film of both numerous successes and failures. All scenes grounded in reality, dealing with Susie Salmon's murder and the aftermath are superb. They are dark, and emotional to the point of heartbreak. You really feel for Susie, a young and optimistic dreamer full of potential, whose life is cut tragically short. Mark Wahlberg also impresses as her father, who is unable to let go of his daughter's memory, and who is driven to investigate her murder himself. Wahlberg once again proves himself to be an extremely competent and versitile actor who deserves far more acclaim than he has thus far received. While these moments are truly memorable, when attention shifts to Susie in limbo, Jackson appears to lose focus. This is a world populated by jarring visuals and half-baked ideas. You despair every time you have to return to this world - it's not only unfocused and ill-defined, the afterlife is really boring! Give us more of Stanly Tucci's creepy child-killer and Susie's family's heartache, we  want no more technicolour philosophical ramblings! Jackson had an almighty challenge to face, and he had a degree of success, but not nearly enough to make a lasting, impressionable film.",
      "total_reactions": 1,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "The Lovely Bones is a frustrating experience but it compels and embraces the imperfection and flaws that it makes. It isn't like your typical drama and its probably one of the few that you'll ever find this decade. The story is an adaption to Alice Sebold's 2002 The Lovely Bones (which is by far the honest and most inspiring novels of our time) but with Peter Jackson (Lord of the Rings Trilogy and King Kong) behind the helm for the big screen. He has his own ways and (if you've seen him direct his other movies) he loves to put in some CGI effects but never full overload. However, I must say that he did make the heaven scenes look all that clichÃ",
      "total_reactions": 1,
      "user": "Leeway"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "Great film.  I hadn't read the original novel, but reading the critics reviews of that and a synopsis Peter Jackson, Fran Walsh and Phillipa Boyens did a marvellous job adapting it, not sure whether I would now want to read the book though.  I loved the imagery in the film and how it plays emotionally and that is the key to this, it is magic realism, and if you like that genre both in novels and films this is a must see.",
      "total_reactions": 1,
      "user": "loveandlaughter"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "The cast, the soundtrack, the production design, and the cinematography are excellent, but little by little the film is losing its axis, and the viewer's attention,  it's like three movies in one. Anyway as I said before, this film technically is really beautiful, and a girl called Saoirse Ronan is stunning.",
      "total_reactions": 1,
      "user": "jtfoix"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2013
      },
      "score": 6,
      "text": "The Lovely Bones was an award winning novel, turned into a major motion picture in 2009. Peter Jackson signed on to Direct and Steven Spielberg was the Executive Producer, so the budget for this film was massive, but it didn't do so well, leading people to believe it was a bad movie. While it was different from what the readers expected, the film was still better than average. The story is told by Susie Salmon (Saoirse Ronan), a 14 year old girl, who was murdered. Susie introduces us to her family and to her killer in what I saw as a mix between Ghost and What Dreams May Come. The story is extremely strong and very well written, but it isn't without it's problems. For instance, we learn the identity of the murderer almost immediately. There are also huge gaps in the story between when we see Susie in purgatory and when we see her families again. Saorise Ronan plays Susie and continues to amaze me. I honestly haven't been that crazy about most of the films I've seen her in, but she never seizes to amaze me. It really is only a matter of time until she's in the right film and gets national attention. By then, not only will people know her name, but they'll know how to pronounce it too. She is supported by some big names like Stanley Tucci, who at this point in his career has convinced me that he can play just about any role. The Lovely Bones is a great story, but it wasn't done in a way that appeals to mass audiences. The scenes in purgatory were never ending and there are big holes in the story, but the cast is terrific and the story is really good. If you're into films that stray from the norm, you might really enjoy this one.",
      "total_reactions": 1,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "On one hand, you have a film wasting its opportunity to be a beautiful adaptation of a beloved book--and the other, an Oscar-worthy performance from Stanley Tucci.",
      "total_reactions": 1,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "Peter Jackson has finally screwed up. Though not terrible, the movie was a disgrace compared to his other films. The problem with The Lovely Bones was that Mr. Jackson blurs reality and with non reality and the movie loses your interest because of that.",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "Great film actually! It make me think a bout revenge and let think go for greatest good.Beautiful portrayal of the abtract and ethereal consequences of tragic loss - an amazingly accurate portrayal of a unique and thought provoking novel.",
      "total_reactions": 1,
      "user": "dannytran555"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "What else starts sigh is its stunning art direction, surreal scenarios, photography and visual effects. Already in the category plot, she is very badly handled, becoming forced showing that Jackson does not know what he really wants to do or show.",
      "total_reactions": 1,
      "user": "Iky009"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "The film 'the lovely bones' is really moving as it brings you into the life of the girl and her experiences- you really get to feel what she does. I also loved the supernatural element questioning what happens between life and death and whether you still have a connection with the real world. The film also made you think about how other peoples minds work and what goes on in the minds of psychopaths as well as presenting relationships between the girl and her family after she dies. I would not say it has a great storyline or has lots of action, if that is what you are looking for, but it is great for making you think and is a film that you will definitely remember for the right reasons! The acting is also brilliant",
      "total_reactions": 1,
      "user": "sunshine101"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "Quite an underrated movie if I must say. The suspense in the third act of this movie was exquisite, the characters were somewhat relatable, but the big downfall of this movie was the drawn out ending with the love interest, it was unnecessary and boring and just didn't need to happen whatsoever. The drama created was exceptional and did entertain me through about half the movie.",
      "total_reactions": 1,
      "user": "TrilobiteG"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "A depressing tale of the young Susie Salmon, whose life is cut short by her serial killer of a neighbor. This film had good actors, but something was missing. Susan Sarandon's role brought some humor into the story, where many parts were sand and gloomy. As I've heard, some points of the novel (that the film is based off of) weren't well translated from text to screen.",
      "total_reactions": 2,
      "user": "sil3nt_nick"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "The Lovely Bones isn't tender enough.",
      "total_reactions": 1,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "While choppy in terms of storytelling, it kind of fits in with the situation. Ronan and Tucci fit their characters perfectly and as a result produce a heartfelt and powerful watch.",
      "total_reactions": 1,
      "user": "KaptainHutchino"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "A beautiful film that deals with vengeance and the effects that come when a loved one dies. This film needs to give thanks to Saoirse Ronan who carries this film with grace and beauty.",
      "total_reactions": 1,
      "user": "lkaliba"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "Je viens de le voir, le paradis à son charme. Très bien filmer, les personnages sont très attachent, la narration et excellente. On voit que pour mettre en place le personnage du psychopathe il on dut travailler sur les technique de prédation de ces derniers, tous y est.",
      "total_reactions": 2,
      "user": "JuanPiron"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "One flew over the cuckoo's nest is a strange but brilliant cinematic piece. Jack Nicholson without a doubt proves illness can be cured with innocence and assurance.",
      "total_reactions": 1,
      "user": "SushiStoner"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "Not as good as I hoped it would be.  It starts off really well, then about the time Susie is murdered it slowly dies away.  It is also too long (which proves that it was written by Peter Jackson).  However, the characters are very likable and the movie has excellent performances by Saoirse Ronan and Stanley Tucci.",
      "total_reactions": 1,
      "user": "JosephASowell"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2017
      },
      "score": 6,
      "text": "Довольно скучная драма.",
      "total_reactions": 1,
      "user": "russiangamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2015
      },
      "score": 5,
      "text": "\"The Lovely Bones\" is a very electrifying and poignant film, but not so much if they pass from one place to another quickly , if we tangle much, but the visuals are perfect , the bad is that it's a bit boring , and Thematic has to do with the problem of sexual abuse, but that you are not interested .",
      "total_reactions": 1,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2016
      },
      "score": 9,
      "text": "The Lovely Bones is probably a much better idea for a book than it is a movie, but it's still a very good one, and those don't come along too often.",
      "total_reactions": 1,
      "user": "avamiller21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2011
      },
      "score": 3,
      "text": "After watching this movie I wanted to through it out the window, all of the characters seem brain dead, I mean come on you've got the proof of the murder TELL YOUR PARENTS DON\"T JUST STAND THERE LIKE A RETARD!!!! and it's just an unenjoyable movie, I mean it's a good concept, that if improved upon could make a great movie, but for now it sucks.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2016
      },
      "score": 4,
      "text": "The Lovely Bones has a lot going for it, but the more I thought about it, the more I truly came to dislike the film. The cast, led by Saoirse Ronan, is great. In particular, Stanley Tucci is phenomenal and really captures the perfect vibe and mannerisms for his character. Mark Wahlberg and Rachel Weisz are also good here. Additionally, the film is really well shot and the premise is very good. The special effects are also well done, but are really where this one starts to die. The special effects are wasted continuously on scenes that are simply not needed and add nothing to the film. In fact, they only serve to make the film dumber with their nonsense. The film's very base logic argues against itself, leading for a very troubling message to arise that it is okay to kill somebody for revenge and it is the only way to get into heaven. Numerous characters are so poorly written it hurts. Hell, most of them do not even need to be here. They themselves are fluff. Filled to the brim with fluff, the film continues to hurt itself by having scenes where character's motivations make no sense and an absolutely absurd romance. Overall, The Lovely Bones is far too pretty to completely disregard, plus Ronan and Tucci make this one well worth your time. However, as a piece of cinema, it is serious lacking.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "What a disappointment. This film is confusing at best, boring at worst. I really don't know what it was trying to say.",
      "total_reactions": 0,
      "user": "ypomoni"
    }
  ]
}