{
  "mc_avg_user_score": 6.4,
  "mc_metascore": 43,
  "mc_mixed_rating_frequency": 24,
  "mc_movie_name": "The Uninvited",
  "mc_negative_rating_frequency": 8,
  "mc_positive_rating_frequency": 37,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2011
      },
      "score": 5,
      "text": "The movie is not a horror movie, is an interesting thriller that hooks you until the end, it won't give you fear, at most a fright, but it's still very good. The crowd likes movies much worse saying that is great. The big problem with this movie was playing guess in the face of the viewer all the time that her stepmother was bad, I can not remember if but... manipulate our thought. That thing to bet the killer, you know? The problem is that the film always pointed in the same direction, so the movie can give you a big surprise ending, which I guessed at parts, the other part that I didn't serve was really shocking... It's a great film, which suffers a lot yes, but worth being seen. I've watched this movie so many times coz I love it so much!",
      "total_reactions": 1,
      "user": "jimmytancredi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "One of my favorite movies ever.  The movie really shows the revenge and sick mindedness that some people posess and the climax was the part that revealed how much a girl can alter and change the lif of everyone in the family.  A definite must see",
      "total_reactions": 1,
      "user": "gagaforever"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "What is it about this film that I really liked? Was it Emily Browning, whose portrayal was focused and memorizing playing a girl who has been released out of a mental hospital as she was traumatized by the death of her mother? Was it Elizabeth Banks, who played the stepmother that surprisingly charms and seduces the screen? Was it Christopher Young, who compose a score so beautifully for a horror movie?  It certainly wasn't the rubbish special effects and child actors. But The Uninvited leaves you satisfied and never goes blatantly over the top.  Some have said the ending was predictable, I didn't feel that at all.",
      "total_reactions": 0,
      "user": "shlugalug"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2010
      },
      "score": 3,
      "text": "This movie was... ok? I didnt really like it. Everybody pitched in decent performances but this is trying so hard to be horror but it fails epicly. It shouldve been left as a murder mystery/thriller. It shoved in supernatural aspects but it came across as mediocre and gimmicky. Then when the twist came at the end, it makes no sense. Once i hit the twist I asked myself \"what was the point of watching this then?\" The twist was awful, but it gets points for being unexpected.",
      "total_reactions": 0,
      "user": "MetalMan95"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "I am so glad I purchased this film.",
      "total_reactions": 0,
      "user": "danielb1982"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "\"The Uninvited\" is a really amazingly great horror-thriller, this is what I call dramatically disturbingly scary movie, every second is enjoyable, from the beginning tell the end, perfect!",
      "total_reactions": 0,
      "user": "HaithamBayazeed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "You know, the story starts to beat you and you will create multiple opportunities for all, and it turns out that, in the end, is the most annoying of them.",
      "total_reactions": 0,
      "user": "khutch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2016
      },
      "score": 10,
      "text": "Remarkable flick! Most horror movies can only grab your attention for the first 30 minutes or so and then they wear off and become predictable. Here they managed to work horror scenes into thriller perfectly. And that plot twist...",
      "total_reactions": 0,
      "user": "Danil"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "The Uninvited is interesting and suspenseful, but is brought down deep because of It's useless plot twists, predictable content, and a disappointing conclusion.",
      "total_reactions": 0,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2014
      },
      "score": 2,
      "text": "This movie is dull, not scary and does not keep me interested in the film. The poster is just a propaganda and it should not be believed. This is a terrible horror film.",
      "total_reactions": 0,
      "user": "supermann234"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "This is the remake of my favorite Asian horror film, A Tale of Two Sisters, so I think I set my sights high for this movie. I've gotta say that I'm a little disappointed. The movie is about this girl that comes home from a mental hospital, her dad gets a new psycho girlfriend after his wife dies, and there's a ghost in the house. The supernatural parts of this were shoehorned in just to make it more appealing to American audiences, and the scares were mostly generic PG-13 jump scares with bad CGI ghost children. In the original movie, there was a ghost in the house, but it wasn't the main focus of the movie. Back to the crazy girlfriend, her story is what makes this movie interesting. There are a few good twists in the movie regarding her, and I wish that the entire movie was about the girlfriend rather than some random, unexplained ghost in the house because the movie's most intense scenes involved her. There's also this twist at the end that's really good if you haven't seen A Tale of Two Sisters. The Uninvited has a decently interesting story and a good ending, but it's mostly boring and not very scary.",
      "total_reactions": 0,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2016
      },
      "score": 2,
      "text": "A movie cannot gain credit for an ending alone. For an hour and twenty, this movie is so dull. I like a slow-moving film, but seriously,, there is nothing to sink your teeth into. The main character is boring, the setting is boring; and the soundtrack is just awful. Any tension dissipates as soon anything happens, because what you get is some laughably corny, supposedly scary, thing. It fails to make the most of the otherwise good directing, by the Guards, and the already plot from the original film.",
      "total_reactions": 0,
      "user": "Joellemm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "Absolutely loved this movie. The plot is fairly predictable at times, yes, but unless you've got a stick up your ass - which most people seem to these days - the plot twist at the end of the movie makes it worthwhile. I'd love to watch something similar in the near future.",
      "total_reactions": 0,
      "user": "Umbra7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "This is a great film with a big twist! You just don't expect the ending at all! Great watch.",
      "total_reactions": 0,
      "user": "choomtabi31"
    }
  ]
}