{
  "mc_avg_user_score": 8.6,
  "mc_metascore": 68,
  "mc_mixed_rating_frequency": 44,
  "mc_movie_name": "The Place Beyond the Pines",
  "mc_negative_rating_frequency": 17,
  "mc_positive_rating_frequency": 458,
  "mc_pro_critic_reviews": [
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2013
      },
      "score": 100,
      "summary": "The music, the cinematography, the acting choices, the daring plot leaps — not a single element is timid or safe...The Place Beyond the Pines earns every second of its 140-minute running time."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2013
      },
      "score": 100,
      "summary": "I think you’ll find it as fresh, original and breathlessly exciting as I did."
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 100,
      "summary": "A brilliant, towering picture, The Place Beyond The Pines is a cinematic accomplishment of extraordinary grace and insight."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2013
      },
      "score": 91,
      "summary": "It's a story languorously told in three chapters, the first two in the late 1980s and the third 15 years later. Each could be a movie unto themselves. Together they prove Cianfrance to be an effectively unobtrusive storyteller, crafting without artifice what book critics would call a page turner."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 91,
      "summary": "That the movie succeeds both as a high-stakes crime thriller as well as a far quieter and empathetic study of angry, solitary men proves that Cianfrance has a penchant for bold storytelling and an eye for performances to carry it through."
    },
    {
      "critic": "Leah Churner",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2013
      },
      "score": 89,
      "summary": "The film is so velvety textured and dreamy, I would’ve stuck around for more. That is Cianfrance’s special talent."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2013
      },
      "score": 88,
      "summary": "This is a story about legacy, the sins of the father, the restlessness in our souls. It's powerful, it's bold, it hits you hard."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2013
      },
      "score": 88,
      "summary": "It is a better, more fully felt and moving picture than \"Blue Valentine.\""
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 88,
      "summary": "A riveting crime thriller, it's also a multi-generational familial saga that approaches Greek tragedy."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 88,
      "summary": "Don't let the quiet, indie stylings of The Place Beyond the Pines fool you. This is a big movie with a lot on its mind. Slowly, it unfolds into a kind of epic."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2013
      },
      "score": 83,
      "summary": "Cianfrance is the real deal, and anyone who can persuade talented Hollywood stars to enact nonironic, intelligent, ambitious drama should be encouraged, especially when the result is something like this."
    },
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2013
      },
      "score": 80,
      "summary": "An enormously satisfying film: carefully observed and consistently compelling, it feels like an instant American classic, if a minor one."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 80,
      "summary": "It's not a perfect film. There's still room for Cianfrance to grow as a storyteller. But it is entirely rewarding -- and I, for one, can't wait to see where he takes us next."
    },
    {
      "critic": "Olly Richards",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2013
      },
      "score": 80,
      "summary": "In trying to tell an enormous amount of story it can spread itself too thin and leave some strands feeling unfinished, but when it’s at its best, this is beautiful and bold filmmaking."
    },
    {
      "critic": "Jamie Graham",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2013
      },
      "score": 80,
      "summary": "Gosling and Cooper use their star currency to power a slow-burn, heartsick drama. \"Blue Valentine\" director Cianfrance is a serious talent."
    },
    {
      "critic": "Calvin Wilson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 75,
      "summary": "The acting is first-rate. Gosling masterfully fills in Luke’s motivational blanks, and Cooper nicely handles Avery’s evolution from idealist to manipulator."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "It's a beast of a movie, an emotional roller coaster that threatens to go off the rails, and does. But Cianfrance, working from a scrappy script he wrote with Ben Coccio and Darius Marder, takes you on a hell of a ride."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "The characters are interesting and capture our sympathy and, although there are things to criticize about the final forty-five minutes, it brings the saga to a conclusion. There's a lot to like about The Place Beyond the Pines even if it isn't the feel-good movie of the spring."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "Few actors are as riveting doing absolutely nothing, and The Place Beyond The Pines perfectly typecasts Gosling as a noir staple: the decent but rudderless drifter driven to violent and desperate action."
    },
    {
      "critic": "Laremy Legel",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "There is true beauty in the despair that pervades The Place Beyond the Pines, a film plotted out in triptych, a treatise on the moral compromises we all make to protect and provide for our loved ones."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2013
      },
      "score": 70,
      "summary": "The risk of telling three distinct-but-related stories is that all may not be of equal quality. That’s the case here, as the movie starts strong but gets progressively weaker, particularly in the third act."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2013
      },
      "score": 70,
      "summary": "The Place Beyond the Pines can’t be said to be anyone’s movie but Cianfrance’s. Structured as a triptych, the movie is novelistic, earnest and somewhat exhausting — an ambitious effort that tries to be many things. And it is definitely something: a sprawling, engaging study in fathers, sons and sins."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 70,
      "summary": "The movie is intimate in its telling, sweeping in its issues and stumbles only occasionally."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 70,
      "summary": "The movie’s soulful self-seriousness, like that of its liquid-eyed hero, can occasionally slip into self-parody. But this movie confirms my \"Blue Valentine\"-based suspicion that the 38-year-old Cianfrance is one to watch. He’s capable of coaxing tremendous moments from actors, he knows how to move a camera, and as this over-laden but never boring movie shows, he’s willing to operate from a place of risk."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 70,
      "summary": "One-third wonderful, The Place Beyond the Pines weakens as it unfolds for lack of what makes the early part so good."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 70,
      "summary": "The three-part story, spread over nearly two and a half hours, represents a triumph of sympathetic imagination and a failure of narrative economy. But if, in the end, the film can’t quite sustain its epic vision, it does, along the way, achieve the density and momentum of a good novel."
    },
    {
      "critic": "David Rooney",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 70,
      "summary": "Cianfrance generally shows again that he knows how to build immersive characterizations with his actors. And while this sorrowful triptych is uneven and perhaps overly ambitious, the director displays a cool mastery of atmospherics and tone."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2013
      },
      "score": 63,
      "summary": "Once again, Cianfrance handles the individual scenes with menacing aplomb but, once again, the whole is much less than the sum of its parts."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2013
      },
      "score": 63,
      "summary": "It’s very much a film about men, their yearnings and discontents, and about the way sins tumble down from one generation to the next. It’s a bank-robber movie, too, as well as a drama about the pressures teenagers face from parents and peers. You can feel Cianfrance biting off more and more until his mouth is too full to chew."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 60,
      "summary": "The poetry in The Place Beyond the Pines can be elusive, but also easy to get lost in."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2013
      },
      "score": 60,
      "summary": "I never stopped being interested in The Place Beyond the Pines, and never stopped rooting for Cianfrance to make the hubristic ambition of his immense tripartite scheme pay off, even as it evidently falls apart."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2013
      },
      "score": 60,
      "summary": "The Place Beyond the Pines is a much bigger canvas, and scene by scene it can be riveting...But the disparate pieces never quite jell; the movie is all trees and no forest."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2013
      },
      "score": 60,
      "summary": "Yet after the actorcentric fireworks of Cianfrance’s \"Blue Valentine\" (2010), it’s impressive to see him going after a wider sociopolitical scope, one that would have been better served by a less repetitive structure."
    },
    {
      "critic": "Henry Barnes",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 60,
      "summary": "The Place Beyond the Pines is ambitious and epic, perhaps to a fault."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 50,
      "summary": "While the scope of the movie is bigger, its impact is smaller. \"Blue Valentine\" was a precise, heartrending portrait of a marriage coming apart at the seams. The theme of his new movie is a lot harder to discern."
    },
    {
      "critic": "Mark Jenkins",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "Too much of this seething drama is devoted not to characterization but to posturing."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "It's a slow-burner that burns so slowly its wick completely fizzles out."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "Unwieldy, overlong and overly reliant on melodramatic coincidences, A Place in the Pines is still better than it has any right to be, thanks to its cast."
    },
    {
      "critic": "Read full review",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "Cool, violent, a cigarette dangling from his mouth, Gosling reprises his inexorable-loner routine from “Drive.” Cianfrance and the screenwriters Ben Coccio and Darius Marder wrote thirty-seven drafts of the script, but gave him almost nothing to say. He rides, he smokes, he knocks over banks, he loves his baby, and that’s it."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "The segments are essentially monodramas, so sketchily written that the big moments feel less like recognizable human behavior than recognizable screenwriter overreaching."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "Two half-stories about fathers and sons on opposite sides of the law do not a full movie make in The Place Beyond the Pines, the overlong and under-conceived reunion between “Blue Valentine” director Derek Cianfrance and lookalike star Ryan Gosling."
    },
    {
      "critic": null,
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "The film never reaches a climax because it's always in one, distilling the lives of its characters to their tensest moments."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "This hard-to-remember title is actually the native tribe's name for Schenectady, which is where the movie takes place…in 3 parts. First, motorcycle stunt rider (Ryan Gosling) decides to stay in the town where he's fathered a child (with Eva Mendes). His turn to crime segues into part 2, when a good cop (Bradley Cooper) faces corruption on the force. Part 3 takes place 15 years later. Director Derek Cianfrance LOVES Gosling (they did the self-indulgent \"Blue Valentine\" together). He lingers on his face in extreme closeups, while Gosling broods and emotes. The rest of the cast is also strong, but it's the complex, compelling script that involves (except the contrived clincher near the end). This is a relentless downer, but a completely absorbing experience.",
      "total_reactions": 4,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "I would have given it a higher rating if it were not for the facts that a) it goes on for waaaay toooooo long, b) Ryan Gosling, as brilliant as he is in this film, is basically playing the same character as in Drive, c) I was confused as to what the meaning of the film was  please don't tell me it's the sins of the fathers pass onto their sons! d) Eva Mendes, doing a fine job, yet appeared like a miscasting to me. Those points aside, all the actors in the film did a mighty fine job  with both Bradley Cooper and Ryan Gosling being outstanding. They gave depth to their characters and made them real; both were flawed yet relatable and believable. The first two parts feel like this is a film about choices and how they can affect not only your life, but those around you. The last part, regarding the lead characters' children, although beautifully acted, lacks insight and therefore goes a bit off the rails for me. Nonetheless, this is a film I would recommend.",
      "total_reactions": 2,
      "user": "ypomoni"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "It's certainly a movie worth seeing, and I'm a big fan of Derek Cianfrance (especially the fantastic Blue Valentine), but this movie gets long and unwieldy after about a third of the way in.  It was unfortunate that more of the lead characters couldn't interact through more of the film.  What I will say is that the mood, the music, and the visuals are outstanding, so even if it gets a little meandering toward the middle and the end (and you get the dreaded \"10 years later\"), it's something that should be experienced.",
      "total_reactions": 1,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "You will either walk out of this movie being incredibly thankful for the life that you have, or you will see the world as completely messed up and pointless. This is not a happy movie. It makes Blue Valentine look like Singin' in the Rain. The script is fascinating, but it reveals truths about some aspects of life that are hard to even mention, let alone sit through two and a half hours of, during a movie. The cast is overall very strong, especially Dane Dehaan, who deserves an Oscar nomination for his performance. This is a very frustrating movie, probably because it is so realistic. It is absolutely my favorite movie of the year so far, and another resounding success on the director's part.",
      "total_reactions": 1,
      "user": "MichaelDN"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Though it feels like the director is looking for something more than it already is, Place Beyond The Pines provides great performances including a stepping stone performance for Eva Mendes.",
      "total_reactions": 1,
      "user": "TheWalrus2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2013
      },
      "score": 4,
      "text": "Disappointed with the disjointed nature of the movie at times. I was wishing for it to just get to the point of its obvious need to connect some important message between the death of the father, his murderer and the evolution of the orphaned son. I love Gosling in general but I was to eager for the movie to end---anywhere!",
      "total_reactions": 1,
      "user": "Venusian"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "A very peculiar production by Derek Cianfrance, The Place Beyond the Pines, it tells a story in three separate parts. The first part of this movie is about a lost and confused man with a job in a traveling carnival trying to provide for his child by robbing banks. The second part of the story tells the story of a cop transitioning into a politician after dealings with dirty cops. The third part of The Place Beyond the Pines explains the fall out 15 years later when the first 2 character's sons meet each other. There are obvious stains in Cianfrance's creation but The Place Beyond the Pines is by far one of the most daring and brilliant films to be released so far this year.",
      "total_reactions": 1,
      "user": "AlanWynne1992"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2013
      },
      "score": 5,
      "text": "The Place Beyond the Pines rushes out to a fast beginning giving the audience so much but by half way through, becomes a slow and drawn out film that loses its intensity it once had.",
      "total_reactions": 7,
      "user": "csw12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "Easily the best of 2013 so far. This movie had so much emotion with the soundtrack, characters, and symbolism. Where Django Unchained had me at the edge of my seat with excitment and laughter, PBP hit me right in the heart and soul.",
      "total_reactions": 11,
      "user": "sami1101"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "This can only be described as  major disappointment. The story trajectory is sound, but the whole thing is so slow and drawn out that any real involvement with the characters just doesn't happen. Also, unlike many critics I was more interested in the segments involving Bradley Cooper and the two sons than I was in the Ryan Gosling section, despite this actor's obvious magnetism. It's a shame because there are some wonderful nuances and subtleties throughout  which just made me yearn for the film it might have been.",
      "total_reactions": 3,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "'The Place Beyond the Pines' rushes through it numerous sections and fails to incorporate the plausibility and emotional depth required to make it the authentically gritty drama it desperately wants to be. Dane DaHaan is the only redeeming feature in a film which is too clichéd to be taken seriously and too drawn out to be entertaining.",
      "total_reactions": 3,
      "user": "LaGuerta"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2013
      },
      "score": 3,
      "text": "Very good acting, slow tedious development of the drama. Three different episodes poorly laced together. I'd rather seen them as three individual stories. No cinematic innovation in three very predictable outcomes.",
      "total_reactions": 5,
      "user": "Nak"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2013
      },
      "score": 3,
      "text": "The story is so melodramatic that this movie is a failure, despite its technical and stunt strengths.  It is a failure despite one's suspicions that the melodrama is deliberate.  It's a failure despite reuniting the Cianfrance/Gosling team from Blue Valentine.",
      "total_reactions": 4,
      "user": "Mike_M"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "Ryan gosling part is great and in first hour movie flow's nicely.But in the kids scene movie start to suck.Seems like 3 different parts are merged and it won't fit in and damaging the flow. overall acting is near perfection.",
      "total_reactions": 2,
      "user": "Smee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "Breathtaking cinematography. Beautiful and compelling. Incredible first act, story overlaid onto a town like Schenectady which is as much a character in the way it affects the players.",
      "total_reactions": 2,
      "user": "huntergatherr"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "The best movie I've seen so far in 2013.  The first two parts of this film are fantastic led by great performances by Ryan Gosling and Bradley Cooper.  The third part while good does lack compared to the first two, but the first two are so good it still deserves a ten.",
      "total_reactions": 2,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "This movie is amazing. I feel like Cianfrance knows me, my parents and my family the way he weaves characters together. Blue Valentine already hit close to home and this is Cianfrance doing his thing on a bigger scale. He is a master behind the camera and he has an amazing team in front of the camera. I'm sure this movie will have many haters for its unwieldy structure, but I love this movie and I know others will stand up for it as well. Derek Cianfrance, please keep making movies, because they really do it for me like no other movies do.",
      "total_reactions": 2,
      "user": "PajamaAstronaut"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2013
      },
      "score": 2,
      "text": "You have to be kidding.  The movie doesn't end, and so predictable, that it's almost laughable.  Who writes this stuff?  Great actors with two movies rolled into one.  Both terrible.",
      "total_reactions": 3,
      "user": "fantasy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "I was eagerly awaiting for this film to come out with expectations that it would be special.  And even though I was not disappointed by the end result, I am still a little annoyed as this could have been a masterpiece.",
      "total_reactions": 1,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "If you loved Ryan Gosling in Drive then you should leave this one. The guy starts growing a serious vagina about 20 minutes into the film and ruins everything. Loving that woman and her kid in Drive was fine. He was emotional and intense without saying a word. In this film he starts talking about wanting to see the look in his baby's eyes as he eats ice cream for the first time. I switched it off at that point. Also, why the hell would anyone decide to start robbing banks to support a baby they've only just found out they've got? Yeah good idea, risk getting yourself banged up for a few years, good parenting.",
      "total_reactions": 1,
      "user": "Lambo442"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "Garsh, I loved this movie. Reminded me of A History of Violence, another great movie. I will see almost any movie that has Ray Liotta or Ed Harris in it.",
      "total_reactions": 3,
      "user": "MrThistle"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "The best movie of 2013 so far. good drama, action, acting, and direction.  Strong story about life's lessons.  Long movie but it moves along smoothly.",
      "total_reactions": 2,
      "user": "gfny"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "This is a riveting movie.  Although long, it moves at warp speed.  Beautifully filmed, judiciously edited, and acted impeccably, it is as urgent and moving a film as I have ever seen.  I was not a fan of either Bradley Cooper and Ryan Gosling or Eva Mendes--that has changed.  It is the supporting players, however, who steal the film.  It's a tough minded, morally complex, greatly moving fillm.",
      "total_reactions": 2,
      "user": "amboy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "Not enough praise can be given to a film like this. It boasts a great cast, beautiful cinematography and a raw, haunting and provoking score. But what makes it truly stand out is the bold, never timid, screenplay. One of the more engrossing cinematic experiences I've ever had.",
      "total_reactions": 1,
      "user": "Seriosity"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "Easily the very best movie of 2013 thus far. And one of my favorite movies. It was just excellent. The setting of the movie really made it all. Small town New York. It really captured the meaning of Sins of the Father. And how they can carry generation to generation. It was just perfect execution on both sides. This was a movie that was totally unpredictable. I would have never seen the direction of Luke go the way it went. It was a thrill ride to watch from start to finish. It was a lot better than Cianfrance's Blue Valentine, and I loved that movie. Dear Derek Cianfrance, Please continue to make movies. If The Place Beyond The Pines budget was indeed $15 Million, I can't imagine what you could do with a $40 Million budget. Signed, Clay Merritt",
      "total_reactions": 1,
      "user": "ClayMerritt"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "The first really good movie I've seen this year. Sucks that it takes until mid-April for a crime-thriller-drama this good to finally hit theaters. ...Beyond The Pines was refreshing, I did not know exactly where the story was going, and although the run time is over two hours long, it paces itself well. Nice to see a movie starring some big \"names\" share the screen without one or the other taking over the picture for the sake of their celebrity. Just a good story, well acted and crafted. This movie has put Derek Cianfrance in my list of filmmakers to watch out for.",
      "total_reactions": 2,
      "user": "vdiaz9"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "Amazing film. After 2010s Blue Valentine, Derek Cianfrance again partners with Ryan Gosling on a film about the workings of the family unit, but this time he focuses on fathers in particular. The film is split into three interrelated storylines, each one so well done and excellently developed that we almost get 3 (great) films at once. At a lengthy 2hrs. 20 minutes, The Place Beyond Pines packs a powerful punch thanks the involving story, perfect performances from the cast, and the flawless direction from Cianfrance. He was somehow able to catch every actor at their absolute best and most realistic moment on camera; the performances are all stunning. Ryan Gosling, Bradley Cooper, and Dane Dehaan are electric, and Eva Mendes, Rose Bryne, Ray Liotta, Ben Mendelsohn round out a stunning supporting cast. Though I felt the film was a bit heavily plotted at times (a bit like Blue Valentine was as well, actually), overall the film remains grounded. I fell for every bit of it. Thought provoking, unpredictable, and wholly original, The Place Beyond the Pines is one of the best films of the year.",
      "total_reactions": 1,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "One of the more emotional films I have seen. A great film with Great cinematography and a beautiful soundtrack. Gosling's performance and Mendehlson;s were the most impressive of the film. Towards the end it starts to get a little shaky but overall I was very happy with it. A crime film about fathers and the legacy's they leave for there kids. Go see this film.",
      "total_reactions": 1,
      "user": "fsasking11"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "I read through the positive user reviews of this movie, and it made me think I watched a different movie, than the one they viewed. The way the go into detail about the positives, makes me think they are part of the production crew.  I was bored out of my mind watching this. I kept checking my phone countless times, to look at the clock.",
      "total_reactions": 11,
      "user": "Qgal5kap"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "It's original, fresh and so lavishing that you will cry at the end. The Place Beyond The Pines is a elegant cinematic masterpiece by Derek Cinafrence who has made great films like Blue Valentine. The film has very good thrilling sequences of lore and dramatic sequences of love. The film has great pace and movie quality. The Place Beyond The Pines is epic.",
      "total_reactions": 2,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "This movie was very disappointing to me. I went into it knowing almost nothing about the plot or characters except that Ryan Gosling played a character somewhat similar to that of Drive, an edgy, sometimes soft-spoken man, but full of intensity and anger bordering on rage at other times, (Drive is in my top 3 movies of all time list). The first \"act\" of this movie was absolutely phenomenal, but I can't help but feel somewhat annoyed that all of the main characters never mingled and interacted with each other like a big-name cast usually does. For me, the climax of this movie was less than an hour into a 2 1/2 hour venture, and I still find myself wondering how the director possibly thought the rest of the film could live up to Gosling's performance. The character portrayal and acting in this movie is absolutely top-notch and it should be watching for just that reason alone, but the story telling brought it down a little short of landing near my all-time favorites list. If the director had somehow copied the intensity and real, raw emotion of the first hour and transplanted it into the remainder of the film, it might have been talked about as all time time great, not just one of the best of the year.",
      "total_reactions": 1,
      "user": "Andrew214"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "This movie was like none I've seen in a while. It captures how a single exchange with a human being can alter our life forever, the impact one person can have on our life. It captures how life comes full circle and does it in such an original way. It's like watching 3 films in one. Brilliant. Brilliant. Brilliant.",
      "total_reactions": 1,
      "user": "Cinemaholic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "One of the best films i have seen in 2013 so far. The story is fantastic, and Bradley Cooper is brilliant! Also the movie has a great twist. Also one of the better father and son movies.",
      "total_reactions": 1,
      "user": "Thefilmnerd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "For a change we have a movie that wends in ways least expected and it comes in 3 parts. If you've seen the promo it's about part 1. This may be a tad long for the younger generation but it has a retro feel to it that us older folk like. It has an hors d'oeuvre of different actors, all enjoying their cameos to the hilt, and the steady, delectable presence of Eva Mendes, in a toned down mode. Let's just say that the sins and virtues of the fathers get carried down to the sons, in different guises.",
      "total_reactions": 0,
      "user": "jeremyp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "If the first  third of the movie could have been compressed to 15 minutes and the whole story told in two halves,  this would have been a better movie. Maybe the director felt that he owed Gosling screen time, performing a character he had already done in \"Drive.\" The overlong first part does pay off, however: the last two parts of movie compelling viewing. And I hate to say this--but the actor Emory Cohen reminiscent of young Brando.",
      "total_reactions": 0,
      "user": "warfield"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2016
      },
      "score": 9,
      "text": "This is a great movie. The plot is interesting, the characters are interesting, the cinematography is interesting... THE WHOLE THING IS JUST INTERESTING!",
      "total_reactions": 0,
      "user": "almo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "A Place Beyond the Pines is nothing if not interesting, with it's three-act protagonist switching structure and time spanning plot. That said, none of the acts really attain much depth and certain aspects (such as Ray Liota) are not given the time they deserve. As a result A Place Beyond the Pines often feels shallow where it should have depth.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2013
      },
      "score": 1,
      "text": "A true independent art film. It does have a good start (but that is almost a whole other movie in itself) and a good ending (another movie) but the middle hour is unwatchable at times because of the overly dramatic art film tone... \"I am a serious film shots\". I couldn't believe how many people kept getting up in the middle to go to the restroom because things were so slow. Very unusual. There is a solid 90 minutes in a 140 minute film. You got the feeling that there was either pressure to keep some scenes of the A list actors in (so as not to offend them for having actually shot them) or the director's (student film ego) wouldn't allow it to be cut. Either way, if interested, rent the DVD so you can fast forward and see the good scenes and skip over over the top drama. You can come into the film 40 minutes late and it would probably be better. The middle wouldn't be so boring because you would be pieceing things together.",
      "total_reactions": 0,
      "user": "nameless"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "Metacritic really should have a way to delete reviews​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​.",
      "total_reactions": 0,
      "user": "Hedja"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "We initially meet Luke as he walks towards his day job as a stunt bike driver, suiting up with his back to the camera is Ryan Gosling as the heavily tattooed man, wearing tattered clothes and constantly smoking cigarettes, I was immediately reminded of Mickey Rourke walking from his day job as a butcher in 'The Wrestler' as he hears the crowd around him, Luke has a unique talent as one of the bike riders, but his world changes when a former flame, Romina (Eva Mendes) comes back into his life, he is inadvertently met with the news of having a son. We realise the effect that news of such a multitude can hold, Luke changes his whole way of life in the hope of spending more time with his son, he runs into a friendly mechanic called Robin, he sees the talent in Luke but also sees it for a much more law-breaking sense. Luke and Robin soon embark on various bank robberies, initially to make more money to support Lukes family, but he ends up enjoying the adrenaline rush that comes with the territory. Robin is played by Ben Mendelsohn, who has really taken a career leap after is limited but effective appearance in The Dark Knight Rises, through his actions, we see the dangerous man that Luke is, he adores his son but not many others, brought to meaning by a strong performance as Gosling who is continuing to climb the ranks as one of the most sought after leads in Hollywood. But we also have a bigger picture, as an unprepared Luke runs into the law in the form of young cop Avery, played by Bradley Cooper,who takes the reins as the film begins to shift focus onto his character in fluid and well documented fashion, the cleverest part of this transition is the scenes that bare resemblances to earlier scenes involving Gosling, director Derek Cianfrance has did this to show the similarities of two men at opposite ends of the law, dealing with corruption, love and struggles in a marital relationship. We he quite a scope of film which opens up various side plots and also has a few time jumps which addresses characters and their ongoing life. A very calculated and edgy story keeps this film interesting as it always keeps is guessing with little given away to what the outcome is going to be, it builds at a slow pace to give its more pivotal scenes that added sense of urgency, as Luke bikes along the road it's like we're on the bike with him, candid and thrilling. We also have a small but memorable appearance from Ray Liotta, capitalising on grief while also being corrupt. The film finds its strength in its ability to piece everything together like a puzzle as the film moves forward, Dane DeHaan continues his hot streak in films with an almost show-stealing performance as the grown up son of Luke, while also starting a dysfunctional friendship with AJ (Emory Cohen), the son of Avery. This is a fascinating piece that has various plots that all fit together, strong performances round off a dramatic and clever story that never gives too much away, a scene that DeHaan and Cooper share outlines everything we know from the film, Coopers character asks if his son is alright, to which DeHaan replies \"This isn't about your f*****g son\" but we immediately realise the film has everything to do with these children, a subtle yet powerful approach to a simplistic telling.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "The place beyond the pines is a 2012 drama film directed by Derek Cinafrance (director of Blue Valentine) with Ryan Gosling, Bradley Cooper and Eva Mnedes. The plot is divided into three parts: the first part speaks of Luke (Ryan Gosling), a motorcyclist who was discovered to have had a son from his relationship with Romina (Eva Mendes), who is now married to another, she decides to start robbing banks to support his son. The second part talks about Avery (Bradley Cooper), a policeman while chasing Luke that he had robbed a bank, kills him and is called by all as a hero but this one did the will leave an enormous sense of guilt that will bring with him for a long time. The third and final part speaks of the children of Luke and Avery who become friends but later this friendship will crumble and the son of Luke, Jason, he discovers the truth about his past. A very ambitious film that succeeds thanks to the direction and screenplay of Cinfrance, to strike the viewer. The film teaches us the importance of the family and we see an example through the relationship between Luke and his son Jason. Beyond that, the film also speaks to us of the fate and how these three stories will eventually be united.",
      "total_reactions": 0,
      "user": "Mad_Hatter91"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "The Place Beyond The Pines is the kind of film that I love. The film is broken up into three stories, starring three different actors, and it all comes together at the end. The film is about two men, one is a criminal, the other is a cop, and both have a decision to make. One makes the right choice, the other makes the wrong one, and fifteen years later, both decisions have a huge impact on their children, who come together in High School. Each part features a different actor, Ryan Gosling, Bradley Cooper, and Dane DeHann. While they were all terrific, it's Cooper who really stands out. I thought he was good in Limitless, but he blows that performance away, giving an Oscar worthy portrayal. Due to the violent nature of the film, of course the Academy overlooked him, but you will be hard pressed to find a better performance all year. He was magically and is the thread that connects the stories. Without Cooper being at his best, this film probably wouldn't have worked out as well as it did. There are so many supporting stars and the story becomes so much more complex than it appears to be. Watching The Place Beyond The Pines was really like seeing three different short plays, that are loosely tied together, but don't make much of an impact until you see the fourth and final act. Once you see the whole picture, you will be blown away, both by the magnitude of the story and an unexpected conclusion. The cast and previews for this film really didn't excite me that much, but the reviews were strong, I gave it a chance, and what I found was another must see movie.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "A recent cinema-going of American indie hopeful Derek Cianfrance’s follow-up of his breakthrough BLUE VALENTINE (2010, 7/10), reunited with Ryan Gosling and recruited hot blood Bradley Cooper and Eva Mendes, but don’t be fooled by the misguiding trailer, it is not a cat-catching-mouse robbery thriller, this 140 minutes saga strenuously narrates a karma-inducing retribution epic, although it has its ponderous clumsiness during its execution, and an inclination of descending gusto may stall one’s concentration along the way, the film (not the least) did a decent job in treating its material fairly, and arduously carves out a thorough realisation of a modern-day tragedy (through a triad narrative).",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "What can I say....wow.. this is the best 2013 film i have seen so far. Great cast, perfect acting, nice turns in the story keeping it fresh and not predictable. A modern day classic, a perfect film, simply magnificent.",
      "total_reactions": 0,
      "user": "suity_sahar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "It's been a long time since I've seen a film present a story this deep and complex. The Place Beyond the Pines tells not only a story but also an epic. As in any epic, there are outcomes which sadden us--but they're always necessary. This film does just that. Bradley Cooper and Eva Mendes give two of the best performances of their careers, but it's Gosling that deserves the Oscar.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "Two thirds of this movie is really intense and interesting, while the other third feels like a step down. All in all, I thought Ryan Gosling and Bradley Cooper did some great acting.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "Director Derek Cianfrance's film links together three separate, yet interlinked, stories of two families in a manner that is certainly not without risk. Roughly a third of the film's two hour plus running time each, the shift in narrative and characters, certainly from the first to second, is so sudden that it caused the film to lose all momentum on two occasions. Being led, deliberately no doubt, in one direction by the trailer, I found myself checking my watch after 50 minutes, so sudden is the shift in story. Second time around was less of a shock, as I began to appreciate what Cianfrance was trying to achieve. However, given the fragmented nature of the narrative, being asked to invest in three stories, each slightly less enjoyable than the previous, totalling two hours plus  is stretching the capacity of the audience.",
      "total_reactions": 0,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "In a time when it is difficult to see something truly original or epic in theaters, The Place Beyond the Pines offers a bold attempt at being both.  Essentially split into three interweaving stories of a criminal, a cop, and their two young sons.  Very well acted, competently written, and with a somber soundtrack that establishes its dreary and cynical tone throughout.  Far superior to Blue Valentine, which I found pretentious and unspectacular.  This is one of the good ones, and well worth a shot if you can still catch it in the cinema.",
      "total_reactions": 0,
      "user": "CriticalState"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "I recommend watching it. The actors really seemed to put a good effort in their rules, which worked out well. The plot was maybe a bit too simple or something, I am not really sure. I wouldn't consider it a favourite, and I didn't feel super inspired after watching it like one might after watching a film which affected them well. But I liked it, and I am glad I watched it. I would watch it again.",
      "total_reactions": 0,
      "user": "5hassay"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "I highly enjoyed this film. I'm not really giving anything away that other reviews haven't said, but the movie is broken up into three parts. The first part was simply incredible. Acting, soundtrack, story, the whole nine yards. I should have realized that the movie couldn't continue on the same level for an entire 2 hours and 20 minutes.....the middle dragged on a little but it picked up again at the end. Honestly though, it has been 3 days since I saw it in theaters and the first segment of The Place Beyond the Pines is all I've been able to think about. It's that good. Don't get me wrong, I enjoyed parts two and three as well but man....just go see it for yourself.",
      "total_reactions": 0,
      "user": "jedijared182"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Unsurprisingly for a film made up of three very distinct eras, Beyond the pines is a mixed bag. Covering 2 father and son combinations over a 15 year period, its an enjoyable drama that really only suffers from each part not being as good as the previous.",
      "total_reactions": 0,
      "user": "reddave2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "A very solid drama. The best aspect of this movie is the fact that it is presented in three parts each part with a different lead and this is really what makes it solid. It's gripping and keeps you watching and waiting to see what happens. Also as a film it seems very real and down to earth. It seems like it's something that could happen which is really rare to see in a film.",
      "total_reactions": 0,
      "user": "moonman1994"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "Really good film. Yes, it was indeed quite slow, but was what I call \"good slow\", in that it's not so slow that you are bored to death, but rather it is slow like The Godfather is slow as the slow parts build up to the exciting parts. The story is certainly interesting, the acting was really good, and directing was phenomenal as well. Really enjoyed this one.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "To say The Place Beyond The Pines is a weak movie with weak drama could be considered an act of civil disobedience. Gosling (Drive, Lars and The Real Girl, Blue Valentine) and Cooper (Silver Lining's Playbook) come into their own to give both their best performances. The story builds on itself with each act of the film. This film can be considered to be the best father-son drama masterpiece of this generation, with an overall message that states one simple fact that we've known for decades: Like father, like son.",
      "total_reactions": 0,
      "user": "OneSamTwoCups"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "Three movies for the price of one, or a great lesson on how your actions today can affect things for years to come. You decide. Many scenes you feel the suspense not because of what you don't know that will happen but because you know exactly what will. Bradley Cooper is almost unrecognizable with his character being so opposite from his more comedic roles we have seen. Eva Mendes is excellent as always as she carries many scenes with her emotion. Ryan Gosling plays a similar role as in Drive but with this movie he gets to do the things you were expecting with that other artsy film. If I had to sum this movie up into one word it would be, satisfying.",
      "total_reactions": 0,
      "user": "analogkid280"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "E’ risaputo, con i se e con i ma non si fa la storia. Epperò… Quale sarebbe il giudizio complessivo su ‘Come un tuono’ se il ritmo e la tensione narrativa si mantenessero sempre sui livelli della prima ora (cioè fino a che rimane in scena Ryan Gosling)? Con ogni probabilità, si passerebbe dalla categoria buono (o anche ottimo) film a quella di capolavoro: purtroppo, così non  ma c’è materia a sufficienza per dichiararsi soddisfatti. Per il suo esordio ad alto budget, l’indipendente Cianfrance sceglie una soggetto complesso e ambizioso (scritto assieme a Ben Coccio e Darius Marder e musicato con discrezione da Mike Patton) che innesta tocchi di noir su di un dramma familiare e psicologico con contorno di ipocrisie, sensi di colpa ed errori che ricadono sui figli  le eco cattoliche si sprecano, così pare tutto meno che un caso il largo spazio dato al battesimo del piccolo Jason. La storia si compone di tre segmenti di lunghezza diseguale e qualità calante. Nel primo, quello lodato poche righe fa,  protagonista Luke ‘il bello’, talentuoso motociclista che si guadagna da vivere nei luna-park e che passa alle rapine dopo aver scoperto di aver avuto un figlio a seguito di una-botta-e-via. Protagonista  un Gosling biondo, bravo a rendere la complessità di un personaggio che ha il coraggio di farsi le domande giuste alle quali, però, finisce sempre per dare le risposte sbagliate: accanto a lui ci sono una Eva Mendes che disegna una ragazza-madre ben lontana dal sex-symbol e Bob Mendelsohn che fa lo stralunato  come gli capita spesso  nei panni dell’amico Robin. Una rapina andata a male segna il cambio di testimone: esce Luke, entra il poliziotto Avery Scott, che diventa un eroe per aver fermato il rapinatore, ma in fondo all’anima ha qualcosa che rode perché anche lui ha un figlio piccolo. Ciò non gli impedisce di distillare una serie di menzogne e di sfruttare ancor più cinicamente il cinismo di alcuni suoi colleghi (fra i quali Ray Liotta e un baffuto Gabe Fazio) per costruirsi una carriera politica a cui sacrifica anche la famiglia. Cooper lavora con cura su un ruolo non facile, molto sfaccettato a livello psicologico mentre all’esterno l’agente Scott si sforza di rimanere tutto d’un pezzo: così, quindici anni dopo  e, all’apparenza, non invecchiato di un giorno  eccolo in corsa per la procura distrettuale. A questo punto, i figli sono cresciuti (senza padre entrambi, a vedere così) e il loro incontro finisce per tirare qualche somma, ma senza stravolgere davvero nulla, perché la vita  un grande fiume tranquillo dove, alla fine, il più forte ce l’ha sempre vinta. Come già accennato, in queste ultime parti, e in special modo in quella conclusiva, si notano ridondanze e lungaggini che rallentano la narrazione abbassando il giudizio complessivo, ma senza danneggiare il coinvolgimento dello spettatore creato anche da una qualità delle interpretazioni confermata dai giovani Cohen e DeHaan. L’essenza stessa della storia rende evidente che se c’è una cosa che non va, questa  un titolo italiano decisamente fuorviante: molto meglio quello originale, che altro non  che la traduzione dal mohawk di Schenectady, il nome della cittadina (nello stato di New York) in cui si svolge la vicenda. Si tratta di una provincia placida e immersa nel verde che Cianfrance riprende con cura del dettaglio (cura che, del resto, si riflette nelle inquadrature dei personaggi) e dalla quale per cambiare qualcosa  necessario andar via. Le uniche scene adrenaliniche sono difatti quelle in cui c’è Luke in moto (negli Stati Uniti il casco non  obbligatorio? Per non parlare dei passaggi di proprietà…) e durante le rapine, pare girate in un’unica ripresa: improvvise variazioni di ritmo che sono ulteriore testimonianza di un notevole talento registico, del resto già annunciato dalla splendida sequenza dei titoli di testa.",
      "total_reactions": 0,
      "user": "catcarlo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "Structurally daring and affecting all throughout, \"The Place Beyond The Pines\" is a gorgeously shot, character-driven epic with marvelous performances all around and a truly haunting score.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "\"The Place Beyond the Pines\" is a highly ambitious melodrama, delivered on an epic scale involving multiple characters that boasts an engrossing cinematic atmosphere, with an impassioned emphasis on humanistic elements. Director Derek Cianfrance has crafted a sweeping three-act story with considerable skill that follows a chronological structure where each narrative rarely intersects.  It has the scope and depth of a novel, and puts its trust in the audience to have the patience.",
      "total_reactions": 0,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "I gave it a 10 the first time I watched, but after a second viewing I recognized some of it's flaws in terms of pacing and character development. I like it a lot, but not nearly as much as Blue Valentine.",
      "total_reactions": 0,
      "user": "SimpleMethod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "This 2012/2013 crime thriller eerily reminds me of the very intelligent 2005 David Cronenberg movie A History of Violence, right down to the hairstyles of the main characters. In a good way though, both are undoubtedly worth watching. The Place Beyond The Pines is a performance movie if you don’t know what that is, it means a movie which relies on its supposedly strong cast to carry the whole thing because the plot is thin. The difference between The Place Beyond The Pines and a normal performance movie is that the plot is very deep and intelligent. It is believable, but exciting at the same time for almost the whole 140 minute movie. However the performances are brilliant all round, some slightly more than others, the most unknown of the almost ensemble Dane DeHaan is actually the best out of everyone. I have not yet seen Kill Your Darlings in which he stars alongside Daniel Radcliffe, but I will soon and he looks brilliant in that too. I don’t usually comment on how a movie is filmed because I believe it to be quite a lot less complex than many claim, although there is skill involved, the masterful cinematography keeps you on the edge of your seat the whole movie and never lets your attention stray even in the less riveting scenes. The Place Beyond The Pines is a must see, due to many strong performances and a realistic but thrilling plot.",
      "total_reactions": 0,
      "user": "python2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "I love these films that rely on the script and acting and nothing else. They show the true talent. The cast is outstanding all around. Ryan Gosling is great, Eva Mendes is really great and Bradley Cooper is probably better than them in this occasion. However the best performance goes to Dane Dehaan in my opinion. This boy is really the most talented young actor in Hollywood right now. I am sure even his part in the upcoming The Amazing Spiderman 2 will be outstanding. The script is amazing in the sense that it is totally unpredictable. You are constantly trying to guess what comes next but you are never right. This happens especially in the last third. The weakest part is the first third, still good, but it is the slowest and you feel the need for the film to move forward, which happens when the second third begins. I can´t give this more than an 7 because of the slow start and because it is a little too long. But great anyway, definitely many thing to enjoy and admire in the film.",
      "total_reactions": 0,
      "user": "sanyrub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "The Place Beyond the Pines is an exceptionally well crafted and powerful drama. I don't believe I've ever seen a movie with such a sprawling storyline before; hence the long running time.  But I don't think this movie could have truly worked in a shorter version.  The performances are all good ,and there are many tense and gripping moments.  The movie has three chapters, which are all engaging, but I do wish it focused more on Gosseling's bank robberies.  The direction is very tight and focused which is probably one of its best qualities.  It's not quite perfect.  I can imagine a more stylized and invigorating version of this movie, but I still enjoyed it very much.  I wouldn't be surprised if it received some Oscar nods early next year.",
      "total_reactions": 0,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "This film as the title suggests is about what happens after we die and the legacy we leave behind, particularly the actions of Ryan Goslings character. The film is well acted through out with stand out performances by Gosling and Bradley Coopers characters and the Robin character. The film is split into 3 parts with clear story lines in the first 2 and a convoluted 3rd act. The action is well done in this film and it really feels like your in the scene with the use of slight shaking camera and fixed camera angles making the action more immersing. My biggest problem with the film was the 3rd act which features the two most annoying characters in the film and the worst story line of the film. Also i felt that certain characters didn't have complete story arcs.",
      "total_reactions": 0,
      "user": "CtheTav"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "The most impressive movie I've seen that's come out in 2013. It has it's share of flaws yes, but The Place Beyond The Pines is a movie you can't afford to miss. The movie follows a young man named Luke Glanton who after learning he has a young son, begins to rob banks in order to provide for him. I can't say anymore than that without getting into spoiler territory. But this is without a doubt one of the most ambitious movies In recent memory. It's entertaining, riveting and unpredictable.",
      "total_reactions": 0,
      "user": "NBAluke579"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "This movie hit all the right notes for me. Visually, it's beautiful. The cinematography is incredibly well done, every shot is done just right. The soundtrack was perfect and really fit the subtle dark undertones this movie gives off.  As for the acting, every major character in the movie is portrayed superbly well and full of emotion. Ryan Gosling and Bradley Cooper stand out to me as the two major actors who really nailed their roles in this movie, but Dane DeHaan also gives a very convincing and powerful performance. The story, without spoiling anything, can only be described as emotionally gripping. My only complaint with this film is that the third act was a bit too long. This is a very minor issue however, it gave me time to really soak in the entire movie and appreciate the final moments of this great film.",
      "total_reactions": 0,
      "user": "KozySauce"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "The Place Beyond the Pines directed by Derek Cianfrance, a film that I was surprised, excited, involved me very much, very good actors, good director, in short, a wonderful film.",
      "total_reactions": 0,
      "user": "alescio92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "Let’s talk about misleading movie trailers for a minute.  A trailer is basically just an advertisement for a movie and really has no obligation to describe the plot or even show things that will end up in the final cut of the movie.  The goal is to get you to watch the film being previewed by any means necessary.  Recently the most famous example of this was the trailer for Drive.  It made the movie out to be a high octane action thriller in the mold of Fast and Furious but starring beef cake Ryan Gosling.  For anyone that saw the movie, you know it wasn’t that at all.  A lady actually demanded her money back after seeing it because she expected it to have more action.  The reason I bring this up is because The Place Beyond the Pines had a pretty misleading trailer as well.  Is it something about Ryan Gosling movies that leads the studio into deceiving the audience? I’m not sure.  Usually I do the research and read a couple reviews before walking into a movie because I’m a responsible film goer, but when I went to see Pines, I wasn’t expecting what it actually turned out to be at all.  (Warning: Spoilers Ahead)",
      "total_reactions": 0,
      "user": "Recomedia"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "Ryan Gosling embodies Luke Glanton, the relentless force of nature rousing The Place beyond The Pines. An engrossing one-shot opening sequence tracks Glanton’s movements through to the stunt bike rider’s death-defying performance within a caged orb. He sustains his velocity upon his release as he pursues leading-lady Eva Mendes and this hurtling through life intensifies under emotional charge, inevitably (in hindsight) resulting in his rapid exit. What follows is effectively an ode to the magnetism and impact of the character, whose absence is as prominent as his presence was striking. His momentum is shown to continue through a vague spiritual connection to Bradley Cooper’s generally prosaic character. Later, the on-going shockwaves of Glanton’s life impact upon others and his legend haunts in a manner reminiscent of the distant piano keys in the theme song, filtering through to his troubled and introspectively immersed son’s late incarnation as the doomed rider. Yet, despite the best efforts to appease, his on-screen aura is long lost.",
      "total_reactions": 0,
      "user": "NicDash"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "This is one of my favorite 2013 films. Very unique and creative, takes very huge risks, and nails it. The acting choices are great, the direction, the music, the cinematography, the writing, and the perfect incorporation of the butterfly effect and karma makes this movie amazing. Also, I don't know if anyone noticed, but there were a lot of allusions to Star Wars in this movie. Watch it, and you will understand.",
      "total_reactions": 0,
      "user": "RyanSolomon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "Looking at the promo poster for The Place Beyond the Pines, we are immediately intrigued as to how director Derek Cianfrance is going to balance the play between the big names on display. The answer is: unconventionally.",
      "total_reactions": 0,
      "user": "steegpilgrim"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "\"The Place Beyond the Pines\" although, interesting, unique and thought provoking, was slightly confusing and drawn out.",
      "total_reactions": 0,
      "user": "CriticWes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "Why does 'the place beyond the pines' deserve a ten? Did you notice a flaw in the acting? did you notice any scene not handled with care? Did you notice any cliche story progression and dialogue? Ryan gosling revs up the rest of the movie to fall in his legacy and to be honest, I think this movie will be a miss for critics who assume this movie was made to impress them. This movie is a wonderful painting by derrick cianfrance  and crew, and I hope later down the road it will be received better than it has been so far.",
      "total_reactions": 0,
      "user": "Take-it-from-me"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Derek Cianfrance's followup to the excellent \"Blue Valentine\" was a good one, He was solid and he knew what he was doing and what he wanted from his actors  The Plot was interesting in the beginning  but it began to lose the viewer's attention in the last third part",
      "total_reactions": 0,
      "user": "AliBenzekri"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "great acting but the story is crap filled and boring its like three short stories and not a full film boring and a waste of time, couple hours people wont get back",
      "total_reactions": 0,
      "user": "Batman97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "I went to see this movie 'blind'  not even knowing it would be split into 3 stories. Guess I was a bit disillusioned when the 1st story ended apruptly when it was most exciting. Of course the stories are tied together... but the overall tone of what lay ahead of me in the 2nd story can only be described as depressing. The middle part is about guilt and all but it wasn't handled well. The 3rd part was more interesting again and even gave the viewer some hope that things could be kinda sorted out in the end.",
      "total_reactions": 0,
      "user": "ValidAction"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "The place beyond the pines is not just a Mohawk denomination for a little town (Schenectady), but is the name of a little-big masterpiece. I totally loved the plot that runs really good and let pass two hour and half like no other recent movie. I loved the acting of Ryan Gosling and Bradley Cooper. So emotionally, so deep and when \"Luke Glanton\" starts to be a bank robber, your adrenaline stars to flow like him in the movie as well as for \"Avery Cross\" and his peripeteias.",
      "total_reactions": 0,
      "user": "RinoFury"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "The title may sound like a some tourist trap gift shop near a nature trail but I think this movie may be the best drama I've seen in 2013.  The story quickly sucked me in and was just enthralling.  And the performances--from all the participants--are some of the best I've seen from each of them ever.  The drama is done just right and the emotion is so heavy that it is practically soaking up the actual film stock.  Just a great movie.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "An amazing movie with excellent acting and great stroy telling. It has taken me a couple months to write this review though havin seen the movie months ago. Derek Cianfrance blow me out of the water with his directing skills in this film sure his film Blue Valentine is great but it's not on the level this movie is. The story was great even though is was nothing new but because it was being told from 2 sides and it never really felt like the movie had one main character.",
      "total_reactions": 0,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "I'm glad you took the time.",
      "total_reactions": 0,
      "user": "Firebala"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "Ryan Gosling is the 2000 's version of 80 's Mickey Rourke. Great performance. And the soundtrack rocks!!! Fate comes with the kids, fate is the core value on the movie, the best of 2013.",
      "total_reactions": 0,
      "user": "umbilical"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2013
      },
      "score": 9,
      "text": "I just adored this film. It bolsters great performances by the lead actors and a fantastically layered script which is filled with the underlying theme of how our decisions effect our families and other people in the world. This film is gritty, smart, and just all around fantastic. One of this years under appreciated gems.",
      "total_reactions": 0,
      "user": "dodds44"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2013
      },
      "score": 9,
      "text": "Hi, My name's Marcio and I'm from Brazil. The Place Beyond the Pines is the one of the best movies I ever seen! Period! Ryan Gosling is a terrific young actor, this man always surprise me... Impressive! Bradley Cooper always pretty good acting too...",
      "total_reactions": 0,
      "user": "Marcio_Oliveira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "This film could have gone any direction for the purpose of the story and very few would have been the wrong one to take. This shows how great the opening act is. The film did have a lot of story and that was as much a hindrance as it was a an asset. However, the acting performances and the character depth hold together what is a very character based film. As much a Bradley cooper starring role as a gossling, this film delivered a questionable yet emotional story and with the eventual ending righting most of the wrongs of the film.",
      "total_reactions": 0,
      "user": "Aidon_m"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "It might be slightly biased for me, considering it was filmed locally and I could pick out locations, but I loved this film. It takes daring leaps, and is told in three riveting parts that cover many topics. The first is mainly about Gosling's character and his path of crime, and then Bradley Cooper's character, who takes down Gosling, and discovers the corruption of the other policemen. Then their two sons meet in high school to discover things about their parents, and it shows how they impacted them, and they finish the story. A truly excellent film.",
      "total_reactions": 0,
      "user": "MattG_123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "I'm surprised how under the radar this film went, becauae it's a pretty damn cool film. Split into 3 sections, each one feeling unique. You can tell just by the opening trackibg shot that the film is going to be good. The first 2 sections are exceptionally strong, with both Ryan Gosling and Bradley Cooper bringing excellent performances to the screen. This film would be a 10/10 if te third section couldn't follow suit, but sadly it doesn't and seems a bit boring and forced. Great film nonetheless, pick this up!",
      "total_reactions": 0,
      "user": "oDjento"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 1,
      "text": "There are 3 stories within this movie, none of which contained much detail, or made me feel anything for any characters. The best part is when the credits roll, because it's finally over. Way too long, not enough detail, but good acting, still only enough to give it a 1/10",
      "total_reactions": 0,
      "user": "thethethe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "A bit like 'Drive'. Slow paced and very drawn out. Bradley Cooper's acting is as good as ever and his character is probably the only reason many, like myself, watched until the very end. Could've been a lot better if it hadn't tried to force itself into being an 'artistic' film.",
      "total_reactions": 0,
      "user": "Canem"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "That's a solid movie.Solid plot,interesting and convincing characters,pretty good acting and a good distribution are what makes The Place Beyond the Pines a good movie.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2014
      },
      "score": 9,
      "text": "This movie clearly shows that America makes quality films. Hands down the best movie I've seen in years. By far the best movie with Bradley cooper. Great cast and amazing story.",
      "total_reactions": 0,
      "user": "jameswalrus97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "Liked that movie, but i didnt expect the splits, basically in 3 pieces that are clever connected. So the trailer was a bit misleading. Cause the first part with gosling is the strongest, he is fascinating in this movie. Later its still good but it couldnt hold the high level of the beginning",
      "total_reactions": 0,
      "user": "iCronic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "Sprawling is a good word for The Place Beyond The Pines, and don't forget that I just saw this and it was released in 2012.  That does matter as tastes change very quickly in 'Movie Time'.",
      "total_reactions": 0,
      "user": "clayscottbrown"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2014
      },
      "score": 3,
      "text": "The movie never delivers. Its advertised as a crime thriller, drama whatever but how can a thriller be a thriller without a climax? The best part of the movie suddenly ends about 30 minutes in and the rest of the movie is a dragged on boring nothingness. The ending is one of the worst I have ever seen.",
      "total_reactions": 0,
      "user": "gedet"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "Maravilloso filme dividido en 3 historias, un profundo tratado de como las decisiones de los padres repercuten en los hijos, gran fotografía y actuaciones bien logradas, especialmente la de Ryan Gsoling",
      "total_reactions": 0,
      "user": "jlopezglez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "Excellent beginning...i still haven't finished this though because when I tried to it seemed like a completely different movie......I feel that this review is probably the funniest iv'e ever been..and i'm not even joking ..",
      "total_reactions": 0,
      "user": "CameraBounceGod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "A powerful, towering, yet intimately-told epic with excellent performances, a unique structure, and a story told with as much passion and angst as the myriad sons in the film.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2016
      },
      "score": 10,
      "text": "Following \"Blue Valentine,\" would the film be a similarly intimate and narrowly focused story or something completely different? The answer is that \"The Place Beyond The Pines\" is an ambitious epic that is cut from some of the same thematic tissue as Cianfrance's previous film, but expands the scope into a wondrously widescreen tale of fathers, sons and the legacy of sins that are passed down through the generations.",
      "total_reactions": 0,
      "user": "ReelViews94"
    }
  ]
}