{
  "mc_avg_user_score": 6.4,
  "mc_metascore": 66,
  "mc_mixed_rating_frequency": 61,
  "mc_movie_name": "The Bling Ring",
  "mc_negative_rating_frequency": 33,
  "mc_positive_rating_frequency": 104,
  "mc_pro_critic_reviews": [
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2013
      },
      "score": 91,
      "summary": "For a while, the girls' personalities seem almost interchangeable, but that's part of the texture. Katie Chang gives the leader a ripe synthetic glow, and Emma Watson does a remarkable job of demonstrating that glassy-eyed insensitivity need not be stupid."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2013
      },
      "score": 88,
      "summary": "The Bling Ring is a sly, often hilarious and at times sobering look at the 21st century fascination with celebrities."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 88,
      "summary": "In other words, this punkish, sleek film about beautiful kids wallowing in purloined Prada could have been written by a grumpy 65-year-old white guy in gabardine, provided he had a sense of irony. The Bling Ring is the bridge between Coppola and Bill O’Reilly."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 88,
      "summary": "As with her best films, Coppola is utterly at ease in this milieu and it shows."
    },
    {
      "critic": "David Ehrlich",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 86,
      "summary": "Uncharacteristically loose and deceptively frivolous, The Bling Ring is as much of an attack on The Hills Generation as any of Coppola’s previous films were an exercise in self-pity, which is to say not at all."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2013
      },
      "score": 83,
      "summary": "The movie captures a moment when the lines separating anonymity, fame, and notoriety are finer than ever. And as Watson’s social climber prattles on to reporters about what a great “learning lesson” her criminal experience has been, it’s easy to see another star in the making."
    },
    {
      "critic": "Cath Clarke",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 80,
      "summary": "This is easily Coppola’s funniest film. Leslie Mann is hilarious as Nicki’s phony spiritual mum."
    },
    {
      "critic": "Staff (Not credited)",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2013
      },
      "score": 80,
      "summary": "Girls meets Ocean’s Eleven, The Bling Ring might be a film for right now rather than the ages, but Sofia Coppola’s heist movie is visually arresting, well acted, capricious fun."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 80,
      "summary": "The Bling Ring, Sofia Coppola’s deceptively shallow but ultimately fascinating latest, is animated by that spirit of we-don’t-give-a-f**k playfulness."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 80,
      "summary": "Coppola’s uproarious and bitingly timely film feels every inch a necessary artwork."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 80,
      "summary": "The Bling Ring traces an intriguing feedback loop of which it is knowingly a part: a movie that affords its subjects the very immortality they so aggressively sought."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "How do you make a movie about shallow people in a shallow culture and not end up with a shallow movie? For writer-director Sofia Coppola, the answer is to dramatize a story “based on actual events,” then to step back and present it as a case study in pure anthropology."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "The Bling Ring is Sofia Coppola's energetic, elegant, and entertaining take on this real-life story - a comedy, of sorts, if what it says about our obsession with the famous and the frivolous weren't so totally depressing."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "Like a seductively lambent hall of mirrors, The Bling Ring lays bare the venality of train-wreck celebrity culture, striving and self-deception by dramatizing a fact that’s as delicious as it is depressing."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "Coppola and her brilliant cinematographer, Harris Savides, keep the action simple, but the perspective is perfect."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "Emma Watson is sensational as Nicki."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 75,
      "summary": "Coppola presents a smart cross-examination of the impact of media exposure on fickle young minds. While the ambitions of its young thieves often blur together and lack precise definition, The Bling Ring is the director's breeziest work, allowing the story to glide along with the ease of a heist movie."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 70,
      "summary": "The Bling Ring occupies a vertiginous middle ground between banality and transcendence, and its refusal to commit to one or the other is both a mark of integrity and a source of frustration."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 70,
      "summary": "Apart from scenes with Leslie Mann as a mother who propagates the wisdom of The Secret (she’d be too heavy-handed for a Disney Channel sitcom), The Bling Ring is enjoyable. And it’s always easy on the eyes."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2013
      },
      "score": 67,
      "summary": "This is a movie that cries out for more than the too-cool-for-school Coppola’s trademark hipster anomie. She may be too much a part of the celebrity-mongering world she portrays to do justice to its injustices."
    },
    {
      "critic": "Tomas Hachard",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2013
      },
      "score": 65,
      "summary": "It's when Coppola lets the beautiful, gorgeous things retain their sparkle that The Bling Ring shines most brightly."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 63,
      "summary": "The studied impassivity of The Bling Ring feels increasingly like a dodge as the movie progresses; we sense an anger and a moralism that the director’s too cool or too wary or too close to engage."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 63,
      "summary": "Coppola's approach to the subject is largely impartial; depending on the viewer, this can seem refreshing or off-putting."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2013
      },
      "score": 63,
      "summary": "Watson is a revelation here as a brand-obsessed bad girl."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 63,
      "summary": "The Bling Ring is the cinematic equivalent of the vapid, superficial kids it features — all visual panache and minimal substance."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 60,
      "summary": "It’s fun while it lasts, but ultimately forgettable, kind of like the people they stole from."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 60,
      "summary": "Watching it, one gets the feeling that Coppola knows these vampiric types all too well. What unfolds feels like a cross between \"Lifestyles of the Rich and Famous\" and \"Natural Born Killers,\" and a film that is far more disapproving than glamorizing of the go-go-go Los Angeles lifestyle -- but fascinating nonetheless."
    },
    {
      "critic": "Kate Stables",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 60,
      "summary": "Sharp and shiny as the jewellery its twisted teens pilfer, Coppola’s cautionary tale eschews action for angsting about celeb- obsessed culture. Worth it just to hear Watson snarl “I wanna ROB!”"
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 60,
      "summary": "The final notes of irony and repudiation may be laboured and obvious, but this is an intriguingly intuitive and atmospheric movie."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 60,
      "summary": "Coppola’s attitude toward her subject seems equivocal, uncertain; there is perhaps a smidgen of social commentary, but she seems far too at home in the world she depicts to offer a rewarding critique of it."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2013
      },
      "score": 58,
      "summary": "The Bling Ring still feels more like a magazine article overstretched into a feature length film."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2013
      },
      "score": 58,
      "summary": "Coppola's movie has a sense of indie vitality, although the energy feels wasted by running in place."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 50,
      "summary": "Make no mistake, it is lovely to look at this celebrity bedazzled bit of L.A. crime history for a while. But the movie ultimately leaves you feeling as empty as the lives it means to portray."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 50,
      "summary": "Even though Coppola is one of our most compassionate storytellers, she can't bring herself to like these kids much. She's not cynical enough to turn this story into satire."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 50,
      "summary": "Sofia Coppola seems curiously unmotivated to bring full analysis or provocation to her themes, leaving the film feeling like a disappointingly toothless satire."
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "It's the picture's lack of focus that eventually diminishes whatever little The Bling Ring has to say."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2013
      },
      "score": 40,
      "summary": "The point of the film is vacuous materialism, but the way these larcenous children return the camera's impassive gaze suggests that no one is home behind their beautiful faces and dead eyes."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2013
      },
      "score": 40,
      "summary": "The problem with The Bling Ring is that it feels as soulless as its young protagonists, and of course there’s little sympathy to be found either for the story’s über-rich victims like Paris Hilton and Lindsay Lohan."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 40,
      "summary": "Narratively static and morally banal. That may be par for the course, however, when half the movie is spent watching shallow kids try on other people’s clothes."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "The movie was passable entertainment for the evening but left the viewer with a mildly sour taste about the depth of character in the story and the acting. An interesting subject matter to tackle but not one of Sophia Coppola's best  efforts.",
      "total_reactions": 2,
      "user": "keyelepro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Most of Sofia Coppola’s films take an ambivalent attitude toward fame, but The Bling Ring tackles the subject from a slight remove. The movie opens with a nighttime robbery, as teens scale a fence and slip, ninja-like, onto what at first glance would appear to be a well-secured property. As the film jumps forward to their capture and then flashes back to tell their story (mitigated through media interviews), The Bling Ring clarifies that this is Orlando Bloom’s house. But the prologue—and its security-cam, night-vision POV—establishes the movie’s unusual dual perspective. This is a tale of obsessive fans, superficially unfolding from their version of events but observed by Hollywood royalty, passively watching as onlookers storm the castle. Based on a Vanity Fair article by Nancy Jo Sales, The Bling Ring is inspired by an actual 2008–2009 rash of L.A.-area robberies, when a group of high-schoolers from Calabasas, California, managed to invade the estates of Bloom, Paris Hilton, Lindsay Lohan, Megan Fox, and others, helping themselves to whatever they wanted. As the movie tells it, the spree begins when a smiling sociopath (Katie Chang) ropes the new kid in “dropout school” (Israel Broussard) into breaking into a friend’s house. Soon their sights turn to celebrities. It’s easy to know when “Paris” is out of town because of “news” on the Internet—and apparently she, too, leaves her keys under the mat. As the ring expands to include the duo’s friends (notably ones played by Emma Watson, who steals the movie, and Taissa Farmiga, Vera’s younger sister), The Bling Ring quietly ponders entitlement culture. In one sense, there’s not much separating these hard-partying, brand-blinded teens from Lindsay Lohan, nabbed for shoplifting at around the same time. Dedicated to the late cinematographer Harris Savides, who was unable to complete filming, The Bling Ring shoots each robbery with a perverse matter-of-factness. It’s easily Coppola’s least flashy film, but that’s not to say it lacks poetry—the burglarizing of Hills star Audrina Patridge’s home is shown in a single, gorgeous long shot. If the tone of lyrical crime saga has critics name-checking Spring Breakers (the portrait of adolescent ineptitude also recalls Larry Clark’s Bully), The Bling Ring isn’t so much interested in provocation as sociology. Manufacturing this sort of fame is an exercise in mutual exploitation. Ostensibly victimized by the thefts, Paris Hilton is apparently healed enough to contribute a cameo—and flattered enough to allow Coppola to film in what’s reportedly her actual home. The movie captures a moment when the lines separating anonymity, fame, and notoriety are finer than ever. And as Watson’s social climber prattles on to reporters about what a great “learning lesson” her criminal experience has been, it’s easy to see another star in the making.",
      "total_reactions": 1,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "The bling ring though is is hard to believe that all this was true it is an entertaining film and has a really great storyline. I like that I saw Emma Watson in something different and Taissa Farmiga too. Nothing more to say. The direction and the cinematography were ok. But the film is entertaining and good in general.",
      "total_reactions": 1,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "Solid.  But if you're a half intelligent 20 something year old, the satire and criticism of The Bling Ring is something you're already well aware of.  As a individual who actually grew up in LA, I quite enjoyed how hilariously accurate the portrayal of what lengths kids (particularly well off private school students) would go to in order to feel dignified, though albeit much less sensationalized.  But they lets be honest.  You considered this movie because of Emma Watson, and yes, she's still worth matinee.",
      "total_reactions": 1,
      "user": "Cereldi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "A cool movie, for cool people. Just kidding, but i liked the movie in so many ways... The performance of most actors are great and how the movie is going to the end...was something good.",
      "total_reactions": 1,
      "user": "gabecampos"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2013
      },
      "score": 1,
      "text": "One of the lamest movies I've ever seen.  If you paid money to see this, then they robbed you too.  I fell asleep trying to watch this garbage, twice!",
      "total_reactions": 1,
      "user": "jbl123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "The Bling Ring is one of my favorite movies of this year, the story is really interesting, and the development can be slow in some moments, but is great. The script is fantastic, the music is cool and the performances are awesome. Amazing movie.",
      "total_reactions": 1,
      "user": "MarkDetrel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2014
      },
      "score": 1,
      "text": "Kind of an amoral send-up of the sorts of pretentious teens that are inspired by the glitz and glamour culture of the current decade, where everything is surface and nothing matters.",
      "total_reactions": 1,
      "user": "xolve"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "An enjoyable movie albeit horrifying.  It's ironic that the actresses in the film such as Emma Watson may lead lives equally as narcissistic as the characters they play.  I love how Coppola's examines the useless, creepiness of Facebook.  The movie challenges the public to reexamine values and hopefully make changes.",
      "total_reactions": 5,
      "user": "poetreviewer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "The Bling Ring is first rate, enjoyable and absorbing movie that is thought provoking, clever and fascinating, with good performances and great plot that should be given a shot. It is beautifully crafted and unique in style, with riveting direction (Sofia Coppola's Lost in Translation), and a charming photography. By far, it is is one of the best movies 2013.",
      "total_reactions": 4,
      "user": "MovieGoer14"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Beautifully crafted film, without a doubt. The only critique I have is that I wished Sofia could have broken the surface of the frame of the film and show more about why the kids do what they do.",
      "total_reactions": 7,
      "user": "Eon2323"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2013
      },
      "score": 2,
      "text": "A monotonous, painful, linear bore of a movie, Coppola almost seems to glamorize the very thing she thinks she's satirizing. Or is this even satire? It's hard to tell, because there is no point of view, no attitude, no angle, just an hour and a half of vapid, unlikeable teens walking into unlocked homes and repeated slo-mo shots of them at clubs until they are easily caught and the movie ends. If she had thought to include a postscript at the end it would have been the most interesting thing in the film.",
      "total_reactions": 5,
      "user": "Flange77"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Based on a true story about a group of truly clueless CA girls and their gay bestie, who are obsessed with fashion, money and fame. They get their fix and kicks by robbing the homes of celebs (yes, they actually shot in Paris HIlton's real home). The thin plot revolves around them hanging out, trying on clothes, doing drugs and \"shopping\" in the famous homes. The cast is believable with Emma Watson perfectly capturing their superficial ignorance. The film is dominated by superficial chatter, cool music and flash. Appropriately, writer/director Sophia Coppola chose no depth to the character development or subject matter, just a showy episodic montage.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "\"The Bling Ring\" is an interesting film. It delves into our internet celebrity obsessed culture. How we pay more attention to the hottest gossip as apposed to what really matter. The social commentary part of the script is actually quite intelligent. However, there is one downside, the dialogue is kinda “meh.\" It’s either unnatural or kind of forced.",
      "total_reactions": 2,
      "user": "AwesomeReviewer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Everything was perfect!!!!!! I like the way that the obsession was showed, i liked the way that the thefts happens,  everything was in the right way with no comebacks. One of the best of the year.",
      "total_reactions": 2,
      "user": "ryland"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "One of the worst movies ever made. Almost as bad as The International. Watson was cringeworthy.",
      "total_reactions": 6,
      "user": "BLING_RING_TURD"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Great movie, great actors, great soundtrack, everything was great in this movie that makes me likes \"The Bling Ring\" like one of my favorites movies in the history.",
      "total_reactions": 3,
      "user": "rylanddie"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "I am honestly a bit confused by the mostly positive reviews I've seen from critics. Although I usually enjoy Sophia Coppola's style, i simply could not get into the film; it just wasn't interesting. A bunch of rich kids decide to rob a bunch of richer celebrities... that's it.",
      "total_reactions": 3,
      "user": "juanmejiab77"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "I think it was a good story for a great script, but only showed a film without a body and a very poor soul really bored, my girlfriend fell asleep.",
      "total_reactions": 1,
      "user": "wishmaster"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "Director Sofia Coppola had the right idea when she decided to make a film about the undue influence that Hollywood has on adolescents. Based on a true story, a group of fairly well-off but troubled teenagers yearn for the designer clothes that are being shown off on the red carpets by their celebrity idols, who are too often undereducated and overprivileged, and who have risen to fame on a small amount of talent and even less intelligence. The group decides that the best way to fulfill their insane need for consumerism is to simply find out where some of the coolest, and stupidest, celebrities live and then just walk in and take what they want from closets that are like treasure chests filled with clothes, jewelry, purses, and shoes, not to mention narcotics and loose cash. Although this plan sounds naive and implausible, it turns out that many celebrities have so many sliding doors in their homes, they could not possibly be asked to keep them all locked. Paris Hilton wins the prize for accessibility--she keeps a set a keys under her font doormat.",
      "total_reactions": 1,
      "user": "ClariseSamuels"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2013
      },
      "score": 3,
      "text": "The movie felt very similar to Spring Breakers with their vile characters and style of filmmaking which is not a positive. The movie has no substance and rushes quickly to introduce the characters by giving no background on who they are and by the end your tired of these disturbed teenagers.",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 0,
      "text": "Muy trillada  Bostezaba esperando el final con ansias .",
      "total_reactions": 1,
      "user": "rociocabezas"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "The filme was sooooooooooooo cool. All the parties, the thefts, every thing was showed how was to be. The acting was great, but Emma Watson and Taissa Farmiga was the great in this movie with the good soundtrack.",
      "total_reactions": 1,
      "user": "gabrielg"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "Swift, satirical and nicely filmed; ‘The Bling Ring’ proved to be quite a treat. The movie follows a group of privileged teens who begin robbing the homes of celebrities to feed their obsession of the celebrity lifestyle, and the glitz and glam that comes along with it. As you would expect these rich teens are as slight as their plot to rob the homes of famous people; and that’s what made this such a fascinating movie to watch. Director Sofia Coppola’s decision to add little depth to the members of the bling ring, made this character study of the shallow privileged, darkly humorous and quite substantial in its own way. The story was smartly structured and moved at a clip, and the soundtrack fit the material well. The ensemble cast did a great job, channeling their best valley girl (and guy) personas to their respective roles. Vapid materialism, reckless, self-centered and extremely irritating; the cast nailed all these characteristics perfectly. Despite the strength of the group, it’s worth noting that Emma Watson’s performance was particularly fantastic, proving that she is a serious talent to watch out for. Coppola is no stranger when it comes to making films about the rich and famous, and ‘The Bling Ring’ fits perfectly in her little collection. It may not be profound, but it’s a timely treat that delivered what was intended.",
      "total_reactions": 1,
      "user": "Prodigy2013"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "The movie presents us with a group of teens during a span of one year and takes us on a ride in an attempt to capture a piece of the celebrity lifestyle that eventually results in an escapade of burglaries in which they steal from the very celebrities they admire. It is definitely more about the social commentary then detailed story telling of the actual events. This movie presented in a pseudo-documentary montage style that moves from scene to scene, and keeps the characters at a distance, therefore making it difficult to really know any of them. With exception of Marc, and maybe Nicki, played very well by Emma Watson, the rest of characters are shallow. We only know about the characters based on what they say and do on screen.  It does not explain much or inject sympathy or condemnation of the teens, but merely shows the events and the results of their actions, very minimalistic film making.",
      "total_reactions": 1,
      "user": "sparkvark111"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "the bling ring is an amazing film. i loved every thing about it. it was very well written. the acting was okay but not great. the bling ring is more of a teen movie but adults will probably like it too. if you like clothes and shopping then you will love this movie.",
      "total_reactions": 1,
      "user": "jacobmmmccc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2013
      },
      "score": 4,
      "text": "It seems that director Sofia Coppola was trying to recreate the magic of Lost in Translation. The attempts are obvious in the quiet, ambient scenes. But she fails to accomplish this. And the result is a mostly boring movie that, with the exception of the last 15 minutes, doesn't really help you to understand these characters.",
      "total_reactions": 0,
      "user": "adhamhany"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2014
      },
      "score": 7,
      "text": "The Bling Ring is a purposely vapid movie about vapid people and culture. It lacks deep emotions and dialogue... But that's exactly the point, isn't it. How do you go about scoring a film that is all style and no substance but is so to enforce an ironic (and well made) point about society? This movie messes with my intellect... Arrrrgh!",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2016
      },
      "score": 3,
      "text": "This is the sort of film where you get the impression that someone saw a news story, thought \"That'll make a great movie\" and then spent a lot of money to discover that it doesn't. Nothing interesting happens. They do some burglaries, spend some cash and get caught. The whole thing serves as little more than an advert for fashion companies.",
      "total_reactions": 0,
      "user": "rpeh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2013
      },
      "score": 3,
      "text": "I wasn't expecting much with this movie but wow, the Bling Ring is really a stinker. First of all, even though it's only 90 minutes long, which is pretty short, it feels like it drags on and on the entire time. The cinematography was horrendous with the overuse of the slow-motion effects. The acting wasn't bad but none of the roles required much either. The characters were all pretty shallow as well. Yes, they're supposed to be but other than Emma Watson's character, none of them felt authentic. Speaking of Emma, she is the only reason this film is worth watching. She's smoking hot and delivers a solid performance. I think this film does shine a light on the repercussions of celebrity obsession but the movie doesn't take advantage of that message, instead focusing almost entirely on stealing, doing drugs, and partying in slo-mo. Sofia Coppola missed the mark here, that's for sure.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "Taken from numerous real-life instances, the Bling Ring is a fascinating look at teenagers and their mischievousness with celebrities in Los Angeles. Sofia Coppola. still, at the top of her game.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "It is most certainly entertaining watching wannabe celebrities crash and burn. The characters are misunderstood and unexamined, but the surface of this story was interesting enough as it was. It also manages to be quite amusing at times.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "The Bling Ring is a film with an informative content and interesting to watch; the problem is just that it could've so easily been told in a short film. Almost every single scene that isn't a montage considerably exceeds its needed length, and as the dialogue strictly (bar Leslie Mann) consists out of teenagers' gossip and prattle and only is worth listening to, to find out that Emma Watson can sport a West Coast accent rather well, there's boredom arising quite frequently. Since pros for watching the film more than once are virtually non- existent and skipping it won't be regarded as a gap in cinematic education by anyone, The Bling Ring is Sofia Coppola's worst film.",
      "total_reactions": 0,
      "user": "axelkoch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2014
      },
      "score": 6,
      "text": "This movie was based on the series of actual crime committed by the teenagers of the California. It was a quite nice black comedy than I thought. But many people did not like it, maybe because of satirical presentation which was more like a documentary style than typical. Music was another drawback, actually there were no background score except those disco musics that come very often.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2013
      },
      "score": 3,
      "text": "The Bling Ring is absolutely terrible. I was so pissed off by all of the main characters, even if that was the intention it was annoying as f**k. There is no resolution in the movie really, and it's going to make you want to research The Hollywood Hills Burglaries. The soundtrack was fitting and there was a good visual flair, but otherwise a completely incompetent waste of time.",
      "total_reactions": 0,
      "user": "SimpleMethod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2013
      },
      "score": 4,
      "text": "This film just bored me with characters I didn't care much about.  The film is well made and the acting is good, but the story is just not interesting and overall you don't really care.  C",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "I find this movie really hard to rate. The characters just made me feel disgusted. I can't believe that these people needed to act this way. This movie was done well otherwise. The hard part was that you couldn't connect with the characters or care what happened to them. It was a good movie but one time only.",
      "total_reactions": 0,
      "user": "sammietee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Very subtle, smart, acerbic, and funny. Just be prepared for how realistic it is. The direction and acting is stellar, with both constantly poking fun at the privileged stupidity of the suspects, with their dialogue, intentional fake crying, and dumb white girl mentality.",
      "total_reactions": 0,
      "user": "MattCipolla926"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "Really expected more from Sophia Coppola on this one. She is such a talent, especially loved Somewhere (which pust me in the minority for sure) and Lost in Translation, but this one just kind of lost me. Performances were pretty good,t hough",
      "total_reactions": 0,
      "user": "wonderphone"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "Bling Ring is not a masters piece but it's quite entertaining. Sofia Coppola manages to explore not only a story than it is based on true events, but also can shows us the reality of a society that aspires too much.",
      "total_reactions": 0,
      "user": "mcosta268"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "a bit douchy for my taste but the uniqe story makes up for it",
      "total_reactions": 0,
      "user": "Kempol"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "If you see it as a documentary, it helps. The story is good, realistic and and well explained. The fact that some scenes have a lack of soundtrack gives a boring feeling, so I don't think it worth the money of the ticket. As english is a foreign language for me, we usually study themes from actuality, such as teens (peer pressure, sleeping habits, school stress), technology( the pros and cons, the internet)  the environment, eating habits, etc. As this film joins the two first themes, this the type of film my english teacher would show us during class. I like the characters and their realism, and soundtrack  when it's there) is quite good. I liked the movie, but it is not brilliant, it's just good.",
      "total_reactions": 0,
      "user": "Thebestof_rita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2013
      },
      "score": 6,
      "text": "Interesting story, feels like its trying a little too hard to earn cred with critics, does depict the voyeuristic nature of facebook and social media in general.",
      "total_reactions": 0,
      "user": "mrjonesezn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "Disappointment, thy name is Emma. While it may not be fair to single out one actor from this ensemble class, she is the highest profile of the crew, and thus a box office draw card. This film won't convince anyone of her acting ability, but, to be fair, that's scarcely her fault. The Bling Ring suffers from an execrable script that allows for absolutely no character development. The characters are not particularly likeable, it's unclear why they do what they do, and between them they seem light on intelligence. You burgle celebrity homes and don't expect security cameras. Doh!",
      "total_reactions": 0,
      "user": "haukyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2014
      },
      "score": 3,
      "text": "I was so excited for this film and what a let down it turned out to be. It got boring, it gets 1.5 for the music and 1.5 for the stars but otherwise it was rubbish.",
      "total_reactions": 0,
      "user": "selenator"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "I liked it. She portrayed these money-thirsty lime-light enthusiasts, perfectly. Emma Watson was like a whole new person. She she's her skins as hermoine, into this teenage girl who was greedy and didn't care if breaking law was involved. It was perfect. It wasn't all glamour, they spit some dirt at celebrities and all this expensive clothes. Go see it",
      "total_reactions": 0,
      "user": "bestcritic55"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2014
      },
      "score": 4,
      "text": "i thought that this movie was not that well thought out...the ending was not good at all,and there were some parts that were very boring to watch...like when we are just watching them rob a house by just staring at the outside of a house and watching them in fast speed. i did not really like it.",
      "total_reactions": 0,
      "user": "co2345"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "exelente filme com exelentes atores como Emma e Taissa que tiveram muito destaque no filme porem teve um furo como a camera de gravação nao pegou a personagem de taissa farmiga?",
      "total_reactions": 0,
      "user": "AmauriR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2014
      },
      "score": 9,
      "text": "This movie isn't boring as the documentaries usually are, it's different, cool, funny, dramatic and i totally loved it. You all should watch it.... (:",
      "total_reactions": 0,
      "user": "ryandiamandis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "\"The Bling Ring\" 10 Scale Rating: 6.0 (Decent) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    }
  ]
}