{
  "mc_avg_user_score": 6.9,
  "mc_metascore": 55,
  "mc_mixed_rating_frequency": 11,
  "mc_movie_name": "The First Time",
  "mc_negative_rating_frequency": 4,
  "mc_positive_rating_frequency": 24,
  "mc_pro_critic_reviews": [
    {
      "critic": "Noel Murray",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 83,
      "summary": "In the first 15 minutes, viewers may be rolling their eyes at these kids; by the end, they might be eager to re-watch that opening scene, to get to know them all over again."
    },
    {
      "critic": "Michael Atkinson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 80,
      "summary": "Something of a wonder, a palm-size ball of banter and irony and earnestness that never stops rolling and almost never misses the sweet spots."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 70,
      "summary": "Sure, you've seen this story before, but this version has a freshness nonetheless."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "There is much to like here, a sense of nuance and nonjudgmental emotional openness, yet Kasdan's teenage miniaturism never quite blooms. The First Time is respectfully delicate, a little too polite."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "An inoffensive but bland ode to the talky high school movies of John Hughes and Cameron Crowe."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "Feels slight and pretty ordinary by the end, with no edge or compelling insights, just a reasonable feel for teen attitudes and banter."
    },
    {
      "critic": "Dennis Harvey",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "This teen romance proves perilously short on substance, insight and novelty, unless you count its characters being afflicted with a case of \"Juno\" mouth."
    },
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2012
      },
      "score": 38,
      "summary": "Sex and love are both novel experiences for two high schoolers in this talky affair that suggests a hybrid of Before Sunset and Some Kind of Wonderful."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2012
      },
      "score": 20,
      "summary": "Let your mind wander during this painfully generic teen-sex dramedy (trust us, it will), and there might be emotions worse than frustration in store."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "I really enjoyed this movie, even though it's more suited to an audience far younger than I. The main reason I watched this was because of the great cast. The talented and sexy Britt Robertson and Molly C Quinn. Then there is a young Aussie actor of considerable talent, James Frecheville who starred in the amazing 'Animal Kingdom'. Being a red blooded male I used to watch 'The Secret Circle' (hey, what's wrong with that?? lol) so Britt was plenty enough reason to see this. I actually recognised a lot of the actors in this well written movie. Another reason to see this was the fact that writer/director Jon Kasdan's previous film was the wonderful 'The Land Of Woman' so I was keen to see if he was truly following in his very famous director fathers footsteps. Father, Lawrence is behind some of the biggest films in Hollywood, such as, 'Return of the Jedi', 'Wyatt Earp' and 'Dreamcatcher'. He has his fathers touch.",
      "total_reactions": 0,
      "user": "NavQ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "I really loved this film. It captured the very essence of \"the first time\" with your first love. It's not perfect; it's not really good. However, you don't give a   Practice makes & you sure as hell don't mind practicing with them! I think this story was told very well & I highly recommend it. It really plastered a smile on my face.",
      "total_reactions": 0,
      "user": "MorriganDubh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2016
      },
      "score": 6,
      "text": "Brit Robertson and Dylan O'Brien make for two pretty great leads and it makes sense that they started dating during the shooting of The First Time. Their chemistry is outstanding and obviously the moments where the two are together are the highlights of the film. The fact that these characters are high school kids are both its rise and its downfall. The young characters make this more of a teen movie than anything but their innocence is also what makes the film unique. These characters go through some problems that a lot of young people have when falling in love for the first time.. There are so many cute moments throughout this movie. It's unfortunately pretty clichéd though, but it is still plain to see that both Brit Robertson and Dylan O'Brien were bound to become stars.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2014
      },
      "score": 7,
      "text": "Make a movie around this theme is a challenge, because needs don't let boring or so much explicit (depending of the public) but the cast made me enjoy it. They are amazing",
      "total_reactions": 0,
      "user": "Adson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "Cute and everything but the script is very superficial and basically nothing big happens. Ok, two teens have sex after two days since they met and...? No interesting exploration about that on screen, I just felt empty. Robertson and O'Brien are great together and share some amazing scenes and this helps a lot. It just doesn't help the poorly developed story of the film.",
      "total_reactions": 0,
      "user": "danipp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2016
      },
      "score": 10,
      "text": "Best film in this genre I've seen for a long time ..Sexy and Funny",
      "total_reactions": 0,
      "user": "blackswan73m"
    }
  ]
}