{
  "mc_avg_user_score": 5.6,
  "mc_metascore": 36,
  "mc_mixed_rating_frequency": 10,
  "mc_movie_name": "The Canyons",
  "mc_negative_rating_frequency": 14,
  "mc_positive_rating_frequency": 17,
  "mc_pro_critic_reviews": [
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 83,
      "summary": "Schrader tries to find the human side of it all, and he scores with Lohan, who taps a vulnerability beneath her dissolution to remind you why she's still a movie star."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 75,
      "summary": "You’d have to go back to the ’80s to find a film with this jaded a view of Hollywood, a town where every aspiring actor knows every yoga instructor who knows every producer and they all swap partners and dance. Constantly."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 70,
      "summary": "As a visual symphony, The Canyons is often masterful, and while it may be pornographic in places, it’s never campy. At the center of its cold, beautiful and half-dead world is the almost incandescent Lindsay Lohan, burning like a flawed diamond."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 70,
      "summary": "People who don't understand movies often speak of them as escapism, a kind of passive fantasy. Lohan's performance in The Canyons, so naked in all ways, is the ultimate retort to that kind of idiocy: To watch it is to live in the moment."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 70,
      "summary": "The major exception is Lohan, who gives one of those performances, like Marlon Brando’s in “Last Tango in Paris,” that comes across as some uncanny conflagration of drama and autobiography. Lohan may not go as deep or as far as Brando, but with her puffy skin, gaudy hoop earrings and thick eye makeup, there’s a little-girl-lost quality to the onetime Disney teen princess that’s very affecting."
    },
    {
      "critic": "Geoff Pevere",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2013
      },
      "score": 63,
      "summary": "The Canyons is actually anything but gratuitously sensational. On the contrary, it’s rather restrained, even conservative affair, far more interested in expositional conversation and a sustained tone of bleached-out melancholy than cranking up the heat."
    },
    {
      "critic": "Matt Patches",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 53,
      "summary": "The Canyons has all the elegance and depth of a daytime soap opera, peppered with flashes of name brand nudity for a tantalizing hook. It’s a slog."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "The Canyons may not work, and the sex (as well as the synthesized glop on the soundtrack) may be tragically unhip, but it was made by a director who still cares."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "The Canyons is a sleazy soap opera that fails primarily because it gives us no one to care about and no reason why we should be interested that we don't care."
    },
    {
      "critic": "Matt Singer",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "If Schrader and Ellis set out to prove that movies are dying or already dead, they might have done their job too well. The Canyons doesn’t play like the cure for a moribund industry, so much as a mildly effective, highly depressing administration of the last rites."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "In The Canyons, there’s no pleasure — only power struggles disguised as sex."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 42,
      "summary": "The Canyons comes across as a desperate gambit for relevance by a group of artists who want to reinvent themselves but don't know how. Fittingly, that's the theme of the film itself."
    },
    {
      "critic": "Adam Lowes",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2014
      },
      "score": 40,
      "summary": "Despite a liberal dose of full frontal nudity, The Canyons fails to fully revel in its sleaze, struggling to even work as a deadpan satire on the kind of vacuous and deadened Hollywood types Easton Ellis brought to life in the pages of his debut novel, Less Than Zero."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "The Canyons has more in common with Schrader’s opulent immoral tableaux “The Comfort of Strangers,” “Auto Focus” and “The Walker” than with his other work (including the script for “Taxi Driver”). It’s weaker than those, though, and less biting."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "With The Canyons, [Mr. Schrader] tries to get at something real under all the hard, glossy surfaces, but ends up caught in the divide between the movie that he seems to have wanted to make and the one he did."
    },
    {
      "critic": "Read full review",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "The Canyons is not porn, but it has the demoralized second-rateness and the lowlife inanity of the porn world."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 33,
      "summary": "Instead of commenting on the vapidity of the film industry, Paul Schrader's miscast, poorly executed and utterly soulless drama is an example of the failing art form it seeks to indict. Though it has real ideas, Schrader and his team never manage to put them into action."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 30,
      "summary": "Paul Schrader, the once-brilliant screenwriter of such films as “Taxi Driver” and “Raging Bull,” has fashioned a movie that seems to exist to be repugnant. Maybe that’s the point; it was written by Bret Easton Ellis. Nearly every character in this movie is unlikable."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2013
      },
      "score": 30,
      "summary": "The Canyons is a bad accident everyone saw coming, and now it is here."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 30,
      "summary": "The Canyons isn’t just bad, it’s rank — and it takes a peculiar sort of integrity to denude the frame of life to the point where it smells to heaven."
    },
    {
      "critic": "Ian Buckwalter",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2013
      },
      "score": 30,
      "summary": "Judging from the lack of care that went into making this one, I'm not so sure how much Schrader cares about the movies anymore either."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2013
      },
      "score": 30,
      "summary": "Far from the renegade, boundary-pushing, sexually explicit sensation that its makers have been suggesting, The Canyons is a lame, one-dimensional and ultimately dreary look at peripheral Hollywood types not worth anyone's time either onscreen or in real life."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2013
      },
      "score": 25,
      "summary": "The Canyons is billed as an erotic thriller, but the sexcapades of these empty-headed twentysomethings are far more likely to elicit yawns than titillation."
    },
    {
      "critic": "Christy Lemire",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2013
      },
      "score": 25,
      "summary": "Maybe the joke’s on us, and all the pre-release hype suggesting that a micro-budget train wreck was barreling our way was merely part of the marketing strategy."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2013
      },
      "score": 25,
      "summary": "Stephen Rodrick's New York Times article about the making of The Canyons had humor, suspense and propulsion. They should have made that movie. What we have here is dead on arrival."
    },
    {
      "critic": "Rodrigo Perez",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 25,
      "summary": "The cavernous emptiness of The Canyons cannot sustain itself, and it makes for a mostly flat, strained and uninvolving experience (not helped by the pace which makes 90 minutes, feels like a sluggish two hours)."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 20,
      "summary": "She (Lohan) isn’t the best thing about this awful, lounged-out drama — it has no best thing — but in her defense, Lohan has been atrociously directed, allowed to get away with the worst aspects of her vocal-fry laziness, and trotted out like a symbolic objet d’art."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 12,
      "summary": "The best acting in The Canyons is done by the porn star. That might be all you need to know about this film, which is the kind of vapid, self-consciously artsy, waste-of-time movie that might never have seen the light of day (or the dark of theater) and would have gone straight to VOD were it not for the triple-threat name-recognition trio of the actress Lindsay Lohan, the director Paul Schrader and the writer Bret Easton Ellis."
    },
    {
      "critic": "Chuck Bowen",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 12,
      "summary": "Paul Schrader and Brett Easton Ellis don't have the sense of play this kind of narrative of one-upmanship requires, as we're never allowed to enjoy the characters' misdeeds."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "summary": "Paul Schrader’s The Canyons is not the worst movie of 2013 — it's marginally better than \"InAPPpropriate Comedy\" and \"Scary Movie 5,\" two even worse bombs that Lindsay Lohan also lent her rapidly diminishing talents to — but it is surely the most boring I’ve seen."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "You know a film is weird when the actors can't act for  but deliver a good performance anyway? That's the case it seems in The Canyons, a film about deluded young adults who don't know what they want, and won't tell you even by the end of the film. What mostly brings attention to this small indie film is that it brings the official no-joke-I'm-actually-attempting-to-act return of Lindsey Lohan! A brave comeback into the film, alongside porn actor James Deen... Is that a sentence that should ever be spoken? Yes, the film co-stars a well known porn industry actor who takes the name from legendary actor James DEAN. This movie is already harder to review now that it's origins are explained, so let's go forth with the story.",
      "total_reactions": 1,
      "user": "TravisFinn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "The whole fricken problem here is that Lohan can't act but delivers a solid performance in The Canyons. The plot is okay but the film is too violent and dark. At least not all focused on Lindsay. Anyway, not too great as Entertainment Weekly is praising it but no too bad either. Good popcorn thrills with jackass stuff.",
      "total_reactions": 1,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2014
      },
      "score": 1,
      "text": "Oh man! The worst film I've seen in years! And the worst acting I've ever seen in my life, including the tapes of my mother's wedding. Beaker's puppet without the puppeteer delivers more than \"James Deen\" and Lindsay Lohan combined. When I started watching this, and there was that scene in the beginning, I was laughing my teeth out. But enough with jokes.",
      "total_reactions": 1,
      "user": "nicholasbert"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "This movie is not the best film i ever seen, but is goog and the Lindsay performance was excellent, i think that the actors did a great job in this film.",
      "total_reactions": 3,
      "user": "Luisdark27"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "The movie was getting bashed by critics even before it started production last Summer once Lindsay Lohan joined the film. Lindsay's performance is actually quite good. This is a very dark and edgy film and it really allows that side of her persona to flesh out throughout the twisted plot.",
      "total_reactions": 2,
      "user": "danielcruz90"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2014
      },
      "score": 5,
      "text": "I know the reviews were terrible. Out of curiosity I watched in anyway.  Also I was interested in what's become of Lindsey Lohan.",
      "total_reactions": 0,
      "user": "NoahCoward"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 4,
      "text": "While it suffers from low-budget syndrome and a poor direction from Mr. Schrader, Lindsay Lohan still shines--she sure does have a talent in acting after all these years.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "This film fails because the story in pointless and the acting is awful.  Basically what we get is a meandering story with a bunch of sex scenes mixed in.  For soft core porn this acting might be good, but in the world of mainstream film making this acting is cringe worthy. F",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2013
      },
      "score": 4,
      "text": "Film that tries to be independent, cult movie and almost it succeeds. \"The Canyons\" reminds me of \"The Other Woman\" or the Spanish film \"Allegre ma non troppo\". Lindsay Lohan recovers some of its former essence. The biggest problem with the film is not the script or the director, not, the problem is the partner of Lohan, James Deen. What does a porn actor starring in a movie? His performance is like a homemade short films actor.",
      "total_reactions": 0,
      "user": "mapizarro"
    }
  ]
}