{
  "mc_avg_user_score": 4.8,
  "mc_metascore": 35,
  "mc_mixed_rating_frequency": 49,
  "mc_movie_name": "The Host",
  "mc_negative_rating_frequency": 74,
  "mc_positive_rating_frequency": 72,
  "mc_pro_critic_reviews": [
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 63,
      "summary": "A silly, if fun, futuristic sci-fi romance."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 63,
      "summary": "The Host will make perfect sense to 12-year-old girls, while their college-age sisters will probably laugh themselves sick and their mothers will look at Hurt and wonder when he got so old."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2013
      },
      "score": 63,
      "summary": "The Host is top-heavy with profound, sonorous conversations, all tending to sound like farewells. The movie is so consistently pitched at the same note, indeed, that the structure robs it of possibilities for dramatic tension."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 60,
      "summary": "The Host gets bogged down in its “who’s kissing whom now?” dynamics, and it becomes all too easy to snicker at it."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2013
      },
      "score": 60,
      "summary": "An \"Invasion of the Body Snatchers\" retread told from a postoccupation vantage point, this adaptation of Stephenie Meyer’s YA romance novel unfolds in a dystopian future when alien parasites have nearly won the battle for Earth."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2013
      },
      "score": 58,
      "summary": "The Host is a step up from the endless metaphorical lectures and gaping plot holes of Niccol’s last film, In Time, but its muffled emotions, delivered with Twilight-esque blank-eyed calm, put it in the same category of a creative idea hamstrung in execution."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "As with the Twilight series, The Host's infelicities—drab dialogue, ridiculous plotting, more emotional crises than there is story—are enlivened by its thematic eccentricities."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "Saoirse Ronan's talents are wasted on a foolish dual part in this dull sci-fi fantasy."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "There's something about novelist Stephenie Meyer that induces formerly interesting directors to suddenly make films that are slow, silly and soporific."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "Extravagantly silly but undeniably entertaining sci-fi soap opera."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "'Twilight' of the Body Snatchers, without much urgency or sexual heat."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 42,
      "summary": "The Host doesn't strive for social allegory, as previous body snatcher flicks have done with the Red Scare, civil rights and Watergate. If anything it's merely a teenage girl's fantasy checklist for prom."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2013
      },
      "score": 40,
      "summary": "This film adaptation feels like YA, with cat’s-cradle love matches, soft-focus sexuality, and a main character who never satisfactorily makes the transition from page to screen."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2013
      },
      "score": 40,
      "summary": "Niccol and Meyer -- who co-produces this, her first post-\"Twilight\" film -- choose to trade away any shred of the ripe social subtext that has made other body-snatcher films so rich. In its place: the kind of supernatural, star-crossed romance that generates so much swooning from Team \"Twilight.\""
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 40,
      "summary": "Watch closely and you might even spy a better film inside, straining to break free."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2013
      },
      "score": 40,
      "summary": "The movie, based on the novel by Stephenie Meyer of “Twilight” fame and directed by Andrew Niccol, is just kind of dumb. Like the more famous books and movies, about a love triangle between a vampire, a werewolf and a human girl, it often plays like a teenage girl’s idea of how literary romances play out."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2013
      },
      "score": 38,
      "summary": "To work, The Host would have required a visionary interpretation rather than the mundane telling that Niccol opts for."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 38,
      "summary": "The Host basically comes down to a vote for Team Jared or Team Ian. I voted myself into oblivion about half an hour in. Niccol, who once added mystery and suspense to the sci-fi of 1997's \"Gattaca,\" is no match for the giant marshmallow that is The Host."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 37,
      "summary": "It’s a mushy and unsuspenseful melodrama."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 30,
      "summary": "The story goes slack onscreen, so much so that the movie's two-plus hours will seem an eternity."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 30,
      "summary": "Dopey, derivative and dull, The Host is a brazen combination of unoriginal science-fiction themes, young-adult pandering and bottom-line calculation. That sounds like it should work (really!), but it never does, largely because the story is as drained of energy as are its moony aliens."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 25,
      "summary": "Ronan, youthfully elegant as always, tries hard, but the material defeats her."
    },
    {
      "critic": null,
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 25,
      "summary": "Its title, very graciously, doesn't end with a \"Part 1,\" but The Host sure has enough plot points and ideas to fill two installments."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 25,
      "summary": "A long, tedious and often unintentionally hilarious adaptation of Stephenie Meyer’s sci-fi follow-up."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 25,
      "summary": "An invasion of the body snatchers is preferable to realizing that the true horror perpetrated here is not on the characters but on the audience."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 25,
      "summary": "The film may as well be titled \"Stephenie Meyer's Waiting Around.\""
    },
    {
      "critic": "Curtis Woloschuk",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2013
      },
      "score": 20,
      "summary": "Steven Spielberg famously retained his childhood sense of wonder. On this evidence, Meyer has maintained a nine-year-old's notion of titillating romance."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "summary": "It's really a dramatic sinkhole."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "Action? Nope. Shooting a gun sporadically don't makes an action film.",
      "total_reactions": 1,
      "user": "Agorash"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "Stephenie Meyer is a one trick pony who apparently only has one story in her which she now is trying to milk in every which way possible. Melanie (Ronan) gets taken over by a soul-alien and wadda ya know: she loves one guy and the soul loves another guy...sounds familiar (Bella loves Vampire/Werewolf)? Although this film is not as bad as Twillight, it sure is long, boring and slow. 125 mins and almost nothing happens. We also get the same old tiring messages of hope and peacefull coexistence and yada yada yada. By the end you'll be fighting to stay awake. Fell asleep twice. This is only scifi in concept, there is no science to be seen anywhere in the film and how are those glowy small soul aliens who live in little metal containers ever going to conquer the universe without opposable thumbs? How did they make the containers? How are they even going to get out of them (no thumbs remember)? What are they doing in there (sleeping, thinking about nothing, being bored out of their minds)? The story is very simplistic and superficial and clearly Meyer has no idea what scifi is all about. She probably thought it was a nice backdrop for yet another slimy teen love story. One last thing: I'm pretty sure they put a gun to Andrew Niccol's head and forced him to make this crap. I don't even want to consider why the man who gave us 'Lord of War' and 'Gattaca' -two of the best films of all time- would willingly accept to make this vommit. So yes, I didn't like it, go see it if you want. You'll never get those 125 mins of your life back!",
      "total_reactions": 1,
      "user": "Apemonkey666"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "Was a great movie! Finally something different that doesn't have a terrible ending. Was a little worried about the film because of the other reviews but the story seemed so interesting and was! I feel like it was better the a 8 but can go into a 9 just because of other films I have seen!",
      "total_reactions": 1,
      "user": "Justin7a"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2013
      },
      "score": 4,
      "text": "I really wanted to like this movie.  Some of the effects are absolutely captivating, but the terrible acting and downright silliness of the plot take away from any of the positives.  The original score is one of the better to come out of a sci-fi movie in recent memory, but the cliches (chrome plated everything, for example) destroy what could have been a decent film.  Skip it, but get the music.",
      "total_reactions": 9,
      "user": "OnAnarchy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2013
      },
      "score": 3,
      "text": "The biggest sin of this film is that it is so dull, it is completely forgettable. I saw the movie a while ago but I can't remember a single thing about it. Acting is subpar, the story is sloppy, action is dull, interesting sci-fi concepts are barely explored and the hackney love story is generic and boring. There is nothing about this movie that I hate, but there is also nothing I like. It is just lazy garbage made to cash off of the success of Stephanie Myers far more popular and unintentionally funny Twilight franchise. I would recommend this movie if you enjoy watching paint dry.",
      "total_reactions": 6,
      "user": "RalphsReviews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 3,
      "text": "This is not scifi.  It is yet another teen romance drama.  There couldn't be worse dialogue if you tried.  The story is insipid and corny.  Revenge of the body snatchers crossed with twilight.  I hope this doesn't get a sequel.",
      "total_reactions": 3,
      "user": "StevieGJD"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2013
      },
      "score": 2,
      "text": "The acting was very good at parts and some of the scenes were well done. However, this might have been the worst script that I have ever seen. The script is so bad that it ruins any possibility for romance or science fiction. Waste of two hours.",
      "total_reactions": 3,
      "user": "Teomor"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2013
      },
      "score": 1,
      "text": "Why waste our time with these love triangle, teenage girl romantic fantasies? Same material in different packages every year to fulfill the fantasies of young female audiences. Andrew Niccol writer of \"The Truman Show\"  and director \"Gattaca\" can make better than that.",
      "total_reactions": 3,
      "user": "oliver1h"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "Well, the ad industry certainly takes a nosedive after alien occupation, but Detroit will rejoice because chrome sports cars, it seems, are  a universal desire.  The Host is \"Twilight for Aliens,\" complete with all those teenage moments of \"what would be really cool to include in a sci-fi movie\" that Stephanie is known for.  I just wish that the aliens weren't quite so boring, that the pace of the story was closer to jogging than strolling, and while I was expecting a lot of footage shot in caves, the caves looked strangely like props from the original Star Trek.  Very roomy.  I didn't hate the movie... just kind of hate myself for going to see it.  But I always felt that way at Twilight films ...At least it finally explains those voices in my head.",
      "total_reactions": 5,
      "user": "hollyv"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2013
      },
      "score": 1,
      "text": "This movie is garbage. Yes, there is Sci-Fi, in it, and its thought-provocative, but it has such bad acting i can only give it a negative review here.",
      "total_reactions": 11,
      "user": "IonXtreme"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "This movie wasn't that bad.  I had read the book about a year ago, so \"filled in\" a lot of information myself that wasn't there in the movie.  However, if a person HADN'T read the book, they would probably give it a 4 because it was slow moving.  There were poignant moments that I enjoyed seeing come to life, but this is really a movie for those who have read the book.  It doesn't stand on it's own.  There's so much more detail in the book about Wanderer (her life, history, struggle between being a Soul and reconciling it with her new feelings and behavior, dealing with Melanie, etc.) and you only get 1/20th of that from watching the movie.",
      "total_reactions": 4,
      "user": "Raygirl"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "Believe it or not, The Host is actually hurt by the fact that it was written by Stephenie Meyer, the famed creator of the \"Twilight Saga\". Because of that, it seems as though the critics and viewers alike cannot let go of that comparison. Meanwhile, this story is not even remotely close to Twilight and if a different person was credited with creating it, I honestly feel that the ratings would be so much higher. That's because this is actually an incredibly original plot that develops really well throughout. If you want to say that the premise is silly or whatever, go ahead. It's an alien movie for crying out loud. If you don't lower you suspension of disbelief a little bit then every single science-fiction movie also becomes silly, what makes this one different? Go in expecting the premise to be out there because that's the foundation of the plot. Now, the acting, while solid, could've delivered more emotion but that also seemed to be part of the point. Some of the plot points were also a little weak but not enough to ruin the viewing experience. Overall I was very pleased with this film and found it quite entertaining. If people would open their minds a bit and let go of the Twilight relationship, I think most of them would as well.",
      "total_reactions": 4,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "\"What was actually an intriguing premise and somewhat clever story-line, gets butchered admist on the path for destruction. The Host, fails in conjuring any sense of emotion and depth and instead makes you wanna take an aspirin because your head hurts.\"  F",
      "total_reactions": 2,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "Stephanie Meyer is derided and praised in equal measure so with her movie follow up to the twilight saga, The Host, she had something to prove. She had to prove that her patented romance formula could translate from the supernatural to the science fiction genre. Unfortunately for The Host hardly anyone wanted to find out despite the fact in most ways, The Host is better than any of the Twilight films if only for one reason, there is a sense of meaning to what happens in this world where as with Twilight, someone couldn't pay me to care. The Host tells the tale of Melanie Stryder (Saoirse Ronan) one of the few surviving humans on Earth. When she is captured she is implanted with an alien life and becomes a prisoner in her own body. The alien, known as Wanderer begins to experience human emotions and Melanie's memories and she struggles to live normally and is forced to seek out those Melanie has left behind. The film is odd because its deeply planted in the Sci-Fi genre but it feels like a deep character piece with a typically western feel. It's a cross genre story that carefully balances each genre while never forgetting the rules of this new world the characters live in. The film doesn't really concentrate on action and feels more comfortable in the small personal moments. Sure the film has its action sequences but they are always coupled with an emotional character moment as though juxtaposing the two. This does make the action rather drawn out and lackluster but like I said, this film really isn't about the action. The music (by Antonio Pinto) is unique and an odd amalgam of conventional western tones and electronic western notes. It provides an interesting context to the world that has been built, the solitary nature of this new human life but also the presence of the futuristic and the good and bad that comes from this intrusion. It has an Eric Serra (The Fifth Element) feel to it and because of it, the music proves well suited to moments of emotion but also sudden action. The film is grounded in a sense of reality, be it a slightly 12A reality where all anyone ever talks about is kissing (It's a film aimed at the young and idealistic after all) and the film relies heavily on Ronan to keep the film flowing and from becoming overly complicated. She delivers in both roles (despite Melanie being mostly voice-over) making them both sympathetic protagonists despite the twisted nature of their joint habitation. It's a film about morality (like many westerns are) more than anything and the idea that no one is perfect is rampant in the film. The film has the tendency to break its own established rules to serve the story so there are a fair few plot holes making segments of the film unbelievable (beyond the whole aliens from another planet thing). It depicts a world and a girl at war with itself and it does so in a subtle way by concentrating on the small moments, the ones that depict the voice and ideals of the people and why they fight to begin with.",
      "total_reactions": 2,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "Unadulterated unmitigated  Disengaging, unintentionally hilarious, wooden acting, little or no story, the level of suspension of disbelief is staggeringly arrogant.",
      "total_reactions": 2,
      "user": "3DJFLetch"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "Buy a ticket for the eye roller express on this stinkeroo.  It has been many moons since I have walked out of a movie but this one earned the distinction of seeing my heiny trotting on out the door.",
      "total_reactions": 2,
      "user": "Mickster"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2013
      },
      "score": 1,
      "text": "Few movies, have been so painful to watch, especially in a big budget film. I kept telling myself i would judge this movie on it's own merrit, and never compare it to twilight or let it drag it down, but as it turns out it didnt matter because shockingly enuf, THIS MOVIE WAS WORSE. I know, i am surprised to say that myself. How could a much hotter actress in a movie with aliens be worse? Well it is so poorly executed and the story is so predictible and boring and horribly sappy (bad sappy not good sappy). At many parts i laughed at how cheesy and ridiculous what just happened actually was. Stephanie Meyer has absolutely no concept of how the male mind works and very poor writing skills. The casting team also needs to learn that there are many different appearances to men, and not just the pretty boy surfer dude that BOTH main male leads were hard to disquinsh apart from. Made the main character look very (insert possiblly nonexistant socially accptable term for a girl who is too loose with the guys) because stephanie meyer tries way to hard to force the broken two men one girl mechanic into a story where only one guy is needed. In fact, this story would have been far better with only one male lead and could have further developed the bond between the two charcters. Meyer needs to learn this important detail, two guys fighting over one girl concept is not new and is perfectly fine, but the two \"hot\" guys fighting over one average girl and deciding to be friends and sharing in some twisted threesome relationship concept is ridiculous and unrealistic, at least in the manner she keeps trying to display.",
      "total_reactions": 2,
      "user": "JesseJ7"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "text": "I have no idea why I thought this would be better than the twilight movies... It might actually be worse. There's nothing wrong with the premise, but the pure fact that the main character has a constant voiceover running is not only distracting but horribly cliché. The story construction, character development, and dialogue are all just terribly written. I cannot understand why Stephanie Meyer is so popular.",
      "total_reactions": 2,
      "user": "lehuggin"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "This is not a bad movie despite the critics reviews. Saoirse Ronan acting in the film was great and the plot while not strong ended in a satisfying way.The portrail of the struggling Wanda and the occasionally funny Melanie helped when the movie got occasionally dull.",
      "total_reactions": 16,
      "user": "MOHAMMAD0203"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "I liked this film. The presence of Ronan, Hurt, Kruger, and a few others really made up for some of film's weak spots. The story is somewhat generic, but it still works. They add an interesting twist to the \"love triangle\" formula which is what I believe proves to be one of the stronger aspects here. It's beautifully filmed and that along with several other strong points truly makes up for the film's transgressions. At least we are dealing with a genre that's a bit more forgiving as opposed to glittery vampires.",
      "total_reactions": 7,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "The best part of this movie that is being overlooked by it's critics is the genius and the wonder full progression of how each main character comes to terms with their ethics, being honorable and doing the right thing. Each one of them are put in situations where it would be much easier to take the easy way out and give in to their anger violence and prejudice and be like every one else of their species and not uphold honor and integrity. There are not enough movies out there like this one and there needs to be more. The movie makes so many good points about character and overcoming our primitive responses and showing us how violence and oppression can be overcome with non violent solutions and more forward moving ways of being and thinking.",
      "total_reactions": 7,
      "user": "Espiancritic"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "Pacing",
      "total_reactions": 7,
      "user": "Samxsteal"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "Twilight aside, please allow me to comment on the cinematic masterpiece that was The Host. The poignancy of this quality film stemmed from a script that allowed the characters to truly tap into a world of emotion far beyond human comprehension. Indeed, this movie is quite literally, \"out of this world,\" as alien lifeforms--nay \"souls,\" as they are called--take over all bipedal hominids. All bipedal hominids, that is, save for a group of hardy individuals called The Resistance. Though originally unable to accept Wanderer/Melanie as one of their own, they eventually [spoiler alert] learn to accept her as the lovable, alien-infested being that she is. The striking originality and angst-ridden drama of this film lended itself to a powerfully emotional experience that will remain with me for many a year to come.",
      "total_reactions": 15,
      "user": "misterbunnin"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "Ignore the basically clueless media reviews…..this is a very intelligent",
      "total_reactions": 3,
      "user": "jhep"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "text": "Very generic and dull and tedious beyond belief. Shallow pap, with a music score as awful. Which is a shame because the cast is quite good, like Adam from Supernatural. But what did you expect from a Stephanie Meyer film?",
      "total_reactions": 3,
      "user": "TheXand"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "This was an excellent movie. I can why people might not like as it is a bit OTT but you can't deny the acting was excellent by all. They should actually turn this into an actuall saga like the Darren Shan.",
      "total_reactions": 3,
      "user": "stormseeker304"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "I can't say this is a masterpiece, although it isn't a  like Twilight saga. No, The Host is a great movie. If you have read the book, you can notice the movie is on rush but I think this is OK because the original story is really wide. The storyline is great (8/10), the direction is quite good (7/10), the acting is very good (8/10). I really enjoyed The Host because there aren't too much romantic scenes, there are some action and a bit of Sci-Fi, too.",
      "total_reactions": 3,
      "user": "Liootas"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "Ok so first of all, It's not going to win any awards or be one of the biggest movies of the year. But in saying that it's not at all a bad movie. I haven't read the book so i don't know how closely it follows the story. But i enjoyed the movie enough to want to read the book. The actors are great and the action is fun. It's also funny and touching in parts! I only wish it had been that tiny bit better. It lacked something. What that is I'm not quite sure. But it could've been so much better. But still i enjoyed it and would watch it again",
      "total_reactions": 3,
      "user": "josh4u92"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "this film was awful. I was constantly yawning and I even wished that I could be taken over by an alien being just to end the torment. I was constantly cringing at the dialogue and the acting.",
      "total_reactions": 3,
      "user": "sarbucxx"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "The Host just didn't feel like the Twilight movies, it was completely different! It's an odd romance movie with no potential, no target, nothing but the film is fun and it has ALIENS! And I am not a Twilight fan but this film was actually a good time! It had everything, magic, kisses, aliens and Pathetic Romeos. The film was slow but we gave it time and its still slow. The pace drops towards the end and its lore doesn't amuse you. It's not a great movie but its good for a Sunday night after work.",
      "total_reactions": 10,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "Ok, that was really amazing",
      "total_reactions": 12,
      "user": "Nickolassp"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "I haven't read the book, so i found this movie very enjoyable, interesting and kinda of fresh for me. I didn't realize that the time went by so quick but it still a good one. This movie shows human interactions and emotions such as hate, love, fear, trust, courage and hope.",
      "total_reactions": 8,
      "user": "ivan_terrible"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "Not sure why this film is getting suck bad reviews the story is good and for a near two hours movie i was never bored and did not look at my phone for the time once unlike so many films with better scores. Saoirse Ronan was great i thought she gave a really good performance its not a complete  sci fi   or a romance drama so don't think it another Twilight  So make your own mind up but its worth a watch in my book",
      "total_reactions": 4,
      "user": "scoley"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "I was feeling a bit dragged about The Host. I thought the trailer was better than the movie itself. I agree with the critics. This is not the Stephanie Meyer movie I know about. But now since the \"Twilight\" series finished, maybe I'll give it a shot on The Host. It may be a disappointment just like Beautiful Creatures, but I'll rent it. Maybe I'll just read the novel instead.",
      "total_reactions": 3,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "The Host is a science fiction film of 2013 directed by Andrew Niccol, based on the novel by Stephenie Meyer with Saoirse Ronan, William Hurt and Diane Kruger.",
      "total_reactions": 1,
      "user": "Mad_Hatter91"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "I went into this film with expectations based on the trailers I had seen. Basically, the movie studio apparently was afraid of what they had created, and released promotional material that was so pedantic, so wanton of a touristed veneer, that it completely obscured the artistic and dramatic genius that this film engenders.",
      "total_reactions": 2,
      "user": "Finfid"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2013
      },
      "score": 4,
      "text": "A silly \"teen beat\" approach to typical sci-fi invader tropes, this overly done and half baked psuedo love story provides more laughs than gasps. exhibit a) the chemistry between these kids is non existent, making for some unintentionally hilarious scenes. not the fault of our young cast, who struggles with utterly ridiculous dialogue though with promising conviction. exhibit b) the narrative get's lost into an ostentatious dive by the whim of over dramatic \"love cues\" or quite simply, poor writing. let's face it, Stephanie Meyer doesn't really know what she's doing. an unlearned writer who got lucky with 'The Twilight Series' by tapping into the narrative routine that was more like a \"teen idol poster\" to a novel, Meyer was able to exploit what teenage girls \"really want\"; having been undermined with sexist literary schemes that harken back to the \"damsels in distress\" or \"suzie homemakers in white aprons\", with a twist. what's her modus operandi? a subversive heroin who balks and crumbles at the feet of a prototypical blue-eyes, who reminds them what it's like to be a woman. you couldn't write dialogue anymore jarring to 50 years of women's lib if you tried. exhibit c) there must have been a better way to engage the audience with the pivotal \"two voices in my head\" scene. a scene wherein both the writer and director attempt to circumvent the drama with a true, honest to god commentary on the anagonist's jungian state, which would translate into this sort of thematic reveal and open up the plot and central theme of the movie. unfortunately, it's far more sillier on screen than it was on paper. in fact, who even writes this stuff? oh, yeah.....exhibit b.",
      "total_reactions": 1,
      "user": "joey-clemenza"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "The movie is not a Sci-Fi movie, it’s a love story with some science fiction elements. The plot is dull, the acting is regular and the visual effects are fine. I believe it is a hard book to adapt (cause half of the story takes place on the head of the main character) and they did what they could in 2 hours, but I felt it all in a weird dull-rush, some of the things didn’t make sense. The idea is good but the movie didn’t quite capture it. Didn’t love it, didn’t hate it.",
      "total_reactions": 2,
      "user": "GabiiRRS"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "I loved it! I believe this movie was done incredibly well. The film adaption very closely followed the plot and actions of the book written by Stephenie Meyer. I would strongly recommend this movie to anyone.",
      "total_reactions": 1,
      "user": "Shaipo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Maybe not an awe inspiring flick, but the drama isn't as bad as some say it is. Perhaps there are some cringe worthy moments, but they were interestingly explored, and coming from a sci-fi fanatic background, I still remained tuned in for the ride until the end.",
      "total_reactions": 0,
      "user": "ShaunnyBwoy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "Director Andrew Niccol (Gattaca, In Time) is known for taking ideas presented in short stories and turning them into something magical for the big screen. The Host is loosely based on Robert Silverberg's classic, Passengers, and tells the story of aliens who come to earth and use human beings as host bodies. Once inside, the aliens replace their humans consciousness for their own purposes, but some are able to resist this process and even control their alien host. Melanie Stryder (Saoirse Ronan) is one of those people, and while she can't rid herself of the alien presents inside of her, she can control it. Saoirse Ronan stars and it is great to finally see her in a movie that is worth while. Ronan is one of the top young actresses in Hollywood, but she keep playing roles like Hanna, in terrible films that do little more than to allow her to show off her talent. In those films, she was the only thing worth watching, so putting her in a film that's actually good, really gave her the opportunity to shine and she was amazing. Ronan played the role of Melanie, trapped in her own body but also played the alien Wanda that was inside of her. Once gaining control of Wanda, Melanie seeks out her family, which are part of the resistance. He main love interest is played by Max Irons, who was also terrific. Known more as a model and background character, this was really one of his first starring roles, and he was fantastic, playing a man caught between his love for this girl and his hatred for the alien inhabiting her. The Host has it all, an alien race, chasing a fugitive on the run, leading up to a major dilemma, wrapped inside a love story. Silverberg's Passenger is a favorite of mine and I knew with Andrew Niccol at the helm that this was going to be a good film, but I had no idea how innovative and intense the story would be, and for that, The Host is the latest film to join our list of must see movies.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "I like Sci Fi but I like a great movie with a beautiful story even better. This is both so it is a winner. Very well done and I usually read the book before I watch the movie. I am glad I did not in this case. I had just watched Pacific Rim with my son at the local IMAX 3D and was amazed at the special effects but it was missing something, like a story. The Host filled in the gap and I am very glad I watched it. I guess I am saying it was better than Pacific Rim in my book!",
      "total_reactions": 0,
      "user": "rkeinc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2014
      },
      "score": 2,
      "text": "Horrible movie to watch. Alien parasite like creatures taking over human bodies to accomplish, well, something. I don't really know, I was bored most of the time watching it. Acting was bad, story was bad, characters were boring. Waste of time.",
      "total_reactions": 0,
      "user": "Tessara_Vejgan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "I love sci/fi But if a gun was held to her children's heads Stephany Meyer would still be unable to write a strong, mentally stable female character..",
      "total_reactions": 0,
      "user": "bjinman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "‘The Host’ starts promisingly as the heroine finds herself in a terrible situation and the stakes are very high. There are also some nice images and Saoirse Ronan is fine, as usually. However the movie slowly degenerates into a metamodern mess: souls, bodies, aliens, humans, personalities and memories are mixed together, different concepts are confused and the story becomes meaningless. Furthermore, the pacing suffers during the second half and there is almost no action.",
      "total_reactions": 0,
      "user": "Dimitris01"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "The ending was laughable due to poor lighting effects.  Every other scene was beautiful.  Hollywood severely rewrote events.  Unlike Harry Potter, what was cut or changed seriously effected the book ideology.  A person was killed with a gun, which shocked the heck out of me just because (spoiler?) no gun was fired in the book.  This movie showed that only books can be entertaining w/o firearm usage.  I'm sure someone else will remark on the voice-over for Melanie's internal dialogue.  But that's basically another reason to read the book.  At least I can better picture the setting.  I thought the movie was beautiful, with tacky story-telling.",
      "total_reactions": 0,
      "user": "Jessica_Webb"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "You can't make me see this film even if you paid me. The effects were painful to the eyes, the story was a rip off of other Sci-Fi films, and acting was so bad it made who could have been good characters look bad. With hope, Stephanie Meyers will never get involved in movies again.",
      "total_reactions": 0,
      "user": "Dladroga"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "Why Would the writer-director of   \"In Time\"  make a Stephenie Meyer adaptation? In time was a good suspenseful science fiction thriller film Niccol has some good imagination with science  so why is he making a movie about Meyers book? i do not know or care all i am just saying is i did not see Twilight cause i hate the movies  also  i hate  Lautner and Pattinson. So anyways when i watch this movie all of the cliche's of Meyers and her books  are exactly the same also its exactly like twilight  so why don't critics who get paid to watch her failed movies should bring a check list each time when you a Meyer movie. this movie i found entertaining , interesting the reason why i give this a 7/10 is its corny cheese vampire romance bull **** Grade B-",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "text": "Multiple one word sentences can sum up this mess easily: Boring! Slow! Lame! Dumb! etc. The film was dull, unexciting, and had boring acting and a lame cast. It had one interesting action chase scene, the rest was a boring love triangle. The trailer might be interesting, but the actual movie is just a complete waste of time.",
      "total_reactions": 0,
      "user": "jacob4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 1,
      "text": "\"The Host\" 10 Scale Rating: 1.0 (Historically Bad) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "The host - the book - was the very first book that I stop reading after three chapters, I gave up because I thought it was tedious and boring. It's also the reason why I have this rule, whenever I pick up I read up to three or four chapters and if by then I'm not not hook or interested in the story I put it down. So when the host - the movie - came out in 2013 the only thing that got me interested was Saoirse Ronan. At the time, I remember thinking \"What the F*ck is she doing in that movie?\" but she was in it, so I gave it a shot, putting all of my preconceived ideas about it aside.",
      "total_reactions": 0,
      "user": "wornoutspines"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "This movie is amazing, one of the best of 2013. I don't understand why the critics hate it so much, is such a strong and pretty story. The book is so cool, probably they hate because it's Stephanie's Meyer, maybe that's it.",
      "total_reactions": 0,
      "user": "italo_araujo12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "Another great story from Stephenie Meyer, great actors, great plot, great ending.",
      "total_reactions": 0,
      "user": "jelenabiebs31"
    }
  ]
}