{
  "mc_avg_user_score": 7.2,
  "mc_metascore": 34,
  "mc_mixed_rating_frequency": 4,
  "mc_movie_name": "The Lifeguard",
  "mc_negative_rating_frequency": 1,
  "mc_positive_rating_frequency": 11,
  "mc_pro_critic_reviews": [
    {
      "critic": "Gary Goldstein",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 70,
      "summary": "The Lifeguard is a watchable, emotionally redolent trip down one woman's memory lane."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "The Lifeguard is one of those deceptive movies that, to its credit, winds up being about more than just an easy-to-describe tagline. In this case, that line would be: “Woman goes back to hometown, sleeps with high school boy.”"
    },
    {
      "critic": "Sheila O'Malley",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2013
      },
      "score": 50,
      "summary": "It's not the most original of concepts, and writer-director Liz W. Garcia struggles with the tone throughout, but The Lifeguard is often saved by Kristen Bell's sensitive and complex performance."
    },
    {
      "critic": "Mike D'Angelo",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Bell is too inherently sympathetic to turn Leigh into a credibly flawed protagonist, and first-time writer-director Liz W. Garcia seems more interested in indulging the fantasy of the jailbait fling than in seriously interrogating her heroine’s psyche."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2013
      },
      "score": 42,
      "summary": "Like its lead character, The Lifeguard is stuck in a rut. After establishing Bell’s frustration within the first five minutes, the movie continually reiterates it."
    },
    {
      "critic": "Nicolas Rapold",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "This directorial debut by Liz W. Garcia, a writer for television, bears some echoes of its creator’s origins, going from deft to trite in its drama and setting up character arcs that feel sappily resolved within its feature length."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 38,
      "summary": "Writer-director Liz W. Garcia depicts Leigh’s quandary with a heavy hand that gets heavier as the movie goes on, ending with one of those portentous freeze-frames that worked in “The 400 Blows” and never since."
    },
    {
      "critic": "Justin Lowe",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2013
      },
      "score": 30,
      "summary": "Surprisingly for a writer turned director, the most evident shortcomings with Garcia’s feature originate with the script. With barely any backstory to support them, the characters consistently appear to lack the motivations necessary for their actions."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2013
      },
      "score": 30,
      "summary": "Lambert brings a forlorn dimension to his seductive young role, but Bell never really convinces as the older woman. Despite flirting with controversy, the actress seems reluctant to plunge fully into potential unlikability, nor does the film quite give her the chance."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2013
      },
      "score": 27,
      "summary": "The Lifeguard is a painfully dull (alleged) drama utterly lacking in originality or self-awareness."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 25,
      "summary": "Dull yet contrived drama."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2013
      },
      "score": 25,
      "summary": "The film heroically stretches out its governing water metaphor to a point that allows it to best Garden State's Guinness World Record for most incessant navel-gazing."
    },
    {
      "critic": "Ernest Hardy",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2013
      },
      "score": 20,
      "summary": "From concept to execution to tone, writer-director Liz W. Garcia's The Lifeguard is a lifeless misfire."
    },
    {
      "critic": "Eric Hynes",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2013
      },
      "score": 20,
      "summary": "This drama is as listless and self-regarding as its protagonist, flitting among underdeveloped characters and subplots and indulging in rote emo shots by the pool, yet never figuring out how to dive into the deep end."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "I really don't understand the bad reviews this movie received. I watched it on a whim on Netflix streaming, so I went into it knowing nothing about it or how it was received. I went in completely raw and I really liked this movie. I have high standards when it comes to movies, and I don't give something a good score if it doesn't truly deserve it. I wonder if there was some Hollywood politics going on that led to critics ganging up on this movie undeservedly (perhaps critics were too scared off by the taboo \"sex with a minor\" plot line that they were afraid to review the film positively for risk of being labeled \"immoral\" ).",
      "total_reactions": 1,
      "user": "skim123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "To call The Lifeguard a coming-of-age film doesn't quite do it justice. It is that, but it's not just a teenager who is coming of age. There is an almost 30 year old who is discovering that her life as a journalist in the big city hasn't quite turne out like she planned. There is a 17 year old who plans to drop out of high school and move far away with his best friend. There is another 30 year old woman who is on the edge of starting a family and is paralyzed with fear that she won't be a good mother. There is a third 30 year old who still lives in his hometown and has yet to come out of the closet. And finally there is a woman in her late 50's who is embarking on a second act in life and desperately needs to be taken serious by those around her.",
      "total_reactions": 1,
      "user": "Jollybuzz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 1,
      "text": "The proper name for The Lifeguard should be called The Losers. You could not put together a worse group of low lives and scum than the characters in this film. The only thing that was worst was the script, which was dull, extremely poorly written, and produced subplots that were meaning less.",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2014
      },
      "score": 5,
      "text": "The Lifeguard is a fairly average indie film that shows potential but ultimately fails to capture and hold the viewers attention. The acting from Kristen Bell and supporting cast members like Mamie Gummer and David Lambert is very good and the story has so much potential in shining a perspective on many people nowadays who hit their \"quarter-life crisis\" moments and the internal struggles they face. The problem is that too much of the film focused around a strange romance between the protagonist and a high school student. While I understand the reasons for why Liz Garcia did this, I think it hurt the film more than helped. It created an interesting dynamic between the characters but it killed what I thought should've been the focus of the film... seeing Bell's character discover herself after being lost. Overall, not a bad movie but it could've been much better.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "I am also mystified by this movies poor reception.  I found Kristen Bell's desire to go home again to be completely relatable.  I also *liked* the soundtrack, but I guess that was just me.",
      "total_reactions": 0,
      "user": "ohisee"
    }
  ]
}