{
  "mc_avg_user_score": 5.2,
  "mc_metascore": 39,
  "mc_mixed_rating_frequency": 47,
  "mc_movie_name": "The Other Woman",
  "mc_negative_rating_frequency": 46,
  "mc_positive_rating_frequency": 61,
  "mc_pro_critic_reviews": [
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 75,
      "summary": "Audiences looking for a nonstop laugh riot may be disappointed, but the big laughs are there, and they benefit from the movie's underlying sincerity."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 75,
      "summary": "Definitely funny. Goofy, ridiculous, with more gross-out humor than is strictly necessary but still funny."
    },
    {
      "critic": "Leah Greenblatt",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2014
      },
      "score": 67,
      "summary": "This one has its own wonky charm and intermittent moments of genuine, depraved hilarity; it's like \"Bridesmaids\" drawn in crayon."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 63,
      "summary": "Apparently intended as a blend of \"Bridesmaids\" and \"The First Wives Club,\" it’s often oddly engrossing, almost despite itself, largely thanks to the performances and the free rein the director gives his stars."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 63,
      "summary": "Written by newcomer Melissa K. Stack, The Other Woman offers roughly equal parts wit and witlessness, casual smarts and jokes, lingering and detailed, regarding explosive bowel movements. Based on that ratio, I'd say the screenwriter's future in Hollywood looks pretty good."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2014
      },
      "score": 63,
      "summary": "Melissa K. Stack’s script has snap and crackle to go with the pop, making this female wish-fulfillment fantasy an “Eat, Pray, Revenge” that delivers the punches that two “Sex and the City” movies never could."
    },
    {
      "critic": "Kate Erbland",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2014
      },
      "score": 61,
      "summary": "The Other Woman eschews plenty of standard genre expectations to make an unexpectedly friendship-friendly film."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2014
      },
      "score": 60,
      "summary": "As it winds its way toward an unexpectedly grisly final showdown, The Other Woman often feels stranded between gross-out comedy, romantic fantasy and distaff psychodrama in a way that compels fascination and impatience alike."
    },
    {
      "critic": "Anna Smith",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2014
      },
      "score": 60,
      "summary": "Instead of updating the genre, The Other Woman rehashes it, bringing little more than a few giggles and a dash of glamour to the table."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "A montage-happy, occasionally unpleasant film that’s still strangely watchable, The Other Woman is almost saved by a cast that’s … well, likable isn’t quite the word."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "Thank goodness for Leslie Mann. If not for the nutball charm of this tight-wound whirlwind, the dispiriting Hollywood sex comedy The Other Woman would be close to unbearable."
    },
    {
      "critic": "Christy Lemire",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "Trouble is, Cassavetes — working from a script by Melissa K. Stack — veers wildly between cautionary tale, revenge comedy, scatological raunchfest and female empowerment drama."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "Oh, all right, some of The Other Woman is funny. The parts with Leslie Mann, mostly, who makes this hit-and-miss, problematic comedy directed by Nick Cassavetes far more entertaining than it has a right to be."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "Granted, femme-centered film comedies are a thing to cherish, but The Other Woman only gets it half right."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "A smiling Cameron Diaz and a weeping Leslie Mann bring a lot to any movie, but they aren't enough to overcome the mix-and-match mania of these proceedings. Girls just wanna have fun, but they'd also like a coherent night at the movies."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2014
      },
      "score": 42,
      "summary": "Practically every gag in this movie, and there are scores of them, is milked dry. When the gags aren’t very good to begin to with, this is a prescription for disaster."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2014
      },
      "score": 42,
      "summary": "Somewhere around the 60-minute mark, director Nick Cassavetes — whose career makes one wish that John Cassavetes had been a better father — pushes the movie into Tyler Perry territory, with the final third playing as a tone-deaf mixture of wish fulfillment, punishment, and bawdy innuendo."
    },
    {
      "critic": "James Mottram",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2014
      },
      "score": 40,
      "summary": "A few lowbrow laughs… but far too many one-note characters, performances, and plot points to make them worth showing up for."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2014
      },
      "score": 40,
      "summary": "And yet, all three women are less watchable and amusing that Nicki Minaj as Carly’s legal assistant Lydia."
    },
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 40,
      "summary": "Nick Cassavetes (John Q, The Notebook) has never delivered a picture that entirely knows what its tone is, and a manic uncertainty duly sucks the fun away."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 40,
      "summary": "The Other Woman doesn't give these actresses much to do except look ridiculous, if not sneaky and conniving."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 40,
      "summary": "Slyness, slapstick and sex can often be mixed to amusing effect whatever the specifics — the original \"Hangover,\" for example, did a credible job of it — but The Other Woman is ultimately undone by its indecision."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2014
      },
      "score": 40,
      "summary": "A female solidarity adultery comedy that's three parts embarrassing farce to one part genuinely comic discharge."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 38,
      "summary": "The Other Woman ignores dozens of potentially edgy possibilities to tell the most banal story imaginable - and to do it badly."
    },
    {
      "critic": "Jordan Osterer",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2014
      },
      "score": 38,
      "summary": "The film is clearly wary of either being too saccharine or taking itself--or the notion of compulsive infidelity--too seriously, though its schadenfreude is unwavering."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 37,
      "summary": "Although The Other Woman nibbles around the edges of revealing truths about relationships, it leaves most of that potential behind, instead pursuing easy, exhausted cliches about zip-less marriages, upper class suburban drudgery, cynical careerism and dumb-but-sweet blondes."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2014
      },
      "score": 33,
      "summary": "This thing swings from broad gross-out comedy to something that seems to be struggling to be a reflection of real life, and it never establishes a baseline reality. It is a strange misfire that is only saved from being a complete disaster by the efforts of the film's two leads."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 30,
      "summary": "The bigness of Mann’s performance can’t help but set the film’s tone, which goes manic and high-strung to the point of hysteria before settling down and becoming really stupid and gross."
    },
    {
      "critic": "Stephen Whitty",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2014
      },
      "score": 25,
      "summary": "The only thing missing from this steaming casserole, in fact, is the one crucial ingredient: A sense of humor."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 25,
      "summary": "It’s only mid-April, but I’m making an early reservation for The Other Woman to appear on my list of the 10 Worst Films of 2014."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 25,
      "summary": "One of those loud, cringe-y female-empowerment comedies that feels like it was made by people who hate women."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2014
      },
      "score": 25,
      "summary": "Playing like a script that’s been moldering since Diane Keaton turned it down in 1983, The Other Woman is a weak adultery rom-com in which the most authentic performance comes from a non-housebroken Great Dane."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 20,
      "summary": "This female revenge comedy is so dumb, lazy, clumsily assembled and unoriginal, it could crush any actor forced to execute its leaden slapstick gags and mouth its crude, humorless dialogue."
    },
    {
      "critic": "Henry Barnes",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 20,
      "summary": "The Other Woman scrawls out a dumb dumb-feminist message with a big, fat marker pen."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 20,
      "summary": "So instead of the rom-com, we now have the “non-com.” The cardboard characters and predictable rhythms remain. But this time, we get all the comic cliches with none of the romance."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "If you were waiting for a chance to laugh your heart out, all you need to do is buy a ticket to watch \"The Other Woman\". The director of \"The Notebook\" brings his charm to the romantic comedy film, written by Melissa Stack, who makes her debut in the cinematic world and comes up with great dialogues, funny jokes and some fair ideas about modern day dating policies.",
      "total_reactions": 2,
      "user": "Kostyantyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "I extremely loved this movie. I just saw it probably the 5th time right now. The acting is very well done, cool song choice, sights are beautiful and there are moments you will find quite deep, specially one that comes towards the end of the movie. It shows the importance of friends. Despite they should despise each other, they are working as one to take their cheater down, that is quite something. I love Cameron Diaz so much! She acts so naturally, unlike Minaj who despite having such a short role, overdid everything ( I know she aint no actress, doe). You will really like this movie. Of course there are haters for everything but personally, I really recommend you see it.",
      "total_reactions": 2,
      "user": "danthornthwaite"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "The Other Woman is hands down the best \"female style\" comedy I've ever seen. Cameron Diaz is essentially the lead character in the film but Leslie Mann carries the film from a humor standpoint. Her nonsensical style is a delight and never gets boring or aggravating. Diaz's character has the bulk of the depth and she delivers as needed while Kate Upton provides the stereotypical ditzy blonde with big boobs but does so while maintaining a sort of sweet and innocently stupid charisma. Honestly, my only real negatives with the film were the decision to cast Nicki Minaj as a sort of comedic relief character and the underutilization of Upton's character. Minaj annoys you every brief moment she's on screen and Upton often times feels out of place; almost as if she was thrown on screen simply as eye candy, even though the film's target audience is women. Nonetheless, this is a surprisingly great movie that most women (and I think plenty of men) will enjoy.",
      "total_reactions": 1,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "This movie is an offbeat comedy that really hits it mark about infidelity. In the movie director Nick Cassavetes in his sly way loosely portrays Willard \"Mitty Romney\" as the character of Mark King. Mark Played by Nikolaj Coster-Waldau bares a striking resemblance to Mitt and epitomizes the real life Mitt so much sans the cheating. Mark is an arrogant self centered Venture Capitalist who feels entitled and has little regard for others. And the best part is that at the end of the movie Mark gets his comeuppances and even gets punched out by Don Johnson. Sound familiar Mitt? Remember when your son Tagg said he would have liked to punch out President Obama.",
      "total_reactions": 1,
      "user": "dodgie11"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "Everyone stop hating on Nicki Minaj! She's amazing and she did a awesome job with the role of Lydia here. (And yes, I'm a megafan of nicki, a barb/ken) The movie was very funny and had the audience rolling. Great flick for girlfriends to take their boyfriends to, now if only I had a girlfriend. Lol.",
      "total_reactions": 3,
      "user": "iloveFFC"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2014
      },
      "score": 6,
      "text": "The Other Woman is desperately being funny. However, it is a more of disappointing movie than a successful one, comedy wise. It features a talented cast, Cameron Diaz and Leslie Mann and new faces such as Kate Upton and Nikki Minaj. Also, if the movie is not entirely funny it had some giggles here and there, it is entertaining and fun to watch but it doesn't enlighten women as strong and determined but strongly in need of men. The Other Woman isn't fully recommended and it is more of a waste to pay full price on it in theaters, but to get through time it might please you.",
      "total_reactions": 3,
      "user": "MovieReviews"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2014
      },
      "score": 0,
      "text": "Imagine if the gender roles were reversed. This movie would cause an uproar. Not to mention the movie is cliche, completely done before and overall just boring.",
      "total_reactions": 10,
      "user": "Azzazz"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "Great, fun film (even if the plot has been done different ways numerous times already). Surprisingly Nicki Minaj's small role as Diaz's assistant is a scene stealer. I wish that she had played a bigger role.",
      "total_reactions": 6,
      "user": "kanefoley"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "I have been dying to watch this movie ever since I heard about them filming it a year before it was even released. I mean Cameron Diaz, Leslie Mann, Kate Upton, and Nicki Minaj c'mon now. After I've actually seen the movie I wasn't as thrilled as I wanted to be but the movie was most definitely not a bad movie. There were certain moments that were just plain awkward and weird. But I was overall completely satisfied with the hilarious ending. The movie was good but it could've been better",
      "total_reactions": 4,
      "user": "WendyJay"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "As much as the movie has been down before, there is a difference. The actors are devoted. The movie feels like a complete fantasy. The outfits, the houses, the restaurants, the vacation spots are hugely expensive and fun to look at.",
      "total_reactions": 2,
      "user": "Trev29"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2014
      },
      "score": 1,
      "text": "Sure, you'll have a giggle or two, but The Other Woman is a ridiculous movie that could have been good if it weren't for the bland story and laughably bad twists. The original Midler, Hawn and Keaton acting bunch has been replaced with Diaz, Upton, and Mann. The Other Woman is a bad movie, sure there are laughs here and there but the whole movie is slow, rubbish and filled with bad PG-13 humor. Don't watch this one in theatres.",
      "total_reactions": 2,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2014
      },
      "score": 5,
      "text": "The movie has heart, but it lacks great writing, solid directing, and an editor.  Had it been 20 minutes shorter, the chemistry between Mann & Diaz would have shone much brighter.  Upton almost has more lines in the trailer than she has in the entire film, but that's cool.",
      "total_reactions": 5,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2014
      },
      "score": 2,
      "text": "Bette Midler, Goldie Hawn and Dianne Keaton in “The First Wife’s Club” and Jane Fonda, Lilly Tomlin and Dolly Parton in “9 To 5” all did it better and with less vulgarities.",
      "total_reactions": 5,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2014
      },
      "score": 8,
      "text": "Was this the best movie in the world? No. Did I really enjoy it? Yes.  My sisters wanted to see this movie and I had doubts about going because I had read the critic reviews.  Went because I wanted to spend time with my with them and I was prepared for the worst, and was surprised at how funny it was.   I really thought it was the perfect movie for a Sunday afternoon.",
      "total_reactions": 5,
      "user": "Mary805"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2014
      },
      "score": 4,
      "text": "Cameron Diaz (doing her usual shtick) discovers that her lover (handsome Nikolaj Coster Waldau from \"Game of Thrones\") actually has a wife (Leslie Mann manically trying to be kooky). The 2 women team up with his new GF (Kate Upton, obviously cast for her boobs) to plot revenge. This is a promising concept, but the script is too talky and almost completely void of funny lines. To make matters worse, the comic situations and physical gags land with a thud. Nicki Minaj's supporting role provides the few laughs. The only positive thing to say about this film is that there is plenty of energy.",
      "total_reactions": 6,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "Loved the movie. It's really hilarious as me and my girlfriend laugh most of the time. There's no dull moment and the actors really did a good job. We fell inlove with Kate Upton too. A feel good movie.",
      "total_reactions": 6,
      "user": "niknokseyer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "I went to watch this with my girlfriend. We were not expecting much but it turned out to be a good laugh.",
      "total_reactions": 3,
      "user": "CBZ"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2014
      },
      "score": 5,
      "text": "Low brow cinema at its most commercial. This does benefit from a good performance from Cameron Diaz and a fair quota of funny moments. It is also unbearably crass at times and Leslie Mann's subtle as a sledge hammer turn as the cheated upon wife doesn't help matters. She is so over the top, and her character's actions so unbelievable that the tone of the film become unbalanced as a result. Kate Upton also contributes nothing.Well, almost nothing!. In fact Diaz quite correctly alludes to Upton's character as being a bit of a vacuous air head.",
      "total_reactions": 3,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 5,
      "text": "I am not happy with this movie... I feel like time wasting.... It was too boring and will not satisfy the viewers expectations.",
      "total_reactions": 3,
      "user": "helpmovingtocal"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "The Movie is a fun time, waste of time, if you can relate to what i just said. Watch it! If not i would honestly give the cinema version a miss. Some on the scenes where straight out pointless and whilst some other parts just felt like they added popular songs to pointless parts of the movie to make out you were having a fun time and honestly it was a fun time, full of lots of laughs. Leslie Mann completely stole the show! i mean her performance was untouchable! All in all if you're girlfriend wants you to go watch this, you will survive.",
      "total_reactions": 4,
      "user": "busbfran"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2015
      },
      "score": 3,
      "text": "The story of a wife and mistress getting revenge on a cheating husband is full of possibilities which are unfortunately squandered here. Diaz hasn't been good in anything for ages, so its down to Leslie Mann to cary the film which she attempts valiantly. The first 30 minutes are quite promising, but it all goes downhill in a predictable manner quite quickly",
      "total_reactions": 1,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2014
      },
      "score": 5,
      "text": "A lot of moments were cringe-worthy. Stale cliches throughout make the few funny moments not worth much. The casting had huge names in it, and I was wrong to expect more from it. The movie tries its best to be a feel-good romantic comedy where the good guys win and the bad guy sees his rightful demise to a smattering of applause. Of course, they all lived happily ever after. Unpolished, slapstick and bodily functions make it too mature for younger audiences, yet too stupid for adults. If you are looking for something to sit down to without a whole lot of thinking, give this a shot. Otherwise, this is not worth your time.",
      "total_reactions": 1,
      "user": "dprkforum"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2014
      },
      "score": 4,
      "text": "I'm not afraid to admit the fun I had with these ladies. Even still, a typical romantic-ish-comedy. Oh, but, Kate Upton should never act again. That's one thing I know for sure.",
      "total_reactions": 1,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2014
      },
      "score": 2,
      "text": "Another obnoxious, dumb and ridiculous female garbage film. Not funny, not interesting, and uses every cliché in the book and top it off with one of the most irritating characters I've seen in awhile, Leslie Mann. The Other Women desperately tries to be funny, but fails miserably.",
      "total_reactions": 2,
      "user": "csw12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2014
      },
      "score": 2,
      "text": "This movie is awful not funny trash.  Cameron Diaz is the best thing about this train wreck.  These women do some of the dumbest things.  Just go re-watch Bridesmaids.  D-",
      "total_reactions": 2,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2014
      },
      "score": 3,
      "text": "There was big comedy potential here. However some of the comedy moments are overplayed and delivered poorly at times in the form of Leslie Mann. We do still find ourselves laughing occasionally just not as often as we should have. The story is hopeless and the characters are eclipsed by cast. The Other Woman isn't enjoyable and is a comedy that is fixed too much upon emotions to really hold the attention of the audience who expected an experience rich with laughter, not swimming with emotion.",
      "total_reactions": 1,
      "user": "callumjsouth"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 4,
      "text": "So basically this movie is just another John Tucker Must Die and if anyone remembers that horrible movie you already know what happens in this movie and so you should just stay away from it and save yourself the money and time. The only likable thing about this movie is the cast even though i will say i have never really been a fan of leslie Mann she has always seemed annoying to me. Nick Cassavetes has done quite a few chick flicks with The Notebook, My Sister's Keeper, Unhook the Stars those are at least watchable but not this crap. The movie would be tolerable at least if it was funny but its not i laughed a max of 3 times seriously.",
      "total_reactions": 3,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2014
      },
      "score": 6,
      "text": "A fun comedy but it suffers from an in cohesive and a very convenient story-line. But with good chemistry and a great leading man The Other Woman just gets a fresh score of 65100 for me!",
      "total_reactions": 2,
      "user": "MJKPSTAN"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2014
      },
      "score": 1,
      "text": "Worst 2014 movie full of male hatred, male abuse, plot holes and stereotypes. Despite a great cast full of talented actors, this movie isn't even funny.",
      "total_reactions": 2,
      "user": "Fabioke"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "text": "The Other Woman is bad movie there are so many clichés is made very poorly . I do not recommend anyone to see this movie.Leslie Mann seems to do the best.",
      "total_reactions": 3,
      "user": "appo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2014
      },
      "score": 2,
      "text": "Unfortunately, this is a pathetic excuse for an \"original comedy\". There are very few jokes. Relying on a well known cast to hold it up (the overly praised Cameron Diaz, the decently funny Leslie Mann, the gorgeous Kate Upton, popular singer/rapper Nicki Minaj, and GOT star Nikolaj Waldau), \"The Other Woman\" has about 10-15 minutes of halfway interesting content. The story takes TOO LONG to kick off and the revenge aspect of the show (while being \"funny\") gets lost in the shuffle.",
      "total_reactions": 1,
      "user": "cdsmusicchart"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2014
      },
      "score": 1,
      "text": "Truly poor script with hardly any laughs.....More sad than anything and empty. The only thing visually interesting is seeing that Cameron Diaz's body is genetically superior to that of a 21 year old...... No reason that the mistress would even care and you do not sense a connection with any of the characters. Leslie Mann seems to do the best......",
      "total_reactions": 2,
      "user": "nordicblonde"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2014
      },
      "score": 1,
      "text": "I thought Anchor Man Two was bad, but The Other Woman has it beat!  There was no plot and we kept waiting for something to happen- nothing did.  I really can't believe that anyone thought this movie was at all entertaining!",
      "total_reactions": 2,
      "user": "Fpgunther"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2014
      },
      "score": 1,
      "text": "A doomed premise from the beginning. All the characters don't feel the need to shut up and corner the man about all his wrong doings and get him the serious psychiatric help the man needs. Also, all the characters are unlikable. Nicki Minaj has some genuinely good moments, but she is not given the screen time the film actually needs to garner some laughs. Cameron Diaz deserves better than this. Leslie Mann deserves a Razzie after this horrible performance. Such a shame that it isn't even a disappointment. I give this film 10% of a good movie.",
      "total_reactions": 2,
      "user": "GriffMelies"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2014
      },
      "score": 3,
      "text": "Slight plot made even slighter by slight acting. Thin screeches and jokes that wear thin, don't make for fat comedy.  Timing so far out needs an alarm clock to wake the audience up.",
      "total_reactions": 1,
      "user": "Finnola"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2014
      },
      "score": 1,
      "text": "The Other Woman starts as an intelligent revenge comedy with a talented cast and great concept yet fails to deliver anything worth remembering. To be quite frank the story is atrocious. The concept shows promise and initially the film delivers that but it seems as if the writer ran out of ideas after the hour mark and felt the need to have a two hour film. The quality of the jokes dropped severely with the story becoming an incoherent mess in order to arrive at the very forced climax.",
      "total_reactions": 1,
      "user": "TheFilmFanatic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "\"The Other Woman\" 10 Scale Rating: 3.5 (Bad) ...",
      "total_reactions": 1,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2015
      },
      "score": 2,
      "text": "I think the creators of this film just wanted to show off the expensive beach house locations they paid for. Unfunny, sexist waste of Leslie Mann's talent. I think this is the only time i have been on the side of the cheater - he was the only character who wasn't an insufferable idiot. The best part of this movie is seeing Jaime Lannister walking into a glass door.",
      "total_reactions": 0,
      "user": "Bunny"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2015
      },
      "score": 3,
      "text": "Oof, this film was a mission. Not only was Leslie Mann's acting probably some of the worst I've ever seen, I couldn't believe that three terrible women could be so gullible as to fall for an even worse man. I have to say I'd rather watch Bride Wars than this clunker.",
      "total_reactions": 0,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "the film The Other Woman is basically insulting woman but it's a charmer; cameron diaz plays  a successful lawyer and loves her boyfriend Nick. Then she goes to his house as a  plummer pretending to fix his bathroom, then she finds out Nick has a wife  which played by Leslie Mann then they be friends and then another mistress an turns out it's a dumb blond who is kate upton! then the revenge gets started. This movie is laughable ( but sometimes gets lost with it's comedy) and why is the director of 'My Sister's Keeper\" directing the parody of how woman get cheated on? but this movie is funny the cast is good i love this movie it's romantic/sweet. Grade C",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "Just signed up to review this movie how terrible it was. Boring and not funny at all. The people who leave high reviews must be paid by movie producers spammers. This movie should be considered drama and not comedy.",
      "total_reactions": 0,
      "user": "x1lol1x"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "For the life of me I cannot figure out why this movie got such a low rating???  I rate and watch a lot of movies here and on other sites, and yes this isn't going to be a critically acclaimed movie or win any Oscars, but for all out insane fun and literally rolling on the floor laughing, this movie gets a 10!!!  If you were a fan of Wedding Crashers, love Jim Carrey stupid type of humor, or just enjoy crazy stupid funny one liners, then run to the nearest DVD rental and get this one, because you are going to bust a gut.  They must have had a ton of fun making this one, because I sure had a ton of fun watching it.  I found the humor similar to \"The Wedding Crashers\", and probably retread on some other plots from other famous movies, but it still felt like it had a fresh approach.  Loved it and going to tell all my friends about it, it is definitely a keeper for me, and one that I will put ll out of my collection again and again when I need some cheering up or need a good laugh.  You do the same if you haven't seen it save it for a day your down and need to smile or laugh.  Again I loved it and very well done Cameron, Leslie, and Kate wtg girls-thanks.",
      "total_reactions": 0,
      "user": "horizonbts"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "This a great feel good movie. It improves with every viewing. Addresses issues close to us all in an uplifting and positive way. Very positive for females and confronting for men while still being humorous and lighthearted. A landmark movie that is somewhat realistic and will stand the test of time. Excellent and entertaining cinema.",
      "total_reactions": 0,
      "user": "loulou22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2015
      },
      "score": 4,
      "text": "The Other Woman is a bad movie staring Cameroon Diaz for who 2014 was probably the worst year of her career ever staring in many terrible movies and remakes.The acting here it's just terrible in every prospect.The story is weak and the movie is actually not giving justice to woman which some just happen to think in fact it's making them look weak and very much needed for man.It keeps on showing it over and over that woman are worthless without the help of men.",
      "total_reactions": 0,
      "user": "GentM2015"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2015
      },
      "score": 3,
      "text": "unfunnny trash a comedies main goal is to make you laugh but this movie just has stupid gags that were old 20 years ago!!!!! do not see this movie!!!!!!!!!!!!!!",
      "total_reactions": 0,
      "user": "TheDude-"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "It's lightweight, formulaic fun that would normally hover in the 6 out of 10 range, but Mann's antics push it into 7 territory.",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ]
}