{
  "mc_avg_user_score": 6.2,
  "mc_metascore": 23,
  "mc_mixed_rating_frequency": 4,
  "mc_movie_name": "The Outsider",
  "mc_negative_rating_frequency": 0,
  "mc_positive_rating_frequency": 1,
  "mc_pro_critic_reviews": [
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2014
      },
      "score": 38,
      "summary": "The cheesy techno-thriller The Outsider is a blaring B-movie that doesn’t have much going for it, but it does have an engaging action hero in its leading man, a snarling Cockney badass named Craig Fairbrass."
    },
    {
      "critic": "Gabe Toro",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2014
      },
      "score": 33,
      "summary": "The film’s dismal action staging and over-complex story can’t seem to overcome Mr. Fairbrass’s lo-fi presence."
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2014
      },
      "score": 30,
      "summary": "Fairbrass proves a hulking wannabe ass-kicker without much distinctive charisma, and his leaden performance is matched by sleepy, one-note supporting turns by the slumming-it Patric and Caan."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2014
      },
      "score": 30,
      "summary": "It’s especially sad to see such notable actors as Caan and Patric reduced to appearing in this sort of bottom of the barrel, direct-to-video fare."
    },
    {
      "critic": "Nicolas Rapold",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2014
      },
      "score": 30,
      "summary": "After a somewhat tense opening chase involving a lot of girders, much of the film is rather shakily assembled."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2014
      },
      "score": 30,
      "summary": "Fairbrass has a certain rugged sincerity and appealing sense of barely coiled rage, but it's mostly wasted in a screenplay (by director Brian A. Miller) of gaping plot holes, wan excitement and dumb action cliches."
    },
    {
      "critic": "Chris Klimek",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2014
      },
      "score": 30,
      "summary": "Baseline competence elevates The Outsider, just barely, into the realm of perfect forgetability."
    },
    {
      "critic": "David Hiltbrand",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2014
      },
      "score": 25,
      "summary": "When the big caper finally arrives, you will neither grasp nor care about what's going on."
    },
    {
      "critic": "Christy Lemire",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2014
      },
      "score": 25,
      "summary": "The Outsider is a subpar version of \"The Limey\" starring a subpar version of Terence Stamp."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2014
      },
      "score": 25,
      "summary": "Lamely directed by Brian A. Miller, who co-wrote it with Mr. Fairbrass, this is the kind of curiosity that used to fill the bottom half of a double feature in the day when we still had drive-ins. The real outsider is the movie itself."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2014
      },
      "score": 20,
      "summary": "Painfully dull thriller."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2014
      },
      "score": 4,
      "text": "Well, it happened with Craig Ferguson, so why not this Craig too? It's not impossible for British actors and/or comedians of seemingly arguable levels of talent to make it inexplicably big across the pond. Just ask Russell Brand.",
      "total_reactions": 1,
      "user": "choc_raisins"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "Some Writer/Directors prefer to use the same actors in their films. You can't blame them for wanting to work with people they're comfortable with, but not many Writer/Directors, remake the exact same movie with a slightly different twist. Brian A. Miller came out of relative obscurity to produce the hit action thriller, The Prince, starring Bruce Willis. Less than a year later, he followed it up with The Outsider, which is basically the exact same film! The Prince featured a former mafia turncoat, going to the city he once owned, in order to find his missing daughter. The Outsider features a former member of British Special Ops, coming to America, to find his missing daughter. Both films have similar endings, mafia bosses that are played by legendary action stars, and oddly enough, both films have a cameo by 50 cent. These two films are literally so similar to one another, that aside from the British accent, and Jason Patric in the role of the cop, nothing has really changed. As a fan of action film, I realize there aren't many different directions these films can go in, but to release what amounts to the exact same film, a year later, with several of the same actors, is just bizarre. The Outsider wasn't a bad film, and I did enjoy Craig Fairbrass, he was a beast, who I was previously unfamilar with, but aside from that, this is the exact same story as seen in The Prince. Wheather you chose to sit through this one or that one, really depends on who you like better, James Caan or Bruce Willis.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "I liked it. It was fun watch, nothing overly special. Good story about a father trying to find his daughter who got involved in some crime scheme. Has decent amount of action. Acting was ok.",
      "total_reactions": 0,
      "user": "Tessara_Vejgan"
    }
  ]
}