{
  "mc_avg_user_score": 5.4,
  "mc_metascore": 43,
  "mc_mixed_rating_frequency": 61,
  "mc_movie_name": "The Wolfman",
  "mc_negative_rating_frequency": 37,
  "mc_positive_rating_frequency": 56,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "\"The Wolfman\" is a great movie with a dark atmosphere spreading across the screen. It's almost a nostalgic movie with superb cinematography. At least I enjoyed it.",
      "total_reactions": 2,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "Upon his return to his father's estate a few years after his mother's death, Lawrence Talbot discovers that his brother's body has been found. Then, he learns that a wolf has killed him and searches for it. One night, the wolf attacks him and bites him, which gives him a curse to transform into a wolf man every full moon and goes on a killing rampage. A young woman and a Scotland Yard inspector must find a way to get get rid of the curse once and for all.",
      "total_reactions": 1,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "I found mostly all the Universal Studios monsters pretty damn ridiculous. Although there are considered classics I never really found them interesting to watch. When I heard they were making a remake of it I was actually kind of excited. There are not really a lot of good werewolf movies out there. In my opinion the best one is An American Werewolf in London. I was very sadly disappointed.  I'm really negative towards remakes I rarely agree with them. I say leave the original alone. My ideal of remakes is that there is not really an artistic tone with them. You'll only remake it for money, just trying to milk the cow. When you are filming a remake you need to understand the things that made the original so good. Then you build your film using the foundation that the original used. Now the foundation of the original Wolf Man movies was the fact that Lon Chaney Jr. use just makeup to scare people now that's freaking feat considering the movie was made in 1941 that's some talent. With some simple makeup he was able to scare a lot of moviegoers. I think that's what the problem is in The Wolf Man of this year.  The film begins with Lawrence Talbot (Benicio Del Torro) a stage actor who gets the news that his brother was killed by a wild animal. He decides to go to help his brother's wife Gwen (Emily Blunt) and his father Sir Talbot (Anthony Hopkins) who is a very strange man and always carries a gun. We learn that Talbot has a dark past with his mother who is dead, that torments him and resents his father. One day trying to investigate what happen at gypsies camp the wild animal attacks and bites Talbot and I'm pretty sure you get the rest of what's going to happen. The movie has a very strong plot and the movie is very well acted. I do want to mention Hugo Weaving who plays a Scotland Yard inspector trying to figure out what's going on with the murders. He does a very good job as well.  The set direction is amazing, the locations are awesome and the cinematography is very good we feel the dread in every corner. The problem with The Wolf Man is the werewolf itself. While the CGI is great it's very excessive and we feel a how you call it a very computer taste in your mouth. The movie feels lifeless and there are so many better horror movies out there with better looking and realistic special effects. If they really want to give homage to the original they should have toned the CGI. As well as the pace is very bad it was really boring and the script lacked scares and actual suspense.  There goes another remake down the drain.",
      "total_reactions": 3,
      "user": "thelordoffilm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2010
      },
      "score": 2,
      "text": "Yikes.  The Wolfman fails in almost every respect, unless you consider being unintentionally hilarious a positive trait.  First off, it's not scary.  Sure, I jumped a couple of times, but I don't consider movies that rely on quiet/loud noise dynamics and things jumping out of the darkness to be truly scary, just annoying.  Second, the story is muddled and doesn't seem to be able to make up its mind on whether it wants to stay true to the original story or do something different.  Third, the special effects are horrendous for a movie that supposedly cost around $150 million to make.  Fourth, and perhaps worst of all, the acting is, across the board, disappointing.  Anthony Hopkins looks like he's waiting for his paycheck to clear, Benicio Del Toro appears to be reading off of cue cards, and although Hugo Weaving appears to be trying, he just not able to overcome a tiresome script.  With the acting credentials of the cast and a blockbuster-sized budget, The Wolfman should have been better than your average horror movie.  Instead, it manages to wallow in the same territory that most dime-a-dozen horror movies occupy, just with a little bit shinier production.",
      "total_reactions": 1,
      "user": "walrusgod"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 1,
      "text": "Avoid this movie. The droll acting by the majority of the cast lets down a decent performance by Hopkins. The story was predictable, the action scenes were few and far between and not memorable in the slightest. For a 90 minute movie, it seemed to drag on for much longer.",
      "total_reactions": 1,
      "user": "Warren"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2010
      },
      "score": 1,
      "text": "BORING BORING BORING BORING BORING BORING. I turned it off after an hour. it lacked the wolfman action I was hoping for. Benicio Del Toro looked like he was exhausted all the time. There was a few action sequences and they sucked as well, and that's saying something.",
      "total_reactions": 1,
      "user": "MetalMan95"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2010
      },
      "score": 3,
      "text": "This movie fell flat.  With all the talent on display I was soerly disppointed.  The story was poor.  It felt very gimmicky though the acting had its moments of quality.  I doubt Del Toro and Sir Hopkins will be putting this on the mantlepiece.  Its main value may be to fill your time at 2am on a Friday in late October but not much beyond that.",
      "total_reactions": 3,
      "user": "IznatiCritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2011
      },
      "score": 0,
      "text": "I fell asleep five times during the first 30 minutes, then woke up when the werewolf attacked, dozed off after that, and turned the entire thing off when the werewolf ended up in a lunatic asylum (!). What an odd twist. The biggest problem with this movie is that the main character is not the least bit likeable. Hence noone cares what happens to him. There are also serious plot holes - like, why would his own father let him murder 6 or 8 people before turning him in ? Doesn't make sense.",
      "total_reactions": 3,
      "user": "Nazgulero"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2010
      },
      "score": 5,
      "text": "I haven't personally seen the original, but I was only slightly impressed by what I saw. The movie was slow, but this doesn't mean it was flat out boring. The lighting adds effect, but the director depends too much on the lighting to enhance the action. Might I remind you that this was rated R for violence and gore, in which that was fair. In addition to unecessary lighting, all the actors gave a great performance, but everything else was blan. From what was going to happen next, to a dissapointing blan ending, the movie needed another look at before being released. If only one aspect of this film was better, you would most likely see a \"GO\" above this review. Go see it, but don't expect an audience to applaud at the end.",
      "total_reactions": 1,
      "user": "Film_Fanatic_15"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 3,
      "text": "This movie is somewhat of a turd.   I liked it ok, but it was full of unnecessary gratuitous violence.  Some of us don't need that to enjoy a movie, and this movie would've been fine without it.  It did have beautiful set-pieces and was full of good effects, but it was a little dry.",
      "total_reactions": 1,
      "user": "TaoZenGuy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "Joe Johnston's \"The Wolfman\"  is a film I had been dying to see when I first heard news about it back in the middle of 2009  although there was not much information I had high hopes for this film. After the new year rolled around  I was informed that \"The Wolfman\" would be releasing theatrically on Valentine's day weekend(Who's bright idea was that?) and I also heard that Joe Johnston(director of Jurassic Park III, Rocketeer and October Sky). Would be directing the film naturally Johnston does not have a solid reputation for making high-class filmâ",
      "total_reactions": 0,
      "user": "Lopez17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2011
      },
      "score": 7,
      "text": "I am much more of a fan of vampire movies and based on that I decided to get this movie. The setting and make up and costumes were amazing. The story was not able to hold my attention and became lagging but near the end the minor action made up for the flaw. It wasn't anything too special but it gets a thumbs up for not being a cheesy monster movie.",
      "total_reactions": 0,
      "user": "kingshahid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "Flawed, but very entertaining horror movie (Never saw the original by the way). I thought the Oscar this movie won for Best Makeup was well deserved.",
      "total_reactions": 0,
      "user": "gm101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "When i first saw this movie i felt asleep. This movie was so boring the first time i saw it. The second tome i actually got into the movie and finish it. The story could have been better but still a good movie. This is a good horror movie. even though its not really scary it still scare you on some scene. Alot of gore in this movie.",
      "total_reactions": 0,
      "user": "iamtrent424"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2010
      },
      "score": 6,
      "text": "When i saw this in theaters i though the real things they had going for it was the quick sound bursts that most scary movies have. But when i saw it at home i was rather unimpressed. This movie almost was meant for theaters because of the surround sound effect but unless you have it at home its worthless. The storyline and the acting was okay but the overall wasn't that great. The graphics were good and the cinematography wasn't to bad either.",
      "total_reactions": 0,
      "user": "Ruler101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "It is about time to bring werewolf back to the screen. With nowadays technologies, THE WOLFMAN is a good vessel to explore how far special effects and make-ups would go. The movie itself already appropriately taken care by former special effects expert, Joe Johnston. Johnston involved on three early STAR WARS trilogy as Special Effect Art Director. His box office movies as a Director are JUMANJI (1995) and JURASSIC PARK III (2001). The movie starred by Benicio Del Toro, Anthony Hopkins, Emily Blunt, and Hugo Weaving. Although Del Toro acted well in thiz flick, I personally think it is very lamentable to use Del Toro on such a movie. Del Toro as we knew was a discreet Actor in serious drama. What are we really waiting on thiz movie is the transformation scene, when Del Toro becomes a werewolf. Rick Baker make-up already supports well. The plots were on customary level. The twist ending did not too surprising. Maybe we could blame Johnston a little bit, bcoz he has not been a good drama Director. If we see thoroughly there are a lot of nuances are similar to Tim Burton SLEEPY HOLLOW (1999). Despite of SLEEPY HOLLOW was happened to be more attractive in some ways. The werewolf had been a great horror icon since Michael Jackson THRILLER video, So It is definitely the time for another moon to rise, to wake up that howling again.",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "THE WOLFMAN is a good remake with good acting and great effects. But there could have been more stuff happening in the movie and it was a bit slow in some parts as well.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2012
      },
      "score": 5,
      "text": "A pretty haunting film but also very boring lots of the time. The script seem rushed and seem to miss making a scene a lot more scary then it could have been.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "Wasn't sure how I felt about the movie in the beginning but it was greatly spooky and wonderful. The art direction was fantastic. Never enjoy these type of movies but this is quite the exception.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 2,
      "text": "Genuinely extremely bored throughout this film, at one point I thought of walking out but, being me, I stayed as I had spent the remainder of my weekend's money on this film. Towards the end, the film picked up and was actually fine but the beginning and middle was too slow and tedious. I actually appreciated this film from an artist's standpoint. The camera-work was really rather good and the visual effects were up to par as well. All in all, I didn't expect a masterpiece and behold, the film was definitely not one.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "A very mediocre attempt to remake a classic.  Benicio Del Toro and Anthony Hopkins are both solid, but the script is sub par and the effects could have been better.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2014
      },
      "score": 9,
      "text": "I must say I really enjoyed this movie. Although, it's a typical gothic movie so for someone not very into or interested in the gothic subculture it's probably not the best movie to watch. It has the typical gothic elements. For someone being very interested in the gothic subculture, this movie was brilliant. I loved it.",
      "total_reactions": 0,
      "user": "SeijiGaming"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "Actually i liked the film, it was a nice try, bringing the dark side of the werewolf's to the screen, and finally nobody compares it with twilight...thank god!",
      "total_reactions": 0,
      "user": "Sandra007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2015
      },
      "score": 5,
      "text": "Another pointless movie about the wolf man.Benicio Del Toro's acting performance and Emily Blunt's one were probably the only interesting thing about this pretty boring movie.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "I just watched this movie again after several years and still loved it! The acting is rich from an outstanding cast. It is always a privilege to see Anthony Hopkins in anything but especially in this movie. I thought the story did very well in keeping with the original. Also a treat was the cameo by Max Von Sydow.",
      "total_reactions": 0,
      "user": "GoinBananaz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2016
      },
      "score": 10,
      "text": "everyone hate this movie i say **** this movie have been a box office's flop okey i get it, you know what alot of movie dont make billion of dollars at box office and they still masterpiece,this movie for me Deserve a 10 at 10 his director know his **** and have certainly been a huge fan of 40's 70's monsters movie,i dont make a review right i'm just someone who want to express himself, this movie's great the actors are perfect in their respective role,i'm sure this movie is in the heart of alot of peoples, i really loved that movie and recommand it to everyone who looking for a good evening.",
      "total_reactions": 0,
      "user": "Kalele005"
    }
  ]
}