{
  "mc_avg_user_score": 6.2,
  "mc_metascore": 60,
  "mc_mixed_rating_frequency": 14,
  "mc_movie_name": "They Came Together",
  "mc_negative_rating_frequency": 8,
  "mc_positive_rating_frequency": 23,
  "mc_pro_critic_reviews": [
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2014
      },
      "score": 90,
      "summary": "They Came Together is one joke repeated until you're broken down by the giggles. It shouldn't work as well as it does, and wouldn't if it weren't perfectly cast with America's Comedy Sweethearts."
    },
    {
      "critic": "James Rocchi",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2014
      },
      "score": 83,
      "summary": "It knows how to mock cliché big things, like jokes about set-dressing and music video montages; it’s also wise about small matters, right down to the font and the framing device."
    },
    {
      "critic": null,
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2014
      },
      "score": 80,
      "summary": "They Came Together is a very fast, often very funny riff on a very tired Hollywood formula."
    },
    {
      "critic": "Stephan Lee",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2014
      },
      "score": 75,
      "summary": "Most of the jokes land bluntly – ”This is a cliché!” – but tight pacing and a killer cast, which also includes Ed Helms and Christopher Meloni, make up for the inconsistent gags."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2014
      },
      "score": 75,
      "summary": "Thanks to a smart screenplay, direction that perfectly captures the tone of modern rom-coms and two of the most engaging comedic leads working in movies and TV today, “They Came Together” is more entertaining and (in its own insane way) more endearing than two-thirds of the legitimate romantic comedies I’ve seen over the last two decades."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2014
      },
      "score": 75,
      "summary": "The film's most engaging character is not actually human: It's Manhattan, of course, a point made repeatedly over that protracted dinner by the voluble lovebirds."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2014
      },
      "score": 75,
      "summary": "Occasionally very funny, and moderately funny the rest of the time. In mathematical terms that adds up to pretty funny or \"funny enough.\""
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2014
      },
      "score": 75,
      "summary": "Seeing clichés mimicked this skillfully is plenty hilarious."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2014
      },
      "score": 75,
      "summary": "There are probably funnier satires out there, but They Came Together is laser accurate in the way it skewers its targets."
    },
    {
      "critic": "Jesse Cataldo",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2014
      },
      "score": 75,
      "summary": "What results is chaotic but ultimately focused, bound by an intense devotion to disassembling genre and narrative standards."
    },
    {
      "critic": "Robert Cameron Fowler",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2014
      },
      "score": 75,
      "summary": "In terms of its pure laughter quotient, They Came Together constantly delivers."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2014
      },
      "score": 70,
      "summary": "Taking pretty much every rom-com trope and distilling it into highly concentrated ridiculousness, Wain’s film is both a takedown and a tribute: As with his summer-camp-movie spoof \"Wet Hot American Summer,\" you walk away with a renewed love for the genre."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2014
      },
      "score": 70,
      "summary": "A lively comic jamboree that’s sometimes smarter than it is funny and hits about as often as it misses, but is, on balance, a good deal of fun."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2014
      },
      "score": 63,
      "summary": "Larky, witty and sometimes even wise, this spoof on every rom-com ever made is less a fully realized film than an extended skit, a series of set pieces that poke gentle and sometimes transgressively crude fun at the tropes of girl-meets-boy that have enchanted and addled audiences for generations."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2014
      },
      "score": 63,
      "summary": "Poehler and Rudd riff and banter like old marrieds, and make even the\r\ncheesiest lines funny, make even the cliched dating montages set to syrupy pop\r\nmusic feel — if not fresh and new — at least funny enough to mock."
    },
    {
      "critic": "David Hughes",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 60,
      "summary": "Reinforcing the very rom-com tropes it's sending up, this is a little too postmodern for its own good. Happily, Poehler and Rudd are as irresistible as ever."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2014
      },
      "score": 60,
      "summary": "This rough-edged parody feels both distinctive and handmade, and for those reasons alone it’s a hard movie to hate, even when it temporarily loses its comic footing. Anyway, as romantic comedies down the ages have taught us, hatred is just a latent form of love."
    },
    {
      "critic": "Genevieve Koski",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2014
      },
      "score": 60,
      "summary": "There are a lot of laughs in They Came Together, but few curveballs. The biggest surprise is that the film feels so safe."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2014
      },
      "score": 60,
      "summary": "Here, though, everyone involved seems above the rom-com conventions they’re satirizing, so anxious to get to each punch line that they let the connective tissue languish. You howl often but quickly forget why."
    },
    {
      "critic": "Courtney Shea",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2014
      },
      "score": 50,
      "summary": "Poehler’s Parks and Rec co-star Adam Scott is there, playing a sound engineer and so is John Stamos from \"Full House,\" because, you know, that’s funny. Until it’s tiresome."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2014
      },
      "score": 50,
      "summary": "Mr. Wain, who made a delightful comedy with “Role Models” and a cult favorite with “Wet Hot American Summer,” has opted to deliver a series of hit-and-miss sketch-comedy bits rather than a fully realized movie that might have gutted contemporary rom-com clichés rather than just weakly aping them."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2014
      },
      "score": 50,
      "summary": "A feature-length lampoon needs more than rubbery performances, so-so silliness and the constant thrum of meta humor to make it a consistently amusing variation on a theme."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2014
      },
      "score": 50,
      "summary": "So why isn’t They Came Together more uniformly hilarious? Perhaps it’s that elusive problem of trying to explain why a thing is funny in the first place: Spelling it out deflates the joke."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2014
      },
      "score": 50,
      "summary": "A great many of these individual scenes are funny... But the film fails to do what those rare, immortal rom-coms get right: take all its individually pleasing ingredients and make a satisfying movie out of them."
    },
    {
      "critic": "Christy Lemire",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2014
      },
      "score": 38,
      "summary": "Means to make fun of romantic comedies the way \"Airplane!\" goofed on disaster movies and the \"Naked Gun\" films spoofed detective flicks. The result is actually more in line with Gus Van Sant’s ambitious but ill-advised shot-for-shot remake of \"Psycho.\""
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2014
      },
      "score": 20,
      "summary": "The characters, the situations, and the story are whatever they need to be in the moment to launch whatever joke the movie feels like telling at that moment. This is Wain and Showalter working in “Wet Hot American Summer” spoof mode, and if you're a fan of that movie, you may well like this one as well."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2014
      },
      "score": 0,
      "summary": "A ponderous spoof of movie rom-coms that plummets stupidity to a new low even by Hollywood standards."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2014
      },
      "score": 6,
      "text": "Such a bizarre movie, I'm really not sure how to rate it.  Before watching this movie, you absolutely need to know that this is a parody of romantic comedies.  If you're expecting a standard romantic comedy, you're going to be really confused.  The movie extremely outwardly and blatantly makes fun of itself throughout.  It's very bizarre, but if you know what to expect, it is very funny.  I laughed out loud many times...and also yelled things like \"what the hell?!?\" at the TV several times because weird things kept happening that wouldn't in real life with real people.  Characters break the fourth wall making it hard to believe that the characters are real people, so empathy is difficult, so this movie is mainly just for the laughs.  It has a fantastic cast with more familiar faces than I could name.  Throughout the whole thing, I kept thinking \"This really reminds me a lot of Wet Hot American Summer.\" Afterwards, I looked it up, and yep, I was right, same writer and director....partially the same cast (with lots of other people we all know from assorted sitcoms showing up.)  So, if you're a fan of Wet Hot American Summer, like quirky comedies, and like to laugh at the conventions of typical romantic comedies, then the movie is worth watching.",
      "total_reactions": 1,
      "user": "kristen58"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2015
      },
      "score": 3,
      "text": "Alright, I'll commend the start and, even, the premise. The film reaches a point of pure blatancy that proves to be neither humorous, entertaining or anything else. Before you know it, things will become even more bizarre (and I don't mean that in a good way).",
      "total_reactions": 1,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2014
      },
      "score": 2,
      "text": "This movie sucks on a level I never thought was possible. I could go on about the paper thin characters, the phoned in acting, and the terrible presentation but at the end of the day that’s not the key thing to talk about when reviewing a comedy. This movie was not funny. 99% of the humor in this film failed it was ever a joke that feel flat or was just plain stupid and none of it was memorable. For as dumb as something like Movie 43 was at least some of the **** in that movie was memorable and I still remember it. At least it made me laugh. This movie is trying to be a parody of cheesy romance movies but while it is overly cheesy none of it leads to great comedy or satire of the genre and the cheesiness hurts the movie more than it helps it resulting in a movie that is even worse than the films it is trying to satirize. But the biggest sin this movie has made is its lack of lasting appeal. This movie is bland and forgettable with nothing memorable about it. For all the bad movies (specifically comedies like Movie 43) I’ve seen some of them were memorable and even if its for the wrong reasons I still remember them and their **** This movie on the other hand has none of that. I saw it once, I’ll never see it again, come tomorrow I won’t remember it and come a week and I’ll forget about it. And if there’s one thing you don’t want people to do is forget about your movie. I’m not going to recommend this film to anybody. I mean I’m not into romantic comedies but this isn’t me hating on a genre I don’t like this is me hating on a bad movie. So do yourself a favor and don’t waste your time with this movie. This is a bad movie that deserves to be ignored and forgotten.",
      "total_reactions": 2,
      "user": "Jacob"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "Fans of: Anchorman, Naked Gun, Dumb and Dumber, Mystery Team, Billy",
      "total_reactions": 1,
      "user": "Duke_Challenger"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2014
      },
      "score": 0,
      "text": "Really bad; and we pretty much like everything to some degree. Toilet humor; literally. Adolescents may be slightly amused. Comedy has reached an all-time low.",
      "total_reactions": 1,
      "user": "AcademicCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2014
      },
      "score": 2,
      "text": "I went into this movie not realizing it was a satire rom com. I love the old leslie nielson movies but just couldn't get into this movie.  Great cast from a lot of shows I really like but this was rough to watch.  For me it was like a bad SNL skit made into a feature length film.   barley made it through 10 min skipped a scene to see if the movie got better  but its the same stuff throughout.  Possibly the worst movie ive seen.",
      "total_reactions": 1,
      "user": "westang"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2014
      },
      "score": 2,
      "text": "The two leads are very likeable.  Having said that this is a bizarre bland ridiculous comedy which is a total rip off of the very old Meg Ryan comedy YOU GOT MAIL.  The trailer is the whole movie.  Everything else is just filler.  Just a few mild chuckles nothing more.  Very disappointing.",
      "total_reactions": 0,
      "user": "fantasy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "Calling all Wet Hot American Summer fans! Complete with Christopher Meloni's strangeness. Unexpected jokes abound, an off-beat comedy perfection. Great stuff here. If you don't get it, you're not ready for it.",
      "total_reactions": 0,
      "user": "Scraper"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2014
      },
      "score": 0,
      "text": "Wow!!! How do I reclaim the 20 minutes of my life in just threw away??",
      "total_reactions": 0,
      "user": "Thewho63"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "A spotty spoof comedy that hits just enough for a mild recommendation.  I'm not a big fan of this genre, but with great leads and a script that at least makes you laugh at times this one is passable.  B-",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2015
      },
      "score": 5,
      "text": "While I love Amy Poeher and Paul Rudd, this movie was spotty at best. It has just enough comedy to make it watchable and while Poeher and Rudd by themselves make it funny, overall it was a bizzare spoof of romantic comedies.",
      "total_reactions": 0,
      "user": "bfoore90"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "If \"disaster movie\" meets  romantic cliche'd parody movie we got ourselves  'They came together' a idiotic parody that makes the Wayans' brothers look smart, but the chemistry between Rudd and Poehler is so funny   and clever also  a dolt film . Director David Wain's script is funny and a little tiresome, but the chemistry between the leads is a droll. Grade A-",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "If you're sick of how the Scary Movie trend ended up ruining parody films forever and wished for a throwback to the days of Airplane, then this is the movie for you - rather than just throwing out endless pop culture references like the ____ Movie parodies do, this has a focus on one (You've Got Mail) while paying attention to genre as a whole as well.  And like Airplane it's not afraid to throw out other bizarre non-sequiturs jokes as well. Just when you think it's settled down, it throws another punch out of the blue.  This movie deserves to be a cult classic, but I wish it was better received so other movies would learn from it... instead we'll no doubt end up with another ______ Movie in the next six months instead.",
      "total_reactions": 0,
      "user": "mossfoot"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "They Came Together is a delightfully smart romantic comedy filled with absurdity and incredibly dry humour. The story is unsure whether it is a parody or pastiche film, and at some times it is a bit messy. Just remember that this film is meant to be a parody of films like You've Got Mail, nothing more. The supporting cast is not used to their potential, particularly Bill Hader and Ellie Kemper, but the chemistry of Paul Rudd and Amy Poelher bring this cliched film literally to higher levels of entertainment. Definitely a very intelligent and enjoyable comedy.",
      "total_reactions": 0,
      "user": "TheFilmFanatic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2016
      },
      "score": 4,
      "text": "It was just like every lazy romantic comedy with supported acting of Amy Poehler. Beginning with a simple meet together along with a break up, leading to a happy and ridiculous ending. The things that tried to make it different simply did not.",
      "total_reactions": 0,
      "user": "michaelinperson"
    }
  ]
}