{
  "mc_avg_user_score": 6.0,
  "mc_metascore": 51,
  "mc_mixed_rating_frequency": 10,
  "mc_movie_name": "Think Like a Man",
  "mc_negative_rating_frequency": 13,
  "mc_positive_rating_frequency": 33,
  "mc_pro_critic_reviews": [
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "Think Like a Man is rowdy and funny and showcases an immensely likable ensemble cast it uses to delineate its war between the sexes."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "Romantic charm and racy humor in a neatly arranged package anyone can appreciate."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "Though it is funny - at times, laugh-out-loud funny - this comedy is by and for adults."
    },
    {
      "critic": "Kevin C. Johnson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "Despite the crass book promotion, the overlong film is harmless romantic fun that's well played."
    },
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "Story and collaborators succeed in making a courtship comedy that will entertain women and amuse men."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "It's all about making everybody happy. If that's not grounds for a good relationship, then I don't know what is."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "Think Like a Man is what it is. But its hangout factor is considerable, because the actors' charms are considerable."
    },
    {
      "critic": "Todd Gilchrist",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "A winning cast and solid writing from screenwriters Keith Merryman and David A. Newman (Friends With Benefits) should appeal to men and women alike."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2012
      },
      "score": 67,
      "summary": "Think Like a Man is so busy tracking courtship as if it were a science project that the bite-size love stories lack spontaneity."
    },
    {
      "critic": "Bob Mondello",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 65,
      "summary": "The director doesn't require - and doesn't really get - distinctive acting from his cast, but every once in a while, the company manages to wink broadly at the film's genre."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 63,
      "summary": "An all-star revue of some of the most physically stunning actors working in Hollywood, Think Like a Man is a pleasure if only on a purely sensory level."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 63,
      "summary": "Even though Think Like a Man espouses something akin to the philosophy in Beyoncé's Single Ladies(Put a Ring on It), it makes manipulation more fun than it ought to be."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 63,
      "summary": "It's not much of a part for Henson. None of these characters makes real-world sense. They're walking chapter outlines."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "It also helps that they've got actresses like Gabrielle Union and Taraji P. Henson doing the heavy lifting of trying to show real emotion while still keeping things light and on the comedy track."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "If you can look past the annoying quirks, you'll probably have a good time. As Steve says, sometimes, it pays to compromise."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "There's nothing profound going on here; the truisms don't blossom into life-enriching truths. It's more like the person you meet at a bar who, on second glance, is surprisingly attractive. Call Think Like a Man a perfectly satisfactory one-night stand at the movies."
    },
    {
      "critic": "Jenna Scherer",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "Surprisingly entertaining, thanks to the cast's collective chemistry and the film's balance of appealing elements for both sides of the gender divide."
    },
    {
      "critic": "Michael Rechtshaffen",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "As executed by an appealing ensemble of smooth operators, this adaptation often hits its amusing marks, but with a weighty running time of two hours, it often feels more like a lecture than an intended romp."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "The relationship advice is all fairly boilerplate, much like the film itself, but these actors have made this a bankable romcom."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "If anything, Think Like a Man, the awkward but intermittently amusing black-centric ensemble film built out of comedian Steve Harvey's self-help bestseller \"Act Like a Lady, Think Like a Man\" deserves a gold star for its generous portrayals of Caucasians."
    },
    {
      "critic": "Rachel Saltz",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "Occasionally funny, though its dirty riffs - most provided by Kevin Hart as the Happily Divorced Guy - are as formulaic as its earnest parts."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "The result is a tiresome exercise that circles at great length through various prefabricated stories defined by the advice each couple needs (or doesn't need)."
    },
    {
      "critic": "Glenn Heath Jr.",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "Unfortunately, like so many women have prophesized regarding the weaker gender's lack of commitment, there's just not enough follow through."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2012
      },
      "score": 40,
      "summary": "It's not only shameless, it detracts from what this movie could have been, and still is when the self-promoting Harvey shuts up."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2012
      },
      "score": 40,
      "summary": "It recycles the same tired battle-of-the-sexes premise employed by every third romantic comedy that gets made."
    },
    {
      "critic": "Melissa Anderson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2012
      },
      "score": 40,
      "summary": "Enduring a day-long session of couples' therapy is more fun (and flies by faster) than this film."
    },
    {
      "critic": "Brian Lowry",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2012
      },
      "score": 40,
      "summary": "While the result deserves some credit for finding a creative way to bring the book to life, the overlapping storylines simply aren't compelling enough, despite the best efforts of a game and attractive cast."
    },
    {
      "critic": "Farran Smith Nehme",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2012
      },
      "score": 25,
      "summary": "Shove people into categories, then into a film like Think Like a Man, and it's a recipe for tedium."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2012
      },
      "score": 25,
      "summary": "An insanely overlong infomercial for the book."
    },
    {
      "critic": "Drew Hunt",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2012
      },
      "score": 20,
      "summary": "Screenwriters Keith Merryman and David A. Newman interweave four asinine, underdeveloped plot lines, and Tim Story's prosaic direction reduces their script to a shambolic nightmare."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "This movie is great. Very funny, great acting, wonderful storyline and entertaining. I think its a must see no matter if you are in a relationship or not. I would pay to see it again. I really enjoyed Michael Ealy's character...honest, positive, funny and great message on following your dream and starting your own business.",
      "total_reactions": 6,
      "user": "HappyoneV"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "Angels: This is a funny movie. It is more comedy than romcom. Sure, it is about relationships, and it has a happy ending - so to that extent it is romcom.  But unlike most romcoms it is funny. This is 'horrible bosses' funny.  It is also gratifying to see some talented actors get exposure.  Michael Ealy is a very versatile actor, and has the ability to make you believe that he is not acting, that this is real life.  And of course, there is the beautiful and talented Gabrielle Union. If our society, including our movie industry wasn't so 'segregated' Gabrielle would be a household name. And finally there is perhaps the most stunning actress in Hollywood: yes that is right: Megan Good! Never heard of Megan? Then go see this movie. If your socks are not wet from drool, then you either have no socks, or no pulse.  I only give this movie a 9 because some of the relationship resolutions were a little contrived. Still, a fun movie experience with lots of laughs and eye candy. My honey said it was a 2hr commercial for Steve Harvey's book...my honey is so droll. (Anyway she enjoyed it as much as me.)",
      "total_reactions": 4,
      "user": "sesostris"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "This movie was exactly what a movie should be entertaining and funny. The cast was very well put together showing great chemistry and awareness. There were no dull moments from the beginning to end the did a great job framing the book to the screen. This is  a movie that in my view is worthy of seeing more than one. The cast was diversely rounded and common which in my view can allow anybody to see this and enjoy it.",
      "total_reactions": 4,
      "user": "williams28k"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2012
      },
      "score": 4,
      "text": "\"Think Like a Man\" plays like a big screen version of Seinfeld.  However, the dialog lacks the wit and biting sarcasm of the iconic 90's sitcom.  There's little going on cinematically, as it's firmly rooted in TV sitcom production style.  The film is based on Steve Harvey's non-fiction book, but doesn't dramatize it well.  The film  lacks economy of characters, having unnecessary, anonymous, redundant characters with nothing to do.  Like so many self-help books, \"Think Like a Man\" offers superficial insights of no real help, glossing over its ideas rather than exploring them.  The movie is shameless in plugging the book the film is based on, as the characters chant, \"Steve Harvey says..\" when Steve Harvey doesn't have anything meaningful to say about love and relationships--and neither does this movie.  Full review on my blog.",
      "total_reactions": 2,
      "user": "DanielOnFilm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "Adapted from Steve Harvey",
      "total_reactions": 2,
      "user": "TheDRauch"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2012
      },
      "score": 5,
      "text": "When you watch the trailer it seems very funny, but when the movie starts it is actually very boring. The movie seems like it goes on and on forever, rather than it being like 100 minutes. It just drags on forever. If they had added the funny guy \" the one telling the story\" the movie would of been a HIT! That's my opinion. The biggest thing was that it dragged on FOREVER and that it was not funny..",
      "total_reactions": 2,
      "user": "April717"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2012
      },
      "score": 4,
      "text": "â",
      "total_reactions": 3,
      "user": "kevinluv"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2012
      },
      "score": 0,
      "text": "Sorry, if Tyler Perry doesn't have anything to do with this is can't not be good. TP is a Hollywood icon and he's making the rules HIS WAY so if you don't like it, then you can just double flip on outta here. Because Hollywood don't tolerate no phonies!",
      "total_reactions": 9,
      "user": "NavyBean"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "This movie was a hit to me. All my friends literally, and I as well love this movie. Im more or a dram-type guy but sometimes I'll watch a real good comedy, and this was one of them. If tickets wernt so expensive I'ld go see it again no doubt! This movie gets stale at times, but it's fresh and thats what I love alot about it. I cant wait to purchase this movie when it comes out! What ever money was spent on filing the money was well spent because they've made a laugh out loud comedy enjoyable for alot of people!",
      "total_reactions": 2,
      "user": "TheateraNerd"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "Is normal that all the years we watch this movies, with a great cast in a simple story, that can be funny, and Think Like a Man is perfect for the example, we have a funny cast, that do a normal performance, any bigger, and do a good job. The story is simple, in some moments is funny, any new. Think Like a Man is to hang. No more.",
      "total_reactions": 2,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "Very entertaining and of course funny.  Became predictable right away and lacked an element of any surprise or twist.  When watching, by a quarter of the way through the movie you'll sit back and just watch because you'll feel like you've seen it before.  It's almost like a remake of Deliver Us from Eva.",
      "total_reactions": 2,
      "user": "Jab6899"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "This by far has to be the best comedy that I have seen in years. Think Like a Man is based on Steve Harvey's #1 New York Times Best Seller Book \"Act Like a Lady, Think Like a Man: What men really think about love relationships, intimacy and commitment.\" There were so many hot black actors/actresses as well as gorgeous clothing, fast cars and funny punch lines. This movie is the entire package and a must see if you are either in or out of any relationship. Read a bit more about this movie at chique-critique.blogspot.com",
      "total_reactions": 2,
      "user": "Chique-Critique"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "I love this movie, it was so retarded that it made me laugh the entire movie. There was a great choice in which actors were casted, and there was a great plot behind this movie.",
      "total_reactions": 1,
      "user": "MissDrae"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "I'm not black, but it seems many in the media give predominately black movies lower reviews than normal. Even classics like \"Coming to America\" are largely left off of greatest comedies of all time lists. It seems if it isn't a slavery movie or some drama to that effect a comedy is underrated.",
      "total_reactions": 0,
      "user": "new290"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2016
      },
      "score": 7,
      "text": "This movie is good better than the sequel.This movie is funny and enjoyable and fun.Yes I know there were some scene that should not be in this movie and Sometimes the acting is bad.So I give Think like a man a 7/10",
      "total_reactions": 0,
      "user": "shadowguy654"
    }
  ]
}