{
  "mc_avg_user_score": 6.4,
  "mc_metascore": 60,
  "mc_mixed_rating_frequency": 169,
  "mc_movie_name": "Tomorrowland",
  "mc_negative_rating_frequency": 47,
  "mc_positive_rating_frequency": 236,
  "mc_pro_critic_reviews": [
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2015
      },
      "score": 90,
      "summary": "Bird layers on plenty of dazzle... But his heart is what keeps the story motoring and the ending is perfectly engineered, including a coda that encourages all of us to try harder."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 90,
      "summary": "All hands on both sides of the camera do outstanding work. Clooney seems to be enjoying himself thoroughly as the old grump whose creative flame hasn’t been entirely extinguished, but it falls more to Robertson to carry the film, which she does with great energy and appeal."
    },
    {
      "critic": "Greg Cwik",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 83,
      "summary": "Bird has crafted a gorgeous world rife with creativity and inventive images. A Spielbergian sense of candid awe and wonder permeates each scene with a nostalgic edge."
    },
    {
      "critic": "Edward Frost",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 80,
      "summary": "An amalgamation of Disney's heritage, current status and future enterprises that starts in the evocatively rendered 1964 World's Fair, Tomorrowland is a refreshing and well-intentioned standalone piece that revels in a creatively manufactured appropriation of the conglomerate's existence."
    },
    {
      "critic": "Paul Bradshaw",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2015
      },
      "score": 80,
      "summary": "If you’re willing to let a few things slide, this is one of the best family blockbusters in years. Clooney and Robertson (literally) soar, the madcap action always feels grounded and Bird’s world is bursting with visual invention."
    },
    {
      "critic": "Olly Richards",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2015
      },
      "score": 80,
      "summary": "Bird and Lindelof have thrown everything they have at this film and, aside from a pause for breath at the end, they’ve made something funny, surprising and packed full of wonder."
    },
    {
      "critic": "Steve Rose",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 80,
      "summary": "Director Brad Bird deserves praise for packing such big ideas into such an accessible, rip-roaring, retro-futurist adventure."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2015
      },
      "score": 75,
      "summary": "The movie leaves a bunch of questions unanswered but rockets ahead in such entertaining style that I scarcely minded."
    },
    {
      "critic": "Brian Truitt",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 75,
      "summary": "A spectacular ride for most of it, and while you're a little let down at the end, you kind of want to jump back on and do it all over again."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 75,
      "summary": "The movie is saying something worth hearing about the place the future holds, the concept and promise of it, in human existence. It’s an attempt to wrest that vision from the narrow fantasies of doom-peddling action filmmakers. That’s an attempt worth making."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 75,
      "summary": "There's a surprising number of salient, even revolutionary notions about human nature and intelligence throughout, none fully explored but enough to make the running time at least 20 minutes too long."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 75,
      "summary": "Tomorrowland is a crazy, disjointed mess. But it’s the good sort of crazy, and it’s the sort of mess you want to lose yourself in."
    },
    {
      "critic": "Christopher Borrelli",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 75,
      "summary": "At times Tomorrowland plays like such a throwback to those sweetly naive, low-rent, live-action Disney matinees of the '60s and '70s, George Clooney is like a Fred MacMurray with gravitas, gruff and grizzle, predictably warming up to a young dreamer (a terrific Britt Robertson) of cheer and vision."
    },
    {
      "critic": "Matt Zoller Seitz",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2015
      },
      "score": 75,
      "summary": "If you treat Tomorrowland mainly as an immense cinematic theme park that unveils a new \"ride\" every few minutes—just as Bird's last feature, \"Mission Impossible: Ghost Protocol\" was mainly a series of action scenes—its weaker aspects won't be deal-breakers."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 70,
      "summary": "It’s so smart, so winsome, so utterly rejuvenating that you’ll have to wait until your eyes have dried and your buzz has worn off before you can begin to argue with it. And you should argue with it — even if you had a blast, as I did, and want to see it again with the kids, as I do — because it’s a major pop-culture statement with all sorts of implications, both vital and nutty."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 70,
      "summary": "Tomorrowland may not fully reach the heights for which it strives, but it has a good time trying."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 70,
      "summary": "The wonder of Tomorrowland – and with all its flaws and its hidebound Disney formula, it really is wonderful – is that Bird’s tale of nostalgia for the lost future manages to recapture some of that original, optimistic meaning without losing sight of the newer and darker one."
    },
    {
      "critic": "Tim Grierson",
      "publication": "Screen International",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 70,
      "summary": "George Clooney and newcomer Britt Robertson are solidly compelling, but Tomorrowland remains only a moderate success, its ingenuity, wit and enormous heart too often at odds with a ho-hum story and tentpole conventionality that the film tries so hard to transcend."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 67,
      "summary": "Tomorrowland is a rather sweet excursion into speculative sci-fi, and, wonder of wonders, it doesn’t even seemed primed for a sequel. But this movie about the thrill of the visionary is, alas, mostly earthbound."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2015
      },
      "score": 67,
      "summary": "There’s much to applaud and much to knock in this Disney action adventure. Tomorrowland breaks the mold and becomes something quite original, while at the same time it ballyhoos its inspirational message to an extent that deadens the narrative."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2015
      },
      "score": 67,
      "summary": "Bird stages the PG mayhem with his usual grasp of dimension and space, his gift for action that’s timed like physical comedy. He keeps the whole thing moving, even when it begins to feel bogged down by preachiness and sci-fi exposition."
    },
    {
      "critic": "Inkoo Kang",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 65,
      "summary": "Tomorrowland is a globe-trotting, time-traveling caper whose giddy visual whimsies and exuberant cartoon violence are undermined by a coy mystery that stretches as long as the line for “Space Mountain” on a hot summer day."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 63,
      "summary": "Unlikely to be remembered in decades to come - or even in months to come, once the next teenage dystopian fantasy inserts itself into movie houses."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 63,
      "summary": "Brad Bird's Tomorrowland, a noble failure about trying to succeed, is written and directed with such open-hearted optimism that you cheer it on even as it stumbles."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 63,
      "summary": "The thing barely makes a lick of sense. Rapturous on a scene-by-scene basis and nearly incoherent when taken as a whole, the movie is idealistic and deranged, inspirational and very, very conflicted."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 63,
      "summary": "Tomorrowland is an interesting collage of moments and ideas in search of a strong narrative and a coherent ending."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2015
      },
      "score": 63,
      "summary": "Bird cooks up lots of eye candy, but the dazzle wears off, and nobody really connects emotionally."
    },
    {
      "critic": "Christopher Gray",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2015
      },
      "score": 63,
      "summary": "In Brad Bird's film, the way forward is backward, on a path that stumbles into misplaced nostalgia and dicey humanism."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 60,
      "summary": "Tentpoles are rarely guilty of overreaching, but Tomorrowland has a tendency to feel out of control, a film that is finally more ambitious than accomplished."
    },
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 60,
      "summary": "Tomorrowland is half a day having all the fun of the fair, and half a day paying for it back in the classroom."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2015
      },
      "score": 60,
      "summary": "This fantasy adventure lacks focus when it should be laser-sharp, and stumbles when it could soar."
    },
    {
      "critic": null,
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2015
      },
      "score": 60,
      "summary": "When it puts down its copy of ‘Political Philosophy for Dummies’ and focuses on character and action, Tomorrowland is a blast."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 58,
      "summary": "Tomorrowland may be well-made, but whether you're talking about it thematically or dramatically, this is a profoundly mixed bag."
    },
    {
      "critic": "Anthony Lane",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2015
      },
      "score": 50,
      "summary": "Tomorrowland is a bright and pliable sci-fi thriller that stiffens into a sermon. Can’t it just be fun?"
    },
    {
      "critic": "Bob Mondello",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 50,
      "summary": "Tomorrowland is designed, just like its theme park namesake, to celebrate optimism."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 50,
      "summary": "Tomorrowland is a highly original, occasionally even visionary piece of sci-fi filmmaking, but that doesn't necessarily make it a good movie."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 50,
      "summary": "The whole film is an argument about nothing less than the future — can we fix our troubled world or not? But for all of its vaulting ambition, its sumptuous eye-feasts and its leapings back and forth in space and time, Tomorrowland never comes together as coherent drama in the here and now."
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 50,
      "summary": "Maybe the ultimate goal of Tomorrowland remains obscure because once you know where the story is headed, you realize it’s a familiar tale. The movie can conjure up futuristic images, but the story is nothing we haven’t seen before."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2015
      },
      "score": 50,
      "summary": "The film never adds up to the sum of its parts, effectively a two-hour trailer for a movie I’d still be interested in seeing."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2015
      },
      "score": 50,
      "summary": "Tomorrowland comes across as a grinning rictus of a movie, a desperate door-to-door evangelist trying to force its foot into the door and push its salvation by any means possible."
    },
    {
      "critic": "Rodrigo Perez",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2015
      },
      "score": 50,
      "summary": "Steeped in a nostalgia that often feels borrowed and canned—the space-age era impulses of progress and possibility from the 1950s and ‘60s—Tomorrowland asks that you never give up or lose hope, literally and figuratively, over and over again, to the point that the movie has little else to say."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2015
      },
      "score": 50,
      "summary": "Brad Bird’s Tomorrowland is a great-looking, old-fashioned, at times soaring adventure ultimately brought down by a needlessly convoluted plot, some surprisingly casual violence and heavy-handed lectures about how we’re our own worst enemy and we’re going to destroy the planet if we don’t get it together."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 50,
      "summary": "The glaring failure of Tomorrowland is that its central premise — children are the future — is almost completely negated by the preachiness of the execution and the clumsiness of the storytelling."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 42,
      "summary": "Multiplex audiences can choose over the next few weeks between two starkly different views of the future. The remnants of humanity struggle for survival in the brutal world of \"Mad Max: Fury Road,\" while Tomorrowland offers an optimistic retro-future paradise full of jetpacks and robots. Me, I'll take post-apocalyptic desert wasteland over soulless corporate utopia any day of the week."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 40,
      "summary": "Its idea of the future is abstract, theoretical and empty, and it can only fill in the blank space with exhortations to believe and to hope. But belief without content, without a critical picture of the world as it is, is really just propaganda. Tomorrowland, searching for incitements to dream, finds slogans and mistakes them for poetry."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2015
      },
      "score": 40,
      "summary": "The problem is, the closer our heroes come to their goal, the weaker the story becomes. What we're left with is a film that gets off to a ripping good start, but which -- given how little time is actually spent in the fanciful world after which the whose shebang is named -- ends up feeling like a cinematic bait-and-switch."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 38,
      "summary": "Disney’s gimmick of naming movies for its theme-park attractions crashes and burns in Tomorrowland, a here-and-now caper that will confuse children, bore adults and offend anyone who’s ever taken a science class."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2015
      },
      "score": 10,
      "text": "You know... I went in anticipating just to see how bad this movie was and why it under performed so much.",
      "total_reactions": 5,
      "user": "skykappah"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "Tomorrowland is a seriously underrated film. It's got great characters, especially Athena, the robot child. People who call this preachy are just lazy. It's a great film, and one of Disney's best.",
      "total_reactions": 4,
      "user": "YellowKirby"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "A 60 metascore? It should be an 80. This is another Brad Bird gem, with a good message. Unfortunately, Global Warming deniers seem to think it's \"preachy\".  Don't listen to them. The actress who played Athena was very good, probably better than even George Clooney!  A fantastic film, Walt Disney would have loved this.",
      "total_reactions": 4,
      "user": "DanBurrito"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "Brad Bird should be applauded for coming up with a big budget summer blockbuster that is an original idea and not a sequel, prequel or comic book movie, and if he doesn't quite pull it off its not for the want of trying. Clooney is in fine form as the reluctant hero here, even if a lot of his job is exposition that slows the film down, and the production design is stunning, add to that a couple of outstanding action sequences and you should have a hit, but Tomorrowland comes across as a well meaning vegetarian meal when what you really want is a nice juicy hamburger. Its very well meaning, and really wants to educate, it just needed to be that little bit more fun.",
      "total_reactions": 3,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2015
      },
      "score": 10,
      "text": "i really really really love this movie. i like the funny scene that casey get hit the wall and she didn't notice the staircase because of the pin hahaha.. i really really love this movie its a 100% for family.. hope this movie will win a award because i know they deserve it ... :) :). and I can't figure out what the critics (who gave this negative reviews) are thinking!",
      "total_reactions": 3,
      "user": "Shadow_131989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "This film has struck up memories, and rekindled the imagination and hope of what I thought would be the not so  distant future. Through the eyes of an idealistic boy, we could see what we all hoped for, an idealistic, and healthy future for ourselves, and everyone. A girl, that is tech savvy and not wearing god awful pink, that is the strong character, that rebels against what she believes is wrong, and doesn't have a preoccupation with her parents. Without spoiling the storyline includes a jetpack...in the sixties, I couldn't wait till the seventies when I could jetpack to school....",
      "total_reactions": 2,
      "user": "MetacriticAce"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "This movie was absolutely INCREDIBLE. I had seen Britt Robertson in her starring role on The Secret Circle but this movie made me appreciate her even more. The movie teaches people that you can do anything if you put your mind to it and to help out people in the world. George Clooney is a human rights activist and I think he made that pretty clear in this movie. The scenery in this movie is INCREDIBLE. I HIGHLY recommend it!",
      "total_reactions": 1,
      "user": "iholland95"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "This is Pretty good entertainment... and that is what I go to the movies for.... Story line good, special effects good, acting good, I do not think this is an Oscar worthy movie but most certainly worth seeing.",
      "total_reactions": 1,
      "user": "ricksroses"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "It was really disappointing to see a movie with so much anticipation split people in half. While I'm not going on record saying that this was flat amazing, I will say it was honestly (in my opinion) that \"Tomorrowland\" was  still really fun and inventive. First off, it's visually stunning. Brad Bird has a very creative look and the concept was interesting for literally the first two acts. I'll get to that later. The characters I found to be quite interesting. George Clooney is great as a gruff older man. Britt Robertson is also equally great as the female lead. But it's Raffey Cassidy as the little girl that steals the movie. Not only was she so unexpected, but she was a straight up bad-ass and served purposefully well in this movie. The big problem with \"Tomorrowland\" is the last act. The message presented something that I first bought into at first, but it kept beating you over the head. And the big climax was a big let down. And the ending doesn't leave you inspired because of its forced message. Other than that, I think the movie is quite a bit of fun with awesome action/visual sequences and great characters. If you didn't like it the first time, I want to recommend those to at least give it another try. I give this a B!",
      "total_reactions": 1,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "Surprisingly good. I didn't expect much from the director of \"The Incredibles\". While the idea - travels to the future is not new, its realization impresses. I liked all major characters, especially cyborg girl and House.MD as main villain :)",
      "total_reactions": 1,
      "user": "Violett"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Tomorrowland has amazing visuals, ambitious ideas, and marvelous acting, with a good, fun sci-fi plot, sure the villian is really underdeveloped and the movie loses focus, despite that Tomorrowland is fun sci-fi adventure for the whole family",
      "total_reactions": 1,
      "user": "MrEpic012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "Think of it more like a poem or an essay.  It's adequate but not remarkable three act structure is most thrown away in favor of many, many wonderful moments, perfectly captured by a masterful director on a labor of love.",
      "total_reactions": 1,
      "user": "HealingToolbox1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "I saw this movie without good expectations and I have found a really nice film, original and fresh.",
      "total_reactions": 1,
      "user": "rrafemi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Brad Bird manages to once more create a wholly original film that not only is entertaining but ambitious as hell. Tomorrowland doesn't deliver what the trailers promised us, but it' fun, smart and filled with excellent action set pieces. Though it does begin to fall apart toward the third act with an overbearing message and a poor villain, it would be one of the better movies I've seen from 2015.",
      "total_reactions": 1,
      "user": "Movi3R3vi3wer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "I'm not going to deny that I loved this movie. First of all, the most obvious, it was absolutely beautiful in every way. The special effects were completely perfect and I was just astonished by watching the land called Tomorrowland in the movie. Besides that, the story was very original and interesting. It's nice to watch a different movie once in a while. And there was a pretty good acting.",
      "total_reactions": 1,
      "user": "Dokalu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "I would agree with the current User Score  .....  a few of the negative reviews are too harsh.  The movie is fantasy not a plot driven story. Thus it coming from Disney Studios. Another words it is what it is ... no sense in bashing it for lack of continuity or substance. The actors do a credible job and the cinematography was well done.  So if you are a dreamer & a kid at heart buy a bucket of popcorn and sit back and relax without having to think the movie through",
      "total_reactions": 1,
      "user": "moviecritic68"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "7 is a good score for most films, but this isn't most films. It's a Brad Bird film which means it should have been a 10+. The Michael Jordan of Film Directors, his previous 3 animated films established him in a class above all others.  In Tomorrowland, it seems Mr. Bird and company were having an off game. I had read the negative reviews by critics and then more positive reviews by fellow film goers. With all that in mind I was prepared to be both entertained and disappointed. But then as the film got rolling I was convinced that the negative reviews were all part of some conspiracy to undermine a wonderful film about dreaming boldly and bravely making those dreams come true. However well into the second hour I realized the proverbial hot air balloon of wonder was quickly loosing altitude. The ride was almost over and we hadn't gotten to the promised land of innovation and inspiration.",
      "total_reactions": 1,
      "user": "twall3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "\"Tomorrowland\" was an intriguing concept with stunning visuals but I did feel that the story started to run on fumes near the end. This is a great movie for kids and a great movie for adults looking to find that sense of awe and wonder inside them that they may have forgotten. After a wonderful performance from Charlize Theron in ‘Mad Max: Fury Road’ last week it was great to see two more strong female performances from Britt Robertson and Raffey Cassidy in ‘Tomorrowland’. Sure, Clooney is on the poster and he does a fine job being Clooney, but the most delightful bit for me was the performances of the two young actresses. I recommend ‘Tomorrowland’ for its optimism, its look at what we are capable of, and for its originality as a movie; which is hard to come by these days. That being said if you miss it in the theaters and see it at home in six to nine months that’s ok too.",
      "total_reactions": 1,
      "user": "ValcanKrull"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "Tomorrowland was not our first movie choice because of its reviews.  But when our first choice was sold out, we went to see Tomorrowland and were not disappointed.  It is Interesting and entertaining and is  very different from how it is presented by many of its critics.  Critics and users have found numerous faults to justify their ratings.  I was expecting a Disney commercial, a sermon, a poorly thought out ending, and there to be other problems with the movie.  I didn't experience any of those things.  What I did find was a movie that was inventive, surprising and engaging.  The movie was fresh in its presentation and the actors were well cast and believable.  The message of choosing to feed hope or despair is thought provoking.  The dichotomy of critic and user reviews seems to mirror that message.",
      "total_reactions": 1,
      "user": "vue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "“Tomorrowland”",
      "total_reactions": 1,
      "user": "eric_critic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "This movie has a interesting and ambitious plot.Unfortunately,complicated script from Damon Lindelof and Brad Bird can't be controlled by Bird himself.He (Bird) looks like confuse how to \"execute\" it.He's already do the best that he can do,but the results still not optimal.130 minutes is not enough.With a short running time,this movie feels like unresolved puzzle.Luckily,this movie has a fantastic visual about The Tomorrowland and a great acting from the cast.It's totally saved the movie.The Chemistry between Clooney and Raffey Cassidy is quite good.The scene stealer is Britt Robertson.She is very great.Disney's Tomorrowland is watchable and kinda sweet.",
      "total_reactions": 1,
      "user": "whooosaah"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "great movie it looks amazing the story is amazing. Unlike everyone I thought the last 20 minutes of the film to be really good. I say check it out....",
      "total_reactions": 1,
      "user": "luketeddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2015
      },
      "score": 9,
      "text": "Am I really at the Tomorrowland?? What a great film, I mean! And don't listen please to the critics who criticized this film. Director Brad Bird really did his work well, with the performances of the cast, particularly George Clooney, Britt Robertson, and Raffey Cassidy. And I was hoping for the sequel of this film, because this is very fun to watch with your family and friends!",
      "total_reactions": 1,
      "user": "JuliusMani"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "I want to emphasise on how important message is in the movie. Acting and the visuals are amazing, the plot is awesome, and the message that we should never give up on making this world better is of a critical importance. Awesome movie, anyone who says different should rethink their values in life.",
      "total_reactions": 1,
      "user": "nix1304"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2015
      },
      "score": 10,
      "text": "A FUN, feel good, preachy movie both about a place where the best of mankind are invited to invent ways to better mankind, and the possible end of mankind if humans don't start to be better people. The key to this being an above average movie that is discretely preachy is that is is FUN. Non-stop throughout the movie. It is so fun and entertaining that it often masks its preachy nature of a great deal of the film. The most stand out feature of the film is that an unknown actress, Raffey Cassidy, steals the show. The acting from the entire cast is very good throughout the film however she absolutely steals the show anytime she is on screen. Her skill is a prime example of an actor bringing their A-game when it counts and she does it. Even in scenes when she is with academy award winner George Clooney she is head and shoulders the best on screen.",
      "total_reactions": 1,
      "user": "MrTreize"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "Brad Bird's weakest installment yet. Does that say it's bad? No, not really. I call his best movie to still be \"The Incredibles\" even after reviewing this movie. Take your time to make the sequel, Bird.",
      "total_reactions": 1,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "Disney's theme park attraction is the inspiration for this sci-fi adventure. A teen (Britt Robertson) gains access to a dazzling future world and teams up to save it with an exiled inventor (George Clooney, whose boyhood character looks confusingly like her young brother). The brief visits to this incredible place are full of eye-popping visuals and cool creative concepts, but most of the movie takes place in the present day. When director Brad Bird switches on the action, it's lots of fun (even though there's a surprising body count for Disney). The disjointed plot sometimes loses focus and momentum, especially near the talky end. There's lots here to spark the imagination, but at 130 minutes it's too long to maintain the magic.",
      "total_reactions": 6,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "Okay, so I went to see this movie with a 14 year old son of a friend.  I was charmed by the retro look of the opening scenes at the 1964 World's Fair (I remember that, and it was pretty close to the remembered reality). One of the best things about the movie is the uncanny resemblance between the actor who plays a young Frank Walker and George Clooney, who plays him as an adult.  As sci-fi movies go, this was pretty tame, although there were a few neat special effects (a particular favorite being the multi-level swimming pools).  The premise behind the movie, that we affect the future by our attitude is something worth thinking about, \"Faux\" news aside. Other than a rather gruesome visit to a hobby shop, there isn't much that is scary in the movie, so it would be okay for younger kids (age 7 and up, I'd say). For adults, well, you have to arrest your analytical mind for a bit to just enjoy the movie at face value (not always easy to do, I admit).  But to share it with a younger person, who finds it charming and exciting and rich with possibilities...?  Well, that made the viewing worthwhile. If you don't have a younger friend to bring with you, you might just want to skip this one. But don't forget the message: we all need to work together to ensure the future of the planet!",
      "total_reactions": 6,
      "user": "ManmieJeanne"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "This is our favorite type of movie where it not only entertains me and remains optimistic, it makes us think of ways to make the world better. Also, We enjoyed seeing the young girl Athena beat up male adults, as it was a welcome relief to see her type of \"fighting\" instead of fight after continuous fight enhanced by special effects which seems to be what all the other popular movies are about. But we must not be in the majority or this movie would be making as much money as those blockbusters with excessive fighting and pessimism.",
      "total_reactions": 5,
      "user": "ledaumas"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "Only Brad Bird can think of a movie like \"Tomorrowland.\" It is very imaginative and by all means \"futuristic.\" The script could have gone a little further but the visuals are stunning. The casts are wonderful and have great chemistry. The movie is basically a huge PSA for environmental preservation, human rights and world change. It is dreamers and brilliant minds that are able to change the future, all we need is to believe and never give up!",
      "total_reactions": 5,
      "user": "francisrgo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "well i was like most people very excited to see this movie and for the most part i was not disapointed full of laughs good action pure excitement loved george and the girls together were jhilarious i say see it take the family good fun for all mild swearing problem but other than that fast high flying fun for all tomorow land is the perfect place for everyone to spend the day u will love it",
      "total_reactions": 5,
      "user": "chrismovieguy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "I founded Tomorrowland to be really good. I liked this film from beginning to end. Not brad bird best film but it is still a very good film I say go watch it.",
      "total_reactions": 5,
      "user": "teddyluke"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "Although the movie was a bit too long and was a bit of a disappointment compared to The Incredibles and Ratatouille, the movie was still pretty watchable. I walked in with pretty low expectations but was surprised from the beginning to almost the end. Till that point, the movie was very fun, and mysterious. But the ending or \"Third Act\" was a but of a disappointment and it just ended so quickly in a boring way. Still recommend to watch this movie with your family as it is watchable and entertaining in the beginning.",
      "total_reactions": 5,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "I can't figure out what the critics (who gave this negative reviews) are thinking!  This is every bit the imaginative, epic, entertaining film you could ever hope to see in the theater. My wife and I (in our 40s) along with our two kids (age 9 and 12) all absolutely LOVED this film! For a film to equally excite and entertain all members of the family as this one did is truly something special.",
      "total_reactions": 5,
      "user": "jerbecca"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "You can't make an omelet without breaking some eggs, and though there are a few shells still left in this one, it looks so tasty, that it's difficult to dislike it even if some of the ingredients are on the edge of spoilage. I had no preconception, no anticipation, and frankly hadn't heard about the film until 2 days prior to release, so I came in with a clean slate.",
      "total_reactions": 5,
      "user": "Maccelerate"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "I had decently high expectations for this film. I thought this movie would good fun. It was. I thought it would be well acted. Doubly so. It was far better than I expected.  The two words I think best describing it are optimistic, and engaging. I think that in this day, people don't like optimism so much; they see it as naive. I often see it that way myself. I can be very cynical, and tell myself that is just the way the world is. This movie is very optimistic, but it is not naive. They have an actual, clear point, that I believe is very well made, despite the fact that I can't see the world that way. I think those who say the plot is off, or lacking in substance, simply disagree with the message. One sentence summary of the review: This is an amazing movie, and anyone who has any real interest should definitely see it.",
      "total_reactions": 4,
      "user": "dtl"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "Tomorrowland surprised me. I thought it would be a run-of-the-mill Disney movie, which I was pleased about. First of all, the CGI is amazing. It blends in with the environment seamlessly and is the most impressive aspect of this movie. Another good thing is George Clooney's character, Frank. He's the most likeable character in this movie and is acted very well. But, unfortunately, the plot is extremely jumbled, which cripples Tomorrowland from being a \"great movie.\"",
      "total_reactions": 4,
      "user": "BB_Critic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "A very nice movie,  just a little slow at the beginning, and the very  last 5 minutes , gets a little cheesy, but good overall, music effects, acting and a very good story.",
      "total_reactions": 4,
      "user": "jaimemartin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "While it delivers on the visuals and the performances, it is the story, plot twists, characters , disney friendly cliches and message that lack the power of Mr. Bird's previous films. With that being said,I reccomend this movie if you are a true fan of futuristic scenery, the director or perhaps the actors. But come on , Brad Bird has given us so much, lets do him a favour and simply go watch this film.",
      "total_reactions": 4,
      "user": "MoviereviewerCL"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Brad Bird's Tomorrowland while not the spectacle everyone was hoping for, it was however a fun and exhilarating experience. I honestly didn't know what this movie would be like. I went into this movie not knowing the plot, not watching the trailers, and not reading any reviews. I wanted to go into this movie looking for a great story and likeable characters and that is exactly what I got. One of the first things you will notice with this movie is that the film looks beautiful and the cinematography is great. Geroge Clooney and Britt Robertson work together in a way that is unparreled in most of the big budget films today, but Tomorrwland is held down by uneven pacing. I will admit that the first and last twenty minutes are boring but not enough to make you disinterested. Ultimately, Tomorrowland fulfills what it was set out to do, bring us an enjoyable Sci-Fi flick fun for the whole family",
      "total_reactions": 4,
      "user": "Nstrong"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "Tommorowland. What a beautiful looking film, arresting in every way possible. But, it is all show, and lacks substance. First of all, Tommorowland is cliched to the max, plot twists are predictable, and the story is peppy and bubbly futuristic vibe. George Clooney gives a masterful performance, and Britt Robinson gives a good perfromance too. The worst part of Tommorowland is that it doesnt live up to the hype that it had. Brad Bird instead gave us a beautiful movie, but had no good film underneath that layer. Tommorowland is inspired by Disney's famous theme park, and there is a slight vibe added to it. There is Hugh Laurie as a maniac though. Sadly, it is a let down, but if you admire creativity, give this a watch.",
      "total_reactions": 11,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "A fun, lighthearted yet thoughtful look at the reality we experience, how it arises and who is ultimately responsible. Those who \"get it\" when it comes to the film's message will no doubt enjoy this frothy, fun-filled romp. And those who don't probably can't wait for the end credits to roll (and not necessarily those associated with the movie).",
      "total_reactions": 7,
      "user": "Brent_Marchant"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "Need to offset the 0 ratings, this film has a great message and makes you feel like a kid. Really enjoyed it. Film has a ton of heart and i didnt think the story was difficult to follow at all, some people are extremely jaded and just love to hate on everything.",
      "total_reactions": 6,
      "user": "kiladubz"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "This film struggles to decide whether its a children's film or adult film. Tomorrowland's language is that of an adult, not shying from cursing, yet the story is rather basic and architypal, predictable plot that doesn't tie all loose ends together like the average children's movie where not everything needs to be explained because the kids don't necessarily need explanation. The entire point of the movie isn't even made clear until the last half hour of the movie, with the rising action, climax, and conclusion all occurring in this last segment using reserved for the third act.",
      "total_reactions": 6,
      "user": "OrdinLegends"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "I think this film could have been a lot better that it was.  it’s not a bad film by any means, it just doesn’t really hit the mark for me and I think it will be actually quite forgettable in time.  It has good themes and likeable characters and some fairly decent performances, but I would hardly rush to get this on DVD and more recommend it as a rental.  The plot isn’t quite fleshed out enough despite its 2 hour running time and it really needed a better villain.  Those are the biggest problems I had with the film, other than that it’s actually kind of enjoyable and I suspect it will be a success with schools breaking up for half term and may even warrant a sequel that I wouldn’t object to seeing.  Most of the performances are pretty good though Raffey Cassidy is the only stand out performance and I would say there are worse films coming out in the next few weeks, so you could do a lot worse.  Brad Bird, I really like you, but you have made better films!!",
      "total_reactions": 3,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "LOVED this movie. I am hoping for a sequel. What do you all think? The effects were fantastic. Clooney was amazing. There were even a few jokes in there. Great family film or even a date movie.",
      "total_reactions": 3,
      "user": "tamasaii1972"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "Tomorrow land does not spoil it's plot, It just keeps us wondering about this \"place\" so what is this film about? A former boy  genius named Frank (George Clooney) and an optimistic  talented teen named Casey (Britt Robertson) sets out on a dangerous mission to unearth an enigmatic world located  caught  between time and space. Robertson's heroism and being this character is like able she can act, George  Clooney as a old man is believable and great; Raffey cassidy has the best performance in the film and the best child star who can act. I give it an A for props and Bird's direction, he tackles  other genres and makes it unique and creative but it does not deserve a higher grade. When it comes to animation, director  Brad Bird is an expertise on it, he adds creative imagery and makes a good lucking film. The characters are like able but the final act was okay It could of been well told. Grade B+ (a high one)",
      "total_reactions": 8,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "This movie is not an easy watch...it makes you work for its meaning.  The story line is timely as it is overt.   The world needs dreamers and optimists to survive. It is really an adult  allegory that alludes to the problems of today--war, depleting resources, pestilence and suggests that we humans have a choice.  We can either lament our helplessness to change the future, or exert our responsibility to create a better future.  If you are an optimist you may actually resonate with this message.  If not, it may be a long and bleak afternoon at the movies.",
      "total_reactions": 8,
      "user": "vjjr"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "A film full of fresh ideas and creativity.  Clooney; Laurie and Robertson were played by an incredibly, lovable Raffey Cassidy to the wall. The refreshing dialogues between Clooney and Cassidy makes it to an experience for the whole family. all combined with a litle action and a litle fun.",
      "total_reactions": 18,
      "user": "Wurstwasser"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "I very rarely say this. And I very, very rarely say this about feel-good movies. But don't listen to the critics. \"Tomrorrowland\" is well worth your time. More than the elaborate product placement piece for Disney that some reviewers have made it out to be, \"Tomorrowland\" balances magnificent spectacle and deliberate, thoughtful storytelling to craft and deliver a spellbinding, timely fantasy that kept me more or less in an awe trance throughout. There's so much to love about this film - its extravagant special effects, a wholesome and pervasive childlike sense of wonder, and solid performances by an appealing cast - that any minor quibbles I had with the plot (yes, there are some loose ends - big deal) - make absolutely no impact on my verdict. What a magical movie.",
      "total_reactions": 10,
      "user": "googolendtimes"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "MASTERPIECE. Although it may be way ahead of it's time, Brad Bird's Tomorrowland a masterpiece and a Disney movie that Walt would be proud of, as high caliber family entertainment that is sure to speak to the audience's hearts. When it acomplishes that, a different person comes out of the theater, wondering what can be done to make a better world and a better tomorrow.",
      "total_reactions": 7,
      "user": "VEGAPRIME"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2015
      },
      "score": 0,
      "text": "The problem with Tomorrowland is, it wants you to like it too much. The end of the movie was way too confusing, and this movie is a big disappointment.",
      "total_reactions": 7,
      "user": "TheKavehJ"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2015
      },
      "score": 2,
      "text": "I'm really sorry about \"Tomorrowland\".  I wanted to like this film.  I was ready to like it.  I had been mentally discounting the critical reviews I had seen.  I suspect we all know that the movie is about environmental, ecological, and political instability which seems to be currently ruling the world.  Who can complain -- other than a bunch of Congressmen.  George Clooney is the lovable liberal, wearing his khakis and sweatshirt, who got exiled from Tomorrowland because he wanted to fix things.  Not really a spoiler since it comes up practically in the first minute of the movie.  Hugh Laurie is the crabby conservative dressed in his black, sinister, futuristic looking outfit.  Let it be known I am philosophically on George's side here.",
      "total_reactions": 9,
      "user": "BogKid"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "Meh, I expected so much more from Mr. Bird, who up to now has had a stellar track record. \"Tomorrowland\" is not terrible, just disappointing. The film preaches but never earns its forward-thinking optimism with a weak script, undercooked plot, and let's-make-it-up-as-we-go-along action and technology that fails to establish a believable universe.",
      "total_reactions": 10,
      "user": "samichsupernova"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "At its first glance, the creation of this visual popping utopia community full of futuristic illusions, advanced technology and gadgets might lead audiences to a high expectation that the adventure to explore this brand new world would be extremely exciting. However, it's a huge let down that despite the efforts, creativity and imagination of Brad Bird and his team, it's still hard to understand the reason to focus large portion on the earth rather than in the futuristic world they've crafted. At Disney's level, the idea of the plot is ambitious but sadly it starts to lost its direction at the very beginning and the tone as the story develops seems to be uneven, even the final act of the villain himself is wasted without proper addressing of intention and ended up in a disappointing formulaic way. Performances of Brittany Robertson and Raffey Cassidy are charming and entertaining together with the presence of George Clooney though his appearance seems to be involved in some lame action scenes, the musics from Michael Giacchino are beautiful and full of dreams but all of these are unable to save the flaws of this pointless story telling about the importance of being hopeful, optimistic and inspirational.",
      "total_reactions": 8,
      "user": "michael1208"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "The film is from based of a Disney Theme Park,It could sometimes be great,good or even.The trailer of the film didn't really gave too much about the plot  about the film that many trailers right now are doing spoiling their twist and plot to us(I am talking to you Terminator Genysis).",
      "total_reactions": 8,
      "user": "JohnKristofer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2015
      },
      "score": 5,
      "text": "Full of great ideas and inspiring messages, \"Tomorroland\" suffers from a dull and confusing, narration. In the end, is just another missed oportunity.",
      "total_reactions": 4,
      "user": "Szen"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2015
      },
      "score": 6,
      "text": "It doesn't deserve its abysmal box office result, but Tomorrowland's problem is simply its tone: its too 'kiddy' for adults but too scary for kids.  Brad Bird may be a good director but he is no Steven Spielberg, who can balance action, scary bits and humor equally, and this is the type of film that the Master Director can do so easily in  the past. It's not a bad film, and the crew gave their best effort, but this 'original , franchise type of film' is simply not Disney's main forte. Good thing they now own Marvel and Lucasfilm....problem solved for the future.",
      "total_reactions": 2,
      "user": "dharma"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2015
      },
      "score": 4,
      "text": "While not being creative or original in any way, and picking up clichés as old as the 1950s for what concerns sci-fi (and not being able to convey much emotion through dialogue), Tomorrowland isn't all that bad. In particular, I found it very funny that writers at Disney decided to have a cheeky go at their own employers with all the future gloomy events, like global warming and such, which was an obvious hint at big selfish corporations - of which, people often forget, Disney is a major representative. But like many other Disney films, its fundamental message is a genuinely naive one, and that can be forgiven. Hugh Laurie's clothes and the CGI, however, cannot.",
      "total_reactions": 2,
      "user": "nicholasbert"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "Disney have the attention of so many child that it's unpredictable and not a good idea make a movie for people over 12 years and talking about the change of everyone in the future when this should be specially for the kids",
      "total_reactions": 2,
      "user": "Geracritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "The movie felt beatifully engineered, but its so hard to follow sometimes and some of these characters fall into cliches and the story is overall very meh. The characters, their motivations felt alright most of the time, and the special effects are beautiful. Overall, its a fun movie, but its not without its faults.",
      "total_reactions": 2,
      "user": "FRG2"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2015
      },
      "score": 9,
      "text": "TomorrowLand is exhaustingly inventive and massively entertaining despite a jumbled, mediocre third act. Brit Robertson steals the show along with the impressive CGI crew behind this film in which, both seem to be the heroes of the film, one saves the day in front of the camera and the rest outshine the magic behind the it.",
      "total_reactions": 2,
      "user": "HaithamB"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2015
      },
      "score": 6,
      "text": "I always rate movies higher when I see them on the big screen with my friends. If I had watched this at home alone I would probably rate a four. Its well made for sure and very pleasing on the eye. But it has a preachy bossy sermonizing element I don't like. It puts my hackles up and activates my hypocrisy radar . Sure enough they blatantly product place for Coke. OK only.",
      "total_reactions": 2,
      "user": "JamesIrish68"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "This movie is not just for kids.  I remember attending the 1964 World Fair in NYC and going on the ride, \"It's a Small World.\"  The memories came flooding back.  This is a movie that may not hang together perfectly in terms of plot, but it's not the plot that matters.  This is a movie about hopes, dreams and memories.  It's a movie that will stir the heart of old folks in ways the young folks won't understand until decades later.  The acting is excellent.  Don't measure this film with the old yardstick of composition.  Measure it with emotion, fun, and good feelings.  On that scale it gets a solid 9 from me.  Regardless of whether you're old enough to remember the 1964 World Fair, Tomorrowland is worth a look.",
      "total_reactions": 2,
      "user": "leojbourne"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "I give Tomorrowland two thumbs up.  I felt in the beginning of the movie I had paid to see a children's movie, but it became a very nice enjoyable fantasy.  There were quite a few young children attending who lost interest quickly because there is no way they could understand what was happening.  I think all the actors did a great job.  I recommend this movie to all who are capable of understanding it.  Obviously the ones who scored it low had no clue!  I would like to comment about some of the people sending in their opinions.  I am shocked at the inability of some who can't conjugate a verb or write a coherent sentence!  What kind of education are these idiots getting?",
      "total_reactions": 2,
      "user": "Florentine"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "Tomorrowland is a solid good movie, however its' long running time makes this film overloaded it terms of story-line. Overall,the visuals' and solid acting performances makes this film worth a watch.",
      "total_reactions": 2,
      "user": "geo333"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "Only for dreamers. If you can dream and believe your future, you can create it. I liked that they brought Nikola Tesla into the picture, it is not a coincidence that he has an amazing car named after him- a true profit does so not for a profit.",
      "total_reactions": 2,
      "user": "WeAreTheFuture"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "This movie is a mess.",
      "total_reactions": 11,
      "user": "tvnewsguido"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "Tomorrowland is a great movie that will evoke memories of childlike wonder from adults and just childlike wonder from children. The movie starts a bit confusing, with 2 of the 3 main leads giving a tiny bit of exposition, and then showing you some backstory for George Clooney's character before dropping you into the main story. From there, we meet a young woman who finds a pin dropped into her belongings by a mysterious young girl. From there, the story becomes a highly original and great one, while sometimes a bit messy. One key detail to not about this movie is that despite it being named \"Tomorrowland\", the titular place is just the main point everything else happens because of. It's more about getting there than being there, and the final act does suffer a bit because of it. All 3 main actors play their roles amazingly, which is a treat considering 2 of them are children. The special effects are also very well done, and the movie uses them to add some very needed twists on typical sci-fi tropes such as lasers and teleporters. Overall, I'd say this movie is very worth the trip, even if the destination, while still fun, isn't quite the payoff you'd think.",
      "total_reactions": 9,
      "user": "can1235"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "Very interesting film containing serious story line, a bit of humor and elements of love story. Actors' play is very good and actors look very naturally in their roles too. Has few interesting easter eggs such as one about Fallout series.",
      "total_reactions": 7,
      "user": "Deadly_Traveler"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "Two thoughts kept running through my head as this story meandered along.  There must have been about 10 writers on this sucker, and I can see George Clooney dating the blonde in about 5 years, and the brunette in about 10.  Seriously, though, the film's heart is in the right place, but they simply didn't know how to tell this ultimately very complicated story.",
      "total_reactions": 8,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "This movie lives on the line between boring and barely watch-able. It felt like a high budget made for TV Disney movie. It's non-cohesive, uninteresting, and without an contains a number of token action setpeices.",
      "total_reactions": 8,
      "user": "phildog"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "What actually could have been like a toy box movie just turned into a cliche movie that really is 40 years too late. The movie is a fun movie for a good majority until you actually get to Tomorrowland. Then the movie just falls flat and down the rabbit hole until I was uninterested. The acting was great and all (even for George Clooneh. Aka most overrated actor). Though the story turns into a cliche mess of themes we've seen and then they beat you over the head with it. I like it, I really enjoyed watching it for the acting and the adventure.",
      "total_reactions": 8,
      "user": "bmaster4616"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "What are you doing, Disney? This had a good trailer and a great premise, and we're given practically nothing that was promised to us. Tomorrowland is focused on a teenage girl who receives a mysterious pin that, when touched, will bring her to a futuristic utopia where nothing is impossible. It would have been nice if the movie was ACTUALLY about that. Instead, the girl, Casey, is only there for about the last 10 minutes of the film. What this movie is really about is saving the world from the apocalypse which is caused by, and I'm not joking, pessimism. Just from that, you can tell this is gonna be one preachy movie. I do wanna say that the acting is top-notch, the special effects are beautiful, and it is an overall entertaining movie. The message of optimism is a great one, but after about 20 minutes, it becomes aggravating how much the movie has to hammer that theme in. That's really Tomorrowland's biggest problem: the movie is more concerned with telling us to \"just be optimistic\" as opposed to telling a cohesive and intelligent story. Many plot points are introduced and completely forgotten by the next scene, and there are many instances where the story will just rush past a potentially important event just so that the characters can tell us even more about optimism and the future of the world. I really don't understand why the trailers seemed like they were trying to hide some big plot element. What they were actually hiding from us was that this movie isn't very good.",
      "total_reactions": 11,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 0,
      "text": "This movie was absolutely PAINFUL to sit through. Unless you're a 7 yr old or a tween, you will bored out of your mind. It's utterly ridiculous, boring and has no redeeming value. This is a children's movie. In a Los Angeles theatre on friday night, there were approximately 25 people in the audience... 4 of them walked out. I soon followed. Save your money.",
      "total_reactions": 18,
      "user": "marco34la"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "It's not a terrible film, but considering all the brilliant people who made it, it's bizarrely incoherant. Nothing ever comes together, and there are no great emotional moments. It's just very flat.",
      "total_reactions": 6,
      "user": "robozot"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "it was okay i like it it keep my attention and well worth my money.  the special effects where not all that big but enough.  sure a few boring scenes in it but they all have those.  just enjoy it i did",
      "total_reactions": 6,
      "user": "SHORTFINGER"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "This film started out so brightly, and then fell into darkness. It was thoroughly enjoyable, but the writing got bad and jumbled in the fourth quarter. Hugh Laurie's role is one of the worst written characters in recent memory, such a waste of talent.",
      "total_reactions": 6,
      "user": "bigtunaonfilm"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "This was pure liberal Hollywood claptrap at its worst. Young kids might like this show because they won't pick up on the liberal agenda portrayed but anybody over 16 won't miss it.  Global warming cured through positive thinking?.  Excuse me?  Can we expect anything else from Disney?  Disney continues to sink lower and lower as they are now pushing their liberal agenda at children.  How very Saul Alinsky of them.",
      "total_reactions": 6,
      "user": "Hurry-2016"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "When I first saw the trailer I thought: Wow, I gotta see that movie!",
      "total_reactions": 3,
      "user": "moviestalker"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 0,
      "text": "If you have trouble sleeping and counting sheep doesn't work then this is the movie for you. Honestly, it can be summed up in one word...boring. I was counting the minutes till is was over and if I had been alone I would have walked out.",
      "total_reactions": 16,
      "user": "Mic7"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2015
      },
      "score": 1,
      "text": "Here is the entire movie:",
      "total_reactions": 12,
      "user": "SandyZog"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "So, there are a good number of negative reviews for this movie, you can see that by looking at the User Score in the headers. Since I had a good time at the movie, and my kids loved it, I was curious about why so many people hated the movie so very much.",
      "total_reactions": 4,
      "user": "Cailore"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "The review of tomorrow.",
      "total_reactions": 4,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2015
      },
      "score": 1,
      "text": "This movie, while it has great visuals, fails at everything else. The plot is incredibly confusing, I couldn't even tell what was going on half the time, and the acting isn't very good either, it's like the actors didn't even know what was going on. The only thing saving it from a 0 are the visuals which like I said, are excellent.",
      "total_reactions": 4,
      "user": "BaganLeleo"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "After films like The Iron Giant, The Incredibles, Ratatouille, and Mission Impossible: Ghost Protocol, there was no doubt in my mind that Tomorrowland was going to be another great addition to that list, and boy was I wrong. Tomorrowland is a visually beautiful film that addressed some very important issues, however as film, Tomorrowland did not work. It tries extremely hard to sell you the overall message, which quickly becomes tiring.",
      "total_reactions": 4,
      "user": "ReysonPoint"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2015
      },
      "score": 0,
      "text": "BORING.....no script...no believable characters......cuteness done-to-death.....my brother and I were lucky in that we agreed almost immediately about how pointless this film was, left the theater and got our money cheerfully refunded.......",
      "total_reactions": 9,
      "user": "jhep"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "High expectations dashed in two words:  convoluted and preachy.  The feeling for a return to the old fashioned for the whole family with modern spectacle in the time honored Disney tradition was palpable leading up to the show.  By the end it was a wash of formulaic action stemming from a smart but over done sci-fi story leaving the wrong kind of questioning leaving the theatre.",
      "total_reactions": 5,
      "user": "AxeT"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "As far as Disney films go ‘Tomorrowland’ may be the most ostentatious and ambitious yet, combining a visually stunning family Sci-fi epic with a socially conscious mystery, the captain for this multifaceted ship is acclaimed writer/director Brad Bird (The Incredibles) whose association with Disney goes back to his first job as an animator for them.",
      "total_reactions": 5,
      "user": "FilmPhonic"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "You may go deaf from the amount of times you have to hear \"Tomorrowland's\" thematic message, but - in spite of that - some fun set pieces and entertaining performances ultimately make the film worth the watch.",
      "total_reactions": 6,
      "user": "Compi24"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2015
      },
      "score": 3,
      "text": "I was so excited for this movie when I saw the trailers and that Brad Bird was directing it. But when I actually saw the movie, I was severely disappointed. Visually, Tomorrowland looks wonderful, due to a nearly $200m budget. However, the plot was a meandering mess, the script was laughable, and for the most part the acting was subpar (apart from Clooney and Laurie's barely memorable performances). You don't even understand what's going on until the last act of the movie. The writing was bad, with thick layers of cheesy worn-out tropes. Not to mention that the film claims that Casey is the young female protagonist, then proceeds to sideline her role to focus on George Clooney's character, and on top of that, the one other strong female character in the film is sacrificed to make him feel better about himself. Ugh. For the most part, there were child actors, so I can't really fault them for not being master thespians. However, I expected more out of Britt Robertson. Clooney acted like he does in every other film, and Hugh Laurie still felt like House. Raffey Cassidy did a very good job for a young actress, even though her character went to waste at the end.  I did like the part when Hugh Laurie's character's leg was crushed; I'm assuming that was a tip of the hat to his role as Gregory House. And occasionally, the humor made me chuckle a bit. But overall, this movie was a waste of time and money, both for me and for the makers of the film.",
      "total_reactions": 6,
      "user": "showbizjunkie"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2015
      },
      "score": 3,
      "text": "What a naive optimism typical of Disney-Hollywood movie. Not to mention stupid enlightening story, it's difficult to find any merit of this movie. George Clooney appears only in the later half of the movie, but Disney is marketing as if it is Clooney movie. Brad Bird better be go back to animated Kid film.",
      "total_reactions": 6,
      "user": "ununnunuun"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "A beautiful treat for the eyes. One of this film's strengths is that it regularly dazzles viewers with the exciting things portrayed on film. It really is stunning. Another of the movie's strengths is that it thankfully has some substance to back up all that flash. While perhaps a bit uneven at times, \"Tomorrowland\" has a nice message and a decent plot to keep people invested until the end.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "Tomorrowland has it's moments from time to time, but uneven pacing, poor plotting and general indecisiveness stop the film from taking flight. Tomorrowland ultimately ends up a bit botched.",
      "total_reactions": 1,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "I'm not so sure if I'm going to see Tomorrowland this week. The good news is that director Brad Bird did an impressive job on taking big chances giving George Clooney and Britta Robinson their best performances so far in this film. However, the lacking of the film feels light and after I read the reviews for Tomorrowland, maybe people should've stayed watching Maleficent and/or Cinderella instead and hopefully I could wait for Tomorrowland on DVD. But just like Jupiter Ascending, the hype is the only problem Disney might've gotten misunderstood. I don't know if it's like a children's movie or a sci-fi adventure movie, eventually, there were some minor flaws like the dystopian setting where one girl switches the ring from one town to another as seen in the trailer. The story is just recycled (although not much to say about the dialogue), and I know it's hard to count on a fantastic director behind animated gems like The Incredibles and the aforementioned underrated The Iron Giant. No doubt, he is a great director. But Tomorrowland just fallen short of how a great Disneyland-themed movie that inspired for over 60 fantastic years including Pirates of the Caribbean and Alice in Wonderland. Quite possibly be an underrated moment for Disney, so I should probably have to wait for it o DVD and Blu-Ray.",
      "total_reactions": 5,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2015
      },
      "score": 3,
      "text": "George Clooney couldn't even save this film from bombing like a bad joke. You will forget about this film tomorrow when you see it. You look for something meaningful, even scientific theory or philosophical, but it's all about daydreaming to escape into another world of a future amusement park. Drags like a bad date!",
      "total_reactions": 1,
      "user": "chughead"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2015
      },
      "score": 4,
      "text": "Kids will have no idea what is going on and adults will be bored out of their mind. The movie begins to feel a bit painful on its crushing length and offers nothing to be amazed about it.",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "Overall kind of boring and cliche. The main characters were somewhat boring with the main actress not being very good. Clooney was ok but his relationship with the child robot was a little odd. Overall the movie was pretty predictable and meant more for kids.",
      "total_reactions": 2,
      "user": "theoffice"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "A very Utopian-type film. Not very inspiring for real-life application.",
      "total_reactions": 2,
      "user": "Bshop"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2015
      },
      "score": 6,
      "text": "This movie was really good except for the ending--the whole idea that there really needed to be a villain really. Why couldn't utopia just be a utopia and it be everyone in the real world that are a threat to the utopia? I personally think that with the world becoming overpopulated and there already being problems for everyone getting jobs to provide for everyone, that one day some smart people will figure out how to make it where everyone has enough and as a result things like war and pollution are solved so that mankind doesn't become extinct. It's time for the philosopher king that the old philosopher's dreamed about.",
      "total_reactions": 1,
      "user": "Krypto_Dogg"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2015
      },
      "score": 5,
      "text": "Although it is lead by relatively impressive performances, tomorrowland is a fast paced movie which aims to inspire but instead follows a clichéd formula of going to a place and discovering a bad guy with a bad moral and ends up with letting go. Such a shame really, the potential of the actual 'tomorrowland' its self is huge",
      "total_reactions": 1,
      "user": "TrilobiteG"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2015
      },
      "score": 6,
      "text": "Tomorrowland; the movie that was going to stand out as an original sequel-killer failed to deliver a stronger box office-performance, and of course a less messy and entertaining plot. Who could have thought the team-up of the director of ‘The Incredibles’ and the writer of unaccountable episodes of ‘Lost’ could result it such a popcorn-disaster.",
      "total_reactions": 1,
      "user": "TheApplegnome"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "Science and technology can be used for good...or...evil...or manipulating the masses somewhere in-between.There ya' go! Ok special effects, story that was as interesting and meaningful to my thinking about the world as the mashed potatoes I'm having for dinner tonight. If you happen to be a climate change denier, (like me), this guy's between the lines narrative is loud and clear. You are contributing to the destruction of humanity and the very Earth itself you ignorant sh*theads.",
      "total_reactions": 2,
      "user": "Chazd3"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "Beautifully filmed and well casted, “Tomorrowland” struggles to succeed, but its jagged scriptwriting and poor dialogue gives Brad Bird’s recent work a mixed result.",
      "total_reactions": 2,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "Overall a good movie.  But, confusing at times if you really sit back and think about it.  The movie itself never really feels happy, it even ends on a very sad note with the whole Tomorrowland city never looking as cool as it did in the beginning of the film.  The actors seem sad and grouchy, throughout the whole film, and the evil robots make no sense...why are they trying to kill people ?  Why is there only 1 guy left in Tomorrowland ?  What the hell ?",
      "total_reactions": 5,
      "user": "evearcher"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2015
      },
      "score": 1,
      "text": "This movie will age horribly. Ever been on one of those really old Disney rights that depict \"their\" version of our present? This entire movie feels a lot like that. You cannot help but cringe by Disney's attempts to oversimplify contemporary problems. Worse yet is how many \"problems\" they take as fact. Between the long bits of political diatribe and shaming lectures aimed at their audience, they attempt to sprinkle \"wish on a star\" magic that comes off as both cliche and naive. All in all, a solid waste of time.",
      "total_reactions": 1,
      "user": "Costs1129"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "\"Tomorrowland\" 10 Scale Rating: 5.0 (Mediocre) ...",
      "total_reactions": 1,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "As we all expected Tomorrowland was original, but it suffered from an identity crisis. By that I mean tonally and narratively the film tried to be too many things all at once. The film had great special effects, good action sequences, and pretty good acting, but squanders that on a weak narrative and a lack of clarification in general. Let me clarify what I mean, if you watch this movie in a theater you can enjoy yourself, but after you leave the theater and think about the film it won't make much sense. The lack of explanation leads to the film having a weak narrative, weak villains, and an overly complex premise, and a bunch of characters we see but don't understand. That being said the film is still enjoyable, and is loaded with good humor. So if you like funny, action packed, Sci-Fi you may want to check this out, just know the plot won't make sense the more you think about it.",
      "total_reactions": 2,
      "user": "tjman09"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "All you expect is a Disney's movie with fantasy, special effects, great characters and a touching message. Unfortunately, Tomorrowland gives us only a few things from this list. The cast is great so as cinematography but what begins as an exciting and funny adventure, only finished with a disappointing ending. Screenplay is very confusing, poorly developed and we have to wait a long time to finally see something big happens. And the worst thing: where is Tomorrowland? We have the impression that the whole film is in this amazing and magical place but it isn't and it kills you. Honestly, Tomorrowland is hard for kids to enjoy because of some quite violent scenes and how long it takes for the story to actually happen and it might also let adults bored. Casey is a nice girl but she's far from the charisma of the young Frank we met at the beginning so this can get in your way too. Watch it if you care a lot about visual effects because the rest...the idea was only good on paper.",
      "total_reactions": 2,
      "user": "danipp"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "Brad Bird has made a visually stunning film along with some imaginative ideas and a great score to boot. However, this film doesn't have the magic and wonder it promised in the trailer. It's a solid movie, but not Brad Bird's best.",
      "total_reactions": 3,
      "user": "WheelzFourReelz"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "This Movie has amazing ideas,but falls short in many areas. The sets and props were visually stunning and looked amazing,the cast was half-decent. The film at first seemed interesting and up to the 30 minute mark it really wanted you to enjoy and watch the film, but after that the plot became a jumbled and befuddled mess filled with a boring and lackluster lines and plot holes. Brad Bird really let down with this film, he has made multiple critically and commercial success films. But this film seemed bland and boring. It was really a let down after the trailers that showed true mystery and wonder. The film has great ideas ,but can't correctly show it. It was so long and boring, with most of the film filled with dialogue and not enough of the eye popping visuals and more of a story to find out. It was true let down and really isn't worth seeing.",
      "total_reactions": 4,
      "user": "TheChronicle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2015
      },
      "score": 4,
      "text": "This Movie was a huge dissapointment and one of the worst this year.Lets go to the",
      "total_reactions": 1,
      "user": "FarhanFiroz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "Tomorrowland is confused – perhaps even more than I am while attempting calculus. It's visual aspects are absolutely the most stunning, and perhaps the only the element that keeps the movie afloat. Casey was a likable hero, even relatable. We knew her and we believed she was special. But everyone else was unconvincing. I don't believe for a second that Frank is \"special\" or can save the world. It doesn't feel like he wants to. I also don't think that's Clooney's fault. Frank's character was never even alive because the story didn't allow it.",
      "total_reactions": 1,
      "user": "hanneguacamole"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "I totally agree with what this guy says, \"Tommorowland. What a beautiful looking film, arresting in every way possible. But, it is all show, and lacks substance. First of all, Tommorowland is cliched to the max, plot twists are predictable, and the story is peppy and bubbly futuristic vibe. George Clooney gives a masterful performance, and Britt Robinson gives a good performance too. The worst part of TomorrowLand is that it doesn't live up to the hype that it had. Brad Bird instead gave us a beautiful movie, but had no good film underneath that layer. TomorrowLand is inspired by Disney's famous theme park, and there is a slight vibe added to it. There is Hugh Laurie as a maniac though. Sadly, it is a let down, but if you admire creativity, give this a watch.\"",
      "total_reactions": 2,
      "user": "Plastosilch"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "The promise of a better world in the future never looks this good. Setting up Tomorrowland is well-thought. Fictional elements are adaptive to its theme. I came to realize though that even an adult like George Clooney can spark a love scent with a very young pair (the robotic girl) without any stain of malice. The movie is fair enough for a fun-seeking moviegoer. Hello it's Disney! What to expect from a kid-centered franchise?",
      "total_reactions": 2,
      "user": "CritiqueKAL"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "With world's of potential, Tomorrowland presents a premise fit for a thoroughly engaging film. Brad Bird is ambitious in his attempts, but results however in creating a disengaging movie with an array of negative aspects. Whilst it is at times visually impressive and quirky, it never lives up to its potential. The opening act successfully teases the audience into wanting to know more, but unfortunately the film suffers in its pacing to a large degree. The film feels like a ninety minute beginning to a movie, with little character development and lack of a clear narrative arc. The characters are poorly written, lacking in comedic humour, successful dialogue and basic human instincts and emotional drives. Not to mention the incredibly unusual relationship between the main characters and the lack of a proper antagonist. In terms of narrative arc, the film's pacing is a massive downfall. Whilst the opening act engages the audience's intrigues, the film slows down and eventually simmers out, up until the point that the viewer is disengaged in the already disappointing final act. Overall, Tomorrowland is contradictory, unrealistic, over political and lacking in any sense of adventure or fun promised in the trailers.",
      "total_reactions": 1,
      "user": "PeterAlexander"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2015
      },
      "score": 4,
      "text": "I saw this film being mediocre from the trailers. Every trailer never revealed anything big, but it always panned to beautiful CGI. Just like the trailer, the CGI is the only thing that held the film up. The plot is just a mess though, it was pretty hard to understand and once I knew that it was some new futuristic land for extremely smart people it also just did not work at all, even the whole save the world bit was not exciting...but well the CGI was good...",
      "total_reactions": 1,
      "user": "NatT96"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "Brad Bird is the director of this movie. You may not know the name, but you definitely know the movies. He is the director of films such as The Incredibles, Mission Impossible: Ghost Protocol, Ratatouille and The Iron Giant. Needless to say, I was extremely hyped for Tomorrowland. And I wasn't disappointed with what I got, but I wasn't the happiest chap either. The acting in this movie is pretty good. George Clooney was on point, as were most of the actors. Its a Disney movie, so its not too mild in its violence, however I was pretty surprised with the violence in this film. It was, pretty freaking violent. Anyway, by the third act, the movie sort of starts to slip a bit. But, it regains strength by the end of the film with a solid ending that definitely satisfies you. Its worth the price of admission, but it isn't Brad Bird's greatest. Then again, that's a pretty tough spot to beat considering he made The Incredibles and The Iron Giant. My final thoughts on this movie are:",
      "total_reactions": 1,
      "user": "BoogeeFilmGuy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2015
      },
      "score": 1,
      "text": "Un film aussi ridicule que sa prétention désabusée. Ce film est ce que l'on peut appeler un étron, certainement le pire film de la première moitié de 2015.",
      "total_reactions": 1,
      "user": "Honnyman"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2015
      },
      "score": 4,
      "text": "this movie just didn't do it, the commercials for it were better, george clooney was doing for another paycheck no real acting here, the movie just didn't seem to go anywhere at all",
      "total_reactions": 2,
      "user": "mikemac"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2015
      },
      "score": 0,
      "text": "I just finished watching Tomorrowland with George Clooney and I thought it was one of the worst movies that I have had the misfortune to watch.   I am sorry that I wasted my time.  I watched it to the end, because it was a Disney film and I,  also like George Clooney.  However, I am sorry that I did.",
      "total_reactions": 2,
      "user": "mahogan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2015
      },
      "score": 7,
      "text": "Where did the 180 million bucks go?  I kept asking myself that when I watched it. It's got some great visuals but seems like a lot of its movie budget went down the drain.  It's not like they got special effects in every scene...it's nowhere near that.  While it is overall entertaining and has a positive nessage, it suffers from a very slow start and underwhelming ending.  It takes like 30 mins to get the ball rolling and for you to figure out what is going on. Also felt that the demise of one of the central robot/android characters (and George Clooney's character's reaction to it) was not very believable--I mean she's a machine, she should be able to copy/download her memories to some backup device and live again in a new body.  And lastly, they should have titled it better--it's got nothing to do with the Tomorrowland in Disneyland.",
      "total_reactions": 1,
      "user": "RoniPogi77"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "Those people who says that Tomorrowland is boring, a waste of time, or even stupid, well, THEY DON\"T KNOW THE TRUE ART OF FILM MAKING. This movie is one of the best movie i have ever watched, and i very rarely say this. This should be nominated for oscars. The story, scenes, actors, dialogues, and visual effects are just perfect and great. Britt Robertson was very believable in her role and the child Athena was just as great. I know lots of adults that says this movie is exciting, and children who enjoyed it. And i am a science student and i'm not offended by this movie, i was actually fascinated. So i truly recommend you all to watch this movie. I promise you that Disney showed its best once again :)",
      "total_reactions": 1,
      "user": "JennySantos09"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2015
      },
      "score": 6,
      "text": "The movie has an entertaining concept and lively characters, but it tends to be on the preachy side. The last half hour gets muddled in confusing space lingo, and I lost some interest.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2016
      },
      "score": 5,
      "text": "Men in Black directed by a guy who does cartoons and wishes he could do a Steven Spielburg impersonation = complete mess.",
      "total_reactions": 0,
      "user": "3ebfan511"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2015
      },
      "score": 7,
      "text": "The lead up to go to Tomorrowland was better than when we got there.  All the performances were great.   I just wanted Tomorrowland to be a place that had big ideas and was visually breathtaking. Overall the world itself was just okay and all the early things on earth were the best part.  B+",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "Brad Bird's Tomorrowland falls short of it's potential, but still delivers entertainment on a massive scale. The third act is weaker than the first two as it is more generic in tone and that doesn't blend well with the sheer originality of the first two.",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2016
      },
      "score": 5,
      "text": "The movie's plot is a good sci-fi fantasy adventure, one that promises that we are building up to something even bigger as the reveal of Tomorrowland draws closer. However, it is disappointing to find out the fictional setting that has been so hyped up all movie is just a boring, lonely utopia that doesn't nearly amount to what the film is making it out to be. Anyway, it is a solid film with great acting, good emotional moments, and eye-popping effects, but all is nearly ruined by the movie's letdown of an ending.",
      "total_reactions": 0,
      "user": "TimeOfTheChimps"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2015
      },
      "score": 6,
      "text": "Tomorrowland is an ambitious and original concept that had the potential to motivate filmmakers to create original films, but despite some great direction from the extremely talented Brad Bird Tomorrowland falls short of the hype. The film has some great effects and that is one of the high points in this film and I think that actors do a pretty good job in this movie considering what they were given for a script. I did not really feel connected with the characters despite this cast and I really didn't know if the chemistry was 100 percent established with the cast. The third act, the point where everything should really get exciting, is the part where the whole movie just falls apart. The film is too long and allows so much build up only to crack under the pressure. Then I see the credits and see Damon Lindelof wrote this film, the man who is famous for LOST. I must say that is a bit ironic.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2015
      },
      "score": 7,
      "text": "For children, this movie offers cool special effects, lovable characters all wrapped around a basic science fiction adventure. For adults (and mature teens), you get all of the preceding plus a subtle reminder that as parents and adults, we have certain social responsibilities for our children.",
      "total_reactions": 0,
      "user": "nHeat87"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2015
      },
      "score": 5,
      "text": "I will have to say overall the movie was very disappointing, am glad I didn't spend hard earned money at the theater and waited to rent it. Though I will say the special effects and the creativity of the movie meets the high standard of Disney.  With that said the storyline is very hard to follow and not set very well in the script, it leaves you lost as the movie moves on.  To me that was no surprise as I wondered how Disney was going to tell the tale of Tomorrowland, what we all are familiar with from our trips to Disney World and Disneyland.  George Clooney does well with what he is given and had the feel that he was trying to bail this movie out all the way through.  If your bored and want something to watch OK, but I can say I wouldn't recommend anyone rushing out to buy it or rent it!!",
      "total_reactions": 0,
      "user": "horizonbts"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2016
      },
      "score": 6,
      "text": "Ok, so the beginning felt like it might be a really exciting movie. Afterwards it got even more exciting and I thought we will see lots of action in it too combined with futuristic/sci-fi stuff. But it changed and basically turned to safe the world movie without that much action in it really which would be interesting in the second half - why? In my opinion because it is Disney, the company which made it, so they made it family friendly and full of lessons for kids. While I would have preferred them to explore some more of the action that could have been in there and the actual futuristic world that was built there. But it got resolved quick and quite mish mashy in my opinion",
      "total_reactions": 0,
      "user": "Ralfbergs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2015
      },
      "score": 8,
      "text": "Tomorrowland is a film that only exists as a live action film because the quality of CGI has reached that point where rendering such diverse, deep and almost photo-realistic backgrounds is possible.",
      "total_reactions": 0,
      "user": "YorkMan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2015
      },
      "score": 5,
      "text": "The trailers made this movie look great!  But the movie plot seemed to meander about as one adventure led into another.  About half way through, I was getting restless.  Sometimes a script that should have been an hour long TV show gets stretched into a two hour movie; I would put this in that category.",
      "total_reactions": 0,
      "user": "smiyamot"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2015
      },
      "score": 8,
      "text": "In plain words: Had the perfect balance of action, storyline, and even contained a message ( no it's not political or cheesy ). 125 minutes flew by.",
      "total_reactions": 0,
      "user": "Jimuhtone"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "Visually stunning. Well acted. Very good family movie. The ideas are intriguing even if there are holes in the plot. Is there really a movie out there about time disruption that doesn't have holes? I enjoyed it quite a bit.",
      "total_reactions": 0,
      "user": "sheppardt1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2016
      },
      "score": 0,
      "text": "I really did not find this movie interesting at all. none of the characters really impressed me except the villain who I think met an unjust end. Besides the young robot girl he was the character with the most meaning through out the film. I think the ending would have had more impact if instead of killing off the cynical character they changed his mind and helped him to believe in humanity again. The movie claims to be about \"optimism\" but none of the characters optimism was believable, while the villain made the most sense through the movie its a shame they ended it the way the did. The movie could have shown true optimism by curing the cynic of his cynicism instead of killing him off.",
      "total_reactions": 0,
      "user": "caityshe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2016
      },
      "score": 6,
      "text": "Tomorroland may have an inventive plot and a good message, but it has boring story-telling and very simple characters, with unremarkable contents. Sadly, here's another, not-great-enough Disney film that more that the half of the udience will forget.",
      "total_reactions": 0,
      "user": "Futuredirector"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2016
      },
      "score": 10,
      "text": "Tomorrowland is one of the best Disney movies of all time. It's about a girl who touches the pin and see a world beyond and travels into tomorrow to save the world. The FX is pretty awesome and Casey Newton is one of my favourite characters of all. I wish Britt Robertson will win an OSCAR for best lead actress.",
      "total_reactions": 0,
      "user": "SanDiego"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2016
      },
      "score": 6,
      "text": "The movie was just okay to me... I absolutely loved the cast and I am glad that I got to see it for that reason alone but it was way to far fetched. I love a good Sci fi book or movie but it has to tip closer to the science and less on the fiction and this story was way more fiction. literally when the movie ended I was like meh and shrugged my shoulders... it left something to be desired. Though I would love to have one of those blaster guns they were pretty cool. I really liked seeing Hugh Laurie. I haven't seen him in much since House MD and it was nice to see him again. poor guy something always happening to his legs. lol Not too shabby!",
      "total_reactions": 0,
      "user": "Stargirl04"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2016
      },
      "score": 9,
      "text": "With Brad Bird, it makes this film a great adventure",
      "total_reactions": 0,
      "user": "MordoReviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2016
      },
      "score": 7,
      "text": "Though it has enough dazzle, Tomorrowland takes a while to start moving, but, once it gets going, its an action-packed, visual splendor, even if it may be too \"kiddish\" for older viewers.",
      "total_reactions": 0,
      "user": "Muskrat147"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2016
      },
      "score": 10,
      "text": "Tomorrowland has a great message. I really like the graphics. It has a really cool story line. I love the tech at Tomorrowland. Tomorrowland is my type of movie! :)",
      "total_reactions": 0,
      "user": "MovieLover1525"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2016
      },
      "score": 0,
      "text": "Cliche, teen drama heroine, predictable, shallow, bad cast , i could not stand it from the first half and deleted it,it had potential until i saw the cast and what happens after the jump, it's capitalist , so that you have to feel bad before, in and after whatching it,the story is trash.",
      "total_reactions": 0,
      "user": "zh0so"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2017
      },
      "score": 7,
      "text": "Tomorrowland is a pretty good movie. With good acting and good writing    .",
      "total_reactions": 0,
      "user": "reviewfrom19842"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2016
      },
      "score": 0,
      "text": "Good first half with a ridiculous last hour.Clooney should be ashamed.Except, I suspect, he was one of the \"nimrods\" behind the whole fiasco.I was in so much agony I could not even give it one point.",
      "total_reactions": 0,
      "user": "jimmywoo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2016
      },
      "score": 6,
      "text": "A former boy-genius (George Clooney) and optimistic teen girl really good at science (Britt Robertson) try to save our world. In order to do that, they will have to travel to futuristic parallel world.",
      "total_reactions": 0,
      "user": "KaptenVideo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2016
      },
      "score": 9,
      "text": "a Extremely entertaining and pure fun movie. The special effects look great and really pull you in to this magical world. Has also a lot of great messages especially for the millenials and gen x.",
      "total_reactions": 0,
      "user": "Kippermixer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2017
      },
      "score": 1,
      "text": "Meeeerde, une chierie à chiards, y a des nabots partout ! y a aussi une jeune pouffe blondasse. C'est Disney, c'est pour les polios du cerveau. C'est mièvre, plein de poésie et d'optimisme béat qui donne envie d'aller en pousser une sur le trône. C'est long, très long aussi, très bavard. Avec de jolis effets spéciaux poétiques trop jolis. Clooney fait le clown, il essaye de faire l'acteur et comme d'habitude, il fait de la peine. Il y a aussi le Docteur Maison (non, pas Bonnemaison !) qu'on a laissé sortir de son hôpital à pognon et qui est toujours aussi con. Mais c'est quand même joli ce Disney qui sauve le monde gnééééé.",
      "total_reactions": 0,
      "user": "Broyax"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2017
      },
      "score": 8,
      "text": "This film could be one of the most underrated films of all time; it's seriously really good. It's very original, and it has a very consistent zany tone.",
      "total_reactions": 0,
      "user": "SomePersona"
    }
  ]
}