{
  "mc_avg_user_score": 8.9,
  "mc_metascore": 92,
  "mc_mixed_rating_frequency": 58,
  "mc_movie_name": "Toy Story 3",
  "mc_negative_rating_frequency": 54,
  "mc_positive_rating_frequency": 1439,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 2,
      "pos_reactions": 21,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "15 years has past, and my faith in Pixar did not break; \"Toy Story 3\" shakes the cinema as a groundbreaking masterpiece, a masterpiece pertaining the pure love and joy we rarely see in any kind of movies.",
      "total_reactions": 23,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "\"Toy Story 3\" knows precisely when to make you laugh and when to make you cry, and is bound to touch the hearts of anyone who has had to put their childhood behind them.",
      "total_reactions": 2,
      "user": "ryancarroll88"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "Toy Story 3 is one of those movies that you can watch and enjoy for the first minute to the last minute. The animation is superb, we came so far from the original graphically speaking. Kids will just eat this up, and adults will be amused by the older jokes. It is essential to have a copy of this movie, whether on disc or Netflix. I give this movie a 9.5, the score it deserves, because the movie really is wonderful.",
      "total_reactions": 2,
      "user": "ianriker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Although so many have said it was less inspiring or under par compared to 1 and 2. I would have to say i whole hearted disagree. I loved the first two and how the characters just bought you back to childhood. But I would have to say number 3 delivered more laughs and although more directed towards an older audience it outclassed the originals if only by a small margin.",
      "total_reactions": 1,
      "user": "raefon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "Toy Story 3 was the best sequel compare to the same Toy Story 2 that there are both best sequels ever,since Star Wars Original Trilogy. I love this movie and I really love it to watch this. The images are pretty good to watch and they did a lot of work with the animation and they also did a lot of work with the better story. This is the last trilogy that they made the best animation film ever. The Toy Story saga is complete and we will remember three movies at our hearts.",
      "total_reactions": 1,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "Disney strikes a 3rd knockout Toy Story picture with Toy Story 3, though seemingly lacking something from the other 2 films, it is still likely to be one of the best films of the new decade.",
      "total_reactions": 1,
      "user": "Paxster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "I found myself wondering who this movie was actually made for. Judging by the reviews, I suspect it's for aging baby boomer critics who are nostalgic over their own kids' childhoods. Some scenes seemed kind of tense and scary for little kids . . . but as I imagined taking my own children to this when they were in elementary school, I doubted whether the whole \"going off to college\" theme would have intrigued them. Enchanting visuals, of course. But though I had the obligatory tear in my eye at the end, this was nowhere near as moving as last year's \"Up.\"",
      "total_reactions": 1,
      "user": "Lyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Quite simply one of the best film Ive seen this year. Packed with that Pixar goodness. surprise cameos and a perfect mix of a lost childhood, showing the situation from different aspects. With creative, loveable and well done characters and animations, Toy Story 3 lives up to the first two films, and even outshines them.",
      "total_reactions": 1,
      "user": "Susano"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Pixar makes yet another great film. Toy Story 3 presents us with the idea of growing up and moving on with life. And this is heartbreaking but you empathise and journey back to your own experiences with growing up. In some ways, itâ",
      "total_reactions": 1,
      "user": "shlugalug"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "Don't walk away from this movie. it has heart, emotion, slapstick humor, and very lovable characters. Toy Story 3 is a huge hit and its one of the best movies ever made to gain 1 billion dollars (beating Avatar in one shot).",
      "total_reactions": 1,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "I loved the first and the second. The third one is just hilarious . I was waiting what the plot was going to be like and I just loved it. It was worth waiting eleven years to finally see how toy story ends. The most surprising fact was that I cried like a baby.",
      "total_reactions": 1,
      "user": "Mary7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "I have never before been so emotionally invested in a movie before. I've started to sleep with my teddy again, so he never feels like they do. Toy Story 3 is a beautiful story, and while it's not a perfect 10, it's as close as it gets!",
      "total_reactions": 1,
      "user": "judsonrempel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "This is probably the best movie I ever watched. It was funny and emotional at the same time. I'll miss Toy Story.",
      "total_reactions": 1,
      "user": "MichaelD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "I enjoyed this one as much as I enjoyed the first 2, great story line, fun characters, voices are done very well, nice action, great family flick.  Put in the popcorn and enjoy!",
      "total_reactions": 1,
      "user": "MrRiggs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "jeez!!! Why the many 10? Taking a look a toy story 3,it's just not innovative and mind blowing like the first,there's really nothing new to see interms of new characters and the action scenes like the second. So, i do think toy story 3 is a bit overrated (just a tiny bit) but overall it is a fine movie and a fitting closure to a truly wonderful franchise",
      "total_reactions": 1,
      "user": "hugoboy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "Pixar has made 11 great films (minus Cars 2) and this is the best by far. Made me cry and made me laugh and was beautifully written and was just lovely to watch. I really have to stand and applaud Pixar for making such an incredible film.",
      "total_reactions": 1,
      "user": "ManilaCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "This movie is funny, exciting, dramatic (at times) and heartfelt because BOY DID I CRY. It may have been even better than The Social Network and stood up to all heavyweight films of 2010",
      "total_reactions": 1,
      "user": "JawsPapi87"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "Toy Story 3 is a heartfelt, highly original and creative family-friendly flick. One of Pixar's best, and a nice send off to a classic trilogy. 4/4 stars.",
      "total_reactions": 1,
      "user": "marnee96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Toy Story 3 is not only hilarious but emotionally resonant as well, you will find yourself crying at many parts in this film and the movie features great voice acting and dazzling animation only push the film to an even higher note. I give this movie a fantastic and very rare 100%.",
      "total_reactions": 1,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "If you are around the age of 20 and have seen Toy Story 1 and 2; I think its impossible to not love this movie.",
      "total_reactions": 1,
      "user": "VisserEight"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "The other 2 toy story's were great but this one takes the cake. Never has a film felt so real with its characters even though they were just toys  an achievement like no other for pixar. the ending is classic and will leave some in tears. one of the best pictures of the year",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "It is amazing to witness an animated movie that is so powerful. It has a very human connection about it. This was clearly the best of the series. It hit all the right notes and is strikingly emotional.",
      "total_reactions": 1,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "Toy Story 3 is the final chapter of the Toy Story franchise, or for now anyway. With Andy leaving for college, now in his late teens, his mother is urging him to get rid of his old toys before he leaves. When the gang of toys end up being mistakenly taken to a kindergarten play-centre instead of being left in the attic like they should have been they form a plan to get back home as quickly as possible. However they all realise that Andy will never play with them again, he is far to old to love them like he used to and they will just gather dust so staying in the play-centre is the better option. Its not until they are made unwelcome by the current residents of the kindergarten that they decide to put this plan into motion with less than successful results due to a grumpy old toy who was abandoned by their owner years ago.",
      "total_reactions": 1,
      "user": "potatoes351"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "The perfect ending to a perfect trilogy. The ending had me sobbing over toys like a child. I don't think any other movies, besides Star Wars, have shaped my life the way Toy Story has.",
      "total_reactions": 1,
      "user": "MonsieurEames"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Adorable animation and a massive amount of truly heart-rending thematic subject matter not only make \"Toy Story 3\" the best of the series, but quite possibly the most earnestly poignant animated film ever made.",
      "total_reactions": 1,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "The perfect way to end a trilogy.  If it wasn't for Inception this would have been my favorite film of 2010.  Just a fun, heart warming, and very fulfilling piece of art.",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "Pixar with \"Toy Story 3\" had its grand zenith. Toy Story trilogy is so: \"Toy Story\" good, \"Toy Story 2\" better and \"Toy Story 3\" best. This film is one of best film ever.",
      "total_reactions": 1,
      "user": "mapizarro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "Summary Review",
      "total_reactions": 1,
      "user": "kev_i_n"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2013
      },
      "score": 9,
      "text": "Toy Story went down each time, and the long hiatus didn't help. I still found all the characters funny, charming, and raucous. 'Toy Story 3' became more childish than the previous two, which relied on a smarter breed of comedy. But its still enjoyable but I hope there's no 4, because without Andy, there's no plot.",
      "total_reactions": 1,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "It's almost as good as the original!  A 9.5 in my books!  I loved the plot too. Andy was old and going to college. The toys were going to the attic. It was really a deep movie and i loved it. However it isn't a perfect 10. My old favorite characters like the drawing board thingy and the soldiers were replaced by new characters which i did not like as much..    (Oh and by the way... Andy how could you!)",
      "total_reactions": 1,
      "user": "Jipa"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "In 1995, Pixar released the world's first full-length CGI animation film, Toy Story. Audiences were amazed, not only by the introduction of CGI animation, but also by Toy Story's heartwarming characters and innovative storytelling. CGI is ubiquitous nowadays, largely due to Toy Story's success.",
      "total_reactions": 1,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "If Toy Story 3 doesn't make you emotional, I don't know what will. Filled to the brim with nostalgia and references from the previous movies in the franchise, it probably couldn't have been any better than it was. We start out knowing the toys haven't been played with in a while and they miss it. They even go to the trouble of creating an elaborate plan just to get Andy to notice them for one minute. Their plan hardly works, but then Andy needs to pack for college. Has to decide who stays and who goes. Woody is to go to college with him and the rest are to live in the attic, but instead they accidentally go on an adventure none of them will soon forget.",
      "total_reactions": 1,
      "user": "hanneguacamole"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2015
      },
      "score": 9,
      "text": "A fabulous way to end one of the best trilogies of all time. A must see if you haven't all ready, like the other Toy Story movies. Definitely one of the best films of all time.",
      "total_reactions": 1,
      "user": "BoogeeFilmGuy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2015
      },
      "score": 10,
      "text": "This is the best Pixar Movie since 2003. True, Pixar's movies have all been excellent in quality, none of them quite matched up to the Toy Story movies or Nemo. But this movie does!",
      "total_reactions": 1,
      "user": "YellowKirby"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "The lovable Toy Story 3 is back as ever strong enough to hold in with the first two movies that made Pixar what they are today and history was made right there.",
      "total_reactions": 1,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2016
      },
      "score": 10,
      "text": "Toy Story is a masterpiece that everyone had tried to imitate but nobody has done it better; one of the best animated movies of all time; after 11 years we can see Woody, Buzz and playmates in an thrilling adventure that brings back our childhood memories. The Friendship that everyone has to know; thought provoking, hilarious, action and drama, a perfect movie for grown-ups and children... Shall we expect more from Disney-Pixar?",
      "total_reactions": 1,
      "user": "DavidTejada"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "It's unbelievable how good this film is. It's a rare occurrence where a franchise of three films have been consecutively good box office and critic wise. Definitely worth the watch and worth the eleven years of waiting for this masterpiece of animation.",
      "total_reactions": 9,
      "user": "Triatsila"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "When i was little i thought that the Toy Story franchise will never come back, but they did and boy they hit me hard with good old childhood memories. This movie is the best in its series and is one of my all time favorites. So if your not doing anything, you need to watch Toy Story 3.",
      "total_reactions": 4,
      "user": "Trasser"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "This the just most epic animated movie bar none, and that feels like an understatement. From start to finish, this film delivers unrivalled quality of storytelling, excitement and humour. This was pretty much the perfect end to Pixar's most loved movie series and still excellent as a stand alone film. Toy Story 3 is one of those few animated films that has everything an audience can possibly ask for. It surpasses the likes of Shrek, Kung-Fu Panda, Finding Nemo and Lion King to show exactly what the people behind Pixar are capable of. (I know the mentioned films are not made by Pixar except for finding nemo). It may have been 10 years since its predecessor but the wait was definitely worth it. Toy Story 3 could very well be the film of this year and should easily be the best animated feature film in 2010.",
      "total_reactions": 6,
      "user": "ProphetOfTruth"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "Toy Story 3 managed to continue the excellent streak of the \"Toy Story\" series! Not only is the animation simply impeccable, but all of the technical aspects of the film just work perfectly. The story, just like the previous two, is amazingly fresh, interesting and highly engaging. What always surprises me with such animated films is the level of emotional depth that they manage to delve into. I still prefer Wall-E (I think  no animated film ever will top that one for me), but Toy Story 3 is all about friendship, loyalty and trust - just what we need to remind ourselves nowadays. Amazingly beautiful, exciting, entertaining, and educational, \"Toy Story 3\" manages to bring yet another generation of kids under its wing, keeping (and even widening) the love we, who grew up with it, had for the first two films. Excellent!",
      "total_reactions": 3,
      "user": "smijatov"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Toy Story 3 had a lot to live up to, but Pixar delivered-as expected.  I absolutely loved it!  You'll laugh, cry, and share tender moments with these toys who have grown up with us since the late 90's.  It's the darkest Pixar film yet, but it delivers on all fronts.  The 3-D version is useless, though.  I recommend seeing it in 2-D.  Anyways, go see this film.  Give it a chance.  I promise you that you won't regret it.  Oh, and by the way, Ken and Buzz Lightyear (Spanish Version) steal the show.  You'll know what I mean by that when you see it.  A 10/10.",
      "total_reactions": 3,
      "user": "Harbinger"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Pixar (unsurprising) has done it again, made a movie so good that you don't want the damn movie to end, ever. \"Toy Story 3\" has all the hallmarks of a Toy Story film; familiar characters, gut busting jokes, top-notch animation, and excellent voice acting. What really sets this one apart is the emotional factor in this film, a thundering ending that will leave you undoubtedly in tears. Transcending the previous efforts and coming out as unapologetically dark, \"Toy Story 3\" will rock you to your core.",
      "total_reactions": 3,
      "user": "Bigboy1138"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "A true masterpiece and the best movie of 2010! Thank you Pixar for introducing us into their magical world back in 1995, giving us an amazing sequel in 1999, and ending the trilogy on a very high note in 2010!",
      "total_reactions": 2,
      "user": "gm101"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "This movie is just awesome no matter your age. The story is fantastic~! And the animation is excellent.  Pixar has delivered again. It is rare to see such movies made anymore. I think that this film will be a future classic!",
      "total_reactions": 2,
      "user": "Stormcrow666"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "Great trilogy of animated films. It feels like I grew up with these movies, I was around Andy's age when the first movie came out and now I'm in college like he is now. It's my favorite of the 3.",
      "total_reactions": 2,
      "user": "j30"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "This movie was okay, but it is my least favourite in the TS franchise. I thought it ruined the series. The new characters were okay in design, but when it comes to heart (polite or rude) THEY WERE TERRIBLE!! Well, at least Lotso, and his minions. And what is Barbie and Ken doing here? This is a movie you should try to avoid unless you really really love the series. The story was kinda crappy. This movie could've been the end if it wasn't for the 3 Aliens, so thank them. Disney, Pixar, don't make Toy Story 4 wourse. This is as high 5/10 as I go. Not going any further or above. Andy has also grown too, and gave all the toys away to Bonnie.",
      "total_reactions": 2,
      "user": "Beastprogamer"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "Toy Story is my all time favorite Disney movie and will always have a special place in my heart. When I first heard about this, I was ecstatic as most of us were. I don't know if it's just me though, but it felt like something was missing or I just didn't enjoy it as much as a kid would. Toy Story 3 isn't just for kids though, it's for everyone, especially those that grew up with it will be really impacted by this movie. Your kids will love it, and so will teens and adults alike.",
      "total_reactions": 5,
      "user": "EDJET787"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "Heavily overrated movie! Seriously, this isn't enjoyable for neither kids nor grown-ups. For the younger ones it will probably be scary and also recondite; for the elder ones, it's a too long and too childish motion picture. 'Toy Story 3' didn't make me laugh one single time and the scenes ought to be sad, didn't touch me (don't call me heartless, it's just not serious!). Also the animations are not better than in the first two movies, which date back more than 10 years!",
      "total_reactions": 4,
      "user": "axelkoch"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Toy Story 3 is a time capsule of a movie. I remeber growing up back in the 90s and Toy Story was the big deal for children. Woody, Buzz Lightyear and co. have been taken to a day care in this installment of the Toy Story trilogy. This was of course an accident caused by Andy's mum.",
      "total_reactions": 5,
      "user": "Pixarlover"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2015
      },
      "score": 3,
      "text": "I was on the wrong side of this film. I felt toy story 3 was a huge step back from its predecessors. But it's not just the worst of the trilogy, it's also one of Pixar's least innovative films. After an interesting start it seemed to be overloaded with plot devices - from Andy's mom mixing the toys with trash, to rest of the toys disagreeing with Woody (given he's always been right in the past), to the spying monkey, to buzz's spanish configuration, to Lotso's back story etc. It just recycles the ideas from Toy Story 2 (which in my opinion is still the best of the three). I liked the premise of the film just that its very poorly executed. Okay, the ending was touching but people seem to forget that everything before the ending was mediocrity. Overall as a film, it's not nearly as good as I would've liked.",
      "total_reactions": 5,
      "user": "AkashVijay"
    },
    {
      "neg_reactions": 62,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2011
      },
      "score": 0,
      "text": "can't escape the feeling that Toy Story 3 is being terribly overrated by critics and moviegoers alike. Critics are calling it \"heartbreaking\" and \"inspiring\", and a movie critic from NYT even went as far as calling it \"a deep, complex take on mortality\". Seriously? Personally, I found Toy Story 3 of being a surprisingly formulaic and unappealing movie of the following reasons. Firstly, the same story formula is being recycled for the third time! Just like in the other two movies, the toys are separated from Andy. Overall, the plot just feels like one big excuse to move the characters from the backdrop of Andy's room to the daycare center where the story is being transformed into a prison break parody, filled with plot-twists, slapstick humor and gay-jokes, directly aimed at the adults in the audience. But the worst thing is that this movie isn't treating the characters with respect. Rather than having them develop beyond the minimal standard required for the plot, the directors focused more on having them do stupid things and end up in stupid situations. There are about a dozen different toys in the series now, most of which only functions as comic relief characters that stick around in the background. The majority of these toys spend more times being chewed on by drooling babies than showing any character development, whatsoever. Buzz and Woody are really the only ones worth mentioning, which is sad, because both Woody and Buzz are terribly simplistic in this third installment. Woody is the same few-worded, whiny character he was in the other two movies. But it's okay. He doesn't change because the plot requires him to stay the same. But Woody was never the star of this series. It was the space ranger, Buzz, who stole the show back in 1995. In Toy Story 3, the ugly doll is reduced to pure, stupid and brain-dead entertainment. The only character development Buzz Lightyear demonstrates isn't more complex than the switching on the button in his back. He spends the majority of the movie in \"demo-mode\", delivering catchphrases and references to his delusional space-persona. And it's funny about the first time he does it and not quite as funny about the tenth time. And he spends the rest of the movie as a surprisingly distasteful and offensive Spanish stereotype. And really, oh so devoted Pixarfans, doesn't the fact that the directors would take Buzz Lightyear and change him so carelessly in the film speak volumes of their indifference to their own characters' personalities? I just can't figure out what, if anything, makes this movie so good. From my point of view, It is terrible! And it becomes even more staggering when you think about how other animated movies, personal favorites that are by far more sophisticated and complex; Like How to Train Your Dragon and Bolt, are being pushed in the background to make way for the unyielding glorification of Pixar. Okay, both of these movies have been met fairly well by critics, particularly Dragon, but none of them have received the attention Toy Story 3 received, despite being more deserving. My personal favorite, Bolt, was very underrated, almost overlooked, when realized back in 2008.",
      "total_reactions": 75,
      "user": "carlminez"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2015
      },
      "score": 2,
      "text": "This film is mediocre at best. It wasn't good at all. I really liked the first 2 Toy Stories but this was a big disappointment. The voice acting was fine, but it was too scary for it's age group. If you loved the first 2, then give it a shot, but you probably won't enjoy it that much. Otherwise, skip it. Also it's HIGHLY overrated.",
      "total_reactions": 6,
      "user": "Mariofan"
    },
    {
      "neg_reactions": 38,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "Did they need to make this movie? No. Will you feel emotionally invested in the movie by its end? Absolutely. Has it simply been too many years since the previous movies to enjoy this movie fully? I think so... It just didn't feel fresh from beginning to end, and  I can't award a movie for best ending. Sorry.",
      "total_reactions": 45,
      "user": "AaronM"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2014
      },
      "score": 1,
      "text": "Heartwarming? Inspiring? Emotional depth? Shoot me now. These terms belong to other wonderful Disney movies, but not this outcast. I will admit that the first Toy Story was marginal, but the sequels are just pure trash with whipped cream, sprinkles, and a cherry on top to distract you. The third one is formulaic, manipulative, and annoyingly written.",
      "total_reactions": 7,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2010
      },
      "score": 4,
      "text": "Watching the film I felt sentimental and enjoyed seeing the characters back on the screen, but as I left the theatre I felt unsatisfied that what I'd seen was a true Toy Story picture. For me, it just felt quite rushed and haphazard.",
      "total_reactions": 8,
      "user": "Mornington"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "One Of Pixars Overrated Movies.. When Noone Know's What Studio Ghibli Is...",
      "total_reactions": 8,
      "user": "LanaDelRey"
    },
    {
      "neg_reactions": 44,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2010
      },
      "score": 1,
      "text": "We feel this movie might make kids was to kill themselves. This series has always been depressing and nothing you can actually take home with you. Yeah it's got the whole cast back which was long awaiting. This series started off a lot of the CG genre, but there's nothing to actually make you feel good about yourself. If you're sadistic and want your kids or other peoples kids to cry, sure get the movie, but look at it emotionally and mental wise. Is it healthy for your kid to see that stuff? 'Yeah look another funny movie with cool stuff in it, oh wait my kids crying?' Thanks Disney, just like Wall-e kill that main cast member, put some more depression in kids lives. No, this movie wasn't great besides the 3D and CG effects.",
      "total_reactions": 47,
      "user": "epictvsaga"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "Disney obviously had nothing to do with this film. Ever since Walt Disney died the Disney channel has become the Pedophile network, and they have not produced a single thing of any real value. They shouldn't be able to put there logo on this one. They may have produced this movie, but Pixar pretty much owns Disney now, so I don't see the point. Anyway, this was a prefect family film, must be watched with children though, otherwise its just not the same movie.Thank you Pixar for creating a perfect ending to a great family franchise. You have once again shown your class, and skill.",
      "total_reactions": 2,
      "user": "lilkillpappy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Toy Story 3 edges out \"How to Train Your Dragon\" for best animated movie of the year.  It's my favorite Pixar film since \"Ratatouille\".  You would think some staleness would start to set in since this is the third Toy Story, but not so.  Not only is Pixar the best at writing original scripts for animation, they are the best at getting great performances from the voice actors.  These characters have real personalities.  The dialogue is realistic, the pace frantic.  LOVE the mean cymbal playing monkey!  That was the biggest laugh I've had at the movies in awhile.  The ending was perfect.",
      "total_reactions": 1,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "I have never been a really big fan of Pixar's animated movies.  It has never been the quality or the writing; it just has to do mostly with the subject matter or the overly cartoony look of it all.  It just doesn't appeal to me.  Toy Story was an excellent movie, while 2 could be considered a bit less accomplished, and usually it just gets worse from there.  Luckily the people at Pixar have a high stamp of quality in pretty much all their products, and not just from a visual point of view.  Toy Story 3 is an amazing movie that takes you back to a time when everything was new and you could swear that your toys were alive.  The movie could have been anything but good.  It could have been an easy cash grab for Pixar; they could have done it for the money.  Instead they decided to end (?) their series in rare form these days: on an incredibly high note.  The story tackles some very serious issues in regards to growing up and moving on with life, and gave me many flashbacks of how I felt as a child.  It's a very special thing to find something that moves you like this, much less from a bunch of animated polygons, but Toy Story 3 (and pretty much all the Pixar movies) are some of the very best at conveying the emotion needed to portray their characters as real beings with complex emotions and motivations.  The voice acting, with Hanks, Allen, and the rest of the cast (most of them) return as if no time has passed, sliding into their roles effortlessly.  It's a very satisfying thing after all this time to hear Woody's voice again; I didn't realize just how much I had missed it.  I don't think there was much that I didn't like about this one, although some children may have some issues with the darker parts of the movie, which I actually applaud Pixar for delving into, it's nothing a nice parent to child dialogue can't work out.  All in all this is a great way to end a series (if it is at an end, and I hope this is the case), as a class act like this can teach other potentials just how the final movie should be.",
      "total_reactions": 1,
      "user": "zombiehampster"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "Pleasant enough but not fresh like we have come to expect from Pixar.  Maybe it has simply been too many years between movies, but I really feel it was lacking originality and energy.",
      "total_reactions": 2,
      "user": "univega2003"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "Amazing! It's the word that comes to mind, not just for the movie itself, but for the brilliant work Disney did in taking an already immediate classic, collecting its treasures, and then expanding upon them in ways unimaginable in a launching of their third film: \"Toy Story 3.\" The plot feels fresh and keen, usually uncharacteristic of a continuation. There are no signs of unfunny, moronic, paltry humor and adages but rather laughs brought on by the conduction of its characters. The way the film conveys human emotion is done so fluently that you can't help but draw a tear when the characters do. Many times in modern animated cinema, characters seem aloof and disconnected from the live voice they are given. This is what sets \"Toy Story 3\" apart from those doll-faced, skin-deep wastes of filmic expression. The depth of each character is such a marvel to watch, that if too consumed, the viewer can neglect such extraordinarily fine and often surreptitious detail displayed in the same scene. The \"movie of all ages\" feature is also topnotch as the kids can comprehend the outward action as the adults can take in the deep, subliminal thematic situations and humor. After viewing \"Toy Story 3\" you come to the realization that life, like a playroom, is a place where we interact, learn, fail, succeed, are sad, happy, and then are used up. Like Woody, Buzz, and the gang, we all fear the day where we will be replaced or \"thrown in the trash bag.\" This is just one of the many conceptual and mundane themes that people relate to from \"Toy Story 3,\" Absolute treat for anyone! 5/5 stars.",
      "total_reactions": 1,
      "user": "FDT44"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "THE MATRIX is the best action movie ever made in my list. When Matrix released on its time, thiz movie created many breakthrough on world cinema. Directed by Larry and Andy Wachowski, who is just recently popular in thiz movie. They just known previously as small budget film Director, BOUND (1996). Later, the movie has two more sequels MATRIX RELOADED and MATRIX REVOLUTION in 2003. You can almost classify the Stars of thiz movie as B-Class Casts, except Keanu Reeves, but still the outcome is beyond the expectations. Each of the characters like: Neo (Keanu Reeves), Morpheus (Laurence Fishburne), Trinity (Carrie-Anne Moss) , even the villain Agent Smith (Hugo Weaving) already become a legendary icon in the industries. One of the fervencies of thiz movie is on the action scene. The fight scene is something new and different, which follows later by other movies. Behind that extraordinary fight scene is well-known Martial Arts Choreographer, Yuen Woo Ping. Woo Ping is the man behind CROUCHING TIGER, HIDDEN DRAGON(2000), KILL BILL (2003),THE FORBIDDEN KINGDOM (2008), even Jackie Chan classic action SNAKE IN THE EAGLE SHADOW (1978). His experiences in a lot of Asian movies made him effective.  The movie definitely exceed beyond our imagination. In fact, many people did not understand entirely the story of THE MATRIX, there are still many blank spot to question about. The Content of the movie fills with great philosophies inside. It seemed to me Wachowski Brothers discovered successfully how to make a brilliant concept from some of religions. The essence is not that simple as appear to be, Actually we will always have something new, every time we watch it.",
      "total_reactions": 1,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2011
      },
      "score": 5,
      "text": "Don't get me wrong didn't think it was bad, Just didnt feel as fresh as the first 2, no new significant characters and just a bit formulaic felt like ive seen most of it all before especially compared to the 2nd one. eg toys not being played with as much, toys mistakenly get lost, toys find a nice place with nice other toy , turns out to be bad, toys have to find why back, ect. strangely started to get a bit morbid aswell towards the end. not sure if im too old for them anymore but yeah didnt think it was as good as the first 2",
      "total_reactions": 2,
      "user": "ubcool"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "Epic and perfect ending to the Toy Story Trilogy that is part of so many people's lives. Dramatic ending and is sure to touch every viewer's heart; whether they have been there from the start or is watching Toy Story for the first time. One of the best animated films of the year. Simply amazing.",
      "total_reactions": 1,
      "user": "Yoshipie"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "This film was good in places but I feel as if critics and fans have watched an entirely different film to the one I saw in the cinema. For a film aimed at children I was pretty disturbed by the 'gay' jokes. The story was very similar to the other films with no innovative ideas being used. I grew up with the Toy Story films and I loved them to bits but I do feel as if I was perhaps a little too old for this film. Parts of it were good but it just felt too predictable. Hopefully they don't make a fourth one.",
      "total_reactions": 1,
      "user": "dev92"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "The third best animated film of all time.",
      "total_reactions": 1,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "A great revival of the previous films that perhaps even surpasses it's predecessors.",
      "total_reactions": 1,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "Toy story 3 is the greatest movie i have ever seen from disney and pixar animation studios.its such a great movie to watch because it surpassed dreamworks dragon and broke sherek the third record, and it won for best animated film in 2010. Go Pixar! By the way, pixar animation studios and disney animation studios is the greatest place on earth to make animated films.",
      "total_reactions": 1,
      "user": "Jeri"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "An amazing ending to what is one of the best Trilogies of all time.You would think that the third movie on a franchise and especially on an animated one would be terrible but it's not because this time is Pixar that is making one,and as they have proved it over and over,they can do no wrong.It's touching,heartbreaking,funny at times and most importantly well Directed which makes for an overall super fun and amazing movie.",
      "total_reactions": 1,
      "user": "GentM2015"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2016
      },
      "score": 3,
      "text": "This movie is overrated.it sucked balls.The user score now will be mixed,beacuse this piece of **** sucked ALL the dicks who watched that.those who like this \"masterpiece\" are masoquists.ANDY LEAVES WOODY,THAT ALREADY SUCKED,but the only thing keeping it from being a bottom of  the barrel.is that the villain,lotso.is pretty good",
      "total_reactions": 1,
      "user": "SuperHyperST"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Is it the best of the Toy Story franchise? I'm not sure, but it is certainly the funniest. 'Toy Story 3', along with the first two films, is a masterwork in storytelling.",
      "total_reactions": 0,
      "user": "aabender002"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "One of the best films if not the best film I have ever seen. It's just a masterpiece from top to bottom. It's charming and humorous but at the same time very touching, and delivers some outstanding metaphorical and symbolic references (even one of the holocaust) that transfix and compel you throughout. This film blew me away and left me speechless and even teary eyed at just how epic it was. I know it sounds weird but it really is a film anyone, child or adult, can relate to and is symbolic of Disney in general and how it watches you grow up. So far for me the film of the year :)",
      "total_reactions": 0,
      "user": "Andrew"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "One of the best films of this year!  It makes me happy, sad and warm all at the same time.  This movie is not to be missed on the big screen. Watch watch watch watch watch this movie",
      "total_reactions": 0,
      "user": "Julara"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "Obviously a good movie. Those that gave it a score in the yellow or red are just hating because that's what they feel like doing. Every Pixar movie has been good, and the Toy Story Trilogy has been their best works. This one brought me back to when I was a kid and the first two came out, and freaks me out that it was so long ago. Thanks Disney and Pixar.",
      "total_reactions": 0,
      "user": "dijavantewow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Toy story 3 has everything will love about the Toy story world plus some new fun good and evil characters. Toy story 3 is even more amazing, as it is slightly darker and give a real sense that these toys have feelings. Pixar has proven to us again that their animations can have be more moving and have realistic feelings than movies that have real people in them. Brilliant Job , I look forward to Monsters Inc 2.( Note: Monsters inc is my favourite Pixar movie. )",
      "total_reactions": 0,
      "user": "Lwppopz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "In 1995 I was eight years old when I first saw the first Toy Story and I loved it, in 1999 I was twelve years old when the second one came out and loved it as well. Damn it I'm twenty three years old and I freaking cried with Toy Story 3 it's one of the best movies of the year. Those folks at Pixar are really outdone themselves, move the hell out of the way How to Train a Dragon let Toy Story pick up its Oscar before schedule. The movie begins with the imagination of a young boy and we kind of see what the toys see when there playing with their kids. Then a homemade video of Andy when he was younger playing with the toys. The gang is scared because Andy hasn't played with them for a long time and to make matters worse he's going off to college. The toys are afraid to be thrown away. After a confusion the toys accidentally do get thrown away and feeling rejected they decide to donate themselves to a daycare ignoring Woody's protest. When they get there they get accepted with the toys and Lots-O the leader of the daycare makes them feel at home even though we feel something wrong.  This movie proves that animation is growing and growing big. We need animation in every aspect of the genres. United States has categorized animation with children but can be use in every film. The Toy Story crews are true pioneers for this craft. The film looks outstanding much more improved then the first two. We get lot character models and facial expressions from toys and lot more human interactions as well. Everything is nicely animated from Andy's house to the daycare and other locations. There are times which I want just pick up these toys and freaking hug them. Everybody is nicely cast and including some new ones as well. The voice casting is downright excellent just like the first two. The plot is so well written with so many themes to teach. It teaches us about our loss of our childhood and we lose are imagination as we get older. The acceptance of being adult, it teaches about overcoming greed and being a family no matter what the circumstances are. Lastly with all the movies that are ending with obligatory action sequences and slapstick. Toy Story has one of the most beautiful endings ever. This movie reminded me so much of my childhood and sometimes I miss it. The film has the best ending of a trilogy since I saw the Lord of The Rings ending. I miss when cinema was like this a strong plot, strong performances. The film industry needs this kind of cinema. Go watch Toy Story 3 and be amazed.",
      "total_reactions": 0,
      "user": "thelordoffilm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "I watched this movie last weekend, liked it but was really disappointed in the 3D portion. It was basically pointless for the movie to be in 3D because there wasn't many scenes that were 3D. Nothing popping out at you, nothing really exciting. It just looked like the usual Toy Story movie. I felt that having it in 3D was a waist. It looked like it was in HD. It had a clear picture, animation was good, but It needed more \"3D\" scenes, more eye popping stuff. I was not wow'd",
      "total_reactions": 0,
      "user": "annagg10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "A classic kid's movie that adults will enjoy a whole lot as well. My 3 1/2 year old daughter loved it, we both thought it was well done. An excellent ending to the franchise.",
      "total_reactions": 0,
      "user": "rodericrinehart"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "'Toy Story' has not relinquished its hold on emotion satisfaction, stunning visuals, and comedic validity, however this closing chapter seems to focus more on being funny than being compelling.",
      "total_reactions": 0,
      "user": "GavGav96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "This really is a great movie. I loved every minute of it. It's funny yet touching at the same time. The characters in this film really make you feel in touch with your inner child. I can't recommend this movie enough it really is something special. I now truly believe that the toy story trilogy is the best animated trilogy ever(so far and prbably for a LONG WHILE). This movie is also probably the best pixar movie too as well as one of the best disney movies ever.",
      "total_reactions": 0,
      "user": "1966Zodiac"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Extremely satisfying ending to an incredible trilogy. Quite possibly the best movie of 2010.",
      "total_reactions": 0,
      "user": "AJackson729"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "Not amused so much. A film for kids more than for parents but in connection a good film. Thought that there will be much more story around the carackters.",
      "total_reactions": 0,
      "user": "tytim"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "Thois movie is clearly appealing to people who have grown up watching Toy Story and are now adults or on the verge of adulthood mentally. It wont be as appealing to the kids i can guarantee you but it had human emotions and human nature in those toys.",
      "total_reactions": 0,
      "user": "Iqbal"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "There's not really much to say, the movie of the year!!! Although the only criticism I can give is that it won't relate to those 13 and below, unlike the previous two it doesn't have the wholesome appeal that everyone can enjoy. In this film though the pain that these bunch of toys felt brings me to tears and adults snifle, but kids will only laugh since they don't understand the concept of losing a toy, they don't know how to feel, they might understand in the future but for now, it's just an adult animation that sadly only be appeal for those 13 and above.",
      "total_reactions": 0,
      "user": "VeryCutePanda"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "This was one of the most moving movies I have ever seen, it trumps its predecessors. The Toy Story charm is all there, and greatly improved. The animation is spectacular, one of the best I've seen. The dream of talking toys is still alive and well.",
      "total_reactions": 0,
      "user": "LaurieHouse"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "I was never a fan of the first 2 as a kid, but i was able to get connected. At the end, i shed a tear, which is kinda hard to do considering i wasnt a fan before hand. Good Job Pixar!",
      "total_reactions": 0,
      "user": "MetalMan95"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "I'm a big fan since the first success, when Woody must regain the trust of his friends and save Buzz Light year of the \"evil child\" Sid. The second movie reminded me great moments of the first one and I enjoyed their new adventures they had, now in the streets and how important it is to work as a team.",
      "total_reactions": 0,
      "user": "Nightian"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "Creativa y conmovedora , aun sin tener las agallas de ser una obra maestra , una pelicula de muchas dimensiones , y llena de pasion en su desarollo ,  es fantastica y divertida un gran fin para esta trilogia .",
      "total_reactions": 0,
      "user": "joregano"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Every bit as polished and witty as any Pixar movie to date, this is family cinema at its best.  By the end I was moved to tears.  A truly remarkable animated film.",
      "total_reactions": 0,
      "user": "grindhouse83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "Sequels, they are numerous and frequent. Most of the time the producers are trying to take advantage of the success of its highly grossed predecessor. This is not the case with Pixar. These guys have a philosophy that they do not make sequels unless they think they can tell a good story. Being a huge- Pixar fan I trusted them and went to go see Toy Story 3 expecting nothing but the best. After watching the film all I can say is that this is one sequel that you shouldnâ",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "This is Pixar's successful movie for Disney times. We hope Pixar would make excellent movies like this. Also this movie has a great plot for the audiences around the world.",
      "total_reactions": 0,
      "user": "WWABTT123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Pretty much completes your childhood if you watched both Toy Stories. The darkest and saddest of the Toy Stories. Heart-wrenching yet exciting and exhilarating.",
      "total_reactions": 0,
      "user": "muzziklover"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "I'd first off like to say that this movie's targeted audience is teenagers but it can also be enjoyed by all other age groups - small kids and adults. I myself am 17 years old, in a similar situation as Andy - getting ready to move on to college. I grew up with the series so I can say that I have grown very attached to all of the characters that return in Toy Story 3. To keep this short, I'll just say that I can't recommend this movie enough to everyone (especially teens who grew up with the series) and the ending was a tear jerker if I've ever seen one before. Outstanding, Pixar.",
      "total_reactions": 0,
      "user": "x_RadicalAura_x"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Why yes, it really is that good.",
      "total_reactions": 0,
      "user": "Acropolis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "I have always been a fan of Pixar ever since the first Toy Story came out and revolutionize cinema as we know it. The sequel proved that number 2 can as magical and entertaining as the first one while staying true to what made it so great unlike other film franchises. Toy Story 3 is as great as the first two and proves that a third entry could work as well. Whats makes Toy Story 3 so great is the film itself. While watching it, not for one second did the thought of it being bad ever occured to me. While at the same time it grabed my full attention unlike any other film I had ever seen. I had a blast watching as it knows when to blend the right sense of humor in excellent timing and when to go dramatic to appropriately add a good sense of emotion for each character. It`s cast of voice actors are believable and goes perfectly into every character. Even I though didn`t see it in 3-D, from what I heard is that the audiences had a blast. So go out and see this masterpiece that will take you to your inner childhood where the imagination and joy should put a smile on anyone watching it.",
      "total_reactions": 0,
      "user": "KenL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "\"Pixar has done it again , making another pitch - perfect move, it was heart wrenching seeing the old toys back on the screen. I Loved every second , and brought back unforgettable memories. AMAZING movie. and bring the tissues , The toys are BACK! this is the BEST film of the year!\" ..A+",
      "total_reactions": 0,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "This film deserves Best Picture - It's The Best Pixar Film and It's ending touches the heart -Fantastic , Unmissable - Great Voices -  Funny Script - This Film Is PERFECT!!!!!!!",
      "total_reactions": 0,
      "user": "dgr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "Everything from the exciting opening sequence to the rather poignant ending works so perfectly. There are some great moments, like when Ken met Barbie for the first time, Mr. Potato Head as a tortilla and Buzz Lightyear in Spanish mode has to be seen to be believed! I really enjoyed this film and really engaged with the characters I know so well for the previous two films and found myself quite choked at the end. All three films have been tremendous and I really hope they don",
      "total_reactions": 0,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "Aside from the occasional mishap such as Cars, Pixar is one of those companies that is downright consistent. Toy Story 3 follows the tradition of Up and Ratatoullie, in which an animated film is capable of tugging at the audience's emotions with its unbelievably imaginative stories.  Toy Story 3  delivers with its original voice cast and the characters children growing up in the 90s have grown to love. Even though the 3D animated genre has been used to almost near death, Toy Story 3 strays away from the mediocrity because it creates an experience that does not solely isolate the entertainment of young children.  The significant flaw that comes to mind with the film is that it does not feel as fresh as its predecessors. Yes, I do acknowledge it is a sequel, but it feels as if we have already been exposed to this world many times before.",
      "total_reactions": 0,
      "user": "RyanGee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "'Toy Story 3' has wiped the smirks off the faces of all the doubters who believed that by making a third installment Pixar were crushing their  invincible streak of critics successes. They have, once again, reminded us why they wear the crown in the world of animation, providing us with a thrilling, emotional and hilarious film that ticks all the boxes in providing us with the ultimate family film. Ten years was a long wait, but this movie makes it every bit worth it. Well done Pixar!",
      "total_reactions": 0,
      "user": "Judddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "This movie is the family film of summer 2010, I loved it I really loved it!!!",
      "total_reactions": 0,
      "user": "ESS180"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "I do not know how they could have made this a better movie.  I only give it a 9/10 simply because a little bit of the originality is missing due to the fact that it is the 3rd installment.  Another finely crafted Pixar movie.  Does anyone make movies as well as this organization?  They are a classic movie factory.",
      "total_reactions": 0,
      "user": "JohnQPublic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "Maybe my favorite film of the franchise (still have to respect the ground-breaking nature of the first and the storytelling of the second). It is exciting, funny, heartfelt, and everything that we have come to expect from Pixar. Loved the new character, Lots O' Huggin' Bear too.",
      "total_reactions": 0,
      "user": "Tony"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "We've been waiting over 10 years for this film, and you know what? It was worth it Toy Story 3 delivers a heartwrenching, warm, lovely tale that only Pixar can excel in. This time around, Andy's off to college and he's done playing with his toys. After an accident, the toys get donated to Sunnyside Day Care centre, which turns out to be anything but sunny. (its always the misleading, lovely sounding names) We get loads of new characters, Peas in a Pod, Ken and my favourite, Mr Pricklypants. They all blend perfectly into the story, and we get the villian of the piece: Lotso Huggins bear. He isn't a generic villian, you see his plight through flashback, and genuinly feel sorry for the villian. We've also lost a number of characters. Woodys girlfriend, Bo Peep, Wheezy and the lovable RC. Its sad to not see them, but thank heavens we still have the likes of Ham, Mr Potato head and the lovely aliens. Theres a lot of wonderful moments, like the opening play scene with evil Dr Porkchop, and the ending scene as the toys are in their new home with new friends. Theres also a sweet moment, as the toys are about to be burnt, and just accept it, holding hands. But another wonderful moment occurs, as the aliens save the toys with \"The Claw\" The thing with Toy Story 3 is you've been with these characters since the beginning, since the first Toy Story. We've loved them through their adventures against evil neighbour Sid and villianous Prospector. We've seen them play happily with Andy as he grew up, and now that he's grown up, you really feel for these characters as Andy no longer plays with them like the old days. All in all, Pixar have achieved the impossible: a trilogy in which the quality never dips beyond amazing. And a perfect way to make grown men cry",
      "total_reactions": 0,
      "user": "roddersj04"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2010
      },
      "score": 8,
      "text": "On November 2, Walt Disney and Pixar released Toy Story 3 on Blu-Ray, DVD and iTunes.  Also available in a combo pack with both a two disc Blu-Ray release, DVD copy and an iTunes download of the movie. The currently highest grossing animated feature of 2010 is now out for inclusion in your film library.  Toy Story 3 is the last chapter in the trilogy that is the story of Woody the Cowboy and Buzz Lightyear the Space Ranger.  In this last chapter we find out that Andy is on his way to college, and his mom wants him to clean out his room, and either throw out his toys, sell them, or bring them with him to college.  Through an unfortunate chain of events, the toys almost get thrown out but end up being donated to a local day care center that is run by a strawberry-scented bear named Lotso.  Other reviews have discussed the finer details of this movie, so I wonâ",
      "total_reactions": 0,
      "user": "FlickDirect"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2010
      },
      "score": 8,
      "text": "Good movie, but same expected ending, and whole new story. Besides, Despicable Me blew this out of the dust. It's a good movie overall, but remember repetitive stories and better movies.",
      "total_reactions": 0,
      "user": "williamwiggles"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Great film. Never manages to fail expectations its a perfect strory to life and what us humans feel within our emotions. Pixar have created a masterlass, when Buzz, Woody etc are all falling to their mercy in what most of us thought would be them burnt to ashes. Making us humans express that much emotion in a few toys show this great bond between us and the characters that only happens through three great journeys!, I was expecting this to be worse, but turns out it just keeps getting better :)",
      "total_reactions": 0,
      "user": "mafls001"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "LOVE THIS MOVIE! It had that touching as well as funny feel to it. This film was probably the best of the three. Spanish buzz was hilarious to me! Those dances made me crack up!",
      "total_reactions": 0,
      "user": "critquefan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "With both of its predecessors receiving a 100% positive feedbacks on RottenTomatoes.com, Toy Story 3 is expected to reach the high standards. And it absolutely does. Toy Story 3 follows the 11 year absent of the two previous films and off the Andy going to college. The toys including Woody and Buzz Lightyear are being donated to a daycare center. The toys were ecstatic about it until they found out that the kids there are disgusting and there is a huge evil bear with a one-eyed baby doll guarding them. Adding adventure to the already interesting plot, Woody and the gang decided to humorously escape the center with great style. Director Lee Unkrich, who is not new at all to the Pixar directing department, he's been responsible for Finding Nemo, Monsters, Inc., and co-director of Toy Story 2. So picking him for the job is not a bad idea. He brought something completely new to the table and turned the story around with twists and thrills. Lee Unkrich had done a decent job of directing this beloved film which had both adults and kids crying their hearts out. From the beginning where Andy's home videos are being played to the end where Andy was saying his final good-byes to the toys, Toy Story 3 is a must-see for all ages and it touched all of our hearts one way or the other. OscarBuzz: Best Picture (locked for a nomination), Best Animated Feature (locked for the Oscar)",
      "total_reactions": 0,
      "user": "OscarPicks2010"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "The Toys are back in town! (Yea, I said it). \"Toy Story 3\" may just be the best installment in the Toy Story series (and the word on the street is Pixar may be making a forth). Pixar hasn't let me down yet on staying true to what matter most, the story. And somehow Pixar keeps raising the bar on 3D animation making it seem like they are untouchable. \"Toy Story 3's\" visuals and animation put the first \"Toy Story\" to shame. It is like comparing VHS to Blu-Ray.",
      "total_reactions": 0,
      "user": "PYRiAH"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "Oh my. This is so far the only sequel that is as good as the original. -- I told myself repeatedly upon seeing the previews that this wasn't going to be a very good film, that it was mainly an attempt to make more money off what was a wonderful original, with some rather crude child-humour (judging by the commercials). I agreed to go see it anyway, for whatever reason, and by the end of it, I was crying. It was a wonderful ending to an awesome series of films. -- There was nothing super-epic that changed my paradigm or anything, but certainly enough to live up to the other two. I'm extremely happy to have been proven wrong, and will hold my breath hoping we won't see a fourth any time soon.",
      "total_reactions": 0,
      "user": "whitefox"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "I grew up loving Toy Story and I would have never imagined that it would follow me into my adult life. We went on opening day at midnight and it was us and a ton of rowdy teenagers. It was so funny how the movie shut everyone up and brought us all together. Everyone was cheering, laughing, and crying at all the same parts. I swear this movie takes down everyone into tears whether they admit it or not. a week later I took my little cousins to see this movie and they had all the same reactions. this movie takes all the themes form the last two movies and brings them out into such a high emotional level that everyone young or old can love it. It's a blast to watch just for fun too. Toy Story is a kids movie series for every generation to infinity and beyond",
      "total_reactions": 0,
      "user": "Kalukalay"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Rounding out the perfect trilogy - narrowly beating 'The Lord of the Rings'.' This film should definately be nominated for best picture, if not win. Instant Classic. Best pixar movie, after Wall-E",
      "total_reactions": 0,
      "user": "PigBenis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "I admit I was sceptical, but this movie really surprised me, and it really is an example to what \"U\" rated movies should be: Exciting, Hilarious but clean, well-paced and also very touching. It had a quite a few sad bits in it, but I kind of like that as it gives a sense of maturity without requiring a \"16\" rating(Haha!). The balance of humour and emotion come together to make a fantastic end to a fantastic trilogy, and I'm crying as it waves goodbye to us. The characters are witty and well played, especially the take on a pink bear being a \"mafia\" leader while at the same time his backstory making you feel sorry for him despite all his evils. And they even managed to put in TWO love stories while not making it seem overly soppy, even making them very funny at times. In short, WATCH. THIS. MOVIE. ...why are you still reading this? I told you to watch this movie! GO!",
      "total_reactions": 0,
      "user": "Snipestrifer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "Pixar amongst being an amazing team of producers, directors and animators manages to bypass the stereotype that sequels are never a good as their predecessors. This is evident in Toy Story 1, 2 and 3 and will be in all the sequels Pixar will ever make. Pixar easily outstrips its competitors and even Disney its self with it's amazing ability to produce entirely original films. Toy Story 3 is fine example of this and gives every quality of a truly good film: perfectly selected music, quirky and life-like characters, flawless and skillful animation, a clever script and of course pure originality. Previously life-less toys become a part of you, full of genuine emotion and humor and realistic enough to jump right out of the screen and into your life. Join Pixar in Toy Stories final chapter and embark on a journey that will make you laugh and cry till you can no more.",
      "total_reactions": 0,
      "user": "Creativita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Toy Story 3 may have taken a while to get here but it was worth every second of the wait, the toys are back and more enjoyable than ever, the story is an emotionally moving masterpiece, it will have you laughing, crying, and sitting on the edge of your seat from beginning to end, my only complaint is one joke that really should not have been in a kids movie and i should subtract a point for that, but it's just such an excellent movie that it really doesn't effect the fact that this movie is deserving of a perfect 10, this is one of the greatest movies ever don't miss it.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2014
      },
      "score": 9,
      "text": "Toy Story 3 ends the Pixar animated trilogy on a high note. The story is tight, the jokes are funny and the climax leaves not a dry eye in the house. For me, this is undoubtedly the best in the series and one of the best Pixar films to date.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Absolutely great!  Witty, creative, and inspired (can imagine animator saying \"you know, my sister's baby doll always creeped me out\").  It's a total delight.",
      "total_reactions": 0,
      "user": "enigma13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "Rarely can any movie meet perfection and despite the general consensus, this movie was excellent but not quite perfect. Yes, the story line seems a little unimaginative when compared to Toy Story 1 & 2. The new toys they did introduce didn't have the character development that made us either like or hate them. Nevertheless, this movie had the one quality that mattered to the viewers: it touched on the nostalgia of our childhood memories.  The ending that everyone is alluding to is the perfect example of this.  The best part is the older viewer never saw it coming.  We are suddenly rerouted down this emotional path causing us to reflect on the changes we make as we move beyond our childhood years.  It is a bittersweet reflection and one that requires a 230 pound father of a little girl to choke up and clear the dust that is tearing in his eye. Pixar is an incredibly talented production company and this movie is another great example of this.",
      "total_reactions": 0,
      "user": "2008CRNA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "The third installment of Disney Pixar's Toy Story 3 is absoulutely sensational. The same old characters are back. Reliable Woody, spacehero Buzz and friends steal the show from the start. The movie shines in the aspect of being suitable for all ages with funny clean storylines and character development. The plot twists and scenarios can relate to everyday life and situations. Animation movies are at times limited, but the team at Disney were suberb in providing a truly memorable third Toy Story",
      "total_reactions": 0,
      "user": "eliteco3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "A great film, anyone who liked the first two would love this one, all the characters return and it feels great. It's very entertaining and funny at times, it's truly a film for the whole family, my 10 year old sister liked it, my 18 year old brother liked it, my parents (in their 40s) liked it, and I liked it (me being 14). But dispute all the good stuff, there are a few bad things about Toy Story 3, the story is too similar to the previous movies and it felt predicable at times. Other than that, it's a great film that should be watched by any Toy Story fan, or animation fan.",
      "total_reactions": 0,
      "user": "Jdude1006"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "what a fantastic movie! its got a lot of  actions ,a great plot and pretty good effects.",
      "total_reactions": 0,
      "user": "mynameisritarar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "The perfect goodbye to the characters we all know and love so well. Too often we see sequels flop so it's great to see Pixar gave it there all. Hilarious movie but also very sad especially if you've grown up with this film as it's not just Andy saying goodbye to his toy's, its us too! Only Pixar can manage to make a movie so funny and yet so sad at the same time.. I feel sorry for anybody who doesn't enjoy the Toy Story movies",
      "total_reactions": 0,
      "user": "sumsar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "I was worried that I would be harshly disappointed with the end of the original trilogy from my childhood.  I was wrong.  This movie does justice for Pixar, Disney, and the theatrical releases disgracing the entertainment world today.  After an 11 year wait, I was pleased dramatically.  Doubt it?  Go see it for yourself, and you will understand why it should win an Academy Award.",
      "total_reactions": 0,
      "user": "EcoFriend"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "At first I didn't understand why Toy Story need to be a trilogy, especially with Toy Story 2 falling to capture the warmth and charm of the original. But after seeing Toy Story 3 I understood why this film had to be made. For those who grew up with Buzz and Woody, we always knew that Andy would eventually grow up and be more interested in sports and girls than playing with toys. I thought that Disney and Pixar did an excellent job on giving fans of the series one last chance to say good bye to their childhood friends. Great film!!! A must see!!!",
      "total_reactions": 0,
      "user": "MrC3030"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "Movie really fun, which initially made us laugh. With the development, make us start to reflect about how we left aside the things that were very important in our life. And what a beautiful end, making us reflect about how might be so difficult open hands from things that were important to us, but itâ",
      "total_reactions": 0,
      "user": "jimmytancredi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "Exhilarating, emotional, and innovative, Toy Story 3 is a fun, heartwarming threequel for all ages. Pros: Eye-popping CGI animation and 3-D effects; innovative characters elevated by talented voice acting; lots of lesson and depth added to the plot. Cons: It's not as cheerful as the first two installments.",
      "total_reactions": 0,
      "user": "KendylKlownfish"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "The absolute best animation I have ever seen. How fitting, considering Toy Story was the pioneer of digital animation. I was four when the first Toy Story came out, and eight when the second one did. I pretty much grew up on Disney movies, Toy Story and Lion King being the two I watched most. Probably a few hundred times between the two of them (no exaggeration). I literally grew up with Woody, Buzz and the gang. Coincidentally, I started my first year of college last year, so Andy and I share a connection that is very personal to me. The people over at Pixar have done what has only happened a few times in history. Let's hope they take home the Oscar for Best Picture like the Lord of the Rings did, although I wouldn't get my hopes up. Those Academy douche bags... But back to Pixar. They created a damn near perfect trilogy. I loved this movie. This may be blasphemy to some of you, but I have to admit that Shrek 2 still holds the crown as my all time favorite animated film. After that is How To Train Your Dragon, then probably Toy Story 3 and Toy Story 2 tied at third. Ratatouille is tied with Monster's Inc. for a very close fourth. As you can see, Pixar dominates my list, that does go on, by the way. Anyway, I think this was a perfect way to close the trilogy. The last fifteen minutes or so were very heartfelt and touching. I was on the verge of tears. When Woody said goodbye to Andy in the closing moments, I felt as if he was talking directly to me. The movie is altogether excellent. I have to admit that I was a bit nervous that it wouldn't impress me as much as everyone said it would. After reading over a dozen reviews with perfect scores, I had expectations that almost always lead to disappoint. I'm happy to say I was not. Not even close. The script is very well done. The music is just as great. The voice acting never felt insincere. And most importantly, I never got the feeling that some studio executive told the geniuses at Pixar to make this movie because it would clean out the pockets of millions of moviegoers I'm talking to you DreamWorks. I almost hated Shrek after the third movie, then they did a fourth?! No, I never got that feeling from this movie at all. It was a rejuvenation to a property that was already loved by almost everyone. The graphical detail in the picture was incredible. I have been fighting the Blu Ray takeover for months, but if there was ever a movie that would make me take my first step, it's this one. Nope, not even Avatar could make me do it, and I loved Avatar. I didn't see the movie in 3D because I heard some bad things about how dull it was. So I won't comment on that, but even without it, this movie is gorgeous. I loved it, and I cannot wait to buy it. I'm actually glad I never bought the first two. That means I can get whatever special trilogy box set they release hopefully this holiday season. It saddens me to know that their adventures are over, but I'm glad it ended the way it did. Waiting eleven years to do the final entry was probably not intentional, but it worked out for the best. At least for me because of my age corresponding to Andy's. I'm really going to miss those toys (at least until I get that box set). May Toy Story live forever.",
      "total_reactions": 0,
      "user": "RJSmoove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2011
      },
      "score": 9,
      "text": "This is one of the top films of 2010 and all would agree with that! THe whole concept is is amazing as the story of Andy's toys comes to a moving conclusion. It'll give you a chuckle, cry, and more laughs because this is a wonderful movie!",
      "total_reactions": 0,
      "user": "Ridz43"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "I was blown away by this film. I couldn't fathom that a second sequel could be so fulfilling. If you've been keeping up with the series since you were a kid (I was a mere six when the original debuted), then you own it to yourself to watch the conclusion; and it especially strikes a somber yet optimistic tone with the recent high school  or college graduate. It's likely shorter (or at least seems so) than the previous iterations, and is much more rich in content, storyline, and absolutely unrelentingly stunning animation which has been the hallmark of Pixar since it's creation. It's a must-see film and total lock for the top 5, or even number 1 film,  of 2010.",
      "total_reactions": 0,
      "user": "thesaxmaniac"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "When you go to see a Toy Story movie you know you will laugh and be entertained but you don't expect to shed a tear (a manly tear mind!) as well, but that is exactly what this third movie in the series delivers. If this is the final entry in the series its a great way to finish.",
      "total_reactions": 0,
      "user": "drlowdon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "This movie is so FANTASTIC! This is the perfect movie finale to an amazing series of tales between Andy and his toys. The ending is so heartbreaking for me, I just want to cry but I can't. This shows how toys can be so significant in a person's life. I just don't understand why some users gave it an average or bad rating, maybe they just don't appreciate it. This movie really deserved a score more than 10. Pixar is consistently producing true masterpieces so we should expect more from Pixar in the future.......",
      "total_reactions": 0,
      "user": "aaronpaul121"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "After a bad second part Pixar surprises us with a film only comparable with other pixar films. Second parts were never good, but this 3rd part is as good as the first one. One important thing, don't think on it as a children film, cause it's not!",
      "total_reactions": 0,
      "user": "jorgesro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "And what a message. I feel sorry for the adults who labeled Toy Story 3 a \"kid's stuff\" immediately and didn't take the chance to see it. It may seem like an already familiar description, but Toy Story 3's astonishing mish-mash of humor, suspense and emotion is for everyone. And has an animated film lately ever touched your heart so deeply? With every Pixar film, the heartache hurts more and more. But oh, what sweet heartache! I don't know about you but it sure did pierce right through me.",
      "total_reactions": 0,
      "user": "itz_giological"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "Disney Pixar have done it again with a new installment of Toy Story 3. With Woody and Buzz leading the gang on another adventure they find themselves in terrifying positions where escaping seems almost impossible. But as many lovers of the family feel good movie will know, Andy's toys break free and make it home to say goodbye. It truly is a beautiful way to say \"the end\".",
      "total_reactions": 0,
      "user": "ChristieJade"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "This film was one of the greatest films I saw in 2010. It was well thought out, with an amazing display of voice acting and animation quality. But a warning to those who wish to see it: It has what is easily a contender for saddest moment in movie history.",
      "total_reactions": 0,
      "user": "MrCinnamon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "I love the film but I give it a 7 but I will call it overrated. It was a great film but I find the first 2 way better. The guess Lotso reminded of the StinkyPete so it seemed a bit repetitive.",
      "total_reactions": 0,
      "user": "Chrislake94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "Back to the origins, even if this movie doesn't achieve as much as the first one, it is still a great movie.",
      "total_reactions": 0,
      "user": "Phoenixeuhouai"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "Toy Story 3 is one of the most captivating films I have ever seen in my life. It is one of the most epic animated adventures you will find anywhere in any movie.",
      "total_reactions": 0,
      "user": "pwnstar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "Beautiful film! As I grew up watching the prequels to this, I was so excited when its pre-production was finished and  the film confirmed; and it was not a disappointment! The film leaves you with every emotion at its peak and perfect for any age. I didn't think they could beat the original for inventiveness or beat Up for how touching it was. A must see!",
      "total_reactions": 0,
      "user": "Zeolot88"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "Toy Story 3 is my favorite animated film of all time (along with \"Beauty and the Beast\", \"Wall-E\" and \"The Lion King\").  It's incredible how its magic transcends ages and can entertain both kids and adults. 16 years after the release of the first film the trilogy hasn't lost its appeal and much less its freshness.",
      "total_reactions": 0,
      "user": "Potter17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "The greatest animated film of all time. And one of the best movies of 2010. Absolutely heartwarming, and breaking. Unique, brilliant, and just breathtakingly beautiful.",
      "total_reactions": 0,
      "user": "zizzoT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "This is a fantastic animation, easily one of the best of all time. The voice overs were excellent, storyline good and the animation brilliant! A great movie for the kids, but adults may enjoy it also. There is lot's of funny moments and it is a movie that can be enjoyed by everyone.",
      "total_reactions": 0,
      "user": "MediaCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "TOY STORY 3 is a fun, colorful, cute and funny sequel to the fantastic TOY STORY that is just as good, or maybe even better than the previous film. The cast does a great job to provide the voices for the film.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Toy Story 3 has managed to do something very special, it has managed to surpass Toy Story 1 in terms of quality, moving up to become my favorite Pixar film to date. It has quite possibly the best plot in a film I have ever seen, the comedy is completely perfect and everything about it is just so perfect. I dunno what my favorite film is, but this is a serious contender.",
      "total_reactions": 0,
      "user": "Happymonk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "Best Kids Movie Ever",
      "total_reactions": 0,
      "user": "Willaco456"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "I knew there would be a Toy Story 3 eventually and in 2010 I finally got my wish. It has just about everything you could want from an animated movie: Honest emotion, creative storytelling, and great characters.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "This movie was just simply outstanding. I grew up with the original Toy Story & Toy Story 2 & even though there's about a decade between this movie & the second one, it sure as heck proves that not all things decay in quality with time. This movie was just.......amazing, though the word \"amazing\" is still an understatement. Don't pass up this movie, though it may be about toys, it's about more than just that. This movie was extremely well done & well written, this is by far the best Pixar movie made to date. The ending actually brought me to tears, and I'm not one to cry so easily at all especially at an animated movie. This movie features some amazing storytelling, interesting (but in a good way) new characters and a feeling at the end both kids and adults will share at the end. If you haven't seen this movie yet, you absolutely need to.",
      "total_reactions": 0,
      "user": "SaturnPhoenix"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "With all the great movies that released in 2010, this was the true best picture. The film is smart, funny, sad, and apart from being one of the most entertaining films to release, it is a true masterpiece in every aspect. Especially to someone who grew up watching the toy story films as a child, this is a film that will definitely hit close to home. It has set a bar that I'm afraid no other animated feature film (or many feature films) will be able to reach.",
      "total_reactions": 0,
      "user": "z4n3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2015
      },
      "score": 10,
      "text": "Toy Story 3 is an amazing sequel to a already fantastic series. Go on another adventure with Woody and other Toy friends as they go through a new aspect of Andy's life - one that will question their existence and venture off in uncharted territory! Although some characters are missing from previous movies - the new characters make up for the missing and a interesting twist to the end will make you wanting for more.",
      "total_reactions": 0,
      "user": "BasilZero"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "Eleven years and countless rumours later, Toy Story 3 was finally unveiled, and it was undoubtedly worth every last minute of that decade and a year to not only bring us one of the best animated features we have ever seen, but one of the most touching and wipe-your-eyes drama that very few films can do.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "I love this film. I was a Toy Story fan when I was 5,6 years old, and when I watched this movie at the age of 12, I felt I was going through the time, although in my opinion, this movie is even better. I love the new characters, because they are very different. I also like the ending. 10 out of 10 marks because it's perfect",
      "total_reactions": 0,
      "user": "brunogabriele"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "This was the best one, because it was the darkest. I mean, it features everybody's favorite animate toys holding hands in the face of a roaring inferno, solemnly accepting their (apparent) demise. Not to mention, the villain is seriously one of the most messed-up characters I've seen in a Disney movie. Who could argue?",
      "total_reactions": 0,
      "user": "Aquophis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "There couldn't be a more fitting end to this series then this film. The intro alone had me in tears because I grew up with this series and to see the scenes of Andy growing up with his toys reminded me so much of my own childhood, I couldn't help but get emotional. Such a great and touching film, A must see.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "Fifteen years after Pixar debuted Toy Story to the world, we have a second sequel which nearly surpasses both of its predecessors. Toy Story 3 is a heartwarming journey that you are destined to enjoy.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "What can I say about this animated masterpiece that hasn't already been said? The animation is breath-taking; the characters are just as lovable and memorable as they were in the previous Toy Story films; it has a very nostalgic feel to it; there is an excellent balance of humor and action; and the story is heart-breaking, yet brilliant. Toy Story 3 is an easy 10/10, and I give it my highest recommendation (just be sure to have a box of tissues with you when you watch it).",
      "total_reactions": 0,
      "user": "FlutterPie93"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "First off, this a 9.5 out of 10. I honestly didn't think I would like it as much as I did. It so good. Always been a fan when I was a little kid, and this was just so good. story is real good. Funny sometimes, and sad in others. Acting good, and so is the score. Animation is beautiful. Overall, if this is the end, it went out great. For sure best toy story, and probably the best animated family move ever. Highly recommended.",
      "total_reactions": 0,
      "user": "Juanolo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "Toy Story 3 was deep but not as deep as the first to movies. Toy Story 3 continues talking about what Toy Story 2 started talking about, the meaning of a toys life. When Andy grows up the toys go to a daycare, which is kind of like an orphanage to humans, it's where toys go who no longer have owners. When they get to daycare it's more like a prison, they even have a \"box\" just like a prison. Again like Toy Story 2 there was not enough of Woody and Buzz together. I would love to see an adventure with the buddies together by each others side. The ending was wonderful when it showed the picture of Andy and his toys, it was very touching. When Andy pulls Woody away from Bonnie, he shows the toys he loves them but cant give them the attention they need. More sexual references add to the fun, especially the scene with Rex and Trixie on the computer. Great movie, I hope to see more of Woody and the gang.",
      "total_reactions": 0,
      "user": "Movieblood9"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "This is a rare second sequel that beats both its predecessors and it's just awesome. The film is darker compared to the previous two, but I've got nothing to complain. It was intense, deeply emotional, and it was kinda sad. This movie is my favorite Pixar film of all time.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "Truly amazing and funny. We haven't seen Woody and friends since 1999. This movie brought everyone back together and had a grown up Andy going to collage, he didn't want to leave his \"toy friends\" behind. This movie is impressive and the ending was heartbreaking. It actually  made me cry.",
      "total_reactions": 0,
      "user": "masterbob5"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "this is the best toy story. And best pixar film. And best film of 2010. This movie is so fantastic its so amazing. the animation was breath taking and story was fantastic. the movie was just a pure masterpiece",
      "total_reactions": 0,
      "user": "Trickyeddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "Marvelously animated, Toy Story 3 brilliantly channels what made the originals so great, while adding in enough new experiences, both toy-wise and life-wise, to make the film just as fresh and relevant as ever. Fantastically crafting excitement, new characters, and emotion, Toy Story 3 is a joyous experience that matches the quality of the originals and brilliantly grew up with its audience. Not only is the animation wonderful, but so is the writing, direction, and voice acting, all of which perfectly characterize its characters and entertain the audience at the same time. Overall, Toy Story 3 is fantastic film that exemplifies all that makes Pixar great.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "A heartwarming and hilarious movie experience. This movie goes infinity and beyond",
      "total_reactions": 0,
      "user": "dante_finn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "The only real flaw for this movie... Hmmm, are there not any flaws? Nope! This movie is a classic in my book. Marvelous, magical, and endearing...almost flawless!",
      "total_reactions": 0,
      "user": "JawsLaxerDrama"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "It is without doubt the best film in the franchise, Toy Story is a magical animation, incredibly exciting and exhausting, and of course is to get out tears from her eyes.",
      "total_reactions": 0,
      "user": "Iky009"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "*sniff* *sniff*...What? Shut up! I'm not crying!...F**king Pixar...",
      "total_reactions": 0,
      "user": "YoursTruly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Problably the best Animated movie ever made in my mind and the the best in the Toy Story trilogy as well as making its mark as one of the greatest films of all time. Toy Story 3 is Pixars 3rd sequel of the movie that made there company famous throughout the globe, and Toy Story 3 marks them to there highest achivement since the first Toy Story movie. This film touches your heart on so many levels and creates a felling of sadness you will never forget, but also creates a felling of having one of the happiest moments in your life. you must see this film no excuses.",
      "total_reactions": 0,
      "user": "dreweastwood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "This film is absolutely perfect! Perfect not only in the way it was the perfect ending to the Toy Story trilogy, but perfect as a film in general. Every second was so deep and meaningful beyond belief, it's means much more than just the animation. Brilliant!",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "A great, heartwarming film. Although it's not quite as good as the first two movies, but it's still very enjoyable. due to a great plot and excellent animation.",
      "total_reactions": 0,
      "user": "DSilver"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "Such a beautiful movie. We are know that the toys followed us when we were a child. This movies made toys come alive. This movies made us reminded when we were a child and how we felt when we loves toys",
      "total_reactions": 0,
      "user": "hacmiu36"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "It closes the circle as one of the greatest movie trilogies of all time, for me at least. I was somewhat anxious how this would turn out but I should have trusted that Pixar is full of talented storytellers. It's hard to pick which movies in the series is my favorite but they are equally great.",
      "total_reactions": 0,
      "user": "Weaselboyst"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "[9.6] All of the spectacle and magnificence of a great kid's movie aren't what makes Toy Story 3. The last movie of the trilogy truly solidifies the life and importance of toys, and not just as objects.",
      "total_reactions": 0,
      "user": "ncstatemike"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "Still my favourite Pixar movie of all time, it's rare that a sequel gets this amount of praise but toy story 3 is better than it's predecessors buy a country mile. The adventure feels more open door, the humour is conversational and you will get it each time, no matter what age. The bad guy in this movie was not goofy and felt dark enough that it wouldn't frighten 9 year olds, but not appear as some cliche **** with large eyes and slapstick every second. Best pixar movie so far and best animated film I have ever seen.",
      "total_reactions": 0,
      "user": "TrilobiteG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "Only film I would be glad enough to give a 10 are animated films. This made me and my friends laught, cry and everything, and were ranging from age 16-23 where not even the target audience for this film. I do say that this film was the best of 2010 and I really can't wait to see a fourth one hopefully. I do believe that the \"Toy Story\" film series has been the only film series where every film has 2 stars. Its a shame that I can't find the second one. When I told you to watch a film before I have never been a serious as right now this is a film that I can watch probably 5 straight times in a row everyday of the week. It might be a little scary at points but it definintly makes you want to find out more. Also I know this movie has 3D DVD's that was the only thing bad with this film and 2010. Apparently in 2010 the though in every film maker was 3D. No I can only say that Tron Legacy and Step Up 3D were the only really good 3D films of 2010 but enough of that this is a must see all ages.",
      "total_reactions": 0,
      "user": "MarkMusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "A wonderful close to Pixar's \"Toy Story\" series.",
      "total_reactions": 0,
      "user": "sil3nt_nick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "Not only the best of the three, but the saddest and tragic Pixar movie of them all! It's an end to a beloved childhood for me, but the memories live on in this outstanding animated classic! Overall, Pixar's greatest accomplishment! Once again, it deserves an A+!",
      "total_reactions": 0,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "This is a very good movie.",
      "total_reactions": 0,
      "user": "Inlikeflynn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "I loved Toy Story 2 & 1.",
      "total_reactions": 0,
      "user": "RBJC"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "Toy Story 3 tops Toy Story  and Toy Story 2, it is described with one great description, I usually use it for rare things, but this movie, it deserves it, the word is \"Imaginative  Masterwork\"  \"Masterpiece\"",
      "total_reactions": 0,
      "user": "AReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "\"Toy Story 3\" is one that mixes humor, beautiful animation, heart, top notch storytelling and characters, into a second sequel, which works wonderfully. \"Toy Story 3\" involves a new adventure and the saddening message of growing up, which in my eyes, ranks to one of the best movies of 2010.",
      "total_reactions": 0,
      "user": "jeff_reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2014
      },
      "score": 9,
      "text": "Toy Story 3 takes what made toy story 1 and 2 so good and added on to it. The movie feels like it grew up with the audience of the original 2 movies. There is really nothing that i can say negative about this movie.",
      "total_reactions": 0,
      "user": "TheDarkKnight22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2016
      },
      "score": 10,
      "text": "\"This is IT, people! The moment where Pixar finally crumbles! They already have a lot to live up to, what with 'Up' getting an Academy Award nomination for Best Picture, and this being the first 'Toy Story' film in 11 years. There is NO WAY this will succeed. IT JUST WON'T!\"",
      "total_reactions": 0,
      "user": "FreedomFighters"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "thisis the second best film in the atual era ofthe walt disney pixar animation studios behind up.the return of that old characters of the first toy story was absolutely dramatic.",
      "total_reactions": 0,
      "user": "joao1198pedro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Toy Story 3 caps off a legendary series.",
      "total_reactions": 0,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "I first saw this before I had children and thought it was great.  I recently watched it again with my 3 year old daughter and I think the ending is one of the most beautiful endings of any movie that I have ever seen, I was in tears.",
      "total_reactions": 0,
      "user": "ibadukefan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Disney always does a good job of closing the book on their franchises and Toy Story 3 only further proves that. What a great way to close the book (although now we know the crew is returning for a 4th film). Toy Story 3 introduced the loveable characters to a new generation of children and all the children who watched the original as children when it came out had to see how story would end, you can't say that about most animated movie franchises. Toy Story 3 also has the most dramatic endings in the history of film not just animated movies and its just as great throughout as the other two films and Toy Story may really be the best trilogy of all time, it belongs up there with the original Star Wars trilogy and the Dark Knight films.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "Groundbreaking is the best word to describe this film, it steps forward in terms of it's story telling, and is arguably better than the first 2 films. It's also a lot darker than the other 2 and has a much more haunting quality to it. The ending is such a great conclusion to the franchise and wraps up everything nicely. It shows that when it comes to Toy Story, Pixar never loses it.",
      "total_reactions": 0,
      "user": "Delaforce828"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "Toy Story 3 is a comical new adventure in Disney Digital 3D that lands the toys in a room full of untamed tots who can't wait to get their sticky little fingers on these \"new\" toys. It's pandemonium as they try to stay together, ensuring \"no toy gets left behind.\" Meanwhile, Barbie comes face to plastic face with Ken (yes, that Ken).",
      "total_reactions": 0,
      "user": "SythusRATINGS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "At first, when I thought about this movie becoming a thing, I thought Pixar was going to Godfather it. But when I left that theatre, I wasn't disappointed (I was in tears), I was amazed at how well the trilogy ended.",
      "total_reactions": 0,
      "user": "XandWacky"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "Good thing they just announced a Toy Story 4 because I have not got enough of his franchise! This is the best Toy Story film to date with the best cast of characters yet as well as the best visuals the series has seen!",
      "total_reactions": 0,
      "user": "DBPirate1129"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "It's good, but nothing great for me, I still think it's good and it definitly is better than most thirds. But for me it's not really the masterpiece everybody puts it out to be.",
      "total_reactions": 0,
      "user": "Mediawatcher"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "The only thing that I didn't care for in this movie was the fact that Mom was moving Andy out - for good.  He didn't have a room to come back to. The story line, visual effects and let's not forget the characters held my interest, and I'm 58 years old.  I've watched it two gazillion times with my grandchildren and I'm still not tired of it.",
      "total_reactions": 0,
      "user": "swish1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Simply an Instant Classic. The best of the 3 movies story wise and visually amazing.",
      "total_reactions": 0,
      "user": "UnKn0wN_DiSeAsE"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "'Toy Story 3' isn't quite as good as the first two movies, however, that doesn't stop it from being entertaining, and, in my opinion, being one of the best franchises of all time (notice how I didn't say \"animated\").",
      "total_reactions": 0,
      "user": "MrMovieBuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "It is a very good movie and most of the critics are right. BUT there was one thing that really stuck out to me. I cant believe i am the only one who noticed that.",
      "total_reactions": 0,
      "user": "Sueyzid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "I loved this movie to death. It had heart, emotion, humor and a great adventure. This is truly the best animated film I've seen this year. It's a fun adventure and likeable characters",
      "total_reactions": 0,
      "user": "iluvsports"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "The greatest animated sequel ever made!",
      "total_reactions": 0,
      "user": "VinceRocks123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "toy story 3 is the best animated film ever and the best Pixar film ever. the movie is like a goodbye childhood kind of movie it's for the people would watched the other to movies.",
      "total_reactions": 0,
      "user": "teddyluke"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "After years of being stowed in Andy’s toy chest, the time has finally come for Woody (Hanks), Buzz (Allen) and friends to move on. But after they’re welcomed to Sunnyside Daycare Centre by the kindly Lots-O’-Huggin’ Bear (Beatty) they realise this seeming toy’s paradise is actually something closer to hell...",
      "total_reactions": 0,
      "user": "FilmMaster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "Pixar has done it again, extending an amazing streak of successes that stretches all the way back to the original Toy Story, which changed the face of feature length animation when it reached theaters in 1995. Now, 15 years after their original debut and 11 years after the first sequel, Toy Story 2, Woody (voice of Tom Hanks), Buzz (Tim Allen), and their fellow toys have returned to the screen for another adventure. Although aspects of Toy Story 3 echo similar elements from the previous films, making this the least original entry in the trilogy, the movie's final act will resonate deeply with many viewers, making this chapter in many ways the most heartfelt.",
      "total_reactions": 0,
      "user": "MovieManiac83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2016
      },
      "score": 9,
      "text": "Andy outgrows his anthropomorphic amigos Buzz and Woody in “Toy Story 3,” the franchise’s third (and final?) installment — and as it turns out, 15 years after launching the computer-animated toon revolution, Pixar has outgrown them, too. Whereas “Toy Story 2” treated auds to a character-based sequel that handily justified its existence, this tertiary adventure delivers welcome yet nonessential fun, landing well after its creators have grown up and succeeded toying with more sophisticated stories. Nevertheless, the stereoscopic 3D release, which reportedly out-tested all of Pixar’s previous efforts, should dominate summer playdates.",
      "total_reactions": 0,
      "user": "moviemaniacs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "Pixar has done it again, extending an amazing streak of successes that stretches all the way back to the original Toy Story, which changed the face of feature length animation when it reached theaters in 1995. Now, 15 years after their original debut and 11 years after the first sequel, Toy Story 2, Woody (voice of Tom Hanks), Buzz (Tim Allen), and their fellow toys have returned to the screen for another adventure. Although aspects of Toy Story 3 echo similar elements from the previous films, making this the least original entry in the trilogy, the movie's final act will resonate deeply with many viewers, making this chapter in many ways the most heartfelt.",
      "total_reactions": 0,
      "user": "CinemaSins"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "Pixar is literally the best studio ever for an animated movie! This is one of my all-time favorite franchises and I absolutely loved this film. Great script, even better than the originals, and was fun to watch.",
      "total_reactions": 0,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "French review: La première partie du film pose une intrigue de fou, la seconde partie du film va de rebondissement en rebondissement et nous accroche à notre siège avec de la super glue. Je n'ai pas autant aimé les 2 autres premiers films sur ces jouets, d'autant que les personnages manquaient, selon moi, d'un petit quelque chose pouvant les rendre intéressant mais là, dans ce film en particulier et plus que dans les deux autres, ils ont exploités leur capacités en tant que jouet à fond la caisse, les attaques, les tentatives de libération, leur plans pour s'en sortir... tout est génial! Toutes les idées sont bonnes et s'enchainent seconde après seconde, c'est fou, j'ai été bluffé devant tant d'originalité. Bravo!",
      "total_reactions": 0,
      "user": "Tiwoof"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "Blending vibrantly good animation, humour, some powerful emotion, and great storytelling, Toy Story 3 serves as a modern cinematic masterpiece that will go down in history as one of the greatest film achievements of all time. While The Toy Story Trilogy currently stands as the greatest trilogy in history.",
      "total_reactions": 0,
      "user": "Tdavidwalrus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2015
      },
      "score": 9,
      "text": "The third story of Toy Story was very moving and amazing , a great story in the nursery, and a touching final scene is saved when Andy and man gives the girl her toys , almost makes me cry , but it has really been a hit of duo ' ' DISNEY- PIXAR ' ' .",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2016
      },
      "score": 10,
      "text": "The Third installment of the Toy Story franchise is a fantastic movie that delivers a powerful story with a touching scene that would make viewers react. Overall, a fantastic movie.",
      "total_reactions": 0,
      "user": "geo333"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "In filmmaking, it's really hard to make a sequel that's as good as the first. It's even harder to make a third that's just as good as both. But Pixar have achieved it. TS3 is one of those movies that's guaranteed to reduce you to a crying mess by the end, without being overly sentimental. It's a great way to close the Woody-Andy story. Now that Toy Story 4 will resolve the Woody and Bo Peep story, the question remains-can they do the impossible and make the fourth as good as the first three? If it is, you can guarantee I'll be seeing it. An amazing movie, I'm so glad we're getting one more movie in this astounding franchise.",
      "total_reactions": 0,
      "user": "DanBurrito"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2015
      },
      "score": 9,
      "text": "This film made me cry! I wasn't expecting the end, I noticed there will be a 4, I want to see a new story with Bonnie, although it was OK with 3 films. I'll miss Andy :(",
      "total_reactions": 0,
      "user": "diegonelli"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2016
      },
      "score": 10,
      "text": "11 years to wait and finally with has Toy Story 3. The most fantastic sequel of the triology. And like everyone, i love it. Not just they steal has that simpson comedy,  but also it has drama for those one who rices for Toy Story 1 and 2.  The villian its great, the new characters are great, the new animation is also great and the ending you going to cry like everyone else. Toy Story 3 its another great sequel for a studio of big ideas...except for Cars 2.",
      "total_reactions": 0,
      "user": "CriticFer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2015
      },
      "score": 9,
      "text": "Уже не настолько мудрый, жизненный и прекрасный мультфильм, какими были первые две части, но всё ещё неплохой и интересный. Смотрите, не пожалеете точно.",
      "total_reactions": 0,
      "user": "GonzoDiamond"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "Let’s go out on a high note! says Buzz Lightyear near the start of Toy Story 3 , a line that not only casts an air of finality over Pixar’s 11th opus but also throws down the gauntlet to director Lee Unkrich and his team.",
      "total_reactions": 0,
      "user": "MovieManiac1994"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "WHAT I LIKED: Another sequel that works from the Toy Story franchise, it's third is an attempt to add more plot (and darkness) to the franchise. This certainly works and as a result makes the adventure all the more exciting and the ending all the more emotional",
      "total_reactions": 0,
      "user": "BarneyOnMT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "The first two films in Pixar's animated Toy Story franchise are brilliant bookends, models of technique warmed by humor and imagination. Toy Story 3, coming 11 years after the last one, should have been a letdown. I mean, how hard can you squeeze a golden goose before the bird calls a work stoppage?",
      "total_reactions": 0,
      "user": "FilmMasterEd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2016
      },
      "score": 9,
      "text": "With toy story 3 remaining just as good as the first one, it offers the most emotional story, as well as pixar giving us another classic. Plus it also gives us a new cast of characters who are really likeable.",
      "total_reactions": 0,
      "user": "gameguardian21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "Toy story 3 is the long awaited threequel to the toy story franchise which no one thought would be good. Onto the good points, toy story 3 explores a different territory than the other films, what happens when Andy grows up. Not only that, but there is great new characters added too. Another good point is that the animation improves just like it has in every Pixar movie. However like any movie, it has some problems. I feel like some plot elements were taken from toy story 2, so some factors made me feel like id seen it before. And the plot twist about the villain was expected again. Altogether toy story 3 blew everyone's minds as everyone thought it would be bad. (Woo! Amazing!)",
      "total_reactions": 0,
      "user": "Jarody"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2016
      },
      "score": 9,
      "text": "After a decade-plus absence, the toys are back in town, and boy are they a sight for sore, 3D-beaten eyes.",
      "total_reactions": 0,
      "user": "FilmClub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2016
      },
      "score": 9,
      "text": "La tercera entrega transcurre varios años despues y pierde un poco la esencia de las dos primeras.",
      "total_reactions": 0,
      "user": "Venom37"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2016
      },
      "score": 10,
      "text": "An exceptional conclusion, Toy Story 3 improves on its predecessors with unique and charming characters, massive growth in maturity, and an emotional and powerful finale.",
      "total_reactions": 0,
      "user": "Muskrat147"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2016
      },
      "score": 9,
      "text": "This is a amazing movie not just for kids but for adult also. This might be my favorite movie out of the three movies. It's heartwarming, fun and a amazing movie.",
      "total_reactions": 0,
      "user": "reviewfrom19842"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2016
      },
      "score": 10,
      "text": "Fantástico! Incrível! Nos mostra o quanto o tempo passa e infelizmente precisamos crescer. Já se tornou uma obra-prima cinematográfica. Recomendo com toda certeza!",
      "total_reactions": 0,
      "user": "luansuarez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2016
      },
      "score": 7,
      "text": "Seems magical in some level. Sequels can be difficult to write and direct in case you don't know what your doing but Toy Story did well with an element of toys and expreiences of sequels.",
      "total_reactions": 0,
      "user": "g"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2017
      },
      "score": 9,
      "text": "A return to the stellar form of the series and a good indicator of the quality of Toy Story 4, this film gives many laughs and life long lessons, with a small dose of ex machina to boot.",
      "total_reactions": 0,
      "user": "Henry_b1"
    }
  ]
}