{
  "mc_avg_user_score": 7.2,
  "mc_metascore": 45,
  "mc_mixed_rating_frequency": 10,
  "mc_movie_name": "Tracers",
  "mc_negative_rating_frequency": 4,
  "mc_positive_rating_frequency": 18,
  "mc_pro_critic_reviews": [
    {
      "critic": "Michael Rechtshaffen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "As long as it shuts up and keeps moving, Tracers makes for a sufficiently diverting, not to mention zero-emission, vehicle."
    },
    {
      "critic": "Nicolas Rapold",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "Corny twists and exchanges ensue in the wobbly story, but, delightfully, Daniel Benmayor’s film shows love not just for stunts but for the dynamic surfaces of the city."
    },
    {
      "critic": "James Rocchi",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 60,
      "summary": "The action is shot far better than it is in most Marvel movies, with clarity in the framing and a fluid skill to the cutting."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 60,
      "summary": "While Lautner is to be admired for his physical commitment to the role, the below-the-line team lighting, shooting and choreographing his moves deserves equal credit. The film wouldn’t have worked without such a versatile team, which otherwise operates without a trace."
    },
    {
      "critic": "Jesse Hassenger",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 58,
      "summary": "Tracers, then, is unavoidably a movie about Taylor Lautner joining a parkour gang, and often exactly as silly as that sounds. But it’s also a major improvement over Lautner’s last action-thriller, \"Abduction,\" which had little action, few thrills, and zero abductions."
    },
    {
      "critic": "Brad Wheeler",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "With escape as its theme, this thin-plotted pleaser comes hard and goes fast, its rush premium but fleeting."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "It goes about its idiotic business swiftly and efficiently, which is about all you can ask for from this manner of silliness. It never goes anywhere worthwhile, but at least it doesn’t take too long to get there."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "Like Cam, Tracers is fun to look at, if not too bright, and even includes a line I can only assume is a winking reference to Lautner’s claim to fame: “There can only be one alpha in every pack.”"
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "The lusterless camerawork keys itself almost empathetically to the drab reality of the film's spaces, settled and unsettled alike, but it can't enliven the hackneyed plot."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "The Point Break-style plotline is merely an excuse for an endless series of scenes showing off the parkour practitioners in action."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2015
      },
      "score": 38,
      "summary": "It’s a stunt-heavy chase picture with some arresting camera work, but not much else to recommend it."
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 30,
      "summary": "Tracers is a tedious, clichéd slog from start to finish, and only briefly enlivened by two prolonged chases in which handheld cameras maintain intense proximity to their subjects."
    },
    {
      "critic": "Stephen Whitty",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 20,
      "summary": "True, the energy level is high, and there are some pretty faces and toned bodies. But Tracers cannot live by pecs appeal alone. And pretty soon, Lautner won’t be able to, either."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "Tracers is confident when it leaps through obstacles, but the tiresome screenplay and uninteresting personalities prevent it from reaching any plateau. This is one of rare movies that attempts to mix extreme sport and drama thriller. The odd concept doesn't necessarily deliver a good spectacle, and as expected, Tracers falls short by the same issue. While it boasts well-choreographed freerun sequences and authentic cinematography of the city, its narrative is too convoluted that the movie just feels inorganic despite the best effort from visual department.",
      "total_reactions": 3,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "Taylor Lautner may always be remembered as Jacob, the annoying werewolf boy from the Twilight Series. People have a hard time seeing him as anything else, but Tracers is the second action film I've seen him star in, and this kid has the perfect make up to be a huge action star. Lautner is more than just another good looking actor, as he can speak several languages, is a martial arts expert, and an avid parkourer, all skills he uses in his latest film, Tracers. Lautner plays Cam, a down on his luck bike messenger, who comes to befriend a group of parkour enthusiasts. What they do fascinates Cam and he wants to join them, but when he does, he realizes that they aren't just clowning around, they use their skills to commit crime, and once he's in, Cam has no way out. Original action films are hard to come by, as most people are satisfied with all the special effects and dead bodies. It's a genre that really doesn't call for originality, that's why when you come across a film like this, it's a breath of fresh air. The stunts and moves you see in this film are nothing short of magic, and it's star Taylor Lautner did them all himself. We are so used to seeing Lautner as the sensitive love interest in some romanticized film, that it's hard to even imagine him as an action star, but that changes 10 minutes into this film. It's the stunts, the attitude, his characters whole personality, that makes his a unique a-typical action star, and it is really something to see. On the surface, Tracers may be nothing more than another story about a group of burglars, but what they can do is extraordinary, and was really fun to watch. This film is original, fast paced, and brings to light a new action star, who isn't in his sixties or the WWE. It may not have all the bodies and explosions normally associated with this type of film, but as I said, It was a lot of fun to watch.",
      "total_reactions": 1,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2015
      },
      "score": 6,
      "text": "Twilight co-star Taylor Lautner stars in 'Tracers,' a film about Parkouring - the art of being able to do leaps and bounds with physical prowess.",
      "total_reactions": 1,
      "user": "Timbaros"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "A good movie. Tracers is an action movie that moves well when it's moving. The parkour was fun to watch and I liked the characters. Daniel Benmayor gave me exactly what I expected from this film... some lightweight, yet satisfying thrills and action.",
      "total_reactions": 1,
      "user": "FlickLover"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "Awful movie which damages the Parkour community in so many ways. Police/security will be hot on us more now, it doesn't show the true spirit of Parkour too. Little fact - The title is spelt wrong! It's supposed to be spelt \"Traceurs\".",
      "total_reactions": 2,
      "user": "WooxyWan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "Recycled theme with the bike and Parkour stunts.",
      "total_reactions": 0,
      "user": "LeZee"
    }
  ]
}