{
  "mc_avg_user_score": 5.4,
  "mc_metascore": 35,
  "mc_mixed_rating_frequency": 266,
  "mc_movie_name": "Transformers: Revenge of the Fallen",
  "mc_negative_rating_frequency": 544,
  "mc_positive_rating_frequency": 644,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2010
      },
      "score": 2,
      "text": "Why is it that all these 2 1/2 hour long Michael Bay films feel like they're 4 or 5 hours long? It never ends with the and badly edited action scenes full of clunky-CGI , and the terrible humor, the incomprehensible plot, and the shallow characters both human and robot that I could never care much about. It goes on and on and on, and was overstaying it's welcome for me at about the hour mark. There are few amusing moments, some sparks of a decent special effects scene, but for the most part it's just a bunch mindless dribble that serves no purpose I can think of, not even on the basic level of entertainment for anyone above the age of 14 or so.",
      "total_reactions": 2,
      "user": "Christopher_G2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2011
      },
      "score": 0,
      "text": "Frankly, how bad could it be? Critics rip it to shreds, calling dumb, loud, and stupid, but it's a movie about giant robots smashing each other, so what did you expect? I expect Michael Bay to acknowledge that humans traditionally have brains. That's the problem with Transformers 2. You can complain all you want about the racist robots, the lame dialogue, the annoying human characters, and overstuffed action sequences, but it all comes down to one central problem. Yes, we all expected Transformers 2 to be loud, dumb, and stupid. The problem is that it is simply TOO loud, dumb, and stupid. It is loud, dumb, and stupid to the degree that it actually feels insulting as you watch it. The anger that possessed me during Transformers 2 was almost too much to bear. The idea that Michael Bay actually thinks we as a human race will tolerate something this stupid.",
      "total_reactions": 2,
      "user": "J-Shap"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "This is an embarrassing script for all Transformer fans.  The film looks good with its big budget, but by the end of this film you just don't care about anything.",
      "total_reactions": 2,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 0,
      "text": "This movie sucks optimus prime's balls, and the storyline is crap. Who would in their right mind watch a long ass movie that only thing that made this movie alot of money is Megan Fox and great graphics.",
      "total_reactions": 1,
      "user": "jAbMaN"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "Revenge of the Fallen is beyond stupid with some of the dumbest characters ever put on screen. Acting was pitiful. Story complete garbage, if there was even one, coupled with racism everywhere in the film. Nothing could be worst for Michael bay who has just added another terrible movie to his resume.",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 0,
      "text": "Another witless attempt at moviemaking from the always terrible Michael Bay. The first Transformers wasn't even that bad, at least not until the end, but this plotless recreation is a complete disaster. It could be the worst movie of the past twenty years.",
      "total_reactions": 1,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "It's a bad movie. A huge Dissapoint film. First of all the VFX dazzles your mind and gives you headaches and migraines! If James Cameron and Uwe Boll made a stink pile it would be still better. No point, no story and no meaning! Tis film is one of the VFX crap Hollywood produces and Micheal Bay, oh my goodness! This great director is going for some s*** in movie history! I am fed up of stupid sequels! Give us new stuff man! It stands no choice against the batted good film Transformers and its worse than Dark of the Moon,",
      "total_reactions": 1,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2015
      },
      "score": 5,
      "text": "Seriously guys, after the first movie, isn't it obvious that you wont get any plot here? You know it, you saw the reviews, so why you went to watch this movie and say now - BREAKING NEWS, there is no plot! Thank you Capitans. For others who enjoy twisting metal and explosions the movie is not actually that bad, worth watching for single time.",
      "total_reactions": 1,
      "user": "Violett"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2011
      },
      "score": 4,
      "text": "\"Transformers: Revenge of the Fallen\" lacks the mind-blowing blockbuster spirit \"Transformers\" originally had. All you can see is  messy clunky robots fighting with amazingly terrible cinematography followed by a brainlessly written script.",
      "total_reactions": 13,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2010
      },
      "score": 0,
      "text": "This is, without exaggeration, the absolute worst movie I have seen in the last ten years. Not only because it's a million kinds of awful, but because of what it represents. Transformers: Revenge of the Fallen symbolizes not just everything condescending, cynical, and soulless in Hollywood, it stands as a testament to sub-crustal standards and the triumph of a strong marketing campaign over effort, talent and vision. Batman and Robin has been dethroned.",
      "total_reactions": 9,
      "user": "MikeK"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "The first Transformers was enjoyable, fill with action and hot Megan Fox, but unrealistic, repetitive segments and dumb humor, I rate that one: 6.8/10. The Tranformers cast and crew return for another adventure, overall don't waste your money buying this, it's a fair rental movie to kill the night. In this one, everything is repeated with added negativity. The enjoyable story from the last one gets replaced by just focusing on hot, but terrible actor Megan Fox and so called \"Mr. Hotshot\" Shia LeBeouf who is more worst at acting. 100% unrealistic, repetitive segments and sayings and the ending turns into some kind of soap opera. I rate this one: 5.5/10 Somebody please fire Michael Bay.",
      "total_reactions": 6,
      "user": "ps3gamer181"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2010
      },
      "score": 0,
      "text": "i hated this movie. absolutely terrible. wether its the absolutely terrible \"humor\" sequences, the obscured, boring fights, or the stereotyped robots, there isnt a single redeeming quality in this \"blockbuster sequel\" of a movie and deserves nothing but 0 as a movie, and as a form of an example of a terrible movie.",
      "total_reactions": 5,
      "user": "bubba"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2011
      },
      "score": 2,
      "text": "The original Transformers was a flawed movie, sure, but it was very fun with a decent script to make Transformers fit into the modern age of Blockbusters. Transformers Revenge of the Fallen, however, is a mix of computer generated effects, pots and pans clashing together, and vomit. The movie is a mess, from a horrible script, to annoying characters, to mindless explosions and action. Revenge of the Fallen took what worked in the first movie, made those aspects not work as well, and for the aspects that didn't work, made them a thousand times worse!",
      "total_reactions": 5,
      "user": "Moviebuffreview"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "The other day I thought about watching this movie again and got a sour taste in my mouth that I had to wash away with garlic fries and soda. The sad part is that I've known people to pay and watch this movie at least 4 times IN THEATER.",
      "total_reactions": 4,
      "user": "ryancarroll88"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2010
      },
      "score": 0,
      "text": "I can't remember the last time I desparately wanted to walk out of a movie. I felt cheated and insulted by this movie. It's offending to even think that they consider this entertainment, what-more, to charge a full ticket price of this garbage.",
      "total_reactions": 4,
      "user": "KarthXLR"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2012
      },
      "score": 6,
      "text": "The plot was insanely stupid and honestly I felt insulted that they would put something so dumb into script form. The special effects are good (as expected). The cast was solid overall (yes even Megan Fox was fine). It was funny as well, Little bits of humor added through out that imo worked well for the film. It wasnt as bad as the critics say but it wasnt good either.",
      "total_reactions": 4,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "Michael Bay strikes again. Again and again and again and again.",
      "total_reactions": 6,
      "user": "rollingstone82"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "I hated this movie! HATED,HATED,HATED,HATED,HATED THIS MOVIE! IT'S GODAWFUL! IT'S A CURSE,I MEAN IT IS SO SAINT IN HELL! Michael Bay destroy this movie and raping with lots of sexuality and some stereotypes in this horrible movie! HATED!!!",
      "total_reactions": 3,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2011
      },
      "score": 0,
      "text": "If you liked this movie, then what the **** is the matter with you? You must be a ****ing idiot to like this piece of **** I already ****ing hate you if you like it. **** Michael Bay, **** Shia Lebeouf, **** Megan Fox, **** Spielberg, just **** everybody that had anything to do with this **** Even a pizza guy. **** THIS MOVIE!!!!!!!",
      "total_reactions": 3,
      "user": "Justinavery7074"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "There are so many flaws with this movie i wanna put a knife through my chest.  But ill kepp it short.",
      "total_reactions": 3,
      "user": "mATTYrEVENGE"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2012
      },
      "score": 3,
      "text": "Bad storyline. Decent to bad acting. Horrible storyline. Even the special effects (which really aren't that good) can't save this one.",
      "total_reactions": 5,
      "user": "ReviewCritic"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2010
      },
      "score": 3,
      "text": "An absolutely horrible film. Michael Bay should be ashamed that he isn't capable of toning down his over-the-top action, concentrating a LITTLE on the story and, when doing a film marketed to kids, leave out all of the sex, drug and racist material.",
      "total_reactions": 9,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "Firstly, the special effects are incredible and (most) of the action absolutely thrilling, however there is too much of it! This is one film which you really notice the length of while watching it. The humour wasn't very funny either. I loved the first film, but this was very average and it seems a waste of such a huge budget.",
      "total_reactions": 5,
      "user": "Judddy"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 6,
      "text": "Transformers: Revenge of the Fallen is for the most part is what I would have expected from a big budget movie about giant robots beating the sh** out of each other while causing maximum carnage to civilisation. The design of the transformers and the transformations from robot to vehicle mode and vice versa are visually stunning and most of them (especially Optimus Prime and Megatron) are nicely voiced. Megatron is a still a bad ass! Optimus Primes personally is portrayed very well: He's wise and a natual leader. This movie has got pretty much everything an action movie needs: explosions, brawls between the transformers and giant monuments (like pyramids and buildings) and objects blowing up and tumbling down to Earth with a thud. In short this movie is massive in scope with loads of actions scenes. Because this is a movie with a load of fast paced action scenes, this is a movie that needs to be enjoyed on a big cinema style TV with good speakers. The plot is a little bit of a mess: the movie revolves around Sam Whitwicky and he has some information about an energon source hidden on Earth and the nasty transformers (the Deceptions) want to get their hands on him so they can locate it. It follows on from the first Transformers movie and all of the Autobots have taken refuge on Earth searching for what's left of their Deception foes. The biggest trouble with this movie is that there's too much humour in this movie. The transformers, the Twins are pretty much there for the hysterical factor and I don't give a damn about them. They are annoying and clumsy and besides one scene in the movie, don't really help at all. The unnecessarily unfunny scene where Wheelie (a transformer that transforms into a remote control truck) dry humps Mikaela was just wrong. The character Leo was pointless to the storyline. The story at first may seem serious and tense (especially towards the middle of the movie where the Fallen lands on Earth) but the humour dampens the plot. Starscream (the Decepticon, 2nd in command after Megatron) acts like a coward and has a really weird voice; I mean, what happened to his robotic voice from the first movie. It sounded awesome! I guess his voice does fit his character a little bit because he doesn't seem to get involved in too many battles. He watches from the side lines while Megatron and the Fallen do all the heavy stuff (fighting). He's a little bit of a coward basically. Devestator which looks so bad ass and looks like he could level an entire city due to his massive size is only on screen for 30 seconds! I wished he just eat the Twins, spit them out and then play football with them. The Fallen (the main baddie) may seem dangerous looking at him with his skeleton like appearance, spikes protruding out of his body, his ability to teleport and his huge staff but he gets his ass kicked by Optimus Prime at the end in about 40 seconds; so much for an epic finale. I also love Optimus Prime's manners: He's weak and defenceless and can't get up to fight and the injured Jetfire (who is a old cronk by the way) offers him his parts. He sacrifices his parts to Optimus and Optimus now has the strength to fight the Fallen. Optimus doesn't say thank you to Jetfire. He acknowledges Sam for resurrecting him but doesn't thank a old deception (Jetfire) for sacrificing himself to save him. How selfish! On the outside, Transformers: Revenge of the Fallen may seem a fun action movie, I couldn't take it too seriously due to unnecessarily humour and pointless characters. It's watchable but I prefer the first Transformers.",
      "total_reactions": 6,
      "user": "Harry210"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "WHY?! why does this movie have such bad reviews? This movie was epic and amazing. I know it was rushed because of the writers strike and all, but this is Transformers. Anybody watch the original cartoon? It was cheesy, had cheesy humor, but it was awesome, best show ever. This movie went back to the original cartoon with the comedy and action, and the on-going rivalry between Megatron and Optimus. This movie even had soundwave with Ravage too. I am an absolutely diehard Transformers fan and whoever gave this movie a bad review is just blind, deaf or plain old stupid, because this movie was epic. ALOT of action, traditional Transformers story, and good acting from Shia Labeouf, yes I know Megan Fox is a terrible actress but shes absolutely beautiful. Thats mainly what shes there for. This movie was amazing, funny, and EPIC! I love Transformers, I can't wait for the third! 100/10!",
      "total_reactions": 3,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "The story was weak and the humor was just plain silly. But having said that, it is one of my favorite movies. Here's why. The presentation of this movie is flawless. The action is perfect and dazzling. Explosions and metal pieces galore. Many scenes, especially the forest fight scene, play out like a symphony orchestra. So what this movie lacks and screws up, makes up for it 100 fold.",
      "total_reactions": 16,
      "user": "Libra85"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "Revenge of the Fallen continues the movie franchise as the battle between the autobots and decepticons continues. This time, the leader of the fallen plans to take over our world as the autobots once again need the help of Sam Witwicky once again to help them win the battle, but after Optimus Prime gets killed by Megatron, now resurrected and is tracking Sam down to find the Matrix of Leadership which it has the power to resurrect a prime and our heroes must somehow save the world once again.",
      "total_reactions": 4,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "I don't know what the hate is about. Sure the plot was a little disappointing, the acting was sub-par, but as a old-time transformers fan, I have no issue with it. The expectations were set way too high when the movie is intended to give good special effects and action sequences, and that's what Bay is good at, and that's what he delivers. Personally, I think if you want a touching plot, Oscar-level performances, go see a movie that actually looks like it's going deliver. If you want explosions, mindless action, and an entertaining two hours, I recommend this.",
      "total_reactions": 1,
      "user": "ChaseMMe"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "From the first frame of LOUD METAL-CLANGING CONFUSING MONTAGE to the last frame of LOUD METAL-CLANGING CONFUSING MONTAGE this film is Michael Bay as usual: terrible, but loud and fast. The actors literally try to dash out of the wreckage and no one's career gets out unscathed.  By the time LeBeouf outruns (!) the enormous, fast as jets, body-heat seeing BOTS for the tenth time--one wonders how ANYONE maintains any respect for this disaster. Moviemaking at its crudest. Ugh!",
      "total_reactions": 1,
      "user": "Savvy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "Explosions , Stupid Jokes explosions. I Liked it Once One Time. However The 3rd installment seems prommising",
      "total_reactions": 1,
      "user": "transformerstan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "There was a point in this movie where me and my friends looked at each other and just started laughing uncontrollably. This was because the movie in front of us was so preposterously horrible that  you couldnt tell what the F was going on. I just look up and theres a lizard robot scaling a pyramid. Then I look up again and theres a giant alligator that breaths in dust for 5 minutes basically against both sides, just breathing in sand , that is his function in the movie. then we walked out. this movie is a disgrace to the world.",
      "total_reactions": 1,
      "user": "markdb"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "one of my favirote movied ever . the critics are morons when they diss this movie. it funny action filled and above all entertaining.as i always say robot violence is the best violence this movie proves that fact  as you can see all the parts coming out of the the robots when they are shot also they look like they are real life robots as they are so realisitic. ok so maybe the plot is simpilisitic but i hate over complicated plots.also the script is hilarious whith many good jokes.",
      "total_reactions": 1,
      "user": "ps3nerd"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "There is just no way to defend or salvage the massive and overblown mess that is Revenge of the Fallen, the sequel to the equally big but not equally bad Transformers film in 2007. Clocking in at two and a half hours, this is a drag and then some, with an uneven and completely exhausting plot that twists and turns into senseless action, it becomes quite difficult to follow and, well, unnecessary. To many devices, turning points and pointless additions make up this bloated sequel, where we find Sam Witwicky (Shia LaBeouf) now heading to college, but being dragged back into the fight of the Transformers. The Decepticons, or the bad guys, have found a new energy source, and it's location lies within the mind of Sam, and that's really the plot that drags out for an obscenely long time, and the humour and mediocre storytelling, it goes one way by the Decepticons reveal themselves the world and how they will no longer hide, but yet their epic showdown happens in the desert, away from the.. erm.. public eye. These ongoing problems persist throughout the film, as the script seems to contradict itself at many turns, switching locations and using cut-off scenes at what are perceived to be  pivotal moments such as the resurrection of Megatron, but lets cut to Sam's parents trying out snails in Paris. The inconsistencies simply don't diminish, whether its these symbols that are the driving point of the film, why exactly where these missing from the first film, with only subtle hints that never amounted to anything. The humour can be the saving grace of the film, but low and behold we have teo particularly stereotyped Autobots who are now part of of Optimus Prime's  team of earth dwellers who are reminiscent of the gang culture persona of African-Americans, racist and desperate are words that spring to mind. We also have new lady autobots who I'm sure have around five words to say in the entire film, its been made big, but just too big to point where there are mistakes and forgetfulness.",
      "total_reactions": 1,
      "user": "StevenF"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "I suprisingly enjoyed this film a lot more then the first one. I think the huge flaw for it was the long run time, It definently started to push your nerves while watching it. The run time dragged the film on longer then what it should have.",
      "total_reactions": 1,
      "user": "spadenx"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "I loved the first movie and this sequel was almost as good. Shia LaBeouf and Megan Fox are great once more, as is the rest of the cast. There are a few issues that I did have though. The number one problem I had was believing that transformers can now replicate human beings perfectly? I didn't read the comics or watch the TV shows so if there's anything in them can gives reason for this I wouldn't know but I don't care. Good movies should be able to stand alone and I have a hard time understanding how transformers can replicate, not just the look of a human, but also the texture of skin, personality, smell, etc. That was just a short segment of the movie so I can't count it against it too much but it still bugged me. Also, why are there way more Decepticons than Autobots and why are the Decepticons always cool things like fighter jets while the Autobots are relegated to various Chevrolet cars and a semi? These things didn't hurt the movie at all it just seems unfair to me. Nonetheless, it was once again an awesome movie with fantastic action-sequences, witty dialogue, solid acting, and an interesting plot.",
      "total_reactions": 1,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "The new Transformers, sorry for all the people that love this movie, but is the worst of Transformers. The special effects can be amazing, but no all be special effects. The soundtrack is good. The cast have some regular moments. The story is great. The screenplay terrible. But what is the problem? No be one, are two biggest problems. First, the development of the movie is same like the first, much explosions, and yeah autobots that say bad words. And the other is that the autobots don't be the most important, is Megan Fox!!, yes people, Michael Bay do this like Megan and the Transformers, because all the story is about the stupid relationship of Shia and Megan, and the Transforers?, no, no this movie is really bad.",
      "total_reactions": 2,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "Goog movie, memorable scenes, good cgi, and explosions, but felt like  somenthing was missing, and too goofy i mean... devastator has balls?  analphabet autobots? really Michael Bay? that really killed the epicness",
      "total_reactions": 1,
      "user": "Martin90"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "Transformers: Revenge of the Fallen doesn't improve a thing on its predecessor if not even goes more down the hill. Never the less, you can not despise the fact that it is over the top fun, with visuals still a feast for your eyes!",
      "total_reactions": 1,
      "user": "MovieReviews"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "I love watching explosions and more explosions.Add there some good visual effects,and you got Revenge of the Fallen.I liked the movie despite it's weak story and flaws,it's as simple as that.I love watching Transformers fight,explode and kill.It worked for me,and I'm glad it did.",
      "total_reactions": 2,
      "user": "GentM2015"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2016
      },
      "score": 0,
      "text": "Racist unfunny so much worst than it's previous movie. It's an insult at it's finest. Words cannot descibe how awful this movie ugh. Worst than pixels and that's saying something. OK I need to get this movie out of my head like now",
      "total_reactions": 1,
      "user": "nahtan1244"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2010
      },
      "score": 6,
      "text": "The movie started off really well, and was almost better than the first film with a lot of great  action and funny moments...  until the freaking confusing, overlong second half of the movie and ending which made no sense at all.  I'd give the first half a 9 and the second half a 3 which equals a 6 for the whole movie.",
      "total_reactions": 0,
      "user": "GoldenEye16"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2010
      },
      "score": 1,
      "text": "Micheal Bay returns to transformers with a even worse sequel to the original . i had no hope for this film but one never does know till they see it for themselves. yet again bay destroys more of my fond memories of transformers from a kid . lets see here we have a plot that even makes less sense then the original . more of shilo stuttering like a jack ass , more bad jokes , more pointless action with transforers blowing every thing and each other up who arnt given more then 1 or 2 sentences through the entire movie . with not a shred of charcter devolpment ever to be done peroid . i mean i like seeing stuff blowing up and giant robots kicking the crap outa each other but id also like to know about the robots doing it what they are like why they fight but no they basically have about as much personality as a rock em sock em robot. this whole movie was just basically a giant action jerk off fest layered on with bad jokes. this does 0 justice to the original transformers series . so yes if you have a IQ of a rock ,or like seeing demo derby's for mindless destruction , or are easily amused like seeing car keys or some thing jingled in your face . then yes you may like trasnformers 2. lets face it 25% of the population is retarded they think the govt. is responsable in making 911 happen or think obama is a muslim . so no im not to suprised that thoose same morons liked and payed to see this crap.",
      "total_reactions": 0,
      "user": "ArkonBlade"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2011
      },
      "score": 4,
      "text": "pretty bad one. not the best from micheal bay. disappointing and regular revenge story. no much emotions and drama here. the last 10 minutes was good. rest all bad.... just bad micheal bay surely did not surprise us. it is his regular one",
      "total_reactions": 0,
      "user": "sreekiran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2010
      },
      "score": 3,
      "text": "I don't know what to say, whether it's the horrible script that tries to be funny so badly or the fictional stuff that don't make sense. And perhaps some horrible acting mainly supported by Megan Fox. This movie in general is really bad, but I can't say is awful because at the very least, the people of the special effects did a terrific job!How bad is the script you say? Well when all of sudden characters that were in one country, appear in another magically. When robots suddenly can transform into humans, that makes you wonder why the idiot robots didn't come up with that in the first place. Acting? Yeah Megan fox instead of frustrated or crying for his love when he is about to be rip apart in one of the scenes, she is actually watching with amusement. Oh and apparently the government has an awful security because those radars can't detect when a robot is near a satellite, or on any kind of ground. Ugh I could continue, but it would take me days! One thing for sure, I wouldn't be happy to receive credit as a director of this film seriously. And unfortunately, there is still a lot of strange people that enjoy any kind of movie like this, and FYI I enjoyed the cartoons and love robots.",
      "total_reactions": 0,
      "user": "Sonicphoto"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2014
      },
      "score": 2,
      "text": "There are moments in this film where it is somewhat better than the last film in regards to better filming of action scenes and more Transformers but that is quickly lost. The stuff I didn’t like from the last film such as focusing on the uninteresting human characters and the dumb/annoying characters and the dumb humor. What makes this film even worse than its predecessors is there are even more dumb and goofy moments than the last film with some new annoying Transformers and human characters. Also, the film spends a good chunk of it focusing on the interesting human characters. Finally, the climax well shot better is long and boring. If you like mindless entertainment see it but if you weren’t big on the last one sit this one out.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2011
      },
      "score": 1,
      "text": "Oh good joy. Michael Bay at his best. \"At his best\" I mean at his best at annoying people who like Transformers and people who like to watch films overall. Characters are annoying cardboard cut-outs with no personalities whatsoever, the robots themselves have little importance whatsoever, there are so many plot holes that it makes the first film completely irrelevant and the action scenes are a drag and boring as hell, no matter how many explosions Bay can fit in every scene. I suggest just watching the first Transformers, which is a more better film to watch than this sack of ****",
      "total_reactions": 0,
      "user": "muzziklover"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "That's weird, I was expecting the user score to be much lower based on what I heard on the internet. Goes to show this wasn't the worst movie ever, as there are a whole lot of other movies with lower scores (looking at you Twilight movies). Even if some of the guys who worked on this movie weren't happy with it, I still enjoyed it a lot, and hope the third movie will win some fans back.",
      "total_reactions": 0,
      "user": "gm101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2011
      },
      "score": 3,
      "text": "I have no problem with mindless action flicks. \"Transformers: Revenge of the Fallen\" is certainly one of these, but that is not why I did not like it. ROTF tries to be intelligent, dramatic, and visually appealing, but unfortunately, it is none of these things. First of all, don't bother seeing this film for the action because the action is terrible. Bay seems to have it in his mind that the louder and more fast-cutting the action is, the more fun it is to watch, which is false. Although there were a few pretty good visual effects-heavy scenes, Bay rarely keeps the camera on one thing for a split-second and for the whole last hour of the film, which is just a brainless, noisy action sequence, I couldn't tell what was going on. My eyes were just looking at a screen with a lot of seizure-inducing lights on it. Which brings me to plot. It's not that ROTF is a mindless movie, it isn't quite that. Bay does have a story in his mind; however, bad dialogue and poor filming make the story pretty much incomprehensible. Fans of the Transformers might have a good time - I will also say that I did enjoy the first 30 minutes' character-driven humor and a few of the film's twists - but Transformers: ROTF is a huge backstep from the first film.",
      "total_reactions": 0,
      "user": "Will"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2010
      },
      "score": 2,
      "text": "Maybe the most disappointing sequel in years. I really enjoyed the first film, and thought it was perfect popcorn entertainment. None of the positive qualities from the first carry over. The parents, and all of the secondary characters, have become annoying. The sound visual effects are overwhelming and just too much. And Megan Fox is useless. So very disappointing.",
      "total_reactions": 0,
      "user": "Tony"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 3,
      "text": "Wow, was this bad Transformers 2, or how to make a crap sequel Good Points: Special Effects rock, Megan Fox looking lush as ever, Fight scenes are awesome, The Fallen looked awesome and was voiced by the legend that is Tony Todd, a killer soundtrack (Green Day, Nickleback), Optimus forms with JetFire, we get the return of John Tutturro and Sams parents (who are both hilarious) Bad Points: Where to begin? The film runs for over 2 hours, which is way more than is needed. The Twins, nuff said. They're the Autobot form of Jedward. Bumblebee cannot talk again, so they basically ignored the end of Transformers 1. Sams roomate, Leon, is uneeded and annoying. Theres two scenes of dogs humping. Giant Robot Testicles. Reviving Sam, Optimus and Megatron as if their deaths meant nothing. The Fallen/Megatron/Starscream relationship. Bad dialogue \"Give me your face\", the scene of Sams mom running around on drugs, The swearing and sex references when kids are watching, Sam being a dick to Mikaela in the beginning, The amount of transformers which come on, one after another, not giving them enough screentime for us to care when they're destroyed. All in all, a rubbish sequel. I would've given it a 2.5 rating, but i'll be generous (like I was with the good points) and round it up to a 3",
      "total_reactions": 0,
      "user": "roddersj04"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "This film is, for all intents and purposes - adequate. The action scenes are much better than the original, yes, but including actors playing human characters is not a good move in a film focused on robots. The acting is nearly atrocious - nearly as bad as your average CD-I game or....well, think of the worst film you ever saw, and you are nearly there. The next film has a lot to prove.",
      "total_reactions": 0,
      "user": "Ell678"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2010
      },
      "score": 6,
      "text": "OK the honest truth is that Transformers ROTF is an overblown and ill-judged mess of a film, driven completely but outstanding special effects, a plot that unneccesarily over complicated and laughable at times, two racist Autobots, far too much comic relief. I'm not gonna diss the action because I loved every action scene in the this film. Having said all of that however, people what were you expecting? This is Transformers and Michael Bay so you knew already what to expect. This film is very much a guilty pleasure because there is fun to be had in the stupidity but that's it.",
      "total_reactions": 0,
      "user": "TheBear"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "HATTERS!!!  POR QUE???!!!! This movie was actually pretty good, if you a enjoyed the first and had EXTREMELY high expectation then maybe this movie deserved a 6 at the lowest. But 2's and 0's really? Megan Fox was not the only extremely sexy reason to watch this movie! The old cast is back along with some new faces, animations are still spot on and killer, and the story wasn't terrible. From an actual human beings opinion, this movie deserves at least an 8.   DEFINITELY  WORTH WATCHING!",
      "total_reactions": 0,
      "user": "chrisking8613"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2010
      },
      "score": 6,
      "text": "Useless and dumb. Terrible actors, the directors could have not picked worse. The special effect are very nice but the whole movie structure is awful.",
      "total_reactions": 0,
      "user": "Nas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2010
      },
      "score": 5,
      "text": "I don't hate this movie, I just don't think it was that good. The action was good and all but the acting was bad, the story line was not that good, and it has no character development. Also the humor in it was bad because robot balls and humping robots is not funny. Overall I don't think it should have made 800 million world wide because only movies like the bourne trilogy should make that much.",
      "total_reactions": 0,
      "user": "11morrowk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "While still being wonderful to look at our epic robots just don't get enough love this time around. There is a great little spat between Megatron and Starscream, but it gets overwelmed with the awful twins, and the failure of Devastator and don't those useless jokes that are thrown in. Just don't pay too much... We can only hope for better characterization and a more coherient plot next time around.",
      "total_reactions": 0,
      "user": "Rumblebeelove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "Great Movie! but the first one rocked . that's it. oh, found a transporter in france :)",
      "total_reactions": 0,
      "user": "nemme"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2011
      },
      "score": 1,
      "text": "extremly disappointing!!",
      "total_reactions": 0,
      "user": "tylerkenobi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "Way too long and I didn't understand the plot (I didn't watch the first movie though!) Near the end I was bored and I just wanted it to end. But I'm going to give it a 4 because the special effects were good and the movie was ok. Not good, just ok.",
      "total_reactions": 0,
      "user": "MichaelD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "It's true, Transformers 2 is a summer flick and people who go to see it shouldn't expect to be blown away by the story. It is part of a genre to be considered as the inverse of art-house cinema: it's not really made for those who \"don't get it.\"",
      "total_reactions": 0,
      "user": "C_ee_X"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2011
      },
      "score": 3,
      "text": "This movie was a bloated, overlong and vapid sequel to 2007's Transformers, a movie that I actually enjoyed. The threadbare story is riddled with poor dialogue, toilet humor and gaping plot holes. The biggest mistake RotF makes is the exclusion of a decent human element to the story, choosing instead to focus on messy and badly directed fight scenes. Formerly enjoyable characters are now just one-dimensional caricatures who are there to kill time before the next robot fight. The movie spends no time on developing its characters yet expects us to care when they face imminent danger. This highlights another problem. The story and characters are so weak that it detracts from our interest, meaning that scenes of dramatic importance fall flat because we no longer care. A poor effort which will derail this series if it continues as it is.",
      "total_reactions": 0,
      "user": "ImUnavailable"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2011
      },
      "score": 0,
      "text": "Why didn't they just blow up Megatron at the end of the last movie? Why can't Bumblebee talk anymore? Why are all the robots made from the all spark automatically evil? How could anyone fall from that height and come away completely unharmed? How on Earth did Optimus outrun the other Autobots, most of whom are fast, sports cars? Why are all the human characters either unlikeable or undeveloped? Why do Skids and Mudflap exist? Why is it day in Egypt? Why does film need to be wasted on capturing dogs humping? Why, why, why. Because Micheal Bay willed it.",
      "total_reactions": 0,
      "user": "samus_smash"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "I dont really get the low marks over this movie,Or the Micheal Bay hating come to that.He makes great entertaining action films,fact.Sure,this isnt as good as the first movie,but its still very good,with still great characters,action,special effects & humour.Alhough i still think that it would've been better with the original G1 Transformer looks(especially Megatron in Robot form,& Optimus Prime in Vehicle form),& the original Megatrons voice.I found this movie highly entertaining & enjoyable at the end of the day.",
      "total_reactions": 0,
      "user": "SpartanEdge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2011
      },
      "score": 6,
      "text": "I enjoyed the movie, but the charm of the first Transformers flick is missing, and the plot is just plain stupid. The robot action is awesome, especially the Optimus Prime/Decepticon fight in the woods, but anything having to do with the humans is just awful. One of the many problems I have with the film, is that Megatron, is now reduced to being a secondhand lackey to the Fallen.",
      "total_reactions": 0,
      "user": "chardr69"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 2,
      "text": "plot is everywhere, most of dialogue is flat out, way too much juvenile humor, and there are the retarded twins...Acting isn't terrible, the music is good, special effects are great, fights are great and Megan Fox is hot. Those are things that I really enjoyed about this film, I think everything else is crap.",
      "total_reactions": 0,
      "user": "DeviousBastard"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2013
      },
      "score": 2,
      "text": "Having enjoyed the first movie I was really looking forward to this follow up. There can be few sequels however in the history of film making that have been such a huge disappointment. It is difficult to know where to start when explaining what is wrong with this movie so I we simply list my biggest complaints.",
      "total_reactions": 0,
      "user": "drlowdon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2011
      },
      "score": 1,
      "text": "There was literally one scene in this entire movie that I found mildly enjoyable which is why I didn't rate this 0. Beyond that there was always something so horrible that they thought to add in that the rest of it was disappointing. Poor story, poor character development, and humor I'd expect from a deranged child, often at the most serious moments. Last, but certainly not least, it somehow managed to take my respect for Optimus Prime down a notch which I thought would be impossible. These must be the most absent-minded, uncaring, and vengeful Autobots I've ever seen. I thought for sure they'd do a better job than the first mediocre movie.",
      "total_reactions": 0,
      "user": "sirtalomose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2011
      },
      "score": 1,
      "text": "pure mindless junk. This movie is great if all you want is things blowing up and Megan Fox filmed suggestivly. Come on people most of us are not 12 anymore, we shouldn't be suckered into giving money up to such a movie. THe animated movie was better than this and it was not very good. My friend who dragged me to the movie can go punish himself alone if he chooses to see the third one. They'll keep making them as long as you keep oinking america.",
      "total_reactions": 0,
      "user": "lususgreene"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2011
      },
      "score": 4,
      "text": "I remember reading all of the critics' bad reviews and hearing all of the bad comments from friends when this movie came out a couple of years ago, so between that and the fact that I was no huge fan of the first \"Transformers\" anyway, I made little to no attempt to see \"Revenge of the Fallen.\" However, it was on HBO the other night, and I said, \"what the heck,\" and decided to give it a shot. After two or two and a half LONG hours, it was over, and my thought was \"Well, it wasn't good, but it wasn't THAT bad!\" If there is one thing that Michael Bay can do consistently well, it's that he can make the pictures that make up the film \"pop.\" The actors looked fantastic (especially Josh Duhamel, Tyrese and Megan Fox, who either could be or are models anyway), the locations were gorgeous (especially the Egyptian scenes), and the Transformers themselves beautifully constructed - shiny and colorful, just like they should be. The problem, then, is that Bay has a horrendous eye for cinematography and editing. For some reason, he thinks it is a good idea to film scenes of dialogue and actual emotion on characters' faces from far away, and then film action scenes from so close-up that it is hard to tell who is where at what time in the given action sequence. I swear, at least half of the close shots were ones I thought would have made more sense to film from far away, and at least half of the long shots were ones I thought would have made more sense to film close-in. When you add those factors to editing that can practically induce seizures, the film is just exhausting to try to keep up with. And the dialogue, good god the dialogue is terrible. I know this was a summer action movie, so I didn't have high expectations for the dialogue anyway, but I expect better than this. Almost every line was like something you would find as a bumper sticker slogan or on a Hallmark card. Many of the older, more experienced supporting actors/actresses actually made some of these crap lines work, like John Turturro and the man and woman who played Mr./Mrs. Witwicky, but the younger ones like Duhamel, Tyrese and Fox didn't stand a chance (they are pretty bland actors to begin with). However, the title for worst actor has to go to Shia LeBeouf as Sam Witwicky. His idea of acting in this movie seemed more like a portrayal of a meth addict than of a smart teenage boy starting his first year of college. I just don't understand the love over this kid; he has played that same hyperactive type in every film I have seen him in, and I don't find it cute. I just want to smack him. On top of the bad dialogue and mediocre acting are some very nasty, negative themes. In Bay movies, hundreds of thousands of people die and hundreds of thousands of acres of land are destroyed, but it is all done in the name of entertainment, so hey, who cares? There is no attempt at making the deaths or destruction mean anything, and, in that sense, it cheapens the entire experience. Also, young women are not seen as real people in Bay's movies, but as objects to fulfill men's desires. It is really pathetic how misogyny just runs rampant throughout this film...and these female actors just go along with it, playing the pretty, shallow idiots just like they are told. And don't even get me started on the \"black\" robots, who just so happen to also be the characters who can't read. I think my mouth fell open and I gasped when they said they are illiterate - are audiences really O.K. with that? Because I'm not. The one factor that allows me to move my rating out of the red and into the yellow is the story, which is pretty neat in concept. Unfortunately, that concept is not carried out very well by Bay, but the major storyboard points are interesting enough and make sense in the context of the Transformers' universe. Obviously, based on my review, you can tell I think this movie is very flawed and mediocre. However, in hindsight, I am kind of shocked at how bad those reviews/comments were that I mentioned before. I was expecting to really despise \"Revenge of the Fallen,\" and there are definitely many aspects of the movie that I do despise, but I would watch this again before I watched \"The Last Airbender\" or that god awful \"Twilight - Eclipse\" any day of the week.",
      "total_reactions": 0,
      "user": "jasher"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "Why the critics and some moviegoers are terribly underrating Transformers 2? The script may be bizarre, but the story is amazing. Michael Bay is a mediocre director, but this film is not very bad; i say the same with Transformers 3, Â¡it's a shame that the critics have underrated that film and is the best of the series! Â¡Fuck the critics!",
      "total_reactions": 0,
      "user": "supersergi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2012
      },
      "score": 2,
      "text": "Possibly one of the worst films ever created. Oh! Whar a suprise this film is created by Michael Bay. Can't you remember his masterpiece Armageddon. I'm just kidding his supposed best film also insulted my intelligence and wasted a portion of my life. Well I guess I have to say something bad about the film instead of just insulting it's director.  Overlong mindless action with no plot simply things blowing up as well as flat jokes and horrible performances.",
      "total_reactions": 0,
      "user": "cabrita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2011
      },
      "score": 5,
      "text": "This sequel lacks the certain overall charm that permeated the first movie. While the story didn't wow me in the first robot romp, the stunning visuals and quirky human characters had me entertained the entirety of the first films duration. I really wanted to like Revenge of the Fallen and I went into the movie with an open mind (as well as the knowledge that it had a pretty crummy reputation with the critics). The movie started out well enough and i remembered thinking to myself; \"What are these critics talking about, this is a decent action flick?\" Then the atrocious humor started to kick in. The humor started out innocent enough and i chuckled at a few crude jokes, but as the film continued the multitude of terrible jokes became relentless. Once the third act of the movie started I thought that the final battle would kick in and the action would cancel out the crude jokes. Much to my dismay not even the final battle was safe from the \"humor\" (a scene involving large transformer testicles comes to mind). It didn't help that the final battle was a little on the boring side. All in all Transformers: Revenge of the Fallen was a disappointment, it wasn't the worst film by any means, it was just all over the place not knowing when to take itself seriously. Overall I did have fun with it there was still plenty of spectacular action sequences to gawk at (most notably the forrest battle) and a plethora of nifty explosions, courtesy of Michael Bay himself. The movie just needed some more focus and it would have been more of a solid installment in the Transformers saga, but there's no going back now. In the words of Optimus Prime, \"I send this message so that our past will always be remembered. For in those memories, we live on\".",
      "total_reactions": 0,
      "user": "RoscoeY"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "I had a friend a while back that made a good point about action movies; \"More.\"  You can always tell when some producer told a writer to go back and amp it up some more.  When it comes to a Transformers' movie, that's kind of all it takes to make a sequel work.  What idiot is seriously going to be super-upset that the characters lacked depth?  Dude, you're watching a movie about things going boom because big robots that turn into trucks and shoot plasma cannons while talking with James Earl Jones' voices have come to Earth to befriend and protect or enslave us all... Things going boom is the point of the movie.  How can you give it a bad rating when it does exactly what it's supposed to do.  Things went boom.  A lot.  In all kinds of different ways.  It was pretty cool watching things go boom.  Oh and they have like some PG-13 ****tease sexuality on display too, but personally... if you aren't going to go all Conan the Barbarian on that, then I say stick to things going boom.",
      "total_reactions": 0,
      "user": "UglyNUncreative"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2011
      },
      "score": 3,
      "text": "Transformers 2 - Slightly more than one line review!",
      "total_reactions": 0,
      "user": "LevelsAndGear"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2011
      },
      "score": 2,
      "text": "Terrible. I liked the first one but this one just went down the blow **** up for no real reason route. The first one didn't particularly care that much about character development but this one just throws it out the window completely. It's ridiculous and while a couple action scenes were entertaining, it's impressive how much of the action is really boring. The humor is stupid too with the exception of a couple times and the actors obvious puppets saying the words they have to say to move on to the next action sequence. At two and a half hours, it was really boring.",
      "total_reactions": 0,
      "user": "AVCITY"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2011
      },
      "score": 0,
      "text": "I absolutely hated this movie with every part of my body. Sound strange but thats the only way I can explain this feeling. I saw it in theaters when it came out and hated it, then my friends wanted to watch it again on On Demand so I just went with it and hated it again. I will not watch this crap again and i don't think you should either. One reason for my hatred toward this movie is the plotline is useless and doesn't make sense. Just read a summary of the movie and you know what I mean. It's not just that though, it's also confusing, and not in a cool Inception or Donnie Darko way. It's more of a confusion that you have no idea whats going on but don't feel like figuring it out anyway. Like theres all of these explosions and the camera is spinning everywhere and then Optimus Prime dies but he actually doesn't, or does Sam save him, you know what I don't know and I don't care, all I know is Michael bay sucks at everything and to read up on how much he sucks read my other bogs on this websites. Then right when you think the criticism is over I have one more thing to share with you. The movie had soooo many useless and dull characters that it was funny. this movie could be a comedy, except the jokes in it where they were supposed to be funny are the exact opposite. So it could be a comedy for the wrong reasons and that is not good in my book. So in all, do not see this movie it is a ginormous waste of time.",
      "total_reactions": 0,
      "user": "JAM123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "Let's just start off by the fact that the Writer's Strike really hurt the script, which is something a lot of people forget. This script was still terrible despite. It expanded on the flaws of the original. The plot was almost non-existent and most of the humor was painfully unfunny. The acting dipped down for the worse as well. This movie was still entertaining and had good visuals but it failed badly on several levels.",
      "total_reactions": 0,
      "user": "jos95"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "An awesome movie with super special Effects and super action, I have seen in 2009.Its better than the 1st one,huge battles and huge action is like the best,I've seen, high energy action and a big story.Michael Bay has really pumped up the action for this movie.I don't care if anyone hated this movie,they're crazy and stupid and don't know action movies.This is like the best movie of 2009,it has huge action set pieces that are so sick and exciting, enough said.",
      "total_reactions": 0,
      "user": "MovieCritic17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "It's arguably one of the stupidest films I've ever seen in my life, but it's a film where you just seriously have to shut your mind off and know you're watching pure garbage. The acting from the humans horrible, the humor beyond horrible, but I know for a fact Bay had to have known he wasn't making Citizen Kane, and I can tell that the people making this probably had a lot of fun working on it.",
      "total_reactions": 0,
      "user": "skeletonking123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 2,
      "text": "To people who actually liked this film: WTF are you people smoking? This movie was goddamn horrible **** And I thought the first one was okay. Passable. The Rock is Michael Bay's best work, and then Transformers and The Island were sorta alright. But this... this is ridiculously wretched.",
      "total_reactions": 0,
      "user": "Delta_Assault"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "I really enjoyed watching the movie... From the beginning it was tense and everything was unexpected. I also really enjoyed the special effects because they were very realistic and the fight scenes between the Transformers were done really carefully. The Transformers that were shown in this movie and didn't appear in the original were very amusing. I liked almost everything in this movie but the acting.. Megan Fox didn't give herself to the plot and didn't act as well in the first movie. I liked Shia's performance but the constant noise in the movie didn't really go as well as they taught it would.. After all, I'm still happy there will be a third movie!",
      "total_reactions": 0,
      "user": "snowcold"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2011
      },
      "score": 1,
      "text": "This movie's plot is really bad. Watching the movie will degrade your humor level. Maybe the visual which is considered good has made this movie successful. This movie is such kind of bad when a superhero movie turns into a comedy and gives you shame rather than morality.",
      "total_reactions": 0,
      "user": "theZED"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "TF2 is slow, but the adventure of the movie is what makes it worth watching. The ending battle is why I ended up liking it, and thats what makes it worth existing.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "pretty cool movie. i like most of Michael Bay's movies and the transformer series. But the story is sometimes confusing and bad. But the actions are still pretty good.",
      "total_reactions": 0,
      "user": "eagle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 4,
      "text": "When Micheal Bay gets it wrong, he really gets it WRONG. Unlike the somewhat entertaining first film, watching this movie \"Transformers: Revenge of the Fallen\" is like being locked inside a loud, fast-spinning washing machine. It's all action, but no heart or soul. No real substance but a ugly mess of CGI. The acting is good and the music (mainly for Linkin Park) is excellent but not even a whopping $200 budget could save this flick from losing its way. Summer blockbuster or not, this series deserves more respect.",
      "total_reactions": 0,
      "user": "eTurkey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2012
      },
      "score": 0,
      "text": "Transformers Revenge of the fallen loses whatever made the first film good by providing bland action, awful performances and overrated visual effects with a extreme length to add to it. You will be in for a long and boring experience if you see this movie. I give this movie 3% of a good movie.",
      "total_reactions": 0,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2011
      },
      "score": 4,
      "text": "Noisy. Annoying. bad acting. Some gripping moments. Sam Witwicky (don't tell me I spelled his name wrong or I will kill you) is a dumbass for not saying he loves her. Overall, O.K., but fake. It would be a much better movie if Sam and Megan fox just had sex while the robots fight.",
      "total_reactions": 0,
      "user": "oscarr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2011
      },
      "score": 4,
      "text": "(September 25, 2009)",
      "total_reactions": 0,
      "user": "T-rAv"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2012
      },
      "score": 2,
      "text": "This movie's plot, dialogue, action sequences, and characterization was garbage! I would not recommend buying this if your life depended on it. Seriously, this movie was just trash.",
      "total_reactions": 0,
      "user": "PQuinny"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "After a very long yet entertaining 2,5 hours... I must say that perhaps \"Transformers: Revenge of the Fallen\" suffocated in its own massiveness. Perhaps my mistake was to watch \"Transformers\" the night before this one, and expect a perfect continuation. Because yes, there were a lot of expectations. That helps me to be critical about this piece - which isn't necessarily a good thing.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 3,
      "text": "Transformers was a good movie for what it was; mindless action, a decent storyline, attractive lead acting, and cool looking giant robots.  Take away the story, replace the cool robots and replace them with the robot equivalent of a Prius, and multiply the action by 100x, and you have Revenge of the Fallen.  If Megan Fox wasn't there to distract me I'm not sure I would continue watching this movie.",
      "total_reactions": 0,
      "user": "OnAnarchy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "Absolutely appalling. A ghastly disastrous film in which you look at the screen but can't process any of the inconceivable storyline, if there even was supposed to be one. Insulting. Big stupid robots.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2012
      },
      "score": 5,
      "text": "Bloated and excessive sequel from Michael Bay, with a 'more is more' approach seemingly applied in producing the second Transformers film.",
      "total_reactions": 0,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2012
      },
      "score": 2,
      "text": "This film was **** ass hell. When I was thinking of a score for it I was thinking a 1.5 out of 10 [my first ever 1 score for a movie]. But then I will spare it from dropping down to the ground hard. I really want the director of this film to get out of this world, I mean i'm so sick and tired of his gay films. Transformers: Revenge of the Fallen 2.2/10",
      "total_reactions": 0,
      "user": "watithink123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "Disappointing. That's all I can say. \"Transformers: Revenge of the Fallen\" is a stupid way to make a sequel to the thoughtful and entertaining original. Michael Bay just wears us out completely with a crude, noisy and under-plotted sequel.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2014
      },
      "score": 0,
      "text": "I would say that this is probably the worst blockbuster  have ever seen. This is not just because the plot is awful, the action dull and it is horribly overlong. But the real problem this film has is the crippling misogyny and racism throughout. Making a stupid film about robots is one thing, but this goes so much worse. we do not need a slow pan up of Megan Fox leaning over a bike, this is a film about a toy for 8 year olds for Christ's sake.",
      "total_reactions": 0,
      "user": "Satiricalewok"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2012
      },
      "score": 3,
      "text": "Wow, where to begin. This movie doesn't just tarnish the Transformers franchise; it furiously b****-slaps it until nothing is left but a grinning effigy of Mr. Bay. Retarded plot points are pulled out at every corner, the fights are spastic and unfocused, and the military is there to outshine the robots during every scene. In all honesty, it feels like Bay sold this as propaganda for the military. You remember the epic fights in the first film, including the showdown between Optimus and Megatron? You'll get none of that in this movie. The supposedly invulnerable, pyramid-sized robot at the end, who decimates all attempts to destroy it, is defeated in 6 seconds by a \"railgun.\" I know it is a real weapon in development, but it is never mentioned at any point in the movie, and honestly feels like Bay crammed it in as more propaganda. Don't see this movie.",
      "total_reactions": 0,
      "user": "Sben69"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2012
      },
      "score": 3,
      "text": "Permission to Face-Palm: Approved. One of the suckiest, most tiresome, boring, lame, unoriginal and stupidly shafted movies I've ever seen. Maybe, it's the worst dissapointment I've had with a film.",
      "total_reactions": 0,
      "user": "jetpackulley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "Not a terrible film but the female alien robot as well as the 'twins' from the Autobots were incredibly unrealistic (even for a Transformers film) and annoying. A lot of the film is saved by decent action and military sequences but even that isn't enough to give this film a positive score.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "It's really hard to talk about this movie. This is easily one of those movies that everyone loves to **** about so by this point I feel like there's nothing else to say even though I actually like it. There are a lot of great ideas here, like the introduction of the first Decepticon and the universe building is some of the best I've ever seen. But for everything great about this movie there's something that holds it down such as the racist humor, or annoying characters. Also, I'll discuss this more in my Dark of The Moon review but it feels like the creators of these movies REALLY hated Megatron. Still, if you want a movie that'll thoroughly entertain you every step of the way, then look no further.",
      "total_reactions": 0,
      "user": "starscream97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2012
      },
      "score": 2,
      "text": "The plot makes little sense, it has zero continuity. The characters are annoying and the dialogue they are given only hurts their cause. The humor is painfully immature and borderline offensive. The worst part is that even as an action movie, it fails. The action scenes are poorly shot and the final fight is over all too quickly and completely anticlimactic.",
      "total_reactions": 0,
      "user": "Seriosity"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "Maybe it's action is spectacular, but it's plot is stupid, there are stupid characters, stupid villians, stupid acting, stupid dialogues... Just stupid.",
      "total_reactions": 0,
      "user": "FSJ_973"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 2,
      "text": "I like action so will admit that I loved a lot of this film. Michael Bay knows how to direct action and there's a lot of that on display here. What I did not like is the highly unintelligent attempts of humor. This film is literally one of the dumbest movies I have ever seen.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "Nowhere near as good as the first movie in terms of depth and story. The action is amped up too much and Bay is trying to do to much. To many new characters with almost NO character development at all. This movie is nothing but a grand display of action, effects and Megan Fox's ass (which is glorious by the way!) BUT it did have a few good moments, and was at least entertaining. Overall: Just another shameless Bay action flick that does not even try to be anything more. Poor, but at least fun to watch at times.",
      "total_reactions": 0,
      "user": "Rox22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2013
      },
      "score": 2,
      "text": "A terrible romp of bad race depictions and an angry robot that goes, I am MEGATRON about every ten seconds. It might be Michael Bay's worst movie yet!",
      "total_reactions": 0,
      "user": "Summersausage"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "Very, very, very poor storytelling, and directing.  I liked the first transformers movie, but this one is stupid, full of dirty jokes, and puts explosions 10 miles ahead of screenplay on its priority list.  It's sort of passable for a t.v. viewing, and has one or two decent action scenes, but that's not enough to make a good movie, not even close.  Try watching this in the movie theatre for more than 2 hours while you have to pee, and are consistently having your expectations shot down.",
      "total_reactions": 0,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 1,
      "text": "This movie finally provides the world with an exclusive insight inside Michael Bay's pants. During the most excruciating 150 minutes one could experience by watching a film, nothing will stop Bay from pulling his boxers all the way down just to show the world how big he is by randomly throwing everything, and I mean EVERYTHING he has right as it comes, whatever pops out first; yet managing to under-develop characters even less than he did on Pearl Harbor. And Bay's pants on his ankles also explain why the fun and humor from the 1st movie had become so gross and vulgar.",
      "total_reactions": 0,
      "user": "Erik_Imsen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "text": "Transformers: Revenge of the Fallen is without a doubt one of the worst movies I have ever seen. Literally all it is, is Transformers and Decepticons fighting each other in hand to hand combat for 150 minutes straight. No breaks. It might sound entertaining to some people but for me it was just stupid, boring, and repetitive.",
      "total_reactions": 0,
      "user": "mds03"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 3,
      "text": "this movie is a massive disappointment  this movie took everything we loved from the first sequel and destroyed it  the comedy was out of place  the transformations was boring  i hated every minute with John Turturro in it  this movie probably destroyed the sequel forever",
      "total_reactions": 0,
      "user": "ExKing"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2013
      },
      "score": 3,
      "text": "I can't believe that Michael Bay went from a successful exciting Transformers movie to this. This movie was a real stinker. The reason is from terrible acting  perfect example (Julie White) a.k.a. Sam's mom  and a bunch of unessacary/retarded moments that draws your attention away from the story. In this case, I hate the fact it's so long because of the stupid moments and terrible acting. Overall, this is a waste of what could have been a fun movie, but is ruined by Michael Bay's terrible directing.",
      "total_reactions": 0,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2013
      },
      "score": 2,
      "text": "I'm a Transformers fan and I'm upset with what Michael Bay for what he has reduced my childhood into. There, that is practically what the next minute or two will be about. I watched this around the time it was available on Netflix, I watched it several times because it looked cool and I liked the music. Watching it now I realize that this is actually a horrible film, with sexist, and racist characters. I know for one that racism is a big deal and that now a days it's a popular form of comedy. A lot of T.V shows do this, shows like South park and Family guy do it all the time, but South park gets away with it because it gives social commentary about what's going on. This film however only gives us fascinating visuals and robots made out of cardboard. That's the major problem a lot of people had with the film, some actually don't care and just roll with it, and that doesn't mean that they're racist or anything. I guess that and some bad directing is what most skepticts focus on, and praising the visuals like everyone does, and who can help it; like what Michael Bay would want people to say after seeing one of his films: this looks awesome. The one thing I enjoy in this film is probably what a lot of people enjoyed as well: the scene where Devastator forms. This is the pinnacle of the special effects, and it's great to see one of the most profitable Transformer toys back in the day have testicles. I don't think I can say much more about this crap that no one else has already said, so I leave saying this: I don't like this movie.",
      "total_reactions": 0,
      "user": "Skullgirlsfan13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "A disappointing sequel to Transformers, with terrible a humour and an unconvincing plot. The action was definitely a positive to a weak movie and easily the worst one in the trilogy.",
      "total_reactions": 0,
      "user": "kubathereviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "A more entertaining and groovy version of Transformers (2007).",
      "total_reactions": 0,
      "user": "TheApplegnome"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2014
      },
      "score": 5,
      "text": "Revenge of the Fallen is a more loosely-plotted, slightly racist, more muddled sequel that is barely entertaining enough for us to forgive its many flaws.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2015
      },
      "score": 3,
      "text": "I gave the first film an 8. That's how bad this film stacks up in comparison. And please dear god, to anyone who dares make a film about robots, don't mix them with toilet humor. Please. I just beg of you.",
      "total_reactions": 0,
      "user": "Aijixe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2016
      },
      "score": 5,
      "text": "If you even remotely followed the film industry in 2009, you will know just how poorly received \"Transformers: Revenge of the Fallen\" was. Everyone remembers the awful reviews, the many Golden Raspberries, and the general negative reaction the film received. And yet...I don't HATE the film. Maybe it was because I loved the action scenes, or maybe it was because of the visual grandeur, but I didn't think it was the worst film ever made. That said, I didn't LIKE the film either: it's horribly written, poorly acted, and way too long for its own good, but \"Transformers: Revenge of the Fallen,\" if you know what you're getting into, is not the worst film ever made (Please, internet, don't hate me for saying such a thing). That said, it's not GOOD, and I'd recommend you turn your brain off when you watch this film, otherwise you won't get the full effect.",
      "total_reactions": 0,
      "user": "FreedomFighters"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "The first Transformers was really a Entertaining blockbuster for fans of transformers franchise. this sequel had 100x stereotypes then the first transformers, I did like after all but Megan Fox can not act in a Micheal bay film ( she has many other talents then acting as a Bay girl), Literally she can not act a dime in this franchise.  the first Transformers  was an A- or B performance, I hate this humor it's not funny or clever while  LeBeouf  goes to college, I do love Peter cullen as always also bumble bee. The Cast is a disaster !!!!!!!!! it is for real. I love loud music Bay's explosions sequence seriously i do the humor ruin this  first sequel to \" Transformers\". Grade C ( i love the Transformers cast  also Micheal Bay it's just Kreuger had messed up the script for example Scream 3).",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2014
      },
      "score": 5,
      "text": "Sam Witwicky once again joins with the Autobots against their sworn enemies, the Decepticons. \"Transformers: Revenge of the Fallen\" lacks the mind-blowing blockbuster spirit \"Transformers\" originally had.",
      "total_reactions": 0,
      "user": "MrBigman01234"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2014
      },
      "score": 1,
      "text": "Given the fact that I saw this film 5 years ago: I was surprised as to how I actually remembered it. When I saw it the other night however: I wished I didn't. Everyone had already identified all the problems with this film, the fact that Michael Bay admitted that an aspect of his film was \"crap\" practically tells the whole story. It's two redeeming qualities being the brutal and entertaining action sequences, with good voice acting are not even close to plunging this film out of a pit of unlikeable and underdeveloped characters, crude and sometimes grotesque humour, clunky and forced story lines, noisy and uncomfortable sequences thrown in unnecessarily, and a lethargic pacing that ultimately results in a tedious slog of a film; and it's not often I feel that way when watching blockbuster entertainment.",
      "total_reactions": 0,
      "user": "JoeKnowReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2014
      },
      "score": 2,
      "text": "This movie doesn't exist to tell you a good story, it doesn't exist to give you entertainment. It only exists for EXPLOSIONS, LOT OF EXPLOSIONS, UNSTOPPABLE ACTION, SPECIAL EFFECTS EXTRAVAGANZA and it lacks humanity. Weak story, weak characters, weak dialogue, weak comedy: Weak Film.",
      "total_reactions": 0,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2016
      },
      "score": 5,
      "text": "Transformers Revenge Of The Fallen is my Phantom Menace (a movie I was looking so much forward to, and I saw and stayed in denial of how average it is and thought that it was a great movie for many years, until I realise that I was wrong ;_;).",
      "total_reactions": 0,
      "user": "Danielhero1998"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2014
      },
      "score": 4,
      "text": "again great CGI but the script is so poorly written (even more so than the first) that its basically just a bunch of robots blowing each other up the acting is not great at all this movie is not very good at all.",
      "total_reactions": 0,
      "user": "cumovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 3,
      "text": "It's hard to describe what all makes this film bad, so I'll just list a few things.  The action sequences are horrendous.  They look like exploding junkyards that you can hardly differentiate from one another having slap fights.  The acting (with a few exceptions) is largely bland and occasionally just plain awful.  Specifically, Megan Fox.  She's hot, but she has no acting talent.  The humor is hardly chuckle-worthy at its best, and borderline offensive in its worst, often resorting to stereotypes to try and get laughs.  The climax is wholly unsatisfying, with a complete Deus Ex Machina resurrection of TWO main characters, and a final fight that lasts less than two minutes.  Not to mention Sam Witwicky often serves no other purpose than to run and scream for someone to save him.  If I had to give some positives, it would be Peter Cullen as Optimus Prime, and the impressive quality of the CGI.  Other than that, this is a truly terrible film with very few redeeming values.",
      "total_reactions": 0,
      "user": "SkyrimGuy935"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2014
      },
      "score": 2,
      "text": "It's noisy, effects driven action is both obnoxious and plain stupid. \"Revenge of the Fallen\" has moments where it can be funny, but the laughs are very few and far between. The movie supports no plot whatsoever, and its protagonist, Sam Witwicky, played by Shia Lebeouf, is thoroughly unbelievable, and is not helped by Lebeouf's lackluster acting.",
      "total_reactions": 0,
      "user": "McCrumReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2014
      },
      "score": 2,
      "text": "Sam Witwicky once again joins with the Autobots against their sworn enemies, as the Decepticons try to resurrect Megatron from the depth of the sea to take out the Autobots.",
      "total_reactions": 0,
      "user": "SythusRATINGS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "Es increíble como la primera película es una excelente adaptación, si hubieran respetado el mismo estilo que la primera parte, no hubieran caído tan bajo, repleta de chistes malos, trama aburrida y lo unico que recuerdo es como un robot se follaba la pierna de Megan Fox",
      "total_reactions": 0,
      "user": "JohnMasterL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "Il secondo capitolo è sicuramente superiore al primo capitolo,con più umani,più autobot,più decepticon e con una trama molto più articolata,lunga ed accattivante.",
      "total_reactions": 0,
      "user": "PeterParker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "Transformers: Revenge of the Fallen is a giant step down from the first Transformers. It has bad and sometimes overly inappropriate humor, racism, and a weak story. At least the CGI was as awesome if not better than the first's. 4/10 (below average)",
      "total_reactions": 0,
      "user": "Le__Xenomorph"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "This movie has several flaws, mainly the acting. pacing and unfunny humour. However, the action and special effects are top-notch, with loads of thrilling, explosive battle scenes. If you look past the bad stuff, there's just enough good stuff to make it worth a look. Big, dumb fun for action fans.",
      "total_reactions": 0,
      "user": "TJAW"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2015
      },
      "score": 3,
      "text": "I think this time Michael Bay overdo with the explosions and slow motions \"Yea man we all know that you love explosions and slow motions also the volume up but that's just to much\" and in the background of the crappy plot it was just exhausting to watch .And the actors contributed alot to this failure Megan Fox play was so boring and unprofessional that she pass this mood in too the film .It's not only she i think everyone were so lazy this time they even use scenes that were in the first part scenes that were in the beginning of the movie they just didn't put any effort. And the biggest fail was the plot the hole movie was just no sense there are a war between humanity and aliens and they focus out attention to teenage problems and when we have to get in to the movie they messed up the hole story .And in the end you stay and watch 2 hours movie with explosions , fights and no plot and story .Total FAIL.",
      "total_reactions": 0,
      "user": "SmileATT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "I'm not sure how Bay managed to do so bad with the second installment, after managing to produce a surprisingly (for him) good first movie. 'Revenge of Fallen' doesn't just stagnate - it gets worse. The acting (again, with the exception of a brilliant John Turturro) was horrible, even worse than in the first installment, the action scenes overly multiplied in a way that they actually become annoying and the plot was so full of holes that you could actually see through the screen (I mean, really - The Fallen is supposed to be this overly bad-ass bad guy and you give him practically one scene at the end where the revived Optimus kicks his ass in like... 7.3 seconds). The animation just didn't cut it this time and except for several comical moments and the aforementioned animation, this movie just doesn't offer anything.",
      "total_reactions": 0,
      "user": "Arthur_S_Poe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "Remember 2008 when the biggest movie of the year was also one of the best? I miss 2008. This year, the biggest movie of the year is by far the worst. Transformers 2 features a shocking disregard for storytelling, characters that are, at best, abrasive, constant \"humor\" that makes me never want to laugh again and incomprehensible, tension less, and ultimately boring action.",
      "total_reactions": 0,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2015
      },
      "score": 4,
      "text": "'Transformers: Revenge of the Fallen' is an unpleasant experience of noisy, overcrowded and damn right annoying features.",
      "total_reactions": 0,
      "user": "MrMovieBuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2015
      },
      "score": 2,
      "text": "The robots are all back: Optimus Prime, Megatron, Bumblebee, Megan Fox.",
      "total_reactions": 0,
      "user": "MovieManiac83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2015
      },
      "score": 2,
      "text": "Now the first movie was great and it blew everyone away, so of course, we were excited for this one. We hoped that it would live up to the first one. Well, we were wrong. So, so, wrong. Admittedly, the first half of the movie is bad, but it was bearable. We got a few action sequences that were cool to watch. But everything goes downhill real fast after Optimus Prime dies. From there on out, its straight up boring, and the finale is very disappointing. Tons of boring dialogue and filler. You just end up not caring and just want the movie to end. Now of course, I have to give props where props are deserved. The visual effects were cool, CGI was still amazing and everything looked real. But, Michael Bay went all out with his Bay-isms. Racism, hot actresses and extras that he is probably trying to pork, and of course, tons and tons of explosions. In the last movie, there weren't too many and they fit into the movie perfectly. In this one, he went overboard with all the explosions. No matter what happened, there was an explosion. Pencil falls, EXPLOSION! Someone falls down, EXPLOSION! This movie also had an incredibly long run time. This movie is boring and it sucks.",
      "total_reactions": 0,
      "user": "monster0420"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "If you thought that Revenge of the Fallen couldn't be worse than the first one, you were wrong! Transformers Revenge of the Fallen is the worst movie ever made, it's loud, noisy, retarded and tries to be The Dark Knight of Transformers movies and fails. Fight scenes are hard to understand and the humor is WAAAAAY more offensive than any movie you have seen. And the finale was underwhelming, especially for a Michael Bay film. If you plan on watching this monstrosity, do yourself a favor and just watch Pacific Rim or the first Transformers movie.",
      "total_reactions": 0,
      "user": "damien_k98"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2015
      },
      "score": 0,
      "text": "Nothing works in revenge of the fallen it gets every single aspect of how to do a narrative WRONG!! it doesnt achieve any type of entertaining action because of the CONSTANT shaky cam and has some of the most piss poor acting i have ever SEEN!!!",
      "total_reactions": 0,
      "user": "TheDude-"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2015
      },
      "score": 1,
      "text": "After I saw this movie, I sat down and put on the original series of Transformers and thought to myself how downhill the series has went. The first one wasn't all that, but THIS one was filled to the brim with racism, explosions and terrible acting. That's three things you don't want in your movie. I feel like the Micheal Bay movies have definitely shown new people to the franchise, but is that what we really wanted? I mean, the people who saw the movies first are gonna be like, \"Oh? That TV show SUCKED, i'm going to go watch the MOVIES! They were WAY BETTER!\" and they'll chuck the DVD away. Anyway, I thought this movie sucked.",
      "total_reactions": 0,
      "user": "BoogeeFilmGuy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2015
      },
      "score": 4,
      "text": "Good but too disappointing movie , there for some scenes but brings funny scenes , but it looks very funny and some great action but the action and explosions.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2015
      },
      "score": 5,
      "text": "comprised of several construction vehicles, set on clawing its way to the peak of a pyramid. As it lumbers up the dusty colossus, a shot tilts up to its mid-section, revealing two wrecking balls dangling down. Yes, Michael Bay, the man who brought us cyber-micturition in this movie’s predecessor, has one-upped himself: Decepticon testicles.",
      "total_reactions": 0,
      "user": "FlickFreaks83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2016
      },
      "score": 2,
      "text": "Please leave your positive reviews at the door after I place this review right here. The Transformers are dead in this movie, but they kept being alive after this movie and they aren't even trying to be such good connectors to the first movie. Just... plain.... action... and... Megan... Fox.... is.... involved... in....  almost... every... review.... that... these... people... gave... a.... positive... review.... in.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2016
      },
      "score": 2,
      "text": "Call me old fashioned, but I like a little side story and character to go along with my order of big, loud special effects. Apparently, I'm in the minority, though, because the original Transformers made more money than I'd see in 300 lifetimes. So kick back, dig into your jumbo faux butter-drenched popcorn, and slurp your gargantuan soda while experiencing the kind of supersized mayhem that only Michael Bay can deliver. It's a question of whether the cholesterol in the \"butter\" will harden your arteries before what's on the celluloid can cause brain death.",
      "total_reactions": 0,
      "user": "FilmMasterEd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2016
      },
      "score": 3,
      "text": "I had really high hopes for this one. I hoped that this sequel could be a better, awesome blockbuster of the summer, but it turned out to be a pile of junk. The special effects are still great, but thats all there is good about it. There is racism, there is skits and mudflap, who remind me of jar jar binks. And there is the story as a whole. I actually thought this was a good idea, with the new villain and everything, but the villian did not really have an appearance, and was only in like five minutes of the movie. This is the worst transformers movie of all time.",
      "total_reactions": 0,
      "user": "gameguardian21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2016
      },
      "score": 1,
      "text": "One of the worst movie sequels I have ever seen. Awful characters, awful script, awful \"comedy\", awful camera work (TOO MUCH SHAKY CAM), very good effects though and some of the action is entertaining, BUT OH MY GOSH THIS IS TERRIBLE AND DISGUSTING. Don't watch this movie it is the worst one of the franchise, I give it a 1/10.",
      "total_reactions": 0,
      "user": "MovieGuy811"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2016
      },
      "score": 0,
      "text": "Overlong, overblown utter drivel for the lowest common denominator. When this film was released I was a 14 year old teenage boy, the perfect demographic for this type of film - and I still hated it. Everything is put together so cynically for the sake of big bucks at the box office that they spent no time on attempting to make the film actually good. No amount of hot girls, explosive action scenes (which are offensively boring anyway), forced in dumb comedy or detailed CGI can polish the turd that is Revenge of the Fallen. Would not recommend to anybody with a brain.",
      "total_reactions": 0,
      "user": "Danm95VFF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2016
      },
      "score": 4,
      "text": "It started pretty solid, after the opening action sequence ends, everything goes downhill!  The humor sucks, the characters are annoying, and the dialogue is horrible!!  Most of the only good moments in the movie are the action sequences!  The only time I got tired of the action was in the final act, there was no excitement involved it, and of course, the film's awful sense of humor was put in the mix, so yeah, this was a very disappointing sequel!",
      "total_reactions": 0,
      "user": "Dyliebar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2016
      },
      "score": 1,
      "text": "I'm no movie buff or cultural snob. I enjoy dumb fun, the emphasis being on FUN. This film isn't fun. It's an overlong borefest, devoid of humour but full of racist stereotypying, right wing flagwaving and poor acting. I'll give 1 point for the hot looking girl bot with the tongue",
      "total_reactions": 0,
      "user": "Trenchfoot"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2016
      },
      "score": 3,
      "text": "Transformers: Revenge of the Fallen was such a disappointment; we almost just expect it coming from Michael Bay. The fact that it was even worse than it's predecessor is kind-of pathetic. Everything in the dictionary of bad movie rationales, Revenge of the Fallen creates. The 3 points I give it is out of curtesy because Bay can develop great action sequences.",
      "total_reactions": 0,
      "user": "Antgiog1202"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2016
      },
      "score": 3,
      "text": "The Good:",
      "total_reactions": 0,
      "user": "superbat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2017
      },
      "score": 3,
      "text": "Michael bay has put no effect into his movie, and this is another example. Transformers revenge of the fallen is a generic summer blockbuster that gets almost nothing right. The script in this movie is so lazy, without it even focusing on the transformers, it tries to develop the human characters more than the transformers. The humor in this is just so terrible, with it being mostly racist and stupid, just like every other Michael bay movie. The characters are all undeveloped and weak, and the movie just doesn't go anywhere interesting. The only good thing about this movie is the special effects and one good action scene, that's really it. Overall, transformers revenge of the fallen is just a lazy and stupid movie,and as a hardcore transformers fan, I highly wouldn't recommend it.",
      "total_reactions": 0,
      "user": "Thatonenerd2187"
    }
  ]
}