{
  "mc_avg_user_score": 7.1,
  "mc_metascore": 49,
  "mc_mixed_rating_frequency": 197,
  "mc_movie_name": "TRON: Legacy",
  "mc_negative_rating_frequency": 68,
  "mc_positive_rating_frequency": 520,
  "mc_pro_critic_reviews": [
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "On the heels of another revelatory turn in True Grit, Bridges is sensational again, here in a groundbreaking performance."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "An eyeball party. The score by Daft Punk, which veers from homages to Hans Zimmer's thundery work in \"The Dark Knight\" to a retro-'80s synth sound, surpasses magnificence."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "Bridges has a fine time playing with himself, so to speak. Add Garrett Hedlund as Flynn's son Sam, the rebel who zaps himself into the server to find his lost dad, and director Joseph Kosinski has a recipe for adventure that should delight gamers. Non-techies are on their own."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "Tron: Legacy, a sequel made 28 years after the original but with the same actor, is true to the first film: It also can't be understood, but looks great. Both films, made so many years apart, can fairly lay claim to being state of the art. This time that includes the use of 3-D."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "The sequel, more successfully (if less innocently), injects you into a luminous technological wonderland and asks you to be happy with the ride."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 70,
      "summary": "The special effects are incredible, blah blah blah, but oddly, the most effective element here is the original movie's striking visual design-everything pitch black except for the luminescent piping on the costumes and foreground objects-which was inspired by the primitive arcade games of the early 80s."
    },
    {
      "critic": "J. Hoberman",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2010
      },
      "score": 70,
      "summary": "Given the movie's graphic pizzazz, the best hippie wisdom Bridges might offer the viewer is: Turn off your mind, relax, and float downstream."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 67,
      "summary": "When director Joseph Kosinski flips the switch on action, TRON: Legacy is entertaining enough. Especially in 3D IMAX, with a mega-audio system booming Deft Punk's droning Xbox-ready musical score, nearly drowning out the collisions."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 67,
      "summary": "There's absolutely no shortage of stunning eye candy in this spiffy, sexy, and frequently thrilling sequel to Disney's 1982 game-changer Tron. There is, however, a certain lack of connectivity between the digitally enhanced characters onscreen and the user – excuse me, \"audience\" – in the flesh."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 63,
      "summary": "With a curiously stubborn kind of integrity, Tron: Legacy follows what did and didn't work the first time – another weak story with sub-B-movie dialogue, partly compensated for by intensely conceived geometric design and special effects."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 63,
      "summary": "It's a triumph of streamlined design, but TRON: Legacy never enters the fourth dimension where it's worth a plugged nickel to humans."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 63,
      "summary": "Like \"Avatar,\" \"Legacy\" is a film too in love with its own good looks. And like the original \"TRON,\" the sequel's a bit of a slog."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 63,
      "summary": "They had 28 years, and this is the best they could come up with?"
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 60,
      "summary": "Bridges is enjoyable as he gives the older Flynn a Zen hero quality, and even breaks through the effects to make his younger-Clu-self oddly engaging."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2010
      },
      "score": 60,
      "summary": "The profusion of Dudes is - pardon the apt pun - game-changing. By turns a fierce megalomaniac and a Lebowskian monk, Bridges supplies more soul than any sci-fi sequel deserves."
    },
    {
      "critic": "Nick de Semlyen",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2010
      },
      "score": 60,
      "summary": "A triumph of art direction, sound design and Gallic phat beats, but could do with a script upgrade and fun.exe patch."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 60,
      "summary": "While 21st-century effects and a cutting-edge dance score make this a stunning virtual ride, the underlying concept feels as far-fetched as ever."
    },
    {
      "critic": "Ian Buckwalter",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 59,
      "summary": "Tron: Legacy revels in its over-the-top nature: the sharp contrast of inky blacks against vibrant neons, the bombastic clash of orchestral and synthetic elements in the soundtrack (by French electronic musicians Daft Punk), the trippy, sometimes incoherent ideas it presents."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 58,
      "summary": "It's a handsome film, and Bridges is back, but little has been done to deepen the story into a saga, and the leading man, Garrett Hedlund, rivals Bit for inexpressivity."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "This sequel is also goofy, also eye-popping - see it in Imax 3-D if you really want to fry your optic nerve - and also weakly scripted. And yet the sheer size of the thing works against it: The effects are absolutely spectacular, but they blow the goofy-cheesy quotient straight through the roof."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "There are worse things than being trapped inside a computer game with Olivia Wilde. In Tron: Legacy, the loud, long and less than wholly satisfying sequel to \"Tron,\" that's the bittersweet fate of Kevin Flynn (Jeff Bridges), the computer-nerd hero of both the 1982 sci-fi cult classic and its high-tech, 3-D update."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "For those in the audience, it's best to just sit back, drink in its virtual dazzle and not ask questions. The story is beside the point in this sleek-looking reboot. It's all about the whiz-bang special effects and the return of Jeff Bridges - always the coolest guy in any space, cyber or otherwise."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "New players, a new story line, a new director and nearly three decades of improved technology including all the whiz-bang-wow the latest 3-D has to offer. Unfortunately, there's not nearly enough new life."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "Tron: Legacy is not good, but it is amiable. While it seems less like a parody than the original, it is also silly in a not unpleasing way."
    },
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "Legacy is a two-hour light show with a lot of flash, a little style, and not one byte of narrative originality."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "Tron: Legacy gives us a dud stud named Garrett Hedlund as Sam Flynn, the hero of this petrified sequel to 1982's \"Tron.\" None of what he sees impresses. The feeling is mutual."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "An ungodly mess that's great fun to look at for about 15 minutes and exhausting the rest of the time."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "Curiously, TRON: Legacy makes the same mistake the original did: All the best stuff comes in the first act. The rest of the movie is as exciting as an overnight round of computer coding."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "A movie's in trouble when neither the hero nor the villain has charisma, and Clu is a dull dog."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "The results impart that \"trapped\" feeling all too well. It's a sullen affair, dominated by a grim visual palette that intrigues for about 30 minutes."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "TRON: Legacy may well satisfy the fanboys who have waited almost three decades for its appearance. Enjoy. Who knows, maybe one day if you wait long enough they'll make a \"Super Mario Bros.\" sequel, too."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "It all ends up being a half-hour too much of a just okay thing."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 42,
      "summary": "Ought to have been state of the art. But there's not a whole lot of artistry to be found in this movie."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 40,
      "summary": "A sequel with far less color and cinematic imagination, and many more bells and whistles, including a freakishly special-effected Mr. Bridges going mano a mano in cyberspace with the grizzled real deal. Twice as much Jeff Bridges does not necessarily mean twice as much entertainment - bummer."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 40,
      "summary": "With a million times more computing power at its disposal than its 1982 predecessor, Tron: Legacy still looks like Disco Night at the jai alai fronton."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 33,
      "summary": "Disney has once again constructed a digital environment out of cutting-edge special effects, only this time, it isn't merely silly; it's as dry and talky as a PBS panel show."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 30,
      "summary": "Tron: Legacy is the kind of sensory-onslaught blockbuster that tends to put me to sleep, the way babies will nap to block out overwhelming stimuli. I confess I may have snoozed through one or two climactic battles only to be startled awake by an incoming neon Frisbee."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 30,
      "summary": "It's dispiriting to see how little attention the filmmakers have paid to the dramatic - read human - possibilities of the original, or how much they've been overwhelmed by technology's demands. It's as though rogue programs took over the production."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 20,
      "summary": "That's the culture we live in, where the once-proscribed Pleasure Principle has become iron law and where the recycled, bloated, fish-belly emptiness of something like TRON: Legacy carries boredom to extravagant new heights."
    },
    {
      "critic": "John DeVore",
      "publication": "Premiere",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 12,
      "summary": "Tron: Legacy will only be enjoyed by men in their thirties and early forties searching for a Proustian moment."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 5,
      "pos_reactions": 19,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "An absolutely marvelous film with breathtaking visuals and beautiful art direction.  So much of the spirit of the original film is in this one with references for the fans of the first movie to smile with pride for understanding.  My only complaints are: there is no Bit (loved Bit in the original) and the vintage lightcycle is a great sight and it's built up, but it gets next to no worthwhile screen time.  Regardless of those complaints, it's a fantastic movie with plenty of geek fanfare and love for the fans of the original.  The acting is strong, the writing sharp, and the soundtrack is undeniably awesome.  I cannot recommend this film highly enough.  Go see it!  End of Line.",
      "total_reactions": 24,
      "user": "masterbedgood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "So um... this is tron. and daft punk created the whole soundtrack...  with that information its got a 10 already. Its the most visually pleasing movie ive ever seen and its all backed up with a daft punk original soundtrack!!!!! now the story isnt all that great, but it isnt bad. If you have no idea what tron actually is that will take away abit from the movie. BUT if u like old videogames, if you like eye candy, if u like daft punk... GO SEE THIS MOVIE",
      "total_reactions": 11,
      "user": "BIGREESE"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "This film has been unfairly panned by critics. its only flaw is cramming enough visuals dialog and story elements for two full length films into one. If you can forgive the hurried pace of many scenes then you will find a rare gem in Tron Legacy. The acting and direction outshine the Star Wars prequels so brightly its like comparing coal to a precious gemstone. The score and accompanying soundtrack are subperb, alone making the DVD or Blu-Ray purchase worthwhile.",
      "total_reactions": 6,
      "user": "t-bombz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Tron: Legacy is a great film that entertains with a good story, nice acting, excellent music and sounds, and with a visual style that keeps your eyes glued to the screen. Overall this is a film full of Sci-Fi entertainment that would have expected since this film's first rumor.",
      "total_reactions": 3,
      "user": "Syn_again"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "visuals were a billion times better than avatar and the soundtrack was unbelievable. exceeded my expectations in every way. critics are dumb, olivia wilde is a fricken babe, this movie was the best this year.",
      "total_reactions": 3,
      "user": "Gamboner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Great, Great, Great, Great movie. It's a work for the geeks, and jeff bridges fans. Cool style, actions was fantastic, I was even surprised that the acting wasn't as terrible as I expected! Bottom line is that if you willingly watched the first tron and enjoyed it you'll love this. If your looking for a cool action movie, you'll love this. If your looking for a great work of art or a truly compelling story it will only be meh.",
      "total_reactions": 3,
      "user": "Petiee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "if you hate this you where expecting to much and was disappointed. and when Disney says 3d it doesn't mean sh*t  poping in your face. it means they are trying to make the movie look like it has depth.",
      "total_reactions": 2,
      "user": "ethanater"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "This movie was awesome!!!",
      "total_reactions": 2,
      "user": "ESS180"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Underrated! This is the type of film that bulds a strong cult following despite negative reviews. There are some plot holes, but really, nothing that hurts the story and nothing you could think of for an explanation as to why something happened.",
      "total_reactions": 2,
      "user": "Ivan_Es_Supremo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "Entertaining and fun. 3D was weak. Story was not weak at all, quite good for an action / sci-fi movie. I would recommend this to anyone who like sci-fi or hero movies. It's better than most.",
      "total_reactions": 2,
      "user": "powersackers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "This movie was great. My first \"new generation\" 3D movie and it delivered. Saw it in an IMAX theater and it was quite the experience, visuals were amazing and the story was good, not sure what movie some of the others are watching. It's an adventure flick, plain and simple, setting up a new world/franchise that I hope continues to grow and prosper. I heard a lot of the negative press and have to say I can't imagine why. Just sit back and enjoy the film, it's not a sermon no matter what some critics would have you believe. Who's paying them anyways, most seem to have no touch with what the public is looking for in terms of entertainment.",
      "total_reactions": 2,
      "user": "GRENDEL123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "This movie is fun, edgy, cool. It won't be a critic's choice, but It's better than typical Hollywood fluff. I hope they make a sequel, the story has been setup well for one. While this film has a good level of closure, there are plenty of options to take things further.",
      "total_reactions": 2,
      "user": "WillSci"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "I'm sorry that many people (and critics) don't understand that the whole point of going to the movies is to be entertained and to escape from reality for a while.  TRON Legacy is wonderfully entertaining, visually stunning, and the story is engaging and plenty full of depth, despite what you may have heard.  Also Jeff Bridges delivers an exceptional performance along side other strong actors.  I will agree that the CGI on young Bridges looks out of place in the \"real\" world, but on the grid as the tragic antagonist CLU, It is entirely convincing that he exists.  The villains are very interesting and at times I found myself rooting for them because of how cool and they are, especially Michael Sheen's fabulously despicable character.  I never saw the first one nor was I born in the eighties, but I still thought this movie was fantastic, it doesn't just appeal to people in their thirties who want some nostalgia.  Also, it's called TRON because the first one was called TRON and because calling it CLU, Light Cycles and Laser Frisbees, or Kevin Flynn and Company's Spacey Adventure on the Grid wouldn't be as catchy.  I would give it a 12 out of 10 if I could because it was just that awesome of a spectacle and story of estrangement, betrayal, political symbolism, and self-sacrifice.  Also, the soundtrack is top notch, I had my doubts at first when I heard Daft Punk was doing all the music, but it has one of the best scores of any movie that I have seen.  Definitely see this movie, you will be surprised at how good it is.",
      "total_reactions": 2,
      "user": "JimZimbabwe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Ok look you people are idiots, what do you expect when going to a movie entertainment not some deep thought provoking movie that will unravel the meaning of life of course not you go in there to watch a freekin movie. It's a moovie for peat sake. The graphics where amazing the acting was awesome the story line kept true to the tron legacy and the music was perfectly chosen. I sat through the hole two hours and while I was in the theater I completely lost track of time and if a movie can make you feel like that than it's a great movie. So I give tron legacy a million out of a million. And let me tell you people that get a kick out of making people feel bad feel bad for working hard on something well than you can suck my left nut and if you go into a movie theater to look for the meaning of life than you might as well kill yourself because the closet thing you'll ever find to the meaning of life is staring at you straight down the barrel of a gun. So screw you an tron legacy is an amazing movie no matter if you 10 or 100.",
      "total_reactions": 2,
      "user": "ANormalHuman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "How can anybody not like this movie? If your argument is that it failed the original, revise your argument. This affectionate sequel paid sincere homage to its ground-breaking 80s predecessor, without being spoofy. It was clearly made with love by a director who is a much a fan of the original Tron as Chuck Bartowski is. The 3D is neither gimmicky or showy but serves to pull in the audience like they have been affected by the laser as well. This is complemented by the forwards/ backwards movement in the movie which made the whole thing feel like a fairground ride. Daft Punk's soundtrack was quite simply AWESOME. The electro sound adds to the cleaned-up 80s feel of the movie and it is just so fantastically LOUD that it contributes beautifully to the immersive and disorienting experience. It isn't just the soundtrack itself that makes the movie a musical feast: Kosinski uses sound  wonderfully to frame each movement, scene and mood-change that the movie is reminiscent of his very clever commercials and game trailers. it becomes very clear how he landed this gig. I'm thinking in particular of  the moment, in the club/ fight scene  where Flynn appears looking like a scary Dalai Lama/ Santa Claus accompanied by  a cacophony of spine-tingling techno magic. You have to see it! There are not enough good  words to describe Jeff Bridge's performance as the now world (and grid) weary hacker Kevin Flynn so I will plump for these stellar and so so cool. Relative newcomer Garrett Hedlund is  an excellent young protagonist. I expected him to somewhat irritating (like Hayden Christensen in Attack of the Clones) but he wasn't and brought a Mark Hamil-esque quality to the piece.  I have heard so  much criticism of the CG which brought CLU, Flynn's creation-turned-nemesis, to life. The criticism was that compared to the surrounding characters it didn't look quite right. These people seem to be forgetting that they are comparing CG to REAL PEOPLE. Any graphics that are not quite as good as flesh as blood must be pretty good really. Remember how awesome we all thought Beowulf was.....",
      "total_reactions": 2,
      "user": "Rebecca_87"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "I know the critics are bashing this film and that makes me happy.  That confirms to me mission accomplished by the producers and director.  If they made a critical success that would mean they had dumbed it down to much and not played to the fan base that will truly make this the success it can be.  I think they did it right, it gorgeous, it sticks to canon, and it tells a story.",
      "total_reactions": 2,
      "user": "PWarren4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "As a fan of the first movie I was eager to see Tron legacy, but at the same time afraid that it wouldn't be all that great. Well, I'm happy to say that I was very pleased with what I saw. Ignore the critics; all they want are movies that pull your heartstrings and make you think. Those are good movies, but sometimes, I just want to watch a movie that takes me on a fun flight through imagination, and that's exactly what Tron legacy does.",
      "total_reactions": 2,
      "user": "xandervee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "The original Tron holds a sentimental value to me, as my father and I watched it early on in my childhood. I was always interested in computers, and from that day on, video games too. The story of Kevin Flynn being trapped in a digital world with no means of escape and to be there for almost 25 years before an aggressive CLU(codified likeness utility) took it upon himself to lure Flynn's son Sam into the machine makes for one HELL of a great story, and it grabbed a hold of me right from the start. Jeff Bridges does a great job of playing himself, young and old, and CLU, the program that ultimately turns on him and drives him into exile.",
      "total_reactions": 2,
      "user": "hokester81"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "I guess I really don't see what the critics see because I saw nothing wrong with this film. The acting was good, the visuals were stunning and the soundtrack was amazing I bought it right after I saw the movie. This movie was great. The only negative thing I have to say about it is their weren't enough games. Their shouldve been way more battles, but other than that the father and son story was great, the sound effects were ecstatic, and like I said before the soundtrack was the best I've heard in a movie in a LONG time, Daft Punk is amazing at what he does. I hope theirs a third. This movie deserves high praise, 10/10.",
      "total_reactions": 2,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "This movie did not disappoint, with loads of action, great special effects, and an awesome soundtrack, I spent most of the time with a big grin on my face! Disney have done a very good job here, entertaining for adults but at the same time not too hard for children to understand what was going on (my 5 and 7 year old sons both understood it). Also, there are some very cool nods to the original Tron (no spoilers, you'll just have to watch it) and Jeff Bridges is amazing! Well done Disney, hope there is another on the way.",
      "total_reactions": 2,
      "user": "retromau5"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "Mesmerizing movie, with perfect audiovisual presentation. The visuals and the 3D were breathtaking, incorporating the awesome soundtrack from Daft Punk, = the conclusion is an epic allgasm. I even liked the story, nothing too convulted, a good son and father plot with great references to the original movie. Sure, there are some cheesy dialogues and phrases that would make an expert cringe, but overall it's a complete package.",
      "total_reactions": 2,
      "user": "MEGalonagyix"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "Tron: Legacy is an action packed Sci-Fi Fantasy that captures the true potential of the human imagination in the digital world. Jeff Bridges (Kevin Flynn and Clu) goes all out and plays a two-part role in this digital adventure. When Kevin Flynn discovers a portal into the digital world, he replicates himself by creating a program that he named Clu. Together, Flynn and Clu worked to create a Utopia, until Clu betrays Flynn.  Flynn cannot defeat his digital self and therefore goes into hiding in the digital world from Clu. For over 20 years, Kevin Flynn is trapped in the grid, while Clu builds his empire. Cluâ",
      "total_reactions": 2,
      "user": "DKE"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "Entertaining. Visually it's more pleasing than Avatar, from my perspective. Story wise it's also much more original - but still lacking. There was room in this TRON universe for more of a complicated story but instead this was a pretty stock storyline. It was still a fair movie though, and the visuals were nothing short of amazing. Would recommend it, you'll be glued to the screen most of the time. Except that at a few times the fast pace of the story and action seems to slow down, and there's corny lines. Other than that it's action packed.",
      "total_reactions": 1,
      "user": "nvnick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "This is a movie that goes beyond that which the \"professional critics\" expect out of movies. It provides an original (even though it's a sequel) movie-watching experience that does a good job of allowing the viewer to suspend disbelief. It's visuals are stunning, the soundtrack fits perfectly to the theme of the movie (a lot of techno and futuristic music), and the sound effects are enthralling and make you feel like you're really in a virtual and high-tech sci-fi world. There are plenty of action scenes that break up the boredom and monotony from which the original movie suffered. I did not see the movie in 3D (because i don't believe in using 3D tricks and gimmicks to overshadow lack of movie-making abilities). Therefore I have no comment on the quality of the 3D experience. However, knowing Disney's track record with quality movie-making, I'm sure they didn't disappoint (for those who are interested in that sort of thing). The only downside to the amazing visuals was the CGI Jeff Bridges. Though the technology that goes behind recreating human faces and emotions are getting better by the year, they still seem a ways away. The tones and colors of young Jeff Bridges' face were spot on, but he often seemed to lack that emotional and subtle quality that we are all honed in to detect. The story was more enthralling and dramatic than the original, but very predictable. Do yourself a favor and ignore the \"professional critics.\" See this movie if you have an open mind, are a fan of sci-fi, and enjoy stunning visuals and enthralling music and sound effects.",
      "total_reactions": 1,
      "user": "sapient254"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Really great film. Exciting, interesting, visually appealing, emotionally engaging, nostalgic, and modern. I'm seriously having trouble understanding where such negative reviews are coming from.",
      "total_reactions": 1,
      "user": "JoeyK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "TRON Legacy... well I honestly didn't expect an innovative story like Inception from the trailer, and that's what I got.  Its not garbage, but not anything we haven't seen 100 times already.  Audio is amazing, visuals are good, but 3D is NOT as strong as it should be, I believe they could have at least put a little more effort into it.  My recommendation is to go 2D if you see it.  But all that aside, TRON Legacy is GOOD.  You will get entertainment out of it, and it is worth your attention.",
      "total_reactions": 1,
      "user": "Zeph"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "The visuals are fabulous and are enough for one to see the film. The story isn't much, and many questions are left unanswered. The fight scenes were pretty cool, though, and the cast does a good job - particularly Bridges, who has fun playing two characters.",
      "total_reactions": 1,
      "user": "Will"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "I actually thought it was pretty good. Solid acting and good effects as well, Works well in 3D too. The downfalls of it though is the rather long run time, Far too long if you ask me. Also while its entertaining for the most part, Its rather boring at times as well. Overall its still rather good.",
      "total_reactions": 1,
      "user": "asylumspadez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "After more than a decade, another TRON movie was released. Did it make the fans happy ? Yes ! But I didn't saw the old TRON Movie (1982) so I was kinda amused. That does mean that you have to see the old one to like this one. The visual effects were outstanding. The disc trowing battle was bad-ass, I wanted to see more of that. Sometimes, especially at the end, it had those moments were it touches you. TRON : Legacy was kinda shallow, but it was a cool, hardcore movie, with hot chicks (Olivia Wilde). Still, this movie may not be for everybody.",
      "total_reactions": 1,
      "user": "scrieciu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Excellent the CGI is incredible and the soundtrack is pumping not the best film I've seen this year that was a toss up between Scott Pilgrim and Harry Potter but this is a close second if your a fan of the original i would definitely recommend checking this out. if not in the Cinema rent when the Blu-Ray comes out.",
      "total_reactions": 1,
      "user": "manic221"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "Tron: Legacy is quite a solid film.  The story and setting are so nuanced and quirky it keeps things fresh despite the numerous action scenes.  Solid performances from the actors and a fantastic soundtrack inject meaning into a world crafted via Disney's heavy-handed application of CGI animation.  Of course, the depth and complexity of Tron may not reach the heights of classic dramas but Tron sits comfortably among the other popcorn flicks playing at your local 12-screen and has a ton of fun besting them.",
      "total_reactions": 1,
      "user": "jsowers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "I struggled with the score for this movie.  Should I give it a 9 b/c I really liked the movie, or should I give it a 2 because I was felt ripped off by the 3D upcharge that WAS NOT worth it?  I paid $7 extra to see it in 3D, but I was sorely disappointed to find out only a few scenes were actually shot in 3D.  Sadly, there was more exciting 3D 2 minutes of previews before the movie, than in the entire Tron movie.",
      "total_reactions": 1,
      "user": "LE_"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "Truly spectacular, while I haven't seen the original Tron I really loved this movie, the world is awesome, characters are fantastic, and it just has an amazing atmosphere to it, it's action packed and just a lot of fun to watch, and the special effects and the cool suits they wear are awesome, and the ending has me hoping for another movie, truly a spectacular ride form beginning to end.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "One of the most exciting, entertaining and visually pleasing movies I've ever seen. Along with the solid plot fidelity it's hands down one of the best movies I've seen in years.",
      "total_reactions": 1,
      "user": "MetaCritics"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Not sure what the critics are talking about! Great movie, good acting, stunning visuals, fun soundtrack. If you like Avatar, you'll like Tron: Legacy.",
      "total_reactions": 1,
      "user": "SeattleMike2010"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "This is no Oscar winning masterpiece, but I still enjoyed it even with it's flaws. The biggest gripe would have to be with the story but even with this it still made for entertaining watching. Very shallow character development and a story that seemed to awkwardly plod along to the start of the entry to the grid were things started to pick up  Action sequences were spectacular and had me engaged through out. Very cool when watching full screen in an IMAX theatre. Jeff Bridges dialog had me cringing occasionally, but other than that I thought it was pretty enjoyable. So much so, I'm going watch it again this weekend.",
      "total_reactions": 1,
      "user": "KingFD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Hmmm makes me wonder why some of the reviews are over analyzing this movie. The movie is near perfect in bringing TRON to today's audience. The acting was well done and the visual effects blew me away. I guess my only complaint is that I would of liked to have seen more of TRON (Bruce Boxleitner), but maybe in the next movie. Daft Punk really delivered in the muscial score...I hope this is not the last of Kevin Flynn...",
      "total_reactions": 1,
      "user": "Mangler298"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "This movie really did pay tribute to the original. I have been a fan sense the first one and this one is exactly in the same spirit. It is slow at times, fast paced at others as well as being visually and musically a landscape. The sound and sites are a treat, the story, while not perfect, is, when compared to the first, a perfect sequel. I can't wait to see if this series can ramp it up in following movies, or if it dies do to over critical inter-net snobbery. See the first one again, then go see this. You will not be disappointed and in the end that is why you bought the ticket and took the ride.",
      "total_reactions": 1,
      "user": "Shock256"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "An absolute spectacle. Breathtaking, cinematic and inspired. The story is fairly weak (but fashionably Disney), and the dialogue a little forced (\"Radical, man\"), but the experience is far from disappointing. The musical score has an undeniably exciting leitmotif, and the fact that it was composed by first-timers Daft Punk really emphasises its brilliance.",
      "total_reactions": 1,
      "user": "haigchapman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "I was pleasantly surprised by Tron: Legacy.",
      "total_reactions": 1,
      "user": "ferretface"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "I absolutely loved the movie. The lightcycle races and the disc wars were absolutely spectacular and Jeff Bridges gave his all in a great performance. And Daft Punk is just the cherry on top! Possibly the best family movie I have seen since Monsters VS Aliens.",
      "total_reactions": 1,
      "user": "MichaelD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "It's like your usual guns and girls action movie... for a nerd. Everything from the light cycles to the disk throwing to aerial techno dog fights looks absolutely stunning and are truly the highlights of the movie. Everything else is forgettable. Acting is sub-par and the only memorable personality is that of Jeff Bridges who plays a mix of god and hippie. If you want a nice looking movie, I would suggest it but like others have said, it lacks a grabbing story.",
      "total_reactions": 1,
      "user": "Zugish"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "Interesing movie, but it's a cliche, it doesnt give us something new and the music i expected more of Daft Punk, the only  really good it's the visual effects but the don't know how to use in its totallity the 3D.... its only a movie that you can see in your room in a borin sunday afternoon. i hope my \"critic\" could help you for make a descicion to see it",
      "total_reactions": 1,
      "user": "jamesdean"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "I'm old enough to have seen the first TRON in the theater so I have to admit, I walked in somewhat jaded and thinking it wouldn't likely be very good. I was actually pleasantly surprised. There was good chemistry with the actors and Olivia Wilde was an excellent addition to the cast. The technology and vehicles were also very well done.",
      "total_reactions": 1,
      "user": "David_H"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "Tron Legacy is a great movie if you've seen the original. It's great special effects,acting,script,and action. My opinion is that you shouldn't see tron in 3D. It's a GREAT movie!!!!",
      "total_reactions": 1,
      "user": "dumbuldore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "A bit of a disappointment for me. While visually stunning and with incredible music, the tempo is uneven and the movie is sometimes boring. But at least a few truly incredible parts, bring this movie to 7/10 for me.",
      "total_reactions": 1,
      "user": "Palino007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "The first Tron movie had some groundbreaking ideas to virtual space but Tron legacy fails to explore any new themes or sci-fi ideas. The world of Tron legacy was simply a fantasy world rather than exploring a scifi world within a computer which is a missed opportunity. The movie has a great soundtrack and some of the visual direction is brilliant, the CGI animated young Jeff Bridges was awful, did not work and ruined the movie for me every time the animated character spoke. I rate Tron fairly well dispite these short comings as I loved its soundtrack so much, its a shame they didnt take more chances with the sci-fi ideas and its CGI Jeff Bridges.",
      "total_reactions": 1,
      "user": "davenbettridge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Very stylish film with an outstanding soundtrack. However like a poorly thought out pie it sags in the middle and all the time they are \"advancing the plot\" and talking about ISO's, etc, you long for them to go back and have another lightcycle race or disc battle. Olivia Wilde is great, Jeff Bridges is ok reprising an earlier role (\"The Dude\" from the big lebowski), however the actor playing Sam Flynn is an unengaging cookie-cutter hero. I really hope the sequel is better than this. Overall ok, but not as good as it could have been.",
      "total_reactions": 1,
      "user": "DukeJon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "Best in The series, but something seems wrong about the film, was it Sam flynn or noticeable lack of emotions and good acting by bruce??? Anyway the film had great 3D effects and a good story but lacks good acting but still if you ask me, it's a great film. No regrets when I watched it in 3D, no regrets when I bought the DVD.",
      "total_reactions": 1,
      "user": "infinityqs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "TRON: LEGACY is a visually impressive and entertaining film that was great in 3D and is really fun. But in some parts, I didn't like the acting that much.",
      "total_reactions": 1,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "The world inside the computer looks amazing, the soundtrack totally emerges (?!) you into the film, there's plenty of action, a decent story, in short: i enjoyed it very much.",
      "total_reactions": 1,
      "user": "Hmueck"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "I am suprised that critics hated it so much, It actually was pretty good. The action scenes were good and the acting was ok (I expected better) and the story was true to the series but lets be honest - The story sucked, It wasnt interesting and it ended so poorly that it left me saying \"I watched this movie just for that?\". The story brought it down a lot but the enjoyable moments through out the movie made it worth the watch.",
      "total_reactions": 1,
      "user": "spadenx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "I enjoyed this movie alot more than I thought I would. I never got into the first Tron so I wasn't up-to-date on what was going on. I thought the soundtrack was awesome as well the environment. I wasn't impressed with the acting in the movie whatsoever and the story was kinda weak. But it was a decent film to watch when nothing else was going on and I'd recommend it to someone who liked the original Tron and someone who might be interested in the new animated Tron: Uprising series coming out soon.",
      "total_reactions": 1,
      "user": "Kenmei"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Tron is a great idea, great concept and to be remade was the ideal of taking a chance. Well, in my opinion the chance was taken and the product was a dozy. Director Joseph Kosinski really showed the world how much of a force he will be in the directing world remaking a movie that was not supposed to be remade and pulled it off. The visuals are stunning, arguably the best of the year and Jeff Bridges and Olivia Wilde are outstanding. Garrett Hedlund is just ok and the CLU clone is kind of creepy from time to time but gets the job done with the technology. Though most remakes are nothing compared to the original, this Tron is definitely on par if not better than its predecessor.",
      "total_reactions": 1,
      "user": "Olidegu2012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "An absolutely marvelous film with breathtaking visuals and beautiful art direction. So much of the spirit of the original film is in this one with references for the fans of the first movie to smile with pride for understanding.",
      "total_reactions": 1,
      "user": "paulgreen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "I have no idea why critics have put so low rating on this movie. Not an absolute masterpiece, but this very unique movie allows you to throw a sight on bright computer world alongside with marvellous Daft Punk music. Fights are very bright and dynamic. Olivia Wilde is very hot, and Jeff Brisged is cool also. If you are fun of cyberpunk this is your movie, even if you are not  definitely worth watching. I bet half of critics who gave this movie low rating is old grannys afraid of explosions, flashes and speciall effects.",
      "total_reactions": 1,
      "user": "Violett"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Despite some negative critic reviews, this film remarkable. To see it in IMAX format was breathtaking. The visuals are amazing. I felt immersed in the Gaming Grid. The musical cues are spot on and Daft Punk creates the atmosphere like no other. I'm certainly looking forward to the next 2 movies.",
      "total_reactions": 16,
      "user": "ShocKNursE"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 6,
      "text": "It's an incredibly cool visual spectacle - that's beyond debate. Could much more have been done with the story? Sure.  Did I expect an Oscar-worthy screenplay? Nope. It's fun, there's much more of \"The Dude\" in Jeff Bridges' character than I expected (which generated a ton of laughs in my theater), and I'm actually looking forward to a second film.  So did it meet my very modest expectations?  Yes.",
      "total_reactions": 11,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Ignore the critics as clearly they don't know what they are talking about. TRON: Legacy isn't just spectacular effects and a fantastic thrill ride full of character and not a weak link to be found in the cast.",
      "total_reactions": 11,
      "user": "MozBlue"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "I LOVED this movie. I had to see it twice on opening day, in 2D and 3D. I can't for the life of me understand all the hate for this film? Did you see the original or did you simply catch the highlight reel? There is a story being told here, a very well told one. The only drawbacks to the movie are some 3D scenes aren't up to snuff and CLU in his representation isn't quite there, but still effective for the character. On the same hand, some of the 3D effects are simply breathtaking! The opening sequence and lead up to the final sequence were amazingly well done. The story was clear and well told, filled with interesting and lovable characters (I dare you to not fall in love with Olivia Wilde). This film is a sight to behold and is a treat for the ears. See the original Tron first, as you should with any sequel. Easily one of the best movies to come out this year.",
      "total_reactions": 10,
      "user": "ZeroRageX"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "I totally loved this movie. A great follow on from the classic film. The visuals are great, the sound is stunning with the music not being a separate layer - rather a integral part of the narrative.  How this film has such a low rating is criminal. It really shows how far the \"film critic\" class is away from what real people love and want to see. If you want a fun, thrilling, great family movie this Christmas i would say it's gonna be perfect for you. Just don't expect it to be full of loads of Freudian rubbish and metaphorical bull. ;)",
      "total_reactions": 10,
      "user": "BenMills"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Come on! What are you guys talking about... the movie was great. It's TRON. The goal of movies like this is to be epic, beautiful, and other worldly - The complexity is in the visuals, the story is there to move you through them. Any special effects fan will love this film!",
      "total_reactions": 5,
      "user": "DefaultArtist"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "\"TRON: Legacy\" is certainly better than its corny prequel \"TRON\", but still its level of depth is shallow.",
      "total_reactions": 5,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "After reading all of the negative reviews, I was surprised to find the movie to be AWESOME. It stays true to the original, while introducing enough new elements to, well, make it new.",
      "total_reactions": 8,
      "user": "jz3"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Amazing visuals, sound, and acting, and the plot ain't too bad either. I have never seen a movie that has had reviews that are so far off the truth about the movie. Tron will have you immersed in beautiful visuals and beautiful sound (thank you Daft Punk) and the plot easily outclasses other sci-fi blockbusters (*cough*Avatar*cough*).",
      "total_reactions": 8,
      "user": "ijwhelan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "While not perfect this movie was incredibly enjoyable and worth the money to see in theaters.  The visual style of the film is by far the best part with stunning shots of a cyber world and an outstanding style that made the first one so loved.  The musical score really does a great job emphasizing the mood and pace of the movie and is as important as the acting.  As for the story I personally really enjoyed it and thought the cheese was minimum.  I especially liked that it wasn't your classic \"son is mad at dad\" story, it takes a different approach that really shows how most father-son relationships are.  Overall if you like sci-fi, creative visual style, or just love Daft Punk I would highly recommend this movie.",
      "total_reactions": 4,
      "user": "Neilieo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "The characters and plot are cliche and the writing certainly is not the best. The acting is decent with the standout being Jeff Bridges who as usual is the man. This would all make for a mediocre movie if it weren't for the amazing world and visuals created by special effects. The great music by Daft Punk certainly doesn't hurt either. Tron Legacy's world is creative beautiful and must be seen by everyone. I couldn't look away for a single second and although the writing and acting weren't the greatest it is good enough for you to care about the characters enough to warrant your attention. I recommend this movie to almost anyone and you don't need to see the first one to know whats going on if that is scaring you.",
      "total_reactions": 4,
      "user": "Paranoidandroid"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Critics really are full of s*** sometimes. What a brilliant film this is! Fantastic visuals, great cast (I especially loved Olivia Wilde in this movie; her very innocent, good natured character was really cute and  charming; and she was a truely awesome warrior in battle), amazing score. It was entertaining and epic; and isn't that what a movie is supposed to do? It also felt like a real tribute to the original Tron movie. Yes, the light cycles and suits were different, but it's the year 2010 now people. The 3D element was done to perfection, I especially liked how the movie starts in 2D in the real world and then shifts to 3D when Sam enters \"The Grid\", very clever. I enjoyed this movie so much I went to see it again today after seeing the midnight showing last night. It's a must see.",
      "total_reactions": 7,
      "user": "Dralen"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "The critics can't seem to make up their minds with what they wanted this movie to be. I've seen complaints that it wasn't light-hearted enough just as often as I've seen people suggesting it could have dealt more with the complex problems of digital culture today.",
      "total_reactions": 7,
      "user": "seenew"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "\"Words Can't Describe , the intensity , the Graphics , the Tron!. Tron Legacy is one 3D spectacle that dares to be reckoned with , its truly amicable , from the moment you enter the grid till you leave .. Tron Legacy will have you wanting more\" .. A",
      "total_reactions": 6,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "The critics can s*ck it. The movie was great. Great visual effects, good story and acting. Amazing score. It was definitely better than Avatar.",
      "total_reactions": 6,
      "user": "Cuban_Nerd"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "I saw this at midnight showing last night and I was blown away. I was worried that it was going to suck but I kept my expectations in check and I was not dissapointed at all. It really was a good story. Its deeper than these crtics realize i guess because they were too distracted by the amazing visuals. If you like a good action movie with a good story and an amazing soundtrack you should see this. Also there is no other way to see this movie but in IMAX. Please don't see it any other way. Can't wait to get it on bluray.",
      "total_reactions": 6,
      "user": "oanda"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "I can only say that if you want to see a movie with stunning visuals, a presentation of a new and fantastic world, a good cast and a decent story, I say go for it, but if you're the guy that sees a movie solely for moral messages, complex character development and a deep undertaking in the human mind, this isn't really a movie for you.",
      "total_reactions": 8,
      "user": "DarthSatoris"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Having seen the previous film only a few minutes before sitting down in the theater to see Tron Legacy, there were a number of areas in the newer film that clearly stood out as similarities to the original film. In fact, there are so many similarities to the original film in pacing and storytelling, that Legacy actually manages to feel like a curious hybrid of sequel and remake.",
      "total_reactions": 5,
      "user": "TellarHK"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "First of all, movies are meant to be enjoyed, not dissected and picked apart like some puzzle or algorithm. Tron Legacy is a Family friendly movie with keen aesthetics and balance. This story had a simple premise comprised of multiple intellectual thoughts. As this Film is clean and neat with the thought of the \"what if\" scenario that tries to answer as much as it can while posing more to be questioned all amidst the impending fate. As far as technology goes, what else can we expect to see other than what we know in a more polished state with the aesthetic depth and crisp 3D? This movie is easy to see, great to enjoy at various levels and with a good musical backdrop and follow through. My wife who is not as technologically inclined enjoyed the movie and loved the music. You don't have to be a Nerd, Psychologist, Scientist, Hacker, or any other stereotype to enjoy this great film, that we the viewers did not have a hand in making, so by all means if anyone can do better... all said and done we were left satisfied and understood the many levels of intellect of the feature film. For those that liked the first, will no doubt enjoy this re-envisioned remake sequel that does exactly what it is supposed to in an adventure. spoilers..... spoilers",
      "total_reactions": 7,
      "user": "Megaguy84"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "This movie is amazing. Don't listen to the critics. Critics ruin all good movies out there with their know-it-all, snobby attitudes and biased bad reviews. It is in the spirit of the original film and isn't watered down.",
      "total_reactions": 6,
      "user": "killingspree"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Tron Legacy may not have had the deepest plot, but it was a good movie. People forget that they go to the films to have fun and escape. The stylized effects mixed with Daft Punk's musical score was excellent. I enjoyed this movie and plan to buy it on release. Don't listen to the critics, they forget what movies are about.",
      "total_reactions": 6,
      "user": "Idontpanic42"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Once again, \"professional\" critics are off the mark.  WAY off!  This movie was very entertaining and the music was perfect for it.  It was beautiful, in fact.  One critic said they \"forgot to tell a story\"...I say he forgot to pay attention.  Another said the music \"lacked rhythm\"...to that I say TRON wasn't a dance party, it was a life-or-death struggle.  The music reflected danger, fear, and the ultimate victory that the movie was all about.  Users have spoken: this was a great film and it deserves recognition.",
      "total_reactions": 6,
      "user": "Sio"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Tron was both visually appealing and emotionally capturing.  I loved the father / son story.  I thought all three lead actors did great - Bridges was particularly engaging.  Wilde was fun and in-character.  Content was kept at a good PG level, which I appreciate in an adventure film.  The 3D IMAX experience was a great choice for this movie, and a lot of fun viewing.  I'll see it again and I recommend it!",
      "total_reactions": 4,
      "user": "mgeek"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 6,
      "text": "After 28 years, this is all they can come up with? Sure the visuals were eye-watering with all the pastel colours, the action sequences (disc duel, light-cycle battle) were great and we have the great Jeff Bridges... but the plot was weak. Reminds me of \"Star Wars: Episode 1\" where they took great care of the gadgets/gizmos/tech but no the story. It is not a total waste of money to watch \"TRON: Legacy\" though. What about the 3D? Oh dear. This is becoming old - - the \"3D trailer\" does it right (when shown ahead of a feature length 3D film in cinemas), but the actual \"3D movie\" itself does not work. Considering that this film was shot in \"3D\" (with some scenes in 2D, there is a note at the beginning of the film), it is a letdown. I just don't get it. There were no moments where you would go \"Whoa, now that's 3D awesomeness.\" Watch it in 3D to get the ultra-sharp, super clear and pristine image quality. But don't watch it in 3D to get in-your-face 3D moments. The movie will feel draggy (and boring at times) thanks to the \"for the money\" acting performances. Even Jeff Bridges couldn't save the painful human interaction. He did well for his part though. The human connection is barely there. It feels really cold. Where \"TRON: Legacy\" excels is at the visual effects department, and the music too thanks to Daft Punk. Michael Sheen's role of Castor was very, very underused. Overall, this is an OK movie but not great. Not a total waste. Watch it for the visual delights (CLU was incredibly realistic but still noticeably CGI) but not for the story or the human drama.",
      "total_reactions": 4,
      "user": "john_galactus"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Gotta agree with the critics some on this.  Probably better to watch on its own but with a title like Tron Legacy, they'd have to expect you may have seen the first one.  It does not compare favorably in my opinion.  I own the original Tron and love it.  And this is not Tron.  Too damn serious for one thing.  I know the character was supposed to have heard all about the Grid from his dad's stories but he still should have inspired some sense of wonder at the place when he eventually gets in--Jeff Bridges did so much better in the original.  And the visuals?  The magic with the first Tron was that EVERYTHING was computer-generated.  Here they have actual REAL models for the light-cycles and light-bikes.  The movie was just as awkward as the dinner scene with newly reunited father and son.  Cooked food?  Hardcovers?  In the digital realm?  WTF?  Some nice references to the old movie and 80's nostalgia.  But it was all flash and no soul.  The tech to create \"young Jeff\" was not as bad as it could have been.  But, again, the original movie, everybody's face looked pale because of graphics not because of makeup, everybody's costume \"seemed digitized\" not like real tights, and whose bright idea was it to make \"deresolution\" look like glass breaking?  There wasn't even the laser to \"scan\" Sam into the Grid.  And no Cursor--the only nod to actual computer tech was some UNIX-looking (probably MacOS X) commands typed in.  If this was an attempt at upgrading the Grid, it was mistaken.  Do people expect a better, more visually complex Grid 20 years later?  Yes, but they could have executed much better given that CGI today is light years ahead of where it was then.  This movie supposedly continues where Tron left off and it does explore territory the original Tron didn't.  But I would rather watch old Tron than new Tron.  Although he was the best actor in the film, even Jeff seemed like he was more interested in making True Grit than this movie--it even comes off that way in his very few promotional appearances for it.  The movie was eye-candy, but ultimately emotionless.",
      "total_reactions": 2,
      "user": "BrahmaBull"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 6,
      "text": "For me, it scrapes a positive review. An average storyline is well covered up by the visual effects and soundtrack that this movies offers, if I was rating it based on that it would easily be a 10 but I'm not so it only gets a 6/10.",
      "total_reactions": 2,
      "user": "GarethCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 4,
      "text": "TRON: Legacy may be visually spectacular, but it's an incredibly flawed film, even for a shamelessly profit-driven Disney Blockbuster. It begins well enough, with satisfying links to the original film, and the first hour or so is pretty entertaining and energetic storytelling. Garrett Hedlund, while not the most talented actor or compelling protagonist in film history, has the right confidence and swagger about him to convincingly portray Jeff Bridges' son. Bruce Boxleitner is decent in his reprisal of the role of Alan Bradley/Tron, but his role this time round is a little limited. Michael Sheen unquestionably steals the show as the flamboyant Bowie-esque nightclub owner Castor. Olivia Wilde is pretty awful as Quorra, and her character is nonsensical, even for a film about someone being transformed into computer code, but the real disappointment is Jeff Bridges who looks bored as the old Flynn and downright terrifying as the de-aged Flynn/CLU. The script is also dire, and the story becomes offensively dumb from about an hour in. Thank goodness for the fantastically catchy electronic soundtrack provided by Daft Punk - it almost makes up for the inconsistency of the rest of the film...almost. TRON: Legacy has fantastic visuals and competent action, and a standout performance from Michael Sheen, but it's been a while since I've seen another film that's so moronic and packed with bad ideas. And I'm sure the filmmakers got Cillian Murphy in for a two minute sequence for some reason...but I sure as heck don't know what that reason was.",
      "total_reactions": 2,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2011
      },
      "score": 5,
      "text": "Visually fantastic, with amazing music and great action scenes, but the plot is uninspired and the story feels very much like a cop-out. Good popcorn flick, but no one will remember it 20 years from now",
      "total_reactions": 10,
      "user": "KarthXLR"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "This film could have been this years \"Star Trek\", the stage was set. It had the dazzling effects but fell short due to Hedlunds weak performance and script that was originally designed to take the backseat when it was need to steer this film.",
      "total_reactions": 5,
      "user": "brewcrewpride"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2011
      },
      "score": 3,
      "text": "The only positive things about this movie are the special effects and Jeff Bridges. Their plot was incredibly bad, almost to the point where I left the movie theatre. If you can overlook writing and a plot that any amateur could have done, the special effects are worth seeing, but I wouldn't waste my time on it knowing what I know now.",
      "total_reactions": 9,
      "user": "TimtheEnchanter"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2011
      },
      "score": 5,
      "text": "despite , the stunning visuals in the grid, the movie lacks the tempo and does not get to a convincing end. after it began a perfect way , the first half ran well. second half entered back into the same kind of revenge drama. all the characters in the movie had no life. sam and flynn characters needed a much better life to the movie. soundtrack is different. rest all are ok. finally tron: legacy begins for the best. ends as a dumb movie.",
      "total_reactions": 3,
      "user": "sreekiran"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "I saw the original Tron movie when I was a kid, and I absolutely loved it.  The visuals and the concept really appealed to me, so I was really pumped to see Tron: Legacy in 3D.  I must say really enjoyed it.  T:L kept to the spirit of the original, as well as building upon certain aspects of the Grid.  The visuals are absolutely stunning, and Daft Punk's score is magnificent..  The story is a little light, as it was in the original, which is one of the few drawbacks to the film.  The use of 3D was also very effective; it wasn't forced \"in your face.\"  Instead, it was used to support and enhance the visuals of the movie, so you sometimes forget you are watching a 3D movie because the visual aesthetic works so well.  All in all, if you are a fan of the first Tron, you will most likely like this film.",
      "total_reactions": 3,
      "user": "Gr33nF00t"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 6,
      "text": "A good time at the movies, provided you don't expect Matrix 2 level techno-philosophy. This movie is bright lights moving fast and loud, the equivalent of cinematic fireworks. That's as much a knock as it is praise. See it in IMAX 3D or don't see it at all.",
      "total_reactions": 3,
      "user": "DudeManGuy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "\"Sure it's not an Oscar-worthy, deep, intelluctual sci-fi masterpiece, but why should it be?\"",
      "total_reactions": 3,
      "user": "JMB"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "If you are a big fan of the original then you will probably like this movie.  Otherwise, don't waste your time.  The CGI of young Jeff Bridges is mediocre and distracting throughout the film.  Weak story.  Very predictable.",
      "total_reactions": 3,
      "user": "Sparkyibew100"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 4,
      "text": "Do NOT see this movie. Although the costumes, visual effects, and sounds are state of the art, the rest of this movie just sucks. Although Jeff Bridges once again comes through in his acting, its not enough to make this movie watchable",
      "total_reactions": 3,
      "user": "matthewleib"
    },
    {
      "neg_reactions": 29,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "Weak. Weak story. Weak 3D. Light cycles were pretty cool. Olivia Wilde was hot. Fight scenes were so so. Seeing it once was quite enough. I loved the original. This should have been so much more.",
      "total_reactions": 43,
      "user": "Shoki"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 0,
      "text": "Hated it!  The Tron movie absolutely stinks.  I'm a real fan of science fiction movies like the matrix, inception, and avatar,   but Tron did absolutely nothing for me with its unengaging storyline.  The 3d visual effects were cool in the beginning but the movie had no emotional substance and I couldn't wait for it to be over. Don't waste your money on this clunker. Tron is a dud.",
      "total_reactions": 7,
      "user": "AceGolfman"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 1,
      "text": "Is this what we've become? Applauding a less than mediocre attempt to jumpstart our childhoods? Sorry, this is just a bad movie. Sure, it winks at the original. Sure, the dude is cool. Sure, it's very very pretty to look at. But, what do you walk away with? What motivation is there for more? As bit would say: Nonononononono! Bad script. Boring for about 85%. I walked out sad. The light cycle match was beautiful. Stay for that, then just go. The critics are right.......and I hate critics.",
      "total_reactions": 18,
      "user": "zapjones"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 2,
      "text": "Try to look up Tron and you get Legacy on the net. And what was the girl's name in the first film? A Michelle P knock off...Olivia Wilde is hot but so what? It's basically the film redone, but, again, who cares? Good effects don't make a film. Yeah, in this case, the first film was better. Better villain, etc. Too bad. Glad I spent no more than 7 dollars U.S. on it. Didn't waste my time with 3D or IMAX either. Best lines are throw-away. Some times life is more than just wants and needs...but life seldom goes beyond that. Libations for every one...because I can't stand the fact I'm sober and having had 2 plus hours wasted afternoon.",
      "total_reactions": 12,
      "user": "GOUGH"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2011
      },
      "score": 0,
      "text": "This was so bad that I would have walked out of it if I had been by myself. The dialog and the characters were ABYSMAL and there was absolutely nothing special about the special effects.  I can't Jeff bridges agreed to this complete crap-fest.",
      "total_reactions": 4,
      "user": "austenite"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2011
      },
      "score": 0,
      "text": "weak. weak weak weak. nothing surprised me or stopped me from almost taking a mid movie nap. had to keep shoving popcorn in my mouth to stay awake. fight scenes were pretty cool, but storyline was generic, just disney once again taking a possible awesome movie and making it an average piece of sh@#.",
      "total_reactions": 4,
      "user": "ghostface"
    },
    {
      "neg_reactions": 48,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 3,
      "text": "Iâ",
      "total_reactions": 62,
      "user": "boydimages"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "Man was I let down.  The story was awful,  the acting felt like they were there for the money.  I give it a 5 cause i loved the 2 action sequences there were.  I was really looking forward to this one.  Not sure what they were thinking.",
      "total_reactions": 9,
      "user": "rucknrun"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "It boasts one of the best assembled casts, who work well together, and has some just stunning visual effects, but you don't really know what is going on because the special effects are to distracting. I give this film a 48%.",
      "total_reactions": 10,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 1,
      "text": "That was the worst movie of the year I could barely sit through it.The storyline was awful so they try to make up for it with special effects.they try to wow you with 3D which wasnt so special because every movie has that now.Do yourself a favour and dont see this film",
      "total_reactions": 5,
      "user": "classic_rocker"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 1,
      "text": "I took my younger brother to see this movie, and we wanted to walk out of the theater it was so boring. This movie was trully disapointing. The begining was pretty good, but then got boring, and the ending was completely predictable. I watched the origanal Tron and it was very good, and sadly this movie killed it. WASTE OF MONEY!",
      "total_reactions": 6,
      "user": "MCoca36"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 0,
      "text": "Wow. The visuals were great but that's about it.  The dialog is so bad it feels like they found TRON fanfiction online and decided to run with it as a script. At one point, a very zealous security guard chases the main character to the very top of a sky scraper, and greets him with, \"Hey! didn't anyone ever tell you that stealing is wrong!\"",
      "total_reactions": 14,
      "user": "bobsagget"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 2,
      "text": "Overall disappointing.  Amazing CG and music.  OK 3D effect.  Unfortunately, simpleminded \"for 6 year olds\" plotting and movie grinds to a halt several time for droning \"backstory/exposition\" dialogue.  Certainly not a strong story to go with the pretty visuals.  Jeff Bridges is wasted.",
      "total_reactions": 7,
      "user": "anonymousse"
    },
    {
      "neg_reactions": 16,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 0,
      "text": "This film was terrible. It was worse than the origional. at least the origional had a story and plot, much like the new star wars films. Like why did they keep the disks on there backs where there easy to steal........also if the army went through the portal they would all end up in a small room which would cause the world to implode.......",
      "total_reactions": 17,
      "user": "Kevin__Flynn"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "\"Oops.\" That's how the romantic puts it, when he realizes his grave miscalculation. Nobody will be looking for him. The weekend warrior is off the grid, and with his food and water supplies approaching near-depletion, the romantic finds himself suddenly full of regret. At the very least, he should have told his boss. The foolhardy rock climber is indeed between a rock and a hard place, just like Kevin Flynn(Jeff Bridges), who gets stuck between a floppy and a hard disk when the computer programmer misses the zero hour of the portal, leaving him trapped in cyberspace at least a 120 months. Oops. But he's no Aron Ralston, the lone wolf explorer(portrayed by James Franco in Danny Boyle's \"127 Hours\"), who made his peregrination to the outback without telling a soul, and almost paid the ultimate price, by an arm's length. The video game creator left behind tracks. Big ones. \"Tron: Legacy\" opens up in 1989, the last time that Sam will see his father as a child. On this last night, Kevin tells his son about the miracle: the grid, the digital frontier that he helped create with Clu and Tron(in other words: he, \"himself\", and Alan's avatar), so when the Encom CEO turns up missing, Sam(as well as Tron's \"user\", played by Bruce Boxleitner) should know where to start looking for him, but the time-condensing scenes that bridges the then and now, seems to indicate that during the intervening time, nobody entertained the possibility of the obvious, as to the senior Flynn's whereabouts. Is the boy an idiot? Talk about \"sound and fury signifying nothing\", in which Sam, left fatherless and without direction, grows up angry, sabotaging his dad's company on a yearly basis with some elaborate prank, when all the boy needed to do was conduct a canvassing of the his father's old haunts, which would have eventually led him to the video arcade, and a less-dramatic reunion. Finally, after learning from Alan(who knows about \"the grid\", too) about a page that the boy's guardian received from his father's office, Sam goes to Flynn's, perhaps for the first time in two decades(the electricity was never turned off), and at long last, discovers the secret room behind a coin-operated video game. So even though he's pushing thirty, Sam(Garrett Hedlund) gets to live every quarter-poppin' boy's fantasy back in 1982(to be Mario; to be Pac-Man; to be the man on the ostrich in Joust), when he infiltrates the electronic landscape and becomes one with the gaming light. How much better would \"Tron: Legacy\" be if Sam was younger? Most likely, a lot. By accident, though, his relatively advanced age works as a social commentary on the gaming industry's demographics, which, of course, includes Sam's lot, when in fact, video games probably started out as a child's preoccupation. Not surprisingly, the younger Flynn, with no discernible career plans ahead of him or family to speak of, essentially is still a kid, undergoing an extended adolescence. He has time to play Tron. Like its Steven Lisberger-directed predecessor, \"Tron: Legacy\" gets weighed down by a muddled story, ostensibly written by a human, yet seems more like the work of an Atari 2600(and the Sears knockoff), but unlike the original 1982 \"Tron\", the special effects aren't nearly distinct enough to offset the dearth of narrative wizardry. Despite being less elaborate than the latest in CGI technology, the spectacle created by Harrison Ellenshaw and Richard Taylor had the look of a video game, and was heavily invested with intellectual properties that the new effects flat-out lack. Whereas the light cycles and neon frisbee death match correlates nicely to the graphics in a coin-operated machine, its newfangled re-imaginings are too elaborate, not looking at all like something \"God\"(circa the 80s: the time period that Flynn was supposed to have invented this \"new frontier\") could have created. The effects should look like something a player could manipulate with a joystick. That's what made the original such a joy to behold. It looked playable. As a result , the two films don't seem connected, despite the presence of Jeff Bridges, whose Kevin Flynn resembles something straight out of a Samuel Beckett play, waiting for Sam like he does. When the two men meet, both father and son should be furious at each other, but an argument about the boy's tardiness would have emphasized the looming plot-hole, which presents itself loud and clear enough already during that long-ago bedtime story that the father imparts to his son.",
      "total_reactions": 3,
      "user": "Shiira"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2011
      },
      "score": 5,
      "text": "This could have been such a great movie. Visually it is simply amazing, the art direction is great, and the CG in general is amazing (with the exception of the young jeff bridges). But after the first half hour the story becomes boring and unfocused. The slow action sequences do not help either to push the story forward, and after 2 hours you are begging for the film to finish. This is what happens when you give such a complicated film to a new comer director, and some tv screenwriters (as good as they are, the film story format is quite different from tv).",
      "total_reactions": 1,
      "user": "Pier"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "TRON: Legacy was an absolutly amazing science fiction movie of all time! It is this year's Avatar or better! The effects were dazzeling, the music was awesome, and everything was just great! Though, the storyline wasnt that great, but other than that TRON: Legacy did deliver a great performance for all of us.",
      "total_reactions": 1,
      "user": "Rob274"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2011
      },
      "score": 2,
      "text": "This isn't at any means a good movie. It fails in each aspect; the only positive of the movie are its special effects. Can't believe someone would give it anything more than a 4. It doesn't deserve nothing near it, as the script has nothing appealing and fails to get one's attention. The whole forced drama plot is preposterous and Olivia Wilde's character is just absurd. Kevin's horribly acted and seems to play God, (at least this is how Quorra seems to see him; her speech about Kevin was embarrassing.)",
      "total_reactions": 2,
      "user": "Scholles"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "If you are going to see this movie and are expecting lots of actoin then don't. but if you want too see the movie for the not so good anyway story then see it. but overall its really not that great of a movie.",
      "total_reactions": 2,
      "user": "peoplewhomatter"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "This film is **** but for todays standard what film isn't?",
      "total_reactions": 1,
      "user": "siddersft"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "A masterpiece that definitely lives up to its predecessor. However, I don't get why some critics are whining about the script/plot.  It seriously wasn't that hard to follow. Personally, I had a harder time following Inception's plot, and I saw the damn movie twice!",
      "total_reactions": 1,
      "user": "gm101"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 3,
      "text": "Visually gorgeous, yet abysmally retarded, this outrageously poor follow-up to such a ground-breaking film was better off left in someone's mind.  While I'm not averse to the movie-with-a-message, this movie was so ridiculously PC it made me openly groan several times during the movie.  Instead of respecting the first film's cutting edge theme, the filmmakers chose to one-up the graphics, which with 25+ years-later technology available, I would certainly expect, and dumb-down (while simultaneously backslapping the heart) the concept that was so pioneering that it was better left alone.  Unfortunately, in between weak, watered-down action scenes, we get elementary dialogue, poor acting and way too many messages about why building the perfect digital world has made us neglect and forget the perfect world in which we already live.  To top it off, we have a techie-gone-hippie Kevin Flynn, played by a tepid performance by Jeff Bridges who can't help but occasionally morph into \"The Dude.\"  Sure, we all change as we get older.  And, absolutely, we come to appreciate the world around us more as we increase with age, but this movie needed a Wachowski Brothers-like approach to the action and deep theme in order to warrant any serious consideration.  Instead it was written by people who have spent more time on CW teen dramas than anything of technical substance.  If you haven't seen it and love the first one, don't waste your time or memories on Tron Legacy.",
      "total_reactions": 2,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "This sequel to the cult classic puts the son of the original online adventurer (Jeff Bridges) in his father's \"grid,\" an ultra-high-tech computer world. There are a couple of flashy races and the design is sleek and neon beautiful. There's also way too much talk and nonsense plot to drag the momentum to a standstillâ",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2010
      },
      "score": 2,
      "text": "Crap.  Weak story, poor character development, and a dumb paint by numbers climax.  The only thing that makes this worth seeing is the visuals and even they are merely okay.  What a disappointment.  Three of us where bored and ready to leave the theatre.  Let's hope in another 20 years they do a better job of TRON 3.  Even Jeff Bridges was boring in this one.  Disney has had two cracks at this franchise and still haven't made a good movie.   Call Pixar, Walt.",
      "total_reactions": 4,
      "user": "JohnQPublic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "Its visuals are as stunning as its dialogue is awful. It is worth-seeing in a theater, especially in IMAX, to revel in its special effects and sound, but, my God, the dialogue is laughably bad. It also doesn't help that it's at least 30 minute too long, with an increasingly tiresome plot.",
      "total_reactions": 2,
      "user": "Tony"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2010
      },
      "score": 4,
      "text": "This was the worse film I've seen since \"Splice\" earlier this year.  The four stars given are for the visuals - without them it is a one star film.  Clearly this is not a good year for Science Fiction.  The plot is SO slow and plodding, and the dialogue - well, you have to hear it to believe it.  \"Tron - What have you become?\" - laughably bad.  All of the money was spent on the visuals, certainly not on the script.  I'm a fan of Jeff Bridges but his talent is wasted here.  The visuals are great, and I saw it in 3D and it was one of the better films to use that technique, but I found myself looking at my watch at least three times hoping it would end.  Everything is totally predictable, and borrows heavily from other Sci Fi movies.  If they make any more of these films I hope they concentrate more on the script next time.",
      "total_reactions": 3,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2010
      },
      "score": 3,
      "text": "I can't say much without spoiling the whole movie so I won't. I will say the story is too simple and slightly confusing. The special effects aren't that great and Jeff's CGI face looks like a bad PS2 game especially when put next to real humans. The combat (ground and ship) is never satisfying or impressive, and the characters are all shallow and cliche.",
      "total_reactions": 1,
      "user": "jonathanM21"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2011
      },
      "score": 5,
      "text": "With such a weak plot the only fall back for the viewer is the visual effects - and even that wasn't particularly groundbreaking - despite some nice effects.  It was at least 30 mins too long, way too much unnecessary dialogue and general banter with consequently several \"just get on with it\" moments.  When the viewer gets  so bored that they're no longer very interested in the final outcome, that makes a movie a failure.  A pity because if it had just had a better story and contained more humour and fun (without even having to enhance the effects) this would be an 8/10 movie.",
      "total_reactions": 3,
      "user": "gregga"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 4,
      "text": "Visually stunning and comes with incredibly cool toys, Tron: Legacy still fell flat on the story and had a very dull script. The story is about the son of a virtual world designer (Garret Hedlund) goes looking for his father (Jeff Bridges) and ends up inside the digital world that his father designed. He meets his father's creation, Clue (Jeff Bridges), turned bad and a unique ally who was born inside the digital domain of The Grid. Jeff Bridges played both the role of Kevin Flynn and Clue in this film. If you hadn't notice, they digitally rearranged his face so he'd look like a younger version of himself. Now talk about the 3D, sure the movie looked cool and all but the first thing popping up on the screen was \"This film is not all in 3D, some of its parts will be in 2D since it is shot that way.\" Basically it meant the movie was converted at the end. There was not one scene that was meant for 3D that I can see. Although I loved the way the film looked and how cool the premise is, the 3D is laughable and the dialogue is annoying made Tron:Legacy fell short from its original.",
      "total_reactions": 1,
      "user": "OscarPicks2010"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "I have this film kinda sucked. The story was weak and so was the script. Jeff bridges in this film, as his older   Self doesn't seem to do much or no way near as much as the first anyway. His CGI self, although much more involved, doesn't look great as his cold dead eyes distracts you from the films otherwise spectacular visuals. I seriously think that the only good thing was Olivia Wilde. But seriously Disney, if your going to make another one, improve on the story!",
      "total_reactions": 1,
      "user": "Liquidsnake69"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "Stunning visuals, complete eye candy! Tron script won't win the Pulitzer Prize but amazing 3D experience.  Good family fun during the holiday season for all of us.",
      "total_reactions": 2,
      "user": "Amphibian"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "This movie is an example of one that it's trailer was amazingly better than this. The trailer pumps you up, makes you want to see, feel and enjoy the action, but the end product disappoints.",
      "total_reactions": 3,
      "user": "KujiPR"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "Great visual effects. Decent enough story for a film that is special effects focused. It starts off strong, but part way through I found the pacing becomes sluggish and disjointed at times.",
      "total_reactions": 1,
      "user": "Sacrifice"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "The movie didn't have to be 3D, because most of it wasn't, but the 3D scenes were nicely done and the digital visual world was pretty cool. The first half of the movie was somewhat intriguing and interesting. But the second half really hit a lull and didn't recover. The dialog was horrible and the characters dull, almost trite. Some of the story seem borrowed from Star Wars.",
      "total_reactions": 1,
      "user": "robarahz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2010
      },
      "score": 3,
      "text": "Daft punk's soundtrack is outstanding, but is hard to think of any other reason to watch the movie. The visuals are great? Indeed they are. But  you can't stand watching a whole movie only for its visuals, specially as they are the same in all the movie. It seems that the designers first created wonderful images, but then run out of ideas. Action sequences were not as entertaining as they should have been and the plot was developed terribly. There was never tension, and the audience never really connects with any character. Acting is good, though not great. Jeff Bridges, Olivia Wilde and Beau Garrett did a great job. Hedlund's Sam Flynn is however a soulless character; he acts as if he was a bored teenager playing videogames all the time. There was more humanity in Quorra, a 'program', than in Sam, the 'user'.",
      "total_reactions": 1,
      "user": "Anbrinco"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2010
      },
      "score": 4,
      "text": "Visuals: Fantastic. Writing, direction, acting, basically everything else: Awful. It was fun to look at, though. Jeff Bridges was good. Everyone else was terrible. Whoever wrote the screenplay should never write again.",
      "total_reactions": 1,
      "user": "bizort"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2011
      },
      "score": 5,
      "text": "Tron: Legacy has really good special effects. I think thats it. Movie was interesting at times but the rest is just really boring. Couldn't really understand the story (probably because I didn't see the original). The special effects were really good but it overshadows everything else.",
      "total_reactions": 1,
      "user": "Commen0136"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "This movie is pretty much awesome, don't freakin listen to the critics! It's an amazing audio/visual experience that will definitely blow your mind!! The acting is great, the directing is great and i was pretty stunned when i saw it was made from a non-famous director. The music score... all i can say is that after i saw the movie i was in youtube for hours listening to the soundtrack.",
      "total_reactions": 1,
      "user": "johnwho"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "Deriving from an understandable desire to become free beings, humanoid computer programs turn against their users/creators. However, the way they intend to achieve their freedom is morally problematic. The programs' uprising is lead by a dictatorship that is already responsible for a genocide of an alien race with the purpose to get rid of \"imperfection\". The movie then tries to convey that the idea of perfection is often misunderstood. It claims perfection is the diversity and asymmetry appearing in nature, and therefore condemns the idea that perfection is found in geometry. This hints at the idea that geometry really is only an approximate description/a simplification of the unique wonders of the real world that helps our limited minds try to understand life. Unfortunately, most of this critical thought is not elaborated in the movie and gets lost in special effects.",
      "total_reactions": 1,
      "user": "juliankleiss"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "This movie was great. To some people it may not be because they saw the original. Like people like me i did not. So i think it was good. everyone held their role and the story line was very interseting",
      "total_reactions": 1,
      "user": "taywah09"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "â",
      "total_reactions": 1,
      "user": "Sharadadavis"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 4,
      "text": "Its really not worth watching. No seriously. The graphics are gr8.... The weapon used is a frisbee i mean come on seriously. The vehicle was sexy. And costumes were how do i put this ahhh awkward. yah. The story was just fine. The background was plain n more empty(in the program). Ya dats abt it.",
      "total_reactions": 1,
      "user": "AaronharisP"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "An excellent movie. Once in a while the critics are wrong and this movie is a perfect example. It follows the plot of the original and both the visuals and the music are astounding. Definitely worth to see.",
      "total_reactions": 1,
      "user": "enzogiovanni"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "I have many fond memories of the original film which I shall not share, only that I went to the cinema twice to see the original. I have been looking forward to this for some time and it did not disappoint. I really cannot understand some of the comments made by supposed critics, seems like a lot of \"look at me hot air.\" Tron2 is a worthy successor to the original and they have opened up a possible franchise with some of the storyline. The effects were excellent. One of the critics commented about the light cycles as being the only thing to watch. What about the motorcycle chase? The leap off the building? The arena fight?  Perhaps dear critics you should think before you write, perhaps watch the movie again (even I see new things every time I watch it) and then comment, but that would be too sensible.",
      "total_reactions": 2,
      "user": "ALF"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2011
      },
      "score": 2,
      "text": "This is a lifeless, dull film that looks as drab as the script reads.  But the major issue I have with the film is that it so often looks \"real\".  A shiny solid slick place instead of a realm made of bits and bytes.",
      "total_reactions": 3,
      "user": "spacecaptain"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2011
      },
      "score": 5,
      "text": "This movie is the embodiment of mediocre.  I love the original, even though it too had it's moments of poor writing.  Yet it was really original for it's time.  This one loses some of the originality, and has way too many terrible lines.  Even the elder Flynn throws out way too many 80's slang words.  This movie is mostly a cash in on a movie that has become a cult classic.  The on redeeming quality is the amazing special effects.  Yet the story is weak, the dialogue is poor, and much of the acting sub par.",
      "total_reactions": 2,
      "user": "McGarnagle"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2011
      },
      "score": 2,
      "text": "Crap.. what more can I say.",
      "total_reactions": 2,
      "user": "randomdude"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2011
      },
      "score": 5,
      "text": "There was a point in Tron Legacy that I decided I wasn't enjoying it. What that exact moment was I can't quite recall, but when it manifested itself it continued to hang over my head like The Sword of Damocles. I don't think Tron Legacy is a bad movie by any means, and it certainly does have enough gloss and sheen to look down its nose at anything around to date (Avatar aside), but it's just completely forgettable. Being a sci-fi fan, and especially a fan of one its more fascinating sub genres 'cyberpunk', I felt completely let down, and even a little annoyed. Finer points aside, The Matrix and the Tron movies pretty much run the same course, and are both examples of science fiction in the not to distant future that ask the fundamental question 'who are we?'. Whereas The Matrix explores this notion, in a future where identity is no longer just a physical medium, with a level of insight and philosophical debate, Tron Legacy tip toes around even the basic fundamentals and eventually ends up exactly as Disney wanted it to be... a throw away family movie with a merchandising dollar sign stamped all over it. I didn't dislike Tron Legacy, I just though it was an opportunity wasted",
      "total_reactions": 2,
      "user": "ClamBuster"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "Il fallait s'y attendre, Tron l'HÃ©ritage n'est pas une perle question scÃ©nario (histoire lisse, personnages sans intÃ©rÃªt). Mais le film se dÃ©marque (comme on s'y attendait Ã©galement) par son ambiance electro pop (bruitages, bo de Daft Punk) ainsi que par son rendu visuel Ã©poustouflant (accessoires, costumes, dÃ©cors, effets numÃ©riques). Au final, Tron 2 reste un spectacle Ã©bourrifant et grandiose.",
      "total_reactions": 1,
      "user": "avatar16"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2012
      },
      "score": 5,
      "text": "As well made as this movie is, it was let down by horrid pacing and a thin plot. The action is stunning while it lasts but the second act is chock-full of exposition and the third act couldn't make up for the dull second. I'll give credit to Daft Punk's awesome score, Joseph Kosinski for his architectural experience and Jeff Bridge's performance as an old and young version of himself, but this was a disappointment.",
      "total_reactions": 1,
      "user": "jos95"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 4,
      "text": "In a nutshell: Movie wasn't that good. Olivia Wilde made it watchable, but hell, she makes anything watchable. CLU's CGI face was truly awful.   Now, I'm a pretty big scifi fan. My shelves right now are littered with Star Trek TOS novels. I also own an almost complete collection of BattleTech novels. I'm well versed in the science fiction genre. But hell's bells, I still had no **** idea what was so special about those goddamn ISOs. Last time I checked, an ISO was something I mounted to my Daemon Tools to pirate software. They do a really piss poor job of explaining exactly what's so amazing and world-altering about these ISOs. They're just these magical miracles and it's gonna change religion and push the boundaries of human civilization and... and what the **** Why? Why are they so amazing? This is never ever explained with any degree of clarity or satisfaction. I mean, they just look like regular Tron programs with some tattoos. And Quorra seems perkier then everybody else. That's it. That's the only difference I can tell. There needed to be way more explanation. And yeah, I've heard that Tron Evolution actually does go into it and explain the ISOs in more detail, but cmon. You shouldn't have to play a video game to get a key plotpoint in your film.",
      "total_reactions": 4,
      "user": "Delta_Assault"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2012
      },
      "score": 4,
      "text": "Visually, it is amazing. The main problem is that the movie is hard to follow towards the middle, and suffers because of it. See it for the effects, but not for the story.",
      "total_reactions": 1,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2012
      },
      "score": 4,
      "text": "Eh. Cool special effects. That's about it. That's all I expected though. But I must say, the soundtrack was stellar. Daft Punk did an amazing job and I'd like to see them do another movie.",
      "total_reactions": 2,
      "user": "savannahrummel"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2012
      },
      "score": 3,
      "text": "I'm glad someone told me to watch Jeff Bridges like he was playing Lebowski because it made the film more entertaining.  I actually really like the story of this film, but its just done so badly.  It looks amazing but no one looks like they care about anything, ''Look we're in a Tron movie!'' kinda thing.  I didn't care about any of the characters apart from Tron himself but then stopped caring about him when his change of heart isn't even explained.  The music is great too, but the film is just flat as hell.  It's a shame too, because like I said, the actually backbone story of the film could of been very interesting if done right.",
      "total_reactions": 2,
      "user": "Hyperbole"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2012
      },
      "score": 3,
      "text": "This is just another movie witch try's to impress you with special effects and a weak story sort of boring for most of it. The world of Tron is cool but that's the only really interesting thing about this film. Overall Tron was a awful film. Tron Legacy 3.8/10",
      "total_reactions": 2,
      "user": "watithink123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "First time feature director Kosinski delivers thrills and a touch of heartache inside a very impressive palate of colors and noise. And I'm not afraid to admit that, as completely muddled and incomprehensible as modern action sequences have become, I enjoyed the fact that our heroes and villains were color-coded. Try to make it to an IMAX theatre for this one.",
      "total_reactions": 1,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "When I first saw this movie, I absolutely loved it. But when I saw it again.......eh. I kinda like it, but there's so much wrong with it. The visuals were awesome, the action was cool, Jeff Bridges and Michael Sheen were good, and I loved the soundtrack. But the film's bad script, lazy plot, lack of explanation for most plot devices, mediocre acting asides from the two above (although it would be really hard to be good with this bad dialouge), bad pacing, and the ending kept it from being that good. Now, keep in mind, I'm not trying to be a snobbish critic. I can always love a good dumb popcorn flick. I mean, I love Transformers 2 and I really like Clash of the Titans and the A-Team. But the action, while cool, wasn't good enough to elevate it to that level of dumb popcorn flick, and the movie took itself way too seriously, It thought it was a Matrix or Inception level sci-fi masterpiece and it wasn't. But I do recommend it. Just see at a matinee, and only see it once.",
      "total_reactions": 0,
      "user": "Bullet97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "\"Tron Legacy\" is what you would call pure eye candy with a heavy visual twist  much like \"The Matrix\"(1998) and  \"Inception\"(2010) the only thing that separates  these two films from Legacy is there deep rooted stories  groundbreaking visuals, thought provoking premises  and  phenomenal scripts from there respective directors. This sequel of the 1982 cult classic is rather simple stuff the screenplay by Adam Horowitz and Edward Kitsis is dull with uninspired dialogue and a lack of real emotions. But what the screenplay lacks the sheer power of this visuals, action, story and the return of Jeff Bridges as Kevin Flynn greatly makes up for the lack of compelling  dialogue  in this film. First time director Joseph Kosinski and cinematographer Claudio Miranda do a bang up job bringing this visually lush world to life breathing life into a rather lifeless film and in the process creating a fantastical film that literally jumps out of the screen. \"Tron Legacy\" is a massive improvement on the original in both visuals and style  what the original lacked this absorbing sequel makes up for it with a high octane, bold adventure that is ripped right from  the world of TRON, this film may lack compelling dialogue but  it has just enough intelligence, style,  charm and  just enough well written  dialogue to save this from being a disaster  \"Tron Legacy \" is a magical in the sense of its wonder and excitement, in its visuals  and its at times emotional father son tale at the heart of this film.  This film is not one of the  years best and it is nowhere near as good as any other high gloss Science Fiction adventure such as  \"The Matrix\"  or  \"Inception\" but \"Tron Legacy\" proves to be one of the years most enjoyable popcorn adventure flicks and one of the most enjoyable film  of this  holiday season. I loved every minute of this wildly entertaining film.",
      "total_reactions": 0,
      "user": "Lopez17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "This movie is probably a 7, but I truly enjoyed it so went w/ an 8. A lot of things worked in this movie, first of all the soundtrack was awesome and worked w/ every scene to perfection. Second, the action was entertaining and memorizing to look at. I truly found this movie to be extremely entertaining, but maybe that's b/c i love anything sci-fi and techno. The only thing that didn't work was the computerized version of the younger Jeff Bridges (KLU). Just looked fake.. They might have been better off just using another actor there, but i like the idea of KLU being him. Really can't complain too much about this film. Could it have been smarter or had some better acting (Jeff Brigdes' son kind of lame),  probably, but overall i was sucked into this movie.",
      "total_reactions": 0,
      "user": "Frmz84"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Personally, I think a 49 is very undeserving. I walked into this film with fairly low expectations, and was wowed with almost everything. The acting was superb throughout the entire film, the CG was phenomenal (not CLU), the 3D was nice, and the story was very good. Don't trust the critics, go watch this movie for yourself. I'm sure you'll love it.",
      "total_reactions": 0,
      "user": "EliteF50"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "Dude, it's Tron man:   people trapped in a video game, and digital elements of that game manifested as people.  If you want that concept to be any deeper than Jeff Bridges' Buddhist Jedi Programmer Lebowski, then by all means skip this one.  If you don't mind a neon stick world that derives almost all of its ideas from the Black Knight, Star Wars, the Matrix trilogy, and the first Tron--AND you think the idea of a light bike appearing out of thin air when a neon-rimmed program-sapien breaks a glowstick in two--then go see Tron and get your brain Daft Punked in 3D.  Fact:  Seeing Tron is a lot more fun than reading some socially confused movie critic's ten paragraphs about the Wikipedia version of Proust.",
      "total_reactions": 0,
      "user": "sebastian"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "I'd say it is a good movie with a bad script for the main character. Luckily, he doesn't speak too much. The face animation for Jeff Bridges is horrible, though.",
      "total_reactions": 0,
      "user": "angelrubio"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "keep watching this movie..... its an onslaught of incredible visuals and amazing music... can't stop listening to the soundtrack either... first time since star wars. Daft Punk... who I wasn't a fan of prior blows minds in this musical score. And the story is quite sellable and tolerable for both children and nostalgic adults alike. Tell your kid about the first Tron movie... and then watch this one with them. In HD.",
      "total_reactions": 0,
      "user": "dragotron"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "A visual masterpiece that oozes cool all over the place.  Tron: Legacy is an outstanding continuation from the 1980s original, one that will greatly impress viewers.  It's no surprise that Disney was a part of this given the level of technical detail put into the film.  Everything about it is great, except there's that notion of shallowness that can't be escaped.  A great movie should be rewatchable multiple times, and while Legacy does so much to entertain your visual and audible senses (Daft Punks original score for the movie is OUTSTANDING), the way the story is told feels a bit underwhelming considering how impressive everything else is.  I absolutely love this film and I hope Disney puts more into the story next time (there's confirmation that, at this time, a follow up movie is in the works).  The actors were fantastic (how can you say no to Jeff Bridges and Olivia Wilde!?), I just could have used more weight to the plot instead of a very cookie-cutter format.  Still, I highly recommend this movie!",
      "total_reactions": 0,
      "user": "SchroederRock"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "I guess the risk of making a sequel after almost 30 years is that people have expectations, and more than that their own interpretations of the original, and how a sequel should play out. I grew up with the first Tron, and went in expecting to be disappointed, but have to say Legacy might be one of the best, most intelligent sci-fi/fantasy movies I've seen in years. I don't think the story is lacking at all, in fact I think it's filled with a lot of subtle subtext rather than beat-you-over-the head preachiness you'd find in something like Avatar or The Matrix. Either way don't let the reviews turn you away, if nothing else the effects and music are top notch, and it's worth the ride.",
      "total_reactions": 0,
      "user": "stray"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "This movie was brilliant!!!The only thing i wanted was more at the end for example what happened to the company and how was the ISO adapting to life...",
      "total_reactions": 0,
      "user": "Gamingking007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "Tron Legacy: Sequel to the original which was released nearly 30 years ago. I myself haven't seen the original Tron film, so I can't say whether its a worthy sequel or whether it was worth the wait, but I will say that I thoroughly enjoyed the film. The special effects were quite awesome and the film brilliantly made use of the IMAX 3D, and managed to give us some astounding graphics within the Grid. It's good that the film makes concessions to those that haven't seen Tron, by giving us a little backstory about the first film and how it ties into the second film. The lightcycles and light disk fights are the best parts of the movie, and there should've been more of that. The acting is quite good, all of the actors give great performances, especially Garret Hedlund as main character, Sam. Martin Sheen gives the best performance, as the vibrant and ecstatic bar owner Zeus, injecting charisma into every scene he's in. And Daft Punk get three cameos as DJs, changing the song when a fight breaks out. However, this isn't a perfect film. A number of the dialogue that comes from Sams mouth sounds quite cliched and the script isn't exactly oscar-worthy. It isn't exactly a surprise when Zeus betrays Sam to CLU and it seems pointless having Quorra send him there in the first place. And the final part in the grid where Flynn has CLU bond back with him makes you think \"why wait until now to do that?\". Also, de-aging Jeff Bridges doesn't exactly work, just making him seem video-gamey. Granted, it works for CLU, but doesn't really work for Flynn. All in all, I recommend this film. Just don't expect much of character development and go in expecting a dazzling visual for your eyes rather than for your mind",
      "total_reactions": 0,
      "user": "roddersj04"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "This is a very good movie, don't listen to the \"49\", it deserves over a 90. Enjoyable movie.  I don't understand the negative reviews but it's a good movie and worth a check.",
      "total_reactions": 0,
      "user": "xXAnthonyXx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "Highly enjoyable movie. Thoroughly enjoyed it. I thought it was a fresh take on an old classic and found the main characters believable. The special effects were good and I was mostly able to forget that I was watching a Disney movie. I especially liked the sound track and have been a fan of Daft Punk for years.",
      "total_reactions": 0,
      "user": "Jerik02"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "A sequel, that takes its colorful and somewhat goofy predecessor to the darker, giddier simulation. Having an interesting backstory and refreshing philosophical inquiries, it unfortunately falls short in capturing the main ideas and that left me wanting so much more. Acting and dialogues were rather weak, average at best. Considering Jeff Bridges put on his mentor/Dude look, you'd expect more charisma.",
      "total_reactions": 0,
      "user": "HomeCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "I watched the original about 2 weeks prior to watching this sequel.",
      "total_reactions": 0,
      "user": "jediboy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "I went into this movie with only high expectations for visual effects. I wasn't disappointed, and the story was pretty decent in my opinion. I'd recommend this movie to someone purely based on the stunning visuals and the cool soundtrack.",
      "total_reactions": 0,
      "user": "abm89"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "Great visual effects, production design, musical scoring. Nice story. Good actors and actresses. All I can say I am satisfied. Sometimes, we only see the effects but not the story. Good movie!",
      "total_reactions": 0,
      "user": "OfficialCarlo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "Amazing visually - I really wish I had the chance to watch this movie in theaters in 3D. I wasn't expecting too much from the plot, but I actually really liked it.  And the score by Daft Punk is really sweet. Overall, I really enjoyed Tron: Legacy.",
      "total_reactions": 0,
      "user": "DarkKnightV"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "OK, what the heck? Whats wrong with these critics!? This movie was AMAZING. I loved every thing about this movie. Great action. Great effects. Great actors. Love it. DON'T LISTEN TO THE CRITICS. WATCH IT.",
      "total_reactions": 0,
      "user": "TheChiefOfCOD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "I loved this movie... I want more!  Go see it.",
      "total_reactions": 0,
      "user": "Kalibr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "I think the critics underestimated the potential this movie has, not only is it good eye candy but it is also a good sequel to one of Disney's greatest live action sci-fi hits.",
      "total_reactions": 0,
      "user": "VentXekart"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Loved it! Garrett Hedlund, Olivia Wilde, and Jeff Bridges are all fantastic in this movie. The music was great. The 3D effects were awesome. I definitely would recommend this movie.",
      "total_reactions": 0,
      "user": "davidp1045"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "What a ride!  This movie takes you off to another world and keeps you entertained from beginning to end.  In my opinion there was no need to expand/review on old characters and plot as this is a sequel.  This was a good move, leaving more time for showing off the beauty of this incredible world.  If you've watched the first movie, you'll understand who flynn and alan are etc...  The new characters were developed well. Music is absolutely perfect for the film and helps to transport you there.  10/10 for pure cyber punk entertainment.",
      "total_reactions": 0,
      "user": "howitzer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "This movie is brilliant. Everything about but especially the visual effects and the soundtrack were quite FTW. And nickissortacool. I recommend this movie to everyone with eyes and ears.",
      "total_reactions": 0,
      "user": "nickissortacool"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "Though not as well written as the original, this sequel was quite decent. The story was mediocre, but visuals and audio were spectacular. Definitely a must see for fans of the original.",
      "total_reactions": 0,
      "user": "herrojew"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "This is a great visual specticle and the characters really come to life. The story isn't much  but  its not awful. This movie does a great  job entertaining and if yyou expect  just that,  then you will enjoy it.",
      "total_reactions": 0,
      "user": "Libra85"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "I enjoyed this movie so much!! great acting and visuals!!!  I enjoyed watching Jeff Bridges young looks... amazing!! I hope the dvd com with the first movie",
      "total_reactions": 0,
      "user": "vocecita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "I do not understand the negative reviews for this film because I LOVED it! I think that some people are forgetting who this film was made by and who it was made for. Of course the film isn't intense and or deeply intellectual it was made byt he Disney company for ALL AGES. I am a college student and went to the film with my boyfriend who is also in college and his twin brothers who are 13. All four of us enjoyed the movie and want to see it again. The visuals are breath-taking and the musical score is excellent. I wish that the critics would take a step back and reassess the movie as a whole instead of comparing it to movies which were made for completely different audiences and purposes.",
      "total_reactions": 0,
      "user": "tayfrox3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "i enjoyed this movie, the 3D really made the difference, even thou im not a real fan of tron i enjoyed this movie, the actors are good at best, the storyline to me could\"ve been better but still a good movie",
      "total_reactions": 0,
      "user": "SFN"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "Now this movie is hard for a critic like myself because the story is pretty poor... but the graphic features are good, the cast is great and i don't see why I have to have a negative comment.",
      "total_reactions": 0,
      "user": "seifer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Why must we analyze movies to death all the time.  The best movies allow people to escape for a couple of hours, to immerse you in compelling stories or worlds never seen before.   I grew up watching the original, intrigued by the vehicles and characters in the Grid.  I always hoped a sequel would be made.  Well after all these years, the second was definitely worth the wait.  The artists created an amazingly beautiful world and for 2 hours, you are immersed in Sam's journey.  Truly amazing visuals mixed with an amazing soundtrack by Daft Punk.  A must see in 3D!",
      "total_reactions": 0,
      "user": "Bourneflynn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Tron is such an amazing movie. I found pure perfection in it's overall story line. Long movie, however it was so entertaining throughout the entire movie there was never a boring part especially with all of it's amazing scenes graphics. not one thing looked fake or cheesy. I give this movie a 10 easily! must see dont hesitate!!!!!",
      "total_reactions": 0,
      "user": "brandonmoe96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "My personal favorite scene in thiz movie is the opening scene, where young Kevin Flynn was telling his son the story of inside The Grid, the digital frontier that expected to become true someday. In that scene, you could see for the first time the figure of young Jeff Bridges was created, the camera angle tried to distract our view by spinning the face direction. Only then when he stood in front of the room door, finally you would be able to see his face in full image. That was awesome. 61-year-old Jeff Bridges just looked like when he was starring in BLOWN AWAY (1994). Afterwards, the story revolves around the grown-up Sam Flynn (Garrett Hedlund) receives a new clue about the disappearance of his father twenty years ago. His investigation ends up dragging himself into cyber-universe of his father computer system creation. Thiz is a sequel from the original movie, TRON in 1982. The Director is unknown Joseph Konsinski, thiz is his first feature film for big screen. I can see some weaknesses around the plot and unnecessary dialogue, particularly in the middle of the movie. However, the high concept of how they build a whole new neon-futuristic universe is fascinating, especially the bike and the car which are very dashing and impressive. I think all Casts look cool, but only in styles, not acting. The sexy skin-tight costumes on Quorra (Olivia Wilde) and Gem (Beau Garrett) are totally jaw-dropping. Michael Sheen transforms into some sort of David Bowie character as Zuse, the charismatic night-club owner, but it is still brief and empty element is attached to the story for overall. Some of the action scenes are boosted with great fusion of electronica tracks by Daft Punk. Do you notice that those French electronic DJ have also appeared in thiz movie? Where are they? In case, if you have missed it, they are the duo masked DJ at Zuse Club. I know that thiz movie is left with tons of unanswered questions, but personally I also enjoy a new whole concept of philosophies (just like in THE MATRIX (1999)). There are so many stuffs to think about. Why do we have to chase for the perfection? While it has already there, right in front of us all these times. Since the long a time ago, I was concerned that many of young people in thiz generation were wasting hundred of hours by playing video games, while there were so many things more worth doing. Kevin Flynn is right! The only way to win thiz game is not to play it. These whole things are not just about User Vs. Program, Tron Vs. Clue, Blue Vs. Orange, or The Evil-side Vs. The Good-side. The movie simply reminds us, the biggest enemy is none others than ourself.",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "SERIOUSLY ignore then hate bandwagon that's rolling along (it seems it cool to hate this film) and go see a damn good action movie.  Obviously my score gets a +1 as it was IMAX but still think it was great.",
      "total_reactions": 0,
      "user": "Mentla"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "I don't know why this movie got such a bad critic score, but i loved this movie, it is one of my new favorite movies, i even paid to see it in 3d Twice, and i normally will only go see movies if i have a coupon or get in free. The music is awesome, i even downloaded the Daft punk album! lots of action great storyline, and Olivia Wilde is Strangly extremely attractive :p",
      "total_reactions": 0,
      "user": "Templar19"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "The movie was a spectacular show with regards to its special effects. The story is however a bit off what would have been was for Disney to let another studio handle this to increase its action sequence and improve its script. What I can say was that this movie combined with Daft Punk's score made it a truly remarkable piece of work.",
      "total_reactions": 0,
      "user": "kjmariblanca"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "The Tron Legacy maybe not a matrix caliber film, but even it is a breathtaking masterpiece with unique design and incredible spectacle. The music is clearly one of the best soundtrack. Simply phenomenal. A good hint, if you can watch it in 3D!",
      "total_reactions": 0,
      "user": "grrrgo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "I really enjoyed it. It's visually spectacular and has an awesome soundtrack by Daft Punk. Can't wait for more! Is it going to win Oscars for story and acting? Probably not. Will it win for special effects? It's got a shot.",
      "total_reactions": 0,
      "user": "NRowan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "Certainly it lacks strong characters but I'd risk to say Olivia Wilde's performance as an 'app' is somehow praise-worth. I enjoyed. The highlights are the visual effects --the colors combination fits the virtual environment and takes you into it -- and the soundtrack. Never would expect to like Daft Punk.",
      "total_reactions": 0,
      "user": "flyer_"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "If you were expecting a thought provoking and intensely deep and mind blowing story, A) you went to the wrong movie B) Did you see the original Tron? Come on now... Really? You were expecting an incredible story?",
      "total_reactions": 0,
      "user": "The_Mad_Fiddler"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "This was Great contrary to what the critic's say TRON is everything that could have been expected from a sequel and even more, Jeff Bridges retains his Flynn character masterfully and the updated technology in cinema and CGI helps set this as a masterpeice... On a side note what really blowed me away was the Amazing score by Electronica duo DAFT PUNK, the robot pair set up an amazing soundtrack mixing electro with orchestral music",
      "total_reactions": 0,
      "user": "Jripper5"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "Tron Legacy is far from a perfect movie. I found it to be a bit slow in some parts and the plot line is typical. However, the 3D and action are excellent, the characters are great, and the acting is solid. The film also has a solid conclusion. Tron is a movie that is worth checking out, especially with the cool 3D.",
      "total_reactions": 0,
      "user": "Moviebuffreview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "Definitely a solid movie. People who were dedicated to the original film will most likely be disappointed, but lets face it folks. The original was nothing more that a cult phenomena. Its a good movie with a sub par plot but decent action sequences. The evolution of the like cycles is a needed advancement and really brought up the would feel. I enjoyed it and had a good time watching it.",
      "total_reactions": 0,
      "user": "Rhinno"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "Visually this is a very entertaining movie.  I saw it first in Imax 3D and it was amazing.  I thought that it would not transition well to TV.  However, I watched it recently on TV, and while not as spectacular as on the big screen , it was still very good. The plot is pretty weak though.  Itâ",
      "total_reactions": 0,
      "user": "bikeman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Delivers what you'd expect. Mind-blowing visuals and a storyline on-par with the original -- take that as you will. In any case, I didn't blink for two hours.    If you do see TRON Legacy, I suggest a RealD performance over an IMAX 3D one, preferably on an AMC Theaters' ETX screen. This is how I viewed it after reading these two articles: -------------- 1.) http://bit.ly/dHoUAL  -------------- 2.) http://bit.ly/hIVMvw  -------------- In any case, it will just not be the same on your TV so try to see it in theaters.  -------------- Check out my taste in movies here: http://bit.ly/MyMovies",
      "total_reactions": 0,
      "user": "Efreet69"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "I loved this movie.  It felt like a movie 100% geared towards me.  The details of the TRON universe are impossible to explain in a movie such as this.  It touches on things but does not go into detail, nor can it.  Considering the world of TRON was made up by 1 person, how interesting can the world ultimately be.  The only X factor is the \"race\" of digital beings Jeff Bridges discovers but yet are all extinct but 1.  Anywho....visuals are amazing and that is what this movie is all about to be honest.  I wish there was more in terms of a universe or sequal material but there isn't and I'm ok with that.  I walked away from the movie feeling satisfied, the ending was acceptable in terms of liking the movie and being able to walk away.   I recommend to see but yet not try to \"grasp\" every detail, just accept.",
      "total_reactions": 0,
      "user": "mt2e"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2011
      },
      "score": 6,
      "text": "Eventually saw this movie, it was better than i was expected, at first for it's plot, which is quite interesting, however ending was very ''casual'' and expectable with some traditional Hollywood tricks, which slightly disappointed me, but overall this really good, with spectacular design and soundtrack, but it doesn't matters against main idea of the film-  Seeking of perfection.",
      "total_reactions": 0,
      "user": "zamzungas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "I went to the movies with my 9yr old son not knowing what was showing, he just wanted to watch something 3D. So we booked TRON: Legacy. I knew nothing about it so I went in with a fairly open mind (it was particularly open to catching up on some sleep). To my surprise I really enjoyed it. The visuals were amazing, even if the 3D wasn't up to much, and the audio blew me away. The story was pretty cool although there were a few \"how did we end up here from where we were\" moments. I don't know if it would be the same watching it at home unless I had a kick-ass home cinema system, which I don't! Really enjoyed this one.",
      "total_reactions": 0,
      "user": "help_ma_boab"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "i never thought that walt disney can make a movie like this.i never watch the old tron but this movie was superb.i realy enjoyed it.from the start to the end there is nothing could feel bad for me.the action is superb for a disney movie,though it contains only one scene with only one drop of blood.if u watch this u will feel how fascinating the music is in this movie.daft punk had done their very best in this.the visual is very good and inside the grid the cgi is stunning,forget cgi in avatar.light cycles are created miraculously.i have nothing bad to say about this movie but best in everything.",
      "total_reactions": 0,
      "user": "trish30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "This movie was an absolutely great film. It had action, suspense, and Jeff Bridges himself. Who could ask for more?  Just like the original TRON, this film has not been reviewed great by critics, but is still fantastic.",
      "total_reactions": 0,
      "user": "Cooperjct"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "I'll be the first to tell you that the acting, plot, and screenwriting in TRON are nothing to give awards about, but I still enjoyed the movie immensely. Here's why- IT'S FUN! This movie is an absolute joy to watch. The visual effects are astounding; the computer-generated landscapes breathtaking. The action scenes are exciting and the plot is just absurd enough to keep you excited. A real joy to watch, just don't think about it too much. Also, the soundtrack by Daft Punk is perfection. I hope to see more cinematic work from them in the future.",
      "total_reactions": 0,
      "user": "harlanpepper"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "Fantastic as the visuals are, the story has some big logic holes (Why would the son wait till he's nearly 30 to look for his dad at his old arcade?) as is the movie is a bit short sighted at the goals of what the fans of the original wanted to see. It was good to see a lot of the original cast showing up for thier old roles, but the ending left me cold much the way matrix 3 did. Thankfully the plot left plenty of openings for a sequel.",
      "total_reactions": 0,
      "user": "HighwayUK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "Yes, the story is pedestrian at best. If you can forgive this one failure and enjoy *every* other aspect of the movie, you will find it to be a really entertaining experience. Personally I love me some jeff bridges, and I love me some daft punk, so going into this I was feeling very forgiving. The aesthetics and lighting are just dazzling and the sound track will rock your socks off, so if nothing else just go into it as an audio-visual treat and enjoy!",
      "total_reactions": 0,
      "user": "Shyfox"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "The film to be frank was a good one although i didnt understand the plot until near the end i enjoyed it it would have got an 9/10 or 10/10 but the ending lacked something",
      "total_reactions": 0,
      "user": "callumcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "Another fantastic film from disney, TRON is, and will remain, one of the best movies i have ever seen, the concept has been brought to life in a new way with twists to thrill even watchers of the 60's version will love.",
      "total_reactions": 0,
      "user": "garndass"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "I really enjoyed TRON-Legacy, perhaps not so much because of the story, but the fact that the visuals and music were stunning. The story was pretty normal and rather clichÃ©d; and as stated in previous reviews actually rather weak. However, the fact that there was the fantastic soundtrack by the French dance geniuses Daft Punk which were so fantastically intertwined with superb visuals that really made the film stand out. I was perhaps slightly dissapointed with some of the rather lacklustre acting performances, but hey, when the visuals and soundtrack are as brilliant as that, who gives a ****",
      "total_reactions": 0,
      "user": "Harry184"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "Superbly entertaining! A visual event that pulled me in quick and kept me there the whole time. For those that do not know much of the Tron history, this film does well with educating a new audience while also giving some deserved flavor to old time fans. Performances all around are excellent with Bridges stealing the show!",
      "total_reactions": 0,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "It does not surprise me the subtle nuance of Tron: Legacy is lost on this new generation of \"critics\". The subtle elegance of Tron Legacy may be lost on kids of this generation who did not grow up into a digital world but, rather, were born into it after it was already here. As a result I expect this sequel is directed more towards my generation rather than the kids who were born long after Tron hit the big screen.",
      "total_reactions": 0,
      "user": "catherder"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "Whilst I am not a seasoned TRON fan like the many who were expecting to be blown away with this one, I personally enjoyed it. A decent cast, plot, and magnificent visual effects were enough for me to feel relatively satisfied by the end of it. The experience I felt from watching the film was insightful into the future of the Information Age we live in. The soundtrack provided by Daft Punk was also quite groovy and fitting.",
      "total_reactions": 0,
      "user": "Alexander_N"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "This movie is a spectacle to look at; in Blu-Ray, you feel like you're on the Grid, neon skintight suit and all. however, its awkward plot is a whole other story; They tried to shoehorn in too much and when they realized it was too much, they took it away instantly (best examples; the character of Zuse, with about 15 minutes of screentime until his deresolution, and the revelation that rinzler is Tron, until he's thrown into an abyss). as a fan of the original, i found it disappointing to not be able to see what was going on at ENCOM after Flynn's disappearance, 20 years of history literally discarded. The most awkward point of all, when kevin flynn literally explodes to destroy clu and allow his son and quorra to escape to the real world, they both act happy and as if his death doesnt matter. The best part about this movie is the soundtrack; Daft Punk did an amazing job of bringing the Grid to life with their score, and must be commended and noticed.",
      "total_reactions": 0,
      "user": "Pwnz0r3d"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2011
      },
      "score": 7,
      "text": "A visually captivating film with a high energy revolutionary score. And that's about it really. But those two aspects of the movie themselves make it worthwhile. The story is without imagination and energy and the actors, although very effective at times, ultimately seem like an afterthought. The problem is that there's nothing new to this story, everything is fairly predictable. However, if you ignore that and simply be absorbed by the visuals, score and sound, you have a very imaginative ride.",
      "total_reactions": 0,
      "user": "AVCITY"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "All style, no substance. Impressive in the audio/visual department, with little going on elsewhere. When it finishes recreating scenes from the 1982 film, it's bland, predictable and boring.",
      "total_reactions": 0,
      "user": "AlienSpaceBats"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "Predictable, cliche, dull, uneventful, contrived by the numbers cash grab. Some pretty visuals. Decent acting though not outstanding. Nightmarish CGI on Jeff Bridges face. Gets the most mileage out of playing up nostalgia but that wears thin about half way through.",
      "total_reactions": 0,
      "user": "LJHayes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "It's funny because every flaw the original Tron had, this movie corrects. However, almost all character and charm from the first film is lost in this one. Now don't get me wrong, I am not a fan of the original. The charm and originality of the setting and concept do not do enough to compensate for the terrible acting, mediocre effects, cheesy dialogue, and prolonged plot. This movie, while not so original, compensates for that by actually having pretty decent acting, amazing effects, a plot that isn't dull and boring, and is just in general a much more entertaining movie. It's only real flaw for me was that it left behind the concept of the personalities of the computer programs and was essentially just another modern science fiction movie with cool effects. The world feels almost more alien than computer. I also thought they could've expanded on the ending quite a bit. The movie ends with them talking about \"changing the world\" but no method for this is explained in any way. I assume they left it open like that in order to whore out the franchise in the ensuing years with sequels but I'm a believer that movies should be able to stand alone.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "I haven't seen the original TRON movie, and I'm wondering if maybe that would have made some details a bit clearer.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "The visuals of the film look great (and it makes good use of 3D as well), The acting is solid, but I think the plot, which was sort of stupid, definently hurt the value of the film quite a bit. However, I enjoyed watching it so much that I can look past that. Definently underrated by critics imo.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "Without comparing it to the original, Tron: Legacy is a fun movie. There is action all throughout paired with a cool soundtrack. the story is short and is done with descent acting. Not bad.",
      "total_reactions": 0,
      "user": "AlvaradoKTA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "TRON: Legacy, a film like this, I've waited years for. The storyline was a bit rushed but the dazzling visuals and soundtrack more than made up for it. Daft Punk did a good job on the soundtrack and the special effects team did a more than amazing job. Great work.",
      "total_reactions": 0,
      "user": "MaverickDVNT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "This movie lacked a lot of things. I compared this movie to some of the other scifi's and realized that it felt different, that there was something this compared to none of the others because it had a wholly different theme and focus. This movie was in every way a movie about a dystopian future, though it took place in a modern setting. What was missing was a lot of the cynicism and despair that accompanies the dark futures of the other films. Instead it ended with hope and reconciliation. It did more than forecast doom from a range of questionable trends, it examined without genuflection or apology the contrast between an attempt to achieve perfection according to what might well have represented a thousand philosophies or ideals, and the wild universe of the world we can all associate with. Here we find the same misgivings expressed with the vicissitudes of death, age and illness but counters all that bitterness with what ought to be lamented which is being lost right now--family. What this movie does further is divorce a potentially perfect society from lewdness and depravity of lifestyle, the real cause of misery in life, or at least doesn't focus on it but gives it due perspective by wrangling it in with evil in general. That is not found in most of these films because the makers themselves cannot divorce themselves from their lifestyle. This 'divorce' is that which, if missing or failed, will like divorce shred society after family is murdered. So here we see the problem and the solution in a single cinematic statement. Here we see a dividing line because this movie or this theme at least is despised by those that can't stand what preserves a family, morality, or praised for being a somewhat creative if simple champion of basic decency. Books and colleges, blogs and intellectuals aren't quoted for it, so we see what becomes the source of concern, the reason for dark tomorrows in movies and the woes forecast in literature--despair not because the future is bleak, but because no one wants to take responsibility over their own lives. Interesting that filth has become an all-too prevalent fixture in media, the self-defeating contagion that can't spare its creator any more than such a creator can spare his audience the illness of their own mind. Why should it when the mind in question cannot keep itself from lewdness? Disney needs to wear laurels for this relatively good and decent film as well as their vision, but especially for holding up the family and all the traditional and time-honored principles socketted in its crown and scepter as the guardian and steward for the future. So what's your status in that kingdom?",
      "total_reactions": 0,
      "user": "xgambit"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "The idea is original, but the movie is painful.",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "Only draws attention by its great visuals, otherwise the story is not amazing the characters are shallow and monotonous plot.    .",
      "total_reactions": 0,
      "user": "Iky009"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "Visually stunning, but it's second act and climax fail to live up to the opening 25 minutes.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "I thought this was great! 2010 was a good year for Disney...Toy Story 3, Wonderland, Secretariat, Tangled, Tron Legacy. They had alot on their plate, and Tron Legacy did not disappoint!",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "I waited 28 years to see a sequel.  The light cycle scene was better than expected, but then it is 28 years later.  I've seen several complaints about \"dude\" and \"radical\" being used, truth is that if you were trapped in the system since the 1980's, your vocabulary would be the same.  Visually, overall, it was spectacular.  The storyline could have been better, but it's a 28 year in waiting Disney movie sequel.  The performances were good.  Having Daft Punk do the music score, and the timing was excellent.  My only real complaint is that the movies namesake didn't have more screen time.  Worth buying.  My copy is going up beside the 20th anniversary edition of the first Tron.",
      "total_reactions": 0,
      "user": "Valkyrin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "Tron: Legacy is visually incredible. The look of the whole thing is amazing. Disney was really able to pull off the futuristic-esque look for this movie. I thought the light cycles were awesome. They were probably my favorite part of the movie. However, I felt that the plot was somewhat confusing. I was having a bit of trouble following it. Overall, this movie is visually stunning, but the story and plot fall flat of what I had hoped for.",
      "total_reactions": 0,
      "user": "molemaster43"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Better then the original to me. Better Effects, Better Cast/Acting, Better Story. I say this film was also one of the best in 2010. The plot is fairly decent, more interesting then the original. I say watch this if your looking for something fun, but don't look too deep into the plot.",
      "total_reactions": 0,
      "user": "MarkMusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "Really gets me when people over analyse something they should just sit back and enjoy. People talk about the story and the characters etc etc. It was simple enough to understand but had enough dept to keep you interested. So moving on, even if you didn't like the story look at every frame and listen to every note! AMAZING! I walked out thinking I have never experienced anything like this in my life. I could seriously print any frame in this film and it would look amazing. Just for the music and the style id give it a 10!",
      "total_reactions": 0,
      "user": "LuiG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "it freaking awesome get it now",
      "total_reactions": 0,
      "user": "MrThehammer171"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "Look all that i got to say after 4 well going to five years since it came out all i have to say is the movie is flawed, but enjoyable, from the scenery that takes place in the grid, something that was recreated from a computer that ran 2mb per minute and im saying in the making of the film, this was the biggest part that was great in my opinion, the grid is so far the best cgi created image in a scale as half of the map of a new RPG most recent The Witcher 3: Wild Hunt... I'm going off topic here, the thing is sequels that got us waiting for years is a bad thing, if handled badly, direction was good, the cast was average, but it lacked one thing the title character TRON, uptly named Rinzler, and how did he came to be RInzler, TRON Uprising was gonna answer the question, but sadly it got cancelled, like recently TRON 3, but why?, call it TRON 3, after all Tron died in the grid Presumed so as the rest of the programs, Disney now profiting for their new Cows to milk like the MCU, and the new SWCU(yes not a joke that's the Star Wars Universe name now.) And also the soundtrack by Daft Punk, Groing up with some songs that i heard from movies got me into some Gernes as Alt. Rock, Electronic, Orchestra, Daft Punk fuses their base Electronica w/h some Orchestra, and it sounded great, i hadnt heard it recently, but the most tense songs was track 4, the characters in this movie we see the return of two base characters(clu and rinzler doesnt count even rinzler is tron, and clu is it's second revision, if you want to see the fate of Clu 1.0 watch TRON) Clu 2.0 is the overseer of the grid naming himself the ruler, filled with an ego of perfection, and organizing the programs with each sector and punishing them with execution, or to play the \"Games\" which was the original program way of an unwanted entrance or an easy legal execution.(we'll go into it later) Sam Flynn the son of the dissapeared Kevin Flynn, he was a rash and uneasy character to \"like\" not in a bad way, he is an interesting character but we don't know much of him or the gap from (1989 - 2010) he mentioned a few but not to win the audience over. Quora the last remaining iso(again covering that later) she is the rebel, or most likely the renegade trained by Flynn (watch Uprising it is a good show with a good cast). Kevin Flynn the man who created clu he is a user like Sam but he is the first user to get into the grid (see TRON it is a good movie even if it's dated it is still a good movie) he tried to make the perfect system where programs and isos can be together where there is peace, who got obsesed with the grid after Maria's Death in '85. the extras the programs who inhabit the world of the grid are barely seen, in most cases fights but the interaction on each are lifeless, the isos mostly Zeus who repaired himself after he suffered an attack (watch a walkthrough of TRON Evolution or buy it used on gamestop)  the army of clu are lifeless dolls who have no personallity with good reason, Clu has mannage to reprogram most of the programs that were derezzed or rectafied and they are sent to the reprograming center to be a part of clu's army, the humans these lacked personallity except Adam Bradly the man who created TRON who became the CEO of encom after the dissapearence of Flynn, and the extras as well lacked even the son of the former CEO of encom lacked any emotion he was mostly dressed like a hipster but a smart programer, sorta like is father. the setting and plot here were at the weakest point of the film how they handled the plot, the story wasn't well placed as it was a puddle who dried up after wards it had excitment curiosity and a lot of action, the down fall was the hype, like any other, the setting gets merits it is dark and what i liked about it were the new locals and the designs of the programs, not the suit, i mean how the programs look and talk some may look in a state of despair and some look decimated with the cubic scars or literall depth how should i say this they scared me and the derezzing and they'er cry after that also gave me goosbumps, and the discs the new disks looks slick and more agile with cqc or from far distance and they come back like Captain Americas Sheild or the original Light disk, then there's the vehicles like the redesigned light bikes and they looked great so as the EMCOM1 bike, the Redesigned Recognizer, and also the Light Runner. After that lets go into it's message the ISOs caused fear to the programs as did humans when they discovered new lands the isos didnt know what to do the code they had would shape humanity as we know it, but Clu fell to fear and fear got him to extinct the isos \"killing\" tron (Uprising watch it now) and restoring the grid were most of the critical points and that there will be no questions asked i give TRON: Legacy a total score of 7, i like this movie but i cant hate it Not like ROTF but tron gave me a fun experience and so others and if you want to watch it is your choice END OF LINE.",
      "total_reactions": 0,
      "user": "gambit21xd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "A very advanced film in visuals, which dazzle and give you an eyegasm.  The story isn't as powerful and is hard to follow at times, but overall you get the sense of what is going on and what will happen.  It is a well acted film and that soundtrack by Daft Punk is something everyone can enjoy!   This is a great film!",
      "total_reactions": 0,
      "user": "DibbHansen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "This movie gets a 1 for me only because of the visuals and the music.  I torrented this because I had a feeling it wouldn't be worth my money and boy was I right.  A ridiculous plot with plot holes you could drive a tank through, some truly terrible performances and the title character being a bad guy for most of the film (not that you would even notice unless you were really paying attention) before changing sides for no discernable reason to help the good guys win.  This film is horrible and should not be watched by anyone.",
      "total_reactions": 0,
      "user": "bravesermormont"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "\"You can't steal something that's designed to be given away free.\"",
      "total_reactions": 0,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2014
      },
      "score": 6,
      "text": "The difference between this and the revolutionary predecessor is the \"revolutionary\". 'Tron' was a feat of computer effects, that even John Lasseter said that 'Toy Story' would be non-existent without 'Tron'. The effects here are impressive, but also common and stale. The story has stale acting from a majority of the cast, and a story lacking surprise and motivation to watch it.. Jeff Bridges, being a great actor, has an emotional depth to him, and I was surprised by Olivia Wilde. The story is what has to make the movie, unfortunately, and it didn't hit me.",
      "total_reactions": 0,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "It's funny how Jeff Bridges played the title role of Kevin Flynn in the original, and he still plays the same role in the new one, 30 years later. This time ,Kevin's son goes into the game. While this movie is a stretch, it's one saving grace is some pretty cool CGI and special effects.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2016
      },
      "score": 5,
      "text": "Considering the gigantic cult following that the first \"Tron\" film received, it's no shock that people wanted a sequel. Considering that the first film didn't do particularly well in the box office, it's no shock that it took many years and a lot of fan support to get the sequel made. Almost 30 years later, \"Tron\" is back with \"Tron: Legacy.\" And is the return worth it? Well, it depends on what you are expecting. \"Tron: Legacy\" is very obviously beautiful: it's clear that a lot of time was put into making the visuals as beautiful as possible, and the effort shows. That said, there's almost no substance to the film whatsoever, and most of your love for the film will be for the pretty lights and the visuals. On top of that, it's unfortunately not that fun. I'd honestly say it's kinda boring. Whether or not you get enjoyment out of this film essentially lives and dies with how much you love visuals. It's the perfect film to show off your home theater setup with, but all in all, I can only recommend it if you absolutely love bright lights and don't go in expecting any kind of substance whatsoever. If you're fine with \"style over substance\" films, \"Tron: Legacy\" should be perfect for you, but if you want a decent story and memorable characters, there are far more enticing options out there.",
      "total_reactions": 0,
      "user": "FreedomFighters"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "TRON ecstasy.",
      "total_reactions": 0,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "In my opinion,  this a great movie!  It has a great story,  and the effects and the fake lights are amazing!  I saw it in 3d,  and it was one of my favorite movies I have ever seen!  I would definitely get this movie on dvd or blueray!",
      "total_reactions": 0,
      "user": "Flipsternip"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2014
      },
      "score": 6,
      "text": "This movie could of had so much potential, so much to show, so much to explore...but came in short.",
      "total_reactions": 0,
      "user": "MetaCryptic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "Tron is a hell of a movie! Now I know this ain't everybody's cup of tea.  It is a movie with a unique audience.  I don't know how i fell into that audience as im not your average syfi guy - im here nonetheless. The story line is fantastic I thoroughly enjoyed every second of it. The idea is also brilliant and jeff bridges was gold. It's one of the first movies I've watched were you know it will form part of a trilogy at the very least.  The makers have planted enough seeds that will make the next instalment very meaningful.  This is probably one for the guys, the girls will be bored in the first 15mins. Daft Punks music suited it well too.",
      "total_reactions": 0,
      "user": "Ozy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2014
      },
      "score": 5,
      "text": "Tron Legacy is the sequel to the 1982 Tron.This movie look marvelous and sounds amazing.You haven't lived if you haven't seen this movie yet.The acting isn't bad nor the script,they are okay.",
      "total_reactions": 0,
      "user": "DenisManu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "TRON: Legacy is one of the most visually striking films I have ever seen, based on the popular video game from the 80's, this does a perfect representation of the game. The story is so good you could literally grasp it in the palm of your hand. Now as always, Jeff Bridges gives a great performance as CLU and his recurring role as Kevin Flynn. I wasn't impressed with the performance of Garrett Hedlund who played Sam Flynn, to me was just a little too stale, he said things that excessively used all the time with give me a headache. Then there's the beautiful Olivia Wilde who's performance as Quorra was incredible, she never had one flaw but to me she was one of the films perfect characters. Disney had announced that they are coming out with another TRON films sooner are later, but TRON: Legacy was a very exciting thrill ride.",
      "total_reactions": 0,
      "user": "Th3GreenHorne7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2015
      },
      "score": 6,
      "text": "Tron Legacy met these purposes: special effects, production design , the argument distinguishes that of 33 years ago , but there is a little thing that does not fit but for me this movie is good.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2015
      },
      "score": 3,
      "text": "This movie is atrocious. Everything in it either strains the eyes, or is repeated over and over again to drive the point into the little kiddies' brains who haven't even seen the original. Do we really need to hear over and over again that this or that happened? The plot is hard to follow and doesn't make any sense. I continue seeing people say that the special effects are good, but with a budget of $170 million dollars, I think they could do better than L.E.D. lights. The only good thing I can say about it is that the soundtrack is amazing. I can honestly say I would listen to it in my free time. This movie is insulting to the fans of the original. It's like a giant middle finger from Disney.",
      "total_reactions": 0,
      "user": "MelloJello"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2016
      },
      "score": 6,
      "text": "TRON: Legacy doesn't live up by its name. Instead only being enjoyable to fans of the franchise and most moviegoers out there. This movie could try to entertain me a bit better though.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "Really enjoyed this movie. Love how they manage to bring back Jeff Bridges character and tie the first movie into this one. Also visually beautiful.",
      "total_reactions": 0,
      "user": "choomtabi31"
    }
  ]
}